[
  {
    "id": 57988513,
    "published": 1770966059000,
    "title": "Shiba Inu At Risk of 70% Decline? Price Breaks Below Parallel Channel",
    "body": "An analyst has pointed out how Shiba Inu’s break below the support line of a Parallel Channel could open the door to a target of $0.00000138. Shiba Inu Has Fallen Under Parallel Channel Support In a new post on X, analyst Ali Martinez has shared a technical analysis (TA) pattern that Shiba Inu has seemingly broken out of recently. The pattern in question is a “Parallel Channel,” which is a type of consolidation channel that forms whenever an asset’s price trades between two parallel trendlines. Related Reading: Bitcoin Social Sentiment Stays Bearish Even As Price Recovers From $60,000 Drop The upper level of the pattern is likely to be a source of resistance, while the lower one that of support. If the price manages to escape either of these boundaries, then it may be likely to experience a sustained move in that direction. Parallel Channels come in a few variants. Channels that have their lines sloped upward are known as Ascending Channels, while those with trendlines pointing down are called Descending Channels. In the context of the current topic, the third and simplest type of Parallel Channels is of interest: a channel that is parallel to the time-axis. This type of Parallel Channel corresponds to a phase of true sideways movement in the asset. Now, here is the chart shared by Martinez that shows the Parallel Channel that the weekly price of Shiba Inu was stuck inside for the last few years: As displayed in the above graph, the 7-day price of Shiba Inu retested the upper level of the Parallel Channel twice in 2024, but each time, the memecoin found rejection. During 2025, the cryptocurrency mostly consolidated near the midline of the channel, but the decline during the last quarter of the year meant that the coin plummeted toward the support line. With bearish price action continuing in 2026, the asset retested the level, but it failed to find a rebound and slipped right past it. This could be a potential sign that the memecoin is now breaking under the channel. As mentioned before, Parallel Channel breakouts can lead to sustained moves in the direction of the break. Such moves may end up being of the same length as the height of the channel. Based on this, Martinez has highlighted the $0.00000138 level, noting that the breakout could have opened the door to it. From the current SHIB price, this level is situated around 77% lower. Related Reading: Ethereum Whale Selloff Continues As Supply Share Drops Under 75% It now remains to be seen how Shiba Inu will develop in the near future, considering this development in its weekly chart. SHIB Price At the time of writing, Shiba Inu is floating around $0.00000615, down 2% over the last seven days. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Shiba Inu Coin|SHIB|Shiba Inu|Shiba Inu Parallel Channel|Shiba Inu Price|SHIBUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 44,
        "NAME": "SHIB",
        "CATEGORY": "SHIB"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57988898,
    "published": 1770967119000,
    "title": "Bitcoin Drops To $65,000 As Crypto Sentiment Remains Dire",
    "body": "Bitcoin prices fell on Thursday, February 12, suffering losses as a popular gauge of crypto sentiment flirted with all-time lows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57990940,
    "published": 1770973476000,
    "title": "Bitcoin ETFs bleed $410M as Standard Chartered slashes BTC target",
    "body": "US spot Bitcoin ETFs are on track for a fourth consecutive week of losses as Standard Chartered cut its 2026 Bitcoin target to $100,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57990788,
    "published": 1770973222000,
    "title": "Standard Chartered Lowers Bitcoin Forecast: Predicts Price Dive To $50,000 Before Rebound",
    "body": "Standard Chartered lowered its long-term outlook for Bitcoin (BTC) for the second time in less than three months as the cryptocurrency market appears to have entered a new bearish cycle. With the leading cryptocurrency currently consolidating below the key $70,000 level, the bank now warns that the asset could fall as low as $50,000 before staging a recovery. Standard Chartered Cuts Bitcoin Target to $100,000 In a note published Thursday, Geoff Kendrick, Standard Chartered’s head of digital assets research, said the bank now expects Bitcoin to reach $100,000 by the end of 2026. The latest figure marks a significant reduction from its previous $150,000 projection for BTC. The revision follows an earlier downgrade in December, when the bank cut its target from an ambitious $300,000. Related Reading: Is Bitcoin Already Pricing A US Recession? Analyst Sees Major Risk‑Reward Setup According to Bloomberg’s report on the matter, the bank’s more cautious stance reflects a combination of weakening macroeconomic conditions and shifting investor behavior, especially over the past month’s downtrend. The leading cryptocurrency has declined more than 40% from its October peak toward current trading prices of around $67,160, while the US spot Bitcoin exchange‑traded funds (ETFs) sector has seen nearly $8 billion in net outflows. Kendrick noted that slowing US economic momentum and reduced expectations for Federal Reserve (Fed) rate cuts have weighed heavily on digital assets. In particular, declining ETF holdings have removed what had been a critical source of demand during previous rallies. The interest‑rate environment remains a central concern. Markets have pushed back expectations for Federal Reserve easing, with investors now anticipating that the first rate cut may come later in the year than previously thought. Kendrick also pointed to uncertainty surrounding future Federal Reserve leadership as an additional factor contributing to Bitcoin caution. The bank warned that deteriorating macro conditions and the risk of further investor capitulation could continue to pressure prices in the near term. Ethereum Could Drop To $1,400 Despite the more conservative Bitcoin forecasts, Standard Chartered emphasized that the current downturn appears more orderly than previous crypto market collapses. Kendrick highlighted that on‑chain activity data continues to show improvement, suggesting that underlying network usage remains healthy. Related Reading: UNI Rallies 10% As BlackRock Brings Treasury‑Backed BUIDL Token To Uniswap Moreover, the bank’s head of research highlighted that the market has not experienced the type of high‑profile platform failures that defined the 2022 cycle, when the collapses of Terra/Luna and FTX triggered widespread contagion. The bank also revised its outlook for Ethereum (ETH). Its 2026 price target for the second‑largest cryptocurrency was reduced to $4,000 from $7,500. Before reaching that level, analysts expect Ether could fall to around $1,400. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin chart|bitcoin forecast|Bitcoin news|bitcoin price|bitcoin technical analysis|btc|BTC news|BTCUSDT|crypto market|crypto news|cryptocurrency|ETH|ethereum|ethereum news|ethereum price|Standard Chartered Bitcoin|Standard Chartered new",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57991188,
    "published": 1770974306000,
    "title": "Aave Labs seeks $50M grant to redirect product revenue to DAO",
    "body": "Some community members questioned the size of the $50 million package and warned that the proposed AAVE token grant could concentrate voting power.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 2,
        "NAME": "AAVE",
        "CATEGORY": "AAVE"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57991993,
    "published": 1770976853000,
    "title": "Hedera’s (HBAR) $0.09 Support Intact, Revenue Decline Threatens Upside Momentum",
    "body": "Hedera (HBAR) has traded around the $0.09 mark, testing a key technical support level, even as broader price momentum remains subdued. Despite occasional short-term bounces and technical patterns suggesting relief rallies, ongoing declines in network revenue and ecosystem metrics are weighing on investor confidence. Related Reading: Bitcoin May Already Be Entering Crypto Winter, Researchers Warn According to live market data, HBAR is trading near $0.094, with a market capitalization of $3.9 billion and a 24-hour trading volume that reflects modest activity at current price levels. HBAR's price trends to the downside on the daily chart. Source: HBARUSD on Tradingview Support Holds, but Trend Weakness Persists Over recent weeks, HBAR’s price action has been largely corrective, with the token moving in a range near its October lows. Analysts tracking the charts note that while the $0.088–$0.09 zone continues to act as support, the broader trend remains bearish as long as HBAR trades below key resistance levels at $0.126-$0.177. Some market participants have flagged a potential inverse head-and-shoulders pattern forming on shorter-term timeframes, implying a breakout above roughly $0.094–$0.096 could open the door to moves toward $0.12. However, this scenario requires clear confirmation amid limited buying momentum. Technical indicators, such as the relative strength index (RSI), are near oversold levels, but momentum oscillators, such as MACD, remain skewed to the downside. Traders note that until HBAR regains and sustains a move above its 20-day, 50-day, and longer-term moving averages, the structural bias will likely remain negative. Ecosystem Metrics and Revenue Trends Could Influence Hedera’s (HBAR) Price Action Beyond price charts, on-chain ecosystem data suggests cooling activity. Total value locked (TVL) in Hedera’s decentralized finance layer has dropped significantly from mid-2025 highs, and weekly decentralized application revenue has declined sharply over recent weeks. Institutional interest in HBAR-linked products, such as spot exchange-traded funds, has shown limited recent inflows, in contrast to stronger demand seen in other altcoin ETFs. A lack of fresh capital from larger participants could further temper price advances if broader market uncertainty persists. Related Reading: Dogecoin Is Now In The ‘Maximum Opportunity / Minimum Risk’ Zone: Crypto Analyst Analysts now see a near-term range-bound outlook for HBAR, with downside risk toward support levels around the low $0.08s if selling pressure intensifies. A sustained breakout above immediate resistance would be needed to shift sentiment and technical bias. Cover image from ChatGPT, HBARUSD chart on Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|HBAR|HBAR Price|HBARUSD|Hedera",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 81,
        "NAME": "HBAR",
        "CATEGORY": "HBAR"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57991936,
    "published": 1770976492000,
    "title": "Boerse Stuttgart Digital, Tradias agree merger to build European crypto hub",
    "body": "Boerse Stuttgart will merge its crypto arm with Tradias, creating a regulated European crypto unit providing services in trading, custody, staking and tokenized assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57992915,
    "published": 1770980119000,
    "title": "22 Bitcoin worth $1.5M vanish from Seoul police custody",
    "body": "The loss was uncovered during an audit launched after a separate 320 Bitcoin custody failure, raising fresh concerns over digital asset management by authorities.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57993551,
    "published": 1770982192000,
    "title": "Crypto CEO gets 20 years for $200M Bitcoin Ponzi scheme",
    "body": "A federal judge sentenced PGI founder Ramil Palafox to 20 years in prison for running a Bitcoin Ponzi scheme that raised over $200 million from customers between 2019 and 2021.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57994345,
    "published": 1770984787000,
    "title": "Ark Invest buys $18 million of crypto stocks including 10th consecutive Bullish purchase",
    "body": "Ark also bought $12 million worth of crypto-friendly investment platform Robinhood and $4 million worth of ether treasury firm Bitmine Immersion Technologies.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|ARK Invest|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57995290,
    "published": 1770987637000,
    "title": "Bitcoin On-Chain Heatmap Shows All Major Metrics In The Red",
    "body": "Some key on-chain indicators are flashing a red signal for Bitcoin, suggesting bearish market conditions for the number one cryptocurrency. Major On-Chain Indicators Are In Red Zone For Bitcoin In a new post on X, CryptoQuant author Darkfrost has talked about what on-chain indicators are suggesting for the current Bitcoin market. The analyst has shared a heatmap that shows the signals 10 metrics related to the cryptocurrency are flashing right now. The indicators in the graph are all key on-chain metrics covering different dimensions of the network. For example, the MVRV Z-Score deals with general investor profitability, while the Trader Realized Price and Trader On-chain Profit Margin specifically track the profit-loss status of the short-term holders. Related Reading: Bitcoin Social Sentiment Stays Bearish Even As Price Recovers From $60,000 Drop All the indicators in the heatmap are currently giving a red signal, implying conditions aren’t favorable for a bull market. “As long as that remains the case, it is hard to imagine BTC reaching new highs in the short term,” noted Darkfrost. Red has spread on the heatmap as the cryptocurrency’s price has gone through its bearish price action. A couple of metrics, however, have been bearish since even before the market downturn. The indicators in question are the Inter-Exchange Flow Pulse and CryptoQuant Network Activity Index. The former of these tracks the flows occurring between spot and derivatives exchanges. This metric being bearish means that there is a lack of speculative push in the market. From the chart, it’s visible that the Inter-Exchange Flow Pulse went red during the drawdown phase from the first half of 2025 and has remained so since then. The CryptoQuant Network Activity Index, gauging the transaction activity occurring on the Bitcoin blockchain, left the bull territory in late 2024. Activity on the network has since mostly maintained at bearish levels, except for a few brief flashes. Most of the other metrics didn’t turn red until the November 2025 price decline. The last metric to go red was the Trader On-Chain Profit Margin, which was green during the January recovery rally, but gave the bear signal after the most recent price plunge. In some other news, the Bitcoin short-term holders have shown signs of loss-taking recently, as CryptoQuant community analyst Maartunn has highlighted in an X post. The short-term holder cohort includes the BTC investors who purchased their coins during the past 155 days. Related Reading: Ethereum Whale Selloff Continues As Supply Share Drops Under 75% As the below chart shows, these holders have ramped up their loss deposits to exchanges recently. Investors usually transfer their tokens to centralized exchanges when they want to participate in selling, so these loss deposits can be a sign that some short-term holders are capitulating. BTC Price At the time of writing, Bitcoin is trading around $65,300, down more than 2% in the last week. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin On-Chain Map|Bitcoin on-chain metrics|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 128,
        "NAME": "QNT",
        "CATEGORY": "QNT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57996039,
    "published": 1770989831000,
    "title": "Three arrested after break-in at Binance France executive home: Report",
    "body": "French police arrested three suspects after a break-in targeting a Binance France executive, RTL reported. Binance has confirmed a home invasion involving an employee.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57995976,
    "published": 1770989674000,
    "title": "Bitcoin ETFs Shed $410M Amid BTC's Ongoing Slump",
    "body": "U.S. spot Bitcoin ETFs saw $410M in outflows Thursday as institutional profit-taking and macro hedging create a \"liquidity mirage.\"",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57996539,
    "published": 1770991246000,
    "title": "Ethereum $1,900 Retest Could Decide Next Major Move – Is ETH Preparing For New Lows?",
    "body": "As most of the crypto market retests crucial levels, Ethereum (ETH) is attempting to reclaim a major horizontal area. Some market observers have warned that cryptocurrency could fall to new lows if the price doesn’t bounce soon. Related Reading: LayerZero (ZRO) Soars 40% Amid Zero Blockchain Debut, Major Institutional Backing Ethereum Weekly Close On Sight On Thursday, Ethereum dropped 1.4% to retest a key area for the second consecutive day. After hitting a 10-month low of $1,747, the King of Altcoins bounced more than 15% to trade between $2,000 and $2,150 over the past few days. However, the second-largest cryptocurrency by market cap failed to hold the crucial $2,000 horizontal barrier on Wednesday and tested the $1,900 mark for the first time in a week. After attempting to reclaim the key psychological level in the early hours of Thursday, Ethereum was rejected toward the recent lows, briefly falling below it. Analyst Ted Pillows highlighted the importance of ETH’s current zone, as it has previously triggered major moves. To him, if the altcoin fails to reclaim the $2,000 area in the coming days, a full retrace toward the recent lows should be expected soon. Similarly, market observer Crypto Busy noted that the cryptocurrency is currently trading above a major long-term support. According to the post, the recent correction has sent Ethereum toward a three-year rising support line, which “will decide the next big move.” The analyst warned that “If the trendline breaks with strong weekly closes below $1,900, the structure weakens.” Therefore, ETH must hold its current levels in the coming days to avoid a weekly close below this level. Otherwise, its price could drop “into the next liquidity pockets around $1,600 and possibly $1,300, where the next historical support zones exist.” Is ETH’s ‘Real’ Bull Market Two Years Away? Trader AlejandroXBT shared a potential macro-outlook for Ethereum that suggests the cryptocurrency could still see another major shakeout: My thesis is that the major bullish move that began around 2019–2020 has transitioned into a large and prolonged macro correction, and that Ethereum has been consolidating within this broader corrective structure ever since. He outlined four phases for the macro structure: the pump, the correction, the shakeout, and the moon. The initial phase, which occurred between 2019 and 2021, marked “the true impulsive bullish move,” with strong trend expansion and increasing momentum. According to the market observer, the strong rally that followed the 2022 bear market appears to be a “counter-trend move within a broader corrective range” rather than a renewed bull market and the start of a new long-term cycle. As he explained, ETH’s range-bound behavior signals distribution and consolidation instead of continuation. “From this perspective, the apparent bull market that developed within the correction can be interpreted as a dead cat bounce, a technically strong bounce occurring inside a larger corrective structure,” he affirmed. Related Reading: XRP Positioned For Major Structure Shift As Price Tests Critical Level Therefore, the current macro structure would suggest that a final shakeout phase could “still be required to fully reset sentiment and liquidity before Ethereum can transition into a new impulsive bullish cycle.” Based on this, the trader anticipated a final liquidity-driven move to the downside in the coming months, followed by “the moon” phase, potentially next year, when “the structure suggests the conditions for a true long-term bullish continuation, with price discovery and expansion well beyond previous highs.” Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto analyst|crypto market correction|Crypto Market Recovery|Crypto trader|ETH|ETH correction|ethereum|Ethereum bearish prediction|Ethereum breakdown|ethereum price|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57997326,
    "published": 1770992904000,
    "title": "Bitcoin Falling to $60,000 Could Spark Fresh Liquidation Spiral",
    "body": "As Bitcoin struggles to climb out of its current funk, several indicators suggest any breach of the $60,000 level would unleash a fresh bout of extreme turbulence.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57997046,
    "published": 1770992776000,
    "title": "Binance France CEO Home Invasion Adds To Record Crypto Attack Wave",
    "body": "Three armed men targeted Binance France CEO David Prinçay in a home invasion, the latest in a record wave of physical attacks against cryptocurrency holders.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57997862,
    "published": 1770995119000,
    "title": "Ransomware Hackers Targeting Employee Monitoring Software To Access Computers",
    "body": "Workforce monitoring software was abused in two cases of attempted ransomware attacks, researchers from Huntress found.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      }
    ]
  },
  {
    "id": 57997751,
    "published": 1770994826000,
    "title": "JPMorgan Keeps Bitcoin Bull Case: $266,000 Remains The Target",
    "body": "JPMorgan is sticking with its long-run bitcoin upside framework, including a $266,000 per-coin target, even as the bank flags near-term stress signals around mining economics and still-chilly risk sentiment heading into 2026. The bank’s latest read hinges on two pillars: a “soft” floor around bitcoin’s production cost, and a valuation model that maps bitcoin’s potential market cap against private-sector gold investment on a volatility-adjusted basis. In the near term, JPMorgan frames the current drawdown as a familiar stress test for miners. The bank estimates the cost to produce a bitcoin at roughly $77,000, while bitcoin was trading around the mid-$60,000s in the same analysis window, putting spot below breakeven for less efficient operators. JP Morgan Remains Bullish On Bitcoin Historically, JPMorgan argues, production cost tends to behave like “soft” support rather than a hard line. The mechanism is reflexive: if prices stay below profitability for long enough, weaker miners shut down, difficulty adjusts lower, and the average cost of production falls, effectively tightening the band that previously sat above spot. Related Reading: Why The Bitcoin Price Crash Toward $60,000 Was “Necessary” The bank also keeps its broader market tone constructive for 2026, leaning on the idea that institutional capital (not retail or corporate treasuries) is the marginal buyer that can restart flows when the macro backdrop stabilizes. As JPMorgan put it: “We are positive on the outlook for 2026 and expect increased inflows into digital assets, driven by institutional investors.” JPMorgan’s $266,000 target is not pitched as a 2026 “call,” but as the mathematical end point of a gold-parity thought experiment. In the bank’s model, matching the scale of private gold investment (roughly $8 trillion, excluding central banks) implies a bitcoin price around $266,000, a level the analysts themselves described as “unrealistic” in the near term. Related Reading: Is The Bitcoin Bottom In? Leading On-Chain Analyst Sees A Floor Forming The bridge between “unrealistic now” and “possible later,” in JPMorgan’s framing, is volatility. The bank has pointed to a bitcoin-to-gold volatility ratio around 1.5, unusually low by historical standards and argues that gold’s surge since October alongside rising gold volatility has improved bitcoin’s relative appeal over the long run. “The large outperformance of gold vs. bitcoin since last October coupled with the sharp rise in gold volatility has led to bitcoin looking even more attractive compared to gold over the long term,” the analysts wrote. JPMorgan’s stance effectively splits the tape into two timeframes: a messy adjustment process if bitcoin remains below mining breakevens, and a longer-duration bet that institutional inflows and regulatory progress in the US can reprice the asset’s role versus gold as 2026 unfolds. At press time, BTC traded at $66,229. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|bitcoin price prediction|btc|BTC news|JP Morgan",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57998514,
    "published": 1770996765000,
    "title": "Bitcoin passes $69K on slower US CPI print, but Fed rate-cut odds stay low",
    "body": "Bitcoin bulls enjoyed a relief rally to $69,000 on the back of soft US CPI inflation data amid hopes of BTC price action making a \"higher low.\"",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57998386,
    "published": 1770996638000,
    "title": "FedEx Enters Hedera Network Council With Eye on Supply Chain Transformation",
    "body": "FedEx joins firms like Google, IBM, and Dell on the Hedera Council, running a network node and contributing to governance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 81,
        "NAME": "HBAR",
        "CATEGORY": "HBAR"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57998983,
    "published": 1770998447000,
    "title": "Bitcoin’s $2.3 Billion Wipeout Marks Harshest Crash In 4 Years: Analysts",
    "body": "The recent slide of Bitcoin has punched a hole in short-term holders’ wallets and left loud questions about where prices might settle next. Markets are jittery; people who bought high are taking losses. Some sellers reacted fast, and that rush shows up in on-chain numbers. Related Reading: Is XRP About To Surprise The Market? Finance Expert Weighs In Realized Losses Hit Historical Levels According to CryptoQuant and an analyst writing under the name IT Tech, Bitcoin’s seven-day average of realized net losses climbed to about $2.3 billion — a figure that puts this sell-off among the largest loss events on record. “This is one of the largest capitulation events in BTC history, rivaling the 2021 crash, 2022 Luna/FTX collapse, and mid-2024 correction,” IT Tech said. This spike in losses means many traders sold at a loss over the span of a week, not just a day. Price Action And Market Context Reports say Bitcoin fell sharply from its recent peak and has been bouncing between support lines that traders watch closely. After topping near $126,000, the token traded as low as about $60,000 earlier in the month and has been seen around $66,600 on recent checks. That gap is large, and it explains why panic selling pushed realized losses so high. Signs Pointing To Capitulation Reports note that on-chain indicators tied to profit and loss show losses are rising faster than gains. One contributor at CryptoQuant, GugaOnChain, flagged a Z-Score reading that he describes as consistent with deep capitulation — a phase where more holders give up than buy. When that happens, markets often become chaotic first and steady later. What Analysts Are Saying Now Reports say some market commentators expect pressure to continue for a while. Nic Puckrin, an investment analyst, described the market as being in “full capitulation mode,” and warned selling could persist for months before clearer footing appears. Others point out that heavy losses can also clear the way for patient buyers later. Where Bottoms Have Lived Before Reports have disclosed that CryptoQuant’s measure of the “realized price” sits near $55,000 — a level that has been linked in past cycles to the end of big sell-offs and the start of sideways consolidation. That does not mean a floor has formed this time; it only marks a region where past buyers, on average, stopped losing money on their holdings. Markets have traded well below similar marks before they steadied, so history offers patterns, not guarantees. Related Reading: Jim Cramer Suggests US Government Could Buy Bitcoin Near $60K What This Means For Traders And Investors Short term, expect wild swings. Some days will bring sharp rallies that reverse quickly. Other days will drag, and realized losses may keep rising as more investors pull out. Longer term, if institutional demand returns or big holders stop forcing sales, price stability could follow. Right now the market is clearing out positions and testing whether support levels hold. Featured image from Gemini, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|Bear market|bitcoin|btc|btcusd|capitulation|crypto",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57999354,
    "published": 1770999763000,
    "title": "Wall Street analysts slash Coinbase price targets after Q4 miss — but shares rally",
    "body": "Barclays, Benchmark, Clear Street, and JPMorgan all cut targets, citing weak retail trading and macro headwinds.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Coinbase|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57999602,
    "published": 1771000200000,
    "title": "Bitcoin most 'undervalued' since March 2023 at $20K, BTC price metric shows",
    "body": "Bitcoin onchain analysis eyed a potential end to the BTC price downtrend as its MVRV ratio returned to levels not seen in three years.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57999833,
    "published": 1771001162000,
    "title": "State-Sponsored Hackers Using Popular AI Tools Including Gemini, Google Warns",
    "body": "A new report from Google AI Threat Tracker shows how hackers from North Korea, Iran and Russia are using AI to speed up their attacks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 57999775,
    "published": 1771000940000,
    "title": "Connecticut Man Faces 375 Years for Gambling Away Crypto Investors' Funds on Stake",
    "body": "The 24-year-old faces 21 criminal charges for losing nearly a million dollars worth of customer funds prosecutors say were never invested in crypto.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58000152,
    "published": 1771002066000,
    "title": "Crypto investor sentiment will rise once CLARITY Act is passed: Bessent",
    "body": "Delaying the CLARITY market structure bill until 2027, after the US midterm elections, may significantly reduce its chances of passage, the Treasury Secretary said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 58000535,
    "published": 1771000849000,
    "title": "Fintech Company Figure Starts Marketing Blockchain-Native Shares",
    "body": "Figure Technology Solutions Inc. has started to formally market 4.23 million shares of its so-called blockchain-native stock to investors, as the financial technology firm joins the race to revolutionize share trading infrastructure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "NMS:FIGR",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 58000790,
    "published": 1771003800000,
    "title": "Bitcoin $72K target possible if V-shaped recovery pattern completes",
    "body": "Bitcoin’s post-CPI rally above $69,000 could help complete the V-shaped recovery chart pattern and also confirm that $60,000 was the sell-off bottom.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58001122,
    "published": 1771005053000,
    "title": "$3.85 Million in Ethereum From Mixin Network Hack Sent to Tornado Cash",
    "body": "Wallets linked to the $200 million exploit of Mixin in 2023 woke after nearly two years and moved funds to coin mixer Tornado Cash.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 58001303,
    "published": 1771005658000,
    "title": "Cardano Founder Hoskinson Warns Of 90-180 Days Of Pain Ahead: Here’s Why",
    "body": "Cardano founder Charles Hoskinson says the crypto market is headed for “90–180 days” of more grind, not because the industry lacks catalysts, but because retail is exhausted and the narrative that kept people engaged has stopped working. Speaking with CoinDesk at Consensus 2026 in Hong Kong, the Input Output CEO framed the current drawdown as a morale problem as much as a market one. “This one particularly stings because we expected a really strong cycle in 2025 and we didn’t quite get it,” he said. “So, a lot of people are pretty bitter about it… We just got to get through the next 90-180 days. It’s going to be tough.” Cardano Founder On What Went Wrong For Crypto Hoskinson’s core point was that crypto has spent years promising a near-term “magic fix,” then watching the market fail to respond even when those fixes arrived. He rattled off the sequence retail has lived through: NFT mania, the collapse of Luna, collapse of FTX, the “scary Gary era,” memecoin mania, and “all the Trump stuff” and argued that each cycle offered the same story: endure the pain now, because something big is coming in 6–12 months. “And we got all the mcguffins,” he said. “We got BlackRock coming in. We got the US government doing the reserve thing. We got good regulation with Genius to start… all the things that we were looking for happened and then nothing happened afterwards.” Related Reading: Cardano May Be At A Prime Buying Point, Analyst Says To explain the mood, Hoskinson leaned on a vivid travel metaphor: “We got to the town and the hotel was closed, the restaurants closed and we’re like where do we sleep and eat? … people are deeply frustrated.” That frustration, in his telling, has turned into a broader disengagement. Retail isn’t shocked by volatility, it’s bored and worn down by the repeated promise that the next institutional wave, the next regulatory milestone, or the next narrative pivot will make the market “work” again. Hoskinson also cast the next phase of adoption as politically contentious inside crypto itself. As more traditional finance players get involved, he warned of a future where the industry becomes “federated”, dominated by large corporate-controlled networks and where users are pushed away from self-custody. “What they want to do long term is move everybody into a custodial holder from a non-custodial holder and then ban DeFi and non-custodial wallets so they can consolidate the entire industry to like 10 or 15 of big actors,” he said, adding that it’s feeding apathy among long-time participants. He put it more bluntly a moment later: “We didn’t sign up to have Goldman Sachs and JP Morgan and BlackRock and these other guys run the industry. We signed up to build a new banking system that is pushing power to the edges.” If the industry drifts back into the hands of the institutions crypto originally positioned itself against, Hoskinson argued, the last decade of risk-taking starts to look like a round trip. How To Make Crypto Great Again Hoskinson’s proposed reset centers on making crypto usable for people who aren’t primarily there to trade. That starts with “wallet abstraction”, reducing onboarding to something like “30 seconds with a fingerprint and a pin code,” plus social recovery and then integrating those wallets into mainstream platforms so the default experience becomes non-financial. Related Reading: Cardano Nears End Of 2020-Style Correction: Is $5 To $10 Next? “Right now, I have to understand… private keys, understand how to back up wallets, all this stuff,” he said. “So, really, the only interface is for people that are doing this for financial reasons.” From there, he argued, crypto should stop “over financializing everything,” pointing to the volume of token launches as a symptom. “Anytime I hear anything, I always ask, ‘When’s the token launch?’ And I’m sorry, 11 million tokens went out last year. It’s not sustainable,” he said. He tied that thesis to what he sees as the next wave of demand: agentic AI. By 2030, Hoskinson predicted, “the majority of internet searches in commerce will be agentic,” meaning bots transact more than humans and crypto, via stablecoins and standards he referenced such as x402 becomes the rails that give those agents “economic agency.” Hoskinson also dismissed the idea that quantum fears are driving today’s downturn. “If there are, they’re stupid,” he said of anyone selling Bitcoin due to quantum risk, calling the threat “not… right now.” He pointed instead to DARPA’s Quantum Benchmarking Initiative (QBI), saying the effort is working toward measuring whether quantum computers will be meaningful “by 2033,” and argued the real issue is trade-offs: post-quantum cryptography is “5 to 10 times less efficient,” and few networks want to pay that cost today. Still, he framed the looming transition as an opportunity, especially for Bitcoin, which he said may need a hard fork to fully address post-quantum migration. For Cardano, he argued, on-chain governance makes such changes a more bounded process: “It’s a six-month conversation for us.” At press time, Cardano traded at $0.2638. Featured image from YouTube, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|ADA|ADA news|ADA price|Cardan News|Cardano|Cardano price|Charles Hoskinson",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 206,
        "NAME": "FORKS",
        "CATEGORY": "FORKS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58001581,
    "published": 1771006355000,
    "title": "Binance France CEO Targeted in Home Invasion Attempt: Report",
    "body": "The CEO of Binance France was targeted in a recent home invasion attempt, but the executive was unharmed and the criminals were arrested.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58001481,
    "published": 1771006201000,
    "title": "Trump Media Files For Cronos, Bitcoin‑Ether ETFs With Staking Focus",
    "body": "Companies linked to President Donald Trump are expanding their presence in the cryptocurrency industry, with the Trump Media & Technology Group taking another formal step into digital asset markets. Truth Social Funds, an affiliate of Trump Media, has submitted a registration statement to the US Securities and Exchange Commission (SEC) seeking approval to launch two new cryptocurrency exchange‑traded funds (ETFs). Trump Media Latest Crypto Proposal The filings outline plans for Crypto.com’s native token, Cronos (CRO), the Cronos Yield Maximizer ETF, and the Bitcoin (BTC) and Ethereum (ETH) ETFs. Related Reading: Standard Chartered Lowers Bitcoin Forecast: Predicts Price Dive To $50,000 Before Rebound The Cronos-focused product is designed to provide exposure to CRO, the native token of the Cronos blockchain, while also capturing staking rewards associated with holding the asset. The second fund would track the performance of Bitcoin and Ethereum, the two largest cryptocurrencies by market value, and incorporate Ether staking yields into its strategy. Under the proposed structure, Crypto.com would play a central operational role. The digital asset platform is set to provide custody, liquidity, and staking services for the funds. Meanwhile, Yorkville America Equities has been named as the investment adviser, with the filings indicating a 0.95% annual management fee. Bitcoin Struggles Below $70,000 Friday’s announcement builds on a broader strategic partnership formed last year between Trump Media and Crypto.com. As part of that agreement, Trump Media was set to acquire 684.4 million Cronos (CRO) tokens at an approximate price of $0.153 per token. The transaction was structured as a 50% stock and 50% cash exchange and included the creation of a Trump Media Group CRO Strategy aimed at integrating Cronos into the company’s broader digital asset plans. Related Reading: Cardano Founder Hoskinson Warns Of 90-180 Days Of Pain Ahead: Here’s Why The expansion into crypto-linked investment products comes at a time when Bitcoin continues to face technical resistance. Although the leading cryptocurrency has posted gains of roughly 5% over the past 24 hours, it remains unable to decisively break above the $70,000 level. Shares of Trump Media (DJT) also moved modestly higher during Friday’s trading session, rising about 2.5% to trade near $11.18. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|Bitcoin ETF|Bitcoin ETF news|Cronos|Cronos (CRO)|Cronos crypto ETF|crypto|crypto market|crypto news|crypto.com|Crypto.com news|Ethereum ETF News|Trump|Trump media|Trump Media crypto ETFs|Trump media crypto news|Trump Media Group",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 75,
        "NAME": "CRO",
        "CATEGORY": "CRO"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58002450,
    "published": 1771009257000,
    "title": "Bitcoin Bounces to $69K, But Charts Are Still Bearish: Analysis",
    "body": "Bitcoin's rebound from $60K lows may be a dead cat bounce, as the daily charts scream caution and prediction markets price in more pain.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58002438,
    "published": 1771009200000,
    "title": "BlackRock enters DeFi as institutional crypto push accelerates: Finance Redefined",
    "body": "Bitcoin and Ether rebounded modestly as ETF outflows mounted, while BlackRock entered DeFi and Binance completed its $1 billion Bitcoin reserve shift.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58002934,
    "published": 1771010506000,
    "title": "Bitcoin bulls blitz $69K as retail traders pressure short positioning",
    "body": "Bitcoin rallies above $69,000 as retail traders apply pressure to short positions and aim to generate a lasting bullish trend change.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58003009,
    "published": 1771011005000,
    "title": "Historical Pattern From 2017 Signals Bitcoin Price Crash To $35,000",
    "body": "Bitcoin is still playing out a series of price actions that look like they may be entering a deeper correction phase. A technical analysis shared on social media platform X by crypto analyst Chiefy suggests that Bitcoin is repeating the macro structures seen after the 2017 and 2021 cycle tops. If the pattern continues to unfold with similar symmetry, the projection is that Bitcoin could fall to as low as $35,000 within days. Bitcoin Imitating 2017 And 2021 Cycle Structures Chiefy’s chart compares three major peaks: the $21,000 high in 2017, the $69,000 peak in 2021, and the recent all-time high just above $126,000. The important trend is that in both of the first two cases, Bitcoin experienced severe retracements exceeding 70% before eventually finding long-term bottoms. Related Reading: Why The Bitcoin Price Crash Toward $60,000 Was “Necessary” The first retracement kicked off just after Bitcoin broke above $21,000 in 2017, when it fell 84% during the 2018 bear market. After the $69,000 peak in 2021, the decline reached about 77%. Chiefy described the fractal alignment as nearly perfect, raising the possibility that the market could be approaching another capitulation phase similar to past cycles. The current correction from $126,000 is beginning to resemble those earlier downturns in structure. If Bitcoin were to repeat a similar percentage drop, price projections would place the cryptocurrency in the $30,000 to $35,000 range. The analyst goes even further, warning that such a move could unfold within the next 10 days if the pattern were to play out as it did before. Weak ETF Demand And Whale Inflows Adding To Bearish Pressure Various on-chain data are pointing to a cautious outlook among crypto investors. According to Glassnode, the 30-day simple moving average of net flows for both Bitcoin and Ethereum spot ETFs has been negative for most of the last 90 days. This shows that there is currently no clear sign of demand strong enough to absorb the persistent selling pressure. Related Reading: Important Bitcoin Macro Cycle Durations You Should Know About Interestingly, CryptoQuant’s Whales Inflow Signal metric shows that the average monthly inflows of BTC to Binance from whales increased massively as Bitcoin fell from $95,000 to $60,000. These inflows rose from around 1,000 BTC in late January to nearly 3,000 BTC in February, with a notable spike of roughly 12,000 BTC on February 6 alone. Since February 1, seven trading days have recorded more than 5,000 BTC in daily inflows from this group of large investors. This type of movement shows an intensification of transfers to exchanges from large Bitcoin holders into Binance, a trend that undoubtedly contributed to the price crash. This is because rising exchange inflows are a reflection of increasing selling pressure. At the time of writing, Bitcoin is trading at $66,015, down by 1.7% in the past 24 hours. Featured Image from Pixabay, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|Binance|bitcoin|Bitcoin news|bitcoin price|Bitcoin Spot ETFs|btc|BTC news|btc price|btcusd|BTCUSDT|Chiefy|cryptoquant|CryptoQuant's Whales Inflow Signal|Ethereum spot ETFs|glassnode",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58002942,
    "published": 1771010719000,
    "title": "Crypto group counters Wall Street bankers with its own stablecoin principles for bill",
    "body": "After the bankers shared a document at the White House demanding a total ban on stablecoin yield, the crypto side answers that it needs some stablecoin rewards.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Cody carbone|Digital Chamber|Market Structure Legislation|U.S. Senate|White House|Patrick Witt|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58004233,
    "published": 1771014600000,
    "title": "Price predictions 2/13: BTC, ETH, BNB, XRP, SOL, DOGE, BCH, HYPE, ADA, XMR",
    "body": "Bitcoin and several major altcoins are attempting a relief rally, signaling that the bulls are trying to form a higher low.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 12,
        "NAME": "BCH",
        "CATEGORY": "BCH"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58004199,
    "published": 1771014562000,
    "title": "Clarity Act Passage Would 'Comfort' Markets Amid Bitcoin Volatility: Treasury Secretary Bessent",
    "body": "U.S. Treasury Secretary Scott Bessent suggested that the crypto market would be calmed by the passage of the Clarity Act.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58004789,
    "published": 1771016433000,
    "title": "After 95% Crash, Avalanche Forms High-Timeframe Reversal Structure",
    "body": "After enduring a brutal 95%+ drawdown from its 2021 peak, Avalanche is now showing early signs of a potential high-timeframe reversal. With price stabilizing at macro support and forming an emerging Elliott Wave structure on the weekly chart, the current phase could mark a critical turning point in the broader cycle. Weekly Elliott Wave Structure Signals Macro Inflection AVAX is currently forming an Elliott Wave structure on the weekly chart, trading within a massive descending channel that has remained intact since the 2021 all-time high. The broader structure suggests the asset is still operating within a long-term corrective phase, but key technical signals now point to a potential higher-timeframe inflection point. Related Reading: Avalanche Shows Signs Of Recovery As Key Indicator Flashes A Buy Signal – Details According to Crypto Patel, after enduring a brutal 95%+ cycle correction, Avalanche appears to have completed Wave 1 with a macro low near $5.67. Price is now transitioning into the early stages of a Wave 2 recovery phase, a critical moment in the Elliott Wave sequence that often determines whether a sustainable expansion phase can follow. Structurally, the weekly chart shows several notable developments. Wave 1 seems to have finalized within the $8–$5 macro bottoming zone, establishing a potential base of support. At the same time, price continues to trade within the long-term descending channel that has defined the broader downtrend. Technically, the chart reflects a clean bearish breakdown followed by a retest of the lower trendline, a classic deviation setup. Additionally, AVAX executed a liquidity sweep into the weekly demand zone between $8 and $7. Meanwhile, the overall fractal structure also mirrors the compression phase seen in the previous cycle before expansion. For confirmation, Crypto Patel emphasizes the need for sustained weekly strength and expansion back toward mid-channel resistance. A decisive push in that direction would strengthen the bullish Wave 2 thesis and signal that the larger recovery structure is beginning to unfold. Avalanche Upside Roadmap: $33 To $147 In Focus CryptoPatel outlines an ambitious upside roadmap for Avalanche, projecting sequential targets at $33, $58, $97, and ultimately $147. Should the broader channel expansion scenario play out into 2026–2027, price could trend toward the upper boundary of the multi-year descending channel. From the macro bottom to the final target, that would represent an estimated 2,489% expansion. Related Reading: Avalanche (AVAX) Defies Bear Market With Explosive On‑Chain Growth, Messari The bullish thesis remains intact as long as Avalanche holds above $5.50 on a weekly final support, which marks the Wave 1 low and last major structural support. Maintaining this level preserves the higher-timeframe recovery structure and keeps the Wave 2 continuation scenario in play. However, a confirmed weekly close below $5.50 would invalidate the setup and signal structural weakness. As it stands, this remains a high-timeframe, patience-driven opportunity with asymmetric risk-to-reward, a framework best suited for spot accumulation and long-term holders. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Avalanche|Avalanche Long-Term Holders|Avalanche price|AVAX|AVAX Price|AVAXUSD|AVAXUSDT|Crypto Patel|Descending Channel Pattern|Elliott Wave Structure",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 8,
        "NAME": "AVAX",
        "CATEGORY": "AVAX"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58005429,
    "published": 1771018200000,
    "title": "ETH open interest falls to 3-year low: What does it mean for Ether price?",
    "body": "Traders say Ether’s declining open interest and futures funding rates could set the groundwork for a significant short squeeze on bearish leveraged positions and a rally to $2,500.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58006659,
    "published": 1771021853000,
    "title": "Ethereum Derivatives Reset Raises Questions About Next Price Move: What Happens Next?",
    "body": "Ethereum continues to struggle below the $2,000 level, reflecting persistent selling pressure and increasingly fragile market sentiment. The inability to reclaim this psychological threshold has kept traders defensive, with volatility elevated and confidence weakened as negative sentiment spreads across the broader crypto market. While corrections are not unusual after strong cycles, the current environment shows clear signs of stress, with investors closely watching liquidity conditions and derivatives positioning for clues about the next directional move. Related Reading: Bitcoin BCMI Drops Toward Bear Market Territory: How Close Is BTC To A Real Buy Zone? A recent CryptoQuant report provides additional context by highlighting a significant contraction in Ethereum futures open interest. Data tracking the 30-day change in net open interest across major trading platforms indicates that the derivatives market is undergoing a clear phase of deleveraging and risk readjustment. The decline appears concentrated on key exchanges such as Binance, Gate.io, OKX, and Bybit, pointing to a widespread outflow of capital from leveraged positions. According to the figures, Binance alone recorded an approximate drop of 40 million ETH in open interest over the past month, while Gate.io saw a decline exceeding 20 million ETH. OKX posted a reduction of nearly 6.8 million ETH, with Bybit contributing roughly 8.5 million ETH, bringing the combined contraction across these platforms to around 75 million ETH. Broad Deleveraging Suggests Ethereum Market Reset The CryptoQuant report further notes that when additional platforms showing negative open interest readings are included — even those with comparatively smaller volumes — the total contraction across all exchanges exceeds 80 million ETH over the past 30 days. This confirms that the deleveraging trend is not isolated to a handful of major venues but represents a broader structural shift across the Ethereum derivatives ecosystem. Such a widespread decline in open interest typically indicates that traders, particularly those relying on leverage, are reducing exposure rather than initiating new speculative positions. This behavior may reflect caution following heightened volatility or pressure from recent price declines that triggered margin adjustments. Historically, similar environments tend to emerge during transitional market phases, when speculative momentum cools, and risk management becomes a priority. From a structural standpoint, this type of contraction can function as a market “clean-up.” By gradually removing weaker leveraged positions, the likelihood of sudden liquidation cascades may diminish over time. While this does not guarantee an immediate recovery, flushing out excess leverage often stabilizes market conditions. In Ethereum’s case, the ongoing reset in derivatives positioning could help establish a firmer price base if broader liquidity conditions and investor sentiment begin to stabilize. Related Reading: Ethereum Endures Historic Liquidation Week: Largest Sustained Liquidation Phase Since 2021 Ethereum Faces Structural Pressure Below Key Weekly Support Ethereum’s weekly chart shows persistent downside pressure after losing the $2,000 level, a zone that previously acted as both psychological support and a technical pivot during prior consolidation phases. The recent breakdown places ETH below several major moving averages, which now function as overhead resistance rather than support, indicating weakening bullish momentum and a shift toward a more defensive market structure. Price action reflects a clear rejection from the $3,000–$3,500 region earlier in the cycle, followed by a sequence of lower highs. This pattern typically signals a corrective or transitional phase rather than a continuation of the prior bullish trend. The latest decline has also been accompanied by elevated trading volume, suggesting distribution and deleveraging rather than organic accumulation. Related Reading: Bitcoin Realized Losses Hit Luna Crash Levels — But Price Context Points To A Different Market Phase From a structural standpoint, the next meaningful support area appears near the $1,600–$1,700 range, where prior consolidation and demand previously emerged. Holding this zone would help maintain the broader long-term framework despite current weakness. A sustained break below it, however, could increase the probability of a deeper retracement phase. Ethereum remains highly sensitive to macro liquidity conditions, derivatives positioning, and overall crypto market sentiment, with recovery dependent on renewed demand and stabilization above key technical levels. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum News|ETH|ethereum|Ethereum Analysis|Ethereum Derivatives|Ethereum Derivatives Market|ethereum news|ethereum price|Ethereum Price action|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58008482,
    "published": 1771027485000,
    "title": "Publicly Traded Blockchain Lender Figure Confirms Customer Data Breach",
    "body": "Blockchain lender Figure said hackers accessed customer data after an employee was targeted in a social engineering attack.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      }
    ]
  },
  {
    "id": 58008390,
    "published": 1771027206000,
    "title": "Bitcoin Flirts With ‘Undervalued’ As MVRV Slides Toward 1",
    "body": "Bitcoin is nearing a level on the MVRV ratio that historically lines up with market “undervaluation,” according to CryptoQuant contributor Crypto Dan, as traders look for signs that a four-month drawdown from October 2025’s all-time high is shifting from distribution into accumulation. Is Bitcoin Undervalued? In a post on X, Korean Dan said Bitcoin is “approaching the undervalued zone,” arguing that the market is getting close to a threshold that has often marked compelling risk-reward for longer-horizon buyers. Related Reading: Is The Bitcoin Bottom In? Leading On-Chain Analyst Sees A Floor Forming “After reaching its all-time high in October 2025, Bitcoin has been declining for approximately 4 months and is now approaching the undervalued zone,” he wrote. “Generally speaking, when the MVRV ratio falls below 1, Bitcoin is considered to be undervalued. The current value is around 1.1, which can be seen as being close to the undervalued zone.” The MVRV framing matters because the metric has tended to compress toward 1 around prior cycle lows. The chart shared alongside the post shows the ratio at roughly 1.10, with earlier sub-1.0 dips highlighted around past bottoming windows. Crypto Dan cautioned that traders shouldn’t assume the current setup will rhyme perfectly with prior drawdowns, specifically because the preceding advance looked different on valuation measures. “ However, unlike previous cycles, it is necessary to recognize that in this cycle, Bitcoin did not sharply rise all the way into the overvalued zone during the uptrend,” he wrote. “Accordingly, the pattern of the decline may also appear differently from the previous bottom zones, so it seems prudent to prepare for that possibility in our response.” That caveat became the focal point of a short back-and-forth in replies. One user, onlyus8x, suggested that if Bitcoin reached this cycle’s prior all-time high more than three times faster than before, the downturn could also resolve faster—“might the winter also pass 3 times faster?” Related Reading: Bitcoin Flashes Luna-Level Capitulation Signal at $67K, Not $19K Crypto Dan pushed back on a simple speed analogy, replying: “Because there are differences from your past, I personally set the criteria differently from past decline cycles by comprehensively judging these things as well.” Mayer Multiple And The 200-Week MA A separate post from analyst Will Clemente pointed to two long-watched, price-based benchmarks that are also pressing into historically constructive ranges. “Throughout Bitcoin’s life span we have seen two indicators continue to be the best global market bottom signals: The Mayer multiple (distance from 200 day moving average) and the 200 week moving average,” Clemente wrote. “Both of these are clearly in long term accumulation territory.” The charts he shared show a Mayer Multiple around 0.60, alongside a backtest table that flags prior instances when the indicator fell to roughly that level. The same image placed Bitcoin’s 200-week moving average near $57,926, with Bitcoin shown about 15% above it and a note that it has “not yet touched” that line in the current drawdown. At press time, BTC traded at $67,277. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin MVRV|Bitcoin news|bitcoin price|btc|BTC news|btc price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58012188,
    "published": 1771038014000,
    "title": "Bitcoin NUPL Back In Hope/Fear Region: What Happens Next?",
    "body": "On-chain data shows the Bitcoin Net Unrealized Profit/Loss (NUPL) has plunged recently. Here’s what this could mean for the cryptocurrency. Bitcoin NUPL Has Dropped To The 0.18 Level In a new post on X, o-chain analytics firm Glassnode has talked about the latest trend in the Bitcoin NUPL, which is an indicator that compares the amount of unrealized profit and loss held by investors on the BTC blockchain. The metric works by going through the transaction history of each token on the network to find the price at which they were last involved in a transfer. If this previous selling price is greater than the current spot price for any coin, then that particular token is assumed to be carrying some net unrealized profit. Similarly, the cost basis being lower implies the token is underwater. Related Reading: Bitcoin On-Chain Heatmap Shows All Major Metrics In The Red The exact amount of profit/loss held by a coin is equal to the difference between the two prices. The NUPL sums up this value for each category and then subtracts it to determine the net situation for the network. Additionally, it also divides the result by the market cap to showcase how the net profit/loss among investors looks relative to the asset’s total valuation. Now, here is the chart shared by Glassnode that shows the trend in the Bitcoin NUPL over the last few years: As displayed in the above graph, the Bitcoin NUPL shot up above the 0.5 level during the rallies in 2024 and 2025. This suggests that investors were carrying net profits more than half as much as the cryptocurrency’s market cap. These phases of euphoria were followed by price declines that took the metric into the zone between 0.25 and 0.5. BTC managed to recover from the first two of these drops, but the latest one has been followed by an extended phase of downtrend. From the chart, it’s visible that this bearish action has taken the cryptocurrency to a value of 0.18. This level indicates that profits are still dominant on the network, but they are much thinner than before. The level lies inside a region that the analytics firm defines as pertaining to “hope/fear” among the investors. “This regime tends to be reactive: rallies meet sell pressure, and downside can extend as conviction fades,” explained the analytics firm. The last time that the Bitcoin NUPL saw a substantial drawdown into the region was during the 2022 bear market. Back then, the cryptocurrency ended up traveling right through the zone and into the extreme fear area below the zero level, corresponding to net losses being held by the majority of investors. Related Reading: Shiba Inu At Risk of 70% Decline? Price Breaks Below Parallel Channel It now remains to be seen how long the cryptocurrency will stay in the region for this time around and which one will follow next. BTC Price Bitcoin dropped toward $65,000 on Thursday, but the asset has kicked back up to $69,000 on Friday. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin NUPL|bitcoin profitability|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58013093,
    "published": 1771040300000,
    "title": "Bitcoin holders are being tested as inflation fades: Pompliano",
    "body": "Bitcoin will become “more valuable than ever” after deflation stops covering “up the impact\" on the US dollar, according to Bitcoin entrepreneur Anthony Pompliano.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58014669,
    "published": 1771045229000,
    "title": "Here’s the stupid thing about romance scams",
    "body": "If anyone should be ashamed of this crime, it’s the social media platforms",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58014638,
    "published": 1771045212000,
    "title": "Solana Reclaims $80 Amid Friday Market Bounce – Analysts Set Next Targets",
    "body": "As the crypto market recovers, Solana (SOL) has bounced from a major level trendline and momentarily reclaimed a key horizontal level. Some analysts have signaled that a retest of a crucial short-term resistance could be coming, while others have warned that a breakdown to new lows remains possible. Related Reading: Ethereum $1,900 Retest Could Decide Next Major Move – Is ETH Preparing For New Lows? Solana Bounces From Two-Year Trendline On Friday, Solana bounced 10.3% to break past the $85 area for the first time in three days. The cryptocurrency has been hovering between $78-$88 over the past week, briefly falling to $67 during last Thursday’s correction. SOL lost the mid-zone of its local range after recent market volatility, falling below $80 on Thursday. However, Today’s rebound has sent the altcoin above these recently lost levels, setting the stage for a potential recovery. Amid this performance, market observer Daan Crypto Trades highlighted that the cryptocurrency has reclaimed the key $80 level, which has historically served as major resistance and support. To the trader, the Solana must hold above this area and form a base above it before “watching for a low-timeframe market structure break back to bullish.” Analyst Ali Martinez observed that sustained buying pressure could push SOL’s price toward the $88 level, not seen since the start of the week. The altcoin has been unable to break above this level since last week’s breakdown, becoming a key short-term resistance area. A breakout from this level could open the door for a retest of the $90-$96 zone, where the April 2025 lows are. Meanwhile, Crypto Batman noted that Solana is retesting its two-year descending trendline in the weekly timeframe, located around the recent lows. The chart shows that the macro trendline has been holding since early 2024 and has been tapped multiple times throughout the cycle. As the analyst explained, “Over the past 2 years, every time the price touches this level, a massive reversal occurs.” During this period, it has also marked the bottom of each major correction, with the latest retest taking place in Q2 2025 and leading to the following quarter’s rally. SOL Breakdown Still Coming? Despite the bullish outlooks, other market watchers have shared potential bearish forecasts for Solana if momentum weakens. Altcoin Sherpa warned that SOL could drop to $50 if selling pressure pushes the price below a crucial area. The chart shows that after losing the 200-week Exponential Moving Average (EMA), around the $121 mark, and the April 2025 lows, the key area to hold is the recently visited local range lows. As the analyst displayed, if the cryptocurrency fails to hold the $77-$78 price area, the next major historical support sits near the November 2023 breakout area, around the $51 mark. Market watcher Crypto Bullet suggested that Solana’s bottom may not be in yet, arguing that “those who bought BTC above $80k and SOL above $120 must stay trapped for a year or two.” Related Reading: LayerZero (ZRO) Soars 40% Amid Zero Blockchain Debut, Major Institutional Backing He affirmed that “returning to those levels anytime soon doesn’t make sense,” as the cryptocurrencies are in their markdown period. In an X post, he emphasized the market cycle phases, pointing out that the accumulation phase occurred between 2022 and 2023, while the distribution phase occurred between 2024 and the start of 2026. Based on this, the analyst’s chart shows that SOL could potentially find a bottom around the $40 area. As of this writing, Solana is trading at $84.17, a 2.5% decline in the weekly timeframe Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto analyst|Crypto bear market|crypto market correction|Crypto Market Recovery|Crypto trader|Sol|SOL price analysis|Solana|Solana breakdown|Solana correction|Solana recovery|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]