[
  {
    "id": 58227896,
    "published": 1771574439000,
    "title": "XRP Social Sentiment Hits 5-Week High—BTC, ETH Mood Still Off",
    "body": "Data shows the social media sentiment toward XRP has surged to a 5-week high even as mood around Bitcoin and Ethereum remains dull. XRP Positive/Negative Sentiment Has Shot Up Recently In a new post on X, analytics firm Santiment has talked about how XRP, Bitcoin, and Ethereum currently compare in terms of the Positive/Negative Sentiment. This indicator tells us about whether an asset is observing more bullish or bearish comments on the major social media platforms. The metric works by filtering social media posts/threads/messages for terms related to the cryptocurrency and putting them through a machine-learning model that separates between positive and negative sentiments. It then counts up the number of posts in each category and determines the ratio between them. Related Reading: Bitcoin Consolidating In A Triangle—Is A 15% Move Next? When the value of the Positive/Negative Sentiment is greater than 1, it means bullish comments outnumber the bearish ones. On the other hand, the indicator being under this level could indicate the dominance of a negative sentiment among social media users. Now, here is the chart shared by Santiment that shows the trend in the Positive/Negative Sentiment for three top cryptocurrencies: Bitcoin, XRP, and Ethereum. As displayed in the above graph, Bitcoin and Ethereum have both seen the Positive/Negative Sentiment decline to near-neutral levels recently. Bullish and bearish comments are almost exactly canceling out for the former with the metric sitting at 1.05, while the latter is seeing a slight dominance of positive sentiment with a value of 1.4. The analytics firm noted: Crypto markets have struggled to maintain momentum, and social data indicates there are far less bullish comments toward Bitcoin and Ethereum compared to last week. Meanwhile, the indicator has taken a completely different route for XRP. From the chart, it’s visible that the Positive/Negative Sentiment has recently witnessed a sharp rise for the digital asset ranked fourth by market cap. XRP has also struggled like the rest of the market recently, so what’s behind the divergence? According to Santiment, it’s likely to lie in the recent partnership expansion announcements. The wave of bullish comments over the last couple of days has pushed the Positive/Negative Sentiment to 2.35, the highest level in five weeks. If past pattern is to go by, though, this excitement around the asset may not necessarily translate to the cryptocurrency’s price. Related Reading: Bitcoin Bearish Momentum Losing Steam? Analyst Flags Key Metric Generally, digital asset markets tend to move in the direction that goes contrary to the expectations of the majority. In that view, Bitcoin and Ethereum with their relatively dull sentiments may be better positioned for a rebound than XRP. XRP Price At the time of writing, XRP is floating around $1.39, up around 5% in the last seven days. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|bitcoin|btc|ETH|ethereum|xrp|XRP Sentiment|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58226751,
    "published": 1771572143000,
    "title": "How Regulation And Data Collection Are Creating Physical Security Risks",
    "body": "Rising attacks against digital asset holders highlight how data collection, regulatory reporting, and identity leaks are creating unintended personal security risks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58226542,
    "published": 1771571139000,
    "title": "Ripple's Brad Garlinghouse says CLARITY bill has '90% chance' of passing by April",
    "body": "The bill would clarify which digital assets fall under securities law versus Commodity Futures Trading Commission oversight.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Clarity Act|Brad Garlinghouse|XRP News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 16,
        "NAME": "COMMODITY",
        "CATEGORY": "COMMODITY"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58226072,
    "published": 1771570841000,
    "title": "Ethereum Breaks Fhe Final Whale Floor In A 2018-Style Capitulation: What To Expect",
    "body": "Ethereum is struggling to reclaim the $2,000 level, with persistent selling pressure continuing to weigh on sentiment across the broader crypto market. Despite intermittent recovery attempts, price action remains fragile as liquidity conditions tighten and investors reassess risk exposure following the sharp correction from the 2025 highs. The repeated failure to secure sustained acceptance above this psychological threshold has reinforced caution among both institutional and retail participants. Related Reading: The Altcoin Exodus: Trading Volumes Halve As Capital Flees To Bitcoin $65,000 Fortress Recent on-chain analysis highlights a notable structural development: Ethereum is currently trading below the realized price of every major whale cohort. The realized price metric represents the average acquisition cost of coins held by a given group, effectively serving as a proxy for aggregate cost basis. When the rice falls below this level, it implies that even large, historically resilient holders are sitting on unrealized losses. Historically, such conditions tend to coincide with late-stage corrective phases rather than early bull expansions. The last comparable occurrence followed Ethereum’s previous all-time high cycle, specifically in September 2018. That period marked a prolonged consolidation phase during which market excesses were gradually absorbed before a new structural uptrend eventually emerged. Ethereum Trades Below Whale Cost Basis Trading below whale realized prices also has psychological implications. Large holders typically operate with longer investment horizons, and their profitability cushions often help stabilize markets during corrections. When that cushion disappears, volatility can increase as confidence weakens and liquidity becomes more reactive to macro catalysts. This does not necessarily imply immediate bullish reversal conditions. Rather, it signals that the market may be undergoing a redistribution phase in which weaker hands exit while longer-term investors reassess positioning. Markets often require extended stabilization periods after leverage unwinds and sentiment deteriorates, particularly following euphoric cycles. Related Reading: Ethereum’s Leverage Reset Clears The Path For A Healthy Rebound – Analyst At the same time, such environments sometimes attract strategic accumulation. Investors willing to tolerate volatility may view sub-realized-price conditions as opportunities, particularly when accompanied by declining leverage and cooling speculative activity. Whether this dynamic ultimately leads to accumulation or further downside depends heavily on macro liquidity trends, regulatory developments, and broader risk appetite across financial markets. Technical Price Outlook From a technical perspective, the weekly chart underscores Ethereum’s current vulnerability. Price has recently broken below key moving averages that previously functioned as dynamic support. These averages now act as resistance zones, limiting upside momentum unless decisively reclaimed. The recent decline toward the $1,900–$2,000 region reflects a continuation of the broader corrective structure that began after the mid-2025 peak. Volume patterns suggest participation has moderated compared with the impulsive rally phase, indicating reduced speculative enthusiasm. However, declining volume during corrections can also signal exhaustion of aggressive sellers, potentially setting the stage for base formation if demand stabilizes. Related Reading: Is Bitcoin Supply Moving To Strong Hands? Whale Data Suggest Structural Shift Immediate support appears concentrated near the recent local lows around the mid-$1,800 zone, while resistance remains clustered near the $2,200–$2,400 region where prior consolidation occurred. A sustained move above these levels would be required to shift short-term momentum decisively positive. Conversely, failure to hold current support could expose Ethereum to deeper retracement levels consistent with broader market deleveraging. For now, Ethereum remains at a technical and psychological crossroads. Trading below whale realized prices, struggling beneath major resistance levels, and navigating uncertain macro conditions collectively define a market still searching for equilibrium rather than entering a confirmed recovery phase. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum News|ETH|ethereum|Ethereum Analysis|Ethereum Capitulation|ethereum news|ethereum price|Ethereum Price analysis|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58226071,
    "published": 1771570829000,
    "title": "House Democrats Urge Treasury Probe Into Trump Family’s Crypto Venture",
    "body": "CNBC reported Thursday that a group of House Democrats are pressing the Treasury Department to examine potential conflicts of interest and national security risks tied to World Liberty Financial (WLFI), the crypto venture associated with the Trump family. Security Concerns Over Trump-Linked Crypto Venture In a letter sent Thursday to Treasury Secretary Scott Bessent, more than 40 Democratic lawmakers, led by Representative Gregory Meeks of New York, called for a formal review of the company’s structure and foreign investment ties. The letter follows a tense House Financial Services Committee hearing earlier this month, during which Bessent testified before lawmakers. At that hearing, Meeks sharply criticized the Treasury secretary, referring to him as a “flunky” of President Trump. Related Reading: ‘Sell Bitcoin Now,’ Peter Schiff Warns, Predicts $20,000 Target On Breakdown He also raised concerns about a $500 million investment in World Liberty Financial made last year by Sheikh Tahnoon bin Zayed Al Nahyan, a member of the United Arab Emirates’ royal family who has sometimes been referred to as the “spy sheikh.” In a statement accompanying the letter, Meeks said the half‑billion‑dollar deal involving an Emirati royal presents both financial and national security concerns. “The Trump family’s $500 million deal connected to the Emirati royal family is not only a matter of national financial instability, but it also carries serious national security implications,” he said. Treasury Asked To Clarify White House Role The lawmakers’ request comes as World Liberty Financial is pursuing a national bank charter. Democrats are seeking assurances that the chartering process remains insulated from political or foreign influence. As such, they argued that the matter extends beyond a technical debate over crypto regulation. “This is no longer just a debate about crypto chartering theory,” they wrote. “It is about foreign ownership, national security, regulatory integrity, and whether our bank‑chartering process is resilient to political and geopolitical pressure.” Related Reading: Revealed: The Biggest Bitcoin Holders Of 2026, According To Arkham Data The group asked Treasury officials to detail what safeguards are in place to prevent foreign governments, their proxies, or politically connected investors from using the national bank chartering process to gain leverage within the US financial system or access sensitive financial and technological infrastructure. They also sought clarification on the role, if any, played by the White House, the Office of Management and Budget, and the Treasury Department in reviewing or influencing charter decisions made by the OCC. The lawmakers requested a response from the Treasury Department by Feb. 26. In closing, they emphasized the broader implications for public trust. “The credibility of America’s banking regulatory framework, and of the institutions charged with protecting it, depends on transparency, independence, and a demonstrated willingness to resist undue influence,” they wrote. As of this writing, World Liberty Financial’s native crypto, WLFI, is trading at $0.1168, marking a 3% decline over the past 24 hours. However, according to CoinGecko data, the cryptocurrency has increased by nearly 10% in the past seven days. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Crypto|crypto|crypto market|crypto news|cryptocurrency|Trump|Trump news|WLFI news|WLFI price|WLFIUSDT|World Liberty|World Liberty Financial|World Liberty Financial (WLFI)|World Liberty Financial news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58224345,
    "published": 1771567477000,
    "title": "Parsec shuts down amid ongoing crypto market volatility",
    "body": "The on-chain analytics firm‘s focus on decentralized finance and non-fungible tokens had fallen out of step with the industry‘s current trajectory.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58224140,
    "published": 1771567203000,
    "title": "Kwasi Kwarteng is focused, ‘orange pilled’ and ready to start bitcoinmaxxing",
    "body": "Checking in on the ex-chancellor",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58222928,
    "published": 1771564703000,
    "title": "White House floats limited stablecoin rewards in third crypto, bank meeting",
    "body": "White House crypto adviser Patrick Witt reportedly refocused crypto and bank lobby talks on a crypto bill to allow stablecoin rewards tied to transaction activity.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58222557,
    "published": 1771564127000,
    "title": "Dogecoin (DOGE) Recovery Capped As Momentum Turns Bearish",
    "body": "Dogecoin started a fresh decline below the $0.1050 zone against the US Dollar. DOGE is now consolidating losses and might face hurdles near $0.10 and $0.1040. DOGE price started a fresh decline below the $0.1050 level. The price is trading below the $0.10 level and the 100-hourly simple moving average. There is a key bearish trend line forming with resistance at $0.1005 on the hourly chart of the DOGE/USD pair (data source from Kraken). The price could extend losses if it stays below $0.1020 and $0.1040. Dogecoin Price Faces Uphill Task Dogecoin price started a fresh decline after it closed below $0.1050, like Bitcoin and Ethereum . DOGE declined below the $0.1040 and $0.1020 support levels. The price even traded below $0.10. A low was formed near $0.0955, and the price is now showing bearish signs. There was a recovery wave above $0.0980, but the price stayed below the 23.6% Fib retracement level of the downward move from the $0.1174 swing high to the $0.0955 low. Dogecoin price is now trading below the $0.10 level and the 100-hourly simple moving average. There is also a key bearish trend line forming with resistance at $0.1005 on the hourly chart of the DOGE/USD pair. If there is a recovery wave, immediate resistance on the upside is near the $0.10 level. The first major resistance for the bulls could be near the $0.1005 level and the trend line. The next major resistance is near the $0.1040 level or the 38.2% Fib retracement level of the downward move from the $0.1174 swing high to the $0.0955 low. A close above the $0.1040 resistance might send the price toward the $0.1065 resistance. Any more gains might send the price toward the $0.1120 level. The next major stop for the bulls might be $0.1150. Another Decline In DOGE? If DOGE’s price fails to climb above the $0.1040 level, it could continue to move down. Initial support on the downside is near the $0.0955 level. The next major support is near the $0.0920 level. The main support sits at $0.0880. If there is a downside break below the $0.0880 support, the price could decline further. In the stated case, the price might slide toward the $0.0832 level or even $0.0820 in the near term. Technical Indicators Hourly MACD – The MACD for DOGE/USD is now gaining momentum in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for DOGE/USD is now below the 50 level. Major Support Levels – $0.0955 and $0.0920. Major Resistance Levels – $0.1005 and $0.1040.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "DOGE|DOGE news|Doge price|DOGE USD|DOGE/BTC|DOGE/USDT|Dogecoin|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58222298,
    "published": 1771563637000,
    "title": "The 200 Million XRP Exodus: Investors Swap Speculation For Private Custody",
    "body": "XRP has struggled to generate sustained demand in recent weeks as broader crypto market conditions remain fragile and selling pressure continues to dominate sentiment. Price action has reflected a lack of strong buying conviction, with several analysts warning that further downside cannot be ruled out if liquidity conditions fail to improve. While volatility has moderated compared with earlier corrective phases, momentum remains weak, leaving traders cautious about the near-term outlook. Related Reading: The Altcoin Exodus: Trading Volumes Halve As Capital Flees To Bitcoin $65,000 Fortress A recent CryptoQuant report highlights exchange reserve dynamics as a key framework for understanding current investor behavior. Monitoring the amount of XRP held on trading platforms can offer insight into whether market participants are preparing to sell or accumulate. Typically, a sharp rise in exchange reserves suggests investors are transferring assets onto exchanges, often signaling readiness to liquidate positions. Such movements can increase immediate market supply and contribute to short-term selling pressure. Conversely, declining reserves on exchanges tend to indicate withdrawals into private custody or long-term storage solutions. This behavior usually reflects stronger conviction among holders and reduced willingness to sell at prevailing price levels. As a result, reserve trends can help contextualize whether XRP’s current weakness stems from distribution activity or a broader repositioning phase within the market. XRP Exchange Outflows Signal Emerging Accumulation Trend The analysis indicates that this pattern is currently visible in XRP’s supply ratio on Binance, a metric that measures the share of the asset’s total circulating supply held on a specific exchange. Over the past ten days, the ratio has declined from 0.027 to 0.025, signaling a measurable reduction in XRP balances on the platform. In absolute terms, this translates to roughly 200 million XRP withdrawn from Binance during that period. Although exchange-level movements can sometimes reflect internal reallocations, major platforms such as Binance publicly disclose custody addresses, allowing analysts to differentiate operational reshuffling from user-driven withdrawals with reasonable precision. In this context, the scale and direction of the change point more convincingly point toward organic outflows rather than technical adjustments. Related Reading: Ethereum’s Leverage Reset Clears The Path For A Healthy Rebound – Analyst Such a decline in exchange-held supply often reflects a shift in investor positioning. XRP has corrected by approximately 40% since the start of the year, a magnitude that can attract longer-term participants seeking discounted entry points. When investors withdraw assets from exchanges, they typically reduce immediate sell-side liquidity and signal a preference for private custody over active trading. Taken together, the data suggest that a segment of market participants may be accumulating XRP at current levels, positioning for potential recovery rather than preparing for near-term distribution. XRP Price Struggles Below Key Moving Averages XRP remains under sustained pressure, with the weekly chart showing a clear downtrend following the rejection near the $3.30–$3.50 zone seen in mid-2025. Since that peak, price structure has shifted toward a sequence of lower highs and lower lows, typically associated with weakening momentum rather than consolidation. The latest candles suggest XRP is attempting to stabilize near the $1.40 region, but conviction remains limited. Technically, XRP is trading below the major moving averages visible on the chart, which now act as dynamic resistance. The shorter-term average has already rolled over, while the longer-term trend line continues to slope upward more slowly, reflecting the lagging nature of macro support. Sustained trading below these levels generally signals cautious sentiment and limited upside follow-through unless a decisive reclaim occurs. Related Reading: Is Bitcoin Supply Moving To Strong Hands? Whale Data Suggest Structural Shift Volume patterns also indicate reduced participation compared with the impulsive rally phase. This decline often reflects fading speculative interest, although it can also precede a base-building period if selling pressure exhausts. From a structural perspective, the $1.30–$1.40 zone appears to function as immediate support, while the $1.80–$2.00 range likely represents the first significant resistance band. Until XRP reclaims higher levels with strong volume, the broader trend remains fragile and biased toward continued consolidation or downside risk. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP News|xrp|XRP analysis|XRP investors|xrp news|XRP Price|XRP Price Analysis|XRP supply|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58221524,
    "published": 1771562185000,
    "title": "Custodia CEO Says Trump Family Crypto Ties Are Part of Clarity Act Problem",
    "body": "At ETH Denver, Caitlin Long said the ethics controversy around Trump-linked crypto projects has complicated Senate support.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58221488,
    "published": 1771561829000,
    "title": "Crypto miner Bitdeer tanks 17% after $300M debt offering",
    "body": "Bitdeer has launched its second-ever convertible senior note offering, which has seen its shares tumble 29% so far this year.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58220870,
    "published": 1771561102000,
    "title": "XRP Price Downside Momentum Builds Amid Fading Recovery Hopes",
    "body": "XRP price extended losses and traded below $1.40. The price is now consolidating losses but faces hurdles near $1.4320 and $1.450. XRP price started another decline and traded below the $1.420 zone. The price is now trading below $1.420 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance at $1.4620 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move down if it stays below $1.4650. XRP Price Extends Losses XRP price failed to stay above $1.450 and extended its decline, like Bitcoin and Ethereum . The price declined below $1.420 and $1.4150 to enter a short-term bearish zone. The price even extended losses below $1.40. A low was formed at $1.3816, and the price is now consolidating losses. There was a minor upward move above the 23.6% Fib retracement level of the downward move from the $1.5120 swing high to the $1.3816 low. The price is now trading below $1.420 and the 100-hourly Simple Moving Average. If there is a fresh recovery move, the price might face resistance near the $1.4320 level. The first major resistance is near the $1.450 level or the 50% Fib retracement level of the downward move from the $1.5120 swing high to the $1.3816 low. The main resistance could be $1.4620. There is also a key bearish trend line forming with resistance at $1.4620 on the hourly chart of the XRP/USD pair. A close above $1.4620 could send the price to $1.480. The next hurdle sits at $1.50. A clear move above the $1.50 resistance might send the price toward the $1.5320 resistance. Any more gains might send the price toward the $1.550 resistance. The next major hurdle for the bulls might be near $1.5650. Downside Continuation? If XRP fails to clear the $1.4620 resistance zone, it could start a fresh decline. Initial support on the downside is near the $1.3980 level. The next major support is near the $1.3850 level. If there is a downside break and a close below the $1.3850 level, the price might continue to decline toward $1.3620. The next major support sits near the $1.350 zone, below which the price could continue lower toward $1.320. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $1.3850 and $1.3620. Major Resistance Levels – $1.4500 and $1.4620.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58220726,
    "published": 1771560809000,
    "title": "Fed’s Kashkari lashes crypto and stablecoins, praises AI",
    "body": "Minneapolis Fed President Neel Kashkari says crypto is “utterly useless” compared to AI, and that pro-stablecoin arguments are “a buzzword salad.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58219473,
    "published": 1771558238000,
    "title": "Illicit stablecoin activity hit 5-year high of $141B in 2025: TRM Labs",
    "body": "Sanctions evasion networks, guarantee marketplaces, and large-scale money laundering schemes dominated illicit stablecoin use, says TRM Labs.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58218367,
    "published": 1771556453000,
    "title": "Winter Won’t Last — Bitcoin’s Next Season Is Near, Michael Saylor Says",
    "body": "Michael Saylor keeps things upbeat. He told a TV interviewer that the current Bitcoin dip feels milder than past crashes and that a quicker rebound is likely. He even said, “Spring is coming, and Bitcoin is winning.” Related Reading: Ethereum Staking Reaches Historic Levels, Price Hovers Near $2K Bitcoin Institutional Support Strengthens Outlook According to Saylor, a big reason for his confidence is that banks and big firms are far more involved than they were a few years ago. Reports note fresh banking tools and credit networks aimed at crypto are drawing new capital in. US President Donald Trump was mentioned by the Strategy big boss as a political force friendly to Bitcoin — a line that will be picked over by both supporters and critics. We may be in the middle of a crypto winter, but spring is coming — and Bitcoin is winning. pic.twitter.com/jxvzK3XwSN — Michael Saylor (@saylor) February 17, 2026 Strategy’s Holdings And Price Math Strategy holds 714,644 BTC on its books, bought at an average near $76,056 each. At the moment, Bitcoin trades around $67,900. That gap matters. The roughly $49 billion value sitting in the vault is compared to a company market value that trades around $42.80 billion. Those raw numbers give weight to Saylor’s claim that the company can handle big swings. He went further, saying that even a fall to $8,000 would leave the holdings enough to cover outstanding debt. That is a strong statement. It was presented as reassurance to investors. Strategy’s Position And Risk Calculations Reports say Strategy plans to swap its convertible debt into stock within three to six years. The firm has also signaled it will buy more Bitcoin each quarter. How these moves play out depends on markets, financing terms, and timing. Some analysts think the company’s approach lowers short-term pressure on the share price. Others point out that keeping such a large crypto stash concentrates risk in volatile markets. Past Cycles Saylor compared the current episode to deeper downturns that came before. That comparison is useful but needs numbers to be fully judged. Historical drops in crypto have been steep at times, which is why claims of a milder slump invite scrutiny. Other investors look at on-chain flows, macro cash conditions, and bank behavior to decide whether this time is different. Right now, evidence of a fast, broad institutional inflow is mixed. Related Reading: Urgent Crypto Reform: Treasury Secretary Says The Clock Is Ticking Outlook And What Could Shift The Story Markets could swing on a few catalysts: changes in lending policy, moves by large funds, or fresh regulatory signals from US authorities. News or shocks could tilt sentiment quickly. Some market watchers look at 10-year trendlines for context, while others focus on shorter trading indicators. Either way, Saylor’s optimism is clearly tied to a long view and a confident read of current market structure. Featured image from Long Island Weight Loss Institute, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|CLARITY Act|Michael Saylor|Strategy|Trump",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58218103,
    "published": 1771555945000,
    "title": "Australian Executive Accused of Selling Cyber Secrets to Russia for Crypto",
    "body": "U.S. prosecutors say the former defense contractor executive took about $1.26 million in crypto to transfer sensitive exploit tools tied to Five Eyes intelligence work.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 58231012,
    "published": 1771580592000,
    "title": "South Korean authorities under fire over $43B Bithumb Bitcoin error",
    "body": "Lawmakers criticize South Korea’s Financial Services Commission after Bithumb mistakenly credited 620,000 BTC and the probe faces delays.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58231470,
    "published": 1771581622000,
    "title": "Bitcoin Bottom Call On Ice: Fear Is Extreme, Whales Aren’t Buying",
    "body": "Bitcoin’s slide into the $60,000–$70,000 zone has lit up the usual “bottom” dashboards: extreme fear, washed-out positioning, and a cluster of indicators many traders treat as capitulation signals. But CryptoQuant contributor Mignolet says the market is missing the only thing that ultimately matters: a visible bid from dominant buyers. “What I emphasized in the $80K–$90K range still remains the same,” he wrote on Feb. 18. “Many indicators that market participants follow are pointing to a bottom and extreme fear. However, we do not see dominant players (whales) actually using this situation.” Mignolet’s core argument is simple: a bottom is not a sentiment reading, it’s an event and he doesn’t see the kind of forced absorption that typically marks a durable turn. “No matter how many indicators suggest a bottom, if there is no real buying force stepping in, we cannot know where the true bottom will be,” he said. “That is why I do not make price predictions lightly.” Related Reading: Revealed: The Biggest Bitcoin Holders Of 2026, According To Arkham Data He contrasted the current tape with the 2024 bull cycle, when fear could still dominate headlines even as large allocators quietly took the other side. In that period, he argues, the market had a measurable backstop: institutional demand showing up through US spot Bitcoin ETFs, specifically BlackRock’s IBIT and Fidelity’s FBTC, which “clearly absorbed the selling pressure.” The “most important point,” in his framing, is that the same mechanics aren’t showing up now. Mignolet says the accumulation pattern FBTC sustained for roughly a year has “already broken down,” and IBIT, previously described as a buffer during heavy sell pressure, is “now trending downward, unlike last year.” That shift is why he keeps the bottom call “on ice,” even if price ultimately holds the current region. In his view, Bitcoin remains in a phase where traders should “be cautious about further shocks,” and even a successful defense would likely require time before it can be treated as confirmed. When Everyone Reads The Same Bitcoin Data Beyond flow, Mignolet is also warning about a structural change in how market narratives form. He argues the proliferation of on-chain analytics has made the space more information-dense, but not necessarily more insightful and in some cases, more hazardous. Related Reading: Bitcoin Doesn’t Get A Macro ‘Bailout’ This Time: Alden Warns Of Gradual QE “The problem is that everyone looks at the same data and often reaches similar conclusions,” he wrote. “In many cases, even the people producing the data do not fully understand it. When information becomes too common, it pushes expectations in one direction.” He describes today’s well-packaged on-chain dashboards as “clean and convincing, almost like an answer sheet,” which can harden conviction precisely when flexibility is required. The downstream risk, he suggests, is that widespread agreement around “obvious” bottoms can keep investors anchored through deeper drawdowns or longer grind periods. In the near term, Mignolet’s base case is not a clean trend reversal but “sideways movement without a clear direction,” with enough volatility to create opportunities for short-term traders. For his own positioning, he described the period as “waiting,” stepping back to watch “liquidity flows, supply and demand conditions, and overall market sentiment,” then “reset” his framework. The bigger picture, he says, is still bearish and potentially more drawn out than he expected last year. His closing warning is that this down cycle is “unlikely to end lightly,” with the plausible outcomes being a larger-than-expected drop, a longer-than-expected sideways phase, or both. At press time, Bitcoin traded at $67,889. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|Bitcoin On-Chain Data|bitcoin price|btc|BTC news|btc price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 199,
        "NAME": "ARKM",
        "CATEGORY": "ARKM"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58231292,
    "published": 1771581082000,
    "title": "Metaplanet CEO rejects claims it hid details of Bitcoin trades",
    "body": "Metaplanet’s Simon Gerovich hit back at critics who accused the company of hiding losses and key details of its Bitcoin bets, as investor anger over leveraged Bitcoin treasuries spreads.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58232118,
    "published": 1771582825000,
    "title": "Silicon Valley Engineers Charged With Theft of Google, Tech Trade Secrets",
    "body": "Three engineers are accused of stealing sensitive mobile processor and cryptography files from Google and two other companies.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58233909,
    "published": 1771586162000,
    "title": "Bitcoin ETFs Lose Another $166M as Five-Week Withdrawals Near $4B",
    "body": "Bitcoin ETF outflows near $4 billion over the past five weeks, as experts debate whether the streak signals a reset or structural weakness.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58234634,
    "published": 1771587745000,
    "title": "Dual South Korean listings send Ethereum layer-2 token AZTEC surging 82%",
    "body": "Korean exchanges Upbit and Bithumb both added local currency pairs for the privacy-focused layer-2 token, triggering a sharp move in a thinly traded market.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Korea|Bithumb|Upbit|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58235227,
    "published": 1771588839000,
    "title": "Altcoin Liquidity Crunch: 83% Of Crypto Tokens Slip Into Bear Trend",
    "body": "Altcoin breadth on Binance has deteriorated sharply, with a large majority of tokens now trading below a widely watched long-term trend level, an exhaustion signal that CryptoQuant contributor Darkfost frames as a liquidity problem as much as a price problem. In a post on X, Darkfost (@Darkfost_Coc) shared a CryptoQuant chart tracking the share of Binance-listed altcoins trading below their 50-week moving average alongside Bitcoin’s price. His headline claim: “LIQUIDITY CRUNCH PUSHES 83% OF ALTCOINS INTO BEAR TREND,” arguing that most investors exposed to non-Bitcoin, non-stablecoin assets are “now in significant difficulty,” particularly those still holding positions. Altcoin Breadth Breaks Down On Binance Darkfost’s chart, titled “Altcoins performance (Binance)”, shows the percentage of altcoins below the 50-week moving average rising back into historically stressed territory. In his latest read, 83% of Binance altcoins are below that threshold, a sign that weakness is not isolated to a handful of names but spread across the tape. He also pointed to an even more extreme episode earlier this month. “Since the end of the bear market in 2023, a new record was set on February 7, with more than 92% of altcoins on Binance trading below this key technical support,” he wrote, describing it as a post-2023-cycle high in downside participation. Related Reading: House Democrats Urge Treasury Probe Into Trump Family’s Crypto Venture That stands in stark contrast to the conditions seen during earlier upside phases. Darkfost noted that in March 2024 only 6% of Binance altcoins traded below the 50-week line, and in December 2024 the figure was 7%. Outside of those multi-month windows, he added, at least half of altcoins remained under the threshold, behavior he characterized as meaningfully different from the prior cycle’s breadth dynamics. Darkfost framed the altcoin drawdown as inseparable from Bitcoin’s trend and the macro backdrop, suggesting that the market’s risk budget has tightened while altcoin supply has expanded. Related Reading: House Democrats Urge Treasury Probe Into Trump Family’s Crypto Venture “The market continues to be driven by BTC’s movements, which has been in a downtrend since October 2025 following an ATH at $126,000. At present, BTC’s momentum remains highly uncertain, with price still hovering at roughly 46% of its all time high. Rising geopolitical tensions, particularly between the US and Iran, alongside increasingly hawkish projections and tone from the Fed expressed in the latest FOMC minutes, are making the current environment especially challenging for highly volatile assets such as altcoins,” he wrote. The chart itself marks BTC near the mid-$60,000 range, underscoring his broader point: in a regime where Bitcoin direction is unclear and macro inputs are hostile to duration and volatility, breadth in higher-beta tokens can deteriorate quickly and then stay impaired. Why The 50-Week Line Matters Darkfost emphasized the 50-week moving average as a long-horizon filter used by market participants to separate corrective phases from structurally constructive ones. When a majority of tokens sit below it, rallies tend to be narrower, selection pressure rises, and “alt season” narratives become harder to sustain without a decisive shift in liquidity conditions. He attributed the current setup to “the increase in altcoin supply across the broader crypto market combined with still constrained liquidity conditions,” a combination that can mechanically dilute marginal flows. In that environment, he argued, outperforming becomes less about broad beta exposure and more about understanding how market structure has changed. At press time, the total crypto market cap excluding Bitcoin stood at $943.46 billion. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|altcoin|altcoins|crypto|Crypto bear market|crypto news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58235947,
    "published": 1771590164000,
    "title": "Bitcoin ETFs shed $166M as BTC heads for worst start in years",
    "body": "Spot Bitcoin ETFs near a five-week outflow streak, with $2.7 billion in losses year-to-date, as 2026 shapes up to be one of Bitcoin’s worst yearly starts.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58236388,
    "published": 1771590825000,
    "title": "Tether USDT supply set for biggest monthly decline since 2022 FTX collapse",
    "body": "Tether’s USDT is nearing its largest monthly supply drop since the collapse of FTX, with whales and smart money traders continuing to reduce their USDT holdings.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58237049,
    "published": 1771592448000,
    "title": "Bitcoin Market Bleeds $1 Trillion, Saylor Signals Strongest Crypto Conviction Yet",
    "body": "Michael Saylor kept buying while the market slid, and he did it out loud: “Neven been more bullish,” he said in an X post Thursday. His public posts and regulatory filings show Strategy continued to add to its Bitcoin pile even as price swings turned paper gains into big unrealized losses. Related Reading: Bitcoin’s Record Red Month May Be Setting Up A Reversal: Analysts The firm’s recent regulatory filing confirms a fresh purchase this month, while market reports and accounting disclosures show the wider hit to corporate treasuries. Market Value Drop Shakes Portfolios Bitcoin has shed roughly $1.2 trillion of market value since October 2025, and the wider crypto market has lost about $2 trillion in the same stretch. Prices that once pushed Bitcoin past $126,000 have fallen back toward the mid-$60,000s. That scale of decline has pushed several companies that used Bitcoin as a treasury asset into heavy mark-to-market losses, changing how investors view corporate crypto exposure. Never Been More ₿ullish. — Michael Saylor (@saylor) February 19, 2026 Strategy Keeps Buying According to the company’s own filings, Strategy acquired 2,486 BTC for roughly $168 million during mid-February, bringing its holdings above 700k coins. The buy was announced in a Form 8-K and has been picked up across market outlets. At the same time, accounting rules that require unrealized gains and losses to be reflected in reports mean the firm’s quarterly statements showed multibillion-dollar swings tied to Bitcoin’s price. That reality has put Strategy on the front lines of the debate over holding large crypto positions on balance sheets. Price Action And Headlines Moved Markets Bitcoin’s trading has been choppy. Headlines tied to geopolitics and macro policy moved traders, and low-volume sessions made swings feel bigger. ETF outflows and a string of liquidations amplified the slide. Still, there were moments when buyers stepped in and pushed prices up briefly; those countermoves have been picked over by analysts hunting for a bottom. Image: Wall Street Pit Bullish Voices, Loud And Public Eric Trump — speaking at an event at Mar-a-Lago — made a very bullish prediction that was reposted and amplified, and that kind of public optimism appears to have rubbed off on other high-profile backers. Go bitcoin today. The money won’t fix itself. — Michael Saylor (@saylor) February 13, 2026 Saylor reposted and echoed similar buy-the-dip messages, urging accumulation even as skeptics warned about the risks. At times political headlines tied to US President Donald Trump and related policy moves were singled out as part of the story behind the 2025 rally that preceded this correction. Related Reading: XRP On The Spotlight As Arizona Advances Landmark Digital Asset Bill Saylor’s latest comment shows he remains firmly confident in Bitcoin. Despite huge losses, he sees dips as buying chances and urges others to stay bullish, keeping his long-term conviction front and center. Featured image from Gemini, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|Geopolitics|Michael Saylor|Strategy|Trump",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58238160,
    "published": 1771594367000,
    "title": "Morning Minute: Base Breaks Up With Optimism",
    "body": "Base is taking their ball (onchain revenue) and going home (to their own chain).",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Opinion",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 58238219,
    "published": 1771594353000,
    "title": "Stablecoin A7A5 grows parallel system for sanctioned companies",
    "body": "Stablecoin ecosystem A7A5 has faced accusations of sanctions evasion and, according to some analysts, is creating an alternative, sanctions-free financial network.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 58239964,
    "published": 1771597854000,
    "title": "Mapping Out XRP’s Path To $1,200: Analyst Shares Insights",
    "body": "Recent market dynamics have given different reasons as to why the XRP price is programmed to shoot to double and triple digits. However, a supporter known as Remi Relief recently outlined a case for a four-figure XRP valuation, with the reason being that several unfolding events could lay the groundwork for a move toward $1,200 and even beyond. Remi Relief’s XRP price outlook is based on a combination of incoming regulations, geopolitical developments, and long-term pattern comparisons to XRP’s historic rally in 2017/2018. The Clarity Act And Regulatory Momentum According to XRP supporter Remi Relief, XRP’s price will break above $1,000 by the end of the cycle. This bullish outlook is based on how XRP reacts after the proposed Clarity Act is finally passed. The Clarity Act is an anticipated market structure bill that supporters believe could define clearer rules for digital assets in the United States and remove uncertainty around crypto regulation, including XRP. Ripple CEO Brad Garlinghouse is betting on the Clarity Act to be signed into law by April. Related Reading: What Happens If XRP Is Building Its Final Base At These Levels? However, Remi Relief noted that US President Donald Trump wants progress on the legislation’s passing as early as March 1. According to this view, regulatory clarity would significantly benefit Ripple Labs and, by extension, XRP. Advocates like Remi Relief are of the notion that once legal frameworks are solidified, institutional players that have will now be incentivized to begin allocating more capital into the crypto industry. As an institutional finance-centric crypto, XRP is well-positioned to attract a meaningful share of any large-scale inflows from financial institutions entering the crypto market. Another major point is with Ripple Treasury, which was recently introduced by GTreasury. Remi Relief noted that the platform handled $13 trillion in payments last year, none of which were processed through crypto rails. Imagine how much this would matter for XRP demand if even a fraction of that transactional volume were to migrate onto the XRP Ledger. The 2017/2018 Fractal And The $1,697 Projection XRP’s price action might currently be stuck under $1.50, but various technical analyses show it is still following price playbacks before bullish rallies in previous years. Remi Relief believes this is certainly the case, and a parabolic move is incoming, with a $1,697.27 XRP if the cryptocurrency follows the same pattern as the 2017/2018 cycle. Related Reading: XRP Emerges As Rotation Target As Investors Exit Bitcoin And Ethereum According to the analyst, not only is a $1200-$1700 target possible for XRP, but it’s also a conservative opinion. This plays into a prevailing sentiment where the $1,200 pathway is a high-conviction thesis among a segment of the XRP community. Some XRP proponents are even of the notion that market cap arguments of XRP reaching extravagant price targets like $1,000 and even five digits at $10,000 are misguided. Featured Image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Brad Garlinghouse|CLARITY Act|Donald Trump|GTreasury|Remi Relief|Ripple|Ripple Treasury|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58241588,
    "published": 1771600845000,
    "title": "Bitcoin pops then drops as Supreme Court strikes down Trump tariffs",
    "body": "As has been typical in crypto markets of late, even the most modest move higher was met with immediate selling.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Market Wrap|U.S. Economy|tariff|Donald Trump|Breaking News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58241431,
    "published": 1771600499000,
    "title": "Netherlands Bans Polymarket Over ‘Illegal Gambling Services’",
    "body": "Dutch regulator the Netherlands Gambling Authority this week ordered the prediction market to halt operations immediately.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "polygon|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 58243362,
    "published": 1771604029000,
    "title": "House Dems Raise National Security Alarms Over Trump Family’s Crypto Bank Charter Request",
    "body": "Lawmakers warned that approving World Liberty Financial's bank charter application could jeopardize the legitimacy of the U.S. banking system.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58242911,
    "published": 1771603255000,
    "title": "Dogecoin’s Third Time Breakout Could Send Price On 2,000% Rally To $2",
    "body": "Dogecoin is once again approaching a technical inflection point that has historically preceded explosive upside. According to crypto chartist and pattern analyst @TATrader_Alan, the meme coin is completing a structural setup that has already delivered two major parabolic advances. If the pattern resolves the same way for a third time, the projected upside could extend toward the $2 level, representing roughly a 2,000% move from the broader base region. Dogecoin’s Third Solid Base In a recent monthly timeframe analysis on X, the chartist pointed to what he describes as a recurring “Solid Base” formation. He notes that Dogecoin has completed this structure twice in prior cycles. On both occasions, the base-building phase was followed by rapid vertical expansion in price. Related Reading: Dogecoin Price Reach Key Decision Level To Trigger Another 100% Wave The chart highlights prolonged consolidation zones where the price compresses over an extended period. These zones are characterized by reduced volatility, gradual accumulation, and tightening ranges. In previous cycles, this compression phase acted as stored momentum. Once the price cleared the upper boundary of the structure, the move accelerated quickly into a parabolic markup phase. The current setup, as shown on the monthly chart, mirrors those earlier formations. Price action has once again spent significant time consolidating within a defined range, forming a clearly visible base. The analyst emphasizes that Dogecoin is now positioned at the edge of this third structure, suggesting that the compression phase may be nearing completion. Historically, the first two bases led to exponential rallies that dwarfed the preceding consolidation periods. The implication is not based on short-term speculation but on repeating structural behavior visible across multi-year cycles. The measured expansion from previous breakouts, when applied proportionally to the present base, supports the possibility of a move that could extend toward the $2 region if momentum unfolds in a similar fashion. Cup And Handle Pattern Reinforces Breakout Case On the daily timeframe, the chartist further identifies a classical continuation structure forming within the broader macro base. He outlines a Cup and Handle pattern developing in real time, reinforcing the larger bullish thesis. Related Reading: Dogecoin Price Can Still Reach $1, But It May Not Be Soon, Analyst Explains Why According to the chart, Dogecoin formed a rounded bottom with price dipping to approximately $0.08 before gradually recovering. The rally then carried the price to around $0.11, establishing the rim of the cup. Following that advance, the price began consolidating just below resistance, shaping the handle portion of the formation. This configuration is widely regarded as a bullish continuation setup, particularly when it forms within a larger accumulation structure. The handle reflects short-term profit-taking and controlled pullback. If price breaks decisively above the handle’s resistance level, the pattern typically projects a continuation move in the direction of the prevailing trend. Combined with the multi-year solid base structure on the monthly chart, the Cup and Handle adds a shorter-term trigger mechanism to the broader breakout narrative. Should resistance give way, the alignment of macro accumulation and classical continuation geometry would position Dogecoin for a move that, based on historical precedent, could extend dramatically higher and potentially validate the $2 target. Featured Image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|@TATrader_Alan|Cup and Handle Pattern|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58243836,
    "published": 1771604862000,
    "title": "South Korean Lawmakers Slam Regulators Over Bithumb's $43 Billion Bitcoin Blunder",
    "body": "Lawmakers in South Korea are intensifying scrutiny over the role of regulators after Bithumb accidentally gave out $43 billion in Bitcoin.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58245292,
    "published": 1771607399000,
    "title": "Dubai takes next step to make real estate flips instant in $16 billion tokenization plan",
    "body": "Dubai Land Department and Ctrl Alt move to the next phase of real estate tokenization project, enabling the resale of property tokens.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Tokenization|Tokenized Assets|Real World Assets|Dubai|XRP Ledger|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58245576,
    "published": 1771608049000,
    "title": "Bitcoin Rises After Supreme Court Rules Against Trump Tariffs",
    "body": "Bitcoin ticked up after the Supreme Court ruled that President Trump exceeded his authority in imposing most tariffs on foreign goods.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58245618,
    "published": 1771607876000,
    "title": "Core technical contributor to cease involvement with Aave DAO",
    "body": "After four years contributing, BGD Labs said it would be leaving the DAO, citing changes to the organization and taking an “adversarial position“ to its liquidity protocol.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58247659,
    "published": 1771611600000,
    "title": "Price predictions 2/20: BTC, ETH, XRP, BNB, SOL, DOGE, BCH, ADA, HYPE, XMR",
    "body": "The failure of the bulls to start a strong recovery in Bitcoin and the major altcoins suggests that the bears intend to remain active at higher levels.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 12,
        "NAME": "BCH",
        "CATEGORY": "BCH"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58249040,
    "published": 1771614375000,
    "title": "Specialized AI detects 92% of real-world DeFi exploits",
    "body": "New research claims specialized AI dramatically outperforms general-purpose models at detecting exploited DeFi vulnerabilities.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Artificial Intelligence|AI|Exploits|DeFi|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      }
    ]
  },
  {
    "id": 58248888,
    "published": 1771614022000,
    "title": "The Great Bitcoin Handover: $8.2 Billion BTC Swamps Binance As Retail Momentum Fades",
    "body": "Bitcoin is struggling to reclaim the $69,000 level as persistent selling pressure continues to dominate the short-term market structure. After multiple failed attempts to establish acceptance above this key psychological threshold, price action reflects a defensive environment marked by reduced risk appetite and elevated volatility. Traders remain cautious, with liquidity conditions tightening and momentum favoring sellers rather than sustained accumulation. Related Reading: Ethereum Breaks the Final Whale Floor In A 2018-Style Capitulation: What To Expect New on-chain data shared by analyst Maartunn adds another layer to the current landscape. According to his insights, Bitcoin whales are firmly dominating the market structure at this stage of the cycle. Over the past 30 days alone, approximately $8.24 billion worth of whale-held BTC has flowed into Binance, marking the highest level of large-holder inflows to the exchange in the last 14 months. Such a concentration of activity suggests that major participants are actively repositioning. The data also underscores Binance’s continued role as the primary liquidity venue for large-scale transactions. When whale flows accelerate toward exchanges at this magnitude, it often signals heightened strategic activity — whether for distribution, hedging, or tactical allocation. As Bitcoin consolidates below resistance, the behavior of these dominant market participants may play a decisive role in shaping the next directional move. Whale Dominance Intensifies As Retail Momentum Cools Maartunn further detailed the 30-day flow breakdown, offering a clearer view of how market participation is evolving. Over the past month, whale inflows to Binance have reached $8.24 billion and continue to trend higher. In comparison, retail inflows total approximately $11.91 billion but have begun to flatten. As a result, the retail-to-whale ratio currently stands at 1.45 and is steadily compressing. Although retail participation remains visible, its momentum is cooling. The pace of smaller deposits has slowed, suggesting declining conviction or reduced speculative activity among short-term traders. In contrast, whale deposits have increased consistently over the same period, indicating that larger entities are either actively positioning or reallocating capital with greater urgency. This dynamic is narrowing the gap between large and small participants on the exchange. When whale flows accelerate while retail flows plateau, market structure tends to become more top-heavy, with price increasingly influenced by institutional-scale actors rather than fragmented retail activity. The key takeaway is clear: large players are becoming more dominant on Binance, while smaller participants are gradually losing relative influence. In the current environment, Bitcoin’s next directional move may depend more heavily on whale strategy than retail sentiment. Related Reading: The 200 Million XRP Exodus: Investors Swap Speculation For Private Custody Bitcoin Tests Critical Support As Downtrend Accelerates Bitcoin’s 3-day chart reflects a decisive loss of momentum following the rejection near the $120,000 region in late 2025. Since that peak, price structure has transitioned into a clear corrective phase characterized by lower highs and accelerating downside pressure. The most recent leg lower shows a sharp breakdown from the $90,000–$95,000 consolidation zone, with BTC now hovering around the $68,000 area. Technically, Bitcoin is trading below the shorter-term moving average, which has rolled over and is sloping downward, reinforcing near-term bearish momentum. The intermediate moving average is flattening and beginning to turn lower, signaling weakening trend strength. Meanwhile, the long-term average remains upward sloping but sits well below current price levels, suggesting that while the macro structure has not fully collapsed, the market is in a transitional phase. Related Reading: The Altcoin Exodus: Trading Volumes Halve As Capital Flees To Bitcoin $65,000 Fortress Volume expanded noticeably during the recent selloff, indicating active distribution rather than a passive drift lower. However, the latest candles show some stabilization near the $65,000–$70,000 support region, an area that previously acted as a breakout zone earlier in the cycle. A sustained reclaim of the $75,000–$80,000 range would be required to restore bullish structure. Failure to hold current levels could expose deeper retracement toward long-term trend support. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|Bitcoin news|Bitcoin retail|Bitcoin Whale Activity|Bitcoin whales|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58251548,
    "published": 1771619419000,
    "title": "XRP Maintains Macro Bullish Structure Despite Deeper Correction",
    "body": "XRP continues to maintain its macro bullish structure despite experiencing a deeper corrective move than initially anticipated. Although price action has tested lower levels, it has not confirmed a higher-timeframe breakdown, suggesting the pullback is still part of a broader consolidation within an ongoing uptrend rather than a full trend reversal. XRP Dips Deeper, But HTF Level Still Holds In a recent XRP update, Hov noted that price action pushed deeper toward the lows than what would typically be acceptable for the previously considered diagonal scenario. The move forced a reassessment of the short-term structure. Despite that deeper sweep, the broader setup has not completely broken down. Related Reading: Historic Trend That Led XRP To A Sharp 40% Trend Has Just Reappeared Importantly, XRP has yet to produce a higher-timeframe close below the critical support level. Price is holding the area by a narrow margin, and as long as a decisive HTF breakdown is avoided, the broader bullish structure cannot be invalidated. Given the recent price behavior, Hov adjusted the corrective count, labeling the structure as a sideways combination correction within a larger-degree Wave 4. The pullback delivered a precise tag of the 50% retracement level, adding technical confluence to the idea that this could be a mature corrective phase rather than the start of a broader reversal. The next key development to watch is a clear five-wave advance from the recent low. XRP has already shown a clean micro five-wave structure off the bottom; something many other altcoins are lacking, as they continue to print overlapping three-wave moves instead. That relative structural strength keeps the bullish case alive. A sustained push toward the $2 region in a confirmed Wave 5 would increase confidence that a durable low is in place. From there, analysts would look for a controlled wave 3 retracement into support as confirmation, signaling that the market is preparing for continuation rather than a deeper breakdown. Technical Structure Remains Firmly Bullish XRP continues to maintain a technically bullish posture despite recent consolidation. Price action has pulled back, but the broader structure has not shifted into bearish territory. Momentum may have cooled, yet the underlying trend remains constructive. Related Reading: XRP Spot ETFs Riding The Bullish Wave, Attracting Broader Wall Street Allocation According to Steph Is Crypto, the key level to monitor is the 200-week moving average. As long as XRP holds above that long-term indicator, the macro uptrend remains intact. In previous market cycles, sustained bearish phases often began after a decisive break below this level, something that has not occurred in the current setup. At present, XRP appears to be consolidating within a broader bullish framework, meaning the structure still favors upside continuation unless proven otherwise. Trend dynamics have not flipped, and until major support gives way, the long-term outlook stays technically positive. Featured image from Peakpx, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Higher-Timeframe|Hov|HTF|Ripple|Steph is Crypto|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58251320,
    "published": 1771618500000,
    "title": "Bitcoin bears at risk of $600M liquidation, raising chance for rally to $70K",
    "body": "Despite bearish pressure and weak US economic data, Bitcoin's recovering hashrate and new onchain security protocols raise the chance for a surge to $70,000.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58251319,
    "published": 1771618465000,
    "title": "Dutch authorities call on Polymarket arm to cease activities",
    "body": "The prediction market's Dutch arm, Adventure One, allegedly offered illegal bets, including on elections in the Netherlands.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 58251838,
    "published": 1771620091000,
    "title": "Bitcoin Sell Pressure Is Easing, But Whales Keep Dumping on Exchanges: CryptoQuant",
    "body": "Bitcoin is down 46% from its October peak—and the largest holders keep depositing to exchanges, presumably to sell, says CryptoQuant.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58252560,
    "published": 1771621200000,
    "title": "Bitcoin whales participate in V-shaped accumulation, offsetting 230K BTC sell-off",
    "body": "Despite the sharp multi-month market downtrend, Bitcoin whales added 236,000 BTC since December 2025, with order size data showing large players building new positions.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58252934,
    "published": 1771622451000,
    "title": "Bitcoin shrugs off Trump's new tariffs, nears $68,000 as altcoins lead modest bounce",
    "body": "Crypto prices edged higher on Friday despite a splash of tariff turbulence after the U.S. Supreme Court ruled Trump's levies illegal.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Market Wrap|Bitcoin News|Donald Trump|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58252796,
    "published": 1771622107000,
    "title": "Bitcoin And Ethereum Post Worst Start To A Year On Record: Fortune",
    "body": "The industry’s largest cryptocurrencies, Bitcoin (BTC) and Ethereum (ETH), are enduring one of their most difficult openings to a year on record, according to a recent analysis by Fortune, with both digital assets trading sharply below their previous peaks. Bitcoin is currently down roughly 46% from its all-time high, while Ethereum has fallen about 60% from its record level. The steep declines mark what the publication describes as historically poor year-to-date performances for the assets. Bitcoin, Ethereum Lag While S&P 500, Gold Post Gains While Bitcoin and Ethereum, along with broader crypto prices, have often moved in tandem with equities in recent years, that relationship has weakened over the past two months. Since January, major US stock indices have edged higher. The S&P 500 has gained approximately 0.4%, and the Dow Jones Industrial Average has climbed 2.3%. Precious metals have also performed strongly. Gold has surged about 17% since the start of the year, while silver has advanced roughly 14%, even after experiencing a brief drop several weeks ago. Related Reading: ‘Sell Bitcoin Now,’ Peter Schiff Warns, Predicts $20,000 Target On Breakdown The disconnect between cryptocurrencies and broader market gains has prompted some industry observers to declare the arrival of another “Crypto Winter.” “We’re certainly in a Crypto Winter,” said Danny Nelson, a research analyst at crypto asset manager Bitwise. He pointed to investor behavior as evidence of deteriorating sentiment. “You can tell by how investors react to good news,” Nelson said. “They don’t.” ‘We’re Really Close To The End’ Despite the current pullback and the increased challenges for prices seen since the October 10 liquidation event, Nelson argues that the underlying foundation of the industry is strengthening. “Crypto’s reality is getting stronger,” he said, adding that the structural changes underway are likely to outlast the current downturn. Related Reading: House Democrats Urge Treasury Probe Into Trump Family’s Crypto Venture Similar sentiments have been expressed by Tom Lee, cofounder of research firm Fundstrat and a long-time supporter of Ethereum. In a recent interview, Lee suggested the market may be nearing a turning point, stating, “We’re really close to the end.” Whether the latest slump proves to be a temporary correction or a deeper cycle shift remains uncertain. For now, however, the data underscores a challenging start to the year for the cryptocurrency market, even as other asset classes continue to surge. At the time of writing, Bitcoin is trading at $67,595, which is a slight 1% increase compared to Thursday’s prices. Ethereum is trading at around $1,968, with similar gains over the past 24 hours. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|BTCUSDT|crypto|crypto news|ETH|ethereum|ethereum news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58256392,
    "published": 1771630252000,
    "title": "Bitcoin Big-Money Exits: Large-Holder Supply Hits Lowest Since May 2025",
    "body": "On-chain data shows the key Bitcoin investors have been distributing recently, with their supply share dropping to the lowest level in months. Large Holder Demand For Bitcoin Has Remained Weak Recently In a new post on X, on-chain analytics firm Santiment has talked about how the Bitcoin investor behavior has compared between the top and low ends of the market. Related Reading: XRP Social Sentiment Hits 5-Week High—BTC, ETH Mood Still Off The analytics firm has chosen these wallet ranges to represent the two sides: 0 to 0.01 BTC and 10 to 10,000 BTC. The former includes the smallest of retail investors, while the latter includes key investor cohorts like the sharks and whales. Below is the chart shared by Santiment that shows the trend in the percentage of the total circulating Bitcoin supply held by each cohort. As is visible in the graph, the 0 to 0.01 BTC cohort has been expanding its supply since the October price peak. Bitcoin has witnessed a deep drawdown inside this window, but the data would imply that it hasn’t held back retail traders from accumulating. In total, this accumulation has expanded the holdings of these small hands by 2.5%, taking their percentage supply share to the highest level since June 2024. While retail has been buying, the sharks and whales have shown a different trajectory. From the chart, it’s apparent that the 10 to 10,000 BTC holders sold alongside the market drawdown between October and December. In January, these investors participated in some buying, which interestingly coincided with a drop in retail holdings. Then, the drawdown toward the end of the month again kicked off a selloff from the key investors. This selloff was steep, in fact sharper than any part of Q4 2025’s distribution phase. Recently, even as Bitcoin has made some recovery from its $60,000 low and found some stability, the big-money investors haven’t shown any return of bullish conviction. Compared to the October peak, the supply of the 10 to 10,000 BTC holders is now down 0.8%, which has taken the network share of this group to the lowest since May 2025. Related Reading: Bitcoin Consolidating In A Triangle—Is A 15% Move Next? The analytics firm explained: Optimally, we begin to see these two Bitcoin groups begin to reverse course. Without key stakeholder support, any spark of a rally will tend to be slightly limited due to the lack of large capital. In another X post, Santiment has also discussed the behavior of the mid-tier Bitcoin holders, occupying the space between retail and large investors. As displayed in the chart, the 0.01 to 1 BTC wallets have seen their combined Bitcoin supply hit a 15-month high following a 1.05% increase since October. Meanwhile, the 1 to 10 BTC hands have reduced their holdings by 0.49% in the same period. BTC Price At the time of writing, Bitcoin is trading around $67,400, up 0.7% over the last week. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin Big-Money Holders|Bitcoin whales|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58258497,
    "published": 1771635611000,
    "title": "Bitcoin Enters Historic Buying Zone, Indicator Suggests",
    "body": "Reports say a popular risk metric has fallen into territory that, in the past, lined up with major buying opportunities for Bitcoin. Related Reading: Bitcoin Market Bleeds $1 Trillion, Saylor Signals Strongest Crypto Conviction Yet The short-term Sharpe Ratio has plunged to about -38.38, a level that markets rarely see. Traders who follow on-chain and statistical signals point out that similar extremes showed up around the lows of 2015, 2019, and late 2022 — moments that later saw sizable recoveries, CryptoQuant verified author Moreno said. Sharpe Ratio Hits Unusual Low The Sharpe Ratio measures returns against volatility. When it drops far below zero over short stretches, it means investors have been taking heavy losses relative to how wildly the market is moving. A -38.38 reading is extreme. Reports note this kind of reading has happened only four times in Bitcoin’s history, and each time followed a stretch of high stress and weak sentiment. That pattern suggests selling can exhaust itself even when the charts look bleak. Bitcoin’s Short-Term Sharpe Ratio Hit a Level Historically Reserved For Generational Buying Zones “The arrows in the chart illustrate this clearly: each prior extreme negative reading was followed by violent recoveries to new highs.” – By @MorenoDV_ pic.twitter.com/nxFBUgHxi9 — CryptoQuant.com (@cryptoquant_com) February 19, 2026 Historical Lows And Recoveries Past cycles give one way to read the signal. Around $287 in 2015, and near $4,100 in early 2019, and again around $15,000 in late 2022, risk measures and mood were at their worst before money flowed back in. Based on reports from on-chain analysts, those moments shared common traits: many traders had capitulated, volume was thin, and volatility spiked. Yet those conditions later coincided with multi-month rallies that erased large parts of the prior losses. Bitcoin Price Action Bitcoin’s price has been sensitive to headlines lately. It slid under psychological levels as risk assets weakened, and trading has been muted. Markets reacted to diplomatic rows and conflict-related stories, causing bigger moves in thin markets. Sometimes BTC held up and brushed off sharp risk-off flows. Other times it fell further, especially when liquidity dried up. That stop-and-start behavior has left short-term traders cautious, while longer-term holders watch for signs that selling momentum is fading. Related Reading: Bitcoin’s Record Red Month May Be Setting Up A Reversal: Analysts Clear Coast Ahead? Based on reports and the data, this signal is not a magic ticket. External forces — such as tightening liquidity or a macro shock — can keep downward pressure longer than statistical patterns alone would predict. The recent 50% fall from an all-time high near $126,200 in October 2025 to about $65,700 shows much of the move is already behind us, but it does not rule out more pain. Risk management matters. Position sizing and clear entry plans will help anyone who decides to act around these levels. Featured image from Anne Connelly – Medium, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|CryptoQuantt|Sharpe Ratio",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58259982,
    "published": 1771639216000,
    "title": "XRP Ledger Gets x402 Facilitator For AI Agent Payments: Why This Is Bullish",
    "body": "t54.ai has launched an x402 “facilitator” on the XRP Ledger (XRPL), a payments relay that lets AI agents pay for API calls and digital services in-line with normal HTTP requests using XRP or RLUSD. The pitch is simple: turn pay-per-request into a native part of the web stack, no accounts, no API keys, and settlement that happens on-chain. AI Agents Can Now Pay Via XRP Ledger The release plugs XRPL into x402, an open payments standard built around the long-reserved HTTP status code 402 Payment Required. In an x402 flow, a client requests a resource, the server replies with a 402 and machine-readable payment requirements, and the client retries the request with proof of payment. Coinbase’s x402 documentation frames the goal as programmatic access “without accounts, sessions, or complex authentication,” so both humans and autonomous agents can pay for usage-based services directly over HTTP. Related Reading: The 200 Million XRP Exodus: Investors Swap Speculation For Private Custody On X, t54.ai described the facilitator as “now live on the XRPL,” adding that agents can pay with “XRP and RLUSD – no API keys, no accounts, no friction.” Another post positioned x402 as “the open standard for machine-native payments,” where the server responds with HTTP 402 “Payment Required” and the agent pays immediately, with the facilitator handling verification and settlement on-chain. Popular XRP community account BankXRP wrote via X: “t54ai just launched the x402 facilitator AI agents can now pay for API calls and services with frictionless $XRP or $RLUSD micropayments using the HTTP 402 standard. No API keys. No accounts. Instant, sub-cent fees. Real machine-to-machine economy on the fastest, most scalable ledger in crypto.” t54’s XRPL deployment is designed to be “plug and play,” emphasizing no custody and no API keys. The public documentation for the XRPL x402 facilitator says it processes x402 payments on XRPL using payer-signed presigned Payment transaction blobs, and supports XRP plus IOU tokens including RLUSD (and USDC). Resource servers verify and settle by calling standard facilitator endpoints like /verify and /settle, mirroring the core x402 architecture where the facilitator is the chain-aware component that validates payment payloads and executes settlement. Related Reading: This Korean XRP Exchange Data Has The Community Losing It t54.ai also claims the system is already “in production” with BlockRunAI, a unified gateway that provides agents access to “30+ models (GPT, Claude, Grok, etc.).” In that integration, agents pay per request via x402, and the resulting payment volume “is now settling on XRPL,” effectively turning model inference and tool calls into metered on-chain commerce. Why This Is Bullish For XRP The “bullish” framing here isn’t about a single partnership logo, it’s about inserting XRPL into a broader emerging standard for agent-native commerce. x402 is explicitly designed to be network-agnostic, but in practice, standards only become real once developers can ship them with minimal ceremony. A working facilitator on XRPL means one more credible rail for high-frequency, low-value payments where the unit economics break traditional billing. It also cleanly links XRPL’s identity—fast settlement and low fees—to a use case that’s structurally growing: autonomous software paying other software. x402’s ecosystem pages and docs emphasize pay-per-use pricing and minimal integration overhead; that aligns with agent workflows where “thousands of API calls” and tool invocations need granular billing rather than subscriptions. None of this guarantees meaningful volume. But it does make the path to volume legible: more x402-enabled endpoints, more agent clients, and more facilitators that can clear payments cheaply and predictably. At press time, XRP traded at $1.4126. sd Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|Ripple|x402|xrp|XRP Ledger|XRP Ledger News|xrp news|XRP Price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]