[
  {
    "id": 57147347,
    "published": 1768366840000,
    "title": "Bitcoin Nears ‘Historic’ Technical Test As Price Eyes $93,500 Barrier – What’s Next?",
    "body": "As Bitcoin (BTC) breaks out of key resistance levels, an analyst suggests that the cryptocurrency is positioning itself for a move to higher levels and a retest of a crucial technical area in the coming weeks. Related Reading: Monero (XMR) Hits New $610 All-Time High – Veteran Trader Shares Silver-Like Setup Bitcoin Approaching Make-Or-Break Test On Tuesday, Bitcoin surged 2.5% to retest the $93,500 resistance level for the first time in a week. The cryptocurrency has been hovering between the $84,000 to $93,500 price range for three months and has failed to turn this level into support multiple times. Analyst Rekt Capital recently noted that the flagship crypto is near a “historic” test as it has begun to form “another technically decisive region” just above current price levels. The market watcher explained that BTC is approaching its dynamic Bull Market Exponential Moving Average (EMA) cluster, where the 50-week EMA and 21-week EMA are getting closer. This key cluster, currently located between the $96,000 and $97,500 levels, has historically been tested before a “meaningful crossover,” with the Bitcoin price overextending beyond the cluster. However, this has usually been followed by an unsuccessful confirmation of this region as support. “When that happens, the crossover itself often follows the bearish price event, rather than causing it, with the EMA cluster flipping into resistance from the underside and leading to downside continuation,” the analyst detailed. Notably, past cycles reveal that the 50-week and 21-week EMAs can move very close together, Rekt Capital wrote, emphasizing that they can even overlap for prolonged periods before a decisive crossover. Currently, Bitcoin has yet to retest and overextend beyond the two EMAs, but its historical performance suggests that it will likely occur. Moreover, BTC’s price is “positioning itself in a way that could allow for a springboard higher, potentially enabling a test of this cluster in the weeks ahead. The key question is timing.” BTC Price Breaks Out Of Key Resistances In his analysis, the market observer discussed BTC’s recent performance, which has seen a structural change despite the sideways price action. Last week, the cryptocurrency’s price closed above its multi-week downtrend, which has been serving as a major resistance point since late November. This marks “a small but notable technical milestone” as Bitcoin now holds above the November and December highs in the weekly timeframe, treating the previous resistance as support. In addition, the mid-zone of its local range, around the $90,500 level, is now “almost perfectly confluent with the former Downtrend, meaning the Downtrend that last week rejected price is beginning to act as layered support instead.” Therefore, if Bitcoin continues to hold the mid-range region, the price should be able to challenge higher levels and find a path toward $100,000. Rekt Capital added that, unlike previous retests, the most recent rejection from the crucial $93,500 resistance was significantly shallower and shorter, suggesting that it was getting weaker. Related Reading: Top Bullish Predictions That Put XRP Price At New All-Time Highs Above $3.8 Now, the flagship crypto has successfully retested the downtrend breakout area as support and momentarily reclaimed the $93,500 resistance, surging above the $94,000 area once again. Ultimately, BTC will need to hold this area and close the week above $93,500 to “kickstart a breakout from the Weekly Range as per previous green circles,” the analyst concluded. As of this writing, BTC trades at $94,334, a 2.6% increase in the weekly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|bitcoin breakout|Bitcoin correction|Bitcoin EMA|Bitcoin price analysis|btc|btc rejection|BTCUSDT|crypto analyst|Crypto Market Recovery|Crypto trader",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 57,
        "NAME": "XMR",
        "CATEGORY": "XMR"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57147523,
    "published": 1768367328000,
    "title": "Solana (SOL) Escapes Resistance Zone, Rally Pressure Intensifies",
    "body": "Solana started a fresh increase above the $142 zone. SOL price is now consolidating above $142 and might aim for more gains above the $150 zone. SOL price started a fresh upward move above the $142 and $145 levels against the US Dollar. The price is now trading above $142 and the 100-hourly simple moving average. There is a bullish trend line forming with support at $140 on the hourly chart of the SOL/USD pair (data source from Kraken). The pair could extend gains if it clears the $150 resistance zone. Solana Price Starts Fresh Surge Solana price started a decent increase after it settled above the $135 zone, like Bitcoin and Ethereum . SOL climbed above the $140 level to enter a short-term positive zone. The price even smashed the $142 resistance. The bulls were able to push the price above $145. A high was formed at $148, and the price is now consolidating gains. There was a minor decline below the 23.6% Fib retracement level of the recent upward move from the $138 swing low to the $148 high. Solana is now trading above $142 and the 100-hourly simple moving average. Besides, there is a bullish trend line forming with support at $140 on the hourly chart of the SOL/USD pair. On the upside, the price is facing resistance near $148. The next major resistance is near the $150 level. The main resistance could be $155. A successful close above the $155 resistance zone could set the pace for another steady increase. The next key resistance is $162. Any more gains might send the price toward the $170 level. Downside Correction In SOL? If SOL fails to rise above the $148 resistance, it could start another decline. Initial support on the downside is near the $144 zone. The first major support is near the $143 level or the 50% Fib retracement level of the recent upward move from the $138 swing low to the $148 high. A break below the $143 level might send the price toward the $140 support zone and the trend line. If there is a close below the $140 support, the price could decline toward the $135 support in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is gaining pace in the bullish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is above the 50 level. Major Support Levels – $144 and $140. Major Resistance Levels – $148 and $150.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Technical analysis|Sol|Solana|solbtc|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57147631,
    "published": 1768366841000,
    "title": "Bitcoin surges above $95,000 as ether, solana, cardano jump 8% on investor optimism",
    "body": "Lower inflation eased pressure on bond yields and improved liquidity conditions, a setup that has historically favored crypto and other risk assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57148138,
    "published": 1768368815000,
    "title": "‘Concerning trend’: Impersonation scams swell 1400% in 2025",
    "body": "Crypto security experts said a good way to counter scams that rely on deceiving victims is to be skeptical of every unsolicited message and interaction.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57148670,
    "published": 1768370426000,
    "title": "Monero (XMR) Rockets 51% To New ATH, But Watch Out For FOMO",
    "body": "Monero (XMR) has witnessed a sharp rally to a new record during the last few days, but social media suggests FOMO could be brewing in the market. Monero Has Shot Up To A New All-Time High Bitcoin and most other cryptocurrencies have been locked in consolidation recently, but Monero has been an outlier, with its price breaking away with a strong surge. Related Reading: Bitcoin Decouples From Global Liquidity: Analyst Says Quantum Threat Behind It Below is a chart that showcases how the asset’s recent performance has looked. The sharp rally has led to new all-time highs (ATHs) for the privacy-focused token, with the latest one coming earlier in the past day around $695. XMR has retraced a bit since this new high, but it’s still in a weekly profit of 51%, which is significantly higher than the returns of other top assets. For perspective, Bitcoin and Ethereum have seen returns of +1% and -2% in this period, respectively. Fellow privacy coin Zcash (ZEC) was flying earlier, but the asset has faced a steep 23% drop during the same window. Generally, rallies of the order that Monero has seen attract attention from traders, and data would confirm that the same has been true for the latest one as well. XMR Has Seen A Peak In Social Dominance Recently According to data from analytics firm Santiment, the Monero Social Dominance witnessed a spike recently. This indicator keeps track of the percentage of the Social Volume associated with the top 100 tokens that a given cryptocurrency is responsible for. The Social Volume here refers to a measure of the total number of posts/comments/threads on the major social media platforms that contain mentions of a given asset. In other words, it tells us about the amount of discussion that a particular coin is receiving from social media users. As such, the Social Dominance contains information about how the degree of talk surrounding a cryptocurrency compares against that of the top 100 coins combined. Here is a chart that shows the trend in this metric for Monero since the start of 2026: As displayed in the above graph, the Monero Social Dominance saw a huge spike on Sunday as the asset’s rally took off, suggesting social media interest in the asset shot up. Historically, a rapid surge in the Social Dominance has often corresponded to Fear Of Missing Out (FOMO) developing among traders, which is something that tends to not end well for rallies. Related Reading: Bitcoin HODLer Selloff Ending? LTH Outflows Decline Despite the crowd excitement, however, XMR has only continued to go up since the spike, setting new ATHs. Given the past pattern with digital asset markets, though, it only remains to be seen how long the coin can sustain its move. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Monero|monero|Monero ATH|Monero Development Activity|Monero Social Dominance|XMR|xmrusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 57,
        "NAME": "XMR",
        "CATEGORY": "XMR"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57148620,
    "published": 1768370312000,
    "title": "XRP zooms 6% higher on surge in trading activity",
    "body": "While XRP's recent rally stands out in a mixed crypto market, it remains below longer-term resistance levels.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57148423,
    "published": 1768369746000,
    "title": "Why Ethereum Could Be Ready to Outperform Bitcoin in 2026",
    "body": "Ethereum could narrow its performance gap with Bitcoin in 2026 as capital rotates and on-chain activity improves, Decrypt was told.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57148731,
    "published": 1768370555000,
    "title": "Stablecoin yields create ‘dangerous’ parallel bank system: JPMorgan exec",
    "body": "JPMorgan chief financial officer Jeremy Barnum told investors in an earnings call that stablecoin yields are a “dangerous and undesirable thing.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 57150026,
    "published": 1768373976000,
    "title": "Dogecoin jumps nearly 9% as buyers push price out of recent downtrend",
    "body": "The rally in meme coins like Dogecoin and Pepe reflects renewed speculative interest as broader crypto markets remain mixed.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57150789,
    "published": 1768376077000,
    "title": "U.S. spot bitcoin ETFs pull in $750 million in strongest day since October",
    "body": "Cooling inflation and post–year-end rebalancing help draw institutional money back into spot bitcoin funds.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57151365,
    "published": 1768377600000,
    "title": "Spanish bank Bankinter joins BBVA and Tether with stake in crypto exchange Bit2Me",
    "body": "The investment strengthens Bit2Me's capital structure and supports its regulatory ambitions in Europe and Latin America.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Bit2Me|Spain|Bankinter|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57151483,
    "published": 1768377985000,
    "title": "Visa teams up with BVNK to launch stablecoin payouts",
    "body": "The new feature lets companies send money to digital wallets instantly, even outside banking hours.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Visa|Stablecoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57152035,
    "published": 1768379409000,
    "title": "Ripple Builds XRP ‘Wall Street Kit’: Developer Claims ‘Billions Incoming’",
    "body": "Software engineer and AI founder Vincent Van Code (@vincent_vancode) is arguing that institutional barriers to holding and using XRP have largely shifted from “market structure” to “plumbing,” claiming Ripple has spent 2025–2026 assembling an institutional stack for custody, treasury, and prime brokerage that makes large-scale participation operationally viable. In a post on X on Wednesday, the engineer framed self-custody as a non-starter for traditional allocators managing retirement pools, pensions, and bank balance sheets. Ripple Assembles The XRP ‘Wall Street Kit’ “Institutions juggling billions in 401(k)s, pensions, hedge funds, banks & governments? Self-custody was always insane—audit hell, compliance nightmares, risk officers saying ‘no way,’” he wrote. “That changed in 2025–2026. Ripple built the full-stack bridge: regulated, scalable, bank-trusted infrastructure so big money can finally hold & use XRP + RLUSD without the chaos.” Related Reading: Why XRP Is Gearing Up For A Massive Week Van Code’s core contention is that the crypto-native custody debate misses the institutional reality: risk committees, auditors, and compliance functions require regulated custody, reporting, and controls that can plug into existing workflows. He argues Ripple’s recent buildout amounts to a “Wall Street kit” that addresses those constraints end-to-end, spanning payments rails, corporate treasury tooling, prime brokerage services, and bank-grade custody. While the post is advocacy rather than a formal Ripple announcement, it reflects a view increasingly common among XRP supporters: that productized rails and regulated wrappers matter as much as market narratives when large allocators consider adding exposure or utility. Van Code pointed to Ripple Payments as the transaction layer, describing it as “ISO 20022-compliant, real-time cross-border rails on XRPL—already moving billions for global banks.” He then tied institutional adoption to what he portrayed as adjacent infrastructure designed to make XRP and Ripple’s RLUSD workable inside corporate and financial-institution operations. Related Reading: XRP Is At An Unique Moment In History: Developer Calls End Of Suppression Among the pieces he highlighted was GTreasury, which Ripple acquired for $1 billion, characterizing it as an enterprise treasury management platform enabling corporations to manage “fiat + digital liquidity in real-time.” He also cited Ripple Prime, described as being “powered by Hidden Road acquisition for $1.25B”, as a prime brokerage stack offering “clearing, financing & OTC trading—including XRP & RLUSD—with seamless XRPL settlement for faster, cheaper post-trade ops.” For custody, he argued Ripple has converged on a bank-facing offering through a series of deals and integrations. “Ripple Custody (bolstered by Palisade acquisition + prior Standard Custody/Metaco) → Bank-grade, regulated storage with MPC security, multi-chain support & zero-trust architecture,” he wrote, adding that it is “auditable, insured, scalable for billions.” Van Code also claimed “RLUSD reserves [are] custodied by BNY Mellon for ultimate trust.” The post’s conclusion was blunt about expected impact. “Bottom line: Excuses erased. Compliance baked in. Custody risk? Solved,” Van Code wrote. “Institutions aren’t just watching—they’re quietly stacking & building on XRPL. 2026 is the year XRP shifts from ‘spec play’ to core financial infrastructure. Billions incoming.” If that thesis holds, the next signal for markets will not be rhetoric but observable integration: whether these components translate into sustained institutional flows, deeper liquidity venues, and production use of XRP and RLUSD, ultimately showing up in price discovery. At press time, XRP traded at $2.15. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|Ripple|ripple news|xrp|xrp news|XRP Price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57151896,
    "published": 1768378929000,
    "title": "Efforts to bulletproof Ethereum are paying off in user metrics",
    "body": "The Ethereum blockchain underwent a series of upgrades last year that have resulted in lower transaction fees and more active addresses.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57152722,
    "published": 1768381200000,
    "title": "Binance Wallet unlocks in-app leveraged crypto futures trading with Aster team-up",
    "body": "Binance Wallet's new feature allows users to trade leveraged futures directly from their crypto wallets through an integration with decentralized exchange Aster.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Binance|Markets|perpetual contracts|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57152870,
    "published": 1768381404000,
    "title": "UK rolls back digital ID for work checks as privacy fears drive backlash",
    "body": "UK Prime Minister Keir Starmer scrapped plans to make digital ID mandatory for workers after a backlash over “Orwellian” surveillance fears.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57152869,
    "published": 1768381200000,
    "title": "Ripple targets MiCA passporting in EU with Luxembourg e-money nod",
    "body": "The preliminary Luxembourg approval boosts Ripple’s EU expansion aims following its recent UK authorization, supporting its push toward full MiCA compliance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57153398,
    "published": 1768383042000,
    "title": "Bitcoin’s New Power Buyers: Companies Bought 3 Times What Miners Produced",
    "body": "According to on-chain data, companies have piled into Bitcoin at a pace that now outstrips new supply. Corporate treasuries held by public and private firms rose from about 854,000 BTC to roughly 1.11 million BTC over the past six months, an increase of around 260,000 BTC — roughly 43,000 BTC per month. This adds close to $25 billion in value to corporate balance sheets and points to a growing appetite among firms for holding the coin, on-chain analytics provider Glassnode disclosed, Tuesday. Related Reading: Dogecoin Bulls Watch $0.28 As Breakout Signals Stack Up Corporate Treasuries Swell A single firm dominates that pile. Strategy now controls the largest share of corporate Bitcoin, holding 687,410 BTC after a fresh buy earlier this month. The company disclosed it acquired 13,627 BTC between January 5 and January 11, its biggest purchase since last July. Reports have highlighted how this concentration means a few big buyers still shape the corporate treasury picture. Over the past 6 months, Bitcoin treasuries held by public and private companies have grown from ~854K BTC to ~1.11M BTC. That’s an increase of ~260K BTC, or roughly ~43K BTC per month, highlighting the steady expansion of corporate balance-sheet exposure to Bitcoin.… https://t.co/hHXjcSDDj4 pic.twitter.com/oluVGO2bGD — glassnode (@glassnode) January 13, 2026 Smaller, but still significant corporate holders are visible on the list. MARA Holdings, for example, holds about 53,250 BTC. That makes it one of the largest corporate holders after Strategy, and shows that miners and mining firms are also choosing to keep a chunk of the coin they create. ETF Demand Could Tighten Supply Exchange-traded funds are part of the story. Spot Bitcoin ETFs in the US pulled in more than $20 billion in flows during 2025, with some funds taking the largest share of those inflows. Analysts say ETF buying can soak up fresh supply and, if consistent, might remove available coins from the market for long periods. That dynamic has been flagged as one reason corporate accumulation could matter more now than in past cycles. Miners Are Producing Less Than Corporates Are Buying Over the same six months, miners are estimated to have created about 82,000 BTC. That means corporate buying has outpaced mining issuance by roughly three to one. In plain terms: more Bitcoin is being added to company balance sheets than is coming out of the ground, which tightens available supply if buyers continue to hold rather than sell. Related Reading: Futures Frenzy Pushed Crypto Exchange Volume To Nearly $80 Trillion In 2025 Price Action And Macro Watch Bitcoin has been trading in a narrow range near $92,000 ahead of key US inflation figures, with the $90,000 level seen as a psychological marker for traders. Safe-haven interest has stayed firm amid geopolitical noise and questions about central bank policy, leaving prices supported but range-bound. Short-term moves will likely reflect both ETF flows and whether existing holders keep selling into demand. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|etf|miners|Strategy",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57153759,
    "published": 1768383638000,
    "title": "France flags 90 unlicensed crypto firms ahead of MiCA cutoff: Report",
    "body": "Of the 90 crypto firms registered in France without a MiCA license, 40% are reportedly not seeking the license, while 30% remain unresponsive as regulators warn of July shutdowns.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57154406,
    "published": 1768385620000,
    "title": "Galaxy warns Senate crypto bill gives US Treasury massive surveillance power",
    "body": "Galaxy says the draft crypto market structure bill would give the US Treasury new powers to freeze transactions and deploy Patriot Act–style measures.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57154723,
    "published": 1768386302000,
    "title": "Animoca buys Somo as NFT market rebounds early in 2026",
    "body": "Animoca’s Somo acquisition expands its digital collectibles strategy as NFTs show early signs of renewed trading activity.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 57154579,
    "published": 1768385728000,
    "title": "Ripple wins early money license nod in Luxembourg for Europe expansion",
    "body": "The payments firm says the CSSF has issued a preliminary approval for an EMI license, a step toward offering regulated crypto and stablecoin payment services across the EU.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57156293,
    "published": 1768390832000,
    "title": "Bitcoin clears $94,500 as altcoins steal the spotlight: Crypto Markets Today",
    "body": "Crypto markets pushed higher on Wednesday after bitcoin broke above a key resistance level, triggering heavy liquidations and paving the way for sharp gains across altcoins.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|Derivatives|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57156221,
    "published": 1768390610000,
    "title": "MetaPlanet just 5% away from restarting share sales for bitcoin buying",
    "body": "Metaplanet shares approached the 637 yen trigger that reactivates the company’s moving strike warrants and unlocks hundreds of millions for new bitcoin purchases.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|MetaPlanet|Digital Asset Treasury|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57156953,
    "published": 1768392460000,
    "title": "Spain’s Bankinter joins $35M Bit2Me round amid growing bank crypto alliances",
    "body": "Bankinter joins Tether and BBVA in the $35 million investment round after the Spanish crypto exchange received its MiCA license in 2025.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57157343,
    "published": 1768393808000,
    "title": "Bitcoin’s Comeback Stalls As Crypto Funds Bleed Capital—Analyst",
    "body": "According to IG analyst Chris Beauchamp, Bitcoin is stuck in a fragile phase as the market tries to climb out of a rough patch. Prices have been moving in a narrow range and investors appear cautious. Related Reading: Futures Frenzy Pushed Crypto Exchange Volume To Nearly $80 Trillion In 2025 Bitcoin has been trading just above $94,000 when this report was made, which is about 3.5% higher than its opening price for the year of $88,650, but still below an early-year peak near $94,780. Fund Flows Keep Pressure On Reports show that fund movements have been a big drag on sentiment. Bitcoin ETFs saw $1.38 billion in outflows between January 6 and January 9. Based on CoinShares data, digital asset vehicles recorded a net outflow of $454 million in the prior week. The year opened with strong demand — crypto-based ETPs pulled in over $1 billion in the first two trading days — but that momentum faded and ETPs retained $580 million at the end of the week of January 3. Last week, investors withdrew $405 million from Bitcoin ETPs and $116 million from Ethereum ETPs. Those shifts in cash show how quickly mood can turn and how dependent the rally is on fresh money. CRYPTO FUND OUTFLOWS SLOW RECOVERY Cryptocurrencies are recovering gradually, but gains remain limited as investor caution persists, marked by continued outflows from crypto funds, says IG analyst Chris Beauchamp. He notes that prices lack fresh inflows needed for a stronger… — *Walter Bloomberg (@DeItaone) January 13, 2026 Key Levels And What They Mean Beauchamp pointed to $95,000 as a crucial level for Bitcoin. According to his note, a reclaim and steady hold above that area would be a sign the market has broken to the upside. At the time of writing, Bitcoin actually moved past the $94k level, briefly hitting $95.450 before returning to the $94k mark. On the downside, $90,000 is being watched as an important psychological floor. The market has been consolidating below its yearly high, and that tight range is keeping trading quiet. Some coins that had jumped earlier, like XRP and Cardano, have seen their gains trimmed as this consolidation takes hold. Macro Events Could Tip Prices Several outside factors could push the market one way or another. US inflation data, which sits at 2.7%, has reduced the odds of a near-term Fed rate cut, and that outlook can limit risk appetite in crypto. The banking sector’s Q4 earnings are scheduled to come through this week and may change investor tone if results surprise. A planned crypto market bill hearing was expected to act as a catalyst; it has since been moved to later in January. Then we have geopolitical tensions and questions about Fed independence have kept safe-haven demand alive, adding another layer of uncertainty. Related Reading: Dogecoin Bulls Watch $0.28 As Breakout Signals Stack Up What Comes Next Based on reports and the analyst’s view, the recovery will likely need a fresh wave of inflows to gain real traction. If new capital arrives and Bitcoin can push past $95,000 and hold, higher prices could follow. If outflows continue and the $90,000 area fails to hold, downside pressure would increase. The story now is one of patience and watching for clear signs — in fund flows, in US economic figures, and in corporate earnings — that the market’s mood has turned more confident. Featured image from Pexels, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|etf|fed rate cut|Trump",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57157326,
    "published": 1768393565000,
    "title": "EU Crypto Exchange Bitpanda Eyes $5B IPO in 2026: Report",
    "body": "Bitpanda has reportedly tapped Goldman Sachs, Citigroup, and Deutsche Bank to work on the offering, planned for Frankfurt’s stock exchange.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 57157613,
    "published": 1768394553000,
    "title": "Germany’s second-largest lender DZ Bank secures retail crypto trading MiCA license",
    "body": "DZ Bank will \"shortly\" roll out a crypto trading platform for cooperative banks to offer to clients.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|MiCA|Crypto Trading|Germany|TradFi|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57157606,
    "published": 1768394123000,
    "title": "Tokenized gold drives 25% of RWA growth in 2025 with 177% surge",
    "body": "Onchain gold products added billions in new value last year, outpacing physical bullion and most gold ETFs as trading activity increasingly shifted to blockchain rails.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 57158035,
    "published": 1768395600000,
    "title": "Congress must bar interest on payment stablecoins to avoid harming Main Street lending",
    "body": "Allowing crypto exchanges and other intermediaries to offer yield-like incentives on payment stablecoins would pose significant risks to local economies, argues Kevin Paintner, chairman of the Independent Community Bankers of America’s Digital Assets Subcommittee.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Opinion|Stablecoin legislation|Market Structure Legislation|US Congress|Opinion",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57158711,
    "published": 1768397188000,
    "title": "Germany’s DZ Bank secures MiCA license for ‘meinKrypto’ platform",
    "body": "Retail crypto access will initially cover Bitcoin, Ether, Litecoin and Cardano through participating cooperative banks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 33,
        "NAME": "LTC",
        "CATEGORY": "LTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57159403,
    "published": 1768399200000,
    "title": "Algorand Foundation returns to U.S. amid friendlier crypto regulation under Trump",
    "body": "The blockchain nonprofit is moving its base of operations back to the United States and has appointed a new board to oversee its next phase of growth.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Algorand Foundation|payments|Tokenization|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 4,
        "NAME": "ALGO",
        "CATEGORY": "ALGO"
      },
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57159352,
    "published": 1768398911000,
    "title": "Bitcoin ETFs on rollercoaster as traditional funds pull in $46B in 2026",
    "body": "Bitcoin ETF flows have swung sharply in early 2026 as investors pour billions into traditional ETFs, leaving crypto funds lagging behind.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57153989,
    "published": 1768384598000,
    "title": "U.S. bitcoin buyers are now driving price rally, reversing late 2025 trend",
    "body": "Strength in bitcoin linked U.S. equities, led by Strategy, is reinforcing positive sentiment during U.S. trading hours.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|MicroStrategy|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57159698,
    "published": 1768399960000,
    "title": "Mantra restructures and cuts staff after OM token collapse and tough year",
    "body": "RWA blockchain Mantra is restructuring and cutting staff after a steep OM token collapse and prolonged market pressure strained its business model in 2025.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 169,
        "NAME": "OM",
        "CATEGORY": "OM"
      }
    ]
  },
  {
    "id": 57159477,
    "published": 1768399200000,
    "title": "Crossmint gets MiCA nod to provide stablecoin infrastructure across EU",
    "body": "Crossmint has secured MiCA authorization from Spain’s CNMV to operate as a crypto asset service provider, allowing it to passport stablecoin infrastructure services across the EU.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57159553,
    "published": 1768399200000,
    "title": "Figure Technology to Enable Direct Stock Lending Over Blockchain",
    "body": "Blockchain-based lender Figure Technology Solutions Inc. is launching a new platform to issue on-chain equity, allowing investors to lend shares directly to one another without traditional intermediaries.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "NMS:FIGR",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      }
    ]
  },
  {
    "id": 57160345,
    "published": 1768401804000,
    "title": "Crypto analytics firm Chainalysis says impersonation, AI crypto scams stole $17 billion last year",
    "body": "Scams and fraud against individuals are increasing and if the trend continues, they could soon surpass crypto stolen via cyberattacks, Chainalysis said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Chainalysis|crypto scams|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57161068,
    "published": 1768403719000,
    "title": "CleanSpark shares rise as bitcoin miner expands AI power capacity in Texas",
    "body": "Bitcoin miner targets large scale AI and high performance computing infrastructure in the Houston region.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|AI|CleanSpark|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57160903,
    "published": 1768403286000,
    "title": "Blockchain lender Figure named 2026 'top pick' by Wall Street analyst",
    "body": "The Wall Street broker said that the regulatory momentum and a volatile banking backdrop are amplifying demand for Figure’s blockchain-based credit platform.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Figure Technologies|Tokenization|Crypto-Backed Lending|Bernstein|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57160972,
    "published": 1768403243000,
    "title": "Bitnomial opens US-regulated futures market for Aptos",
    "body": "The launch expands Aptos’ reach in CFTC-regulated derivatives markets and adds to Bitnomial’s altcoin futures offerings as investor interest in altcoins grows.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 70,
        "NAME": "APT",
        "CATEGORY": "APT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57161425,
    "published": 1768404625000,
    "title": "Bitcoin At $100K Could Spark A Fresh Wave Of Retail FOMO, Analysts Warn",
    "body": "Bitcoin pushed past $95,000 on Tuesday, drawing attention from traders and analysts who say real buying of the coin, rather than bets on derivatives, is driving the move. Related Reading: Bitcoin’s New Power Buyers: Companies Bought 3 Times What Miners Produced According to figures from Coingecko, the cryptocurrency was trading at $95,250 at the time of publication, after a 4.50% gain over 24 hours. Reports have disclosed that $269 million in Bitcoin short positions were wiped out in that span, a wave of liquidations that helped add upward momentum. Spot Buying Fuels The Move Several market watchers pointed to spot purchases as the main force. Crypto analyst Will Clemente posted on X that the rally appears to be “led by spot buying.” That matters because buying the actual asset signals direct demand for Bitcoin itself, not just betting via futures or options. Short sellers were hit hard; their positions were closed out as prices jumped, and that squeeze added fuel to the advance. Seems like this rally on Bitcoin is led by spot buying and getting faded by perps as funding goes negative while open interest rises + most spot volume in days. (disclosure currently long btc) pic.twitter.com/pL9C8GFJYR — Will (@WClementeIII) January 13, 2026 Calls For $100k And The Odds Some traders are now predicting a quick run to six figures, saying that it is quite clear Bitcoin could reach $100K in the coming weeks and that any dips should be bought. Based on reports from Polymarket, the prediction markets place about 51% odds on Bitcoin reclaiming $100,000 by Feb. 1 and show a 23% chance of a $105,000 print. Bitcoin last fell below $100,000 on Nov. 13, leaving a resistance level that bulls want to clear. History Gives A Mixed Signal January’s record for Bitcoin has been modest on average, delivering roughly a 4% gain since 2013. February has tended to be stronger, with an average return of 13%. These averages do not guarantee the path ahead, but they give traders a context for how the market has behaved in recent years. Market moves can be quick. They can also stall. Macro Risks And Technical Levels Traders were watching $90,000 as an important support level while Bitcoin cruised past $95k ahead of US inflation data that could shift bets about rate cuts. Safe-haven demand has been in play as geopolitics and questions about central bank independence weigh on global markets. Price action is currently tight, with many saying the market sits inside a narrow band and will likely break out one way or the other. 😮 Bitcoin, Ethereum, and other cryptocurrencies are rebounding. $94K has just been crossed again for $BTC, and there will likely be retail FOMO creeping in if crypto’s top asset begins teasing $100K in the next few days. 📊 In the chart below, high spikes of: 🟦 #Lower or… pic.twitter.com/5pcwtB0mls — Santiment (@santimentfeed) January 13, 2026 Retail FOMO Could Add Fuel Meanwhile, crypto sentiment tracker Santiment warned that renewed teasing of $100K could pull retail traders back in, sparking fresh FOMO across the market. Related Reading: Futures Frenzy Pushed Crypto Exchange Volume To Nearly $80 Trillion In 2025 If that happens, more buying from everyday investors could push prices higher quickly. But flows can reverse fast too, and large macro surprises or a loss of momentum would test the bulls. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btcusd|crypto|derivatives|etf|fed|FOMO|Trump",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57161595,
    "published": 1768404968000,
    "title": "Crypto Shorts Get Rekt: Liquidations Near $800M as Bitcoin Price Spikes",
    "body": "Bitcoin is trading near $97,000 for the first time since November, with broader crypto market gains punishing bears over the last day.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57161628,
    "published": 1768404885000,
    "title": "Bitcoin price tags $97K despite high PPI inflation on no US tariff ruling",
    "body": "Bitcoin price action headed to new eight-week highs, diverging from US stock markets after higher-than-expected November PPI data.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57162384,
    "published": 1768407286000,
    "title": "Bitcoin rallies past $97,000 as investors seek haven assets",
    "body": "The largest cryptocurrency extended its rally, pushing related equities higher as well.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57162310,
    "published": 1768407119000,
    "title": "Big banks want to freeze innovation. History says that’s a mistake",
    "body": "The fight over stablecoin yield is less about protecting consumers and more about protecting banking incumbents, argues Bill Hughes, Senior Counsel and Director of Global Regulatory Matters for Consensys.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Opinion|Stablecoin legislation|Market Structure Legislation|US Congress|Opinion",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57162339,
    "published": 1768407082000,
    "title": "LINK Hits Monthly High as Bitwise Launches Chainlink ETF on NYSE",
    "body": "Bitwise launched its Chainlink ETF Wednesday, becoming the second spot LINK fund in the U.S. following Grayscale's December debut.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57162298,
    "published": 1768406915000,
    "title": "Why US community banks say the GENIUS Act has a stablecoin loophole",
    "body": "Banks argue that stablecoin rewards offered through exchanges exploit a GENIUS Act loophole, blurring the line between payment tokens and savings accounts.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 57162265,
    "published": 1768406774000,
    "title": "World Liberty Financial Stablecoin USD1 Lands on Prediction Market Myriad",
    "body": "Myriad predictors can use the Trump-backed DeFi project’s stablecoin USD1 through its BNB Chain integration.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Our Company",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57162632,
    "published": 1768407745000,
    "title": "Dash price soars 125% amid privacy coin boom: Is the rally overheating?",
    "body": "DASH price surged as capital rotated into privacy coins, with traders shifting away from Zcash after its governance turmoil.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 19,
        "NAME": "DASH",
        "CATEGORY": "DASH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      }
    ]
  },
  {
    "id": 57163361,
    "published": 1768410055000,
    "title": "Monero (XMR) Pushes to New Highs as Privacy Demand Outpaces Regulatory Pressure",
    "body": "The privacy-focused cryptocurrency Monero (XMR) is once again in the spotlight after reaching new record highs, even as governments tighten oversight of digital assets. Related Reading: Dogecoin Bulls Don’t Celebrate Too Early: This Level Still Must Fall XMR recently surged past $700, marking its highest price to date and placing it among the top 15 cryptocurrencies by market capitalization. The rally reflects a broader shift in market behavior, where demand for financial privacy is rising alongside stricter regulatory frameworks across major economies. Currently, XMR is trading near $715, up more than 55% over the past week. Trading activity has picked up sharply, with both spot and futures markets showing elevated volume as traders position around the breakout. XMR's price trends to the upside on the daily chart. Source: XMRUSD on Tradingview Regulatory Pressure Fuels Privacy Demand The latest move comes as regulators in Europe and other regions prepare new rules targeting anonymous crypto transactions. The European Union is expected to ban privacy coins and anonymous accounts by 2027, alongside tighter Know Your Customer (KYC) and Anti-Money Laundering (AML) requirements. Instead of discouraging interest, these measures appear to be driving users toward assets with built-in privacy features. Monero, which utilizes stealth addresses and ring signatures to conceal transaction details, has become a primary choice for users seeking financial confidentiality. Market data indicate that the privacy coin sector has performed well since the broader crypto market downturn in October. While some rivals, such as Zcash, experienced sharp volatility linked to internal governance issues, XMR has absorbed much of the rotation in capital from traders seeking exposure to privacy assets. Leverage And Technical Signals Raise Short-Term Risks Alongside strong spot demand, derivatives activity has increased rapidly. Futures volume has shown repeated “overheating” patterns, suggesting that leverage is chasing price rather than building from long-term accumulation zones. In past Monero cycles, similar conditions often led to sharp swings once momentum slowed. Technically, Monero remains in an uptrend, holding above former resistance in the $500–$520 range, which has now flipped into support. The price continues to form higher highs and higher lows, confirming the broader bullish structure. However, momentum indicators are stretched. The Relative Strength Index (RSI) has climbed into the mid-80s, a level that historically precedes either sideways consolidation or short-term pullbacks. Bollinger Bands are also widening, with price pressing against the upper band, a sign of elevated volatility. Key Monero (XMR) Levels to Watch Going Forward The $715–$717 area remains a major psychological and technical barrier. A sustained break above that zone could open the door toward the $730–$740 range, based on Fibonacci extension levels. On the downside, traders are watching the $650–$620 zone as a potential support area if leverage unwinds. Deeper corrections could test trend support if liquidations accelerate, though the broader structure would remain intact as long as higher lows are preserved. Related Reading: Bitcoin’s New Power Buyers: Companies Bought 3 Times What Miners Produced With increasing regulatory scrutiny and a steady demand for privacy tools, Monero continues to attract attention. While short-term volatility is likely, the asset’s role as a leading privacy coin remains central to its current market position. Cover image from ChatGPT, XMRUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Monero|monero|XMR|XMR Price|XMRUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 57,
        "NAME": "XMR",
        "CATEGORY": "XMR"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57163348,
    "published": 1768409889000,
    "title": "Ripple Secures Another Key European License as XRP Rises",
    "body": "Crypto payments firm Ripple has revealed its second European license approval in the last week, fueling expansion ahead.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57163280,
    "published": 1768408712000,
    "title": "Are we back? Crypto is Green! Solana Intern goes rogue! Pump up 13%! Monero hits another ATH!",
    "body": "BTC: 95k (+3%) | BTC.D: 59.2% (-0.1%). ETH: 3313 (+6%) | BNB: 936 (+3%) | SOL: 145 (+2%). Top Gainers: IP, ICP, PUMP, PEPE, ENA. BTC ETFs: +$754m | ETH ETFs: +$130m. Crypto rallies on largest ETF inflow in 3 months. Senate committee to vote on crypto bill on Jan 27. Stablecoin issues with bill still being fought over. Ethena Labs makes USDe free from gas fees. Bitdeer overtakes MARA on ‘managed hashrate’. Polygon Labs to buy Coinme, Sequence for $250m. BitPanda eyes Frankfurt IPO in 1H26. CZ invests in perp trading platform Genius Terminal. Coingecko eyes sales at $500m valuation. Russia to open crypto markets more for payments. Crypto wrench attacks continue in France. Pakistan to integrate WLFI’s USD1.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 57,
        "NAME": "XMR",
        "CATEGORY": "XMR"
      },
      {
        "TYPE": "122",
        "ID": 124,
        "NAME": "ENA",
        "CATEGORY": "ENA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57163533,
    "published": 1768410166000,
    "title": "Figure Technology unveils blockchain platform for direct stock lending",
    "body": "The Nasdaq-listed company is rolling out an onchain equity system that allows real shares to be issued and lent directly on blockchain infrastructure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      }
    ]
  },
  {
    "id": 57164657,
    "published": 1768413874000,
    "title": "Zcash Foundation Says SEC Ends Investigation With No Enforcement Action",
    "body": "The Zcash Foundation is the latest crypto organization to say the SEC has backed off, joining the likes of Coinbase and Ripple.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "zcash|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57165133,
    "published": 1768415421000,
    "title": "PEPE Price Prediction: The Level That Will Send The Meme Coin To The Stratosphere",
    "body": "Crypto analyst Morja has revealed his PEPE price prediction, alluding to the level the meme coin must hold to sustain its bullish momentum. Another crypto analyst painted a scenario in which the meme coin replicates the parabolic run it recorded in 2023. PEPE Price Could Sustain Bullish Momentum If It Holds This Level In an X post, Morja stated that a weekly candle close above the red level at $0.000005853 for the PEPE price would confirm a successful retest and reinforce the bullish movement. He further remarked that as long as the price holds above this level, upside continuation remains favored. Related Reading: If You’re A PEPE Investor, You Need To See This Or Risk Losing Your Coins However, the analyst warned that on the way toward $0.000010867, a key resistance is located around $0.0000083, which may act as a significant reaction zone before any further upside continuation. Meanwhile, crypto analyst StudyE has painted a scenario in which the PEPE price goes parabolic, replicating its historic 2023 run. The crypto analyst stated that this would happen if the PEPE price pumps into the January 15 to February 15 window. He further explained that the meme coin needs to be at the unfinished monthly candle in that time window in order to invalidate this. An invalidation would send PEPE higher first, and then the bottom would be in. If that doesn’t happen, it may have one more hurdle to overcome. StudyE stated that no matter the path the PEPE price takes, it would lead to the same outcome and timeframe. Based on this, he declared that the fourth quarter of this year will be parabolic, regardless of what happens. It is worth mentioning that PEPE has been one of the best-performing crypto assets to start the new year, with the meme coin up over 30% year-to-date (YTD). PEPE Eyes Rally To $0.00000728 In The Short Term Crypto analyst CryptoLinx has predicted that the PEPE price could rally to $0.00000728 in the short term. The analyst noted that PEPE is breaking out of the downward channel right now and that the target for this pattern is a move back to the previous high. This is a level that the meme coin had reached at the beginning of the year, when it rallied by as much as 80%. Related Reading: Analyst Predicts 430% PEPE Price Rally If This Level Holds In the long term, crypto analyst Eco Nomad stated that the PEPE price will rally to $0.00001, which is the midpoint of the Gaussian channel. If the meme coin breaks that level, he is confident that it could trade within the 4 zeros, having deleted one zero in the process. At the time of writing, the PEPE price is trading at around $0.000006670, up almost 14% in the last 24 hours, according to data from CoinMarketCap. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "PEPE|CoinMarketCap|CryptoLinx|Eco Nomad|gaussian channel|meme coin|Morja|Pepe Coin|PEPE news|PEPE price|pepeusd|PEPEUSDT|StudyE|Year-To-Date|YTD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 93,
        "NAME": "PEPE",
        "CATEGORY": "PEPE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57165301,
    "published": 1768415894000,
    "title": "Zcash Foundation Investigation Closed: SEC Decision Sparks 12% Jump In ZEC Price",
    "body": "On Wednesday, the Zcash Foundation announced a significant development regarding its ongoing operations: the US Securities and Exchange Commission (SEC) has concluded its investigation into the public charity. This news has sparked a notable recovery in the price of the Zcash native token (ZEC), signalling renewed investor confidence, with trading volume surging by 39% over the past 24 hours. Zcash Foundation Cleared By SEC The Zcash foundation received a subpoena from the regulatory agency back in August 31, 2023, as part of a broader inquiry titled “In the Matter of Certain Crypto Asset Offerings (SF-04569).” Related Reading: XRP Potential: Four Q1 2026 Triggers That Might Propel Price Beyond $8 After a thorough review, the Zcash Foundation was informed that the SEC does not plan to recommend any enforcement actions or changes pertaining to the organization. This comes amid significant regulatory changes towards digital assets under the Trump administration, including the appointment of the pro-crypto Paul Atkins as chair of the SEC. Similar enforcement actions against firms such as Uniswap (UNI), Coinbase (COIN) and Robinhood (HOOD) were dropped last year. ZEC Price Surges Near $440 In their statement, the foundation expressed satisfaction with the outcome, emphasizing their commitment to transparency and adherence to regulatory standards. They reiterated their focus on advancing financial infrastructure that preserves user privacy for the greater good. Related Reading: The NYC Token Crash: Allegations Of Rug Pull After $2.5 Million Liquidity Withdrawal Following this announcement, ZEC experienced a robust increase of 12%, pushing its price to approximately $437.75 at the time of writing. This surge comes after the cryptocurrency had recently dipped to a near one-month low of $363 last Saturday, illustrating a significant turnaround. However, even with this recent boost, the Zcash token still has a long way to climb. The cryptocurrency remains 86% below its all-time high of over $3,191, according to CoinGecko data. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|crypto|crypto news|ZCash|Zcash Foundation|Zcash News|Zcash Price|ZEC News|ZEC Price|ZECUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57165290,
    "published": 1768415754000,
    "title": "Don’t believe the banks lobbying against stablecoins",
    "body": "Issuers should be allowed to pay interest on stablecoins — just as lenders can on dollars",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57165690,
    "published": 1768416912000,
    "title": "Price predictions 1/14: BTC, ETH, XRP, BNB, SOL, DOGE, ADA, XMR, BCH, LINK",
    "body": "Bitcoin inches toward $100,000 as ETH and select altcoins look to make fresh 2026 highs. Do technical charts confirm that the bull market has restarted?",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57165597,
    "published": 1768416786000,
    "title": "More than half of all crypto tokens have failed — and most died in 2025",
    "body": "Over 13.4 million tokens have been erased between mid-2021 and 2025, according to a new analysis by CoinGecko.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Research|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57165498,
    "published": 1768416521000,
    "title": "Figure joins stock tokenization race with new trading platform backed by BitGo, Jump",
    "body": "The blockchain lender's new OPEN platform hosts equities registered natively onchain, bypassing DTCC and allowing DeFi-based lending.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Tokenization|Real World Assets|Figure|tokenized stocks|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 57166915,
    "published": 1768420802000,
    "title": "BTC Breaks Higher as Record Bitcoin ETF Inflows Trigger Wave of Bearish Liquidations",
    "body": "Bitcoin (BTC) surged sharply this week, surpassing the $96,000 mark as renewed institutional demand and easing inflation concerns boosted sentiment across crypto markets. Related Reading: Dogecoin Bulls Don’t Celebrate Too Early: This Level Still Must Fall The action followed a strong inflow into U.S. spot Bitcoin exchange-traded funds (ETFs) and a softer-than-feared U.S. Consumer Price Index (CPI) report, which reduced expectations of aggressive interest rate tightening by the Federal Reserve. The rally ended a prolonged consolidation phase that had kept Bitcoin trading sideways for more than a month. As prices broke through key resistance levels near $94,000–$95,000, short sellers were forced to close positions, adding further momentum to the upside. BTC's price records important gains on the daily chart. Source: BTCUSD on Tradingview Bitcoin ETF Inflows Signal Institutional Return U.S. spot Bitcoin ETFs recorded $753.7 million in net inflows on Tuesday, the largest single-day total since October. Fidelity’s FBTC led with $351 million, followed by Bitwise’s BITB with $159 million and BlackRock’s IBIT with $126 million, according to data from SoSoValue. The surge suggests institutional investors are rotating back into crypto-linked products after year-end portfolio adjustments and tax-related selling weighed on the market in late 2025. Ether-focused ETFs also saw renewed interest, with $130 million in net inflows across five products. Bitcoin rose around 3% following the data, trading near $94,600 at the time, while Ethereum gained more than 6% to around $3,320. Broader crypto markets followed, lifting total market capitalization above $3.3 trillion. Inflation Data Supports Risk Assets The latest U.S. CPI report showed inflation holding steady at 2.7% year-on-year, largely in line with expectations. The absence of an inflation surprise reduced fears of further rate hikes and reinforced views that the Federal Reserve could pivot toward rate cuts later in the year. Lower real-rate expectations typically support risk assets, including cryptocurrencies, by reducing the opportunity cost of holding non-yielding assets, such as Bitcoin. U.S. equities also advanced, suggesting the crypto rally was part of a broader shift in risk sentiment rather than an isolated move. Short Liquidations Add Fuel to the Rally As Bitcoin surged past $96,000, bearish positions were wiped out. Data from Coinglass shows more than $290 million in Bitcoin short positions were liquidated within 24 hours, compared with about $24 million in long liquidations. Across the broader cryptocurrency market, short liquidations totaled close to $700 million. Strong spot buying, rising open interest, and technical breakouts contributed to the move. Bitcoin is now testing former resistance levels as support, with chart patterns indicating a possible continuation toward the $105,000–$110,000 range if momentum persists. Related Reading: Bitcoin’s New Power Buyers: Companies Bought 3 Times What Miners Produced While short-term consolidation remains possible near the $98,000–$100,000 zone, sustained ETF inflows, reduced selling pressure from long-term holders, and continued corporate accumulation suggest underlying demand remains firm. Cover image from ChatGPT, BTCUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin price|btc|btc price|btcusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57167276,
    "published": 1768421700000,
    "title": "XRP tops $2 as TradFi piles in: Do charts predict new highs in 2026?",
    "body": "XRP trades back above $2, and soaring institutional investor flows suggest the altcoin’s rally is just getting started.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57167836,
    "published": 1768422737000,
    "title": "Bitcoin ETFs See Biggest Inflow Since October’s Crypto Crash",
    "body": "Crypto investors are kicking off the new year with an old habit: plowing money into Bitcoin ETFs.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57168094,
    "published": 1768424401000,
    "title": "Ethereum Outlook Has Improved, And It Could Outperform Bitcoin – Here’s What To Know",
    "body": "Ethereum’s outlook has been improving its case. After a prolonged period of underperformance and skepticism, the network is starting to exhibit signs of renewed structural and fundamental strength. While BTC continues to anchor the market as the primary store of value and digital gold, conditions are emerging that could allow ETH to outperform BTC over the coming period. Why The Ethereum Narrative Is Gaining Strength Ethereum has been seen outperforming Bitcoin. In a recent post on X, Walter Bloomberg revealed that Standard Chartered says that the ETH outlook has improved, and now ETH might outperform BTC, citing rising institutional demand and stronger fundamental positioning across key on-chain sectors. Related Reading: Altcoin Season In Q1? Bitcoin, Ethereum Breakdown Maps Out Performance While weakness in BTC has weighed on the broader crypto market, ETH has continued to benefit from institutional-driven demand, and its dominance in stablecoins, decentralized finance (DeFi), and real-world assets (RWA) tokenization. Standard Chartered also points to the increased throughput and potential US regulatory clarity that it could provide additional upside. In terms of valuation, the bank forecasts ETH at $7,500 this year and $30,000 by 2029, reflecting the expectations of sustained network growth. The Co-founder of PinkBrains_io, a DeFi Creator Studio, DefiIgnas, has highlighted that Ethereum could outperform Bitcoin this year, and the reason is roadmap execution. While BTC will likely keep facing recurring waves of quantum FUD into 2026, ETH has a clear roadmap to prepare for future cryptographic risks. Furthermore, ETH is actually scaling. Gas limits on layer 1 keep rising, and zkEVMs will get full production readiness, making ETH cheap and fast enough for high-value transactions, while layer 2s will handle most of the trading and high-frequency activity. Related Reading: Bitcoin And Ethereum Market Structure Points To Crypto Winter – Details These upgrades are incremental, which means there’s no breaking news moment for ETH, but progress is happening fast. Early in the cycle, a lot of Degens loaded up on ETH before the bull run, but many got disillusioned and sold their ETH for BTC. “It would be fun to see the playbook reverse higher,” DefiIgnas noted. A Different Liquidity Cycle Than Previous Bull Markets Crypto liquidity quality witnessed a change in 2025. A technical analyst and show host of Crypto Banter, Kyledoops, reported that Wintermute noted that capital in 2025 stopped rotating broadly across the market. Instead, liquidity is concentrated into Bitcoin, Ethereum, and a small group of large-cap tokens. As a result, the long-anticipated wave of altcoin-wide liquidity never really arrived. Meanwhile, the rise of spot ETFs and crypto treasury vehicles created a new, highly structured inflow channel that funneled flow into the top of the market. These vehicles break the crypto’s oldest playbooks. Price action is no longer driven by broad market expansion. It’s driven by where new liquidity can actually enter. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|bitcoin|btc|Crypto Banter|decentralized finance|DeFi|DefiIgnas|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|ethusd|ETHUSDT|Kyledoops|Layer 1|Layer 2|PinkBrains|Real world assets|RWAs|Spot ETFs|Standard Chartered|Walter Bloomberg|zkEVMs",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57169004,
    "published": 1768427027000,
    "title": "Bitpanda targets Frankfurt IPO with up to $5.5B valuation: Report",
    "body": "The Vienna-based crypto platform is weighing a potential 2026 listing in Germany as more digital asset companies position for public markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57168845,
    "published": 1768426711000,
    "title": "Coinbase pulls support from crypto market structure bill",
    "body": "CEO Brian Armstrong said there were \"too many issues\" with the bill.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Top Stories|Coinbase|Brian Armstrong|Market Structure Legislation|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57168827,
    "published": 1768426598000,
    "title": "Strategy, BitMine Rise While Bitcoin Miners Surge—As BTC Inches Towards $100K",
    "body": "Bitcoin mining stocks like Bitdeer and CleanSpark jumped Wednesday as BTC climbed above $97,000 for the first time since November.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57168802,
    "published": 1768425962000,
    "title": "Coinbase CEO Brian Armstrong Pulls Support for Crypto Market-Structure Bill",
    "body": "Coinbase Global Inc. has pulled its support from the version of the market-structure bill that’s expected to go into markup in the Senate Banking Committee Thursday.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NMS:COIN",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57169314,
    "published": 1768428038000,
    "title": "Sui Back Online After 'Network Stall' Leads to Six Hours of Downtime",
    "body": "The Sui blockchain recovered from a nearly six-hour outage Wednesday, marking the network's second major downtime since its 2023 launch.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 96,
        "NAME": "SUI",
        "CATEGORY": "SUI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57169294,
    "published": 1768428015000,
    "title": "Bitcoin Price Crash To $57,000: The Bullish Path That Could End In Tears",
    "body": "Bitcoin’s latest recovery above $94,000 raises up the question of whether it is the next leg for the continuation of a bull cycle or the final rally before a deeper reset. However, an interesting technical outlook shared on TradingView by crypto analyst Xanrox suggests the bullish path many traders are watching could ultimately end lower than expected, even if price strength is strong in the near term. Elliott Wave Setup Leaves Room For One More Push Higher Technical analysis of Bitcoin’s price action on the weekly candlestick timeframe chart shows the cryptocurrency has completed a five-impulse wave that goes as far back as early 2023. This impulse wave count ended with Bitcoin’s peak above $126,000 in October 2025 and the cryptocurrency is now playing out corrective waves ABC. Related Reading: Next XRP Wave Shows Where Price Is Headed Next, But There’s A Catch Based on the Elliott Wave theory, Xanrox noted that Bitcoin may already have completed a sharp decline from a projected 2025 peak near $125,000 down to the low-$80,000 range, labeling that move as a corrective wave A. The price action is now viewed as being in a bullish counter-trend phase, commonly referred to as wave (B) or (X), which is known to retrace a portion of the prior decline before rolling over. In this scenario, Bitcoin could still advance to as high as the $100,000 to $103,000 range over the coming weeks or months and even encourage a brief rotation into altcoins during the advance. That upside, however, is corrective and not impulsive, and the next move is a larger move lower once the structure is complete. Bitcoin Weekly Candlestick. Source: TradingView Long-Term Structure Points To A Painful Reset Window Xanrox’s analysis places Bitcoin within a long-term linear structure stretching from 2017 into 2026, highlighting how previous market cycles ended with deep corrections after euphoric peaks. The analysis uses the 2018 and 2022 drawdowns, which erased more than three-quarters of Bitcoin’s value each time, as anchors for what could unfold next for the leading cryptocurrency. Related Reading: Get Ready For An XRP Price Explosion Once This Happens; Analyst According to this framework, the next major corrective phase is projected to play out in 2026, when Bitcoin could fall into the sub-$60,000 region, with $57,000 as the most important area of interest where the correction might end. The $57,000 price correction target is based on the location of the 0.618 Fibonacci retracement when projected from the recent 2025 peak and is going to be just above the 200-week moving average. The projected move would still represent a correction of roughly 54% from the 2025 high if this actually turns out to be the cycle peak. However, it is important to note that the presence of Spot Bitcoin ETFs introduces a stabilizing force compared to earlier cycles in 2018 and 2022, and so any high correction might find a strong support level before falling as low as $57,000. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57169447,
    "published": 1768428384000,
    "title": "Coinbase Withdraws Support for Crypto Bill on Eve of Key Senate Vote",
    "body": "The move could derail efforts to get crypto’s coveted market structure bill over the finish line.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57169705,
    "published": 1768428152000,
    "title": "Eric Adams Says He Did Not Profit From Launch of NYC Memecoin",
    "body": "Eric Adams said he did not profit from the launch of the NYC Token memcoin he is promoting, which initially soared in value before crashing following its debut on Monday, prompting crypto market observers to draw parallels to a “rug pull.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57170475,
    "published": 1768431621000,
    "title": "XRP/Gold Ratio Just Reached A Historical Support Zone, What This Means For Price",
    "body": "Despite its slow momentum over the past few weeks, XRP is still on analysts’ radar as they look beyond its dollar price action and into its performance against gold. One analyst has said that the long-term XRP/Gold ratio has just reached a historical support zone, signaling a familiar technical setup that could determine its next move. XRP/Gold Ratio Arrives At Critical Support Level Market expert ‘Steph is Crypto’ has released a fresh analysis focusing on the XRP to gold ratio and its historical behaviour. In his post on X this Tuesday, he stated that the ratio has returned to a long-standing support zone around $0.0004, which has consistently marked major turning points in XRP’s price action relative to gold. Related Reading: Top Bullish Predictions That Put XRP Price At New All-Time Highs Above $3.8 According to the analyst, this same area previously preceded powerful upside moves in the XRP/gold ratio. Each prior visit to this zone was followed by a sharp reversal higher, as highlighted by the circled lows and steep advances that followed. The chart shows rallies of more than 800% in 2020, over 120% in 2022, and about 530% in 2024. Steph is Crypto also pointed to momentum conditions, noting that the Relative Strength Index (RSI) was oversold in the past when the XRP/gold ratio hit the historical support. In the current 2026 cycle, the RSI sits around 33.38, reflecting a similar oversold setup to previous cycles. According to the analyst, this suggests downside momentum is fading. The general outlook of this analysis suggests that if past trends repeat, the XRP/gold ratio could experience another strong rally this cycle. This time, Steph is Crypto predicts a rally from the support around $0.0004 to over $0.0018, representing a gain of more than 350%. Analyst Links XRP Trajectory To That Of Gold And Silver In a subsequent post, Steph is Crypto shared another analysis comparing the historical price movements and expansion phase of gold and silver with XRP. He presented parallel charts for each asset, highlighting distinct phases preceding major price rallies in the precious metals while illustrating the potential path for XRP based on gold and silver’s past performance. Related Reading: Analyst Outlines The Bull Case For XRP And Why Price Will Hit All-Time High Soon The chart showed that gold and silver experienced a major distribution phase in 2021, followed by a compression phase in 2023 and an expansion in 2026. In Gold’s case, its price reversal was sharp and vertical, with minimal pullbacks before reaching an all-time high near $4,700. Silver’s movement was more muted, showing significant volatility from 2023 to 2025 before accelerating in 2026 to peak above $91. Based on these performances, Steph is Crypto predicts that XRP could follow a similar trajectory. The cryptocurrency has completed its distribution phase above $3 and its compression stage near $2.3, and the analyst now expects it to enter an expansion phase, with a projected ATH target of $32. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|gold|Relative Strength Index|Ripple|RSI|silver|Steph is Crypto|xrp|xrp news|XRP Price|XRP/Gold|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57170442,
    "published": 1768431425000,
    "title": "Bitcoin and ether's sharp 'mechanical' breakouts liquidate nearly $700 million short positions",
    "body": "Bitcoin's breakout above $95,000 rejuvenated risk appetite, with one market strategist saying that the crypto rally has legs.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Ethereum News|market analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57170879,
    "published": 1768432704000,
    "title": "AI, Impersonations Drove Crypto Scam Losses to Record $17 Billion in 2025: Chainalysis",
    "body": "A new report by Chainalysis finds that AI-enabled crypto scams are more efficient, profitable, and harder to stop.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57171669,
    "published": 1768435249000,
    "title": "Bitcoin Futures Flush 31% Of Open Interest As Bottom Thesis Takes Shape",
    "body": "Bitcoin’s derivatives market is showing signs of a reset after a speculative 2025, with Binance open interest falling more than 31% from an October peak as futures-led selling pressure cools, a combination CryptoQuant contributor Darkfost argues often coincides with meaningful cycle lows. In a series of posts on X, Darkfost said 2025’s leverage build-up was fueled by record activity on Binance, where futures trading volumes “exceeded $25T,” helping push Bitcoin open interest (OI) to an all-time high “of over $15B on October 6.” “To put this into perspective, during the previous bull cycle in November 2021, when Bitcoin hit its ATH, open interest on Binance peaked at $5.7B,” Darkfost wrote. “In other words, OI nearly tripled in 2025. Since that peak, open interest has dropped by more than 31%, stabilizing today around $10B.” Darkfost framed the move as a deleveraging phase that intensified amid “massive liquidations,” with OI slipping below its 180-day moving average, a condition the analyst says has historically mattered more than the raw level of leverage. “These deleveraging periods are crucial, as they help purge the excess leverage built up in the market,” Darkfost wrote. “Historically, they have often marked significant bottoms, effectively resetting the market and creating a stronger base for a potential bullish recovery.” Related Reading: Bitcoin Could Be Entering A Supercycle, Fidelity Warns The logic is straightforward: when leverage is forced out, the market can become less vulnerable to cascade-style liquidations and reflexive selling. In that sense, a lower OI environment can reduce the marginal impact of futures positioning on spot, at least compared with the late-stage “crowded trade” conditions that precede sharp drawdowns. But Darkfost warned that a deleveraging signal is not the same thing as a confirmed bottom. “This could be the case again, but caution is warranted,” the analyst wrote, adding that if Bitcoin “continues to slide and fully enters a bear market,” OI could “contract further,” pointing to “deeper deleveraging and a potential extension of the correction.” Bitcoin Sellers Are Losing Momentum Alongside the open interest reset, Darkfost pointed to a sharp drop in futures-driven selling pressure, using Net Taker Volume — a measure intended to capture who is dominating futures order books. Related Reading: Bitcoin HODLer Selloff Ending? LTH Outflows Decline “Selling pressure on BTC coming from the futures market is sharply declining,” Darkfost wrote, noting that after the monthly average hit “–$489M” at its peak, the figure has now been “divided by ten.” “At the moment, sellers still slightly dominate the order books, with –$51M,” the analyst added. The key nuance is that the indicator has not flipped, but it is moving in that direction. “We have not yet returned to positive territory, but we are getting closer,” Darkfost wrote. “It is very encouraging to see traders starting to change their approach, especially given the significant impact futures volumes have on price action. Notably, since this decline in selling pressure began, BTC price action has also stabilized.” For the “bottom thesis” to graduate into a more forceful reversal call, Darkfost anchored the trigger to that sign change: “If Net Taker Volume were to turn positive again, it would clearly ignite the fuse for a bullish reversal.” At press time, BTC traded at $95,131. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57172547,
    "published": 1768437880000,
    "title": "Robinhood CEO Says AI Could Spark a ‘Job Singularity’",
    "body": "Vlad Tenev argues AI will fuel a surge of new jobs, solo companies, and industries, not just cause displacement.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57172821,
    "published": 1768438801000,
    "title": "XRP Compresses At A Breakout Line — Structure Says Expansion Is Brewing",
    "body": "XRP is tightening up at a critical breakout level, with price action suggesting the market is coiling for its next decisive move. While short-term volatility has cooled, the broader structure remains constructive, pointing to a potential expansion phase as compression builds near key resistance. XRP Compresses Into A Critical $2.30–$2.40 Decision Zone According to a latest update from Egrag Crypto, the XRP 3-day chart continues to flash strong bullish signals despite recent consolidation. Price action remains constructive, with XRP compressing inside a descending channel as it approaches a crucial decision zone between $2.30 and $2.40. Related Reading: XRP Price Finds Its Footing at Support, Bulls Test Their Strength From a structural standpoint, several technical elements point to underlying strength. The 50-period EMA has begun to flatten, suggesting that selling pressure is gradually easing. At the same time, the 200-period EMA continues to trend higher, reinforcing the idea that the broader, macro trend remains bullish. Furthermore, XRP is holding above the EMA cluster, indicating that the market structure has not yet broken down. Notably, the upper boundary of the descending channel aligns closely with the former $2.30 breakout level, adding technical significance to this zone. From here, the implications are clear. A clean and decisive 3-day close above $2.40 would likely confirm a breakout from compression, opening the door for continuation toward the $2.70 region, with $3.13 emerging as a higher upside objective. On the other hand, rejection at resistance would likely keep XRP trading in a range. However, as long as the price remains above the $2.00 area, the overall bullish structure stays intact. This is not a breakdown scenario; rather, it reflects tightening price action that often precedes a strong expansion. Triple Tap Hits Range Highs, Reaching A Key Inflection Point In a recent market update, CrediBULL Crypto noted that XRP has now completed its triple-tap move, successfully reaching the upper boundary of its range. With liquidity at the range highs already taken, the market now stands at a clear crossroads, presenting two distinct paths for price action going forward. Related Reading: Why XRP Is Gearing Up For A Massive Week The first scenario frames the recent move as nothing more than a relief bounce, sweeping liquidity at the highs before resuming its local downtrend, within the higher-timeframe uptrend. If this plays out, price could move lower again, potentially dropping below the $1.77 level. In the alternative scenario, the triple-tap pattern is interpreted as the formation of a solid base of structural demand. Under this view, pullbacks are likely to be met with buying interest, with the $1.77 lows acting as a support zone rather than a level to be broken. Weighing the broader context, particularly Bitcoin’s position and overall market conditions, CrediBULL leans toward the second outcome. That bias favors looking for long opportunities, with the expectation that XRP will continue to expand higher and eventually target untapped levels above the current range. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|bitcoin|CrediBULL Crypto|Descending Channel|Egrag Crypto|EMA|Ripple|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57172745,
    "published": 1768438354000,
    "title": "Coinbase pulls support for crypto bill: 'no bill' better than 'bad bill'",
    "body": "Coinbase CEO Brian Armstrong raised four crucial points that he believes would make the legislation “materially worse” for the US crypto industry.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57172945,
    "published": 1768439037000,
    "title": "Coinbase pulls support for major crypto bill. Here's what it means for the industry",
    "body": "Coinbase's withdrawal of its support potentially derails market structure legislation, says an analyst, noting that it's bad for the crypto industry and good for the banks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Coinbase|Top Stories|Policy|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57174636,
    "published": 1768444395000,
    "title": "Senate Banking Committee cancels crypto market structure markup",
    "body": "The committee's Republican chairman, Tim Scott, had pushed for a quick process before it collapsed under the weigh of unfinished business.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|U.S. Senate|U.S. Senate Banking Committee|Tim scott|Market Structure Legislation|Breaking News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57175018,
    "published": 1768445584000,
    "title": "Bitcoin Price Clears the Ceiling—Is $100K the Next Test?",
    "body": "Bitcoin price started a fresh increase above $95,500. BTC is trading above $96,000 and might soon aim for a move to $100k in the near term. Bitcoin started a decent increase above $94,000 and $95,500. The price is trading above $95,000 and the 100 hourly Simple moving average. There is a bullish trend line forming with support at $95,250 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move up if it stays above the $95,000 zone. Bitcoin Price Breaks Key Resistance Bitcoin price managed to stay above the $92,500 support and started a fresh increase . BTC was able to settle above $94,000 and $95,000. The bulls were able to push the price above $95,500. Finally, the price spiked above $97,000. A high was formed at $97,898, and the price is now consolidating gains above the 23.6% Fib retracement level of the recent wave from the $89,995 swing low to the $97,898 high. Bitcoin is now trading above $96,000 and the 100 hourly Simple moving average . If the price remains stable above $95,500, it could attempt a fresh increase. Immediate resistance is near the $97,200 level. The first key resistance is near the $97,800 level. The next resistance could be $98,000. A close above the $98,000 resistance might send the price further higher. In the stated case, the price could rise and test the $98,800 resistance. Any more gains might send the price toward the $99,500 level. The next barrier for the bulls could be $99,800 and $100,000. Another Drop In BTC? If Bitcoin fails to rise above the $97,200 resistance zone, it could start another decline. Immediate support is near the $96,000 level. The first major support is near the $95,250 level and the trend line. The next support is now near the $94,000 zone or the 50% Fib retracement level of the recent wave from the $89,995 swing low to the $97,898 high. Any more losses might send the price toward the $93,000 support in the near term. The main support sits at $92,500, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $96,000, followed by $95,250. Major Resistance Levels – $97,200 and $97,800.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57175732,
    "published": 1768447768000,
    "title": "Solana Mobile to airdrop 1.8B SKR tokens to users, 141M to devs",
    "body": "Solana Seeker owners and mobile app builders will receive billions of Seeker (SKR) tokens next week. The airdrop represents 20% of the total token supply.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 204,
        "NAME": "AIRDROP",
        "CATEGORY": "AIRDROP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57175831,
    "published": 1768448070000,
    "title": "Bitcoin Prices Climb To Highest Price Since November",
    "body": "Bitcoin prices rallied on Wednesday, January 14, reaching their loftiest value in roughly two months as various factors combined to drive gains.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]