[
  {
    "id": 56989565,
    "published": 1767907853000,
    "title": "Here’s How High The Dogecoin Price Would If It Repeats Previous Parabolic Runs",
    "body": "Dogecoin’s price action has a habit of compressing quietly before going on a massive rally, and the late-2024 rally is one of the clearest examples of that behavior. After spending weeks grinding sideways around $0.10, the meme coin transitioned into a parabolic phase that carried the price to about $0.45 in a matter of two to three months. Now, how high would the Dogecoin price go if it were to repeat that same parabolic structure? How Dogecoin’s Late-2024 Parabolic Run Played Out The 2024 rally began from a base that had formed just above $0.10, right where Dogecoin spent a long time absorbing sell pressure. Once buyers regained control, Dogecoin cleared intermediate resistance around $0.15 and $0.20 with minimal pullbacks, then entered a vertical phase that pushed it through $0.30 and to $0.45. Related Reading: Dogecoin 50% Crash: Q4 Set To End In Red As All Supports Fail The key takeaway from that period is not just the magnitude of the move, but its speed, as Dogecoin delivered a roughly 4.5x increase in a very short time window of less than four weeks. That move unfolded rapidly, with little warning, and was characterized by expanding volume, strong bullish candles on the 4-hour candlestick timeframe, and momentum indicators pressing into overheated territory. As shown in the chart below, this period was characterized by high RSI readings that pushed into the 70 to 80 range. Applying The Same Parabolic Structure Parabolic rallies often catch many investors off guard. Particularly, one of the defining features of Dogecoin’s strongest rallies is that they rarely announce themselves clearly. Since Dogecoin has performed like that before, then it is not out of proportion to expect similar performance, especially considering that it is now back to trading close to the lows that it rebounded from in late 2024. Related Reading: Can Dogecoin Price Reach $1 In 2026? Analysts Reveal What To Expect If Dogecoin were to produce a similar percentage expansion from a higher base, the arithmetic would also be straightforward. Using $0.15 as a reference level, a move equivalent to the late-2024 rally would project the price to around $0.60 to $0.67. That scenario assumes the same kind of rally seen previously, where the consolidation finally gives way to a parabolic rally, not a gradual grind higher. In practical terms, a trader holding 1,000 DOGE at $0.15 would have a position valued near $150 at entry, while a move to anywhere between $0.60 and $0.67 would lift that same holding into the $600 to $675 range. These figures do not come with any suggested timeline. Instead, they serve to show how Dogecoin’s past parabolic moves would translate if the same price behavior were applied to current levels. Even under that framework, the projected move is below Dogecoin’s existing all-time high of $0.76. At the same time, separate outlooks are already pointing to a push beyond that peak, with one notable prediction expecting a move to $0.80 very soon. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt|RSI",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56989909,
    "published": 1767908569000,
    "title": "CFTC issues no-action letter to Bitnomial, clearing way for event contracts",
    "body": "The no-action letter comes amid growing acceptance by US regulators of prediction-style markets and event contracts during an election year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 56989718,
    "published": 1767908228000,
    "title": "Bitnomial wins U.S. regulator's nod on prediction markets push, joins growing crowd",
    "body": "U.S. derivatives platform and clearinghouse is focusing on prediction contracts targeted at digital assets movements and economic indicators.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Bitnomial|U.S. Commodity Futures Trading Commission|Prediction Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56990266,
    "published": 1767909615000,
    "title": "Stablecoins Live Up To Their Billing During Venezuela Turmoil",
    "body": "Maria Clara Cobo writes on how Venezuelans increasing depend on cryptocurrencies to navigate the uncertainty that has engulfed the nation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56991468,
    "published": 1767913211000,
    "title": "Analyst Predicts Strongest XRP Price Rally In History Is Coming, Here’s Why",
    "body": "Crypto analyst Bird has indicated that the XRP price may be on course to record its greatest rally ever. The analyst alluded to the falling Bitcoin dominance as the reason why the altcoin could surge soon enough, noting how this development has preceded previous XRP rallies. Analyst Predicts Huge XRP Price Rally On The Horizon In an X post, Bird predicted that the XRP price is set to record its strongest rally yet based on the breakdown in Bitcoin’s dominance. This came as he noted that BTC.D dropped hard the last three times when XRP went truly parabolic, in 2018, 2021, and 2024. The 2018 run was when XRP rallied to its previous all-time high (ATH). Related Reading: Why XRP Is About To Experience A Legendary Next 3 Months Bird stated that after that first XRP price ATH between 2018 and 2021, the Bitcoin dominance began to trend back up. The BTC.D then backtested the trend and rebuilt strength before eventually rolling over. Once that rollover occurred, XRP went parabolic again in 2021. A similar scenario is said to have played out in 2024, as Bitcoin’s dominance dropped sharply through the trendline, briefly breaking down and triggering the surge. The analyst noted that the move in 2024 didn’t fully commit as Bitcoin’s dominance recovered and the breakdown failed. However, the attempt was enough to send the XRP price flying, reaching all-time highs. Bird reiterated that XRP is sensitive to a breakdown in Bitcoin’s dominance, even temporarily. Now, a similar move could be playing out again, which could send the XRP price to new highs. Bird stated that between 2023 and 2025, the Bitcoin dominance has trended up once more, broke down through the trend, backtested it from underneath, and is now chopping and rolling over. The analyst added that this is the same historical area where XRP has gone parabolic before, but that this time the setup is even bigger. The Altcoin Could Rally To Double Digits The analyst again alluded to the 2024 run. He stated that if a brief uncommitted breakdown in Bitcoin’s dominance was enough to send the XRP price surging, then a confirmed breakdown would be exponentially stronger. In line with this, Bird remarked that the next move is the one that sends XRP into double digits and beyond. Related Reading: Analyst Updates XRP Price Prediction: Why $16 Is Still On The Table Bird stated that the key difference is what comes next, as this next move isn’t just a fake-out or a shallow drop. Instead, it is the one where the Bitcoin dominance finally loses the trend for good and breaks down hard toward the lower boundary, around the 44 to 40% region. He added that when that happens officially, the XRP price doesn’t just run but enters true price discovery. At the time of writing, the XRP price is trading at around $2.14, down almost 5% in the last 24 hours, according to data from CoinMarketCap. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|altcoin|bitcoin dominance|btc.d|CoinMarketCap|Crypto analyst Bird|Ripple|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56992250,
    "published": 1767915474000,
    "title": "Wall Street, Crypto Leaders Make 'Progress' on Crypto Bill in Private Meeting: Sources",
    "body": "Leaders of a major Wall Street trade group and DeFi-focused crypto leaders are trying to hash out key disagreements before the market structure bill faces a do-or-die Senate vote next week.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56992693,
    "published": 1767916800000,
    "title": "Bitcoin Remains In A High-Risk Zone As Short-Term Holders Stay Underwater",
    "body": "Bitcoin is struggling to maintain the $90,000 level after a sharp rejection from the $94,000 resistance zone, keeping market sentiment sharply divided. While some analysts argue that BTC is entering a deeper corrective phase, others believe the pullback is a necessary reset before a renewed upside attempt. The current price action reflects this uncertainty, with volatility rising as buyers and sellers battle for short-term control. Related Reading: Bitcoin Tests Key Resistance While $4.7B In Sell-Side Liquidity Builds According to an analysis shared by Axel Adler, Bitcoin’s short-term risk structure remains fragile. His short-term risk chart places BTC below the Short-Term Holder (STH) Cost Basis, currently estimated near $100,200. Price is also trading beneath all major moving averages, including the 128-day, 200-day, and 365-day SMAs, reinforcing the view that the broader structure is still bearish. At current levels around $91,000, Bitcoin sits in a moderate risk zone, positioned between the STH Cost Basis and the -15% downside boundary. This positioning suggests that recent rebounds should be treated cautiously. Until BTC reclaims the STH Cost Basis, upside moves are more likely to represent technical bounces within a downward trend rather than a confirmed reversal. Conversely, a breakdown below the moderate risk boundary would signal rising downside risk and could accelerate selling pressure. As a result, the $90K–$100K range remains a critical battleground for Bitcoin’s next directional move. STH Losses Continue To Cap Bitcoin’s Upside Adler’s analysis also highlights a second critical framework: the chart tracking Bitcoin’s all-time highs alongside euphoria zones and the Short-Term Holder Market Value to Realized Value (STH MVRV) indicator. This metric measures the ratio between Bitcoin’s current market price and the average realized price of coins held by short-term investors, offering a direct view into the profitability—and behavior—of this highly reactive cohort. At present, STH MVRV sits near 0.92, well below its historical mean of roughly 1.09 and decisively under the neutral level of 1.0. In practical terms, this implies that the average short-term holder is holding an unrealized loss of about 8%. Historically, periods where STH MVRV remains below 1.0 have tended to coincide with either capitulation phases or extended consolidation ranges, rather than sustained bullish expansions. The last clear euphoria zone on this chart appeared during the all-time high update in October 2025, underscoring how far current conditions are from a speculative extreme. As long as STH MVRV remains below breakeven, short-term holders are incentivized to sell into rallies as the price approaches their cost basis. This behavior creates persistent overhead supply and reinforces structural resistance near the STH Cost Basis, close to the $100,000 level. Consequently, reclaiming that zone is not just a psychological milestone but a necessary condition for any meaningful regime shift back to a bullish market structure. Related Reading: XRP Sees Back-to-Back Liquidation Waves: Binance Absorbs Majority Of Liquidations Bitcoin Price Recovery Lacks Confirmation Bitcoin’s price action on the daily chart reflects a market still trapped in a fragile recovery attempt after a sharp rejection from higher levels. Following the failed breakout above the $94,000–$95,000 area, BTC experienced a decisive sell-off that pushed the price back toward the $85,000 zone, where buyers stepped in aggressively. This reaction marked a short-term bottom, but the subsequent rebound has so far lacked structural strength. At present, Bitcoin is trading near the $90,000–$91,000 region, a former support that has now turned into a key pivot. Price remains below the 200-day and 365-day moving averages, both of which are sloping downward and acting as dynamic resistance. The 128-day moving average has also capped recent upside attempts, reinforcing the idea that the broader trend remains corrective rather than impulsively bullish. Related Reading: Bitcoin Enters Accumulation Regime: Market Supported By Seller Exhaustion, Not Buying Surge From a structure standpoint, the chart shows a sequence of lower highs since the October peak, suggesting that sellers continue to control the macro trend. Volume expanded notably during the November–December sell-off, while the current bounce is unfolding on comparatively lighter participation. This divergence implies that the move higher may be more short-covering driven than supported by strong spot demand. Unless Bitcoin can reclaim and hold above the $94,000–$95,000 resistance zone with increasing volume, the risk of another rejection remains elevated. Failure to do so could reopen the path toward the $85,000 support, where the market would once again be forced to prove its underlying strength. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|Bitcoin news|bitcoin price|Bitcoin short-term holders|Bitcoin STH cost basis|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56995082,
    "published": 1767922406000,
    "title": "Coinbase lands 2nd ‘buy’ rating in a week, with BofA seeing 38% upside",
    "body": "Bank of America has upgraded Coinbase's rating on reversing short interest and tax-loss harvesting, while the exchange is broadening its vision to put the financial system onchain.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56994953,
    "published": 1767922247000,
    "title": "Revived NY bill targets sports, politics and death prediction markets",
    "body": "New York lawmakers will soon review a bill that seeks to ban certain sports and political event contracts in the state, among others.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 56995675,
    "published": 1767924028000,
    "title": "Iran’s Internet Traffic Drops to 'Near Zero' as Protests Intensify",
    "body": "Cloudflare data shows a near-total blackout as demonstrations calling for regime change spread and authorities tighten control.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      }
    ]
  },
  {
    "id": 56995650,
    "published": 1767924012000,
    "title": "Cardano Nears End Of 2020-Style Correction: Is $5 To $10 Next?",
    "body": "Cardano (ADA) may be nearing the end of a multi-month corrective phase that closely resembles its 2020 setup, according to a new technical analysis video posted Wednesday by crypto analyst Quantum Ascend. The analyst argues that a similar “lower trendline reset” preceded ADA’s prior breakout cycle, and that several weekly indicators are now starting to turn. Cardano’s 2020 Fractal Is Back In a Jan. 7 video shared on X, Quantum Ascend said he is looking at ADA’s weekly chart through a macro, multi-leg corrective framework. “On a macro count for ADA, you’re looking at an A, B, C, D, and right now waiting on an E,” he said, framing the current market structure as the late stage of a broader consolidation rather than a fresh downtrend. That “E” leg matters in their model because it effectively marks the final phase of a wedge-like compression. Quantum Ascend pointed to an upper trendline, Fibonacci levels, and prior work published in a mid-December video to justify upside targets once the structure completes. “Essentially you have upper trendline, you have some Fib stuff in play, I have a conservative of five bucks, primary up there at $10,” he said. “And then after that, I think it gets ugly for crypto for a little while, so still a believer that alt season is ahead of us.” Related Reading: Is Cardano Entering a New Phase? Technical Strength, ETF Watch, and Ecosystem Direction Align The core of the argument, however, wasn’t the targets themselves, it was the claimed resemblance to an earlier Cardano correction. Quantum Ascend overlaid a historical “fractal” to highlight comparable price behavior: a move up to a similar level, a pullback, another push into resistance, and then a wick that tagged roughly the same area on the overlay. “This correction right here that I just took this from, look at how similar it is to that correction that we just had,” he said. “Obviously it’s not perfect, but if you tried to get it close from a price structure standpoint… look where that wick on 10.10 went, exactly right there.” In the analyst’s telling, that prior pattern was the market’s way of forcing ADA down to establish a lower trendline before the next expansion. “So this is the same exact move that Cardano had to come down to set the lower trendline,” he said. “So right now setting the lower trendline, before it went on a blast off.” He then referenced the scale of Cardano’s last major run as a reminder of what altcoin cycles have historically looked like when momentum turns. “And how far did it end up running? Well, it ended up going 170X from that point in time, from a penny all the way up to $3,” Quantum Ascend said, using that move as context for why double-digit targets don’t automatically fall into the “impossible” bucket during late-cycle expansions. Related Reading: Cardano Founder Addresses ADA Dump Rumors, Is He Behind The 80% Price Crash? The more immediate claim is that the upside implied by a $10 target is not unprecedented in percentage terms compared with prior alt cycles. “When you’re looking at how far that $10 mark is from where we’re at right now, I mean 22X, right? 25X,” he said. “What was this alt season back here? This alt season was just 2021… That was a 21X… So it’s not unreasonable to be looking for 24X there. And then even on the conservative side, more of a 12X.” On indicators, Quantum Ascend highlighted early signs of a weekly momentum shift rather than a confirmed breakout. “You have a completed ABC. This thing’s ready to turn back around,” he said, adding that broader market conditions looked supportive of a bounce. The analyst also pointed to the weekly RSI beginning to lift after an extended period near lows. “Look at the RSI here on the weekly, finally starting to curl up off the floor. We’ve been down on the floor since October 27th that week, finally getting a little juice.” The analyst described negative momentum as “been decreasing,” and referenced an “ABC” structure on MACD as another piece of the same turning narrative. “A lot of these major moves happen when the weekly RSI goes from low to high,” Quantum Ascend said, arguing that higher timeframes can be slower but more reliable when they finally rotate. Quantum Ascend closed by saying he remains constructive on the project even without a current position. “I am a big believer in this project. I don’t hold any right now. It’s just the way that my portfolio has worked out,” he said. “But I do believe that there’s going to be some massive upside coming to Cardano.” At press time, ADA traded at $0.3925. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cardano|ADA|ADA news|ADA price|Cardano news|Cardano price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56996082,
    "published": 1767924935000,
    "title": "Bitcoin to hit $2.9M by 2050 as it muscles into global trade: VanEck",
    "body": "VanEck analysts said Bitcoin could handle 5–10% of global trade and make up 2.5% of central bank reserves by 2050, driving its strategic role as a monetary hedge.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56996364,
    "published": 1767925547000,
    "title": "Global sanctions fuel record flow to illicit crypto addresses",
    "body": "The Global Sanctions Inflation Index estimated there were just under 80,000 total sanctioned entities and persons globally as of May 2025.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56997125,
    "published": 1767927341000,
    "title": "Optimism floats OP buyback proposal using Superchain revenue",
    "body": "A new plan would tie OP token value to network performance by using half of all Superchain fee revenue for systematic repurchases.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 92,
        "NAME": "OP",
        "CATEGORY": "OP"
      }
    ]
  },
  {
    "id": 56998724,
    "published": 1767931240000,
    "title": "$460M Crypto Longs Squeezed As Bitcoin Slips Below $90,000",
    "body": "Data shows the crypto derivatives market has faced a fresh wave of liquidations as Bitcoin and other assets have gone through a retrace. Crypto Market Has Seen Liquidations Of More Than $462 Million According to data from CoinGlass, a notable amount of liquidations have occurred in the crypto derivatives market over the past day. “Liquidation” refers to the forceful closure that any open contract undergoes after it has amassed losses of a certain percentage specified by the platform. Related Reading: CryptoQuant CEO Expects Boring Bitcoin Action, Not Major Crash A mass amount of simultaneous liquidations can occur when the asset’s price observes a sharp price swing, not allowing investors the time to close their positions. The risk of this happening can increase depending on how much leverage traders are opting for. The trigger for the derivatives flush in the past day has been a downward move across tokens in the digital asset sector, which took Bitcoin to a low under $89,600. Below is a table that shows the numbers involved in this liquidation event. In total, the crypto market has witnessed over $462 million in liquidations during the last 24 hours, with longs dominating most of the flush. More specifically, bullish bets made up for $418 million of the positions involved, representing more than 90% of the total. The large amount of liquidations could indicate that the recovery in Bitcoin above $94,000 lured traders into opening fresh longs, which then ended up getting caught out by the price plunge. In terms of the symbols, the largest contributor to the liquidation event has been BTC with $132 million in positions involved, while Ethereum hasn’t been too far behind with a flush of $116 million. Interestingly, while the top two have been predictable, the third place hasn’t been occupied by the usual suspects this time. As the above heatmap displays, contracts related to Zcash (ZEC) have been caught up in liquidations of $24 million. The asset managing higher liquidations than the likes of XRP and Solana could be down to the fact that it has seen a notably sharper drop over the last 24 hours. Related Reading: Bitcoin Bounce A Bull Trap? Analyst Sees 2022-Style Bear Flag The latest liquidation squeeze has come as the futures market has been witnessing a re-expansion of Open Interest, as highlighted by Glassnode in its latest weekly report. The bearish price action between October and November had caused a massive amount of liquidations and forced traders to pull back on risk, resulting in the Open Interest taking a significant hit. Recently, the metric has seen a turnaround, implying investors have gradually been building up positions again. BTC Price At the time of writing, Bitcoin is trading around $89,500, down 2% over the past day. Featured image from Dall-E, Glassnode.com, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin derivatives|bitcoin liquidations|btc|BTCUSDT|crypto liquidations",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56998384,
    "published": 1767930407000,
    "title": "US Bitcoin ETFs Clock Three-Day Outflow Streak as Risk Appetite Cools",
    "body": "Tactical de-risking and declining investor sentiment are the reasons behind the recent spot U.S. ETF outflows, Decrypt was told.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56998973,
    "published": 1767931574000,
    "title": "Bitcoin is now 56.7% green: Here’s how it could get even cleaner",
    "body": "Bitcoin mining is accelerating renewable energy deployment, replacing fossil-fuel heating, expanding energy access and cutting methane emissions at scale.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57000246,
    "published": 1767934845000,
    "title": "Dogecoin Prepares For Major Recovery As Bullish Momentum Builds – Here’s The Target",
    "body": "Dogecoin (DOGE) is attempting to hold a crucial area as support after recording a 3.2% drop in the daily timeframe. Despite this, an analyst suggests that the leading memecoin is preparing to reclaim a key resistance level lost during the Q4 2025 pullbacks. Related Reading: XRP Named The ‘New Cryptocurrency Darling’ After Strong Start Of The Year Dogecoin Q1 Momentum Builds Dogecoin has seen a remarkable start to the year, recording a 21% jump from its yearly opening price of $0.117. Amid the recent market recovery, the cryptocurrency reclaimed a crucial price area and hit an eight-week high of $0.156 this Tuesday. Notably, the largest memecoin by market capitalization had retraced more than 50% from its Q2 2025 highs and was in a downtrend until last week’s price breakout. Amid this performance, market observer Trader Tardigrade highlighted a pair of Tweezer candlesticks on the monthly chart, which could suggest a bullish reversal is taking place. DOGE “has nearly recovered last month’s losses in just 8 days,” he explained, which signals that “clearly, bullish momentum is building up.” Notably, the analyst recently noted that DOGE has broken out of a bullish pattern, “showing strong upward momentum.” According to the chart, the cryptocurrency displayed a three-month falling wedge in the three-day chart. Following the recent price surge, Dogecoin was able to breach the pattern’s upper boundary, signaling an initial jump to the $0.140-$0.150 area. The trader highlighted that the memecoin displayed a similar performance during his 2024 rally, moving within a multi-month falling wedge before breaking out and kicking off a remarkable performance. If DOGE repeats its previous performance, the price could retrace briefly to retest the breakout area as support before the next major surge, the market watcher added. He also pointed out that after breaking out of the daily trendline, the cryptocurrency appears to be forming a bullish pennant in the one-day chart. A breakout from this pattern would lead to a 40% move toward the $0.20 area, lost during the early Q4 pullbacks. However, DOGE’s price needs to close the day above the $0.142 area to hold the formation. DOGE’s Rally In Danger? Despite the bullish outlooks, analyst Ali Martinez affirmed that Dogecoin is “hanging by a thread.” In a Thursday post, the market watcher emphasized that the cryptocurrency is trading within a crucial support zone between the local lows of $0.118 and the recent highs. If the memecoin’s momentum doesn’t hold and the price loses this key zone, it could risk a more than 40% retrace. According to the UTXO Realized Price Distribution (URPD) metric cited by Martinez, the next major support is around $0.073, where over 28 billion DOGE tokens were previously exchanged. Related Reading: Bitcoin At A Crossroads: $93,500 Reclaim Holds The Key For Next Move The analyst has recently pointed out that cryptocurrency’s price is seemingly on track to retest the $0.08 level after breaking out of a multi-year ascending channel. The chart shows that Dogecoin traded within an ascending channel on the three-day chart since 2023. However, the late 2025 corrections saw the memecoin lose the lower boundary of the ascending channel, potentially painting a concerning picture for its price if long-term bearish momentum continues. As of this writing, Dogecoin is trading at $0.142, a 14.55 increase in the weekly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto analyst|crypto market correction|Crypto Market Recovery|Crypto trader|doge|DOGE prediction|Doge price|Dogecoin|Dogecoin Ascending Channel|Dogecoin breakout|dogeusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57000673,
    "published": 1767935684000,
    "title": "Masked Gunmen Tie Up Woman in France, Steal Crypto USB",
    "body": "France is becoming a European hotspot for crypto wrench attacks, with over 14 crypto-related attacks documented last year.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57000696,
    "published": 1767935377000,
    "title": "Truebit token crashes 99.9% after hacker drains $26.6 million in ether",
    "body": "The attack exploited a flaw in an older smart contract, allowing the attacker to buy TRU at no cost and sell it back to extract ether.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|blockchain contracts|Hack|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 57000468,
    "published": 1767935339000,
    "title": "Solana (SOL) Picks Up Speed, Raising Talk of a New Upside Run",
    "body": "Solana started a fresh increase above the $136 zone. SOL price is now consolidating above $138 and might aim for more gains above the $142 zone. SOL price started a fresh upward move above the $136 and $138 levels against the US Dollar. The price is now trading above $138 and the 100-hourly simple moving average. There was a break above a bearish trend line with resistance at $137 on the hourly chart of the SOL/USD pair (data source from Kraken). The pair could extend gains if it clears the $142 resistance zone. Solana Price Regains Traction Solana price corrected gains from the $144 zone but remained stable above the $130 zone, beating Bitcoin and Ethereum . SOL formed a low near $132 and started a fresh upward move. The price climbed above the $135 level to enter a short-term positive zone. It surpassed the 50% Fib retracement level of the downward move from the $143 swing high to the $132 low. Besides, there was a break above a bearish trend line with resistance at $137 on the hourly chart of the SOL/USD pair. Solana is now trading above $138 and the 100-hourly simple moving average. On the upside, the price is facing resistance near $140 and the 76.4% Fib retracement level of the downward move from the $143 swing high to the $132 low. The next major resistance is near the $142 level. The main resistance could be $145. A successful close above the $145 resistance zone could set the pace for another steady increase. The next key resistance is $150. Any more gains might send the price toward the $155 level. Another Decline In SOL? If SOL fails to rise above the $140 resistance, it could start another decline. Initial support on the downside is near the $138 zone. The first major support is near the $135 level. A break below the $135 level might send the price toward the $132 support zone. If there is a close below the $132 support, the price could decline toward the $124 support in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is gaining pace in the bullish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is above the 50 level. Major Support Levels – $138 and $135. Major Resistance Levels – $140 and $142.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Technical analysis|Sol|Solana|solbtc|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57001268,
    "published": 1767936576000,
    "title": "Builders behind popular Zcash wallet Zashi to launch new startup 'cashZ'",
    "body": "The Zcash protocol remains unaffected despite the governance clash and restructuring with Bootstrap.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Zcash|ZEC|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      }
    ]
  },
  {
    "id": 57001591,
    "published": 1767938150000,
    "title": "Australian Regulator Flags Grok in Rising AI Image Abuse Complaints",
    "body": "Reports of non-consensual AI-generated sexual images doubled since late 2025, with some involving children, the Commissioner said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57001750,
    "published": 1767938602000,
    "title": "Crypto market crash in October marked end of ‘easy yield’ era: BitMEX",
    "body": "BitMEX says the era of easy money via arbitrage trades likely died in the October crash, as a liquidation spiral left many market makers naked.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57002584,
    "published": 1767941539000,
    "title": "Bitcoin ETF optimism fades as three-day outflows streak erases early-month gains",
    "body": "Bitcoin ETFs have registered a net outflow of over $1 billion in three days.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin ETF|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57004773,
    "published": 1767946532000,
    "title": "Bitcoin Indicator With 84% Hit Rate Flashes Again: Is A Price Rally Next?",
    "body": "The Bitcoin hash ribbons indicator has recently flipped back to a buy signal on the weekly timeframe, according to a Jan. 8 video analysis from crypto analyst Kevin (@Kev Capital TA). The setup matters, he argued, because the model has historically been associated with higher prices after corrective periods, even if its record is no longer spotless. In the video, Kev Capital walked viewers through the weekly Bitcoin chart with the hash ribbons overlay, describing it as one of the higher “hit rate” signals in crypto’s technical playbook. “There have been 19 buy signals on the weekly time frame throughout all of Bitcoin’s history and it has an 84% hit rate of playing out,” he said, adding that such consistency is rare for any single indicator. Hash ribbons attempt to infer miner stress and recovery by comparing short- and longer-term moving averages of network hash rate. Kev Capital framed it less as a simple “buy/sell” tool and more as a proxy for network health, where miner behavior can precede shifts in market structure. “It’s not just a buy and sell indicator. It’s tracking mining hash rate,” he said. “And what that basically means is it’s tracking the overall power and network health on the Bitcoin blockchain.” Related Reading: Bitcoin Fear & Greed Index Nears Neutral As Price Recovers The mechanics, as he explained them, hinge on the 30-day moving average of hash rate (his chart showed this as a green line) versus the 60-day moving average (a gray line). When the 30-day crosses below the 60-day, the model labels it capitulation, which he described as aligning with bearish price action and a weaker network backdrop. When the 30-day crosses back above the 60-day, the indicator prints a buy signal (shown as blue dots on his chart), which he interprets as miners “rebounding” after weaker operators have been forced out. “Anytime that 30-day crosses below the 60, it marks a capitulation phase, which shows that there’s been bearish price action in a weaker network,” Kev Capital said. “Now, when it crosses back above is when you get the blue dots, and that is a buy signal. That’s when the 30-day moving average of hash rate crosses back above the 60-day moving average of hash rate.” Bitcoin Hash Ribbons Buy Signal Returns The near-term catalyst for his update was a fresh signal sequence around the end of December. Kev Capital said the hash ribbons flashed capitulation in the second-to-last week of December, followed by a buy signal in the last week of December. He noted the indicator was again “flashing a capitulation signal” during the current week, not yet confirmed which could set up another buy signal if the moving averages continue to “mingle” and then resolve higher. Related Reading: Why Morgan Stanley’s Bitcoin ETF Is The ‘Most Bullish Thing Ever’: Jeff Park He also spent time qualifying the model’s reputation. While he cited an 84% historical hit rate for the weekly buy signals, he said that earlier in the current cycle the indicator printed two buy signals: in May and July that did not deliver the kind of follow-through that has defined prior successful instances. “We did go up from the original buy signal, but it really wasn’t a lot,” he said, contrasting that with prior hash ribbons episodes that “typically produce a 30 to 100% move.” In his telling, those underwhelming outcomes were enough to break what he described as a prior “100% hit rate” framing. https://t.co/vfZFXTAN77 #BTC Weekly Hash Ribbons buy signal and what it means. #Crypto #Altcoins — Kevin (@Kev_Capital_TA) January 8, 2026 Still, Kev Capital argues the context is now different because the latest signal comes after a drawdown. He referenced a 36% decline in Bitcoin during the recent corrective period and suggested the early signs of miner recovery, reflected in the moving averages stabilizing and attempting to turn up, are the conditions where the indicator has historically performed best. However, he cautioned that timing is variable, saying the setup can take “two to four to six weeks” to play out, or move sooner. At press time, Bitcoin traded at $91,009. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin hash ribbons|Bitcoin news|bitcoin price|btc|BTC news|btc price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57005796,
    "published": 1767948596000,
    "title": "South Korea’s top court says exchange‑held Bitcoin can be seized",
    "body": "The ruling confirms that Bitcoin in Korean exchange accounts is an “object of seizure” under criminal law, aligning Seoul with US and EU enforcement practices.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57005816,
    "published": 1767948281000,
    "title": "A ruble stablecoin outpaced market leaders last year despite international sanctions",
    "body": "A7A5, a ruble-linked stablecoin few outside Russia had heard of a year ago grew the most of any stablecoin, outpacing both USDT and USDC over the past 12 months.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Russia|ruble|Stablecoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57006766,
    "published": 1767947549000,
    "title": "Ethereum treasury firm SharpLink stakes $170M ETH on Linea network",
    "body": "The strategy combines native Ethereum staking yield with restaking rewards and incentives from Linea and ether.fi, under a qualified custodian structure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Ethereum Treasury|Staking|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57006975,
    "published": 1767951289000,
    "title": "Bitcoin and Ether ETFs shed over $1B as early 2026 inflows reverse",
    "body": "After a brief January rebound, US spot Bitcoin and Ether ETFs saw heavy redemptions, extending a cautious trend that began after October’s market reset.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57008929,
    "published": 1767956093000,
    "title": "Zcash sees developer slowdown as ZEC extends two-month slide",
    "body": "Zcash developer activity has fallen to its lowest level since 2021 as a governance dispute weighs on sentiment and ZEC extends a two-month decline.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 57009340,
    "published": 1767956400000,
    "title": "Stablecoin Firm Rain Valued at $1.95 Billion After Funding Round",
    "body": "Stablecoin payments firm Rain said it raised $250 million in a funding round that gives it a valuation of $1.95 billion.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57009591,
    "published": 1767958245000,
    "title": "Why The Bitcoin Price Could Crash Another 20% To $76,000 Soon",
    "body": "The Bitcoin price could be in for more pain as a crypto analyst has just released a gloomy short-term outlook, warning that another crash may be on the way. The analyst believes that Bitcoin’s overall market structure remains bearish. As a result, he expects the price to fall to about $76,000, representing a 20% decline from current levels. Bitcoin Price At Risk Of 20% Crash Crypto market analyst Roman has issued a warning that Bitcoin could be heading for another sharp decline, with his primary target set near $76,000. In his post on X, he emphasized that the current market structure shows no evidence of a sustainable price bottom and that downside risk remains dominant. Related Reading: Bitcoin Price To Crash Another 50% As Analyst Marks $40,000 Bottom Target Roman explained that his bearish outlook is based on the daily timeframe, where Bitcoin has struggled to regain strong bullish momentum after a significant correction. He also noted that the price is still trading within a broader bearish trend, suggesting the market may simply be taking a pause before the next move lower. The accompanying chart shows BTC trading above $90,000 while still well below the previous resistance area near $96,000. Each attempt to push higher has been rejected, suggesting sellers remain firmly in control of the market. Notably, Roman’s chart has revealed that the expected move lower could start with a drop back to the mid $80,000s, followed by a deeper slide between $78,500 and $75,000. The hand-drawn projection on the chart also illustrates a sharp fall after a brief relief rally, suggesting that BTC’s decline could speed up once support breaks. Volume behavior also plays a key role in Roman’s bearish outlook. The chart shows noticeably weak trading volume during Bitcoin’s recent rebound, which the analyst previously said is typical of holiday-driven pumps. Additional Signals That Support Analyst’s Bearish Forecast Roman’s $76,000 Bitcoin crash forecast is a follow-up to previous posts in which he explained several reasons why the leading cryptocurrency is in a bear market and could correct again soon. He referenced historical indicator behavior to justify his latest prediction. Related Reading: Bitcoin Price Crash To $25,000: Why The Bottom Is Much Lower The analyst explained that Bitcoin’s Moving Average Convergence Divergence (MACD) and Relative Strength Index (RSI) were extremely oversold after its price dropped roughly 40% from its all-time high. As a result, the current consolidation has given these indicators a chance to reset. Roman sees the lack of strong buying pressure during this reset as a warning sign. He stressed that a true bullish reversal would need rising volume and clear higher highs, which are not showing on the daily chart. The analyst also noted that Bitcoin’s longer-term trend remains bearish, with the market continuing to form lower highs within a declining range. He has concluded that until clear reversal signals appear, traders should treat any upside moves as corrective, not the start of a fresh bull run. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|MACD|Moving average convergence divergence|Relative Strength Index|Roman|RSI",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57009452,
    "published": 1767957791000,
    "title": "South Korea to flip bitcoin ETF stance as part of broader crypto push",
    "body": "A new Digital Asset Act will regulate stablecoins, requiring 100% reserve backing and user redemption rights.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|South Korea|Bitcoin ETF|Regulations|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57010521,
    "published": 1767960000000,
    "title": "BNY Launches Tokenized Deposits in Digital Assets Expansion",
    "body": "Bank of New York Mellon Corp. has launched a tokenized deposit service that allows clients to transfer funds using blockchain rails, becoming the latest major global bank to push deeper into digital assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "NYS:BK",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57010752,
    "published": 1767961582000,
    "title": "Ripple wins UK regulatory approval from Financial Conduct Authority",
    "body": "Ripple has gained FCA registration through its U.K. subsidiary, marking a key regulatory milestone as Britain moves to bring crypto into its financial framework.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Ripple|UK|FCA|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57011059,
    "published": 1767962266000,
    "title": "Visa-linked stablecoin platform Rain raises $250M at $1.95B valuation",
    "body": "The raise values Rain at $1.95 billion after a 30-fold card growth in 2025 as the Visa-linked platform plans expansion across multiple continents.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57010975,
    "published": 1767961800000,
    "title": "The 24/7 global stock market is impossible on today’s blockchain",
    "body": "Current blockchain infrastructure has inadequate throughput and systematic front-running. Real-world finance demands sub-second finality and fair transaction ordering.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57011490,
    "published": 1767963642000,
    "title": "Cathie Wood: Trump May Buy Bitcoin For US Reserve Ahead Of Midterms",
    "body": "Cathie Wood, ARK Invest’s founder and CEO, said she expects the Trump administration could move beyond simply holding seized bitcoin and begin purchasing BTC to build a US strategic reserve, a shift she argued could become a catalytic signal for markets and other governments. Speaking on ARK’s “Bitcoin Brainstorm” podcast in an episode dated Jan. 08, Wood framed government buying as a potential inflection point at a time when she believes institutional participation remains “just beginning” and bitcoin’s supply dynamics are getting harder to ignore. “We have seen very little institutional buy-in, it is just beginning,” Wood said. “And I think if we get the US, for example, not adding just confiscated bitcoin to a strategic reserve but, you know, out there buying, and we don’t know if that’s going to be the case. But if they were to do so, I have a feeling that would set off what we’re all waiting for, which is, you know, the scarcity value to reassert itself again now that we’re near 20 million bitcoin outstanding and we only have one more million to go.” Related Reading: Bitcoin Emerges As A Hedge Amid Rising Global Geopolitical Tensions In the discussion, Wood suggested the administration’s posture so far has effectively been limited to confiscated holdings. She contrasted that with what she described as an earlier ambition for scale, noting “the original intent was to own a million bitcoin,” before adding her view that a pivot toward purchases is plausible. Midterms Could Drive US Bitcoin Reserve Buys Wood linked that possibility to political incentives heading into the 2026 US midterm elections, describing Trump as motivated to keep momentum and avoid being politically sidelined. “President Trump does not want to be a lame duck,” she said. “So I have a feeling that he is going to work with his crypto and AI czar to do a few things… [and] it seems as though there’s been reticence about actually buying bitcoin for the strategic reserve. So far, so far it’s confiscated… So I actually think they will start buying.” Related Reading: Bitcoin Indicator With 84% Hit Rate Flashes Again: Is A Price Rally Next? Wood also pointed to what she sees as aligned constituencies around the president, arguing he has “all kinds of reasons” to lean into crypto while emphasizing that the political calculus matters because of the midterm timeline. When the conversation turned to how such purchases could be executed, Wood echoed the idea that any reserve strategy would need to be budget-neutral. She didn’t outline a mechanism, but treated the constraint as a key gating factor for feasibility. Wood argued that explicit US buying would not just be a domestic market event. Iit could force other capitals to revisit reserve policy. “Something that’s really important… we thought that countries would adopt it much earlier than they have,” she said. “I think if the US actually says, ‘Okay, now we’re going to buy,’ that’s going to spur a lot of other governments to think this thing through. Do they want to be hostage to the dollar…? And you know, no, they don’t. So put some bitcoin in your reserves.” If that dynamic accelerates, Wood warned emerging-market currencies could face renewed pressure, describing a scenario where reserve diversification toward bitcoin reshapes volatility across weaker fiat regimes, a downstream effect, she suggested, of Washington making the first overt move from holding seized BTC to competing in the open market. At press time, BTC traded at $90,578. Featured image from YouTube, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|Cathie Wood|Donald Trump|Strategic Bitcoin Reserve",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57011510,
    "published": 1767963569000,
    "title": "Sharplink pockets $33M from Ether staking, deploys another $170M ETH",
    "body": "Corporate crypto treasuries are increasingly turning to ether staking, as firms like SharpLink generate recurring yield from onchain operations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57010745,
    "published": 1767961360000,
    "title": "The hidden risk of public WiFi: How a single approval wiped a crypto wallet",
    "body": "A crypto user who lost $5,000 from a hot wallet after a stay at a hotel said the real culprits were open WiFi, a casual lobby phone call and one careless wallet approval.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57012021,
    "published": 1767965034000,
    "title": "Ripple scores UK regulatory approval via local subsidiary",
    "body": "Ripple’s UK subsidiary gained regulatory approval as an Electronic Money Institution to provide payment services, but faces limits on certain crypto activities.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57013403,
    "published": 1767969021000,
    "title": "Wall Street Analyst Is Still Bullish On Bitcoin, Predicts Price Recovery",
    "body": "As the market remains divided on Bitcoin’s (BTC) near-term direction, one Wall Street analyst is standing firm in his bullish outlook. He predicts that Bitcoin could soon enter a price discovery, underscoring its value beyond being a payment currency to a market leader and one of the best-performing assets that could eventually reach gold’s market capitalization. Analyst Stays Bullish On Bitcoin Despite Price Instability In a recent interview with CNBC, William Blair’s fintech equity analyst Andrew Jeffrey said recent price swings do not change his long-term conviction in Bitcoin’s recovery and future value. CNBC opened the discussion by pointing out that crypto started the year on a stronger note than Q4 2025, rising about 5% before giving back more than 2% after a sharp rally. Related Reading: Analyst Predicts Strongest XRP Price Rally In History Is Coming, Here’s Why When asked what was happening beneath the surface of Bitcoin’s latest moves, Jeffrey said its behavior reflects the nature of an immature asset. He explained that BTC has a market capitalization of more than $1.9 trillion. Yet, roughly one-third of the total supply is controlled by a small group of wallets, roughly estimated at 2 million. The Wall Street analyst stated that this supply concentration creates instability, especially during periods of market stress. He added that recent buyers, particularly retail investors entering through ETFs, tend to have weaker conviction and are more likely to sell during downturns. According to Jeffrey, these sell-offs can feed on themselves, leading to sharper declines. He said the current environment is broadly risk off, but emphasized that he sees this phase as temporary. The Wall Street analyst also highlighted his belief that Bitcoin will increasingly be viewed as a store of value. He stated that BTC could eventually challenge gold’s role in that category and move closer to the precious metal’s market cap, which is currently about 15x larger than Bitcoin’s today. While optimistic about Bitcoin’s outlook, Jeffrey made it clear that he does not see it becoming a dominant payment tool. Instead, he stated that stablecoins like Circle’s USDC are more suited for transactions. The analyst emphasized that price discovery is still underway and that BTC’s long-term potential remains intact despite recent market turbulence. Bitcoin Still Needs To Lead For Crypto To Rise In the interview, Jeffrey spoke with CNBC about fading excitement around Bitcoin as newer crypto stories attract attention. CNBC raised concerns that BTC feels like old news as prices hover and interest shifts towards more interesting news surrounding companies like Ripple. Related Reading: XRP Mirrors Gold’s Trajectory: What A Similar ATH Rally Would Mean Jeffrey replied that Bitcoin’s short-term price action is driven by investor psychology, while its long-term performance tells a different story. He highlighted that Bitcoin has been the best-performing asset in the world over the past decade and said investors need to maintain that perspective. CNBC also questioned whether crypto growth could now occur without Bitcoin leading the way. The Wall Street analyst responded that it would be very hard for the crypto market to see sustained gains without BTC at the forefront. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57014291,
    "published": 1767971484000,
    "title": "Altcoins Defy Bitcoin Slump as XRP, Solana Notch Double-Digit Gains",
    "body": "Experts note altcoins’ superior performance compared to Bitcoin is driven by ETF narratives and markets awaiting key U.S. economic data.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57014160,
    "published": 1767970974000,
    "title": "Tether said to have invested up to $50 million in crypto lender Ledn at $500 million valuation",
    "body": "The stablecoin issuer’s previously undisclosed investment valued the lender at about $500 million, according to a person familiar with the transaction.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Ledn|Tether|mergers and acquisitions|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57015321,
    "published": 1767974445000,
    "title": "Analyst Breaks Down Why Investors will Make More Money With XRP Than Bitcoin",
    "body": "A crypto market participant has outlined a numerical comparison showing how the same investment amount could generate significantly different returns depending on whether it is placed into Bitcoin or XRP. The projection, which was shared on X and focuses on price levels and capital growth, shows how XRP has a better upside on a percentage basis compared to Bitcoin at its current valuations. How The Numbers Favor XRP Over Bitcoin The comparison starts with a $5,000 investment. At current prices, Bitcoin would need to rise to around $180,000 for that initial $5,000 investment to double to $10,000. Interestingly, multiple bullish predictions put Bitcoin reaching a price target of at least $180,000 in the next few months, so this is most likely a guarantee. However, Bitcoin’s position as the largest cryptocurrency works as both an advantage and a constraint. Related Reading: XRP Retrace Is Only Temporary, What Happens Once the Uptrend Resumes At the time of writing, Bitcoin has a large market cap of $1.8 trillion. Given Bitcoin’s already large market cap, any move of notable magnitude requires huge capital inflows over an extended period of time. Its recent adoption among institutional traders and role as the largest cryptocurrency provide stability, but its size limits how quickly it can multiply in value. Each incremental gain requires increasingly larger amounts of new capital entering the market. On the other hand, XRP has a much smaller market cap of $128 billion. Using the same $5,000 investment in XRP produces a much different outcome under the analyst’s assumptions. If XRP reaches a $10 price level, the value of that position would rise to $25,000. Therefore, this means that, as it stands, XRP has a much better profit potential than Bitcoin. The argument presented is not that Bitcoin lacks upside, but that the capital efficiency of XRP is higher if both assets move to commonly cited bullish targets. Risk Profiles And Return Expectations The difference in projection also shows different risk tolerances of both cryptocurrencies. Bitcoin is more appealing to investors who prioritize long-term exposure and relative stability. Predictions for Bitcoin range from $150,000 all the way to above $1 million. Related Reading: XRP Price Mirrors 2017 Sideways Accumulation Trend – Here’s What Happened Last Time XRP, on the other hand, will attract traders who are willing to accept higher volatility in exchange for the possibility of larger returns. The cryptocurrency has been the subject of numerous bullish projections from analysts due to the growing optimism around its role in financial institutions and the recent exposure through Spot XRP ETFs. The bullish sentiment is so strong that a few analysts are already projecting how XRP has the potential to trade at $100 in the next few years. One analyst, for example, noted that XRP has the potential to reach $100 before Bitcoin reaches $1 million and that it can even hit $1,000 before Bitcoin hits $19 million. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|bitcoin|Ripple|Spot XRP ETFs|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57015070,
    "published": 1767973732000,
    "title": "Ripple Gets Green Light From FCA to Scale Crypto Payments in the UK",
    "body": "Ripple secured regulatory approval to scale its payments business from the UK's Financial Conduct Authority (FCA).",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57011641,
    "published": 1767964167000,
    "title": "Bitcoin may be gearing up for a rally that sent price to $126,000 last year",
    "body": "The current tight consolidation closely mirrors the April 2025 range that set the stage for the record run above $126,000.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57015755,
    "published": 1767975375000,
    "title": "Security expert Bruce Schneier ‘guarantees’ governments are bulk spying with AI",
    "body": "From PRISM to AI, mass surveillance has only grown more powerful. Bruce Schneier warns the post-Snowden world may be entering an even darker phase.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57016283,
    "published": 1767977140000,
    "title": "Crypto exchange OKX cuts institutional staff amid global restructuring",
    "body": "The exchange has overhauled its institutional business as part of a broader restructuring, with approximately one-third of its sales team exiting, according to one source.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|OKX|Crypto Exchange|Institutions|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57016020,
    "published": 1767976297000,
    "title": "Ethereum Founder Vitalik Buterin Backs Convicted Dev, Calls Privacy 'Essential Protection'",
    "body": "Ethereum co-founder Vitalik Buterin publicly backed convicted Tornado Cash developer Roman Storm, calling privacy tools a human right.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57016635,
    "published": 1767978000000,
    "title": "The $44 Billion Bet-On-Anything Economy Has Arrived",
    "body": "Prediction markets have gone mainstream. Now the mechanics that powered $44 billion in volume are spreading to stock picks, photos, and social games.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57016794,
    "published": 1767978234000,
    "title": "BNY launches tokenized deposits amid TradFi rush into blockchain and crypto",
    "body": "The service is available for institutional clients through an in-house permissioned blockchain, BNY said on Friday.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57017260,
    "published": 1767979807000,
    "title": "Solana Accumulation Narrative Strengthens With Big Institutions, A Rally Imminent?",
    "body": "Solana is undergoing a major shift as big institutional players are increasingly positioning in the network. What was once viewed primarily as a high-performance Layer-1 driven by retail and developer enthusiasm is now attracting serious capital allocations from professional funds, asset managers, and institutional allocators. This trend bolsters the SOL accumulation thesis as an emerging institutional liquidity and infrastructure story. Why Big Capital Begins Positioning Into Solana In an X post, Rex reported that the latest wave of institutional interest in Solana confirms what analyst Solana Sensei pointed out, that big firms are actively accumulating SOL right now. Forward Industry alone is holding close to $1 billion worth of SOL, while firms like Defidevcorp and others are sitting on hundreds of millions. Related Reading: Solana’s Network Performance Reaches Historic Peaks As Transaction Activity Climbs Rex views this move as just the start, and SOL stands out when it comes to real-world asset (RWA) tokenization. Its insane transaction speed, combined with dirt-cheap fees and real scalability, finally makes moving real assets on-chain viable and sustainable. These projects choosing SOL isn’t accidental; they know where the future is heading. The expert also reflects on the journey. SOL has been addressed as fast but too centralized. Currently, the same institutions that once stayed on the sidelines are quietly stacking billions in SOL, while the real run hasn’t even started yet. SOL is positioning itself to reach levels that may look unimaginable in the next few years. “Supper proud to be part of this,” Rex noted. While the crowd stayed focused on the 2025 volatility, an analyst known as Senior highlighted that Solana entered 2026 by finally delivering on its biggest technical promise. The Firedancer validator client officially went live on mainnet as of January 2026, pushing the network’s finality to 150 milliseconds and finally ending years of beta resilience and performance concerns. At the same time, Western Union officially integrated the SOL network. Meanwhile, the Spot SOL ETF surpassed $1 billion in total net assets this week, indicating that the infrastructure has also reached true institutional-grade standards. In the past, the moment SOL transitions from a retail playground to a permanent global financial rail, becoming unshakeable will feel obvious. On-Chain Activity Reflects Real Usage Growth The Solana metrics are growing. Investor and founder of the Inner Circle, Lark Davis, has revealed that the SOL application revenue surged to $2.39 billion, a 46% year-over-year increase and a new all-time high in 2025. SOL network revenue also reached $1.48 billion, representing a 48 times increase over the past two years. Meanwhile, daily active wallets have climbed to 3.2 million, showing that SOL growth is improving. Related Reading: Why Has The Solana Price Been In A Steady Downtrend Since January? On January 6th, nearly $900 million in stablecoin supply entered the SOL ecosystem in a single day. Currently, SOL leads all chains in both 24-hour and 30-day DEX volumes, and has emerged as the top blockchain by market capitalization for tokenized stocks. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Solana|DEX|Firedancer|Lark Davis|Real World Asset|REX|RWA|Senior|Sol|SOL news|SOL Price|Solana Ecosystem|Solana network|Solana news|Solana Price|SOLUSD|SOLUSDT|Spot Solana ETF|western union",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57017370,
    "published": 1767980035000,
    "title": "BNY Debuts Tokenized Deposits for Institutions and 'Digital Natives'",
    "body": "BNY, the world’s largest custodian bank, signaled that it will begin issuing digital representations of customers’ deposits on the blockchain.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 57017510,
    "published": 1767979032000,
    "title": "ZEC Rebounds 11%! Trump says he won’t pardon Sam Bankman-Fried! Florida revisits it’s Strategic Bitcoin Reserve!",
    "body": "Crypto majors are mostly flat ahead of today’s supreme court opinion on the trump tariffs; btc +1% at $90,300; eth 13% at $3,090, sol +3% at $138; xrp +1% to $2.10. Polygon (+11%), zec (+11%) and syrup (+7%) led top movers. Jpmorgan said the recent bitcoin and ethereum sell-off may be bottoming, pointing to improving positioning and easing downside pressure after early-year weakness. Bank of america analysts upgraded coinbase to buy, citing improved regulatory clarity, growing institutional adoption, and stronger long-term earnings visibility. Morgan stanley is planning to launch a digital wallet later this year that could support tokenized assets, including private company equity. Florida lawmakers renewed their push for a state-level bitcoin reserve. Ethereum’s validator exit queue fully cleared, easing delays that had impacted liquid staking protocols and validator withdrawals. Polygon labs unveiled the open money stack, an initiative designed to streamline stablecoin payments. Polygon is reportedly close to acquiring coinme, a major bitcoin atm operator. Trump said that he won’t pardon ftx founder sam bankman-fried.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 38,
        "NAME": "MATIC",
        "CATEGORY": "MATIC"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57018051,
    "published": 1767981952000,
    "title": "Crypto VC Giant Andreessen Horowitz Raises $15 Billion to Help America 'Win' Tech Race",
    "body": "Major crypto investor Andreessen Horowitz raised $15 billion across multiple funds to propel technology bets and help boost America's prospects.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57018582,
    "published": 1767983400000,
    "title": "Bitcoin’s next super rally could depend on this key data point",
    "body": "Long-term Bitcoin holders sold nearly $300 billion worth of BTC in 2025, but as this sell pressure declines, a bullish outlook for 2026 has emerged.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57019192,
    "published": 1767985207000,
    "title": "Bitcoin Risks Drop To $69,000 If Pennant Support Breaks, Analyst Warns",
    "body": "A cryptocurrency analyst has pointed out how Bitcoin could risk a crash to $69,230 if the support level of this Bear Pennant doesn’t hold up. Bitcoin Might Need To Hold Above $87,200 In a new post on X, analyst Ali Martinez has talked about a support level that BTC might have to hold in order to avoid a steep drop. The level in question is the lower line of a Bear Pennant. A Pennant is a pattern from technical analysis (TA) that’s similar to a Flag. Both of these patterns are characterized by an initial sharp move (commonly known as the “pole”) and a subsequent phase of consolidation. But unlike Flags, which involve a parallel consolidation channel, Pennants involve a triangular channel instead. Related Reading: $460M Crypto Longs Squeezed As Bitcoin Slips Below $90,000 When the price is trading inside the consolidation portion of the Pennant, it encounters resistance at the upper line and support at the lower one. A breakout of either of these levels may signal a sustained move in that direction. Pennants are generally considered to be continuation patterns, so a move may be more likely to take place in the same direction as the pole. In a Bear Pennant, the pole is represented by a downward move, implying that a bearish continuation could succeed the pattern. Now, here is the chart shared by Martinez that shows the Bear Pennant that Bitcoin has been trading inside on the daily timeframe over the last couple of months: As displayed in the above graph, Bitcoin retested the upper line of the Pennant’s consolidation region when its price surged above $94,000. This retest ended up in rejection, and the coin has since retraced to lower levels. If the current trajectory in the cryptocurrency continues, it’s possible that a retest of the support level could take place, which is situated around $87,200. Since the pattern involved here is a Bear Pennant, BTC failing a retest of this line could signal a bearish breakout. Pennant breakouts are usually considered to lead to a move that’s similar to the pole in length. Based on this, BTC’s breakout target from the current pattern could lie near $69,000. “Bitcoin $BTC must hold above $87,200 to avoid a drop toward $69,230,” explained the analyst. Bitcoin is currently also trading near an important on-chain level: the Active Realized Price. This indicator keeps track of the average cost basis of the active network participants. According to data from on-chain analytics firm Glassnode, the Active Realized Price is located at $87,700 right now, meaning that the active investors are in a slight amount of net profit. Related Reading: CryptoQuant CEO Expects Boring Bitcoin Action, Not Major Crash BTC Price At the time of writing, Bitcoin is trading around $90,400, up more than 1% over the last week. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin Bear Pennant|bitcoin support|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57020052,
    "published": 1767987425000,
    "title": "Trading bots gain traction as crypto markets move sideways: HTX 2025 recap",
    "body": "The cryptocurrency exchange reported sharp growth in automated trading as volatility narrowed across major crypto assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57019863,
    "published": 1767987171000,
    "title": "World's largest custodial bank BNY to offer tokenized deposits for institutional investors",
    "body": "The initiative mirrors deposit balances on a private blockchain to speed up settlement and unlock liquidity.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|BNY Mellon|Tokenization|Real World Assets|TradFi|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 57020393,
    "published": 1767988531000,
    "title": "US lawmaker's bill would ban politically related prediction bets after Maduro wager",
    "body": "The bill came after a Polymarket user netted more than $400,000 on a contract related to the removal of then-Venezuelan President Nicolás Maduro, fueling concerns about insider trading.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 57020578,
    "published": 1767989319000,
    "title": "Crucial Role Of The CLARITY Act In Avoiding A New October 10 Crypto Crash, Expert Explains",
    "body": "The notorious crypto crash on October 10 of last year sent shockwaves through the market, resulting in the largest liquidation event in history with nearly $20 billion in losses. This catastrophic event ignited significant criticisms and fears among investors regarding the stability of the cryptocurrency market. However, the upcoming crypto market structure bill, known as the CLARITY Act, is being touted as a potential safeguard against future crashes. Market Manipulation In Crypto Could Plummet Market expert Crypto Rover recently took to social media to express optimism about the CLARITY Act as the Senate prepares for a markup on January 15. According to Rover, this crypto bill could reduce market manipulation in the crypto space by an impressive 70% to 80%. Related Reading: 3 Vital Factors Needed For A Lasting 2026 Crypto Surge, Bitwise CIO Unveils He noted the devastating effects of the October 10 event, describing it as a “massacre” for crypto holders, many of whom lost their life savings without clear answers about who was ultimately responsible for the chaos. Rover is confident that with the implementation of the CLARITY Act, the cryptocurrency market could begin operating more like traditional financial markets (TradFi). Institutional Investment Set To Surge Once the CLARITY Act passes in the Senate, Rover asserts that it will move to the floor for a full vote before returning to the House for final approval and eventually reaching President Trump’s desk. He further suggested that this entire process could take one to two months, potentially allowing the CLARITY Act to be signed into law by March 2026. Related Reading: VanEck Predicts Bitcoin Could Reach $2.9 Million In New Long-Term Capital Report Should this come to fruition, it is expected to open the floodgates for institutional investment in the crypto market, fundamentally changing the alleged “daily market manipulation” witnessed in the sector. At the time of writing, Bitcoin is trading at $90,357, having erased some of the gains seen at the beginning of the week when the market’s leading crypto surged towards a two-month high of $94,800. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|bitcoin|Bitcoin news|bitcoin price|BTC news|BTCUSDT|CLARITY Act|crypto|crypto market|Crypto Market Structure Bill|crypto news|cryptocurrency",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57020743,
    "published": 1767989031000,
    "title": "Walmart-Backed ‘Super App’ OnePay Hits $4 Billion Valuation",
    "body": "OnePay, the Walmart Inc.-backed fintech firm behind the “super app” that the world’s largest retailer is incorporating for customers, recently bought back shares from employees at a price that values the closely-held company at more than $4 billion, according to a person with knowledge of the matter.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "NMS:WMT",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 57021024,
    "published": 1767990645000,
    "title": "Shiba Inu Sell-Offs Incoming: 82 Trillion Deposits Threaten To Crash SHIB Price",
    "body": "On-chain data show a significant amount of Shiba Inu still held on exchanges, putting the SHIB price at risk of a decline due to sell-offs. This comes amid a positive increase in net flows, indicating that more coins are flowing into exchanges, likely to offload them. SHIB Price At Risk With 82 Trillion Shiba Inu On Exchanges CryptoQuant data shows that the Shiba Inu exchange reserve is at 82 trillion coins. This indicates higher selling pressure, especially as the value has risen from around 81 trillion at the start of the year. Amid this development, the SHIB price has trimmed some of its year-to-date gains, with the meme coin dropping from a high above $0.000009 just as the exchange reserve rose. Related Reading: Here’s Why The Shiba Inu Price Jumped Over 13% Another bearish indicator for Shiba Inu at the moment is the exchange netflow. Further data from CryptoQuant show that the exchange netflow has turned positive, indicating that more coins are being deposited into exchanges than removed. As such, the meme coin is likely currently facing more selling pressure than buying pressure, putting the SHIB price at risk of a decline. Notably, the Shiba Inu exchange netflow turned positive just as the SHIB price reached its yearly high above $$0.000009. The recent bearish sentiment in the broader crypto market has likely contributed to these sell-offs for SHIB, with the Bitcoin price dropping back to $90,000 after rising above $94,000 at the start of the year. Activity in the Shiba Inu derivatives market also paints a bearish picture for the SHIB price. CoinGlass data shows that trading volume has dropped by just over 5%, to $203 million. SHIB’s open interest is also down over 7%, dropping to $108 million. However, a positive is that most traders are still bullish on the meme coin, with the long/short ratio above 1. An Increase In SHIB Whale Transactions A positive for the SHIB price is that whales still appear to be bullish on the meme coin. On-chain analytics platform Santiment recently pointed out a 111% spike in Shiba Inu’s whale transactions. Thanks to this development, SHIB ranks among the tokens with a market cap of at least $500 that have seen an increase in whale transactions above $100,000. Related Reading: Shiba Inu End Of Year Predictions Remain Bearish, High Volatility Expected Meanwhile, CryptoQuant data show that the number of daily Shiba Inu active addresses has climbed since the start of the year and has remained above the 3,000 threshold. This is a positive as it indicates that attention is now returning to the SHIB ecosystem, which could positively impact the SHIB price once the crypto market rebounds again. At the time of writing, the Shiba Inu price is trading at around $0.000008752, down in the last 24 hours, according to data from CoinMarketCap. Featured image from Sketchfab, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Shiba Inu|Coinglass|CoinMarketCap|cryptoquant|Santiment|SHIB|SHIB news|SHIB price|Shiba Inu Ecosystem|Shiba Inu news|Shiba Inu Price|Shiba Inu Whale|SHIBUSD|SHIBUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 44,
        "NAME": "SHIB",
        "CATEGORY": "SHIB"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57020941,
    "published": 1767990213000,
    "title": "CLARITY Act hinges on bipartisan support, and here are the numbers: Analyst",
    "body": "The crypto market structure bill is unlikely to come up for a second vote in 2026 if it fails to pass in a vote next week, analyst Alex Thorn said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]