[
  {
    "id": 54455270,
    "published": 1763247646000,
    "title": "Bitcoin Price In Trouble As Sell-Side Momentum Spikes — $92,000 Next?",
    "body": "The Bitcoin price has ostensibly continued down in its bearish direction, which started in the second week of October. After slipping beneath the psychological $100,000 support, worries have surfaced among Bitcoin market participants regarding the broader market structure. Interestingly, the latest on-chain evaluation justifies this worry, as the downside bias for the Bitcoin price seems to be on the rise. Binance Taker Imbalance Falls Into Negative Territory In a Quicktake post on the CryptoQuant platform, on-chain research firm Arab Chain revealed an increase in sell-side momentum for Bitcoin on Binance, the world’s largest exchange by trading volume. This revelation revolves around the BTC Taker Imbalance % metric, which tracks whether the market is dominated by aggressive buyers or sellers. Narrowing it down, this metric offers insights into taker activity on Binance. Related Reading: Bitcoin Moves Beyond Retail — Institutional Ownership Now Defines The Market Because the metric works by revealing the percentage difference between taker buy volume and taker sell volume, readings with positive values suggest the dominance of buyers in the market. On the contrary, negative readings reveal a seller-dominated market. As Arab Chain reported, there has been an evident spike in the amount of selling pressure in recent hours. A Taker Imbalance % reading of -0.17%, which typically reflects continued bearish action, supports this observation. Moreover, the research firm pointed out that there has been an evident difference between the selling and buying volumes recently. The Quicktake post revealed a record of $1.517 billion in selling volume against $1.058 billion dedicated to buying power, making it clear what party is currently winning this Bitcoin price tussle. Is $92,000 The Next Bitcoin Price Target? What’s interesting is, the current seller-dominated market has caused the BTC price to continuously hover around the key $94,000 level. Arab Chain noted that each attempt by the Bitcoin price to rise has faced an even greater amount of sell resistance, dousing any serious bullish momentum. The grey bars in the above chart suggest that this increasing bearish pressure might not just be a market correction; instead, it reflects a recurrent injection of sell-pressure, one which Arab Chain implied would eventually defeat the weaker buy-side liquidity at the current support. In the likely scenario where more bearish momentum is injected to push the market to the downside, the next level, which could act as a cushion for price, lies around $92,000. If a significant amount of liquidity is not introduced to neutralize the dominance of Bitcoin’s sellers, the Bitcoin price could see an even deeper bearish correction. At press time, Bitcoin is valued at $96,241, reflecting a nearly 2% loss in the past day. Related Reading: Bitcoin Crashes To $98,000 As HODLer Selling Accelerates Featured image from iStock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|Bitcoin Taker Imbalance %|btc|BTC news|btc price|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54460857,
    "published": 1763257529000,
    "title": "Crypto index ETFs will be the next wave of adoption — WisdomTree exec",
    "body": "WisdomTree’s Will Peck said that crypto index ETFs will solve the need for those who don’t want to take on “idiosyncratic risk.”",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54472227,
    "published": 1763278694000,
    "title": "XRP Falls 4.3% Even After XRPC ETF Launch on Bitcoin Weakness, Finds Buyers Near $2.22",
    "body": "The market remains bearish with XRP struggling to break above the $2.23–$2.24 resistance zone.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|XRP News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54476977,
    "published": 1763269239000,
    "title": "Kiyosaki Stands His Ground—No Selling, More Bitcoin Buys Ahead",
    "body": "Robert Kiyosaki is once again urging calm, saying he has no plans to sell his Bitcoin even as the market took a hard hit this week. Related Reading: XRP Earns Academic Praise: University Study Calls It ‘Gold In Your Hands’ According to his public comments, the finance author believes the recent downturn has more to do with people needing quick cash than any real shift in Bitcoin’s long-term value. He said he’s waiting things out and will only act once the market settles. Why Kiyosaki Feels No Rush To Sell Kiyosaki says he can remain patient because he does not rely on selling assets to meet daily needs. His income from real estate and private investments keeps money flowing, which reduces the temptation to sell during stressful moments. “Bitcoin crashing? Am I selling? No, I am waiting!” he said on X. Lessons From Earlier Mistakes He has spoken openly about past blunders during downturns, saying he often panicked at the wrong time. Those errors, according to him, taught lessons that schools rarely teach, especially about dealing with financial fear and failure. He believes people learn better from their own mistakes than from classroom lectures. BITCOiN CRASHING: The everything bubbles are bursting…. Q: Am I selling? A: NO: I am waiting. Q: Why aren’t you selling? A: The cause of all markets crashing is the world is in need of cash. A: I do not need cash. A: The real reason I am not selling is because the… — Robert Kiyosaki (@theRealKiyosaki) November 15, 2025 Market Pressure After Tech Weakness Bitcoin’s price slipped to the $95,000 region, a level not seen in six months. Reports have disclosed that the coin fell 10% over the week after a steep slump in AI-related and tech stocks pushed many investors away from riskier trades. The sudden pullback hit crypto quickly, raising questions about whether this was a short-term shock or something deeper. Liquidations Under 2% Of Open Interest Nearly $900 million in Bitcoin long positions were closed out during the fall. Even so, analysts say the liquidations made up less than 2% of total open interest, which helped prevent the kind of heavy spillover that marked the October 10 sell-off. This time, the pressure was strong but didn’t spiral into a wider breakdown. According to Coinglass, in the past 24 hours , 92,658 traders have liquidated their positions, which total around $149.65 million. Buying More Once The Market Settles Kiyosaki plans to add more Bitcoin when conditions improve. He keeps pointing to the fixed 21 million supply as one of the reasons he expects long-term strength. He also encourages people who own his Cashflow board game to form small learning groups, saying these groups help people stay confident when markets shake. Related Reading: Forget The Obituaries—Cardano Is Alive, Says Bitcoin Analyst Cooling Market, Not A Full Breakdown Based on reports, the broader market is calming after the past week’s losses. Traders say the selling appears tied to people needing liquidity rather than a loss of belief in crypto. Liquidity stresses can make prices drop quickly, but they can also reverse once buyers step back in. For now, the numbers — an 10% weekly slide and about $900 million in liquidations — show pressure, but not widespread panic. Featured image from Pexels, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|robert kiyosaki",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54477266,
    "published": 1763276454000,
    "title": "Analyst Backs Bitcoin Rally To $174,000 If This Support Remains Intact – Details",
    "body": "The Bitcoin market has recorded high levels of volatility in previous weeks, resulting in significant corrections and a fragile bullish sentiment. Amid this delicate market, a market analyst with X username PlanD is projecting an incoming parabolic rally that hinges on the strength of a crucial support level. Related Reading: Bitcoin Price In Trouble As Sell-Side Momentum Spikes — $92,000 Next? Here’s Why Bitcoin Bulls Must Preserve $94,500 Price Point – Analyst In a recent post on November 15, PlanD drew market attention to a potentially bullish situation on the BTCUSDT chart. Notably, the market expert states that Bitcoin’s price movement over the last four months has created a symmetrical expanding triangle. Following the price losses seen in the past week, Bitcoin presently trades near the lower boundary of this formation at $94,500, creating a high-stakes situation. According to PlanD, if market bulls lose this support zone, it could result in an extended market correction to around $72,000 – $73,000, suggesting a potential 24% devaluation from current market prices. On the other hand, if the price holds above $94,500, the analyst expects a price rebound to around $131,000, which corresponds to the upper resistance zone of the broadening symmetrical triangle. However, a potential volume-driven breakout from this formation amid high bullish pressure could push Bitcoin’s price to around $174,000, representing an 83% gain on present market prices. Related Reading: Ethereum Whale Expands Position By 36,437 ETH – Bringing Total To $1.34B The Bullish Catalysts While staying above $94,500 is crucial to preserving Bitcoin’s bullish structure, PlanD has also listed the market factors that are important to stimulating a rally. One of these factors is expectations of a continuous reduction in interest rates by the US Federal Reserve. Following recent data that shows a weakening job market, several analysts are backing the Fed to implement another rate cut in December despite an initially hawkish tone in October. This fall in interest rate is expected to increase investor access to capital and drive up interest in risky investments, e.g, cryptocurrencies like Bitcoin. Another catalyst mentioned by PlanD is the Bitcoin Spot ETF inflows. Notably, these products have also experienced a turbulent moment amid Bitcoin’s price troubles, with a monthly net outflow of $2.33 billion in November alone. The analyst’s theory for a bullish rebound indicates the need for an immediate reversal in these fortunes. Finally, PlanD references the ongoing progress in US regulatory clarity on digital assets as another bullish catalyst to sponsor demand and drive market price upward in the coming weeks. At press time, Bitcoin continues to trade at $95,874, reflecting a 0.46% loss in the last day. Featured image from Pexels, chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|bitcoin resistance|bitcoin support|btcusd|BTCUSDT|Cryptododo7|PlanD|symmetrical triangle",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54479249,
    "published": 1763290837000,
    "title": "US Bitcoin ETFs Post $1.1B Outflows As BTC Price Struggles Below $100K",
    "body": "Over the last two years, the performance of the US-based Bitcoin ETFs (exchange-traded funds) has been a fair reflection of the current market sentiment. With consecutive weeks of capital outflows, there is no doubt about the predominantly bearish climate of the market. This worsening sentiment can be seen in BTC’s dip below the psychological $100,000 price level. While selling pressure from various investor classes has been identified as one of the major factors behind BTC’s price decline, it is difficult to overlook the concurrent woeful performance of the Bitcoin ETFs. Bitcoin ETFs Record $492 Million Outflow To Close Week According to the latest market data, the US Bitcoin ETF market registered a daily total net outflow of over $492.1 million on Friday, November 14. This latest round of withdrawals marked the third-straight day of negative outflows for crypto-linked investment products. Related Reading: Is Bitcoin Falling Because Of Strategy Sell-Offs? On-Chain Data Fuels Debate Leading this massive capital outflow is the largest BTC exchange-traded fund by net assets, BlackRock’s iShares Bitcoin Trust (with the ticker IBIT). Data from SoSoValue shows that over $463.1 million was withdrawn from the spot BTC ETF on Friday. Grayscale Bitcoin Trust (GBTC) recorded the second-highest net outflow of $25.09 million on the day. Fidelity Wise Origin Bitcoin Fund (FBTC) and WisdomTree Bitcoin Trust (BTCW) were the only other Bitcoin ETFs that recorded negative outflows to close the week, with $2.06 million and $6.03 million, respectively. Grayscale’s Bitcoin Mini Trust (BTC) was the only spot Bitcoin exchange-traded fund that posted a capital influx on Friday, adding $4.17 million to its assets. On Thursday, September 13, the Bitcoin exchange-traded products registered their second-worst daily performance, with a total net withdrawal of $869.86 million. Meanwhile, Friday’s $492 million outflow worsened the US-based Bitcoin ETFs’ weekly record, bringing it to a total net outflow of over $1.11 billion. Bitcoin Lags Under $100,000: Price Overview Unsurprisingly, these Bitcoin ETFs’ woeful performances have coincided with the recent price decline below the crucial $100,000 level. As seen since launch in 2024, the price of BTC tends to move in tandem with the Bitcoin exchange-traded funds. As of this writing, the premier cryptocurrency is hovering around the $95,500 mark, showing some tame bullish action in the past 24 hours. According to data from CoinGecko, the price of BTC is down by nearly 7% in the past seven days. While selling pressure from spot investors continues to affect the market leader, an uptick in Bitcoin ETF demand could help kickstart a turnaround for the cryptocurrency. Related Reading: Bitcoin Market Top May Be In As Analyst Shares 1,064-Day Bull Cycle Pattern – Details Featured image from iStock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin ETFs|bitcoin price|btc|btc price|BTCUSDT|Spot Bitcoin ETF",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54481043,
    "published": 1763283652000,
    "title": "Trump’s Bitcoin Mining Firm Gets $100M+ Boost From Scaramucci Family: Report",
    "body": "AJ Scaramucci’s family has put more than $100 million into a Bitcoin mining company backed by US President Donald Trump’s sons, according to reporting on the deal. The cash came through Solari Capital, the firm led by AJ Scaramucci, and was part of a larger $220 million pre-IPO financing in July. Related Reading: Forget The Obituaries—Cardano Is Alive, Says Bitcoin Analyst Funding Round And Backers A report by Fortune has disclosed that the July financing was led by Solari Capital and raised $220 million in total. Solari’s investment is said to exceed $100 million, while Anthony Scaramucci also made a smaller personal contribution. Other investors named in coverage include the founder of Cardano, some real-estate figures, and a handful of entrepreneurs and public personalities. The move was framed by investors as a big bet on Bitcoin infrastructure rather than a simple token play. The Company’s Scale And Holdings According to filings, the company owned more than 60,000 Bitcoin miners as of May 31, 2025, with a reported fleet hashrate of about 10.17 EH/s. The same filings show the business has been building a strategic Bitcoin reserve: recent regulatory disclosures list thousands of coins held on the balance sheet. Those figures reflect both mined coins and market purchases used to grow the company’s stash. Partnerships And Ownership Structure American Bitcoin was formed in close partnership with a large mining operator that contributed infrastructure and much of the initial equipment. That partner holds the bulk of the new company’s economic interest, leaving the Trump brothers and a limited group of others with the remaining stake. The arrangement allowed American Bitcoin to scale quickly and move toward public trading through a merger agreement announced this year. National Security And Hardware Deals Coverage has raised concerns about a deal that gives the firm unusual access to equipment from a big Chinese miner. That arrangement reportedly includes the purchase of thousands of machines under extended payment terms — in some cases up to 24 months — with payments secured by pledged Bitcoin. Critics say such terms and hardware dependence could create political and security questions, especially given the firm’s high profile and links to US political leaders. Related Reading: XRP Earns Academic Praise: University Study Calls It ‘Gold In Your Hands’ Operational Performance And Recent Results Regulatory filings and quarterly releases show the business is producing Bitcoin from mining and is also buying coins on the open market to grow holdings. In the third quarter it mined several hundred BTC, a pace that helped lift revenue and margins in recent results. Backers say the model mixes production with accumulation to capture upside if prices rise. Some analysts warn the approach concentrates crypto price risk alongside the normal operational risks of running large data centers. Featured image from Pexels, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|AJ Scaramucci|American Bitcoin|Anthony Scaramucci|Bitmain|btc|btcusd|crypto|Trump",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54481906,
    "published": 1763296379000,
    "title": "Japan’s FSA plans to classify crypto as financial products, eyes 20% tax rate: Report",
    "body": "Japan’s FSA plans to reclassify crypto as financial products, enforce new disclosure and insider trading rules, and cut the crypto tax rate from 55% to a flat 20%.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54482756,
    "published": 1763298058000,
    "title": "Bitcoin To Eclipse Gold, Eric Trump Says—Calling BTC The ‘Greatest Asset’ Ever",
    "body": "According to remarks made at Yahoo Finance’s Invest event, Eric Trump told attendees he expects a major shift in how money flows between traditional stores of value and newer digital assets. Related Reading: Kiyosaki Stands His Ground—No Selling, More Bitcoin Buys Ahead He said Bitcoin’s fixed supply of 21 million coins and growing institutional buying are key drivers. In a separate interview with Fox Business in late September, he forecasted a long-term price target of $1 million per Bitcoin, a prediction that underscores how bullish his view is. Bitcoin Seen As A Faster Mover Of Value Eric argued that Bitcoin – which he called the “greatest asset” ever – moves value faster and cheaper across borders than metal that must be hauled and locked away. He called Bitcoin “digital gold,” and pushed the idea that its code-based supply gives it an advantage over physical bullion. Based on reports, he also framed crypto as a hedge against inflation, corruption, and weak monetary policy — reasons he said explain rising adoption around the globe. JUST IN: 🇺🇸 Eric Trump says a gold-to-Bitcoin rotation is imminent “The ratio will disproportionately shift to Bitcoin.” “It’s been the single greatest asset we’ve ever seen.” pic.twitter.com/4TYY1qALlm — Bitcoin Archive (@BitcoinArchive) November 14, 2025 American Bitcoin’s Rapid Rise Eric and his brother Donald Trump Jr. co-founded American Bitcoin (ABTC), which went public in September and now carries a market valuation approaching $4 billion. The firm has expanded quickly after merging with Gryphon Digital Mining. According to Bitcoin Treasuries, ABTC is the 25th-largest public company holder of Bitcoin in the US. Company officials say their West Texas mines benefit from low energy costs, allowing them to produce Bitcoin at roughly half of the current spot price. Source: Bitcoin Treasuries Company Growth And Risks Growth has been fast, but analysts and critics warn of clear risks. Mining firms gain when prices rise, and they can suffer when prices fall. Some worry that a combined ABTC-Gryphon business faces larger swings in earnings and asset values because crypto markets remain volatile. There are also concerns about mixing political ties with finance; World Liberty Financial, a Trump family-affiliated project, manages a WLFI governance token and a USD1 stablecoin, and some observers have flagged transparency questions. A Long Record Versus A Young Network Gold has centuries of use as a store of value and broad global acceptance. Bitcoin has existed since 2009 and shows rapid price moves that can create big winners and big losers. Historical data points to sharp shifts: during the 2017 rally, the Bitcoin-to-gold ratio hit record highs before it fell back when prices corrected. That history is often used to remind investors that gains can be followed by steep pullbacks. The correlation between the two has shifted over time, with each asset responding to different market pressures. Bitcoin and gold correlation. Source: Newhedge. What Analysts And Critics Warn Conflict of interest is one common critique: executives who publicly praise Bitcoin can also benefit directly when their companies hold or mine more coins. Forecasts that put a single Bitcoin at $1 million are seen by many as speculative rather than certain. Regulatory changes, tax rules, and policy moves in the US or abroad could change market conditions quickly, and those possibilities are stressed by cautious commentators. Related Reading: Forget The Obituaries—Cardano Is Alive, Says Bitcoin Analyst Eric Trump’s stance is clear: he believes capital will shift from gold to Bitcoin over time. Markets will decide if that prediction proves true. For now, both assets remain part of the conversation, each with different risks, costs, and histories that investors must weigh. Featured image from Alamy, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|American Bitcoin|bitcoin|btc|btcusd|crypto|Eric trump|gold|World Liberty Financial",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54482908,
    "published": 1763298267000,
    "title": "‘Flood Gates Are Now Being Opened’—Bitcoin Braced For Trump ‘Tsunami’ As He Promises 2026 Price Game-Changer",
    "body": "Bitcoin and crypto traders are betting on the Trump administration unleashing “a tsunami” of spending in 2026...",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54484792,
    "published": 1763302085000,
    "title": "What Is Q-Day? The Quantum Threat to Bitcoin Explained",
    "body": "Experts warn quantum computers could someday forge Bitcoin’s digital signatures, allowing unauthorized transactions.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Technology Guides",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54486816,
    "published": 1763305200000,
    "title": "Desperate Canadian Youth a Growing Target For Investment Scams",
    "body": "Strapped for cash and facing one of the bleakest job markets in decades, Canada’s young people are increasingly falling victim to financial fraudsters.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54488802,
    "published": 1763305231000,
    "title": "Bitcoin Indicator Sounds Buy Alarm For The First Time Since March — Return To $110K Soon?",
    "body": "The price of Bitcoin has struggled around the $95,000 mark after showing some early-weekend strength on Saturday, November 15. According to a prominent analyst on the social media platform X, the premier cryptocurrency seems to be showing signs of a potential rebound in the coming days. BTC Price To Return To $110,000? In a November 15 post on X, market analyst Burak Kesmeci shared that the price of Bitcoin is showing signs of recovery based on different technical indicators. In his analysis, Kesmeci fiddled with the possibility of BTC rising to $110,000 and the risk of falling to $85,000. Firstly, Kesmeci analyzed the Bitcoin fear (VIX) score, a technical indicator that evaluates volatility and fear in the market. According to data provided by the analyst, this indicator has been above the crucial 16.50 level for two consecutive days for the first time in 250 days, suggesting the presence of a buy opportunity. Related Reading: Massive Bitcoin Bid Walls Spotted On Binance: Bulls Step In With 2,800 BTC Cluster However, Kesmeci also highlighted that this signal does not automatically confirm a price rebound for the premier cryptocurrency from the current point. This buy signal might even persist and intensify if the VIX indicator continues to decline in the oversold zone. The crypto analyst noted that the Bitcoin price reacted a little to the daily Relative Strength Index (RSI) falling to 30, which marks the oversold territory. But Kesmeci mentioned that this RSI movement should offer little excitement, except if there is a positive divergence where RSI makes higher lows while price makes lower lows. Furthermore, Kesmeci examined the Fixed Range Volume Profile (FRVP), stating that there is a small gap with no volume between $95,000 and $85,000. According to the crypto analyst, a close below $95,000 could see the Bitcoin price fall—in a single candle—to as low as $85,000 in a bid to fill the FRVP gap. Kesmeci then hypothesized that holding above $95,000 could mean that Bitcoin is resting and building volume. With the current data suggesting that market makers are choosing to defend the $95,000, the crypto pundit believes that BTC could enjoy a reaction rally up toward $110,000, which is the real decision zone. Bitcoin Price At A Glance As of this writing, the price of BTC stands around $95,076, reflecting no significant movement in the past 24 hours. Related Reading: With Bitcoin At $94,000, Bitwise CEO Claims Crypto Has Endured A 6-Month Bear Market Featured image from iStock, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|bitcoin price|btc|btc price|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54490441,
    "published": 1763313476000,
    "title": "Tom Lee Says Ether Is Entering a Bitcoin-Like 'Supercycle'; Critics Push Back",
    "body": "BitMine Immersion Technologies’ executive chairman says ETH is beginning a bitcoin-style run as he highlights past drawdowns and patience.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Ether|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54493504,
    "published": 1763319600000,
    "title": "Judge Should Not Acquit Tornado Cash Dev Roman Storm, Prosecutors Argue",
    "body": "The DOJ filed its own post-trial motion last week, pushing back against Storm's motion for acquittal.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Roman storm|Tornado Cash|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54493179,
    "published": 1763318974000,
    "title": "Bitcoin Falls Below $94,000 for First Time Since May Amid 'Extreme Fear' Sentiment",
    "body": "Analysts highlighted retail distress, rare social-dominance surges and warnings of a possible deeper pullback as several major tokens remained under pressure.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Markets|Bitcoin News|btc|ETH|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54496761,
    "published": 1763326153000,
    "title": "SoFi Is Only The Beginning Of Bank-Based Crypto Products",
    "body": "As crypto adoption continues to accelerate, SoFi is staking out a retail-first position",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54497599,
    "published": 1763327554000,
    "title": "Bitcoin Erases Year’s Gain as Crypto Bear Market Deepens",
    "body": "Just a little more than a month after reaching an all-time high, Bitcoin has erased the more than 30% gain registered since the start of the year as the exuberance over the pro-crypto stance of the Trump administration fades and the recent cooling of high-flying technology stocks leads to a drop in overall risk appetite.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54497435,
    "published": 1763327327000,
    "title": "Peter Schiff calls Strategy's model 'fraud,' challenges Saylor to debate",
    "body": "Schiff also challenged Binance co-founder Changpeng Zhao (CZ) to a debate, slated to take place in December in the United Arab Emirates.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54499154,
    "published": 1763330953000,
    "title": "Ether Dips Below $3,100; Investment Manager Says Market Views ETH as 'More Risky' Than BTC",
    "body": "Timothy Peterson says ether ETFs have lost about 7% of cost-basis capital over five weeks, versus 4% for bitcoin ETFs.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Ether|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]