[
  {
    "id": 57554317,
    "published": 1769660332000,
    "title": "XRP Price Signals Vulnerability With Another Drop On The Table",
    "body": "XRP price failed to surpass $1.950 and started another decline. The price is now correcting gains and might struggle to stay above $1.860. XRP price started a downside correction and declined below $1.90. The price is now trading below $1.890 and the 100-hourly Simple Moving Average. There was a break below a key bullish trend line with support at $1.910 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could start another increase if it stays above $1.860. XRP Price Dips Further XRP price failed to clear $1.950 and started a downside correction, like Bitcoin and Ethereum . The price dipped below the $1.90 and $1.880 levels to enter a negative zone. The price even dipped below the 50% Fib retracement level of the upward move from the $1.810 swing low to the $1.945 high. Besides, there was a break below a key bullish trend line with support at $1.910 on the hourly chart of the XRP/USD pair. The price is now trading below $1.880 and the 100-hourly Simple Moving Average. If there is a fresh upward move, the price might face resistance near the $1.90 level. The first major resistance is near the $1.9250 level, above which the price could rise and test $1.950. A clear move above the $1.950 resistance might send the price toward the $2.00 resistance. Any more gains might send the price toward the $2.00 resistance. The next major hurdle for the bulls might be near $2.050. More Losses? If XRP fails to clear the $1.9250 resistance zone, it could start a fresh decline. Initial support on the downside is near the $1.860 level and the 61.8% Fib retracement level of the upward move from the $1.810 swing low to the $1.945 high. The next major support is near the $1.8420 level. If there is a downside break and a close below the $1.8420 level, the price might continue to decline toward $1.820. The next major support sits near the $1.80 zone, below which the price could continue lower toward $1.7650. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $1.860 and $1.8420. Major Resistance Levels – $1.9250 and $1.950.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 57554752,
    "published": 1769661522000,
    "title": "SEC clarifies rules for tokenized stocks, tightening scrutiny on synthetic equity",
    "body": "The agency says issuer approval is required for true tokenized ownership, warning that many stock tokens sold to retail investors provide only indirect or synthetic exposure.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Securities and Exchange Commission|Tokenized Securities|Robinhood|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 57555179,
    "published": 1769662806000,
    "title": "Bitcoin Supply In Loss Begins To Rise, Raising Early Bear Market Concerns",
    "body": "Crypto research firm CryptoQuant has flagged a potentially troubling development for Bitcoin (BTC) and the wider digital asset market, pointing to an early warning signal that has historically appeared ahead of prolonged downturns. In a report released Wednesday, the firm noted that Bitcoin’s supply in loss metric has begun to rise again, a shift that has often marked the early stages of past bear markets. Possible Shift Toward Bear Market Structure According to analysis by CryptoQuant contributor Woominkyu, increases in supply held at a loss tend to signal that market weakness is spreading beyond short‑term traders and gradually affecting longer‑term holders. In previous market cycles, including 2014, 2018, and 2022, this indicator started trending upward well before prices reached their eventual lows. Related Reading: Bitcoin Price Braces For FOMC Volatility As History Shows Major Post‑Fed Sell‑Offs During those periods, Bitcoin prices continued to decline even after the metric turned higher, with true market bottoms forming only once supply in loss expanded much further and broader capitulation set in. At present, CryptoQuant notes that Bitcoin’s supply in loss remains well below levels typically associated with full market capitulation. However, the change in direction itself is significant. The analysts say it suggests the market may be shifting into a bearish structural phase, rather than experiencing a brief correction within an ongoing bull market. Bitcoin’s recent price action appears to reflect that uncertainty. The asset is currently trading around $89,700 and has struggled to reclaim the key $90,000 level as support. This follows a steady decline from earlier yearly-highs near $98,000, where upward momentum faded as buying pressure weakened and gains recorded at the start of the year were fully erased. US Dollar Tests Historic Zone For Bitcoin Rallies Despite these cautionary signals, not all analysts believe the outlook is entirely negative. Analysts at Bull Theory have highlighted a potentially bullish catalyst that could emerge in the months ahead, centered on movements in the US dollar. In a recent post on social media platform X (previously Twitter) the firm pointed out that the US Dollar Index is testing the same zone that preceded major Bitcoin bull runs in both 2017 and 2021. According to their analysis, the Dollar Index has broken below a long‑term trendline that has held for roughly 16 years and is now hovering around the critical level of 96. Historically, periods when the DXY fell below 96 and remained there coincided with strong Bitcoin rallies. Related Reading: Crypto Funds Funneled To Money Launderers Hit $82 Billion, According To Chainalysis As seen in the chart below, in mid‑2017, the index dropped under that level, after which Bitcoin surged nearly eightfold over the following five to six months. A similar pattern played out during the 2020 pandemic era. When a wave of liquidity entered financial markets at the time, the DXY again slipped below 96, and Bitcoin went on to rise roughly seven times over the next seven to eight months. During that same period, Ethereum (ETH) and many altcoins posted gains of tenfold or more. For now, the market sits at a crossroads. On‑chain data points to early bear‑market dynamics, while macro signals linked to the US dollar offer a counter‑narrative that could favor renewed strength. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin chart|Bitcoin news|bitcoin price|bitcoin technical analysis|btc|BTC news|btc price|BTCUSDT|crypto|crypto market|crypto news|cryptocurrency",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57555354,
    "published": 1769663292000,
    "title": "Dogecoin (DOGE) Slips Back As Bears Regain The Upper Hand",
    "body": "Dogecoin corrected some gains and traded below $0.1220 against the US Dollar. DOGE is now holding the $0.120 support but might decline further. DOGE price started a fresh downside correction from $0.1275. The price is trading below the $0.1225 level and the 100-hourly simple moving average. There was a break below a bullish trend line with support at $0.1245 on the hourly chart of the DOGE/USD pair (data source from Kraken). The price could aim for a fresh increase if it remains stable above $0.1200. Dogecoin Price Trims Gains Dogecoin price started a downside correction after it failed to clear $0.1275, like Bitcoin and Ethereum . DOGE declined below the $0.1250 and $0.1245 levels. There was a move below the 50% Fib retracement level of the upward move from the $0.1175 swing low to the $0.1275 high. Besides, there was a break below a bullish trend line with support at $0.1245 on the hourly chart of the DOGE/USD pair. Dogecoin price is now trading below the $0.1225 level and the 100-hourly simple moving average. Immediate resistance on the upside is near the $0.1235 level. The first major resistance for the bulls could be near the $0.1250 level. The next major resistance is near the $0.1275 level. A close above the $0.1275 resistance might send the price toward $0.1350. Any more gains might send the price toward $0.1380. The next major stop for the bulls might be $0.1420. More Losses In DOGE? If DOGE’s price fails to climb above the $0.1250 level, it could continue to move down. Initial support on the downside is near the $0.120 level and the 76.4% Fib retracement level of the upward move from the $0.1175 swing low to the $0.1275 high. The next major support is near the $0.1192 level. The main support sits at $0.1150. If there is a downside break below the $0.1150 support, the price could decline further. In the stated case, the price might slide toward the $0.1080 level or even $0.1050 in the near term. Technical Indicators Hourly MACD – The MACD for DOGE/USD is now gaining momentum in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for DOGE/USD is now below the 50 level. Major Support Levels – $0.1200 and $0.1150. Major Resistance Levels – $0.1250 and $0.1275.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "DOGE|DOGE news|Doge price|DOGE USD|DOGE/BTC|DOGE/USDT|Dogecoin|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57555767,
    "published": 1769664518000,
    "title": "Bitcoin trader warns of downside as gold rally continues to pull focus from BTC",
    "body": "Crypto prices stabilized after an early-week dip, but bitcoin continued to trail gold and silver as macro trades dominated after the Fed’s policy hold.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57555644,
    "published": 1769664134000,
    "title": "First gold and silver, now oil's starting to rally and that's bad news for bitcoin",
    "body": "Higher oil prices could add to inflation, making it harder for the Fed to cut rates rapidly.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Crude Oil|Bitcoin News|crypto markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 16,
        "NAME": "COMMODITY",
        "CATEGORY": "COMMODITY"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57556131,
    "published": 1769665378000,
    "title": "Australia Fines Qoin Wallet Operator $14 Million for Unlicensed Activity",
    "body": "The ruling marks one of the largest court-imposed penalties yet tied to crypto marketing practices in Australia.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57556452,
    "published": 1769666417000,
    "title": "Bitcoin Death Cross That Last Preceded A 66% Drop Is Back",
    "body": "A cryptocurrency analyst has pointed out how Bitcoin has recently formed a technical crossover that preceded bearish shifts in the past. Bitcoin Has Seen A Death Cross Between 21-Day & 50-Day SMAs In a new post on X, analyst Ali Martinez has shared a daily price chart for Bitcoin showcasing a crossover between two simple moving averages (SMAs) that the asset has gone through recently. An SMA is a statistical tool that averages a quantity over a given period of time and that, as its name suggests, updates in time with the quantity. This tool can be useful for studying long-term trends, as it smooths out the graph by eliminating short-term fluctuations. Related Reading: Bitcoin Supply In Loss Turns Upward—Early Bear Market Signal? SMAs can be taken over any window, but in the context of the current topic, two specific periods are of relevance: 21-day and 50-day. Below is the chart posted by Martinez that shows the trend in these SMAs for Bitcoin over the past decade. From the graph, it’s visible that the daily Bitcoin price has seen its 21-day SMA fall below the 50-day one recently. In the past, this crossover has tended to act as a “death cross” for the cryptocurrency, with its price plunging after the signal’s appearance. In the chart, the analyst has highlighted the previous instances of this death cross. It would appear that the asset experienced drawdowns ranging between 54% and 69% following the crossover. The most recent occurrence of the crossover was in 2022, leading into a price decline of almost 66% to the bear market bottom. Given the past pattern, it only remains to be seen whether the 21-day SMA going below the 50-day SMA will prove to be bearish for Bitcoin this time. In the scenario that bearish momentum does follow for the asset, it could be at risk of breaching below an on-chain level known as the Realized Price-to-Liveliness Ratio. This level represents the ratio between two on-chain indicators: the Realized Price and Liveliness. The first of these tracks the cost basis of the average investor or address on the Bitcoin blockchain, while the latter encapsulates the spending/HODLing behavior of long-term investors. As Martinez has highlighted in another X post, Bitcoin has been trading near the Realized Price-to-Liveliness Ratio recently. As displayed in the above graph, the Bitcoin Realized Price-to-Liveliness Ratio is situated around $87,500 right now. BTC briefly fell below this mark during the Sunday dip, but the coin has since recovered back above it. Related Reading: Next Ethereum Move Hinges On This Level, Says Glassnode Analyst “The last time Bitcoin $BTC fell below the Realized Price-to-Liveliness Ratio, it moved toward the Realized Price,” noted the analyst. Currently, the Realized Price is located at $56,000. BTC Price At the time of writing, Bitcoin is floating around $89,500, up 2% in the last seven days. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin Death Cross|bitcoin signal|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57556449,
    "published": 1769666400000,
    "title": "UAE's central bank has approved a USD-backed stablecoin",
    "body": "The USDU stablecoin is issued by Universal Digital, a crypto firm regulated by the Financial Services Regulatory Authority (FSRA) of Abu Dhabi Global Market (ADGM).",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Stablecoin|UAE|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57556355,
    "published": 1769666038000,
    "title": "Cere Network co-founder, board face $100M lawsuit over token sales",
    "body": "Cere Network is facing a second lawsuit this month that accuses its co-founder and board of fraud in relation to a public token launch for the platform in 2021.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 205,
        "NAME": "TOKEN SALE",
        "CATEGORY": "TOKEN SALE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57556256,
    "published": 1769665656000,
    "title": "XRP millionaire wallets are ramping up in 'encouraging sign': Santiment",
    "body": "The rise in XRP wallets holding more than 1 million tokens comes despite a weakening of broader crypto market sentiment, with a popular crypto indicator sitting in “fear” territory.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57557645,
    "published": 1769670020000,
    "title": "Analysts Say Dogecoin Consolidation Is About To End – Parabolic Run Or Crash Ahead?",
    "body": "As the market bounces from the recent lows, Dogecoin (DOGE) is attempting to turn a crucial area back into support. Some analysts have highlighted that the cryptocurrency could be repeating its past performances, which could lead to a massive move in the coming months. Related Reading: Prediction Markets On BNB Chain Explode As Trading Volume Crosses $20B Dogecoin Repeats Its Parabolic Run Pattern Dogecoin, the largest memecoin by market capitalization, has been trading in the $0.119-$0.151 range over the past month, reaching a one-month high of $0.156 during the early January rally. DOGE retested the range lows over the weekend, holding the key $0.119-$0.120 area as support before bouncing 5% toward the current levels. Now, the cryptocurrency is attempting to reclaim the $0.1250 area to continue its recovery rally. Amid this performance, some market observers affirmed that the memecoin could be near the end of a macro consolidation. Analyst Bitcoinsensus noted that Dogecoin has followed a similar pattern to the upside during previous cycles. The chart shows that after retracing from the previous highs, the cryptocurrency has recorded a long consolidation, followed by a “parabolic run to fresh new highs, when market conditions allow it.” As the analysis noted, previous breakouts from DOGE’s long-term accumulation zones have led to 60x and 215x gains, which could signal that a bigger rally could be brewing if history repeats. Similarly, Trader Tardigrade highlighted that Dogecoin’s current performance in the weekly timeframe mirrors its Q4 2024 breakout, which led to its multi-year high of $0.484. “The structure, duration, and magnitude of the current and previous pullbacks are very similar,” he wrote on X, with a nearly 60% decline from its local highs over 19 weeks. Based on this, the analyst suggested that Dogecoin “might have completed its entire pullback and could propel itself to the next high” in the coming weeks. DOGE Price Risks Another 50% Correction Despite the bullish outlooks, market watcher TradingShot affirmed that DOGE is already deep into its new bear cycle and risks another 50%-70% pullback if selling pressure and market volatility continue. Per the post, Dogecoin is currently supported only by the 350-day Moving Average (MA), which has been holding since the October 2025 flash crash. It noted that “the 1W MA350 in particular is of the utmost importance as it held as Support during both previous Bear Cycles.” As the analysis explained, if this level breaks, the memecoin could enter the second phase of the bear cycle, which potentially targets the $0.060-0.035 zone: This either bottoms on the 0.786 Fibonacci retracement level of Doge’s historic Fib Channel Up at around $0.0600 or extends to a full -93.00% decline (as much as the previous two corrected by) around $0.03500. Related Reading: Bitcoin Price At Risk Of 50% Correction As BTC’s 2022 Bearish Playbook Repeats TradingShot also highlighted that DOGE’s bottom could be in by Q4 2026, based on the Sine Waves. “According to this, the next bottom should be around October 2026. So whatever price Doge is trading at around that time, we turn again into long-term buyers,” it concluded. As of this writing, Dogecoin is trading at $0.125, a 1.4% decline on the weekly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto analyst|crypto market correction|Crypto Market Recovery|Crypto trader|doge|DOGE breakout|Dogecoin|Dogecoin analysis|Dogecoin consolidation|dogecoin price|dogeusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57557506,
    "published": 1769669584000,
    "title": "Number of wallets with 1 million XRP is rising again",
    "body": "On-chain data points to underlying demand for XRP as ETFs pull in over $90 million.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|XRP News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57557765,
    "published": 1769670028000,
    "title": "Swiss bank Sygnum raises over 750 BTC for market-neutral fund",
    "body": "Sygnum says its market-neutral BTC Alpha Fund posted 8.9% annualized returns in Q4 and raised more than 750 Bitcoin from professional and institutional investors.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57557940,
    "published": 1769670000000,
    "title": "Crypto Exchange Bybit to Become More Bank-Like With New Accounts",
    "body": "Crypto exchange Bybit plans to start offering banking services with the launch of accounts that will let customers hold balances in US dollars and other fiat currencies.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57558069,
    "published": 1769671109000,
    "title": "Abu Dhabi firm launches first UAE-registered US dollar stablecoin",
    "body": "Abu Dhabi’s Universal Digital has launched USDU, the first US dollar‑backed stablecoin registered by the UAE central bank under its Payment Token Services Regulation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 57559147,
    "published": 1769674502000,
    "title": "Ethereum loses $3K again: How low can ETH price go in February?",
    "body": "ETH price charts confirmed a triangle breakdown, shifting the near-term bias lower and putting $2,250 in focus if sellers stay in control.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57559387,
    "published": 1769675423000,
    "title": "21Shares Drops 3 XRP Price Predictions For 2026: What’s The Upside?",
    "body": "21Shares has outlined a three-scenario price outlook for XRP in 2026, arguing that the token is moving from a litigation-defined trade to one increasingly priced on ETF-driven demand and measurable on-ledger adoption. In a Jan. 23 research note, 21Shares’ Matt Mena frames 2026 as a “defining turning point” in which XRP’s valuation becomes “anchored in institutional fundamentals” after the August 2025 settlement that ended the SEC case overhang. The firm says that resolution removed a structural constraint that had limited XRP’s upside “regardless of underlying utility,” allowing the market to reprice to a new all-time high of $3.66 and then consolidate with the former $2.00 ceiling acting as support. XRP Price Predictions For 2026 21Shares describes the post-settlement regime as a tougher environment for the asset: less narrative optionality, more accountability. With the legal cloud cleared, the note argues XRP “can no longer rely on courtroom hype or regulatory uncertainty to drive its valuation or excuse underperformance,” introducing a “sell the news” risk if usage fails to scale and the market re-rates the asset on realized adoption rather than legal relief. Related Reading: XRP’s ‘Golden Ticket’ Might Not Be What You Think, Expert Says The firm’s view is that clarity expands the addressable buyer base and product surface area in the US “US-based institutions. Regulated funds and ETP issuers. Banks and payment companies.” In 21Shares’ telling, those channels were previously constrained by compliance risk, and their re-entry sets up a new phase of price discovery. The second pillar is flows. 21Shares says US spot XRP ETFs have “fundamentally rewritten” XRP’s demand profile, reaching more than $1.3 billion in assets under management in their first month and logging a 55-day streak of consecutive inflows. The note leans heavily on a supply-demand argument, pairing ETF absorption with what it characterizes as unusually sticky retail positioning. “Exchange reserves are at a seven-year low of 1.7 billion XRP. Institutional ETF demand is colliding with a community that refuses to sell.” That collision, the firm argues, is the “primary engine” for a potentially non-linear repricing, while also warning that reflexivity cuts both ways if inflows slow. To ground the reflexivity case, 21Shares points to the first year of US Bitcoin spot ETFs as a template, citing nearly $38 billion in net inflows and a price move from roughly $40,000 to $100,000 inside 12 months. The distinction, in its view, is liquidity overhead: XRP launched its ETF era at a much smaller market cap than Bitcoin did at its debut, implying a larger marginal impact per dollar of net buying, provided those early capture rates persist through 2026. Related Reading: XRP Could Enter New Growth Phase After Clarity Act Decision — Here’s How The third pillar is utility, with 21Shares positioning XRPL as “financial plumbing” for tokenization and stablecoin settlement. The note highlights RLUSD’s growth to more than 37,000 holders and a market cap increase of over 1,800% from $72 million to $1.38 billion in under a year, alongside XRPL DeFi TVL expanding nearly 100x over two years to above $100 million. It also points to the Multi-Purpose Tokens standard as a mechanism for institutions to issue RWAs with embedded metadata and compliance rules. Still, 21Shares flags execution risk: progress is “evolutionary, not explosive,” and XRPL trails rivals on developer and user engagement, with competition for RWA flows cited from Canton, Solana, and other ecosystems. 21Shares’ modeled peak ranges for 2026 put a base case at $2.45 (50% probability), a bull case at $2.69 (30%), and a bear case at $1.60 (implied -16%), with key swing factors being sustained ETF inflows, meaningful tokenization volumes, and RLUSD maintaining institutional traction. At press time, XRP traded at $1.8792. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|21Shares|xrp|xrp news|XRP Price|XRP Price Prediction|XRP price prediction 2026",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57560555,
    "published": 1769679035000,
    "title": "Worldcoin Jumps Over 30% As OpenAI Plans To Develop A Bot-Free Rival To X",
    "body": "OpenAI’s hint that it may build a social app focused on real humans sent one crypto token climbing fast this week. Traders moved quickly after reports surfaced that the new service would try to block bots by using biometric checks. Prices jumped, chatter rose, and a few questions followed close behind. Related Reading: Something Big Is Brewing In XRP DeFi—And 91 Million Tokens Tell The Story Markets React To Biometric Rumors According to Forbes and several market outlets, OpenAI is quietly exploring a “humans-only” social platform. Reports say the project is still small, run by a roughly 10-person team inside the company. The idea would be to verify real users with biometric tools — either existing phone systems like Face ID or iris scans similar to the ones used by Worldcoin’s Orb. Worldcoin’s token, WLD, surged sharply on the news, hitting gains as high as 33% during the initial trading spike. That move was partly speculative. Prices later pulled back, but trading volume stayed elevated and volatility increased. WLD climbed from $0.51 to $0.68 in the last 24 hours, data from Coingecko shows. How Proof Of Personhood Could Be Used Proof of personhood aims to tell a platform which accounts are run by actual people and which ones are automated. Reports note that using biometrics would make it harder for bots to create fake accounts, but that approach raises new hurdles. For example, devices and systems must be trusted to check identity without sharing private data. Worldcoin’s model pairs an iris scan with a cryptographic claim. That claim is meant to prove uniqueness while hiding the raw biometric image. The technical detail matters. How the checks are stored, who holds the keys, and whether users can opt out will shape public acceptance. The Identity Project News outlets first published the OpenAI report late last week. Markets reacted in real time. Social posts amplified the rumor, and media pieces linked the plan back to Worldcoin because Sam Altman, OpenAI’s CEO, helped start the identity project. No formal announcement has been made by OpenAI or by Worldcoin. Everything on the table is based on reporting from unnamed sources. It should be clear that plans can change, and that early reports often overstate certainty. Related Reading: PayPal Survey: 4 In 10 US Merchants Now Accept Crypto Privacy And Policy Questions Loom Policy experts were quick to point out issues. Biometrics are sensitive data. Laws in different countries treat them in different ways. Reports have disclosed that regulators will likely ask how consent is gathered, how long data is kept, and whether people can use alternatives to biometric checks. Security is also a concern: if a verification system is breached, the consequences could be serious. Some civil rights groups already say that any mass biometric system deserves close scrutiny. Featured image from Nelson Dai, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "AI News|biometrics|bots|Iris scan|OpenAI|orbs|Sam Altman|social app|WLD|World|WorldCoin|X",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 145,
        "NAME": "WLD",
        "CATEGORY": "WLD"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57560363,
    "published": 1769678079000,
    "title": "Bybit to launch retail bank accounts with personal IBANs in February",
    "body": "Crypto exchange Bybit said its new “My Bank” accounts will give users personal IBANs, instant fiat access, multi-currency transfers and crypto trading under their own name.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57561414,
    "published": 1769681699000,
    "title": "More than half of bitcoin’s invested supply has a cost basis above $88,000",
    "body": "Most invested bitcoin supply sits above current prices, increasing price vulnerability if key support levels fail.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 57561412,
    "published": 1769681577000,
    "title": "Bybit is adding bank accounts to its crypto platform with eye on U.S. expansion: Bloomberg",
    "body": "The exchange is working with local banks like Pave Bank to enable fiat-to-crypto conversions and encourage digital asset adoption.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Bybit|Crypto Exchanges|Fiat-Crypto Exchange|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57561226,
    "published": 1769680991000,
    "title": "South Korea tightens crypto licensing rules for exchanges and shareholders",
    "body": "Regulators gain wider discretion to vet shareholders, finances and controls as South Korea tightens crypto market access.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57561210,
    "published": 1769680862000,
    "title": "DePIN Data Layer AIOZ Pin Pushes to Keep Web3 Files Permanently Online",
    "body": "AIOZ Pin replicates data into multiple, independent copies that are tamper-proof—meaning it will stay accessible for years to come.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 177,
        "NAME": "AIOZ",
        "CATEGORY": "AIOZ"
      }
    ]
  },
  {
    "id": 57561884,
    "published": 1769683136000,
    "title": "World Liberty Financial’s USD1 Tops $5B Market Cap as TRUMP Meme Coin Stumbles",
    "body": "Trump-linked stablecoin USD1 is surging on institutional adoption, while the U.S. President’s official meme coin reels from waning hype.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57562241,
    "published": 1769684439000,
    "title": "Pundit Says XRP Price Is Not A ‘Crypto’ Question, But A Systemically Important Liquidity Asset",
    "body": "A crypto analyst has provided a new update on the XRP price, highlighting its role as a systemically important liquidity asset. According to the pundit, its price dynamics go beyond the typical crypto speculation, emphasizing its value as a foundational financial tool for global liquidity, settlement, and treasury management. XRP Price Signals Value Beyond Crypto Speculation On January 27, crypto analyst and investor Rob Cunningham shared a new take on the XRP price that challenges conventional crypto thinking. He emphasized that the question of XRP’s value is not primarily about crypto speculation but about balance sheets, liquidity, and risk management. He also argued that understanding the altcoin requires viewing it as a structural tool within the global financial system rather than just a market-traded asset. Related Reading: XRP’s 173-Day Theory: What Happens If This Historical Trend Plays Out Again Cunningham noted that when XRP is treated as plumbing, neutral collateral, and a source of settlement certainty, its price logic will stop looking like Bitcoin’s. He described XRP as a systemically important liquidity asset, meaning its valuation reflects systemic function rather than market hype. This framing positions XRP as an essential infrastructure for liquidity and cross-border settlement. The crypto pundit also cited a previous commentary from Ripple’s CTO Joel Katz, who reportedly argued that XRP’s price would need to be well above $200 to achieve its intended purpose. According to Katz, this price target is necessary to make the token a cost-effective neutral bridge of liquidity and settlement globally. Building on this, Cunningham concluded that regulatory clarity could come first for XRP, followed by adoption, and that price would then adjust. The analyst underscored the importance of maintaining patience, noting that the token’s future is inevitable once its functional purpose is fully recognized and integrated into global financial systems. Price When Driven By Global Liquidity And Settlement In his post, Cunningham referenced an image illustrating XRP’s potential flow, liquidity, and price relationships. The data highlighted the price levels XRP’s price could reach if driven by global liquidity and settlements. Related Reading: XRP To $11, And Then $70: The Next Impulse Wave To Watch Out For According to the image, if XRP captures just 15% of SWIFT’s annual flow, it would represent $22.5 trillion in yearly liquidity processed through the cryptocurrency. At 25% XRP settlement rate and tight liquidity corridors, the yearly XRP-settled flow would total $5.6 trillion. Notably, the liquidity required to support these flows depends on its velocity, which ranges from 1:6 to 1:12 per year. Based on an annual flow of $5.6 trillion and a buffer of 2x to 5x, Cunningham estimates the required XRP liquidity would range from $280 billion to $700 billion. This calculation reflects the treasury scale of XRP necessary to absorb and settle global flows effectively. The price scenarios in the image show a wide range, depending on settlement and treasury reserve assumptions. The base case assumes a price range of $2.50 to $7.50 for XRP, while full ripple effects could push the token to $10 to $200. If XRP were to function as a major reserve currency, the image suggests its price could reach $50 to $100 or higher. Featured image from Peakpx, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Joel Katz|Ripple|Rob Cunningham|swift|Treasury Reserve|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57562011,
    "published": 1769683533000,
    "title": "Metaplanet approves $137M overseas raise to buy Bitcoin and repay debt",
    "body": "Metaplanet said proceeds will be used for Bitcoin purchases, its Bitcoin income business, and partial debt repayment as it executes its capital strategy.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57562679,
    "published": 1769685894000,
    "title": "OSL Group raises $200M to expand stablecoin and payments business",
    "body": "Hong Kong-listed OSL Group plans acquisitions and global expansion after securing fresh capital to scale its stablecoin and digital payments business.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 57562667,
    "published": 1769685147000,
    "title": "Metaplanet is raising $137 million to pay down debt and buy even more bitcoin",
    "body": "The Tokyo-based bitcoin treasury company secures fresh capital through a share and warrant issuance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|MetaPlanet|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57563017,
    "published": 1769687141000,
    "title": "Crypto Markets Today: Largest tokens decline, with derivatives signaling caution ahead",
    "body": "Even though the Fed's decision to hold interest rates was widely expected, geopolitical tensions and a rotation into haven assets left crypto traders facing a sea of red.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|Derivatives|Altcoins|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57563243,
    "published": 1769686498000,
    "title": "Investors accuse Cere Network of $100 million fraud and token-dump scheme in lawsuit",
    "body": "Plaintiffs say insiders sold millions of dollars’ worth of tokens immediately after Cere’s 2021 ICO, sending prices into a near-total collapse.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Legal|Blockchain|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 205,
        "NAME": "TOKEN SALE",
        "CATEGORY": "TOKEN SALE"
      }
    ]
  },
  {
    "id": 57563553,
    "published": 1769688788000,
    "title": "Bitcoin vs. gold: Key differences that could position BTC for a big rally",
    "body": "Bitcoin has been called \"digital gold,\" and some of its key properties may help BTC rally more than the precious metal in percentage terms.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57564076,
    "published": 1769689803000,
    "title": "Crypto’s ‘Digital Gold’ Myth Exposed as Traders Pivot to Metals",
    "body": "Bitcoin’s “digital gold” promise is unraveling as traders forgo the token for surging metals, hurting a narrative that once defined the asset’s macro appeal.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57010975,
    "published": 1769689800000,
    "title": "The 24/7 global stock market is impossible on today’s blockchain",
    "body": "Current blockchain infrastructure has inadequate throughput and systematic front-running. Real-world finance demands sub-second finality and fair transaction ordering.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57565500,
    "published": 1769695031000,
    "title": "Robinhood is investing in crypto trading platform Talos at $1.5 billion valuation",
    "body": "The $45 million Series B extension also includes participation from new strategic investors Sony Innovation Fund, IMC, QCP and Karatage.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Robinhood|Talos|Fundraising|Crypto Trading|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57565690,
    "published": 1769695863000,
    "title": "Morning Minute: Gold Soars Toward $5,600; Bitcoin Falls",
    "body": "Gold continues its parabolic rally, up 100% over the past year and seemingly finding new highs by the day. When will Bitcoin have its turn?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Opinion",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57565566,
    "published": 1769695156000,
    "title": "Single Bitcoin entity keeping BTC price 'suppressed' below $90K: Analysis",
    "body": "Bitcoin order-book analysis said that BTC price action was being held back by just one trading entity, while risking a trip to \"Bearadise.\"",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57566234,
    "published": 1769697854000,
    "title": "DePIN rebounds into a $10B overlooked sector: Messari",
    "body": "DePIN’s “death” narrative hides a market that’s quietly compounding revenues, as Messari’s new report pegs the sector at $10 billion with growing real‑world usage and cash flow.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57567116,
    "published": 1769700640000,
    "title": "XRP Price At $10,000 Is Not A Prophecy: Analyst Shares Simple Framework That Points Higher",
    "body": "Crypto analyst Luke has declared that an XRP price rally to $10,000 is not a prophecy, but one that can indeed happen. He shared a framework that breaks down the factors that could drive the altcoin’s rally toward this ambitious target. Analyst Shares Framework For XRP Price Rally To $10,000 In an X post, Luke stated that an XRP price target of $10,000 is ot a target or prophecy but a thought experiment. He further noted that Ripple is building the infrastructure that makes this outcome possible for the altcoin. The analyst then provided the “simple framework” on how XRP will reach this $10,000 price target. Related Reading: Pundit Explains Why The XRP Price Hitting $100 Isn’t Delusional First, he predicted that the XRP price would reach between $10 and $25 when liquidity rotates, not because fundamentals had changed, but because attention had shifted. Luke stated that altcoin cycles still exist and that speculation still moves first. Furthermore, the analyst predicts that XRP will reach $100 once the altcoin is used rather than discussed. This utility will come in the form of repeatedly serving as the bridge currency for cross-border transactions. When this happens, Luke believes that velocity begins to matter and that idle liquidity becomes a liability. The next part of the framework is the XRP price rally to $1,000, which the analyst stated will happen when financial infrastructure assumes XRP is there. In this phase, he envisions a scenario in which XRP becomes the backbone of global finance, with no workarounds or substitutes. Luke said that at this stage, the system relies heavily on XRP, as removing the altcoin would break the system. He added that the price will reflect dependency, not belief. The final part of the framework is the XRP price rally to $10,000, which he claimed would occur when global capital moves under pressure, prefunding fails at scale, and speed, certainty, and liquidity are non-negotiable. Another Pundit Shares XRP Thesis Crypto pundit BarriC, who has always predicted that the XRP price could reach $10,000, has shared his thesis on what will happen as the altcoin rallies to as high as $1 million. He stated that XRP at $2 equals retail speculation, while a $10 price target is early utility and liquidity growth. At $100 per XRP, the analyst believes that institutional usage will begin to matter. Related Reading: Analyst Says All Conditions Are In Place For XRP, Here’s What It Means Furthermore, BarriC stated that large-scale settlements will reduce the required supply, with the XRP price at $1,000. Meanwhile, the analyst noted that fewer units will be needed to move massive value when the altcoin reaches $10,000. He also predicted that XRP could reach $1 million, noting that at this stage, efficiency will exceed abundance. At the time of writing, the XRP price is trading at around $1.86, down almost 2% in the last 24 hours, according to data from CoinMarketCap. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|altcoin|BarriC|CoinMarketCap|Luke|Ripple|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57567303,
    "published": 1769701155000,
    "title": "Bitcoin tumbles to 2026 low of $85,200 as gold reverses big gains, Microsoft leads Nasdaq lower",
    "body": "Soaring to $5,600 at one point earlier on Thursday, gold quickly pulled back to below the $5,200 level in U.S. morning trade.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Market Wrap|Breaking News|top news|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57567139,
    "published": 1769700744000,
    "title": "Dubai Insurance offers a crypto wallet so you can pay premiums and collect claims in bitcoin",
    "body": "In partnership with Standard Chartered’s Zodia Custody, Dubai Insurance is the first insurer globally to issue a crypto wallet for its policy holders to transact with digital assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Dubai|United Arab Emirates|crypto wallet|Zodia Custody|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57567577,
    "published": 1769702125000,
    "title": "Crypto custody firm Copper in early talks for IPO as crypto 'plumbing' becomes new Wall Street favorite",
    "body": "The London-based custody provider is weighing a potential public listing, aiming to follow rival BitGo's recent IPO.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Copper|Crypto Custody|IPO|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57567742,
    "published": 1769702589000,
    "title": "ByBit to Launch 'My Bank' Feature for IBAN Fiat-Crypto Transfers in February",
    "body": "The “retail banking product” aims to eliminate the friction that consumers experience when trying to send funds to crypto exchanges.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57568138,
    "published": 1769703696000,
    "title": "Ethereum OGs revive the DAO with $220 million security fund, Unchained reports",
    "body": "According to the report, $13.5 million will be allocated to security grants distributed through DAO-style mechanisms",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Ethereum Foundation|Ethereum News|DAOs|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57568537,
    "published": 1769704909000,
    "title": "Crypto bill clears U.S. Senate milestone as effort advanced through first committee",
    "body": "The market structure legislation for the first time advanced beyond a committee, setting up the next steps that could end with a vote of the overall chamber.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Senate Agriculture Committee|Market Structure Legislation|U.S. Senate|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 57568349,
    "published": 1769704307000,
    "title": "Bitcoin Hits 2-Month Low as Gold and Stocks Give Up Gains, Crypto Liquidations Top $800M",
    "body": "Bitcoin plunged to a two-month low Thursday as risk-on assets broadly fell—and even gold and silver gave up earlier gains.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57568927,
    "published": 1769706048000,
    "title": "XRP Prints Bullish Divergence On The Weekly Chart, But Is ATHs Still Possible?",
    "body": "After months of compressed price action, XRP is back in focus after a widely followed crypto trader on X highlighted a significant shift on the weekly chart. The asset is now showing a technical signal that has historically appeared near major turning points, sparking debate over whether this setup can realistically support a move back toward XRP’s prior all-time highs. XRP’s Multi-Year Range Holds As Bullish Momentum Emerges The crypto trader notes that XRP’s current market structure remains anchored to a clearly defined weekly price range that dates back to the 2018 cycle peak. This long-standing zone, stretching roughly from the low-$2 area to the low-$3 region, has functioned as a structural equilibrium for XRP across multiple market phases. Since late 2024, XRP’s price has stayed compressed within this range, repeatedly testing both support and resistance without delivering a decisive breakout or breakdown. Related Reading: What’s Going On With The US Dollar And How Does It Affect Bitcoin, Ethereum Prices? What differentiates the current setup from previous failures is the behavior of momentum. On recent weekly lows, momentum indicators have begun forming higher lows even as price revisits familiar support levels. In practical terms, downside moves are losing strength, signaling that selling pressure is weakening. This bullish divergence suggests distribution is fading, with sellers expending more effort for diminishing downside results. The chart shared by the trader reinforces this view, showing price holding range support while underlying momentum trends higher. From a structural perspective, this consolidation reflects absorption rather than weakness. Short-term participants are gradually replaced by longer-term holders, improving market stability. While a bullish divergence alone does not guarantee a return to all-time highs, it reopens that discussion in a technically credible way. A sustained breakout above the upper boundary of this multi-year range would be the key confirmation. Until that occurs, ATHs remain a conditional outcome—but the divergence signals that the groundwork for such a move may now be forming. Macro Rotation And The Case For A Delayed Altcoin Catch-Up The broader market context reinforces the significance of the trader’s weekly XRP analysis. Equities continue to reach record highs, metals are losing momentum, and the US dollar is falling—conditions that historically signal capital rotation. Yet, many altcoins, including XRP, remain sidelined in sentiment, largely overlooked after underperforming relative to newer narratives. Related Reading: Bitcoin Price Prediction: Analyst Forecasts 72.86% Crash To $30,000 According to the crypto trader, this disconnect is notable: altcoins still trade well above bear-market lows, but cautious positioning creates the potential for asymmetric gains if capital rotates from crowded trades. The bullish divergence on XRP’s weekly chart does not guarantee an immediate rally or automatic return to all-time highs. However, it signals that structural groundwork for a larger move is forming. If XRP can reclaim and break above the upper boundary of its multi-year range with conviction, the case for revisiting previous peaks becomes materially stronger. This setup reflects temporary frustration, not failure. Momentum is building, and while patience is required, the chart suggests the market is positioning correctly for a potential delayed catch-up in the altcoin sector. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Ripple|ripple news|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57568954,
    "published": 1769706027000,
    "title": "Senate Democrats Say They Want a Crypto Bill—But Republicans Tanked Negotiations",
    "body": "Zero Senate Agriculture Democrats voted for a crypto market structure bill Thursday, which squeaked by a markup on party lines.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57568837,
    "published": 1769705775000,
    "title": "Here are key levels to watch as bitcoin plunges to $84,000",
    "body": "While precious metals and stocks bounce from their worst levels of the session, crypto remains near the day's low.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Breaking News|top news|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57569030,
    "published": 1769706365000,
    "title": "Bitcoin’s major safety net just snapped. Why a drop below $85,000 might risk more selloff",
    "body": "Bitcoin price just fell through that price floor it's been bouncing off for two months. Now charts might be pointing to $75,000 as next level to watch.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57568998,
    "published": 1769706287000,
    "title": "SEC chair says 'time is right' for pension funds to include crypto, CFTC head says digital assets set to flourish",
    "body": "SEC Chair Paul Atkins and CFTC Chair Mike Selig said they are working with the Senate to get a crypto market structure bill over the line.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Securities and Exchange Commission|CFTC|Cryptocurrency|Regulations|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57569244,
    "published": 1769706946000,
    "title": "Ripple-linked XRP drops 5%, opening downside risk toward $1.70",
    "body": "Traders are watching $1.80 as near-term support, with $1.87–$1.90 now the key resistance zone.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57570055,
    "published": 1769709440000,
    "title": "China Executes Eleven Members of Crime Family Linked to Myanmar Scam Hubs",
    "body": "The Ming family members were put to death after being convicted of crimes that generated $1.4 billion, including running scam compounds.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      }
    ]
  },
  {
    "id": 57570365,
    "published": 1769710447000,
    "title": "Aero DEX aims to fix liquidity fragmentation and dethrone the incumbents",
    "body": "The rollout of Aero, targeted for the second quarter of 2026, will take direct aim at incumbents like Uniswap and Curve, the team told CoinDesk.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Base|Optimism foundation|DEX|Decentralized exchange|Ethereum News|Uniswap|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 53,
        "NAME": "UNI",
        "CATEGORY": "UNI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57571191,
    "published": 1769713200000,
    "title": "U.S. SEC, CFTC chiefs push united front on paving the way for crypto",
    "body": "With Commodity Futures Trading Commission head Mike Selig new in the role, the agencies held a \"harmonization\" event to show they're side-by-side.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|U.S. Securities and Exchange Commission|U.S. Commodity Futures Trading Commission|Regulations|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 16,
        "NAME": "COMMODITY",
        "CATEGORY": "COMMODITY"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57571126,
    "published": 1769712948000,
    "title": "Crypto stocks sink as spot volume plunges and bitcoin tumbles below $84,000",
    "body": "Bellwether crypto exchange Coinbase was lower for an 8th straight session on Thursday to its weakest level since May.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Coinbase|Robinhood|Crypto|Stocks|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57571588,
    "published": 1769714031000,
    "title": "US CFTC to partner with SEC on agency's ‘Project Crypto‘",
    "body": "CFTC Chair Michael Selig and SEC Chair Paul Atkins held a joint agency event on Thursday to discuss harmonization on crypto regulation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57572142,
    "published": 1769715872000,
    "title": "Bitcoin falls to $83.4K as gold bugs take profit and AI stocks sell off",
    "body": "Futures market liquidations, a sharp sell-off in US stocks and limited progress on talks to fund the US government are taking a toll on Bitcoin price today. Is $80,000 the next stop for BTC?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57572434,
    "published": 1769716985000,
    "title": "Tokenization firm Securitize reports 841% revenue growth as it prepares to go public",
    "body": "With crypto prices and crypto-related stocks in the midst of a major selloff today, Securitize SPAC merger partner Cantor Equity Partners II is higher by 4.4% on the news.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Tokenization|Securitize|Cantor fitzgerald|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57567346,
    "published": 1769700562000,
    "title": "Bitcoin Drops Below $85,000 as Traders Retreat From Risk Assets",
    "body": "Bitcoin can’t catch a break these days. First, traders were decamping from cryptocurrencies to gold and silver as a macro hedge for the falling dollar. Now, Bitcoin is falling with precious metals in a broad risk-off trade, reaffirming its status as leveraged beta to risk assets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57572980,
    "published": 1769718374000,
    "title": "Talos adds $45M to Series B with new backing from Robinhood, Sony",
    "body": "The Series B extension values the New York–based crypto infrastructure company at about $1.5 billion and includes backing from institutional investors.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57573442,
    "published": 1769720059000,
    "title": "Bitcoin Slides Toward $85,000 Despite Progress On US Crypto Market Structure Bill",
    "body": "Bitcoin (BTC) continued to slide on Thursday, extending the downward trend seen throughout the week and briefly falling below the closely watched $85,000 level, despite progress on long-awaited US crypto legislation failing to lift market sentiment. Crypto Prices Fall Despite Regulatory Progress The decline came on the same day the Senate Agriculture Committee advanced its portion of the proposed crypto market structure legislation, known as the CLARITY Act. While the committee’s action was widely viewed as a positive development for the digital asset industry, it did little to support prices in the short term. Related Reading: White House To Host Crypto And Banking Leaders In Push To Break Regulatory Deadlock Instead of triggering a rally, the news coincided with a sharp market sell‑off. Bitcoin dropped by roughly $2,700 in a short period, setting off a wave of liquidations that erased an estimated $356 million in long positions. Data from Coinglass further shows that total liquidations across the crypto market reached about $803 million over the past 24 hours, including roughly $693 million in long liquidations and $109 million in short liquidations. Bitcoin Hovers Near Breakdown Levels As earlier reported by Bitcoinist, the CLARITY Act cleared an important procedural hurdle earlier on Thursday when the Senate Agriculture Committee approved its section of the bill during a scheduled markup. The legislation aims to establish a clearer regulatory framework for digital assets in the United States. With the Agriculture Committee’s approval secured, lawmakers must merge the provisions that expand the Commodity Futures Trading Commission’s (CFTC) role with parallel sections overseen by the Senate Banking Committee, which address the Securities and Exchange Commission’s jurisdiction. At the same time, legislators will need to determine whether bipartisan backing can still be achieved for a measure that could significantly reshape crypto regulation in the US. Related Reading: Bitcoin Supply In Loss Begins To Rise, Raising Early Bear Market Concerns From a technical perspective, market analyst Rekt Capital said that in the near term, Bitcoin needs to prevent the former range low around $86,000 from turning into resistance on lower time frames. He added that a weekly close above that level would be necessary to avoid a deeper breakdown. According to his analysis, a decisive break below the roughly $86,000 area could open the door to another test of the macro triangle bottom near $82,500. A further drop below that level, he cautioned, would signal an acceleration of bearish momentum. As of now, the market’s leading cryptocurrency has only briefly recovered to $85,135. However, it is still far from reaching the critical level outlined by the analyst. Therefore, Friday’s price action will be crucial in determining Bitcoin’s next move. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|bitcoin|Bitcoin news|bitcoin price|bitcoin technical analysis|btc|BTC news|btc price|BTCUSDT|CLARITY Act|CLARITY Act news|crypto|crypto market|Crypto Market Structure Bill|crypto news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57573630,
    "published": 1769720298000,
    "title": "Crypto custodian Copper weighs IPO as institutional demand grows: Report",
    "body": "A potential listing would further legitimize digital asset custody as core market infrastructure rather than a niche service following BitGo's public launch.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57574166,
    "published": 1769722248000,
    "title": "Dogecoin Price Could Continue To Decline If This Doesn’t Happen; Analyst",
    "body": "The Dogecoin price is facing renewed pressure as market watchers warn the meme coin may not be out of the woods yet. A crypto analyst warns that unless Dogecoin meets certain key conditions, its ongoing weakness could trigger another price crash, further extending its bearish trend. Dogecoin Price Could Extend Downtrend Like many meme coins, Dogecoin is experiencing a major downturn after failing to break key resistance levels. This continuous rejection has kept selling pressure intact and prevented the DOGE price from building sustained upward momentum. As a result, Dogecoin’s bearish structure, which has been in place for months, shows few signs of relief. Bulls are also facing major roadblocks, leaving Dogecoin vulnerable to further declines so long as it trades below key levels. Related Reading: What’s Going On With The US Dollar And How Does It Affect Bitcoin, Ethereum Prices? According to crypto market expert KrissPax, Dogecoin remains weak and could extend its already intense downtrend if its price fails to recover. He explained that without a solid bullish catalyst to drive the price upward, the meme coin could experience another price crash. KrissPax presented a TradingView chart showing just how far he believes Dogecoin could decline if it fails to recapture market interest and demand. Firstly, the chart highlights a higher-timeframe descending channel pattern that began after the broader market flash crash on October 10, 2025. At the time, Dogecoin recorded one of its largest single-day price crashes, falling from above $0.26 to below $0.10 before quickly recovering. Following that steep decline, Dogecoin price remained stuck in the descending channel, with its overall structure reflecting a bearish trend. Typically, a descending channel pattern favors more downside pressure unless a decisive breakout occurs. So far, Dogecoin has made a few recovery attempts; however, its price has failed to sustain any bullish rally. Recent price action, as shown in the chart, also indicates consolidation near the lower to middle part of the channel, with a gradual base forming around $0.12-$0.14. For now, a clear break below the lower trendline of the channel would confirm the continuation of Dogecoin’s prolonged downtrend. On the flip side, a breakout above the upper trendline of the descending channel with volume confirmation could invalidate DOGE’s bearish structure and signal a potential trend change. Related Reading: Analyst Says Chainlink Price Could Crash 50% If This Level Fails Update On Dogecoin’s Current Price Action According to CoinMarketCap data at the time of writing, Dogecoin remains in negative territory, recording a price correction of more than 3% over the past 24 hours. Data indicates that the meme coin’s daily, weekly, and monthly price performances are in a pronounced slump. If this trend persists, Dogecoin could close January in the red, extending the downtrend that marked the end of 2025. Beyond weak price action, Dogecoin’s total market capitalization has also declined by more than 3%. Daily trading volume remains subdued, down over 2.5%, further highlighting waning investor confidence and reduced interest in the meme coin. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57574231,
    "published": 1769722478000,
    "title": "Bitcoin Plunge Could Get Much Worse as Death Cross Gains Power",
    "body": "Bitcoin's technical setup is turning ugly, as the charts suggest bulls might want to buckle up for more pain ahead.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57574552,
    "published": 1769723311000,
    "title": "21Shares launches first Jito staked Solana ETP in Europe",
    "body": "The product offers exchange-traded exposure to JitoSOL with staking rewards embedded, as liquid staking ETFs remain under review in the United States.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57574788,
    "published": 1769724222000,
    "title": "WallStreetBets Founder Cries Foul After Reddit Cracks Down on Miami Convention",
    "body": "Jaime Rogozinski litigated the trademark to the Supreme Court—and lost.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 57574765,
    "published": 1769724209000,
    "title": "Bitcoin holds $84,000 — for now — but analysts warn of drop to $70,000 if support fails",
    "body": "Thursday's decline showed that, despite hopes for being a macro hedge, bitcoin continues to trade like the riskiest of risk assets when markets turn lower.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Market Wrap|Gold|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57574974,
    "published": 1769725183000,
    "title": "El Salvador's central bank buys $50 million of gold as government keeps adding bitcoin",
    "body": "The bitcoin-friendly nation's central bank now holds over $360 million of the yellow metal, while the government, led by President Nayib Bukele, has bitcoin holdings worth $635 million.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|El Salvador|Gold|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57575261,
    "published": 1769726132000,
    "title": "Ethereum's Oldest Crisis Reborn as a $220 Million Security Fund",
    "body": "Unclaimed Ethereum from a decade-long hack will be staked and distributed to fund audits, tooling, and incident responses.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 57576190,
    "published": 1769728759000,
    "title": "Strategy, BitMine Stock Prices Dive as Bitcoin and Ethereum Sink",
    "body": "Leading crypto treasury firms BitMine and Strategy both saw their stocks plunge nearly 10% amid broader market uncertainty, as a possible U.S. government shutdown looms.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57577757,
    "published": 1769733000000,
    "title": "Solana Scores Major Institutional Adoption As WisdomTree Goes On-Chain",
    "body": "Solana is rapidly positioning itself as a core hub for tokenized finance following WisdomTree’s deployment of fund infrastructure on the blockchain. The move reflects growing confidence among traditional asset managers in SOL’s ability to support large-scale, regulated financial products with the speed and cost efficiency required by modern capital markets. How Traditional Asset Managers Expand On-Chain Operations WisdomTree’s deployment of $159 billion in fund infrastructure on Solana marks a turning point for how regulated money moves. A research and news site, Genfinity, revealed on X that regulated money market funds are now settling natively on SOL, which means institutional cash flow assets no longer require traditional banking rails. One of the clearest signals is the Government money market digital fund, which already holds around $730 million in on-chain assets. Direct minting eliminates synthetic exposure with real Treasury-backed settlement. This allows retail investors to access institutional-grade financial products with blockchain speed and low costs. The multi-chain deployment is proof that financial institutions prioritize performance over narrative. Currently, SOL is processing the same regulated funds that previously required correspondent banks and a 3-day settlement. The gap between on-chain infrastructure and traditional finance products has just collapsed. An industry-leading commentary on the global capital markets, The Kobeissi Letter, reported that Coinbase has announced it is integrating with Jupiter Exchange directly into its on-chain trading stack. With this move, millions of Solana-based tokens can now be traded on Coinbase for the first time, all through Jupiter on-chain liquidity. Instead of relying on the slow manual process of listing assets on a centralized order book, Coinbase is currently using on-chain infrastructure to provide instant access to Solana-native markets. Under the new integration, users can deploy existing Coinbase balances and payment methods to trade tokens from a self-custodial wallet. “Even the centralized exchanges are moving on-chain,” The Kobeissi Letter noted. Why Liquidity Grabs Often Precede Reversals According to Larskooistra, the local context on Solana is fairly conducive to building a structure. The Price has already completed a Model 2 accumulation schematic, and grabbed all buy-side liquidity while taking the range high and broke market structure back to bearish, creating a supply in the process. Related Reading: Solana Structure Suggests One Final Test Before Bulls Can Step In From a higher-timeframe perspective, this gives a bearish context on BTC whenever accumulation models complete themselves and break the market structure, and then turn back to bearish afterwards, which shows a full reversal towards the lows. Larskooistra expects the equal lows acting as the next liquidity target to be taken out, and is looking for distribution schematics on the current move up. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Solana|bitcoin|btc|coinbase|Genfinity|Jupiter Exchange|Larskooistra|Sol|SOL news|SOL Price|Solana news|Solana Price|SOLUSD|SOLUSDT|The Kobeissi Letter",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57579793,
    "published": 1769738913000,
    "title": "US Finalizes Forfeiture of $400 Million Tied to Helix Darknet Mixer",
    "body": "The mixer processed hundreds of millions of dollars in Bitcoin that prosecutors say were tied to illicit activity on the dark web.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57580231,
    "published": 1769740430000,
    "title": "Bitcoin Price 10% Tumble Sparks Fears Of $80K Give-Way",
    "body": "Bitcoin price started a major decline below $86,500. BTC is down nearly 10% and might soon test the $80,000 support zone. Bitcoin failed to remain above $86,500 and started another decline. The price is trading above $85,000 and the 100 hourly simple moving average. There is a bearish trend line forming with resistance at $83,200 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might dip further if it trades below the $81,000 and $80,000 levels. Bitcoin Price Dips Again Bitcoin price failed to continue higher above the $88,000 zone . BTC started a major decline below the $87,200 and $86,500 levels. The bears were able to push the price below $85,000. It spared major bearish moves, pushing the price below $82,000. A low was formed at $81,000 and the price is still signaling more downsides. There is also a bearish trend line forming with resistance at $83,200 on the hourly chart of the BTC/USD pair. Bitcoin is now trading below $83,200 and the 100 hourly simple moving average . If the price remains stable above $80,000, it could attempt a fresh increase. Immediate resistance is near the $82,000 level. The first key resistance is near the $83,200 level or the 23.6% Fib retracement level of the downward move from the $90,438 swing high to the $81,000 low. A close above the $83,200 resistance might send the price further higher. In the stated case, the price could rise and test the $85,000 resistance. Any more gains might send the price toward the $85,700 level or the 50% Fib retracement level of the downward move from the $90,438 swing high to the $81,000 low. The next barrier for the bulls could be $87,000 and $87,500. More Losses In BTC? If Bitcoin fails to rise above the $83,200 resistance zone, it could start another decline. Immediate support is near the $81,000 level. The first major support is near the $80,500 level. The next support is now near the $80,000 zone. Any more losses might send the price toward the $77,000 support in the near term. The main support sits at $75,000, below which BTC might struggle to recover in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $81,000, followed by $80,000. Major Resistance Levels – $82,000 and $83,200.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57580767,
    "published": 1769742008000,
    "title": "Bitcoin Is The Money Of The AI-Powered Economy: CryptoQuant CEO",
    "body": "CryptoQuant CEO Ki Young Ju revived the “Bitcoin equals energy” thesis on Wednesday, arguing that proof-of-work is becoming the settlement layer for an AI-driven economy where power, not narratives, is the binding constraint. In a post on X, Ju framed Bitcoin as a digital instrument that can price energy with precision in a way commodities can’t. “Energy is money. Bitcoin precisely measures the value of energy,” Ju wrote. “Gold also embeds energy, but it cannot be measured accurately because it is not digital. Bitcoin is the money of an AI-accelerated energy economy.” The Link Between AI, Energy And Bitcoin Ju’s comments were posted alongside a long-form X post by Hashed CEO Simon Kim titled Monetizing Energy: Redefining Bitcoin’s Role in the AI Era, which argues that the old “energy waste” critique is being overtaken by an AI data center buildout that is rewriting the value of mining infrastructure. Kim’s core claim is that the debate has shifted from morality to grid economics and industrial pragmatism. “The oldest criticism of Bitcoin has always been about energy,” he wrote. “Claims that it ‘wastes electricity,’ ‘destroys the environment,’ and ‘competes with data centers for power’ have been repeated for over a decade, solidifying into conventional wisdom. But in 2026, this debate no longer resides in the realm of moral condemnation.” The thread points to capital flows as a tell. Kim highlighted Abu Dhabi sovereign wealth fund Mubadala’s $437 million allocation to BlackRock’s Bitcoin ETF in Q4 2024, followed by a partnership with Oman’s sovereign wealth fund to back Crusoe Energy and launch the Middle East’s first flare-gas mining operation. In October 2025, Mubadala co-led Crusoe’s Series E with a $1.375 billion check, pushing the company’s valuation above $10 billion—at which point Crusoe said it would divest its Bitcoin mining division and focus fully on AI infrastructure. Related Reading: Bitcoin Death Cross That Last Preceded A 66% Drop Is Back Kim’s thesis is that miners have already done the hard, unglamorous work AI now needs: securing power, mastering high-density thermal management, and building operational muscle around flexible load. He also leaned on an Elon Musk quote from a November 2025 podcast: “Energy is the true currency. This is why I say Bitcoin is based on energy. You can’t just pass a law and suddenly have a lot of energy.” A recurring theme in Kim’s post is that electricity’s constraints (locality, immediacy, and transmission losses) make flexibility economically valuable. He cited early examples like Sichuan hydropower curtailment exceeding 20 billion kWh by 2020, and argued that miners became a buyer of last resort for energy that couldn’t be stored or sold. Globally, he claimed curtailed renewable energy exceeds 200TWh annually, representing more than $20 billion in economic losses, positioning Bitcoin mining as an instant monetization path for surplus generation. In Texas, Kim pointed to ERCOT’s classification of mining as a controllable load resource, citing Riot Blockchain cutting power usage by 98–99% during the 2022 winter storm and receiving $31.7 million in power credits during an August 2023 heatwave, more than it would have earned mining that month. The framing is less “miners versus data centers” and more “premium uptime workloads versus interruptible demand that stabilizes the grid.” Related Reading: Bitcoin Won’t Break Out Until The Fed Steps Into Yen/JGB Chaos: Arthur Hayes Kim also argued the environmental critique is changing on the margin as the industry’s energy mix shifts. He claimed more than half of mining now comes from sustainable sources, exceeding 52%, while coal dependence fell from 36% to under 9%. On methane, he described flare-gas mining as an emissions arbitrage: methane has “80 times” the greenhouse effect of CO2, flaring combusts 93% with 7% escaping, while using gas for mining combusts over 99%, cutting CO2-equivalent emissions by over 60% versus flaring. The forward implication of Ju’s framing is that if AI accelerates the premium on reliable power and buildout speed, Bitcoin’s value proposition may increasingly be argued in the language of energy markets: measuring, monetizing, and transporting scarcity. Kim’s closing challenge was explicit: shift the question from consumption totals to system outcomes, suggesting the next phase of the debate will center on where miners sit in the stack of AI-era infrastructure, not whether they exist: “AI operates where continuous uptime is essential; Bitcoin operates where flexibility has value. Governments can print money, but they cannot print energy. Bitcoin’s proof-of-work is the mechanism that brings this physical reality into the digital economy. It’s a technology that takes energy from one place and transports it anywhere.” At press time, Bitcoin traded at $86,779. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|AI|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|ki young ju",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57580780,
    "published": 1769741970000,
    "title": "Bybit made ‘slow but steady comeback’ in 2025 after massive hack: CoinGecko",
    "body": "Bybit‘s market share climbed in 2025, even after it was hacked for $1.5 billion, while trading volumes on the top 10 exchanges rose by 7.6% on average last year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 57580749,
    "published": 1769741830000,
    "title": "Tech Giants Circle OpenAI in Funding Round That Could Top $100 Billion",
    "body": "Amazon’s talks could make it one of OpenAI’s biggest backers as the AI company continues to forge ahead with plans for an IPO this year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 57580584,
    "published": 1769741239000,
    "title": "BlackRock’s BUIDL aids Avalanche tokenization value boom in Q4",
    "body": "Messari reports that institutions put millions of dollars into Avalanche last year, but it didn’t help its token, which fell by nearly 60% in the fourth quarter of 2025.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57580965,
    "published": 1769742530000,
    "title": "Ethereum Price Dumps To $2,700, Bulls Scramble To Defend Support",
    "body": "Ethereum price started a major decline after it failed to clear $3,050. ETH is down 10% and is now struggling to stay above the $2,700 support. Ethereum failed to stay above $2,880 and started a fresh decline. The price is trading below $2,800 and the 100-hourly Simple Moving Average. There is a steep bearish trend line forming with resistance at $2,820 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase if it stays above the $2,700 zone. Ethereum Price Dips 10% Ethereum price failed to remain stable above $2,880 and started a major decline, like Bitcoin . ETH price traded below $2,820 to enter a bearish zone. The bears even pushed the price below $2,750. A low was formed at $2,680 and the price is now showing bearish signs below the 23.6% Fib retracement level of the recent decline from the $3,040 swing high to the $2,680 low. There is also a steep bearish trend line forming with resistance at $2,820 on the hourly chart of ETH/USD. Ethereum price is now trading below $2,800 and the 100-hourly Simple Moving Average . If the bulls remain in action above $2,700, the price could attempt another increase. Immediate resistance is seen near the $2,765 level. The first key resistance is near the $2,820 level and the trend line. The next major resistance is near the $2,860 level and the 50% Fib retracement level of the recent decline from the $3,040 swing high to the $2,680 low. A clear move above the $2,860 resistance might send the price toward the $2,900 resistance. An upside break above the $2,900 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $3,000 resistance zone or even $3,050 in the near term. More Losses In ETH? If Ethereum fails to clear the $2,820 resistance, it could start a fresh decline. Initial support on the downside is near the $2,700 level. The first major support sits near the $2,680 zone. A clear move below the $2,680 support might push the price toward the $2,620 support. Any more losses might send the price toward the $2,550 region. The main support could be $2,500. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI – The RSI for ETH/USD is now below the 50 zone. Major Support Level – $2,700 Major Resistance Level – $2,820",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57581634,
    "published": 1769744425000,
    "title": "Optimism passes buyback proposal to bolster OP token",
    "body": "The Optimism blockchain will begin to sell half of its Superchain revenue to buy back its own token starting next month, with the tokens held for future ecosystem use.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 92,
        "NAME": "OP",
        "CATEGORY": "OP"
      }
    ]
  }
]