[
  {
    "id": 56739676,
    "published": 1767378628000,
    "title": "Bitcoin Dominance Grows As Altcoins Post Another Losing Year: Analyst",
    "body": "Altcoins closed 2025 weaker versus Bitcoin, marking a fourth consecutive year of underperformance. According to market data that tracks the TOTAL3/BTC ratio — which measures all altcoins excluding Bitcoin and Ethereum against Bitcoin — the ratio finished lower for calendar years 2022, 2023, 2024 and 2025. That streak has left traders and fund managers rethinking the old pattern where smaller tokens would often surge after Bitcoin rallies. Related Reading: Crypto ETFs Defy The Pullback With $32 Billion In Fresh Investor Cash Altcoins Underperform Bitcoin Market watchers say Bitcoin’s share of the overall crypto market has grown. Bitcoin dominance was reported at roughly 59–60% during the late 2025 selloff, a level that squeezed room for other tokens. Based on reports, small-cap tokens hit their lowest point in four years as money flowed into larger, more liquid assets. Bitcoin itself slipped from an October peak and ended the year in negative territory, a development covered by major outlets that noted it was the first yearly loss for Bitcoin since 2022. Altcoins have now dropped against Bitcoin for 4 years in a row pic.twitter.com/K3rJhSh1tM — Benjamin Cowen (@intocryptoverse) January 1, 2026 Widespread Losses And Heavy Market Moves Several data providers found the median performance among the top 30 altcoins was negative for the year. Market value across the crypto sector fell sharply in late 2025, with some estimates saying more than $1 trillion was erased from total market capitalization during the downturn. Traders described 2025 as a year that began with optimism but closed with broad losses, and many small tokens that rose earlier in the year gave those gains back when risk appetite faded. What Analysts Are Saying Some analysts argue that institutional flows and investor preference for liquidity were important drivers of this trend. Others point to macro pressures in the US and global markets that reduced appetite for speculative positions. Reports note that for an altcoin rebound to beat Bitcoin again, fresh capital would need to rotate specifically into smaller tokens, rather than simply following Bitcoin’s moves. That shift has not been evident so far as 2026 unfurls. The TOTAL3/BTC measure is being used by many traders to gauge altcoin strength versus Bitcoin. When that ratio falls year after year, it means a unit of Bitcoin buys more altcoin market cap than before. Market trackers used by exchanges and analytics firms flagged the persistent downward trend across the last four calendar years, which is an unusual run relative to prior cycles when altcoins sometimes outpaced Bitcoin for parts of a market cycle. Related Reading: Crypto Exchange Korbit Fined $1.90 Million By South Korean Regulators Cautious Stance Investors are staying cautious. Volatility remains high and liquidity can dry up fast in smaller tokens, which makes large moves possible both ways. Based on reports, any meaningful restoration of altcoin gains will likely require clear, sustained capital flows and improved market sentiment. Until that happens, Bitcoin’s share of market capital will probably remain elevated, keeping pressure on smaller tokens. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|altcoins|bitcoin|btc|btcusd|crypto",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56740803,
    "published": 1767380917000,
    "title": "'Hundreds' of EVM wallets drained in mysterious attack: ZachXBT",
    "body": "The incident is potentially related to December's Trust Wallet hack, which left users drained of $7 million in cryptocurrency.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 56741508,
    "published": 1767382620000,
    "title": "Retail Traders Want Options. These Startups Are Betting On How",
    "body": "Retail options volume is surging. One startup wants to make it fun. Another wants to make it comprehensible. Both are betting on very different kinds of traders.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 56742010,
    "published": 1767384000000,
    "title": "Pi Cycle Top Put XRP Price At $300, But Is This Feasible?",
    "body": "The XRP price has been put back in the spotlight as a crypto analyst has forecasted an even more ambitious target than the widely circulated $100 projections currently gaining traction in the market. According to the analyst, XRP has just reached a critical trendline that could trigger a surge toward a Pi Cycle Top. He has shared a detailed chart outlining a roadmap for this bullish price outlook. Analyst Shares Bold $300 XRP Price Prediction A crypto analyst known on X as @Cryptobilbuwoo0 has released a fresh update on XRP, examining its long-term cycle behaviour in 2026. He predicts that the XRP price could surge dramatically, potentially rising from its current low below $2 to as high as $300. Related Reading: Here’s Why The XRP Price Will Shine In The New Year Backing his bold forecast, the analyst noted that XRP recently touched a major green support line on its chart and is now showing early signs of a bullish reversal. He explained that this interaction with support has raised the question of whether the price action is repositioning for a new Pi Cycle Top, a signal typically associated with extreme market peaks. Notably, the chart shared alongside the analysis shows XRP price data stretching from 2014 into future projections beyond 2026. Price action is contained within a rising channel defined by white parallel trendlines, with the green line marking the lower boundary of the long-term support. Previously, whenever XRP reached this green support line, a breakout phase followed shortly. These breakouts often triggered explosive rallies that climbed through the rising channel and peaked near Pi Cycle top markers placed at earlier highs. On the right side of the chart, the crypto expert has highlighted several price targets, including $20, $100, $300, and $1000. The $300 level is near the top of the rising channel, indicating where a future Pi Cycle top could form if XRP follows its historical path. The momentum indicator at the bottom of the chart also shows upward oscillations, with the analyst’s projections for XRP extending deep into 2026 and beyond. Why A $300 XRP Price Might Not Be Feasible While the possibility of XRP reaching $300 is supported by @Cryptobilbuwoo0’s technical analysis, the cryptocurrency is currently trading at $1.83–more than 99% below the projected target. For XRP to achieve such an explosive surge, favorable market conditions would need to align, including stronger investment sentiment and sustained buying pressure. Related Reading: Pundit Shares Why XRP Will Become Expensive And A $1,000 Price Tag Is Possible At present, however, XRP’s price structure appears weak. Its value has been declining and consolidating at lower levels for several months, while overall market sentiment has turned negative. This is reflected in XRP’s Fear and Greed Index, which currently indicates more fear than confidence among investors. Even analysts like Nick, a known crypto crusader and researcher, have stated that XRP is unlikely to reach $100 by the end of 2026. Based on his assessment, a $300 price projection appears even less attainable. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|@Cryptobilbuwoo0|Pi Cycle Top|Ripple|xrp|xrp news|XRP Price|XRP’s Fear and Greed Index|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56744454,
    "published": 1767389425000,
    "title": "XRP Enters A Make-or-Break Zone As This Long-Term Support Cracks",
    "body": "XRP is facing a critical turning point as key long-term support gives way for the first time in over 400 days. After consolidating near $2, the recent break below the 200-day moving average signals mounting pressure, putting the cryptocurrency in a high-stakes zone where the next move could define its near-term trajectory. Price Stalls Below The $2 Wall As Volatility Compresses In an X post, Umair Crypto noted that XRP has faced heavy resistance near the psychological $2 level, forcing the price into a tight consolidation range between $1.85 and $1.88. Such conditions often precede a sharp move, suggesting XRP may be nearing a decisive breakout or breakdown phase. Related Reading: Expert Says XRP ‘Haters’ Miss The Bigger Picture: Here’s What It Is On the daily timeframe, XRP still displays signs of resilience despite the overhead pressure. Buyers have so far managed to defend nearby support zones, preventing a clean breakdown in structure. This defensive price action keeps the broader bullish scenario alive, especially if momentum improves and XRP reclaims higher levels with stronger volume confirmation. However, a wider view from the 3-day chart introduces caution. The current support region aligns closely with the 200-day simple moving average. XRP’s latest close below this moving average marks the first time in more than 400 days, highlighting a notable technical shift that could weigh on sentiment if not quickly reversed. This development places XRP at a critical inflection point. The chart shows a relatively thin historical structure following the explosive November 2024 rally that lifted the price from $0.50 to $3. With fewer well-defined demand zones beneath, any acceleration in selling pressure could lead to faster downside moves. Umair Crypto identified interim support levels around $1.45, $1.10, and $0.69 as potential downside targets if a confirmed breakdown unfolds. Attention remains firmly on the coming sessions, particularly as Ripple’s recent $1 billion token unlock introduces additional supply, adding another layer of pressure to an already sensitive market setup. XRP Former Ceiling Turns Into A Structural Floor According to a monthly XRP update shared by crypto analyst Chad, the asset is currently holding above a key level that previously acted as resistance and has now flipped into support. This shift suggests that buyers are still defending the structure, keeping the broader setup constructive despite recent price action hesitation. Related Reading: XRP Price Slides Under Support, Bearish Continuation Signals Emerge A clear double-top formation can be spotted on the chart. However, Chad notes that it does not have to fully play out as long as XRP continues to hold above the 0.786 logarithmic Fibonacci level. Overall, XRP appears to be in a consolidation phase rather than a decisive move. Price action is currently contained within the 0.786 to 0.886 log Fibonacci range, signaling a period of balance as the market awaits a clearer directional catalyst. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Chad|Fibonacci Level|m&a|moving average|Ripple|Umair Crypto|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56745363,
    "published": 1767391407000,
    "title": "Binance delists FLOW/BTC pair, flags token after exploit",
    "body": "The largest crypto exchange by trading volume announced two moves related to the FLOW token following the project's foundation updating users on a $3.9 million exploit.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 125,
        "NAME": "FLOW",
        "CATEGORY": "FLOW"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 56746850,
    "published": 1767394852000,
    "title": "Jake Claver Doubles Down On $100 XRP Target After 2025 Miss",
    "body": "Jake Claver, a renowned XRP promoter and CEO of Digital Ascension Group, is again leaning into a familiar XRP thesis: behind-the-scenes institutional adoption, NDAs, and “domino” catalysts, only days after analyst Zach Rector publicly criticized Claver’s failed “$100 XRP by end of 2025” prediction as misleading. $100 XRP Only Delayed, Says Claver In a post on Jan.1, Claver responded: “Timelines always get extended,” and added: “I should know this by now from all that we’ve built in the past 3 years, working with partners and regulators. I’m sure Ripple and many others have felt and still feel the same way after 13.5 years. The Domino Theory still stands, Real world events will play out, and XRP will become the backbone of markets in the future.” In a series of posts spanning Dec. 27 through Jan. 1, Claver argued that “real world events will play out, and XRP will become the backbone of markets in the future.” A Jan. 1 post focused on Ripple’s non-disclosure agreements, which Claver described as a signal that large counterparties are already preparing to build with XRP. Related Reading: Expert Says XRP ‘Haters’ Miss The Bigger Picture: Here’s What It Is “Ripple signing over 1,700 non-disclosure agreements probably isn’t random,” he wrote. “These most likely cover talks with major players—governments, global banks, payment networks, big universities, and Fortune 500 firms—all laying the groundwork to use XRP. The pieces for mass adoption have been falling into place behind the scenes for quite a while.” Earlier posts pressed the same point with higher conviction. On Dec. 28, Claver claimed: “Major institutions are stacking up XRP behind the scenes while keeping the public in the dark. The current price is merely a shadow of what’s coming. When XRP transforms into the foundation of international finance, today’s hesitation will become tomorrow’s regret. In my opinion, nothing in crypto space offers this level of certainty and potential for massive returns.” Related Reading: XRP At Risk Of A Drop To $0.80? Analyst Makes The Case On Dec. 31, he described XRP “as built to upgrade the existing financial system,” while adding that “blockchain isn’t just for storing value, it can power a faster, more open financial system. For that, you need high-performance infrastructure like XRP.” As reported on Bitcoinist yesterday, Rector’s criticism has been less about making bold forecasts than about the way they are delivered. Rector argued there was “no plausible scenario” for a roughly 5,000% move in the time window implied by the $100 call, and that the messaging leaned on suggestions of privileged insight rather than probabilistic framing. Rector’s allegations also extended beyond price talk into claims about XRP-focused funds associated with Claver’s orbit. “Jake and his scheme, his business has grown so big they’ve taken in so much XRP from our community,” Rector said. “There’s a massive discrepancy from what he’s saying publicly and what investors are telling me privately.” At press time, XRP traded at $1.89. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|Jake Claver|xrp|xrp news|XRP Price|XRP Price Prediction",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56748477,
    "published": 1767398405000,
    "title": "Altcoin Season Setup Advances: CEX Volume Hits Cycle Highs Despite Price Weakness",
    "body": "Altcoin season was widely anticipated for 2025, but the reality has unfolded very differently. Instead of a broad-based rally, most altcoins suffered deep and prolonged drawdowns, erasing years of gains and forcing many investors out of the market. As 2026 approaches, sentiment around altcoins remains fragile. A growing number of analysts now warn that the worst may not be over, arguing that structural weakness, declining liquidity, and fading retail participation could drive another leg lower across the sector. Related Reading: Ethereum Liquidity Rebuilds On Binance: December Inflows Signal Strategic Repositioning Market data reinforces this cautious outlook. The Crypto Total Market Cap, excluding the top 10 assets—commonly referred to as the OTHERS index—has collapsed by more than 50% since December 2024. Market capitalization has fallen from roughly $451 billion to around $182 billion in just twelve months, highlighting the scale of capital destruction across mid- and small-cap tokens. This sharp contraction reflects aggressive de-risking, weak demand, and sustained selling pressure across the altcoin market. However, not all analysts are convinced the altcoin cycle is finished. A smaller group points to historical precedents, arguing that periods of extreme underperformance and investor capitulation have often preceded powerful altcoin recoveries. From this perspective, 2026 could mark the delayed arrival of an altcoin season—if liquidity conditions improve and capital rotation resumes. Altcoin Trading Activity Remains Elevated Despite Price Weakness A recent CryptoQuant report challenges the widely held belief that this cycle has produced “no altcoin season.” According to the data, centralized exchange trading volume for altcoins—excluding the top five assets—has reached levels significantly higher than those seen in previous market cycles. In other words, altcoins are being traded more actively than ever, even as prices remain deeply depressed across much of the market. This divergence between volume and price helps explain the prevailing confusion. While many tokens have lost a substantial portion of their value, on-chain and exchange data show that activity has not disappeared. Instead, the market has undergone a structural shift. Retail participation has largely faded after months of losses, with many smaller investors capitulating and exiting positions. Their absence, however, has not resulted in lower overall trading activity. CryptoQuant’s analysis suggests that altcoin dominance has increasingly concentrated among larger players. Whales and professional participants now account for a growing share of altcoin volume, using periods of low liquidity and weak sentiment to accumulate positions or actively rotate capital. From this perspective, the current phase may not signal the absence of an altcoin cycle, but rather its transformation. If whale-driven positioning continues and broader market conditions improve, these participants are likely to push prices higher to maximize returns. Related Reading: Bitcoin Miner Distribution Re-Emerges: BTC Enters A Fragile Price Phase OTHERS Market Cap Shows Prolonged Compression The OTHERS chart, which tracks the total crypto market capitalization excluding the top 10 assets, highlights the depth and duration of the ongoing altcoin correction. After peaking near $450 billion in late 2024, the market has lost more than half of its value, stabilizing around the $200–210 billion zone. This sharp contraction confirms that the altcoin market has experienced a full reset rather than a shallow pullback. From a technical perspective, the structure reflects prolonged compression. Price is currently oscillating around the 200-week moving average (red), a level that historically acts as a long-term equilibrium zone during transitions between bearish and recovery phases. The failure to reclaim the 100-week and 50-week moving averages suggests that upside momentum remains weak and that buyers lack conviction at higher levels. Related Reading: Bitcoin Supply In Profit Sets The Stage For Bullish Cross In Q1 2026 Volume dynamics reinforce this view. While periodic spikes appear during sell-offs and relief rallies, there is no sustained expansion in volume that would signal broad-based accumulation. This implies selective positioning rather than widespread risk appetite. Importantly, the market is no longer making aggressive lower lows, indicating that forced selling may be largely exhausted. However, the absence of higher highs keeps the structure neutral-to-bearish. For a meaningful altcoin recovery, OTHERS would need to reclaim the $260–280 billion range and hold above key moving averages. Until then, the chart suggests consolidation, dominance by larger players, and a market still searching for a durable bottom rather than the start of a classic altcoin season. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|altcoin|altcoin analysis|altcoin news|Altcoin Season|Altcoin season news|Altcoin Volatility|Altcoin Volume|Total 3",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56750095,
    "published": 1767402030000,
    "title": "XRP Under $2? One Of The ‘Greatest Blessings’ We’ll See In Our Lifetime, Analyst Says",
    "body": "A well-known finance coach in the XRP community has urged patience, calling the cryptocurrency’s price sliding under $2 a rare long-term chance to buy. According to his public posts, he described XRP trading below $2 as “one of the greatest blessings of our lifetime” and said he remains actively accumulating at current levels. Related Reading: Crypto Exchange Korbit Fined $1.90 Million By South Korean Regulators XRP Below $2 Seen As Entry Point Coach JV’s portfolio centers on a mix of major coins and infrastructure tokens. His top crypto holdings include XRP, Bitcoin, WLFI, Solana, XLM, HBAR, and VET. On the equities side, he highlighted American Bitcoin Corp (ABTC) and Twenty One Capital (XXI) as key stock positions. The disclosure was used to argue that steady exposure, not frantic trading, fits a long-term plan. Market watchers in the XRP sphere are pointing to several possible tailwinds. According to other commentators, growing interest in XRP spot ETFs has pushed combined holdings to about $1.16 billion. There are also reports that companies such as VivoPower and Wellgistics Health have added XRP to their treasuries, which some analysts say could take supply off the market and tighten available coins. Investor Mix Of Crypto And Stocks XRP under $2.00 is one of the greatest blessings of our lifetime. I am still accumulating. My top crypto holdings: XRP Bitcoin WLFI Solana XLM HBAR VET My top two stocks: ABTC XXI Cash-value life insurance is the foundation of my family’s wealth empire. Cash flow is the… — Coach, JV (@Coachjv_) January 1, 2026 Mason Versluis, a popular crypto YouTuber, offered a grounded view about expectations. He urged followers to focus on “the real things” and fundamentals, rather than clinging to failed three-digit forecasts. Versluis reminded the community that XRP began January 2025 at $2.08 and moved to $3.40 by the end of that month. The token then reached a yearly high of $3.66 in July before sliding back to close 2025 at $1.84, which represented an 11.5% YTD decline. “We just look at the fundamentals,” he said, adding that those who loudly predict extreme prices often end up wrong. My thoughts on Jake Claver’s TRIPLE DIGIT $XRP prediction: (Clip from my stream today) pic.twitter.com/y7JJQfPsPf — MASON VERSLUIS (@MasonVersluis) December 31, 2025 According to several voices in the space, regulatory moves could also matter. One influencer cited a White House confirmation that the CLARITY Act markup is scheduled for January 2026, which supporters believe may clarify crypto rules and encourage institutional flows. Based on reports, such policy milestones are being watched closely by investors who expect clearer rules to broaden participation. Focus On Systems Over Hype As for Coach JV’s public statements on this issue, he emphasized and stressed the process more than making predictions. JV explained that he maximized cash-value life insurance as part of his wealth strategy, managed debt very carefully, and created systems which enforce discipline on himself and his business. Related Reading: Crypto ETFs Defy The Pullback With $32 Billion In Fresh Investor Cash The mix of voices in the community reflects two linked ideas: some see current prices as a buying window, while others warn that timing markets is risky. Based on reports and the coach’s disclosures, the common advice is simple — build a plan, stick to it, and buy if the thesis still holds. For many holders, the current sub-$2 trading range is being treated not as failure, but as an opportunity to prepare for possible wider adoption down the road. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|bitcoin|crypto|digital currency|xrp|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56753233,
    "published": 1767409219000,
    "title": "Bitcoin Key Moving Averages Indicate An Imminent Drop To $38,000",
    "body": "As 2025 came to a close, Bitcoin (BTC) ended on a negative note, trading more than 30% below its all-time highs and grappling with the formation of a death cross—a technical indicator that traditionally precedes significant price corrections. Currently hovering just above $89,200, Bitcoin recently saw its 10-week and 50-week simple moving averages (SMAs) cross paths on December 8, a development highlighted by market analyst Ali Martinez on social media site X (previously Twitter). Bitcoin May Face 50%-60% Correction Martinez emphasized the importance of watching the behavior of these two moving averages on the weekly chart. Historically, each time Bitcoin has registered a death cross between the 10-week and 50-week SMAs, it has been followed by substantial corrections. Related Reading: Dogecoin Long-Term Bullish Structure Still In Play And Will Cross $10 As seen in the cryptocurrency’s weekly chart below, past occurrences of such crossovers have led to price declines of 67% in September 2014, 54% in June 2018, 53% in March 2020, and 64% in January 2022. With the recent death cross-forming, Martinez suggests that if history is any guide, Bitcoin could face a correction between 50% and 60%, which would place its price anywhere between $50,000 and $38,000. Adding another layer of complexity to the analysis, market expert Mags has outlined two potential scenarios for Bitcoin’s near future. Two Scenarios For BTC’s Future Following Bitcoin’s downturn since its October highs above $126,000, it has been trading around the $85,000 mark for several weeks. Coinciding with this, Tether’s USDT dominance has broken out of its previous range, currently maintaining levels above the breakout zone. Since Bitcoin and USDT dominance exhibit an inverse correlation, Mags has identified two main scenarios moving forward. The first, a bullish scenario, hinges on the idea that if USDT dominance begins to decline, the current breakout could turn out to be a fakeout. Mags asserts that such a move could potentially ignite another expansion in Bitcoin’s price, possibly even leading to a new all-time high before any significant distribution occurs. Related Reading: Here’s How Much The XRP Price Will Be If It Overtakes Ethereum In Market Cap Conversely, Mags outlined a second scenario indicating early signs of a bearish structure. If the broader market trend weakens, Bitcoin might experience a temporary bounce, while USDT dominance forms a higher low near its mid-range before trending back upwards. In this case, BTC would exhibit a slow distribution pattern, marking neither a crash nor a rapid decline, but rather a gradual, choppy downward movement characteristic of initial bearish market behavior. The next move in USDT dominance is poised to play a crucial role in determining whether the current market represents a mere pause before further price continuation or the onset of an extended distribution phase leading up to a new all-time high. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin chart|Bitcoin Death Cross|Bitcoin news|bitcoin price|bitcoin technical analysis|btc|BTC news|btc price|BTCUSDT|crypto|crypto market|crypto news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56754789,
    "published": 1767412819000,
    "title": "Dogecoin Heading To $0.08? Analyst Thinks So—Here’s Why",
    "body": "A cryptocurrency analyst has pointed out how Dogecoin could be on track for $0.08 based on this breakout from a consolidation channel. Dogecoin Has Fallen Under An Ascending Channel In a new post on X, analyst Ali Martinez has talked about where Dogecoin could be heading based on a technical analysis (TA) pattern. The pattern in question is an “Ascending Channel,” which is a type of Parallel Channel. Related Reading: Bitcoin Cycle Defined by Demand, Not Price: CryptoQuant Head Says Parallel Channels appear whenever an asset’s price observes consolidation between two parallel trendlines. When these lines have a positive slope, the pattern is known as an Ascending Channel. This channel corresponds to consolidation that occurs toward some net upside. Like other such patterns in TA, the upper line acts a source of resistance, while the lower one provides support. A break out of either of these boundaries can signal a continuation of trend in that direction. This means that a surge above the channel may be a bullish signal, while a drop under it a bearish one. Like the Ascending Channel, there is also a pattern in TA called the Descending Channel, emerging when the opposite type of consolidation takes place. That is, when the price moves to a net downside between two parallel trendlines with a negative slope. Until recently, Dogecoin had been trading inside a multi-year Ascending Channel on the 3-day timeframe. The memecoin capped off 2025 with a breakout from it, as the chart shared by Martinez shows. From the above graph, it’s apparent that Dogecoin has escaped the long Ascending Channel with a fall below the support trendline. The memecoin has since been following a steep downward trajectory, a potential sign that the bearish breakout is in effect. Breakouts from Parallel Channels are considered likely to end up being of the same height as the distance between the trendlines. Based on this, the analyst has put the $0.08 target for DOGE. It now remains to be seen whether the asset will follow this trajectory or if it will see a rebound before long. Related Reading: XRP At Risk Of A Drop To $0.80? Analyst Makes The Case In another X post, Martinez has highlighted how Bitcoin, the number one cryptocurrency, has also been trading inside a TA consolidation pattern recently. As displayed in the chart, the pattern in the case of Bitcoin is a Symmetrical Triangle, a channel that involves two lines converging at a roughly equal and opposite slope. BTC’s 4-hour price has been moving sideways in this pattern recently and based on its height, the analyst thinks that the coin may be set up for a 15% move. DOGE Price At the time of writing, Dogecoin is floating around $0.13, up more than 8% over the last 24 hours. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|Dogecoin Ascending Channel|dogecoin price|dogeusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56757953,
    "published": 1767420049000,
    "title": "Bitcoin Volatility Goes Down: BTC Records ‘Calmest Year In History’",
    "body": "Despite the recent price action, Bitcoin (BTC) closed 2025 as the year with the lowest volatility in its history, driven by market maturity, regulatory developments, and the increasing participation of institutions in the crypto space. Related Reading: Ethereum Optimism For 2026: Analysts Share Bullish Forecast Despite Disappointing End-Of-Year Bitcoin Records Least Volatile Year On Friday, K33 Research data revealed that Bitcoin has recorded the least volatile year in the asset’s history. According to the chart, the flagship cryptocurrency saw its lowest volatility level, measured by the average deviation of daily returns, in 2025, hitting just 2.24%. The recent data shows that BTC fell below the previous lowest year on record, 2023, which registered 2.30% volatility. Moreover, it’s annual volatility has also ended below the 3% mark over the past three years, its lowest levels since 2016. This signals a “clear” diminishing trend, K33 Research noted, as Bitcoin’s volatility has been trending lower year by year, suggesting growing market maturity and stabilizing price action. Crypto trader Niels highlighted that “for the first time, BTC recorded its lowest annual volatility on record, lower than every cycle before it, including the early ‘wild west’ years and the post-ETF era.” As he explained, 2025 was “the calmest year in Bitcoin’s history” despite all the price movements of the years, including the Q4 daily corrections, which saw the flagship crypto retrace up to 16% in a single day. It’s worth noting that BTC’s deepest correction in 2025 saw the cryptocurrency drop nearly 36% in a two-month period, while previous cycles’ corrections recorded retraces of more than 50% during similar periods. Previously, Nic Carter addressed the negative sentiment brewing around Bitcoin and the broader market. He detailed that the market could be considered “boring” now because most of the questions that drove the historical volatility have been answered. Carter also asserted that the space matured significantly with “more serious businesses (…), [and] less chaos” in the industry. The Start Of The ‘Institutional Era’ In his X post, Niels also pointed out that the diminishing trend in Bitcoin volatility was fueled by the massive institutional participation, calling for “More capital. More long-term holders. More institutional participation. [and] Less emotional trading” for the future. Similarly, Bitwise’s CEO, Hunter Horsley has affirmed that the overall crypto market was changing, driven by the significant decrease in regulatory risk, which has led to last year’s spike in institutional adoption and mainstream recognition. Notably, the market saw the second of wave of crypto Exchange-Traded Funds (ETFs) go live, with funds based on altcoins like Solana (SOL) and XRP breaking multiple records. In addition, the Digital Asset Treasury (DAT) trend, led by Strategy’s Bitcoin purchases, poured billions of dollars into cryptocurrencies in 2025. Related Reading: Crypto Hacks Swipe Nearly $3 Billion In 2025 Despite Fewer Attacks – Report In November, Ark Invest’s CEO Cathie Wood stated that growing institutional adoption will be a powerful driver for long-term value for Bitcoin, noting that large-scale institutions have barely dipped their toes into the space and “have a long way to go.” Meanwhile, Head of Research at Grayscale, Zach Pandl, said in an January 2 interview that 2026 could be the “dawn of the institutional era” for crypto. He noted that rising demand for alternative stores of value and progress on bipartisan US crypto market structure legislation could drive Bitcoin to new highs in the first half of the year. As of this writing, Bitcoin is trading at $90,240, a 1.54% increase in the daily timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|bitcoin bear market|Bitcoin ETFs|bitcoin price|Bitcoin volatility|btc|BTCUSDT|Cathie Wood|crypto anlayst|Crypto ETFs|crypto market correction|Crypto trader|K33 Research",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56758182,
    "published": 1767420223000,
    "title": "Crypto social chatter has 'very positive' start to 2026: Santiment",
    "body": "The crypto market may see FOMO enter the market if Bitcoin suddenly creeps toward the $92,000 price level, according to a crypto analyst.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56758512,
    "published": 1767421304000,
    "title": "XRP jumps 8% above $2 as traders bet on a friendlier SEC",
    "body": "The departure of SEC Commissioner Caroline Crenshaw is seen as potentially paving the way for more crypto-friendly policies.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Ripple|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56759168,
    "published": 1767422807000,
    "title": "Dogecoin, PEPE rocket as much as 25% as 2026 starts with a bang for memecoins",
    "body": "The broader meme coin market is heating up, with CoinGecko's GMCI Meme Index showing a market value of $33.8 billion and a trading volume of $5.9 billion.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 93,
        "NAME": "PEPE",
        "CATEGORY": "PEPE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56759555,
    "published": 1767423619000,
    "title": "2026 Crypto Market Prediction: Will Prices Soar Or Face Continued Declines?",
    "body": "With 2025 now closed, the crypto market is beginning 2026 with attempts to recover from one of its most challenging years. After a tumultuous period, total market capitalization has surged back above $3 trillion. However, many investors are left wondering what the new year has in store for digital assets. Institutions Forecast Bullish Crypto Prices For 2026 According to a recent report by analysts at Bull Theory, the past year proved to be robust for traditional markets, particularly for metals, while cryptocurrencies fell short of expectations. Silver surged by 160%, and gold followed suit with a 66% increase. In contrast, Bitcoin (BTC) wrapped up 2025 down approximately 5%, despite several positive indicators, such as consistent purchasing by Strategy, strong inflows into Bitcoin exchange-traded funds (ETFs), and growing institutional interest. Related Reading: Is The Dogecoin Bottom In? 3 Analysts Break Down the Charts Yet, when one asset class lags significantly while liquidity remains abundant, historical trends show that the gap typically narrows. In terms of specific projections, various major institutions and prominent investors have offered their forecasts for both Bitcoin and Ethereum (ETH). Standard Chartered targets Bitcoin to reach $150,000 by the end of 2026, and JPMorgan projects a price of $170,000. Meanwhile, Citi’s base case stands around $143,000, with a more aggressive bull case suggesting a potential rise to $189,000. Cathie Wood of ARK Invest envisions a long-term scenario where Bitcoin could hit $500,000, contingent on widespread institutional adoption. Tom Lee from Fundstrat anticipates Ethereum will trade between $7,000 and $9,000 by early 2026, fueled by the tokenization of real-world assets. New Regulations And Economic Optimism The analysts further highlighted that, unlike previous years, this cycle looks distinct in several key aspects. For one, crypto is no longer encumbered by operating within a legal gray area. New regulatory frameworks, particularly in the US, are poised to offer clearer guidelines, reducing uncertainty and facilitating easier access for institutional investors. The anticipated changes aim for simplified regulations that could enhance market structure while broadening institutional participation beyond just Bitcoin and Ethereum. Moreover, several factors suggest that a sharp movement in the crypto markets could be on the horizon. The end of quantitative tightening on December 1, 2025, coupled with a growing GDP, signals a conducive environment for crypto. Related Reading: Dogecoin Long-Term Bullish Structure Still In Play And Will Cross $10 With inflation stabilized below 3% and unemployment at 4.6%, there are indications that the Federal Reserve (Fed) may adopt a more dovish stance, especially with a new Fed Chair expected to take office in May 2026. Overall, as the new year begins, the crypto market finds itself in a position of underperformance rather than excess. This contrasting state often results in rapid repricings as gaps are closed in response to liquidity alignment. As a result, Bull Theory analysts believe that 2026 could very well be the year when these disparities start to correct, leading to a potentially bullish environment for cryptocurrencies. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|btc|crypto|crypto market|crypto market forecast|Crypto market news|crypto news|cryptocurrency|ETH|ethereum",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56769193,
    "published": 1767445223000,
    "title": "Dogecoin Price Could Rally To All-Time Highs If It Breaks This Resistance Level",
    "body": "Crypto analyst BALO has predicted that the Dogecoin price could still rally to new all-time highs (ATHs) despite its decline last year. He revealed what level DOGE needs to reclaim to trigger this massive breakout that could lead to new highs. Dogecoin Price Eyes Rally To ATH With Reclaim Of This Level In an X post, BALO stated that a reclaim of $0.13 could trigger a massive breakout for the Dogecoin price and could lead to a new all-time high (ATH) for the top meme coin. His statement came just before DOGE reclaimed this level, rallying double digits in the last 24 hours. Related Reading: Dogecoin Long-Term Bullish Structure Still In Play And Will Cross $10 The Dogecoin price rallied alongside other meme coins, with PEPE leading the way with a daily gain of as much as 35%. With DOGE now back above $0.13, a new all-time high could be on the cards, as BALO predicted. His accompanying chart showed that the meme coin could reach a yearly high of around $0.44 this year, then rally to a new ATH of $0.74 in 2027. Crypto analyst Neo offered a more bullish outlook for the Dogecoin price, suggesting it could rally to as high as $35. In an X post, the analyst highlighted an ascending trendline for DOGE, with the middle of the trendline placing the meme coin at $4, and the target at the top of the trendline at $35. Neo alluded to DOGE’s historical performance, noting that in 2021, the Dogecoin price surged from the lower limit to the upper limit in one go. The analyst further remarked that there is the potential for that to happen again this time. His accompanying suggested that this parabolic rally could happen before this year ends. Why A Rally To $0.75 Is Possible Crypto analyst Bitcoinsensus raised the possibility of a Dogecoin price rally to $0.75 and explained why DOGE could rally 450% to this resistance level. The analyst noted that each previous accumulation phase has led to a strong upswing in price. As such, Bitcoinsensus said that this might indicate what could happen next for the meme coin, with a potential rally to a new ATH. Related Reading: 7-Period Fractal Trend Says Dogecoin Price Is Headed To $10 Meanwhile, crypto analyst Kevin Capital indicated that the Dogecoin price may be reentering a bullish trend after climbing back above the $0.138 level. He further remarked that the next thing needed is a weekly close above this level, and then DOGE could be “back in business.” The analyst had previously stated a reclaim of this level would be a huge positive, with his accompanying chart suggesting that this could put a potential rally to $0.4 on the cards. At the time of writing, the Dogecoin price is trading at around $0.14, up over 11% in the last 24 hours, according to data from CoinMarketCap. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|Balo|Bitcoinsensus|CoinMarketCap|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt|Kevin Capital|neo|PEPE",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 93,
        "NAME": "PEPE",
        "CATEGORY": "PEPE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56769443,
    "published": 1767445200000,
    "title": "Cathie Wood’s ARK Fintech ETF Defies 2025 Slump, Gaining 30% on AI Bet",
    "body": "Cathie Wood’s ARK Blockchain & Fintech Innovation ETF delivered a standout 29% return in 2025, defying an industry downturn by stretching the definition of “financial technology.”",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      }
    ]
  },
  {
    "id": 56773031,
    "published": 1767453300000,
    "title": "JPMorgan Tokenizes Cash On Ethereum And Redraws Wall Street’s Map",
    "body": "JPMorgan tokenizes cash with its MONY fund on Ethereum, signaling how Wall Street is reshaping money, settlement, and the future of tokenized finance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|Business|/business|Innovation Rx: Technologies|/feature/innovation-rx/technologies|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56776113,
    "published": 1767459956000,
    "title": "Hut 8 finishes 2025 strong despite difficult year for Bitcoin miners",
    "body": "The company continued to diversify into the AI and high-performance computing sectors in 2025, with major deals and credit expansions.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56775908,
    "published": 1767459663000,
    "title": "The Grisliest Bitcoin and Crypto Wrench Attacks That Grabbed Headlines in 2025",
    "body": "Attacks against Bitcoin and crypto holders became increasingly physical in 2025. Here's a look back at some of the horrific assaults.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56776635,
    "published": 1767461429000,
    "title": "Why The Ethereum Price Could Bounce Above $3,500 Soon",
    "body": "A crypto analyst has predicted that the Ethereum price could balloon to $3,500 soon, potentially breaking free of the bearish pressure that has suppressed its momentum for much of 2025. Although ETH is currently trading more than 37.5% below its all-time highs, the analyst has outlined technical indicators and market structure signals suggesting $3,500 is a realistic short-term target for the cryptocurrency. Related Reading: Crypto ETFs Defy The Pullback With $32 Billion In Fresh Investor Cash Ethereum Price Setup Points To $3,500 Rebound Crypto market analyst Tryrex has delivered a fresh outlook on the Ethereum price, pointing to conditions that could support a strong upside move to $3,500 in the coming months. In his post on X, the expert suggested that ETH may be approaching the end of its prolonged corrective phase and may be preparing for a decisive bounce. Tryrex highlighted the possibility of a strong rebound developing in the first quarter of 2026, driven by Ethereum’s current hold of a critical liquidity zone between $2,800 and $3,000. He explained that while Bitcoin (BTC) bottomed out in 2025 and entered a range-bound period right after, Ethereum showed relative strength by firmly defending the liquidity region. Based on the analyst’s weekly TradingView chart, this price area also represents a weekly demand zone that has absorbed repeated selling pressure. The fact that the price continues to hold this area indicates that market participants are buying ETH rather than distributing it. Volume behavior at the bottom of the chart also suggests that selling pressure has been weakening compared to earlier phases of Ethereum’s downtrend. Tryrex expects an impulsive move to emerge as Ethereum continues to react to the $2,800 to $3,000 liquidity range. If momentum builds as anticipated, ETH could break out of its current structure and push toward higher resistance levels, with a move above $3,500 seen as an increasingly likely near-term target. With its price currently sitting above $3,000, this would represent a more than 13% increase. The analyst has also revealed that his bullish forecast for ETH reflects broader conditions across the altcoin market. He highlighted that many major altcoins appear to be bottoming out after extended downtrends, increasing the possibility of coordinated upside moves if market sentiment and volatility improve. Ethereum Shows Early Moves In 2026 The market is just three days into 2026, and although major cryptocurrencies like Bitcoin and Dogecoin closed 2025 in the red, Ethereum appears to be showing early signs of recovery. Initially, the ETH started the year in a similar downtrend, but over the past 24 hours, its price has increased by approximately 2.5%. Related Reading: Bitcoin Dominance Grows As Altcoins Post Another Losing Year: Analyst CoinMarketCap data shows that from January 1 to date, Ethereum has declined by more than 9.5%. However, its trading volume in the last 24 hours has increased by over 100%, signaling strong trader interest despite the recent price dips. In addition, whales have been steadily accumulating ETH, taking advantage of lower prices to increase their positions. Featured image from Pexels, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|blockchain|crypto market|crypto news|cryptocurrency|ethereum|ethereum price|ethusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]