[
  {
    "id": 55586131,
    "published": 1765350035000,
    "title": "Cathie Wood Says Bitcoin Is ‘Climbing Another Wall Of Worry’– Here’s Why",
    "body": "Ark Invest’s CEO and CIO, Cathie Wood, joined Fox Business’s “Morning With Maria” to discuss her investment strategy as she believes the US is entering a “historic productivity surge,” and why she is bullish on Bitcoin (BTC) for 2026. Related Reading: All Eyes On Ethereum: Price Attempts Key Breakout As BlackRock Files For Staked ETH ETF The Four-Year Cycle Will Be ‘Disrupted’ On Tuesday, Ark Invest’s CEO, Cathie Wood, shared her perspective on the recent Bitcoin performance, which has retraced over 10% in the past month and struggled to reclaim crucial levels over the past few weeks. To Wood, Bitcoin has been behaving like a risk-on asset and is currently “climbing another wall of worry” that has made investors wary of the leading crypto asset’s upcoming performance. As she explained, there is a fear of the four-year cycle, which suggests that 2026 will be a corrective year for Bitcoin. Historically, BTC has seen significant price pullbacks during bear markets, with retraces of up to 75% to 90% in previous cycles. The aggressive Q4 2025 correction has shattered most investors’ expectations of an end-of-year bull run, raising concerns that the crypto market has already entered the bearish phase of the cycle after the more than 30% drop from the October highs. However, Ark Invest’s CEO considers that “the four-year cycle is going to be disrupted” as volatility has significantly diminished over the past few years, and large-scale investors turn to the rapidly growing industry. “We think that the move by institutions into this new asset class is going to prevent much more of a decline,” Wood affirmed, noting, “we might have seen it a couple of weeks ago,” when BTC managed to hold the $80,000 barrier during the late November correction. She previously asserted that growing institutional adoption will be a powerful driver for long-term value for the cryptocurrency, adding that institutions “really have just dipped their toes into this space. We have just started, so we have a long way to go.” Bitcoin To Outperform Gold Soon? During the interview, Wood also reaffirmed her previous forecast that the flagship crypto will outperform gold next year, despite its choppy performance during the last quarter of 2025. She highlighted that “gold is more of a risk-off asset,” and its 60% year-to-date (YTD) rise is “proof” that Bitcoin is climbing a wall of worry as investors “are using gold as a hedge against geopolitical risks.” Nonetheless, Ark Invest’s CEO pointed out that between the early 80s and the late 90s, gold peaked and “went down as we were in the golden age of innovation, ending with the internet.” Related Reading: Wall Street Giant Bernstein Predicts Bitcoin Price To Hit $1 Million By 2033 Now, she believes that the same could happen soon, as what she calls “the AI age” starts and the market potentially recovers. Meanwhile, she forecasted that Bitcoin would remain risk-on and outperform gold in 2026. “I really believe we are moving from a rolling recession where we’ve been for the last three years, into a rolling recovery, which we think we are entering now. Then, a productivity-driven boom the likes of which we have never seen before,” Wood concluded. As of this writing, Bitcoin is trading at $94,011, a 3.75% increase in the daily timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|ark invest|bitcoin|bitcoin bear market|Bitcoin Gold Price Forecast|bitcoin price|bitcoin vs gold|btc|BTCUSDT|Cathie Wood|crypto market bull run 2025|crypto market correction|crypto market recovey",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55587078,
    "published": 1765351444000,
    "title": "IMF Flags Stablecoins as Source of Risk to Emerging Markets, Experts Say We Aren't There Yet",
    "body": "The IMF warns that USD-pegged stablecoins could undermine local currencies in emerging markets by facilitating currency substitution and capital outflows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Stablecoins|Markets|IMF|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55588254,
    "published": 1765353650000,
    "title": "Standard Chartered Cuts 2026 Bitcoin Price Prediction By 50%",
    "body": "Standard Chartered has sharply reduced its famously bullish Bitcoin roadmap, cutting its 2026 price target in half and acknowledging that its previous near-term projections were too aggressive, even as it keeps an ultra-optimistic long-term view intact. Standard Chartered Downgrades Bitcoin Price Predictions In a note shared on X by VanEck head of research Matthew Sigel, Standard Chartered argues that Bitcoin’s traditional halving cycle has been overtaken by ETF-driven flows. The bank writes: “With the advent of ETF buying, we think the BTC halving cycle is no longer a relevant price driver. The logic in previous cycles (when US ETFs did not exist) – i.e., prices would peak about 18 months after each halving and decline thereafter – is no longer valid, in our view.” The report adds that it will “take a break of the current all-time high ($ 126,000 on 6 October 2025) to prove that; we expect this to happen in H1-2026.” Related Reading: Bitcoin In An Opportunity Zone? Hash Ribbons Flash New Buy Signal Alongside that shift in framework, the bank re-profiled its multi-year Bitcoin targets. According to the figures shared by Sigel, Standard Chartered has lowered its 2025 forecast from $200,000 to $100,000, its 2026 target from $300,000 to $150,000, its 2027 projection from $400,000 to $225,000, its 2028 estimate from $500,000 to $300,000, and its 2029 prediction from $500,000 to $400,000 while keeping a $500,000 target for 2030. Geoff Kendrick, Standard Chartered’s head of digital assets research, characterises the recent drawdown as painful but not structural. He describes the current phase as “a cold breeze,” explicitly rejecting the notion of a new crypto winter and noting that the magnitude of the pullback remains consistent with corrections seen in past bull cycles. At the same time, he points out that weaker valuations for listed Bitcoin treasury companies have curtailed their ability to act as major marginal buyers, leaving spot ETFs as the primary driver of near-term gains. Related Reading: Bitcoin To Hit $50 Million By 2041, Says EMJ Capital CEO Wall Street Giant Bernstein Agrees The downgrade also lands in the context of a broader rethink on Wall Street. One day earlier, on December 8, Sigel shared a separate note from Bernstein that reached a similar conclusion about Bitcoin’s market structure. Bernstein wrote that “the Bitcoin cycle has broken the 4-year pattern (cycle peaking every 4 years) and is now in an elongated bull-cycle with more sticky institutional buying offsetting any retail panic selling.” Despite an approximately 30% correction, the firm notes that “we have seen less than 5% outflows via ETFs.” On that basis, Bernstein now moves its 2026 Bitcoin price target to $150,000, sees the cycle “potentially peaking in 2027E at $200,000,” and keeps its long-term 2033 target at roughly $1,000,000 per BTC. Both Standard Chartered and Bernstein are converging on the same structural message: the halving alone no longer explains Bitcoin’s trajectory. ETF flows, institutional positioning and balance-sheet dynamics are now the core variables, even if their precise price targets and timelines diverge. At press time, Bitcoin traded at $92,686. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|bitcoin price prediction|Bitcoin Price Prediction 2026|btc|BTC news|btc price|Standard Chartered",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55590806,
    "published": 1765357414000,
    "title": "Binance co-CEO Yi He hit by WeChat hack amid growing Web2 risks for crypto execs",
    "body": "SlowMist’s Yu Xuan advises high-profile users to prune contacts, rotate passwords, and act fast on alerts to reduce WeChat takeover risks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 55590591,
    "published": 1765357251000,
    "title": "NFT Slump Worsens With Monthly Sales Hitting Rock Bottom",
    "body": "A sharp slowdown in buying pushed the NFT market back toward its weakest levels of the year, as weekly and monthly totals fell sharply and overall valuations continued to slip. Related Reading: All-In On XRP: Why This Leading Investor Sold His Entire Bitcoin Stack According to market trackers, trading activity cooled significantly in November and the first week of December, raising fresh questions about demand heading into year end. Sales And Volume Plunge According to CryptoSlam, NFT sales fell to $320 million in November, down from close to $630 million in October. That level is roughly on par with the $312 million recorded in September 2024. Based on reports, the trend did not improve at the start of December: from Dec. 1–7, collections generated about $62 million in sales — the weakest weekly total recorded so far in 2025. Market participants are being hit by lower turnover and fewer big trades. Market Cap Shrinks Dramatically CoinGecko data shows the sector’s market cap sits at $3.1 billion, which is down 66% from a January high of $9.2 billion. Reports have disclosed a steep month-to-month swing as well: values dropped from $6.6 billion in October to $3.5 billion in November, a fall of 46% in roughly 30 days. There was a brief uptick on Nov. 11 when market cap moved from $3.5 billion to nearly $4 billion during a memecoin-driven surge, but the recovery was short-lived and the market cap later retreated back to $3.1 billion. These moves show that prices are still volatile and driven by bursts of speculative interest. Blue Chips Mostly Lose Ground Top collections were not immune. Based on reports, CryptoPunks fell about 12% over the past month. Bored Ape Yacht Club slid 8.5%, while Pudgy Penguins dropped 10.6% in the same period. Art-focused blue-chip works also fell: Chromie Squiggle lost 5.6%, Fidenza declined 14.6%, Moonbirds went down 17.9% and Mutant Ape Yacht Club slipped 13.4%. The biggest fall among major names came from Hypurr, which dropped 48%. Two Collections Show Gains Not every project followed the downward path. Infinex Patrons posted almost 15% rise in the last 30 days, and Autoglyphs outperformed the top ten with a 21% gain. These outliers were lifted by collector interest, and in some cases by the projects’ small supply or unique on-chain history. Still, such gains remain the exception rather than the rule. Related Reading: Institutions Scoop Up 9,000 Ether, Fueling Bullish Signals Outlook As Year Ends The weak start to December suggests the pullback could continue into the close of the year. Liquidity is thinner now, and short-lived rallies driven by other crypto market events have failed to create lasting momentum. Prices were pushed down across a wide set of collections, and trading volumes have not shown a sustained recovery. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|BAYC|Bored Ape Yacht Club|crypto|cryptopunks|NFT|non-fungible tokens",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55591752,
    "published": 1765359057000,
    "title": "The Current Bitcoin Price Pump Will End In A Crash – Here’s When To Start Selling",
    "body": "Over the last few days, the Bitcoin price has fluctuated, but the most prominent moves have been upwards, going from below $90,000 to over $94,000. As expected, this rapid climb already has investors calling for a return of the bull run, but not everyone is convinced. For some, the current Bitcoin price momentum is most likely a bull trap, and crypto analyst Xanrox highlights this in a recent analysis, outlining the best level to start selling the digital asset. Why The Bitcoin Price Risks A Crash To $74,000 Xanrox’s analysis focuses on the bearish formations that have appeared on the Bitcoin price crash following the recent upward move. While many in the crypto community celebrate the rise above $90,000 again, the crypto analyst sounds an alarm that this is the time to go bearish on the cryptocurrency. Related Reading: Why The Litecoin Price Could Stage A 33% Rally To $110 According to the analysis shared on the TradingView website, there has been a clear bear flag formation for the cryptocurrency. This bearish formation is visible on both the 12-hour chart and the 1-Day chart. Regardless, both of these charts point to one possible outcome, and that is an almost perfect textbook bear flag formation. In addition to the bear flag formation, Xanrox also highlights that there is a WXY corrective pattern inside the bear flag. Both of these point to a possible continuation to the initial downtrend that began after the Bitcoin price hit $126,000 back in October. As for how far the current rally could go, the crypto analyst sees it reaching as high as $96,000 before momentum runs out. This presents the “perfect” time to sell or enter a short as the price continues its decline. The target for this is an over 25% crash that will send the price going toward $74,000. Related Reading: Shiba Inu’s Volume Explosion: Leading Meme Coin Barrels Ahead In This Metric The $74,000 target makes an appearance as it is a swing low from April 2024, meaning that crypto traders who are long on the digital asset would have their stop losses below it. Thus, this makes it an attractive point for market makers to push the price towards in order to clear significant liquidity. The timeframe for this to play out is placed over the next few weeks, riding out the end of 2025 and moving into January 2026. However, the swing low support at $74,000, if it holds up, could end up serving as the next bounce-off point for the Bitcoin price. Featured image from Pngtree 42, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 44,
        "NAME": "SHIB",
        "CATEGORY": "SHIB"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55593837,
    "published": 1765362242000,
    "title": "XRP price may grow ‘from $2 to $10’ in less than a year: Analyst",
    "body": "XRP ETFs absorbed 506 million tokens in under a month, strengthening the case that price discovery is likely on the table for 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55594580,
    "published": 1765363277000,
    "title": "Abu Dhabi’s Mubadala Capital explores tokenized private market access",
    "body": "Mubadala Capital teams up with Kaio to test tokenized access to private market strategies, signaling growing sovereign interest in onchain real-world assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55595122,
    "published": 1765364448000,
    "title": "Dogecoin Price Set To Surge As Sellers Show Signs Of Exhaustion",
    "body": "A new technical analysis shared by crypto analyst BitGuru on the social media platform X shows that Dogecoin is trading at an important price level that could set the stage for an upward shift. His chart shows a familiar structure forming at a major support level, one that has acted as the starting point for a previous rally in the year. The price action now developing is similar to this earlier setup, showing that Dogecoin may be preparing for another recovery move above $0.2. Dogecoin Returns To An Important Support Zone Dogecoin has spent the past few weeks trading between $0.13 and $0.15 without a clear path to bullish price action. This recent price action is an extension of a downturn that has been taking effect since mid-September from the $0.3 price level. Related Reading: Pundit Highlights The Condition That Will Trigger A 2,300% XRP Rally To $50 Notably, technical analysis of Dogecoin’s daily candlestick timeframe chart shows that the cryptocurrency is currently positioned on a significant historical support level, the same area that sparked previous rallies. This support is shown on the chart as between $0.139 and $0.141, the lower boundary of a wide accumulation zone, where price repeatedly stabilized before surging. Despite the broader market’s recent weakness, this price support range has held up. Price action in December has led to the creation of a few transition candles on the daily timeframe chart. This, in turn, has led to the creation of a higher low relative to the November breakdown, which had caused Dogecoin to break below $0.135. Dogecoin Daily Candlestick Chart. Source: @bitgu_ru On X Another notable feature highlighted by the analyst is the tight compression forming around Dogecoin’s candles. The chart shows a sequence of narrow movements, indicating that selling momentum has thinned out. BitGuru interpreted this as exhaustion from sellers, meaning the Dogecoin price is no longer displaying the heavy downward pressure seen in November. This type of narrowing range is expected to be the final stage of the downtrend and buyers are beginning to regain control. Buyers Begin To Step In, Mid-Range Target Next Early signs of buyer strength are now visible within this compressed zone. This is reflected in the price action in the past 24 hours, which has seen Dogecoin bounce from its intraday low of $0.14 and increase by 4.1%. That rebound is the first meaningful pushback from buyers after days of bearish activity. Related Reading: Here’s How High The Dogecoin Price Will Go Once The MACD Bullish Cross Happens The projected arrow in BitGuru’s chart points to the mid-range area around $0.188 as the first destination now that Dogecoin is rebounding from its support base. However, another higher price target is highlighted around $0.223 if Dogecoin completes its projected bounce from the support. Depending on how Dogecoin reacts here, a bullish move will target the order block around $0.25, before further price targets at $0.284 and $0.306. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55596197,
    "published": 1765366237000,
    "title": "Crypto Markets Today: Fed Rate-Cut Hopes Lift BTC, ETH as Traders Brace for Volatility",
    "body": "Crypto markets are firm ahead of Wednesday’s Federal Reserve decision, with a 25 basis-point interest-rate cut already priced in.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55596565,
    "published": 1765366871000,
    "title": "Metaplanet Stock Jumps 12% as mNAV Climbs to 1.17, Highest Level Since Crypto Crisis",
    "body": "Bitcoin rebound and equity momentum push Metaplanet valuation multiple to 1.17 to highest level since October.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|MetaPlanet|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55597277,
    "published": 1765368000000,
    "title": "Pineapple Financial Starts Migrating its $10B Mortgage Portfolio Onchain via Injective",
    "body": "The Canadian fintech has already put data tied to about $412 million in funded mortgages onchain, and aims to migrate more than 29,000 loans over time.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Tokenization|Mortgages|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55598292,
    "published": 1765369820000,
    "title": "XRP Breakout Enters Critical Phase As Chart Targets $9–$13 Zone",
    "body": "Crypto analyst Cryptollica published a new XRP/USD 2-week chart on December 8 via TradingView, arguing that the altcoin may be replaying the same structural pattern that preceded its explosive 2017 rally. With current price action pivoting around the key $1.95 level and technical targets projected as high as $9–$13. What Happens If XRP Repeats The 2017 Fractal? The analysis uses a long-range log chart from Binance, where the latest candle in the screenshot shows XRP trading around $2.0892. In this timeframe, the analyst divides XRP’s history into mirrored cycles: 2014–2017 on the left and 2021–2025 on the right, each broken into labeled segments “Part 1,” “Part 2” and “Part 3.” Related Reading: XRP Selloff: Whales Shed Coins Worth $1 Billion In A Week According to Cryptollica, “the cycle experienced by XRP between 2014 and 2017 is almost an identical copy of the current cycle spanning 2021 to 2025.” In both cases, Part 1 is described as an accumulation phase, with XRP suppressed below a dashed blue resistance band for an extended period while forming higher lows along a rising dotted trendline. The current Part 1, roughly 2022–2024, is said to have lasted substantially longer than in the earlier cycle. The analyst cites the rule that “the bigger the base, the higher in space,” arguing that this extended sideways structure signals a large build-up of potential energy. Part 2 is defined as the breakout and retest of that blue resistance band. Once XRP closes decisively above this zone and consolidates there, the chart treats the area as a new support and as confirmation that “the official end of the downtrend and the start of a bull market” has been registered. Cryptollica suggests XRP is now at the final stage of, or has just completed, this breakout phase on the 2-week timeframe. The pivotal reference point for the entire setup is the $1.95 level, drawn in green on the chart. “The $1.95 level, marked in green, is of vital importance,” the analyst writes, emphasizing the classic principle that “once resistance is broken, it turns into support.” In this framework, XRP “currently holding above this level (performing a successful retest) is the most crucial confirmation point for the continuation of the uptrend.” Related Reading: Pundit Highlights The Condition That Will Trigger A 2,300% XRP Rally To $50 If that confirmation holds, the analysis moves to Part 3, labeled the “Parabolic Rise – Discovery Phase.” In 2017, this segment corresponded to a near-vertical advance that pushed XRP into its all-time high zone. Cryptollica argues that XRP now stands “right on the precipice of this ‘vertical lift-off’ in the current cycle,” illustrated by a steep yellow arrow on the logarithmic chart. The first major objective is the region around the prior all-time high at roughly $3.30–$3.84. If the 2017 fractal “plays out precisely,” the post projects an “implied target” between $9.00 and $13.00. The analyst tempers this with several cautions. The crypto market is far larger than in 2017, and a move to $10+ would imply a “colossal market capitalization,” making a repeat of the exact 2017 multiple “mathematically more challenging,” even if “logic often takes a backseat in crypto mania.” The scenario also assumes supportive fundamentals, including the resolution of regulatory overhangs, potential XRP ETF developments and Ripple’s stablecoin strategy. Parabolic phases, Cryptollica warns, are typically accompanied by “sudden drops of 30–40%,” making them “the most dangerous territory for leveraged trading.” The analyst characterizes the overall outlook as “extremely positive (bullish)” as long as the $1.95 support holds, concluding that XRP is at the moment of “breaking its chains” and that, if broader market conditions remain constructive, “double-digit targets ($10+) for XRP are technically on the table.” At press time, XRP traded at $2.07. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|xrp|xrp news|XRP Price|XRP Price Analysis|XRP Technical Analysis",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55599404,
    "published": 1765371600000,
    "title": "Blockstream Connects Lightning and Liquid for Faster, Private Bitcoin Payments",
    "body": "The new update enables trustless swaps between Lightning and Liquid, removing technical hurdles for fast, self-custodial BTC spending, the company said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Blockstream|Lightning Network|Liquid|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55599334,
    "published": 1765371600000,
    "title": "Superstate Rolls Out Direct Stock Issuance for Public Companies on Ethereum, Solana",
    "body": "SEC-registered firms can sell shares directly on blockchain rails to investors, raising funds in stablecoins.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Tokenization|Superstate|Robert Leshner|Ethereum News|Solana News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55599336,
    "published": 1765371600000,
    "title": "TenX Protocols to Start Trading on TSX Venture Exchange After Raising $24M in 2025",
    "body": "The company said it plans to use the proceeds to buy tokens and stake them across networks including Solana, Sui and Sei.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Fundraising|Borderless Capital|Exclusive|Canada|Staking|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55599449,
    "published": 1765371600000,
    "title": "Superstate brings stablecoin-settled stock offerings to Ethereum and Solana",
    "body": "Superstate’s Direct Issuance Programs let SEC-registered companies raise capital on Ethereum and Solana, taking stablecoin payments and issuing tokenized shares instantly.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55600444,
    "published": 1765373705000,
    "title": "Stablecoins break into top 3 growth drivers for Web3 gaming: BGA 2025 report",
    "body": "Stablecoins rank among the top catalysts for Web3 gaming growth, signaling a shift toward fundamentals, monetization and payment infrastructure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 55600426,
    "published": 1765373598000,
    "title": "Morning Minute: JPMorgan Says No Crypto Winter",
    "body": "The macro forces at play will outweigh the recent sell-off drivers, according to the major bank.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Opinion",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 55600286,
    "published": 1765373400000,
    "title": "Helium Expands to Brazil With Mambo WiFi in DePIN Breakthrough",
    "body": "The partnership represents one of Helium’s most significant international expansions so far.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|DePIN|Helium|Solana News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55600330,
    "published": 1765373386000,
    "title": "Ethereum rising to $3.3K proves the bottom is in: Is a 100% ETH rally next?",
    "body": "Ethereum gained between 97% and 147% after ETH price flipped the 50-week MA into support, and a similar setup is playing out this week.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55600209,
    "published": 1765372987000,
    "title": "Japan plans major shift as crypto moves from payments to securities law",
    "body": "Japan plans to move crypto regulation from payments law to securities rules, tightening disclosures for IEOs and cracking down on unregistered platforms.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55601233,
    "published": 1765375259000,
    "title": "More Details On The Wall Street $500 Million Investment In XRP",
    "body": "Ripple’s most recent funding round has become one of the biggest crypto-related deals of the year, mainly because of who joined in and how the deal was structured. According to details shared in Bloomberg’s report, major Wall Street names, including Citadel Securities, Fortress Investment Group, Brevan Howard, and Galaxy Digital, put $500 million into Ripple, giving the company a valuation of around $40 billion. This instantly turned the round into one of the strongest signs yet that traditional finance is taking a serious interest in the XRP ecosystem. How Wall Street Structured The Deal To Protect Themselves In early November 2025, Ripple closed a major private equity round that injected $500 million into the company, resulting in a valuation of roughly $40 billion. However, new details show that the most surprising part of the transaction is not the amount raised but the agreement behind it. Bloomberg reports that investors in this round did not simply buy Ripple shares and hope the value rises. Instead, they secured built-in protections that guarantee them profits later. Related Reading: Here’s The Level That XRP Price Must Reclaim To Trigger Another Surge They were given the right to sell their shares back to Ripple in three to four years at a 10% yearly return, unless Ripple goes public before then. At that rate, Ripple would need to pay roughly $732 million to buy the shares back after four years. That means even if Ripple’s valuation stays flat or drops, the investors still walk away with guaranteed gains. However, if Ripple decides to buy the shares back earlier, the investors get an even higher payout of around 25% annualized rate. A liquidation preference was also included, meaning these investors get paid first if anything goes wrong. Ripple noted in its announcement of the investment round that it has repurchased more than 25% of its outstanding shares over the past few years. Why The Deal Is Really A Bet On XRP Even though the investors bought equity in Ripple, not XRP itself, most of Ripple’s value still comes from its massive XRP holdings. According to Bloomberg, two of the funds that put in money noted that at least 90% of Ripple’s net value is tied to XRP. As of July 2025, Ripple held around $124 billion worth of XRP, although most of its XRP holdings are held in escrow. Related Reading: What’s Happening With XRP And Why Did Its Spot ETF Crash 20%? This means the investment round, in reality, is also a bet on XRP’s long-term relevance and future market strength. If the price of XRP grows, Ripple benefits, and so do the investors who now hold equity backed by a company sitting on one of the world’s largest digital asset reserves. However, the $500 million investment does show that serious investors believe Ripple will continue growing, but just that Ripple’s success is still directly linked to the XRP price. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|bloomberg|Brevan Howard|Citadel Securities|fortress investment group|Galaxy Digital|Ripple|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55601168,
    "published": 1765375200000,
    "title": "Telegram Ring Ran Pump-and-Dump Network That Netted $800K in a Month: Solidus Labs",
    "body": "A Solidus Labs investigation details how an invite-only Telegram group used bots, fake narratives and rapid token deployments across Solana and BNB Chain to manipulate markets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Pump and dump|Telegram|Market Manipulation|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55601252,
    "published": 1765374808000,
    "title": "Crypto Winter Squeezes Bitcoin Miners as AI Pivot Gains Urgency",
    "body": "The crypto downturn has pushed a slew of Bitcoin miners to the brink of unprofitability, prompting operators to scale back the energy-hungry machines that keep the blockchain running.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55600962,
    "published": 1765374607000,
    "title": "Ethereum ETFs Hit Six-Week High as Investors Rotate Within Crypto",
    "body": "Spot Ethereum ETF inflows hit a six-week high, with analysts citing a structural rotation by institutions broadening their crypto exposure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55602160,
    "published": 1765359117000,
    "title": "Solana Hits Liquidity Reset That Preceded Every Major Rally This Year",
    "body": "The index reset to near-zero readings before abruptly turning higher — a shift that triggered weeks of trending price action and rapid rotation into Solana-based altcoins.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Solana News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55602526,
    "published": 1765377587000,
    "title": "Teacher’s Union Says U.S. Senate Crypto Bill Puts Pensions and Economy at Risk: CNBC",
    "body": "The AFT said the bill is “irresponsible” and “reckless,” putting pensions of working families at risk and paving the way for the next financial crisis.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Responsible financial innovation act|U.S. Senate Banking Committee|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 55603394,
    "published": 1765379124000,
    "title": "SpaceX’s $300M Bitcoin Stack Puts Crypto Inside the World’s Biggest Planned IPO",
    "body": "The Elon Musk–run company is moving ahead with plans for an initial public offering that would seek to raise “significantly more than $30 billion.” Even relatively small balance-sheet allocations matter at that scale.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|SpaceX|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55603243,
    "published": 1765378800000,
    "title": "Most Influential: Hayden Davis",
    "body": "Crypto’s Gen Z supervillain may have single-handedly popped the memecoin bubble this year, exposing it as less a cultural movement and more a parasitic financial machine feeding on new entrants.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Memecoin|Javier Milei|Libra|CoinDesk Most Influential 2025|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55603238,
    "published": 1765378800000,
    "title": "Most Influential: The Lazarus Group",
    "body": "The crypto industry’s most notorious hackers continue to break records, highlighting the importance of taking every step possible to secure wallets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|North Korea|Lazarus group|CoinDesk Most Influential 2025|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55603246,
    "published": 1765378800000,
    "title": "Most Influential: The Wrench Attackers",
    "body": "Perpetrators use various tactics, including posing as delivery drivers or waiting at gyms, homes, or hotel rooms, to target victims and demand access to their wallets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "CoinDesk News|Kidnapping|Ledger|CoinDesk Most Influential 2025|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      }
    ]
  },
  {
    "id": 55603237,
    "published": 1765378800000,
    "title": "Most Influential: Rushi Manche",
    "body": "The Movement Labs’ co-founder’s secret dealings and subsequent scandal stoked industry-wide anxieties about opaque token allocations and insider trading.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Tech|Insider Trading|Token Sales|CoinDesk Most Influential 2025|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 55602956,
    "published": 1765378323000,
    "title": "Ether Digital Asset Treasury Companies Outpace Peers as Crypto Tailwinds Build: B. Riley",
    "body": "The bank said ETH-focused DATCOs have outperformed since Nov. 20 as risk appetite improved, mNAVs ticked up and staking-led strategies gained traction.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Digital Asset Treasury|Bitmine|B. Riley|Analysts|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55602877,
    "published": 1765378178000,
    "title": "BONK Slips as Governance Vote Nears, Testing Key Technical Support",
    "body": "The Solana memecoin dipped below the $0.00001000 threshold ahead of a dYdX integration vote, with elevated volume highlighting heightened positioning activity.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Technical Analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 113,
        "NAME": "BONK",
        "CATEGORY": "BONK"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55603953,
    "published": 1765378793000,
    "title": "Norway Central Bank Puts Digital Currency Considerations on Ice",
    "body": "Norway’s central bank sees no need to introduce a digital currency for now, in an assessment that cements the conservative stance of Nordic authorities regarding such instruments.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 55603976,
    "published": 1765379996000,
    "title": "Strategy Pushes Back on MSCI’s Digital Asset Exclusion Proposal",
    "body": "Michale Saylor and team urged MSCI to maintain neutral index standards after a plan to exclude firms with significant digital asset holdings.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|MicroStrategy|Michael Saylor|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55605536,
    "published": 1765382500000,
    "title": "Investors Are Hunting for Countercyclical Value in Privacy Coins",
    "body": "In this week’s Crypto Long & Short Newsletter, Carter Feldman writes that the bear market makes this a prime moment for privacy coins, signaling growing user demand for true financial autonomy. Then, we dive into Ethereum with Andy Baehr’s “vibe check” – when ETH rallies, it may signal something larger is afoot.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "CoinDesk Indices|Privacy Coin|Privacy Coins|CoinDesk Indices|Crypto Long & Short|institutional investor|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55606400,
    "published": 1765383928000,
    "title": "The Significance Of XXI And What It Means For Strategy",
    "body": "XXI and bitcoin balance sheet businesses are adding new methods for accumulating btc into the industry.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55606263,
    "published": 1765383846000,
    "title": "Tether Rolls Out Privacy-Focused Health App as Expansion Into AI Accelerates",
    "body": "The company behind the largest stablecoin, the $186 billion USDT, is increasingly venturing beyond crypto into sectors such as artificial intelligence and robotics.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Tether|AI|Health|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55606301,
    "published": 1765383791000,
    "title": "Teachers union claims risks to retirement funds in crypto market structure",
    "body": "The letter to the US Senate Banking Committee cited opposition to the digital asset market structure bill, echoing concerns from other labor groups.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55607131,
    "published": 1765385281000,
    "title": "ICP Extends Decline as Range Support Breaks, Testing New Lows Near $3.48",
    "body": "Internet Computer slipped back into a declining pattern after early strength faded, with the slide pushing the token toward key December support levels.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Technical Analysis|ICP|Internet Computer|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 82,
        "NAME": "ICP",
        "CATEGORY": "ICP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55607556,
    "published": 1765386000000,
    "title": "Solana Network Sees 68% Crash In 3 Years, What’s Going On?",
    "body": "The Solana network has seen its validator count crash by more than 68% over the past three years, falling from thousands of active nodes to just around 800. The massive decline in validators has sparked discussions about whether this could become a threat to the blockchain network or a natural pruning of inactive nodes to increase efficiency. Solana loses 68% Of Its Validators In 3 Years A new report from Criptonocias reveals that Solana has experienced a dramatic decline in the number of its validators, active and non-active, since March 2023. This decrease has raised concerns across the crypto community about the network’s overall health and security. Related Reading: Why Has The Solana Price Been Crashing Since October? This Major SOL Player Is Selling Over the last three years, the Solana network has steadily lost validators, going from 2,500 to 2,100 in November 2022 and now hovering around 800. This decline means the blockchain has lost a total of 1,700 validators. Although this considerable decrease should trigger warning alerts, it could be a result of ledger pruning, which involves removing inactive or redundant nodes to streamline a network and improve its performance without compromising security. Notably, validators are crucial for the operation of a blockchain network, as they run nodes, confirm transactions, and help maintain the integrity of the system. Each validator adds to the diversity of the network and reduces the risk of any single entity gaining excessive control. According to the report, some voices in the Solana ecosystem see the reduction of validators in a positive light. They argue that losing “Sybil validators,” which are nodes pretending to be multiple independent operators but are actually controlled by a single party, can be beneficial. Based on this perspective, having a smaller number of reliable and active validators is healthier than maintaining thousands of nodes that do not contribute meaningfully to the blockchain network. Criptonocias revealed that teams such as Layer 33, which develops infrastructure node tools and provides network services for Solana, point out that many of the validators leaving the blockchain are not Sybils but legitimate node operators. This suggests that the drop in numbers does not automatically equate to improved network quality despite widespread talks about ledge pruning. Notably, the potential impact on the Solana network, whether negative or positive, depends on the independence of the remaining validators and the distribution of power among them. An updated report of the validator count reveals that it has dropped again from 800 to 795. Solana Faces Liquidity Crunch As Profitability Declines Amidst its decline in validators, the Solana network is showing signs of strain as liquidity dries up and profitability declines. On-chain data from Glassnode highlights a troubling trend in the network’s trading activity, with the 30-day average realized profit-to-loss ratio remaining below 1 since mid-November. Related Reading: Solana Welcomes Bearish December, But Pundit Shares Possible Move To $170 This level is typically associated with bear market conditions and points to a growing imbalance between gains and losses among traders. A ratio below 1 also indicates that traders are realizing losses more frequently than profits, underscoring the cryptocurrency’s weakening market sentiment. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Solana|Criptonocias|glassnode|Sol|SOL news|SOL Price|Solana network|Solana news|Solana Price|SOLUSD|SOLUSDT|Sybils",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55607275,
    "published": 1765385475000,
    "title": "Surf Raises $15M to Build AI Model Tailored to Crypto Research",
    "body": "Pantera Capital led the round, with Coinbase Ventures and Digital Currency Group also participating.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|AI|Fundraising|Pantera|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55607266,
    "published": 1765385432000,
    "title": "Silver Moon: The One Chart You Need To See",
    "body": "Silver is on a parabolic rally. Retail investors are driving the move, much like they did during the recent gold surge, because its price tag feels more accessible.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 55607830,
    "published": 1765386286000,
    "title": "The whale awakening: Why dormant crypto giants are suddenly back in motion",
    "body": "Dormant Bitcoin giants have awakened. Onchain data shows aging wallets reactivating, reshaping supply dynamics across the network.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55608734,
    "published": 1765387800000,
    "title": "Vanguard’s 50M+ clients will soon gain access to crypto ETFs: Why this is significant",
    "body": "Vanguard is opening crypto ETF access to millions of investors. The move reflects a broader 2025 trend of crypto finding its way into investor portfolios.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55610669,
    "published": 1765391752000,
    "title": "Ethereum Has Bottomed, Says BitMine Chairman Tom Lee—Here's Why",
    "body": "BitMine Immersion Technologies Chairman Tom Lee said Ethereum has bottomed—and his firm is aggressively buying as a result.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55611521,
    "published": 1765393253000,
    "title": "Five Ways AI Agents Will Reshape Finance In 2026 (Whether Wall Street Likes It Or Not)",
    "body": "2025 was the year finance flirted with agents. 2026 is when agents stop being tools and become participants—with wallets, strategies, and track records of their own.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55611407,
    "published": 1765393217000,
    "title": "Bitcoin’s Market Structure Strengthens Despite Slower Trading Activity — Here’s Why",
    "body": "Despite a noticeable cooldown in trading volumes, Bitcoin’s underlying market structure has continued to strengthen. The price action has stabilized within a narrow range as long-term holders maintain firm conviction. As more BTC flows into cold storage and supply on exchanges tightens, the market is transitioning from hype-driven swings to steady structural support. How The Price Compression Builds Energy For A Larger Move CIO and founder of MNFund and MNCapital, CryptoMichNL, emphasized that Bitcoin shares a strong correlation with the Nasdaq. While Nasdaq continues to show steady resilience, BTC has stalled behind. This mismatch creates a mispricing and market divergence, which is why the path toward $100,000 remains wide open and why the 4-year cycle thesis doesn’t hold up. Related Reading: Did 2025 Mark A Bear Market For Bitcoin? Predictions Point To A $150,000 Rally In 2026 Recently, BTC saw a massive correction, dropping from $115,000 to $80,000 in just two weeks. During that same liquidation period, what LVisserLabs calls the rotation between Pure Vol vs. Pure Profitability or Beta vs. Quality has fallen sharply. Beta here refers to high-volatility, high-beta stocks, which are essentially tech stocks that drive the markets. Meanwhile, Quality means more risk-off assets, including high-quality, profitable, and stable companies. Currently, BTC has stalled after the sell-off, and the Beta assets have recovered substantially, implying that the stocks have inverted their loss with the big drop and are now grinding upwards, signaling that risk-on appetite is clearly back. With this kind of structural divergence, it’s likely that in the coming weeks or months, BTC will grind upward to $110,000 and $115,000 levels, reversing the drop as the entire correction was a little dubious. CryptoMichNL advised that instead of relying on a time-based sounding the 4-year cycle assumption, it is better to focus on the charts and macro relationships that directly influence BTC price. On-Chain Activity Shows Clear Confidence From Big Money The ambassador of StandXOfficial and the KOL of Binance, who is also an advisor at KOLsAgency, Investor Ucan, has highlighted that the evidence of Bitcoin’s latest upward move is already on-chain. The last six hours have revealed a clear surge of institutional demand. On-chain data shows that Binance purchased 7,298 BTC, Coinbase bought 1,362 BTC, Wintermute bought 2,174 BTC, BlacRock bought 1,362 BTC, and an unknown whale bought 6,192 BTC. In total, 20,438 BTC were purchased in just six hours, valued at approximately $1.9 billion. Related Reading: Bitcoin Settles In Consolidation Zone – Levels To Watch Ucan noted that the timing of this purchase is what stands out. These inflows hit the market hours before the Federal Reserve’s upcoming employment data was released. Institutional is clearly expecting a supportive outcome. A positive print refers to easing expectations and fresh liquidity on the horizon. Retail traders are reacting, and the institutions are anticipating early. If the Fed confirms what these flows imply, today’s buying won’t look like simple momentum, but preparation. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|Binance|bitcoin|Bitcoin news|bitcoin price|BlacRock|btc|BTC news|btc price|btcusd|BTCUSDT|coinbase|CryptoMichNL|fed|federal reserve|Investor Ucan|MNCapital|MNFund|StandXOfficial|Wintermute",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55612044,
    "published": 1765394436000,
    "title": "Paxful Pleads Guilty to Aiding Crime, Ignoring AML Laws",
    "body": "The DOJ said the firm knowingly facilitated illicit trades tied to sex work, sanctions evasion, and fraud, earning millions in fees while ignoring U.S. law.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Paxful|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 55612932,
    "published": 1765395663000,
    "title": "Michael Saylor Slams MSCI Plan to Bar Crypto-Heavy Firms From Indexes",
    "body": "Strategy Inc. Executive Chairman Michael Saylor publicly slammed a proposal to bar the Bitcoin-buying firm from US indexes as “misguided” and “harmful.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NMS:MSTR",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55613223,
    "published": 1765396800000,
    "title": "Why Is The Bitcoin Price Down Again? Analyst Calls Out Trading Desk For Triggering Crashes",
    "body": "Crypto analyst Bull Theory has explained why the Bitcoin price has been crashing recently. The analyst pointed out that Wall Street traders were responsible for the price declines, indicating that these trading desks were manipulating the market for their own benefit. Analyst Explains Why The Bitcoin Price Is Crashing In an X post, Bull Theory blamed Jane Street for the Bitcoin price’s constant crash at 10 a.m. ET when the U.S. market opens. The analyst pointed out that BTC erased 16 hours of gains in just 20 minutes after the U.S. market opened. This has notably been happening since early November, when the flagship crypto fell below $100,000. Meanwhile, a similar price action also played out in the second and third quarters of this year. Related Reading: Confirming The Bitcoin Price Direction: Analyst Reveals What You Should Look Out For Bull Theory noted that another analyst, Zerohedge, has claimed that Jane Street is most likely the entity responsible for this Bitcoin price crash. The analyst stated that the chart shows a pattern that is too consistent to ignore, with a clean wipeout within an hour of the market opening, followed by a slow recovery. He added that this is classic high-frequency execution and that it fits Jane Street’s profile. Bull Theory stated that Jane Street is one of the largest high-frequency trading firms in the world and that they have the speed and liquidity to move markets for a few minutes. The analyst claimed that their behavior is simple: dump BTC at the market open, push the Bitcoin price into liquidity pockets, and then re-enter at a lower price. By doing this, the analyst claimed that Jane Street has accumulated billions in BTC. The trading firm is said to hold $2.5 billion worth of BlackRock’s Bitcoin ETF, which is its 5th-largest position. Bull Theory added that this means most of the dump in the Bitcoin price isn’t due to macro weakness but manipulation by this entity. He expects that BTC will continue its upward momentum once these big players are done buying. Bitcoin At Risk Of A Decline Post-FOMC Crypto analyst Ali Martinez indicated that the Bitcoin price was at risk of a significant decline following today’s FOMC meeting. He pointed out that BTC has consistently reacted negatively to FOMC meetings, with six out of seven meetings this year leading to corrections for the flagship crypto. Related Reading: Bitcoin RSI Shows Shocking Similarities To 2012-2015, But What Happened Last Time? The Bitcoin price had rallied to as high as $94,500 yesterday in anticipation of a third rate cut this year from the Fed. According to CME FedWatch, there is currently a 90% chance that the Fed will lower rates by 25 basis points (bps). A CryptoQuant report noted how these rate cuts have turned out to be a ‘sell the news’ event on the two occasions the Fed lowered rates this year, with the probability of this price action playing out again. At the time of writing, the Bitcoin price is trading at around $92,600, down in the last 24 hours, according to data from CoinMarketCap. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|Ali Martinez|bitcoin|Bitcoin news|bitcoin price|BlackRock’s Bitcoin ETF|btc|BTC news|btc price|btcusd|BTCUSDT|Bull Theory|CME FedWatch|CoinMarketCap|cryptoquant|FOMC Meeting|Jane Street|ZeroHedge",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55613220,
    "published": 1765396800000,
    "title": "A16z Crypto to Open Seoul Office, Hire Sungmo Park to Lead Asia Efforts",
    "body": "Andreessen Horovitz's crypto venture capital unit pointed to high levels of crypto ownership in South Korea and Singapore, and growing onchain activity in Japan.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Seoul|A16z crypto|A16z|Asia|Venture Capital|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55612945,
    "published": 1765396210000,
    "title": "Consumer Groups Join Unions Trying to Derail U.S. Crypto Market Structure Bill",
    "body": "Political progressives have joined forces to oppose current versions of the industry-backed legislative effort in the Senate.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Consumer Protection|Politics|crypto legislation|U.S. Senate|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 55613356,
    "published": 1765397214000,
    "title": "Bitcoin Outlook Post Fed’s 0.25% Rate Cut: Historical Patterns And Predictions",
    "body": "In a move that could signal a bullish shift for Bitcoin (BTC) and the broader cryptocurrency market, the Federal Reserve (Fed) announced a 25 basis points (bps) interest rate cut, bringing the new rate range to 3.5% to 3.75%. Bitcoin Poised To Surge Toward $100,000? Kevin Hassett, the White House economic adviser and a leading candidate to become the next Fed chair, commented to the Wall Street Journal CEO Council that there is “plenty of room” for additional interest rate cuts. He stated, “If the data suggests that we could do it, then — like right now, I think there’s plenty of room to do it.” Hassett, who is President Donald Trump’s preferred choice for the Fed chair position after Jerome Powell’s tenure concludes, has been critical of Powell for being “too late” in lowering rates. Related Reading: Crypto Market Structure Talks: Senator Lummis Addresses Latest Legislation Plans While the last rate cut in October had minimal impact on the Bitcoin price, analyst Michael van de Poppe believes that the current rate cut could significantly benefit the cryptocurrency. He characterized it as a “great move” for Bitcoin and noted that a breakout above $92,000 might be indicative of future bullish momentum. Van de Poppe expressed optimism about Bitcoin’s ability to maintain the support level between $91,500 and $92,000, suggesting that if it does, there could be a pathway for Bitcoin to approach the $100,000 mark. Can BTC Avoid Historical 10% Decline? Market expert Ash Crypto pointed out that historically, each of the last four times the Fed slashed rates by 25 bps, Bitcoin experienced a 5% to 10% decline shortly thereafter. Despite this pattern, Ash noted that the current market setup differs from previous scenarios, suggesting that different dynamics could be at play. Related Reading: Ethereum Price Climbs Toward $3,300 For The First Time Since November: What’s Driving The Surge? Several positive factors underpinning this optimism include the conclusion of quantitative tightening (QT) after a three-year period. Should Powell hint at the possibility of quantitative easing (QE) in his forthcoming remarks, it could spur a further bullish trend in the market. Additionally, with this being the third rate cut, Ash asserted that there is potential for increased liquidity to flow back into the markets, which historically benefits risk assets like Bitcoin. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|BTCUSDT|crypto|crypto market|crypto news|cryptocurrency|fed|Fed Bitcoin|fed interest rate|Fed rate cuts",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55613857,
    "published": 1765398046000,
    "title": "ChronoForge to shut down amid funding collapse and Web3 gaming turmoil",
    "body": "ChronoForge’s shutdown highlights mounting financial strain across Web3 gaming as shrinking budgets and dismal market sentiment take their toll.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55613813,
    "published": 1765397991000,
    "title": "GameStop Stock Falls After Bitcoin Holdings Lose Value, Firm Says It Could Sell BTC",
    "body": "Markets haven’t reacted well to GameStop’s latest earnings call, where it revealed sinking Bitcoin value and retail sales alike.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55614860,
    "published": 1765400414000,
    "title": "Market Stress Intensifies for Solana as Liquidity Drops to Cycle Lows and Volatility Builds",
    "body": "Solana’s (SOL) market structure is entering a tense phase, shaped by thinning liquidity, elevated leverage, and conflicting signals across institutional flows and derivatives markets. Related Reading: The Current Bitcoin Price Pump Will End In A Crash – Here’s When To Start Selling While price movements remain within familiar ranges, the underlying conditions paint a more complex picture, one that traders are watching closely for signs of either exhaustion or a sharp reversal. Recent sessions have seen Solana drift between $128 and $145, with brief rebounds lifting it toward the upper end of this range. However, liquidity indicators suggest a deeper reset is taking shape. Analysts note that these conditions often precede turning points, though they can amplify volatility in the short term. SOL's price trends to the downside on the daily chart. Source: SOLUSD on Tradingview SOL Liquidity Drops to Bear-Market Levels On-chain data shows Solana’s 30-day realized profit-to-loss ratio has stayed below 1 since mid-November. This pattern, more losses being realized than gains, typically marks a liquidity contraction similar to historical bear-market phases. Analysts at Altcoin Vector describe the current setup as a “full liquidity reset,” a process that typically takes several weeks to resolve. That backdrop aligns with observations from SynFutures, whose team cites realized losses, declining futures open interest, and fragmented liquidity pools as contributing factors. Market-makers have also pulled back, thinning order books even as realized volatility increases. The effect is a market highly sensitive to sharp moves, particularly around key liquidation clusters. A notable risk is emerging around the $129 level, where nearly $500 million in long positions would be liquidated if the price retests that zone. With $15.6 million in SOL contracts wiped out in the last 24 hours alone, the market remains vulnerable to cascades. Similarly, exchange balances continue to drop, and spot ETFs have brought in more than $17 million this week, signaling accumulation despite broader stress. Volatility Builds as Derivatives and Spot Activity Diverge Derivatives data reflect a cautious but engaged trading environment. Open interest has climbed back above $7.2 billion, rising in tandem with a rebound in daily volume. This type of build-up during a quiet price phase often signals positioning ahead of a larger move. Long-to-short ratios have shifted bullish in recent days, and funding rates remain positive, although traders are becoming increasingly sensitive to macroeconomic catalysts. Spot markets tell a different story. Liquidity is thin, and deep-cycle reset metrics point to selling exhaustion rather than active expansion. This divergence, characterized by high derivative activity against weakening spot liquidity, typically precedes volatility spikes. Key Solana Levels Ahead as Market Awaits a Cycle Turn Technically, Solana remains stuck between established boundaries. The $145 resistance zone has capped multiple attempts to break higher, while support around $135 and deeper levels near $129 hold significance for traders monitoring liquidation risk. Momentum indicators are stabilizing, and the MACD is edging toward a potential positive crossover. Analysts note that past liquidity resets have been followed by rapid upside moves once conditions improved; however, the timing remains uncertain. Related Reading: NFT Slump Worsens With Monthly Sales Hitting Rock Bottom Currently, Solana sits at the center of a tug-of-war between cautious sentiment, thinning liquidity, and steady institutional flows. Whether these opposing forces resolve into a recovery or further volatility may depend less on price action alone and more on how quickly liquidity returns to the ecosystem. Cover image from ChatGPT, SOLUSD chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Solana|Sol|SOL Price|SOLUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55614652,
    "published": 1765399803000,
    "title": "Tether launches privacy-focused health platform with on-device AI",
    "body": "Tether says the system is designed to give users control over biometric data by keeping analysis and storage off the cloud.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55615133,
    "published": 1765400906000,
    "title": "'National Security' At Risk If MSCI Excludes Crypto Treasuries, Warns Bitcoin Giant Strategy",
    "body": "Bitcoin treasury leader Strategy argued to MSCI that excluding a crypto-buying firms from its indices would hurt America’s national security.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55615734,
    "published": 1765402208000,
    "title": "A Startup Is Trying to Take the Twitter Name From Elon Musk by Force—And It Might Work",
    "body": "Operation Bluebird, led by Twitter's former trademark lawyer, filed to cancel X Corp's Twitter trademarks after Musk abandoned the brand. Will Musk spend millions defending a name he deliberately killed?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 55615556,
    "published": 1765401799000,
    "title": "U.S. Banking Regulator Warns Wall Street on 'Debanking,' Claims Practices 'Unlawful'",
    "body": "The Office of the Comptroller of the Currency probed debanking of certain industries, including digital assets, and said it'll pursue any repeat of such activity.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Office of the Comptroller of the Currency|Banking|Regulation|Donald Trump|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55615551,
    "published": 1765401798000,
    "title": "GameStop Q3 earnings miss estimates, pressured by soft sales and lower BTC gains",
    "body": "Falling sales and diminished Bitcoin gains pressured earnings, with the stock continuing to retrace its brief rally in March.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55616034,
    "published": 1765402712000,
    "title": "Pantera, Coinbase back Surf’s $15M push to build crypto-native AI models",
    "body": "The funding will support Surf’s next AI model aimed at delivering deeper onchain analysis and automating research for crypto companies and traders.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55616759,
    "published": 1765404715000,
    "title": "Crypto Debanking and Efforts to 'Weaponize Finance' Must End, Says Top US Banking Regulator",
    "body": "Major U.S. banks denied services to crypto and other lawful businesses based on industry rather than risk, an OCC preliminary report finds.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55616841,
    "published": 1765404709000,
    "title": "Fed slashes interest rates, but issues mixed forward guidance",
    "body": "A lack of clarity on future interest rate cuts under Jerome Powell's leadership has placed a damper on a Bitcoin price rally, analysts say.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55617144,
    "published": 1765405800000,
    "title": "State Street and Galaxy to Launch Tokenized Liquidity Fund on Solana in 2026",
    "body": "The fund will run on Solana at launch and use PYUSD.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Tokenization|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 191,
        "NAME": "PYUSD",
        "CATEGORY": "PYUSD"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55617060,
    "published": 1765405328000,
    "title": "Crypto CEOs Join U.S. CFTC's Innovation Council to Steer Market Developments",
    "body": "The chief executives of firms such as Gemini and Kraken will pitch in on U.S. policy efforts through the council's future, public discussions.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|U.S. Commodity Futures Trading Commission|Gemini|Polymarket|Kraken|Caroline D. Pham|Regulation|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55616964,
    "published": 1765405209000,
    "title": "Elon Musk's SpaceX Moves Bitcoin Ahead of Potential Record IPO",
    "body": "Elon Musk's private aerospace company SpaceX moved more of its Bitcoin holdings on Wednesday ahead of reported blockbuster IPO plans.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55617954,
    "published": 1765407876000,
    "title": "Official Trump Crypto Game Revealed With $1 Million in Solana Meme Coin Rewards",
    "body": "Trump Billionaires Club on iOS and Android will launch by year's end and offer $1 million worth of the president's meme coin as rewards.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "official-trump||Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55617853,
    "published": 1765407636000,
    "title": "America’s Largest Banks Quietly Embrace Bitcoin Loans, Saylor Says",
    "body": "Michael Saylor, executive chairman of Strategy, told attendees at Binance Blockchain Week that the wall of skepticism inside big banks is breaking down faster than he once expected. Related Reading: All-In On XRP: Why This Leading Investor Sold His Entire Bitcoin Stack He said he had thought it might take four to eight years for major financial firms to move fully into Bitcoin. Now, he says, that timeline is compressing and the shift is visible right away. Banking Giants Reverse Course According to Saylor, the past 12 months have seen heavy hitters — including Citibank, BNY, Bank of America, PNC, JPMorgan, Wells Fargo and Vanguard — shift from hostility to a more welcoming stance on crypto. Reports have disclosed that Vanguard has enabled clients to trade ETF shares linked to XRP and Bitcoin through its platform. Saylor added that internal plans are in motion at several institutions to roll out custody services and credit lines tied to crypto holdings. Loans Backed By Bitcoin Based on Saylor’s remarks, Charles Schwab is preparing to offer Bitcoin custody and to extend credit against BTC as soon as next year, and Citibank is said to be moving in a similar direction. He recalled earlier struggles to secure bank loans using Bitcoin as collateral and said lenders have flipped their approach within roughly six months. According to him, eight of the top 10 US banks are now issuing credit backed by Bitcoin, a claim that highlights how quickly attitudes appear to be changing inside the industry. Political Climate Could Be Speeding Things Up Saylor pointed to policy shifts under US President Donald Trump as a factor that has encouraged banks to leave the sidelines. Many firms were already experimenting with blockchain years ago — Goldman Sachs, for example, issued one of the first Bitcoin-backed loans in 2022 — but a friendlier regulatory tone, he said, has accelerated planning and product development. Still, banks face legal, operational and risk hurdles before these services reach broad retail customers. Markets Watching Fed Announcement Meanwhile, traders and analysts are watching the Federal Open Market Committee. The Fed is expected to cut rates by 0.25%, bringing the target to 3.5%–3.75%, a move that often boosts risk assets like Bitcoin. Volatility is likely around the announcement, and some market players warn that early rallies can reverse quickly when the Fed provides forward guidance. Related Reading: NFT Slump Worsens With Monthly Sales Hitting Rock Bottom Technical Signals And Sentiment Bitcoin’s own moves were discussed alongside the banking story. The crypto fear gauge hit 10 this week, signaling extreme fear, and price rebounded from $86,700 to roughly $92,300. One analyst flagged resistance near $94,200 and suggested a clean breakout could open a path toward $103,000. Another observer noted Bitcoin has lagged the Nasdaq’s recovery, a divergence that could work in either direction if markets shift. Featured image from The Information, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|banks|bitcoin|btc|btcusd|crypto|fed|FOMC",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55618714,
    "published": 1765404348000,
    "title": "Bank of Mexico Maintains Crypto Caution Despite Global Shift",
    "body": "Mexico’s central bank said it will maintain a “healthy distance” between digital assets and the country’s traditional financial system.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55620558,
    "published": 1765415324000,
    "title": "Crypto among sectors ‘debanked’ by 9 major banks: US regulator",
    "body": "The Office of the Comptroller of the Currency said crypto was one of many industries that banks had denied services to, and it could refer its findings to the Justice Department.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55621695,
    "published": 1765418450000,
    "title": "Ethereum Should Be Valued Like Amazon, Says Dragonfly’s Qureshi",
    "body": "Dragonfly managing partner Haseeb Qureshi has sharpened his defense of Ethereum’s valuation, arguing that critics are using the wrong financial framework and that ETH should be analyzed more like an early-stage Amazon than a mature “value” stock. Speaking on the Milk Road Show on 9 December 2025, Qureshi revisited his now-viral valuation clash with investor Santiago “Santi” Santos, hosted by ThreadGuy, which reignited the debate over how to price layer 1 blockchains. At the core of Qureshi’s thesis is a simple but controversial claim: fee revenue on Ethereum is effectively pure margin and should be treated as profit, not as “revenue” in the traditional corporate sense. “Blockchains don’t have revenue. They have profit,” he said. “When chains charge fees, that’s profit. There’s no expenses for a chain. Chains don’t pay expenses, right? There’s no AWS hosting cost for Ethereum.” Qureshi Pushes Back On Claims Ethereum Is Overvalued Santos had argued that Ethereum is trading at “300 plus” times sales, calling these price-to-sales (P/S) levels “embarrassing” relative to traditional companies and suggesting valuations are “way ahead of their skis.” Qureshi did not contest the magnitude of the multiples but rejected P/S as the right lens. Related Reading: Ethereum Sees Largest Binance Inflow Since 2023 – Warning Sign? “He was insisting in the debate that the right way to look at these things is price of sales. So if you look at price sales for Ethereum, it’s something like 380. If you look at Amazon, I think Amazon topped out at price of sales of 42. And this was during the bubble,” Qureshi said. He countered that for a blockchain, what equity investors would call “sales” is closer to the GDP or GMV of the on-chain economy, which is not directly measured at the protocol level. The only clean, observable line is fee income, which he treats as net income. “The sales in some sense is like the GDP of the blockchain which we’re not measuring,” he argued. “The right thing to understand for a chain is the profit… The right thing to understand is what is the profit of Ethereum relative to the profit of Amazon.” That opens the door to the Amazon analogy. Qureshi emphasized that Amazon delayed profitability for almost two decades to prioritize growth, yet public markets still assigned it extremely high earnings multiples. “Amazon literally made no profit, no profit until basically about 20 years in as a business,” he said. “In the year I think it was 2013… Amazon had a PE ratio… over 600 whereas today the PE ratio of Ethereum of course is something like 380.” Because Ethereum’s P/S and P/E converge under his “fees = profit” assumption, Qureshi’s argument is that investors should compare ETH’s 300–380x multiple to Amazon’s P/E history, not to its much lower P/S, if they are going to use a single headline ratio at all. The broader context, he stressed, is that Ethereum and other L1s are still in an exponential build-out phase, more akin to early internet or e-commerce infrastructure than to late-cycle dividend payers. Related Reading: Ethereum Inches Toward A Critical Decision Point: Bullish Break Or Deeper Dive? “This technology has been getting bigger and bigger over time. It’s gobbling up the entire world of finance from where it started,” he said, referencing his essay “In Defense of Exponentials.” “None of [these technologies] started printing a bunch of profit immediately in the first five or even 10 years.” Despite choppy price action and underperformance of altcoins versus AI equities and gold, Qureshi said his conviction in the long-dated Ethereum thesis has increased, not weakened, through the public debate. “If anything, I have become more confident in my view,” he said, adding that nothing material had changed in the last months to justify a major portfolio rethink. “What exactly has changed in the last 2 months between, you know, ETH going to like $4,800 and ETH being at $3,000? The answer is basically nothing.” Shared some post-debate reflections on my L1 debate with @santiagoroel, my rebuttal against the “crypto is all a big casino” doomers, and where I think we are in the crypto macro cycle 👇 https://t.co/9uMJFuLVrX — Haseeb ＞|＜ (@hosseeb) December 9, 2025 For Qureshi, a genuine repositioning would require a clear invalidation of core assumptions—such as a quantum break of cryptography or a structural collapse in on-chain stablecoin demand. Short-term swings, in his view, are simply the pendulum of sentiment moving around a still-fixed fundamental anchor. His message to skeptics is that if markets tolerated Amazon at 600x earnings while it scaled into a dominant platform, dismissing Ethereum at roughly 300–380x on a “too high on P/S” argument alone is analytically inconsistent. At press time, ETH traded at $3,325. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|ETH news|eth price|ethereum|ethereum news|ethereum price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55621721,
    "published": 1765418333000,
    "title": "Hong Kong Cardinal Calls AI a 'Gift From God' as Asian Bishops Mull Ethical Challenges",
    "body": "Regional church leaders met to establish guidelines for the use of AI in ministry, education, and content.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      }
    ]
  },
  {
    "id": 55623413,
    "published": 1765422033000,
    "title": "Solana Enters Bear Territory: Realized Loss Now Outweighs Profit",
    "body": "On-chain data shows the Solana Realized Profit/Loss Ratio has dipped into the loss-taking zone recently, a sign that SOL liquidity has thinned. Solana Liquidity Back At Levels Associated With Bear Markets According to data from on-chain analytics firm Glassnode, Solana liquidity has recently contracted to levels that are typically witnessed in a bear market. There are many ways “liquidity” of a cryptocurrency can be assessed, but here, Glassnode has used the Realized Profit/Loss Ratio. Related Reading: Bitcoin In An Opportunity Zone? Hash Ribbons Flash New Buy Signal This indicator measures, as its name already implies, the ratio between the amount of profit and loss that the SOL investors as a whole are realizing through their transactions. The metric works by going through the transaction history of each coin being sold on the network to see what price it was last moved at. If the previous transaction price was less than the latest selling price for any token, then the indicator considers its sale to have realized a net gain. Similarly, the metric adds transactions to the loss-taking category in the opposite case. The exact amount of profit or loss realized in any transfer is naturally equal to the difference between the latest price and last selling value. The indicator adds up this value for both categories and determines the ratio. Now, here is the chart shared by the analytics firm that shows the trend in the 30-day moving average (MA) of the Solana Realized Profit/Loss over the last few years: As displayed in the above graph, the Solana Realized Profit/Loss witnessed a sharp spike during the price rally in September. This suggests that profit taking saw an explosion. The indicator maintained at high levels for a while, but following the price peak in October, its value went downhill fast. In November, the Realized Profit/Loss breached below the 1 mark as SOL plummeted. A value less than 1 on the metric implies loss realization is outpacing profit taking. Since this breakdown, the indicator has only gone lower inside the loss-taking region, a sign investor capitulation has only been becoming more dominant. Glassnode has noted that the trend signals “liquidity has contracted back to levels typically seen in deep bear markets.” During the 2022 bear market, Solana remained in these conditions for a few months before its price found a bottom. Related Reading: Bitcoin Speculation Muted: Glassnode Analyst Calls Perps A ‘Ghost Town’ It now remains to be seen whether the low liquidity will also persist for the cryptocurrency this time, or if the fall into the loss region is only a temporary one for the indicator. SOL Price Solana surged to $144 on Tuesday, but the coin has seen a fall back to $138. Featured image from Dall-E, Glassnode.com, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Solana|Sol|Solana Bear|Solana Bear Market|Solana Realized Loss|Solana Realized Profit|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55623238,
    "published": 1765421738000,
    "title": "Bitcoin Price Slides From Peak Levels—Is a Bigger Correction on Deck?",
    "body": "Bitcoin price failed to continue higher above $94,000. BTC is now gaining bearish pace and might decline further below $89,500. Bitcoin started a downside correction from the $94,500 zone. The price is trading below $92,000 and the 100 hourly Simple moving average. There was a break below a bullish trend line with support at $91,600 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move down if it settles below the $89,500 zone. Bitcoin Price Dips Again Bitcoin price failed to gain strength for a move above the $94,000 and $94,500 levels. BTC started a downside correction and traded below the $92,000 support. There was a clear move below the 50% Fib retracement level of the upward move from the $87,777 swing low to the $94,583 high. Besides, there was a break below a bullish trend line with support at $91,600 on the hourly chart of the BTC/USD pair. Bitcoin is now trading below $91,200 and the 100 hourly Simple moving average . The price is now approaching the $89,500 support, and the 76.4% Fib retracement level of the upward move from the $87,777 swing low to the $94,583 high. If the bulls remain in action, the price could attempt another increase. Immediate resistance is near the $91,200 level. The first key resistance is near the $91,500 level. The next resistance could be $92,000. A close above the $92,000 resistance might send the price further higher. In the stated case, the price could rise and test the $92,850 resistance. Any more gains might send the price toward the $93,500 level. The next barrier for the bulls could be $94,000 and $94,500. More Losses In BTC? If Bitcoin fails to rise above the $92,000 resistance zone, it could start another decline. Immediate support is near the $89,500 level. The first major support is near the $88,800 level. The next support is now near the $87,750 zone. Any more losses might send the price toward the $86,500 support in the near term. The main support sits at $85,000, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $89,500, followed by $88,800. Major Resistance Levels – $91,200 and $92,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55623907,
    "published": 1765422077000,
    "title": "Bitcoin Slides Below $90,000 After Fed Cut Even as Stocks Rally",
    "body": "Bitcoin slipped in Asia trading hours while other risk assets gained after the US Federal Reserve cut interest rates and expressed optimism about the economy.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55625568,
    "published": 1765425718000,
    "title": "CFTC Innovation Council adds prediction market, exchange CEOs",
    "body": "The CFTC's new CEO Innovation Council includes leaders from crypto exchanges like Kraken and traditional stock exchanges such as Nasdaq to discuss market structure reforms.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55625429,
    "published": 1765425651000,
    "title": "Shiba Inu Declared ‘Dead’—Unless This Game-Changer Arrives, Expert Says",
    "body": "A noted Bitcoin adviser has warned that Shiba Inu faces an uphill climb unless it retakes a prior support band, a call that has stirred debate across crypto social channels. Related Reading: Institutions Scoop Up 9,000 Ether, Fueling Bullish Signals According to posts by BingX Bitcoin adviser Nebraskan Gooner, the token must return above a horizontal region he marked between $0.000014 and $0.00001 to avoid a “dead” outlook. Key Support Level Under Scrutiny Gooner’s chart points to a multi-year zone that once acted as firm support. Reports show SHIB touched that band and later surged to about $0.000045 in early March 2024. The importance of the area is highlighted by the token’s price action: it has spent much of Q4 2025 below that range, and at the time of reporting SHIB was trading around $0.000008618. That places the coin roughly 33–38% below the $0.000013–$0.000014 region that many traders watch as critical. $SHIB Dead unless it reclaims red. pic.twitter.com/LOllFuyPYv — Nebraskangooner (@Nebraskangooner) December 9, 2025 Technical Traders See Trouble Ahead Breaking a long-held support level often flips buying interest into resistance, and that scenario is what traders fear here. Based on reports from market commentators, a failure to climb back into the red band would make upward moves harder and likely sap momentum. Gooner used blunt language, saying “Dead unless it reclaims red” unless the token reclaims the zone. The phrase was repeated widely, feeding both bearish calls and pushback from supporters. Community Response And Roadmap Calls Across social threads, many users argued that SHIB is not unique; several altcoins appear stalled in the current phase. A number of holders said SHIB’s recovery chances may hinge on a wider altcoin rebound, sometimes called altcoin season. According to Zach Humphries, members of the Shiba Inu project must refocus every ecosystem initiative around SHIB, reposition the token to attract renewed retail interest, and publish a clear, actionable roadmap to restore earlier momentum. Bitcoin’s Role In A Possible Comeback Some analysts pointed to Bitcoin as the likely spark for any broad recovery, expecting the alpha coin to rebound toward $125,000 from around $90,000, while others have projected a new peak near $150,000 in 2026. If Bitcoin climbs above $100,000, traders say speculative flows could return and lift meme tokens including SHIB. Related Reading: NFT Slump Worsens With Monthly Sales Hitting Rock Bottom Price Snapshot And What Comes Next Short-term price moves show SHIB up 0.95% in the past 24 hours but down 4.8% over the last week. Many market observers emphasize that a return into the highlighted $0.000014–$0.00001 area would improve technical odds for a rally. At the same time, others warn that even with historical liquidity and a large community, reclaiming a broken support is often difficult and can take time. The coming weeks will likely test whether market-wide momentum or renewed project direction can change SHIB’s path. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|bitcoin|crypto|memecoins|SHIB|Shiba Inu",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 44,
        "NAME": "SHIB",
        "CATEGORY": "SHIB"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55626630,
    "published": 1765427652000,
    "title": "MSCI’s Bitcoin snub is like penalizing Chevron for oil: Strategy CEO",
    "body": "The MSCI Index is consulting on whether to exclude Bitcoin and other digital asset treasury companies that have a balance sheet with more than 50% of their assets in crypto.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 16,
        "NAME": "COMMODITY",
        "CATEGORY": "COMMODITY"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55626566,
    "published": 1765427525000,
    "title": "Why is Bitcoin Trading Lower Today?",
    "body": "Market uncertainty persists due to internal Fed divisions and unclear future rate paths until 2026.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55627066,
    "published": 1765428494000,
    "title": "XRP Price Under Pressure—Can It Survive This Support Test?",
    "body": "XRP price started a fresh decline below $2.10. The price is now struggling and faces resistance near the $2.050 pivot level. XRP price started a fresh decline below the $2.040 zone. The price is now trading below $2.020 and the 100-hourly Simple Moving Average. There is a bearish trend line forming with resistance at $2.050 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move down if it settles below $2.00. XRP Price Dips Again XRP price attempted a recovery wave above $2.120 but failed to continue higher, like Bitcoin and Ethereum . The price started a fresh decline below $2.10 and $2.050. There was a move below the $2.00 support level. A low was formed at $1.993, and the price is now consolidating losses below the 23.6% Fib retracement level of the downward move from the $2.177 swing high to the $1.993 low. The price is now trading below $2.050 and the 100-hourly Simple Moving Average. If there is a fresh upward move, the price might face resistance near the $2.0350 level. The first major resistance is near the $2.050 level. There is also a bearish trend line forming with resistance at $2.050 on the hourly chart of the XRP/USD pair. A close above $2.050 could send the price to $2.085 and the 50% Fib retracement level of the downward move from the $2.177 swing high to the $1.993 low. The next hurdle sits at $2.10. A clear move above the $2.10 resistance might send the price toward the $2.150 resistance. Any more gains might send the price toward the $2.1850 resistance. The next major hurdle for the bulls might be near $2.220. More Losses? If XRP fails to clear the $2.050 resistance zone, it could start a fresh decline. Initial support on the downside is near the $2.00 level. The next major support is near the $1.9850 level. If there is a downside break and a close below the $1.9850 level, the price might continue to decline toward $1.920. The next major support sits near the $1.880 zone, below which the price could continue lower toward $1.820. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $2.00 and $1.9850. Major Resistance Levels – $2.050 and $2.10.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55627522,
    "published": 1765429215000,
    "title": "Strategy Calls For Withdrawal Of MSCI’s Exclusion Plan For Digital Asset Treasury Companies",
    "body": "Strategy, formerly known as MicroStrategy, has expressed strong opposition to a proposal by the Morgan Stanley Capital International (MSCI) to exclude digital asset treasury companies (DATs) from its indexes. Calls For Fair Treatment Of Digital Asset Companies In a recent letter signed by Michael Saylor and the firm’s CEO Phong Le, Strategy highlighted its support for MSCI’s efforts to establish consistent eligibility criteria across its indices. However, the company criticized the proposed threshold for excluding firms with more than 50% digital assets on their balance sheets, calling it “misguided.” The company argued that this measure could have negative implications not only for Strategy’s operations but also for the broader cryptocurrency market. Related Reading: Expert Declares Bitcoin Has Reached Midpoint Of Bear Cycle: What Lies Ahead? Strategy emphasized that, unlike traditional investment funds, it maintains the operational agility to adapt its value-creation strategies in tune with the evolving technology underlying Bitcoin. The firm asserts that this flexibility is a critical asset for investors and distinguishes Strategy and other DATs from traditional digital asset investment vehicles. The firm likened its investment approach in a singular asset class to that of real estate investment trusts (REITs) or oil companies, stating that MSCI categorizes those entities correctly without labeling them as investment funds. Therefore, it argued, DATs should be afforded similar treatment. ‘Discriminatory And Arbitrary’ The letter criticized the proposed 50% digital asset threshold as “discriminatory and arbitrary,” suggesting that it imposes uniquely unfavorable conditions on digital asset companies while allowing other industries—like oil, timber, and real estate—to maintain concentrated asset holdings without similar scrutiny. Strategy raised concerns that enforcing this rule would necessitate MSCI to create new methods for measuring balance sheet concentration, complicating the indexing process unnecessarily due to varying accounting principles across asset classes and jurisdictions. Additionally, Strategy elaborated on how the exclusion of DATs could substantially inhibit innovation within the digital asset industry, which the current administration strongly promotes as part of its economic strategy. The company said that digital assets like Bitcoin have the potential to become foundational elements of global financial systems, but the proposed measures could limit access to these transformative technologies for pension plans and 401(k)s, ultimately redirecting billions away from the sector. Strategy cautioned that a hasty exclusion of DATs could be based on misconceptions about their business models, asserting that it reflects a misunderstanding of the nature of these entities. The firm advocated for a more measured approach similar to MSCI’s past handling of the “Communication Services” sector, which underwent extensive consultation and a thorough review before reorganizing traditional telecom, media, and internet companies. Strategy Urges MSCI To Reconsider If implemented, Strategy warns that MSCI’s proposal could lead to the delisting of numerous companies heavily involved in digital assets. JPMorgan analysts estimate that Strategy alone might face liquidations of up to $2.8 billion as a direct consequence of this exclusion. Such a move is also expected to potentially distort market dynamics by incentivizing Bitcoin miners to sell their assets immediately instead of holding them as part of their business strategy. Related Reading: Ethereum Price Climbs Toward $3,300 For The First Time Since November: What’s Driving The Surge? In light of these concerns, Strategy urged MSCI to withdraw the proposal for excluding companies with over 50% digital asset holdings from its Global Investable Market Indexes. The firm asserted that the proposal is rooted in a flawed understanding of DATs and would impose conditions unaligned with national interests, particularly those advocating for the responsible growth of the digital asset space. As of this writing, the company’s stock, trading under the ticker symbol MSTR, is trading at $185. There has been almost no difference since Tuesday’s trading session amid consolidating crypto prices. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|btc|crypto|crypto market|crypto news|DATs|Michael Saylor|Microstrategy|MicroStrategy news|MSCI index|Strategy|Strategy MSCI|Strategy news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55627543,
    "published": 1765429104000,
    "title": "Bhutan Launches Sovereign Gold-Backed Token on Solana",
    "body": "The launch adds to Bhutan’s broader blockchain push, including Bitcoin reserves, Binance Pay integration and hydro-powered BTC mining.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55627272,
    "published": 1765428508000,
    "title": "A16z Crypto opens office in South Korea as it bets on Asia",
    "body": "A16z Crypto opened its first Asian office in Seoul, South Korea, led by SungMo Park, citing the region’s dominance in global adoption and onchain activity.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      }
    ]
  },
  {
    "id": 55628490,
    "published": 1765430914000,
    "title": "Dogecoin (DOGE) Slips Back Into the Red—Is Momentum Breaking Down?",
    "body": "Dogecoin started a fresh decline below the $0.1450 zone against the US Dollar. DOGE is now consolidating losses and might face hurdles near $0.1420. DOGE price started a fresh decline below the $0.1450 level. The price is trading below the $0.140 level and the 100-hourly simple moving average. There was a break below a key bullish trend line with support at $0.1450 on the hourly chart of the DOGE/USD pair (data source from Kraken). The price could extend losses if it stays below $0.1420 and $0.1450. Dogecoin Price Dips Further Dogecoin price started a fresh decline after it closed below $0.150, like Bitcoin and Ethereum . DOGE declined below the $0.1450 and $0.1420 support levels. More importantly, there was a break below a key bullish trend line with support at $0.1450 on the hourly chart of the DOGE/USD pair. The price even traded below $0.140. A low was formed near $0.1372, and the price is now showing bearish signs below the 23.6% Fib retracement level of the downward move from the $0.1531 swing high to the $0.1372 low. Dogecoin price is now trading below the $0.140 level and the 100-hourly simple moving average. If there is a recovery wave, immediate resistance on the upside is near the $0.1410 level. The first major resistance for the bulls could be near the $0.1450 level and the 50% Fib retracement level of the downward move from the $0.1531 swing high to the $0.1372 low. The next major resistance is near the $0.1495 level. A close above the $0.1495 resistance might send the price toward the $0.1530 resistance. Any more gains might send the price toward the $0.1550 level. The next major stop for the bulls might be $0.1620. More Losses In DOGE? If DOGE’s price fails to climb above the $0.1450 level, it could continue to move down. Initial support on the downside is near the $0.1375 level. The next major support is near the $0.1350 level. The main support sits at $0.1330. If there is a downside break below the $0.1320 support, the price could decline further. In the stated case, the price might slide toward the $0.1250 level or even $0.1240 in the near term. Technical Indicators Hourly MACD – The MACD for DOGE/USD is now gaining momentum in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for DOGE/USD is now below the 50 level. Major Support Levels – $0.1350 and $0.1250. Major Resistance Levels – $0.1420 and $0.1450.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "DOGE|DOGE news|Doge price|DOGE USD|DOGE/BTC|DOGE/USDT|Dogecoin|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55629009,
    "published": 1765431720000,
    "title": "Australian regulator eases rules for stablecoins and wrapped tokens",
    "body": "Australia’s securities regulator has removed licensing requirements for stablecoin intermediaries and approved omnibus accounts, reducing compliance costs.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55629007,
    "published": 1765431623000,
    "title": "GOP hardliners vexed as defense bill advances without CBDC ban",
    "body": "Conservatives in the Republican Party are frustrated that a promised ban on central bank digital currencies didn’t make it into a must-pass defense bill that’s now on its way to the Senate.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 55629753,
    "published": 1765432877000,
    "title": "Gemini Gets CFTC Approval to Launch Prediction Markets in US",
    "body": "The CFTC license will let Gemini offer event contracts in the U.S., joining Kalshi and Polymarket in a booming market.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55629645,
    "published": 1765432848000,
    "title": "Bitcoin Lacks Fresh Momentum As Realized Cap Growth Still Declining",
    "body": "On-chain data shows the Bitcoin Realized Cap Growth indicator has continued to decline recently, a sign new capital inflows lack momentum. Bitcoin Realized Cap Growth Has Been Heading Down Recently As explained by CryptoQuant community analyst Maartunn in a new post on X, the Bitcoin Realized Cap Growth has been trending lower recently. The “Realized Cap” is an on-chain capitalization model for BTC that calculates its total value by assuming the value of each individual token is equal to the spot price at which it was last transacted on the blockchain. Related Reading: Solana Enters Bear Territory: Realized Loss Now Outweighs Profit This is unlike the usual market cap, which simply calculates the total valuation of the asset by multiplying the number of tokens in circulation with the current spot price, considering the latest value of the cryptocurrency to be the one value for all coins. In short, what the Realized Cap represents is the amount of capital that the Bitcoin investors as a whole used to purchase the asset’s supply. On the other hand, the market cap is the value that the investors are carrying in the present. The Realized Cap itself isn’t the indicator of interest in the current discussion, but rather the Realized Cap Growth, measuring the 365-day changes occurring in the Realized Cap. Changes in the indicator naturally reflect the amount of capital exiting or entering the cryptocurrency. In other words, the Realized Cap Growth contains information about the asset’s netflow. Now, here is the chart shared by Maartunn that shows the trend in the 7-day and 59-day moving averages (MAs) of the Bitcoin Realized Cap Growth over the last few years: As displayed in the above graph, the Bitcoin Realized Cap Growth has witnessed both its 7-day and 59-day MAs reverse down recently, with the former line crossing under the latter. The trend indicates that growth in the Realized Cap has been slowing down during the recent market downturn. “This suggests Bitcoin is lacking momentum from new cost basis inflows,” noted the analyst. With the 7-day MA falling below the 59-day MA, the indicator is now flagging the current market to be in a “bear phase.” The last time this signal maintained for an extended duration was alongside BTC’s decline over the first few months of 2025. It now remains to be seen how long momentum from new capital inflows will stay weak for Bitcoin this time around. Related Reading: Bitcoin In An Opportunity Zone? Hash Ribbons Flash New Buy Signal In some other news, the Bitcoin short-term holders are still under a notable amount of stress, as CryptoQuant author IT Tech has pointed out in an X post. Short-term holders (STHs) are defined as the Bitcoin buyers who got into the market during the past 155 days. Despite the rebound BTC has seen since its November low, STHs are still in a loss of 10%. BTC Price At the time of writing, Bitcoin is floating around $92,400, down 1.5% over the last 24 hours. Featured image from Dall-E, CryptoQuant.com, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin inflows|bitcoin momentum|Bitcoin Realized Cap|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55630429,
    "published": 1765434102000,
    "title": "Crypto Drop Wipes Out $370M in Bullish Bets as BTC, ETH Give Back Gains",
    "body": "Binance, Hyperliquid, and Bybit were the most affected exchanges, comprising 72% of all forced unwinds.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]