[
  {
    "id": 55963372,
    "published": 1766032784000,
    "title": "VivoPower eyes $300M Ripple share deal, bagging nearly $1B in XRP exposure",
    "body": "The joint venture aims to source $300 million in Ripple Labs equity for institutional and qualified retail investors in South Korea.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|XRP News|XRP Treasury|Ripple|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55964190,
    "published": 1766034038000,
    "title": "Russia Rejects Crypto As Legal Tender, Finance Official Confirms",
    "body": "According to statements reported by Russian news agencies, Anatoly Aksakov, Chairman of the State Duma Committee on Financial Markets, said cryptocurrencies “will never become money” in Russia and should be treated only as investment instruments. He said that where a payment is required, it must be made in Russian rubles. Related Reading: Ethereum Meets Wall Street: JPMorgan Rolls Out Tokenized Fund Ruble Remains Sole Payment Unit Based on reports, that stance matches existing law. A 2020 federal law on digital financial assets defines digital currency as something different from Russia’s monetary unit and bars its use as a means of payment inside the country. The law treats tokens and classic cryptocurrencies as property or investment items rather than legal tender. Russia Central Bank Concerns Over Stability Officials in Moscow have repeatedly echoed the central bank’s worry that allowing crypto for everyday payments could harm monetary control and financial stability. Regulators say the ruble’s role must be protected, and that volatility in assets like Bitcoin and Ethereum makes them unsuitable for regular transactions. Limited Windows For Crypto Use Reports have also noted that while crypto cannot be used to buy goods and services domestically, it can still exist in regulated pockets. Lawmakers and regulators are framing cryptocurrencies as tradable assets, not cash. Some narrow exceptions are being discussed for corporate or cross-border operations under strict rules, but those do not change the basic ban on domestic payments. What The Law Means For People And Business Practical effects are clear. Russian residents and businesses cannot accept digital coins in place of rubles for sales or services. At the same time, individuals can hold, trade, or invest in crypto under the framework that separates ownership from payment rights. The law also requires public officials to declare holdings in digital assets, linking transparency rules to the new regime. Related Reading: 5,606 Bitcoin: Lightning Network Sets Fresh Capacity Record A Narrowing Path Forward Based on reports from several outlets, the political message is firm: payments stay in rubles. Lawmakers are talking about refining rules for trading, custody and reporting, but they are not signalling a shift toward letting cryptocurrencies replace the ruble for daily use. That position keeps Russia on a different track from some countries that permit crypto payments or give coins legal tender status. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|bitcoin|btc|btcusd|crypto|ruble|russia",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55964083,
    "published": 1766033886000,
    "title": "XRP Price Weakens Sharply—Are Bulls Losing the Fight?",
    "body": "XRP price failed to gain pace above $1.950 and trimmed gains. The price is now struggling and faces resistance near the $1.90 level. XRP price started a fresh decline below the $1.90 zone. The price is now trading below $1.880 and the 100-hourly Simple Moving Average. There is a bearish trend line forming with resistance at $1.9350 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move down if it settles below $1.850. XRP Price Fails At Resistance XRP price attempted a recovery wave above $1.920 but failed to continue higher, like Bitcoin and Ethereum . The price started a fresh decline below $1.90 and $1.880. There was a move below the $1.8650 support level. A low was formed at $1.8473, and the price is now showing bearish signs below the 23.6% Fib retracement level of the downward move from the $1.9865 swing high to the $1.8437 low. The price is now trading below $1.90 and the 100-hourly Simple Moving Average. There is also a bearish trend line forming with resistance at $1.9350 on the hourly chart of the XRP/USD pair. If there is a fresh upward move, the price might face resistance near the $1.880 level. The first major resistance is near the $1.9150 level or the 50% Fib retracement level of the downward move from the $1.9865 swing high to the $1.8437 low. A close above $1.9150 could send the price to $1.9350 and the trend line. The next hurdle sits at $1.950 and the trend line. A clear move above the $1.950 resistance might send the price toward the $2.00 resistance. Any more gains might send the price toward the $2.020 resistance. The next major hurdle for the bulls might be near $2.080. More Losses? If XRP fails to clear the $1.9150 resistance zone, it could start a fresh decline. Initial support on the downside is near the $1.850 level. The next major support is near the $1.8320 level. If there is a downside break and a close below the $1.8320 level, the price might continue to decline toward $1.80. The next major support sits near the $1.7650 zone, below which the price could continue lower toward $1.720. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $1.850 and $1.8320. Major Resistance Levels – $1.9150 and $1.9350.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55964106,
    "published": 1766033765000,
    "title": "Fed Overhauls Bank Policy, Pulls Back From Prior Crypto-Focused Restrictions",
    "body": "The change distances the Fed from policies denounced as Operation Chokepoint 2.0, which state-chartered crypto banks said boxed them out.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55965458,
    "published": 1766035687000,
    "title": "Solana (SOL) Fights to Hold $120—Is the Next Move Lower?",
    "body": "Solana failed to settle above $132 and nosedived. SOL price is now consolidating losses below $130 and might decline further below $120. SOL price started a fresh decline below $130 and $128 against the US Dollar. The price is now trading below $128 and the 100-hourly simple moving average. There is a key bearish trend line forming with resistance at $131 on the hourly chart of the SOL/USD pair (data source from Kraken). The price could start a recovery wave if the bulls defend $122 or $120. Solana Price Dips Again Solana price failed to remain stable above $132 and started a fresh decline, like Bitcoin and Ethereum . SOL declined below the $130 and $128 support levels. The price gained bearish momentum below $126. A low was formed at $121, and the price is now consolidating losses. The price recovered a few points and tested the 23.6% Fib retracement level of the downward move from the $134 swing high to the $121 low. Solana is now trading below $128 and the 100-hourly simple moving average. On the upside, immediate resistance is near the $125 level. The next major resistance is near the $128 level or the 50% Fib retracement level of the downward move from the $134 swing high to the $121 low. The main resistance could be $130. There is also a key bearish trend line forming with resistance at $131 on the hourly chart of the SOL/USD pair. A successful close above the $132 resistance zone could set the pace for another steady increase. The next key resistance is $140. Any more gains might send the price toward the $145 level. Another Decline In SOL? If SOL fails to rise above the $128 resistance, it could continue to move down. Initial support on the downside is near the $122 zone. The first major support is near the $120 level. A break below the $120 level might send the price toward the $112 support zone. If there is a close below the $112 support, the price could decline toward the $105 support in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is gaining pace in the bearish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is below the 50 level. Major Support Levels – $122 and $120. Major Resistance Levels – $128 and $131.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Technical analysis|Sol|Solana|solbtc|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55965227,
    "published": 1766035337000,
    "title": "Bitcoin's Price Ceiling Tightens as Loss-Holders Sell",
    "body": "Bitcoin's brief surge on Wednesday was quickly erased by spot selling, with on-chain data indicating dense supply caps and a lack of demand.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55966910,
    "published": 1766037622000,
    "title": "Ethereum Risks Slide To $2,000 If December Closes Below This Level: Analyst",
    "body": "A cryptocurrency analyst has explained where Ethereum could go next based on a long-term Parallel Channel forming in its monthly price chart. Ethereum Has Been Trading Inside A Parallel Channel For The Last Few Years In a new post on X, analyst Ali Martinez has talked about a long-term pattern that Ethereum has appeared to have been following for the last few years. The pattern in question is a “Parallel Channel” from technical analysis (TA), which forms whenever an asset’s price trades between two parallel trendlines. Related Reading: Bitcoin Could Be Sub-$50,000 By 2028 Without Quantum Fix, Warns Capriole Founder The upper level of a Parallel Channel is likely to facilitate top formations in the asset, while the lower one can act as a support boundary and allow the price to remain above it. Parallel Channels can be of a few different types depending on how the lines are oriented with respect to the graph axes. If the channel has some slope, it falls into either the Ascending or Descending categories. Naturally, it’s the former when the lines are angled upward and latter when they are downward. In the context of the current topic, the simplest type of Parallel Channel is of relevance: a channel that has zero slope. That is, a pattern with lines that are parallel to the time-axis. As an asset trades inside such a channel, it experiences consolidation in an exactly sideways manner. If one of the levels of the pattern break, a sustained continuation of trend may occur in that direction. This means that a surge above the resistance can be a bullish signal, while a fall under support a bearish one. Now, here is the chart shared by Martinez that shows the Parallel Channel that the monthly price of Ethereum has been trading inside for the last few years: As displayed in the above graph, the recent bearish wave in Ethereum has meant that its 1-month price has retraced to the midway line of the Parallel Channel located at $2,930. Martinez has noted that if ETH closes December below this level, a decline to lower levels could occur. The next potential support is situated at $2,000, corresponding to the 25% mark of the Parallel Channel. The cryptocurrency found support around this line in the starting months of 2025. In the scenario that this level also fails, Ethereum may be looking at a fall to the bottom line of the Parallel Channel at $1,090. The asset last retested it back in 2022 and successfully found support. Related Reading: Chainlink’s Top Whales Reverse Course, Quietly Scoop Up $263M In LINK It now remains to be seen how ETH will close out the month and whether one of the next two levels of the pattern will come into play. ETH Price At the time of writing, Ethereum is floating around $2,860, down over 15% in the last seven days. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ethereum|Ethereum Level|Ethereum Parallel Channel|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55966904,
    "published": 1766037618000,
    "title": "Optimism Grows In Crypto Market Structure Bill After Wednesday’s Senate Banking Meeting",
    "body": "On Wednesday, a bipartisan meeting of the Senate Banking Committee, led by Senator Tim Scott, offered a cautiously optimistic outlook for discussions surrounding the anticipated crypto market structure bill. Despite the absence of any markup hearings scheduled for this week, industry representatives and senators engaged in what many considered a productive dialogue regarding the evolving legislative landscape. Senators Collaborate With Industry Leaders Key figures from major crypto firms were among the attendees, including executives from Coinbase (COIN), Kraken, Chainlink, a16z, and Ripple, who have been increasingly involved in discussions aimed at fostering the positive growth of digital assets in the country. According to Eleanor Terret from Crypto In America, the atmosphere of the meeting was described as “constructive and collaborative.” Senators from both parties engaged actively with industry representatives, asking insightful questions and exploring the nuances of the proposed bill text. Related Reading: Cantor Fitzgerald Projects Major Growth For Hyperliquid (HYPE) In Explosive New Report Participating senators included Democrats Mark Warner and Catherine Cortez Masto, who were noted for their engagement and for posing significant questions to both the industry representatives and Senate Banking staff. Three key areas of ongoing negotiation emerged from the discussions: the classification of tokens—distinguishing between securities and commodities, the roles of stablecoin interest versus rewards, and discussions surrounding decentralized finance (DeFi). The meeting’s update follows earlier confirmation from a committee spokesperson that the Banking Committee will not conduct a markup hearing prior to the upcoming Christmas break. Instead, the committee intends to monitor the bill’s progress for potential action in early 2026. Intensified Talks On Crypto Regulation In a statement released earlier this week, Jeff Naft, spokesperson for Chair Scott, emphasized the committee’s commitment to pursuing a bipartisan approach to address the complexities of digital asset market legislation. “Chairman Scott and the Senate Banking Committee have made strong progress,” Naft noted, underscoring continued efforts to establish a new regulatory framework that would enhance clarity for the crypto sector and position the United States as a leader in the digital assets arena. Negotiations have intensified over the past week, with Republican members of the Banking Committee working closely with their Democratic counterparts to seek a viable compromise. Related Reading: SEC Wraps Up Investigation Into Aave Protocol, Confirms CEO Stani Kulechov However, Democrats have also consistently called for additional time in the piece of legislation to address various concerns, particularly regarding financial stability, market integrity, and ethical considerations. Specific ethics concerns have arisen related to President Donald Trump and his family’s involvement in crypto-related business ventures, which reportedly have added to their wealth. As Congress prepares to reconvene after the holiday break, immediate attention will shift to federal government funding, with the current funding bill set to expire on January 30. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto|crypto market|Crypto Market Structure Bill|crypto news|crypto regulation|cryptocurrency|US crypto news|US crypto regulation",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 2,
        "NAME": "AAVE",
        "CATEGORY": "AAVE"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55967306,
    "published": 1766038165000,
    "title": "India's Competition Regulator Clears Coinbase's Minority Stake in CoinDCX",
    "body": "India has cleared Coinbase’s minority stake in CoinDCX, paving the way for the U.S. exchange to expand in the local crypto market.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55971865,
    "published": 1766044807000,
    "title": "Bitwise’s 2026 Crypto Forecast: Bitcoin, Ethereum, And Solana Poised For New Record Highs",
    "body": "In its latest report, asset manager and exchange-traded fund (ETF) issuer, Bitwise, has shared an optimistic 2026 outlook for the crypto market, anticipating significant growth, while predicting new all-time highs for Bitcoin (BTC), Ethereum (ETH), and Solana (SOL). Megatrends In Crypto? Bitwise begins by asserting that Bitcoin is poised to break free from its traditional four-year price cycle, setting the stage for new records. Several factors contribute to this bullish forecast. The dynamics of past cycles, including the Bitcoin Halving, interest rate fluctuations, and market booms and busts fueled by leverage, are expected to be less impactful in the coming years. Related Reading: Bitcoin Bottom Forecast: Top Expert Predicts $40,000 Target Next Year, Here’s The Analysis Notably, the entry of large institutions like Citi, Morgan Stanley, Wells Fargo, and Merrill Lynch into the crypto space is anticipated to accelerate institutional allocations toward spot ETFs and enhance on-chain developments by 2026. As a result, Bitcoin is projected to become less volatile, even indicating that it has demonstrated lower volatility than tech giant Nvidia throughout 2025. The report also expresses strong optimism for Ethereum and Solana, particularly contingent upon the passing of the CLARITY Act. Bitwise believes that the growth of stablecoins and tokenization represents significant “megatrends,” with both Ethereum and Solana positioned to be the primary beneficiaries of this trend. ETFs To Acquire New Market Supply Institutional demand is forecasted to surge, with ETFs expected to acquire more than 100% of the new supply of Bitcoin, Ethereum, and Solana. By 2026, Bitwise expects that most institutional investors will have access to crypto ETFs. As Bitwise projects the new supply hitting the market, estimates indicate roughly 166,000 Bitcoin valued at $15.3 billion, 960,000 Ethereum around $3.0 billion, and 23 million Solana coins amounting to $3.2 billion. However, the firm anticipates that ETFs will likely purchase even more than these figures suggest. The report further highlights that crypto equities are expected to outperform traditional tech stocks. While tech shares have surged by 140% over the past three years, crypto equities have significantly outpaced them. The Bitwise Crypto Innovators 30 Index, which tracks companies providing crucial infrastructure and services for crypto assets, has rocketed by 585% during the same time frame. Bitwise believes this momentum will persist into 2026, driven by potential revenue growth, mergers and acquisitions, and a favorable regulatory landscape. Stablecoins As Scapegoats For Economic Woes As stablecoins gain traction, Bitwise cautions that they may become scapegoats for destabilizing emerging market currencies. Currently valued at nearly $300 billion, the market for stablecoins, which include tokenized versions of the US dollar like USDT and USDC, is predicted to reach $500 billion by the end of 2026. With this rise, it’s anticipated that one or two countries may blame stablecoins for their financial troubles, despite the reality that people would not turn to stablecoins if their local currencies were stable. Related Reading: Cantor Fitzgerald Projects Major Growth For Hyperliquid (HYPE) In Explosive New Report Additionally, Bitwise forecasts the launch of over 100 crypto-linked ETFs in the United States, following the SEC’s issuance of new listing standards that enable these funds to enter the market under a unified regulatory framework. This regulatory clarity sets the stage for what Bitwise dubs “ETF-palooza” in 2026. Lastly, the firm predicts that half of Ivy League endowments will likely invest in cryptocurrencies, and that on-chain vault assets under management will double in the coming years. At the time of writing, Bitcoin was trading at $86,165, having recorded major losses of 2% and almost 7% over the past 24 hours and seven days respectively. Currently, the leading crypto is trading 31.8% below its all-time high of $126,000. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|Bitcoin news|bitcoin price|bitwise|Bitwise crypto report|btc|BTCUSDT|crypto|crypto market|crypto news|cryptocurrency|ETH|ethereum|Sol|Solana",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55973301,
    "published": 1766046776000,
    "title": "Spot Bitcoin ETFs record $450M inflows in ‘early positioning’ push",
    "body": "Spot Bitcoin ETFs logged their strongest inflows in over a month amid renewed institutional demand tied to shifting macro expectations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55975053,
    "published": 1766049349000,
    "title": "JPMorgan’s tokenized dollars are quietly rewiring how Wall Street moves money",
    "body": "The Wall Street titan’s recent embrace of a public blockchain is a harbinger of things to come.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Coinbase|JPMorgan|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55975685,
    "published": 1766050243000,
    "title": "XRP Risks Double-Top Crash Toward $0.40, Peter Brandt Warns",
    "body": "Veteran chartist Peter Brandt is flagging what he calls a “potential double top” on XRP’s weekly chart, a classic reversal setup that, if confirmed, would argue for materially lower prices — even as other traders point to a washed-out weekly RSI reading that has historically aligned with prior bottom zones. Peter Brandt Flags XRP Double Top Pattern Brandt posted the chart to X on Dec. 17 and didn’t bother softening the message for XRP’s online faithful. “I know in advance that all you Riplosts $XRP will forever remind me of this post — ask me if I care,” he wrote, before adding: “This is a potential double top. Sure, it may fail, and I will deal with this if it does. But for now this has bearish implications. Love it or not — you need to deal with it.” The chart shows XRP-USDT on Binance in weekly bars, with two highs clustered around $3.40 and $3.66 and a clearly marked support shelf near $2.00. In classical chart terms, that $2 region functions as the neckline: lose it with follow-through, and the market is no longer in “pullback inside a range” territory — it’s in “failed structure” territory. Related Reading: XRP Price Falls To Critical Support Level, Is It Time To Panic? That distinction matters because double tops tend to be less about the second peak itself and more about what happens at the midpoint low between the two peaks. Brandt’s framing reflects that: the pattern is “potential” until either support holds and price reclaims prior levels, or the neckline breaks and the market accepts lower. In this case, Brandt’s chart is already showing XRP trading below the $2.00 line, with the most recent marker around $1.8859. That puts the focus squarely on whether the breakdown becomes a sustained weekly close-and-hold below support, or whether the move gets reversed quickly enough to treat it as a bear trap. Or Is The XRP Bottom In? Not everyone reading the same tape is leaning into the bearish conclusion. Trader Cryptollica posted a separate XRP/USD weekly chart (Bitstamp) on Dec. 15 highlighting the weekly RSI at roughly 33, accompanied by the comment: “$XRP WEEKLY RSI : 33 💥”. The chart highlights that, in the past five cases, similarly low readings in XRP’s weekly RSI have tended to occur around market bottoming zones. Brandt was receptive to the conditional logic — specifically, the idea that a failed double top can flip from bearish to bullish if the breakdown doesn’t stick. Responding, he wrote: “Yea, if this dbl top fails then this could become exciting. I agree. I am not championing a bear case — just showing charts for what they are.” Related Reading: Best XRP Buy Zone? Analyst Breaks Down The Key Levels That exchange captures the actual tension here. Momentum measures like RSI can identify stretched conditions and recurring historical zones, but they do not, on their own, invalidate a price-structure breakdown. Notably, Brandt did not provide a price target in his comment. But the chart he shared contains enough structure to infer the standard “textbook” projection many technicians would use. With peaks near $3.60 and a neckline near $2.00, the pattern height is about $1.60. The conventional measured move subtracts that height from the neckline after a break, implying a target in the neighborhood of $0.40 if the setup fully plays out. That is not a forecast, and it’s not a promise the market will cooperate — it’s simply the arithmetic implied by the pattern Brandt is pointing at. The more immediate question is whether XRP can reclaim the $2.00 area decisively enough to turn the breakdown into a failed move. If it can’t, the chart conversation shifts from “potential double top” to “confirmed break,” and the downside math stops being hypothetical in traders’ positioning models. At press time, XRP traded at $1.83. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP News|xrp|xrp news|XRP Price|XRP Price Analysis|XRP Technical Analysis",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55977869,
    "published": 1766053511000,
    "title": "XRP’s ‘bearish’ setup may crash price below $1: Analyst",
    "body": "XRP looked increasingly bearish below $2, with multiple indicators suggesting that a downward move toward $1 was possible in the coming weeks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55979443,
    "published": 1766055662000,
    "title": "Kraken-Backed xStocks Brings Tokenized US Equities to Telegram",
    "body": "Kraken-backed xStocks has launched on TON, giving Telegram users access to tokenized U.S. stocks and ETFs through the app’s wallet.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 98,
        "NAME": "TON",
        "CATEGORY": "TON"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55979348,
    "published": 1766055565000,
    "title": "Canton Leads Privacy Coin Rally As Midnight, Zcash, Monero Tick Up",
    "body": "The price movement comes after the DTCC announced it would adopt Canton Network for the issuance of tokenized securities.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "monero|zcash|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 57,
        "NAME": "XMR",
        "CATEGORY": "XMR"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55979231,
    "published": 1766055420000,
    "title": "U.S. bitcoin ETFs see strongest inflows for over a month as BTC dominance hits 60%",
    "body": "Fidelity's FBTC recorded a top five inflow day as the ETFs took in a combined $457 million amid sharp BTC price swings.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Dominance rate|Bitcoin ETF|ETFs|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55979258,
    "published": 1766055345000,
    "title": "Coinbase expands in Poland with Blik mobile payments integration",
    "body": "Coinbase expands in Poland with PPro to support Blik, making crypto transactions faster and easier amid stalled local regulations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55981950,
    "published": 1766059083000,
    "title": "ETHGas raises $12M as Buterin spotlights onchain gas futures",
    "body": "Ethereum blockspace trading platform ETHGas announced a $12 million raise shortly after ETH co-founder Vitalik Buterin endorsed the idea, promising 50ms transaction times.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55981561,
    "published": 1766058608000,
    "title": "Digital Asset Treasuries Draw In $2.6B Amid Crypto Market Uncertainty",
    "body": "Inflows to Bitcoin and Ethereum DATs hit a seven-week high, absorbing over $2.6 billion in the two weeks after the Fed rate cut.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|||Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55982115,
    "published": 1766059538000,
    "title": "Micron crushes earnings with BTC buoyant above $87,000",
    "body": "Blowout Micron results reignite AI optimism, lifting tech futures and stabilising bitcoin even as parts of the AI equity complex remain under pressure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|AI|Coreweave|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55983238,
    "published": 1766061019000,
    "title": "Bitcoin Just Entered Extreme Oversold Levels And Analysts Predict New ATH Targets",
    "body": "Bitcoin (BTC) has entered an extreme oversold phase, with momentum indicators dropping to levels that historically signal market exhaustion and a trend reversal. Researchers tracking macro conditions and long-term price behavior say that the current drawdown reflects a reset in positioning, not the end of the bull market. Based on past recovery patterns, the analyst believes that Bitcoin could soon forge a path toward a new all-time high. Bitcoin Enters Extreme Oversold Territory Thomas Lee, Co-founder and Chief Investment Officer (CIO) of Fundstrat Capital, has flagged Bitcoin’s latest market condition as a key technical development. He pointed to data from Bittel Julien, head of macro research at Global Macro Investor, which highlights how deeply oversold Bitcoin has become within the current cycle and the cryptocurrency’s potential to reach a new ATH. Related Reading: Why This Week Could Be Transformational For The XRP Price In his post on X, Lee publicly commended Julien’s analysis, emphasizing that historically extreme oversold conditions in BTC have often been followed by meaningful bounces. Julien, who also shared his report on X this Wednesday, explained that his analysis responds to frequent requests for updates on a long-running market model that tracks Bitcoin’s behavior following major momentum breakdowns. According to him, the model examines BTC’s average price path after the Relative Strength Index (RSI) falls below 30, a level widely considered to indicate extreme oversold conditions. The analyst stated that Bitcoin’s recent price action has closely followed technical historical patterns, provided the broader bull market structure remains intact. The accompanying chart compares current Bitcoin price behavior with the average historical trajectory observed after the last five instances in which the cryptocurrency entered oversold territory. The point at which RSI declines below 30 is marked as “time zero.” In previous cycles, this moment typically followed a period of stabilization and a strong upward recovery over the following weeks and months. Based on historical averages, Julien sees a potential path toward new all-time highs if Bitcoin continues to track past recovery patterns. While the market researcher cautions that the chart is not perfect, he argues that it remains a useful analytical framework, particularly if the four-year cycle thesis continues to play out. BTC Cycle Could Extend Into 2026 As 4-Year Pattern Breaks Julien’s analysis also suggests that the current Bitcoin cycle could extend well into 2026 and challenge the relevance of the traditional four-year cycle thesis. According to the market researcher, the BTC cycle has never been driven by halving events, contrary to what the broader crypto community believes. Instead, he stated that the cycle is fueled by public debt refinancing, which was delayed by a year after COVID. Related Reading: Private Investment Firm Shares Why XRP Is Their Leading Investment He highlighted that Bitcoin’s four-year cycle is now officially broken due to an increase in the weighted average maturity of the debt term structure. He also noted that liquidity conditions and ongoing interest expense monetization, which far exceed GDP growth, support a prolonged cycle. Furthermore, Julien emphasized that Bitcoin’s price bases usually take time to form and often include periods of volatility before a significant upward move occurs. The market researcher explained that his analysis was not a signal of an immediate market decline but rather a framework that assumes the bull market is still firmly in place. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55984529,
    "published": 1766062871000,
    "title": "North Korean Hackers Have Stolen $2 Billion in Crypto This Year: Report",
    "body": "Attackers from North Korea have swiped over $2 billion worth of crypto so far this year, accounting for 59% of all stolen funds.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55984528,
    "published": 1766062863000,
    "title": "SoFi Unveils Ethereum Stablecoin for Trading and Payments",
    "body": "SoFi Technologies said that it will soon offer its own stablecoin on Ethereum, following the company’s re-entry into crypto last month.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55984404,
    "published": 1766062800000,
    "title": "SoFi unveils the first bank-issued stablecoin for enterprise payments",
    "body": "SoFi Bank becomes the first U.S. national bank to launch a stablecoin, positioning SoFiUSD as a faster, safer alternative to crypto-native tokens.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|SoFi|Stablecoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 55984506,
    "published": 1766062800000,
    "title": "North Korean hackers stole a record $2 billion of crypto in 2025, Chainalysis says",
    "body": "North Korea-linked hackers drove a record year for crypto thefts, favoring rare but massive attacks on centralized services, led by Bybit’s $1.4 billion breach.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|North Korea|Chainalysis|Hack|Crime|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 55984133,
    "published": 1766062383000,
    "title": "Dogecoin and Shiba Inu lag market as memecoins continue to lose ground to bitcoin",
    "body": "Despite increased whale accumulation, both DOGE and SHIB face selling pressure unless they reclaim key technical levels.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 44,
        "NAME": "SHIB",
        "CATEGORY": "SHIB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55983945,
    "published": 1766061991000,
    "title": "Hut 8 price target boosted at Cantor and Canaccord after Google-backed AI deal",
    "body": "Cantor Fitzgerald Analyst Brett Knoblauch expects the bitcoin miner turned AI infrastructure provider to generate $6.9 billion in income from the 15-year lease.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Hut 8|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55984222,
    "published": 1766061324000,
    "title": "Uniswap vote could soon tie UNI token value to its multibillion-dollar trading engine",
    "body": "The proposal would also execute an immediate burn of 100 million UNI from the treasury, worth over $500 million at current rates.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 53,
        "NAME": "UNI",
        "CATEGORY": "UNI"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55985071,
    "published": 1766063567000,
    "title": "Attacker takes over multisig minutes after creation, drains up to $40M slowly",
    "body": "Forensic analysis suggests an attacker took control of a whale’s multisig wallet minutes after creation and has been slowly draining funds since.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55984677,
    "published": 1766062800000,
    "title": "Crypto losses near $3.4B as hackers went ‘big game hunting’",
    "body": "Three major incidents accounted for the majority of crypto losses in 2025, while upgraded security across DeFi protocols managed to keep hackers at bay, according to Chainalysis.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55985675,
    "published": 1766064604000,
    "title": "Bitcoin Washout Points To $180,000 In 90 Days, GMI Says",
    "body": "Global Macro Investor (GMI) head of macro research Julien Bittel posted a bitcoin “oversold RSI” roadmap on X, arguing the market has tracked it closely and tying the setup to a broader view that the cycle could run into 2026—an outlook he says would render the traditional “four-year cycle” framework obsolete. “A lot of people have been asking for an update on this chart, so I’ll just leave this here for anyone who needs to see it,” Bittel wrote, sharing a chart of bitcoin’s average price path after RSI falls below 30, with the RSI breach marked as t=0. “This shows the average BTC trajectory following an oversold RSI reading, with RSI falling below 30 at t=0.” Can Bitcoin Skyrocket To $180,000 In Just 90 Days? Bittel said the overlay has matched the current tape. “So far, it’s been pretty bang on,” he wrote. The “average market path” line rises sharply over the weeks that follow. The chart shows a steep rally within 90 days after t=0, with the BTC price potentially surging near the $180,000 area. Related Reading: From Cycles To Continuity: Why Bitcoin’s 4-Year Pattern May Be Breaking Still, Bittel emphasized the chart is not meant to be a precision forecast. “No, it won’t be perfect,” he wrote, adding that “assuming the bull market isn’t already over, it’s a useful chart to keep in mind.” He also warned that the rebound process can be uneven: “bases can take time to form and usually come with plenty of chop before the bigger up-move kicks in.” He reiterated the conditional nature of the framework in blunt terms. “If you think the bull market is over and we are now facing twelve months of pain, this chart is not for you. Move along…” The bigger point, Bittel said, is that the familiar cycle narrative should not be taken for granted. “Unless you believe the 4-year cycle is still in play, which we don’t, this chart should hold up contextually over time,” he wrote. “As we’ve outlined many times, based on our work on the business cycle, the current path of financial conditions, and our expectations for overall liquidity, the balance of probabilities is that this cycle extends well into 2026.” In that scenario, he added, “the 4-year cycle is dead.” Bittel also challenged the common assumption that bitcoin’s rhythm is fundamentally “about the halving.” “Remember, the 4-year cycle was never about the halving, despite widespread belief that it is, but instead has always been driven by the public debt refinancing cycle,” he wrote, adding that post-COVID that dynamic “was pushed out by one year.” He now argues the cycle is “officially broken” because “the weighted average maturity of the debt term structure has increased.” He framed the macro backdrop in terms of debt-service pressure and liquidity response. “The bigger picture is that there is still a vast amount of interest expense that needs to be monetized, which has far exceeded GDP growth,” Bittel wrote. Reactions across crypto X ranged from enthusiastic to skeptical. The ₿itcoin Therapist replied: “$180,000 BTC in 90 days.” Related Reading: Bitcoin ‘Death Cross’ Panic Returns: History Says It’s A Late Signal LondonCryptoClub (@LDNCryptoClub) said the chart “lines up with our thinking,” tying the narrative to what it called the Fed’s “not QE QE” dynamics and “liquidity games” between the Treasury and the central bank. The account still anticipated turbulence into year-end—“noise and chop into year end (which is negative liquidity)”—before “these fundamental drivers start to see BTC reconnect with the bull trend,” adding that “sentiment appears sufficiently bad for a BTC move higher to be the most hated trade to start 2026!” Others struck a more sardonic tone. “precision-grade hopium here,” wrote doug funnie (@cryptoklotz), while still sketching a conditional path forward: Still think as long as BTC survives (ie doesn’t close in the $70k’s and starts grinding down or accepting there), there’s a plausible path to new highs on the earlier side in 2026. Just need to survive the ‘transition zone’ of 4 year deterministic selloors exhausting, and then ending up in an awkward spot as the music keeps playing.” Capriole Investments founder Charles Edwards was more critical of the statistical grounding, urging a broader test set: “Now re run this with 100 occurrences, not 5 during up only.” For traders, Bittel’s post effectively combines a tactical signal with a regime call: the RSI sub-30 template may map the rebound path, but only “assuming the bull market isn’t already over,” and only in a world where, as he put it, “the balance of probabilities” favors a cycle that “extends well into 2026.” At press time, BTC traded at $87,330. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|bitcoin price prediction|btc|BTC news|btc price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55985848,
    "published": 1766064933000,
    "title": "U.S. inflation data surprises, with CPI higher by just 2.7% in November",
    "body": "Bitcoin rose above $88,000 on the pleasing news as forecasts had been for inflation to continue to run above 3%.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Inflation|CPI|Breaking News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55986997,
    "published": 1766066475000,
    "title": "Bitcoin ETFs Notch $457M Haul, Third-Largest Since October",
    "body": "Bitcoin ETFs saw $457 million in inflows, signaling a 'flight to quality' as capital consolidates around Bitcoin amid Ethereum outflows.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55986995,
    "published": 1766066462000,
    "title": "Fetch.ai Says Its AI Agents Will Overcome Online Retail Barriers Faced by Today’s Tools",
    "body": "The AI developer claims the system, set to launch in January, allows agents to complete payments with credit cards, stablecoins, and FET tokens.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 116,
        "NAME": "FET",
        "CATEGORY": "FET"
      }
    ]
  },
  {
    "id": 55986881,
    "published": 1766066400000,
    "title": "The UAE Isn’t Just Regulating Tokenization — It’s Building Its Economy Around It",
    "body": "As other jurisdictions stall in regulatory debate, the UAE is institutionalizing tokenization, moving it to the core of its economic infrastructure, according to MidChains CEO.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Opinion|UAE|Dubai|Opinion",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55988177,
    "published": 1766068348000,
    "title": "Trump Media stock surges 25% on merger agreement with nuclear fusion firm TAE Technologies",
    "body": "Trump Media and Technology Group has more than 11,500 bitcoin on its balance sheet worth roughly $1 billion at current prices.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Trump|Crypto Stocks|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55987707,
    "published": 1766067581000,
    "title": "CoinDesk 20 Performance Update: Uniswap Surges 8.4% as All Index Constituents Rise",
    "body": "Ethereum (ETH) joined Uniswap (UNI) as a top performer, gaining 3.8% from Wednesday.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "CoinDesk Indices|CoinDesk Indices|CoinDesk 20|charts|Prices|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 53,
        "NAME": "UNI",
        "CATEGORY": "UNI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55988641,
    "published": 1766062800000,
    "title": "Digital Bank SoFi Joins Stablecoin Race With Own Dollar-Backed Token on Ethereum",
    "body": "Digital bank operator SoFi Technologies Inc. has launched its own US dollar stablecoin, joining a growing list of financial firms betting on what is seen as a critical component of the digital asset economy.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "NMS:SOFI",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55989282,
    "published": 1766070005000,
    "title": "Why Is Bitcoin And Ethereum Prices Down Today? BlackRock Deposits Spark Worry",
    "body": "The Bitcoin and Ethereum prices are down today as the crypto market remains in a phase of extreme fear. This latest crash came amid BlackRock’s move, which sparked fear of a sell-off from the world’s largest asset manager. The Bitcoin and Ethereum prices are down today following BlackRock’s transfer of 2,257 BTC and 74,973 ETH to Coinbase, indicating plans to offload these coins. Notably, the BTC and ETH ETFs recorded outflows on December 16, likely why the asset manager moved these coins to redeem shares for its IBIT and ETHA ETFs, which were sold that day. Bitcoin and Ethereum Prices Decline Amid BlackRock’s Transfer These Bitcoin and Ethereum ETFs have continued to record mixed flows, which have partly contributed to declines in BTC and ETH prices. Notably, the Bitcoin price had surged to around $90,000 yesterday from an intraday low of around $87,000, before retracing below $87,000 about an hour later. This immediately sparked theories of manipulation, with some crypto pundits revealing that BlackRock wasn’t the only one selling. Related Reading: The Bearish Structure That Puts Bitcoin Price At $92,550, And Then $82,000 Crypto pundit Kruse claimed that Binance first bought nonstop for over 30 minutes to pump the price, then started dumping millions of BTC and ETH to liquidate longs. He noted that the Bitcoin price pumped about $3,300 in 30 minutes, with $106 million in shorts wiped out during that period. Following that, BTC printed another volatile hourly candle to the downside, which flushed out $52 million in longs. A similar price action had also played out for the Ethereum price. Kruse declared that this wasn’t random volatility but rather liquidity hunting. The pundit further warned that this is how leverage gets punished in crypto. He then reiterated that the volatile Bitcoin and Ethereum price actions weren’t random, indicating the market is being manipulated. Onchain Sleuth Tracer also accused Binance of being responsible for the Bitcoin and Ethereum price declines. He claimed that the crypto exchange pumped and dumped millions of BTC to liquidate traders, with $194 million in shorts and longs liquidated in one hour. BTC And ETH To Hit New All-Time Highs Next Year? Crypto asset manager Bitwise has predicted that the Bitcoin price will break the four-year cycle and set new all-time highs in 2026. The asset manager alluded to factors such as the Bitcoin halving and interest rate cycles as what will drive this rally for the flagship crypto. The firm also remarked that crypto booms and busts fueled by leverage are weaker than in past cycles. Related Reading: Ethereum 2-Year Trend Maps Out This Unique Crash Path To Bottom At $2,187 Bitwise also stated that institutions are likely to allocate more to Bitcoin ETFs, which is why they expect the Bitcoin price to reach new all-time highs next year. Furthermore, the firm noted that the pro-crypto regulatory shift will continue to allow companies to adopt crypto at a faster rate. The crypto asset manager also predicted that the Ethereum price could reach a new all-time high if the CLARITY Act passes. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|Binance|bitcoin|Bitcoin news|bitcoin price|bitwise|BlackRock|btc|BTC news|btc price|btcusd|BTCUSDT|CLARITY Act|coinbase|ETHA|ethereum|IBIT|Kruse|Onchain Sleuth Tracer|spot Bitcoin ETFs",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55989276,
    "published": 1766070000000,
    "title": "Most Influential: Javier Pérez-Tasso",
    "body": "Pérez-Tasso brought Swift into the blockchain age.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|SWIFT|CoinDesk Most Influential 2025|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      }
    ]
  },
  {
    "id": 55989274,
    "published": 1766070000000,
    "title": "Most Influential: Dennis Porter",
    "body": "When it seemed like many of the states came up with the same bitcoin reserve idea at the same time, a campaign driven by Porter deserves some credit for that tide.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Bitcoin Strategic Reserve|CoinDesk Most Influential 2025|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55989368,
    "published": 1766070000000,
    "title": "Most Influential: Will and Dan Roberts",
    "body": "The co-founders and co-CEOs of IREN Limited have transformed the bitcoin mining firm into an AI infrastructure powerhouse.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Bitcoin Mining|AI|CoinDesk Most Influential 2025|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55989364,
    "published": 1766070000000,
    "title": "Most Influential: Gilles Roth",
    "body": "Led by Finance Minister Gilles Roth, Luxembourg in the second half of 2025 became the first of the 20-member eurozone to invest in bitcoin.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Luxembourg|CoinDesk Most Influential 2025|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55989273,
    "published": 1766070000000,
    "title": "PayPal to use PYUSD stablecoin fund AI infrastructure through USD.AI",
    "body": "The move links PayPal’s dollar-pegged token to onchain funding for GPUs and data centers, supported by a $1 billion customer incentive program.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|PayPal|AI|Loans|Financing|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 191,
        "NAME": "PYUSD",
        "CATEGORY": "PYUSD"
      }
    ]
  },
  {
    "id": 55989142,
    "published": 1766069757000,
    "title": "Former Pump.fun Dev Sentenced to Six Years in Prison for $2 Million Solana Fraud",
    "body": "Jarett Dunn, a former developer at Pump.fun, drained $2 million from his then-employer and sent funds to random addresses.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55989771,
    "published": 1766070720000,
    "title": "Coinbase shares rise as ‘ambitious expansion’ wins analyst praise",
    "body": "The event marked a milestone that broadens the platform’s reach across new and traditional assets, the analysts said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Coinbase|Citi|Analysts|JPMorgan|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55989509,
    "published": 1766070103000,
    "title": "Bitcoin hunts liquidity as US CPI inflation drops to lowest since 2021",
    "body": "Bitcoin tagged $89,500 as US CPI data revealed sudden multiyear lows in inflation, but liquidations stayed high as the BTC price spiked.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55990889,
    "published": 1766072441000,
    "title": "Gold, silver shine in debasement trade as bitcoin is left behind",
    "body": "JPMorgan analysts in October said investors betting on currency devaluation would lift precious metals and bitcoin, but only one of those trades has worked.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|market analysis|Bitcoin News|Gold|ByteTree|K33|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55990887,
    "published": 1766072390000,
    "title": "DAWN raises $13M to expand decentralized broadband networks",
    "body": "The decentralized wireless protocol plans U.S. expansion and new international deployments as investors back a user-owned alternative to legacy internet providers.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|DePIN|Internet|Funding Rounds|Polychain Capital|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 55990672,
    "published": 1766072073000,
    "title": "Trump Media Shares Soar Amid Planned $6 Billion Merger With Fusion Power Firm",
    "body": "President Donald Trump's media company is now planning to merge with a fusion power firm as part of a $6 billion all-stock deal.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 55991604,
    "published": 1766073649000,
    "title": "Breakdown Or Bear Trap? BNB Loses Trendline But Flashes Strong Rebound Signals",
    "body": "BNB has slipped below its long-standing bullish trendline, raising fresh concerns about a deeper pullback. However, the selloff is unfolding right into a key support zone, where multiple technical signals hint that buyers may be preparing for a counter-move. With breakdown risk clashing against early rebound signs, BNB now sits at a pivotal moment that could define the next major move. Bullish Trendline Break Signals A Change In BNB Market Character According to crypto analyst Marcus Corvinus, BNB has just experienced a significant structural shift by losing its long-held bullish trendline. This technical break is a critical development that is rapidly changing the market mood from optimism to caution, as a primary support trendline has been invalidated. Related Reading: BNB Rebound Underway? Price Caught Within A Head And Shoulders Pattern The analyst noted that while the price had been respecting this upward trend for a considerable period, this decisive break indicates that buyers are finally losing control. Momentum is visibly cooling off, providing sellers with the necessary opening to press and take command of the short-term price action. Corvinus warned that if the price fails to reclaim the broken trendline, the path will likely open for a much deeper move to the downside. He emphasized that this current behavior appears to be a fundamental shift in market structure rather than just a typical small pullback, suggesting a more prolonged period of weakness. Thus, the market has now entered a caution zone, with the analyst noting that bears are knocking on the door of lower support levels. The next major reaction from the market will be the deciding factor in whether BNB can recover its uptrend or embark on a new, sustained bearish trajectory. Confluence Emerges At Key Support Zone In a recent update shared on X, analyst Batman revealed that BNB is currently carving out a highly attractive long setup. The asset is exhibiting a rare alignment of multiple technical indicators, suggesting that the current price level may serve as a powerful launchpad for the next leg up. Related Reading: Binance Coin (BNB) Extends Pullback as Meme-Coin Rug Pulls Sting BNB Chain This setup is rooted in a confluence of support levels. Specifically, BNB is resting within a strong bullish Fair Value Gap (FVG). This high-interest zone has seen a positive reaction from the market, as the price tapped the 0.618 Fibonacci retracement level. To further bolster the bullish conviction, the momentum oscillators have aligned with the price action. Batman pointed out that the Stochastic indicator has officially formed a bullish divergence followed by a golden cross. Significantly, this combination signals that selling exhaustion has been reached and that buyers may be regaining control, thereby paving the way for a potential sustained price recovery. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BNB|BATMAN|BNB news|BNB Price|BNB price prediction|BNBUSD|bnbusdt|Fair Value Gap|Fibonacci Retracement Level|FVG|golden cross|Marcus Corvinus|Stochastic Indicator",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55991598,
    "published": 1766073600000,
    "title": "CF Benchmarks views bitcoin as portfolio staple, projects $1.4 million price target by 2035",
    "body": "The index provider applies capital market models to bitcoin, arguing institutional adoption supports long-term valuations and structured portfolio allocation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55991600,
    "published": 1766073600000,
    "title": "Crypto for Advisors: Predictions for 2026",
    "body": "Pantera Capital's Paul Veradittakit shares his 2026 crypto predictions: RWA tokenization, AI security advances, a big IPO wave, and the shift to institutional adoption.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "CoinDesk Indices|Financial Advisors|Real World Assets|Predictions|CoinDesk Indices|Crypto for Advisors|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55992127,
    "published": 1766074382000,
    "title": "Bitcoin, Ethereum Rise Following Soft US Inflation Data",
    "body": "Inflation unexpectedly cooled last month, but it remains above the Fed's 2% target.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55992630,
    "published": 1766075139000,
    "title": "FBI Seizes Crypto Exchange Allegedly Used to Launder $70M From Ransomware Attacks",
    "body": "U.S. prosecutors say virtual currency service E-Note moved more than $70 million tied to cybercrime since 2017.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      }
    ]
  },
  {
    "id": 55992944,
    "published": 1766075696000,
    "title": "BONK drops 6.2% as elevated volume marks shift at key technical levels",
    "body": "Speculative token selling accelerated as heavy volume formed near resistance before a sustained pullback.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Technical Analysis|Bonk|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 113,
        "NAME": "BONK",
        "CATEGORY": "BONK"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55994039,
    "published": 1766077232000,
    "title": "Ripple Goes Institutional: What The Doppler Finance And SBI Partnership Means For XRP",
    "body": "Ripple’s push to advance XRP’s institutional relevance took a concrete step forward following a post published by Doppler Finance confirming its partnership with SBI Ripple Asia. The announcement marks a strategic shift from retail-driven narratives to regulated, institution-ready financial infrastructure on the XRP Ledger. The collaboration positions XRP as part of a framework centered on yield generation, compliant custody, and real-world financial integration. Doppler Finance And SBI Ripple Asia To Expand XRP’s Role Beyond Payments The partnership between Doppler Finance and SBI Ripple Asia represents a major evolution in XRP’s role in finance. While XRP has long been valued for fast, low-cost cross-border payments, it has lacked infrastructure for institutional investors to earn a regulated yield. This collaboration aims to change that by developing XRP-based yield products designed specifically for compliance-conscious institutions, creating a pathway for professional investors to use XRP as a productive financial asset. Related Reading: Dogecoin RSI Hits Levels That Have Triggered ATH Rallies Before Unlike experimental DeFi initiatives, this effort prioritizes regulated access, risk management, and compliance. SBI Ripple Asia—a joint venture between SBI Holdings and Ripple—anchors the project within an established financial ecosystem, lending credibility and operational rigor. Notably, this is the first time SBI Ripple Asia has partnered with an XRP Ledger-native protocol, signaling that the focus is on building durable, scalable financial infrastructure rather than marketing hype. Custody and security are central to making these yield products viable for institutional participants. SBI Digital Markets will provide segregated custody for all assets, meeting the strict standards required by asset managers, corporate treasuries, and funds. For traders and institutional users, this means they can access XRP-based yield opportunities without assuming self-custody responsibilities or exposure to smart-contract risks typical in retail DeFi. The framework transforms XRP from a token primarily used for payments into a balance-sheet-compatible asset that can generate regulated returns, opening new avenues for institutional adoption, portfolio diversification, and professional-grade risk management. Strategic Implications For XRP And Ripple In The Broader Market The partnership strengthens XRP’s role in real-world asset tokenization. Doppler Finance and SBI Ripple Asia plan to leverage the XRP Ledger to support regulated financial products tied to tangible value, positioning XRPL as infrastructure for institutional-grade applications beyond digital payments. This approach lays the groundwork for a structured rollout of XRP-based solutions. Related Reading: Why This Week Could Be Transformational For The XRP Price Formalized as a memorandum of understanding, the collaboration signals phased implementation rather than immediate launches. While timelines and yield structures remain undisclosed, the framework reflects clear strategic intent, creating conditions for XRP to expand its role in institutional finance. For XRP, the impact is structural. Combining yield generation, compliant custody, and real-world asset integration broadens its utility in capital markets and reinforces Ripple’s institutional narrative in Asia, where regulatory clarity typically precedes retail adoption. Ultimately, the Doppler Finance–SBI partnership redefines XRP’s value proposition. The asset moves from a transaction medium to becoming an integral part of institutional financial architecture. If executed as intended, XRP’s role in global finance could shift from speed-focused transactions to long-term, durable adoption. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Ripple|ripple news|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55995261,
    "published": 1766078912000,
    "title": "MEV trading returns to court in Pump.fun class-action lawsuit",
    "body": "The lawsuit against the memecoin launch platform Pump.fun, Solana Labs, the Solana Foundation and Jito was amended to include new evidence over MEV trading practices.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55995766,
    "published": 1766079967000,
    "title": "Bitcoin bulls foiled again as price tumbles back to $86,000, giving up CPI gains and more",
    "body": "Far softer than expected inflation numbers Thursday morning had markets racing early, but some are questioning the data.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Market Wrap|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55995483,
    "published": 1766078793000,
    "title": "Bitcoin Volatility Rises Ahead of $23 Billion Options Expiration",
    "body": "Options are showing that Bitcoin is heading into the final weeks of 2025 under intense pressure, with around $23 billion in contracts set to expire next Friday that threaten to amplify already-elevated volatility.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55995435,
    "published": 1766078635000,
    "title": "NYSE Owner Is Said in Talks to Invest in Crypto Firm MoonPay",
    "body": "Intercontinental Exchange Inc., owner of the New York Stock Exchange, is in talks to invest in crypto payments firm MoonPay Inc. as part of a funding round, people familiar with the matter said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "NYS:ICE",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55996324,
    "published": 1766080805000,
    "title": "XRP Enters Historical Window That Has Previously Led To Triple-Digit Rallies",
    "body": "XRP’s weekly chart has entered a technical zone that has repeatedly acted as a turning point in recent years. A recent analysis shared on the social media platform X highlights a recurring relationship between XRP’s price behavior and its 50-week simple moving average, a long-term trend indicator closely watched by traders. Instead of focusing on XRP’s short-term volatility, which has been bearish, the analysis zeroes in on how extended periods below this moving average have coincided with the end of downside phases and the beginning of rally expansions. The 50-Week SMA And Why It Matters For XRP Cycles Technical analysis of XRP’s price action on the weekly candlestick chart, which was posted on the social media platform X by Steph, reveals a repeating cycle around the 50-week simple moving average (SMA). Related Reading: Here’s What To Expect With The XRP Price Trading Under $2 This analysis is interesting because the 50-week simple moving average functions as a structural divider between bearish compression and bullish continuation on higher timeframes. In XRP’s case, previous cycles show that brief dips below this level have not been as significant as sustained stretches beneath it. The XRP price chart below tracks how long XRP stayed below the 50-week SMA before a change in momentum. In the first instance in 2017, XRP spent roughly 10 weekly candles, equivalent to about 70 days, under the moving average before staging a sharp upside move. A similar pattern appeared in the 2021 cycle, where the duration was shorter, with 49 days, but still acted as an inflection point on the weekly chart. However, the most aggressive move highlighted on the chart came in the 2024 period, where XRP traded below the 50-week SMA for about 84 days before posting a much larger rebound of about +850%. XRP Sitting Inside The Same Window Once Again According to the analysis, XRP is currently approaching about seventy days below the 50-week SMA, placing it squarely within the same historical window observed in prior cycles. Particularly, Steph noted that XRP has now spent roughly 70 days below the 50-week SMA again, and this places an outlook on what to look for in the next price action. Related Reading: Crypto Analyst Predicts How Low The XRP Price Will Go Before Bouncing Resulting price action in the past has seen XRP rallying anywhere from 70% in 2021 to 850% in 2024. If XRP resolves to the upside again from the current structure, history suggests the initial signal would be a decisive weekly reclaim of the 50-week SMA, followed by continuation rather than an immediate rejection. Featured image from Pngtree, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Ripple|Simple Moving Average|SMA|Steph|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55996087,
    "published": 1766080434000,
    "title": "Bitcoin's 'realized cap' holds at record high over $1 trillion, casting doubt on four-year cycle",
    "body": "A very supportive macro backdrop is being ignored for now, said Bitwise's Andre Dragosch.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Glassnode|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55996718,
    "published": 1766081463000,
    "title": "SEC Says Third-Party Bitcoin Mining Services Are Securities Offerings in New Lawsuit",
    "body": "The SEC charged a Philadelphia-based Bitcoin mining entrepreneur with running an illegal securities scheme and misappropriating over $48 million of customer funds.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55996814,
    "published": 1766081278000,
    "title": "SoFi rolls out US dollar stablecoin issued by bank subsidiary",
    "body": "Issued by SoFi Bank, the dollar-backed token is designed for payments and settlement across banks, fintechs and enterprise platforms.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 55997153,
    "published": 1766082159000,
    "title": "ECB’s Christine Lagarde shifts focus to digital euro rollout after holding rates",
    "body": "With technical and preparatory work complete, the ECB pressed lawmakers to move quickly on Europe’s public digital currency amid global stablecoin concerns.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|ECB|European Central Bank|Christine Lagarde|Digital Euro|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 55998526,
    "published": 1766084429000,
    "title": "XRP Faith Hits New Highs As Long-Term Holders Talk Of Historic Endgame",
    "body": "Reports have circulated across social channels this week after a prominent XRP commentator warned critics that they may be underestimating the token’s long-term role in finance. Related Reading: 5,606 Bitcoin: Lightning Network Sets Fresh Capacity Record According to a post on X by user UnknowDLT, XRP’s place in global payment rails was “planned more than a decade ago,” and the token could one day become “the most valuable asset in the world,” a claim that has stirred both debate and disbelief. Community Voice Turns Loud Supporters in the XRP community have long argued that market prices miss bigger shifts. Based on reports from prominent community accounts, followers say short-term trading noise hides structural moves that could lift demand for XRP over many years. One commentator, X Finance Bull, has suggested that Ripple’s escrow — which holds 34.4 billion XRP — will act as locked liquidity for banking corridors and institutional use, not as stockpiled supply destined for retail dumps. The world is NOT ready for what is coming for XRP. It was planned more than a decade ago, it is going to be the most valuable asset in the world. There will be war for your XRP. People keep laughing at XRP. They will end up crying for life, the end will be tragic for them. — {x} (@unknowDLT) December 15, 2025 Regulatory Moves And Institutional Aims Ripple’s recent regulatory steps are central to the bullish case. Reports have disclosed that the company received conditional clearance from the Office of the Comptroller of the Currency to pursue a national trust bank charter, and that it is seeking a Federal Reserve master account. Community analysts argue those developments, if fully realized, would move Ripple closer to mainstream financial plumbing and could change how markets view token supply and institutional demand. $XRP HOLDERS 🚨🚨🚨 If you’re thinking about selling your $XRP right now, THINK AGAIN! Remember this? Brad Garlinghouse confirmed the CLARITY Act is expected in early 2026. That’s not a maybe. That’s a countdown. And when it passes, Ripple will be forced to declare the fate of… https://t.co/s1E2KnarnM pic.twitter.com/C4xAcKDltR — X Finance Bull (@Xfinancebull) December 15, 2025 Some supporters also point to a possible US Clarity Act as a legal milestone, with a timeline floated by some voices for passage in the first half of 2026. Tokenization And Big Numbers Analysts and company projections are being used to sketch wider potential. Ripple has suggested the tokenization market could grow to $19 trillion by 2033. Other commentators take that figure and run scenarios: if a slice of that activity used the XRP Ledger, price forecasts can balloon — with one cited bullish figure at $189 per XRP under high-adoption cases. Some community voices expect large-scale tokenization momentum to build between 2026 and 2027, which they say would favor high-throughput ledgers like XRP’s. Related Reading: Ethereum Meets Wall Street: JPMorgan Rolls Out Tokenized Fund Numbers And Forecasts Not everyone shares the same optimism. Several firms mentioned by community members put much lower targets on XRP, with conservative models forecasting prices under $30 by 2030. Other professional models place $100 XRP well beyond the next decade. Traders and investors are left to weigh three competing threads: legal clarity, technical capacity, and whether escrowed holdings will be used for institutional flows rather than sold. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|bitcoin|CLARITY Act|crypto|memecoins|xrp",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55998473,
    "published": 1766084279000,
    "title": "Intuit to Integrate USDC Stablecoin Across TurboTax, QuickBooks",
    "body": "Fintech firm Intuit is working with Circle via a multi-year strategic alliance that will see USDC used across the firm's products.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55998195,
    "published": 1766083810000,
    "title": "Bitcoin Bounces Back Following Tepid Inflation Report",
    "body": "Bitcoin prices recovered on Thursday, December 18, bouncing back from the previous day’s decline after inflation figures came in lower than expected.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55998799,
    "published": 1766084735000,
    "title": "Bitcoin Policy Institute reps sound alarm on de minimis tax exclusion",
    "body": "US lawmakers are only considering de minimis tax exemptions for dollar-pegged stablecoins, according to Bitcoin Policy advocate Conner Brown.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56000693,
    "published": 1766088046000,
    "title": "Fading ETF Interest Puts Pressure on Dogecoin as Price Approaches Critical Cost-Basis Zone",
    "body": "Dogecoin (DOGE) is approaching a sensitive phase as weakening investor demand, stalled ETF inflows, and growing sell-side pressure converge near a key price area. Related Reading: XRP Risks Double-Top Crash Toward $0.40, Peter Brandt Warns Once driven largely by retail enthusiasm, the meme coin is now trading closer to levels where a significant share of holders last acquired their tokens, raising questions about downside risk if confidence continues to erode. At the same time, isolated whale accumulation and long-term cost-basis data suggest the market is approaching a zone that could define the next major move. DOGE's price trends to the downside on the daily chart. Source: DOGEUSD on Tradingview Dogecoin ETF Inflows Stall as Sentiment Softens One of the clearest shifts in Dogecoin’s recent market structure has been the loss of momentum in its exchange-traded funds. Data shows that the Grayscale and Bitwise DOGE ETFs have not recorded any inflows since December 11, with total inflows since launch standing at roughly $2 million. Combined assets under management are around $5.2 million, representing a negligible fraction of Dogecoin’s overall market capitalization. The muted response contrasts sharply with other altcoin ETFs, particularly XRP and Solana products, which have attracted hundreds of millions of dollars in inflows. The lack of sustained interest has raised questions about the long-term viability of DOGE-focused funds, especially given their low revenue potential at current asset levels. More broadly, the ETF slowdown reflects a risk-averse environment, with the crypto Fear and Greed Index remaining in fear territory. On-Chain and Derivatives Data Point to Bearish Bias Beyond ETFs, on-chain metrics show declining participation from large holders. Wallets holding between 100 million and 1 billion DOGE have reduced their balances by over 1 billion tokens since early December. Similarly, the proportion of DOGE supply in profit has slipped to near 50%, suggesting fewer holders are sitting on unrealized gains. Derivatives markets reinforce this cautious outlook. Short positions now account for more than half of open DOGE derivatives, while over $5 million in long positions were liquidated in a 24-hour period. Open interest has also declined, pointing to reduced speculative appetite rather than aggressive dip-buying. Price Near Key Support as $0.10 Comes Into Focus Technically, Dogecoin is trading near the $0.123–$0.126 range, an area that has repeatedly acted as support since April. The price remains below key moving averages, with momentum indicators such as MACD and RSI signaling continued downside pressure. A decisive break lower could expose the psychological $0.10 level. Related Reading: Ethereum Risks Slide To $2,000 If December Closes Below This Level: Analyst Analysts have also projected deeper historical support near $0.074, where roughly 28 billion DOGE last changed hands. While a move to that level would require further deterioration in sentiment, current conditions suggest Dogecoin is approaching a cost-basis zone that could determine whether sellers remain in control or longer-term holders begin to step in. Cover image from ChatGPT, DOGEUSD chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|Doge price|dogecoin price|dogeusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56000687,
    "published": 1766088000000,
    "title": "What if crypto's U.S. market structure effort just never gets there?",
    "body": "Guessing the direction of Congress is akin to long-range weather prediction, with so many variables in play, and the industry's fate depends on a break in the storm.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "News Analysis|U.S. Senate|Senate Banking Committee|Regulation|crypto legislation|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56000547,
    "published": 1766087785000,
    "title": "XRP slumps as bitcoin once again falls back to $85,000 level after surge",
    "body": "Crypto markets swung sharply Thursday following a softer-than-expected U.S. CPI print, which briefly lifted bitcoin above $89,000 during U.S. hours.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56003677,
    "published": 1766092917000,
    "title": "NYSE parent in talks to invest in crypto company MoonPay: Report",
    "body": "The discussions follow Intercontinental Exchange's $2 billion investment in prediction platform Polymarket in October.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56004362,
    "published": 1766094415000,
    "title": "Altcoins plunge as bitcoin's $85,000 test triggers $550 million in liquidations",
    "body": "Solana tumbled below $120 to its weakest price since April, while SUI, DOGE and ADA also fell sharply.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Market Wrap|Solana News|Altcoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56004020,
    "published": 1766093637000,
    "title": "SOL price action lags the wider altcoin market: Is Solana’s heyday over?",
    "body": "SOL falls behind multiple altcoin competitors as its onchain activity, fee and DApp revenues slump. Cointelegraph explains why.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56004807,
    "published": 1766095248000,
    "title": "Federal Reserve Revamps Bank Crypto Rules, Opening New Channels for Digital Asset Trading",
    "body": "The U.S. Federal Reserve has taken a notable step in reshaping how banks under its supervision can engage with crypto, reversing guidance introduced in 2023 that had sharply limited such activities. Related Reading: XRP Risks Double-Top Crash Toward $0.40, Peter Brandt Warns The decision reflects a broader reassessment inside the central bank about how regulation should adapt to financial innovation, especially as digital assets continue to intersect with traditional banking infrastructure. Under the earlier framework, uninsured state-chartered banks were required to follow the same constraints as federally insured institutions in order to remain under Federal Reserve supervision. That approach effectively barred some crypto banks from accessing core payment systems or Federal Reserve membership. BTC's price trends to the downside on the daily chart. Source: BTCUSD on Tradingview What the Policy Shift Changes for Banks The new guidance establishes a formal pathway for both insured and uninsured banks supervised by the Federal Reserve to pursue certain innovative activities, including those related to cryptocurrencies. Institutions will still be required to meet supervisory and risk-management standards, but they will no longer be automatically excluded based on their business models. For uninsured banks, the implications are significant. Access to Federal Reserve membership would allow direct settlement through central bank payment systems rather than reliance on intermediary banks. This idea could lower operational frictions for crypto custody, settlement, and related services, potentially expanding the role of banks in digital asset markets without changing existing safety and soundness expectations. Custodia Case Highlights Regulatory Tensions The policy reversal has renewed attention on Custodia Bank, a crypto-focused institution whose application for a Federal Reserve master account was denied in part due to the now-rescinded guidance. Custodia CEO Caitlin Long has argued that the 2023 policy effectively blocked lawful access to the Fed’s infrastructure and welcomed its withdrawal as a correction of past regulatory overreach. Not all policymakers agree. Federal Reserve Governor Michael Barr dissented from the decision, warning that loosening the framework could undermine a level competitive playing field and encourage regulatory arbitrage. Michael Barr’s position highlights the ongoing debate within regulatory circles over how to strike a balance between innovation and financial stability.r Broader Implications for Crypto Markets While the Fed’s move does not directly change how cryptocurrencies such as Bitcoin or Ethereum trade, it may influence market structure over time. Easier access for banks could support deeper institutional participation, greater liquidity, and expanded custody and settlement options. Related Reading: Ethereum Risks Slide To $2,000 If December Closes Below This Level: Analyst For now, the shift signals a more flexible regulatory posture, one that acknowledges the rapid evolution of digital asset markets and the banks that seek to serve them. Cover image from ChatGPT, BTCUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|bitcoin price|btc|btc price|btcusd|crypto",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56004847,
    "published": 1766095146000,
    "title": "Coinbase appoints ex-UK finance minister George Osborne to chair advisory council",
    "body": "Osborne began advising Coinbase in 2024 and has been critical of the UK government's lack of robust digital asset regulations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56004463,
    "published": 1766094412000,
    "title": "Brazilian stock exchange to launch tokenization platform and stablecoin",
    "body": "A representative from Brazil's stock exchange, B3, said the stablecoin would be “a tool to enable trading in tokens,\" which it planned to offer in 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 56004639,
    "published": 1766094300000,
    "title": "Charles Hoskinson Talks Trump's Impact on Crypto",
    "body": "Charles Hoskinson comments on Trump's meme coin, the president's impact on crypto, and how the government ruined the super cycle:“The minute that Trump Coin got launched. It went from ‘crypto is bipartisan’ to ‘crypto = Trump = bad = corruption.'\"",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56005074,
    "published": 1766095656000,
    "title": "Charles Hoskinson: Trump Crypto Ventures Have Been 'Frustrating'—But Others Won't Talk About It",
    "body": "The Cardano founder said Trump’s meme coin launch and politicization of crypto hurt the industry’s long-term prospects ahead of the 2026 midterm elections.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56004958,
    "published": 1766094900000,
    "title": "Charles Hoskinson Critiques US Government on Crypto Objectivity",
    "body": "Cardano’s Charles Hoskinson says the U.S. government needs much more rigorous testing when it comes to deciding which cryptocurrencies are considered valuable and which are not.“Why is XRP in the system but not Sui? Why is Solana in the system but not BNB? Can we objectively answer that against some metric?”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56005933,
    "published": 1766097149000,
    "title": "Crypto CLARITY Act set for Senate markup in January, says Sacks",
    "body": "White House AI and crypto czar David Sacks said the CLARITY Act will reach the Senate next month for debate and amendment before a full vote.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56006665,
    "published": 1766098818000,
    "title": "Solana Value Proposition Extends Beyond Tech Into Economic Infrastructure",
    "body": "In the evolving landscape of blockchain technology, Solana has rapidly emerged as a platform not merely defined by its technical capabilities but by its broader implications for economic infrastructure. By enabling the class of decentralized applications, SOL is positioning itself as a high-performance blockchain and a foundational layer for the next-generation economic activity. Why Infrastructure That Enables Continuous Markets In an X post, crypto analyst Vibhu mentioned that Solana is no longer just a piece of financial technology, but a fully functioning economy. What exists on SOL today has gone beyond transactions and smart contracts. Related Reading: Solana Gains Institutional Momentum as New On-Chain Bond Deal and XRP Integration Build Hype According to the expert, there are dollars and native currencies, real-world assets, metals and rare minerals, energy market, information markets, manufacturing primitives, and global trade rails all operating in real-time on-chain. SOL also has politics, governance processes, divided factions, and ongoing debates about the leading network’s future. At this point, we are witnessing the birth of a country that lives entirely on the internet. Measured through economic output, SOL would rank around the 157th largest country in the world by GDP (Gross Domestic Product), comparable in size to nations such as Eswatini or Fiji. However, SOL is globally integrated by default, and from a forex and asset-flow perspective, it punches above its weight, integrating with the largest banks and financial institutions across the globe. Furthermore, SOL has withstood sustained network attacks from nation-state actors, defending itself with systems engineers instead of armies. Economically, SOL is already engaged in trade with countries like Bhutan, ranked 164, the Isle of Man, ranked 154, and even Kazakhstan, which ranks 49 in global economic standings. “Solana is a digital country, and I am proud to be a citizen,” Vibhu noted. Why Real-Time On-Chain UX Finally Works On Solana Solana continues to see key updates and integration that tend to bolster the network capabilities. Co-founder of TeamElevenX1 and Ambassador at Solflare, Kristofer_Sol, has highlighted that MagicBlock is quietly doing some of the most important work in the Solana ecosystem, pushing real-time SOL closer to true production scale. Related Reading: Solana Faces Critical Test Near $100 as Macro Pressure and Network Upgrades Collide At the center of this shift is the deep integration of compressed accounts into the Light Protocol inside Ephemeral Rollups, reducing rent costs by up to 200 times, while still functioning like a normal account for developers. The compression demo is already live, and real applications are actively using it today. Others like Rush Trade deliver faster trades, and Pixels achieve smooth, real-time pixel updates. Kristofer_Sol stated that this is what a scalable on-chain user experience actually looks like. With low-cost reduction and speed improvements happening without forcing developers to rewrite everything, MagicBlock is quietly removing the friction that has held back games, social apps, and consumer products on SOL. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Solana|GDP|Gross Domestic Product|Kristofer_Sol|Light Protocol|MagicBlock|Sol|SOL news|SOL Price|Solana news|Solana Price|Solflare|SOLUSD|SOLUSDT|TeamElevenX1|Vibhu",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56007677,
    "published": 1766100600000,
    "title": "Synthetix returns to Ethereum mainnet after 3 years: ‘We can run it back’",
    "body": "Synthetix founder Kain Warwick expects other perpetual decentralized exchanges to follow Synthetix back to Ethereum, which is faster than ever.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56008771,
    "published": 1766102880000,
    "title": "XRP’s familiarity helps push ETFs past $1B assets: Exec",
    "body": "XRP has a “number of reasons” that are attracting traditional investor dollars, which has helped to push XRP ETFs over $1 billion in assets, says CF Benchmarks CEO Sui Chung.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56008707,
    "published": 1766102719000,
    "title": "Solana, Aptos Move to Harden Blockchains Against Future Quantum Attacks",
    "body": "Developers have begun testing new cryptography to guard against forged transactions and wallet theft, in preparation for a changing world.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "aptos||Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 70,
        "NAME": "APT",
        "CATEGORY": "APT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56011093,
    "published": 1766107643000,
    "title": "Senate confirms Trump crypto-friendly nominees to take over CFTC, FDIC",
    "body": "In a package of confirmations, the U.S. Senate approved Mike Selig to lead the CFTC and Travis Hill to run the FDIC, both with major potential reach into crypto.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|U.S. Senate|U.S. Commodity Futures Trading Commission|U.S. Federal Deposit Insurance Corp.|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56012154,
    "published": 1766109618000,
    "title": "Bitcoin Faces Elevated Downside Risk: Loss Selling Takes Hold As STH SOPR Falls Below 1",
    "body": "Bitcoin has been under intense selling pressure in recent sessions, leaving market participants increasingly cautious about near-term direction. On Wednesday, BTC briefly surged from the $86,000 area toward $90,000, offering short-term investors a moment of relief after weeks of downside volatility. That rebound, however, proved short-lived. Price quickly retraced back to the $86,000 level, once again stalling bullish momentum and reinforcing the perception that sellers remain firmly in control. Related Reading: From Cycles To Continuity: Why Bitcoin’s 4-Year Pattern May Be Breaking This failed recovery attempt has weighed heavily on sentiment, particularly among short-term holders who entered positions at higher levels during the previous consolidation range. According to a report by Axel Adler, on-chain data reveals that this cohort has entered a clear stress regime. Bitcoin’s price has fallen below the average purchase price of short-term holders, a condition that historically increases the probability of reactive selling behavior. The stress is further reflected in the Short-Term Holder Spent Output Profit Ratio (STH-SOPR, 30-day), which has declined to 0.98. This reading indicates that short-term holders are, on average, realizing losses when they sell. Such environments often coincide with deteriorating confidence and heightened sensitivity to further downside moves. With BTC unable to hold recent relief rallies and short-term participants increasingly underwater, the market enters a fragile phase. The coming days will be critical in determining whether this pressure evolves into deeper capitulation or stabilizes into a base-building process. Short-Term Holders Under Stress as Loss-Taking Accelerates Adler explains that the Short-Term Holder Spent Output Profit Ratio (STH-SOPR 30D) is a critical gauge of short-term market stress, as it measures whether recent coin sales are occurring at a profit or a loss. Values above one indicate that short-term holders are selling profitably, while readings below one signal loss realization. Historically, sustained periods below one reflect deteriorating confidence and raise the risk of further downside, as loss-taking behavior can cascade into additional sell pressure. A continued decline in SOPR would likely intensify this dynamic and open the door to new local lows. By contrast, a meaningful recovery would require the metric to reclaim and hold above the one level, signaling that selling pressure is being absorbed and losses are no longer dominant. This stress is reinforced by the Short-Term Holders Positive vs Negative Sentiment chart. The indicator classifies holders based on whether they are in profit or at a loss. Over the past five weeks, sentiment has shifted decisively toward the orange and purple zones, representing negative positioning. The growing dominance of underwater holders increases the probability of panic-driven selling. Together, both charts deliver a consistent message: short-term participants are under pressure, and the current environment remains fragile until clear signs of relief emerge. Related Reading: Bitcoin Structure Turns Bearish As Structural Indicators Flip Negative Bitcoin Tests Critical Support as Bears Persist Bitcoin continues to trade under pressure, with the chart showing price consolidating around the $87,000 area after a sharp corrective move from the October highs near $125,000. The rejection from the upper range marked a clear shift in market structure, as BTC lost the 50-day and 100-day moving averages and failed to reclaim them on subsequent rebounds. The blue moving average has now turned downward, reinforcing the short- to medium-term bearish bias. Price is currently hovering just above the 200-day moving average, plotted in red, which sits near the $86,000–$88,000 zone. This level represents a critical area of long-term demand and structural support. Historically, sustained closes below the 200-day average tend to coincide with deeper corrective phases or prolonged consolidation. Related Reading: XRP Liquidity Dries Up: Futures Buy Volume On Binance Falls from $5.8B to $250M Volume dynamics add to the cautious outlook. Selling pressure expanded significantly during the breakdown in October and November, while recent rebound attempts have occurred on relatively muted volume. This suggests that short-covering and tactical buying, rather than strong spot demand, are driving price stabilization. Structurally, Bitcoin is forming lower highs since the peak, keeping the broader trend vulnerable. A recovery scenario would require BTC to reclaim the $95,000–$100,000 region and hold above the declining moving averages. Until then, the chart favors continued consolidation or further downside risk around the long-term support zone. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|Bitcoin news|Bitcoin Short-Term Holder|Bitcoin STH|Bitcoin STH SOPR|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56013202,
    "published": 1766111400000,
    "title": "Bitcoin Price Retests Support—Is the Market Bracing for Volatility?",
    "body": "Bitcoin price attempted to start a fresh increase but failed at $89,500. BTC is now struggling below $86,500 and might continue to move down. Bitcoin started a fresh decline below the $86,500 zone. The price is trading below $86,500 and the 100 hourly Simple moving average. There was a break below a bullish trend line with support at $87,250 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move down if it settles below the $85,000 zone. Bitcoin Price Dips Again Bitcoin price attempted a fresh recovery wave above $88,000 and $88,500. BTC tested the $89,500 resistance zone and reacted to the downside. There was a sharp decline below $88,000. There was a break below a bullish trend line with support at $87,250 on the hourly chart of the BTC/USD pair. The price even spiked below the $85,000 support. However, the bulls were active near the $84,500 zone. A low was formed at $84,421 and the price is now consolidating losses below the 23.6% Fib retracement level of the downward move from the $89,437 swing high to the $84,421 low. Bitcoin is now trading below $87,000 and the 100 hourly Simple moving average. If the bulls remain in action, the price could attempt more gains. Immediate resistance is near the $86,600 level. The first key resistance is near the $87,000 level and the 50% Fib retracement level of the downward move from the $89,437 swing high to the $84,421 low. The next resistance could be $88,000. A close above the $88,000 resistance might send the price further higher. In the stated case, the price could rise and test the $88,800 resistance. Any more gains might send the price toward the $89,500 level. The next barrier for the bulls could be $90,000 and $90,500. More Losses In BTC? If Bitcoin fails to rise above the $87,000 resistance zone, it could start another decline. Immediate support is near the $85,000 level. The first major support is near the $84,500 level. The next support is now near the $83,200 zone. Any more losses might send the price toward the $82,500 support in the near term. The main support sits at $80,500, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $85,000, followed by $84,500. Major Resistance Levels – $87,000 and $88,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56014378,
    "published": 1766113252000,
    "title": "Flight To Metals? Gold And Silver Hit Records While Bitcoin Drops",
    "body": "Gold and silver hit fresh highs on Tuesday while Bitcoin slid back under $89,000, sending a clear message that some investors are favoring metal over riskier bets. Related Reading: Russia Rejects Crypto As Legal Tender, Finance Official Confirms According to Reuters and market data, gold traded above $4,330 an ounce and silver pushed past $66 an ounce in what market participants called a strong run for bullion. Reports have disclosed that silver’s rally has lifted local prices in India to about ₹2.06 lakh per kilogram. Metals Rally, Hit New Highs Silver’s advance has been dramatic. It is up roughly 120-130% year-to-date, a jump that outpaces gold by a wide margin. Traders point to a mix of stronger industrial demand from solar and electronics, tighter supplies, and flows into safe assets as reasons behind the move. Gold buyers have also been encouraged by signs that US inflation may cool and by shifting expectations for central bank policy, which tends to support non-yielding assets when real yields fall. JUST IN 🚨: Silver soars to $66 for the first time in history 📈🥳🫂 pic.twitter.com/YGCrB5VDPH — Barchart (@Barchart) December 17, 2025 Safe Haven Demand And Industrial Use Some investors are treating metals as a hedge. Others want exposure linked to real economy needs. Both forces are at work. Analysts say silver’s dual role — as an industrial metal and as a store of value — is amplifying moves. Energy prices and supply reports have added pressure on markets, and that has upped demand for physical metal in several trading hubs. Bitcoin Slips Under Key Level Bitcoin fell below $89,000 and was trading nearer to $88,450 in mid-session, giving back gains from earlier months. Based on reports and market feeds, BTC is about 7% lower year-to-date and roughly 30% below its October 2025 peak above $126,000. Some crypto funds recorded outflows recently, and several traders described market tone as risk-off, which has weighed on digital assets this week. Liquidity, ETF Flows And Sentiment ETF flows played a role. Where money leaves ETFs, prices can feel the impact quickly. Margin calls, profit taking after a volatile run, and investors moving to what they see as safer stores of value have all been cited by sources watching the tape. Technical levels near $84,000 to $85,000 are now being watched for support, while resistance sits close to $90,000 to $92,000. Related Reading: 5,606 Bitcoin: Lightning Network Sets Fresh Capacity Record Markets Eye Data And Policy Moves Economic reports and central bank signals are next on traders’ calendars. US inflation prints and comments from global central banks have been flagged as possible triggers for fresh moves in both metals and crypto. Investors also noted that equity weakness, especially in some large tech names, has nudged money toward hard assets and away from riskier positions. Several market strategists said that policy shifts overseas, including from the Bank of Japan, could further change global liquidity and investor choices. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|Bank of Japan|bitcoin|btc|crypto|etf|gold|metals|silver|yellow metal",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56014093,
    "published": 1766112596000,
    "title": "Bitwise files with SEC to offer spot SUI ETF",
    "body": "Bitwise has filed an initial registration for an ETF tracking Sui, joining the race to launch with Canary Captial and 21Shares.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 96,
        "NAME": "SUI",
        "CATEGORY": "SUI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56014632,
    "published": 1766113687000,
    "title": "Ethereum Price Sinks Again—Are Bulls Running Out of Defenses?",
    "body": "Ethereum price failed to stay above $2,95 0 and declined again. ETH is now consolidating and might soon aim to attempt another recovery wave if it clears $2,850. Ethereum started a fresh decline below the $2,920 zone. The price is trading below $2,900 and the 100-hourly Simple Moving Average. There is a connecting bearish trend line forming with resistance at $2,925 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move down if it settles below the $2,800 zone. Ethereum Price Faces Renewed Selling Pressure Ethereum price attempted a fresh increase but struggled above $2,950, like Bitcoin . ETH price dipped below $2,920 and $2,900 to enter a bearish zone. The bears even pushed the price below $2,820. A low was formed at $2,775 and the price is now consolidating losses well near the 23.6% Fib retracement level of the downward move from the $2,993 swing high to the $2,775 low. Ethereum price is now trading below $2,870 and the 100-hourly Simple Moving Average . Besides, there is a connecting bearish trend line forming with resistance at $2,925 on the hourly chart of ETH/USD. If there is another upward move, the price could face resistance near the $2,850 level. The next key resistance is near the $2,880 level and 50% Fib retracement level of the downward move from the $2,993 swing high to the $2,775 low. The first major resistance is near the $2,925 level and the trend line. A clear move above the $2,925 resistance might send the price toward the $3,000 resistance. An upside break above the $3,000 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $3,080 resistance zone or even $3,120 in the near term. Downside Continuation In ETH? If Ethereum fails to clear the $2,850 resistance, it could start a fresh decline. Initial support on the downside is near the $2,800 level. The first major support sits near the $2,775 zone. A clear move below the $2,775 support might push the price toward the $2,720 support. Any more losses might send the price toward the $2,640 region. The next key support sits at $2,620. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone. Hourly RSI – The RSI for ETH/USD is now below the 50 zone. Major Support Level – $2,775 Major Resistance Level – $2,880",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56016486,
    "published": 1766116329000,
    "title": "Bitcoin jumps above $87,000, yen slides as Bank of Japan hikes interest rates",
    "body": "The Bank of Japan raised its short-term policy rate by 25 basis points to 0.75%, the highest in nearly 30 years.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56017138,
    "published": 1766117287000,
    "title": "XRP Price Turns Lower as a Familiar Pattern Reappears Again",
    "body": "XRP price failed to gain pace above $1.920 and trimmed gains. The price is now struggling and faces resistance near the $1.820 level. XRP price started a fresh decline below the $1.850 zone. The price is now trading below $1.850 and the 100-hourly Simple Moving Average. There is a bearish trend line forming with resistance at $1.920 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move down if it settles below $1.780. XRP Price Dips To New Weekly Lows XRP price attempted a recovery wave above $1.90 but failed to continue higher, like Bitcoin and Ethereum . The price started a fresh decline below $1.880 and $1.850. There was a move below the $1.820 support level. A low was formed at $1.7707, and the price is now showing bearish signs below the 23.6% Fib retracement level of the downward move from the $1.9331 swing high to the $1.7707 low. The price is now trading below $1.850 and the 100-hourly Simple Moving Average. There is also a bearish trend line forming with resistance at $1.920 on the hourly chart of the XRP/USD pair. If there is a fresh upward move, the price might face resistance near the $1.810 level. The first major resistance is near the $1.8520 level or the 50% Fib retracement level of the downward move from the $1.9331 swing high to the $1.7707 low. A close above $1.8520 could send the price to $1.880. The next hurdle sits at $1.920 and the trend line. A clear move above the $1.920 resistance might send the price toward the $1.9650 resistance. Any more gains might send the price toward the $2.00 resistance. The next major hurdle for the bulls might be near $2.050. More Losses? If XRP fails to clear the $1.8520 resistance zone, it could start a fresh decline. Initial support on the downside is near the $1.780 level. The next major support is near the $1.7620 level. If there is a downside break and a close below the $1.7620 level, the price might continue to decline toward $1.720. The next major support sits near the $1.70 zone, below which the price could continue lower toward $1.680. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $1.780 and $1.7620. Major Resistance Levels – $1.8520 and $1.920.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56017611,
    "published": 1766117716000,
    "title": "Crypto market cap falls to 8-month low, analysts see more pain ahead",
    "body": "The total crypto market cap fell to $2.93 trillion, its lowest since April, erasing yearly gains as analysts anticipated further declines.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]