[
  {
    "id": 57817922,
    "published": 1770478229000,
    "title": "Pundit Says It’s Time To Get Your XRP Off Crypto Exchanges – Here’s Why",
    "body": "XRP’s price crash earlier this week has kept many bullish investors in the XRP community on edge, but one outspoken voice in the community believes the move is not as random as it looks. A crypto pundit known as Stellar Rippler has encouraged XRP holders to pull their cryptocurrencies off centralized exchanges immediately, with the outlook that the recent volatility is not just another routine market dip but a warning sign of what’s to come. Related Reading: Bitcoin Edges Past Gold In Appeal, JPMorgan Says Engineered XRP Crash? Stellar Rippler’s position is based on the idea that XRP is being treated differently from most digital assets behind the scenes. He pointed to past remarks from David Schwartz, co-creator of the XRP Ledger, where XRP was described as a form of pre-allocated liquidity for institutional use, as well as statements suggesting that XRP currently held in escrow can be sold to institutions but will not be circulated until NDAs are disclosed. He went further to name large financial players, including BlackRock, JPMorgan, Bank of America, and institutions linked to the BRICS, the United Arab Emirates, the United Kingdom, and European central banking structures. According to the pundit, all these institutions have bought the right to buy the XRP currently held in escrow by Ripple. At the time of writing, there are no public filings that confirm coordinated buying of XRP escrows by these entities, but the argument has found receptive ears among investors unsettled by the recent sell-off. From that angle, the pundit noted that sudden downside moves, such as the recent drop to $1.15, are engineered. By “engineered,” this means the price crash serves a strategic purpose of creating opportunity for large financial players to accumulate XRP at lower prices before any market repricing takes place. Should You Take Your XRP Off Exchanges? Another part of the warning focused on user experience at major crypto exchanges. According to the pundit, Binance and Coinbase users have reportedly been facing difficulties getting their crypto off the exchanges. This, in itself, is a warning for XRP holders to get their cryptos off crypto exchanges and into a cold wallet. That message taps into conversation in crypto about self-custody versus keeping holdings on crypto exchanges. Calls to be your own bank tend to resurface whenever price action turns volatile. The alarm was sounded against the backdrop of a Bitcoin price crash below $70,000 that pulled most cryptocurrencies lower. XRP, in particular, dipped to around $1.15 during the sell-off before rebounding. Related Reading: Bitcoin Sell-Off May Be Done, Analyst Flags Recovery Signs At the time of writing, XRP is trading near $1.42, easing some immediate pressure but not fully restoring confidence. On the subject of confidence, sentiment surrounding XRP on social media is relatively optimistic. Data shows XRP is drawing more positive commentary than other large-cap assets such as Bitcoin and Ethereum despite the recent market-wide crash. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|altcoin|crypto|crypto market|crypto news|cryptocurrency|Ripple|xrp|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57818519,
    "published": 1770480524000,
    "title": "Bitcoin falls below $70,000 after erasing post-election gains during 'sell at any price' rout",
    "body": "Crypto sentiment was hit as Gemini plans to close operations in several regions and cut staff, while spot bitcoin ETF flows turned negative.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|crypto market|crypto prices|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57819423,
    "published": 1770483621000,
    "title": "Bitcoin Crash Linked To BlackRock IBIT Hedging, Arthur Hayes Claims",
    "body": "Arthur Hayes, co‑founder of BitMEX, has pointed to hedging tied to BlackRock’s iShares Bitcoin Trust (IBIT) as a major driver behind the recent Bitcoin sell‑off. Related Reading: Bitcoin Edges Past Gold In Appeal, JPMorgan Says According to Hayes, dealer hedging related to IBIT and similar structured products can force large, mechanical selling when markets move against those positions. Reports note that such moves can amplify a price drop already set off by other pressures. Heavy Hedges Can Trigger Sudden Selling Pressure: Hayes Hayes argues that banks and dealers who underwrite structured notes and ETF‑linked products often hedge their exposure in the spot and derivatives markets. Those hedges can be heavy and fast. When a large product faces outflows or redemption triggers, hedges are adjusted quickly. That can translate into sudden selling pressure that pushes prices down further, especially if liquidity is thin. $BTC dump probably due to dealer hedging off the back of $IBIT structured products. I will be compiling a complete list of all issued notes by the banks to better understand trigger points that could cause rapid price rises and falls. As the game changes, u must as well. pic.twitter.com/9DF8VE9XBL — Arthur Hayes (@CryptoHayes) February 7, 2026 Market Moves And Liquidity Stress The market behaved like a room of people trying to leave at once. Prices plunged, then bounced. Reports say Bitcoin fell steeply from its recent highs before staging a partial recovery. Bitcoin has fallen to around $68,500 Saturday, down 16% in the last seven days, data from Coingecko shows. Trades and order books showed spikes in volume, which is one sign that hedging flows and quick rebalancing were at play. Some analysts say macro news and trader positioning also mattered. The truth likely sits in the overlap of these causes. Who Bears The Risk Dealers carry risk when they underwrite complex products. In certain moments, that risk is passed back into the market through hedging. That’s how, according to Hayes, a few large issuers can indirectly set off a chain reaction that affects many other holders and traders. The moves can be sudden and mechanical, not always driven by sentiment. A Watchful Washington Reports say the role of spot ETFs in crypto markets is now on regulators’ and policymakers’ radar. US President Donald Trump’s economic team has been monitoring big flows into and out of institutional vehicles, while market participants debate whether ETFs stabilize prices or add new stress points. Whatever the view, structured products now form a clear link between traditional finance and crypto volatility. Broader Takeaways This episode underlines how new financial plumbing can create new channels for contagion. Some see the presence of large, regulated players as a net positive for long‑term adoption. Others warn those same players introduce conventional market mechanics that can behave unpredictably when stretched. Reports note both perspectives are useful when piecing together why prices moved the way they did. Related Reading: Bitcoin Sell-Off May Be Done, Analyst Flags Recovery Signs Who Is Right, And What Next Hayes has laid out a theory that ties observable hedging flows to the crash. It is a compelling thread that fits many of the market signals seen in recent days. Still, other factors—macro shifts, concentrated profit‑taking, and liquidity gaps—likely played parts as well. Traders will watch flows closely, and structured product issuers will be asked hard questions. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|Arthur Hayes|bitcoin|BlackRock|btcusd|crypto|IBIT|liquidity",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57819422,
    "published": 1770483600000,
    "title": "SOL-focused Forward Industries has had a tough run, but CIO says it's positioned for success",
    "body": "With no debt and the largest public solana treasury, Forward Industries' CIO says it can play offense and consolidate rivals as the sector strains.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Digital Asset Treasury|Solana News|mergers and acquisitions|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 57820898,
    "published": 1770485590000,
    "title": "South Africa’s Kganyago Warns on Risk of Growing Stablecoin Use",
    "body": "South African Reserve Bank Governor Lesetja Kganyago warned about the risk of the increasing popularity of stablecoins, saying there’s a danger the cryptocurrency assets could “break apart.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57820998,
    "published": 1770489006000,
    "title": "XRP Price Returns Above $1.5 — On-Chain Data Says Whales Are Behind It",
    "body": "The XRP price was on the verge of losing the $1 level merely two days ago, as the entire crypto market succumbed to an almost unprecedented level of volatility and bearish pressure. The altcoin fell to as low as $1.16, its lowest level since November 2024. While the general cryptocurrency market appears to be showing some signs of recovery, the XRP price activity has been particularly impressive since bottoming out at around the $1.15 mark. According to a prominent crypto analytics firm, below are the reasons behind the altcoin’s latest resurgence. Whale And Network Activity Throw XRP A Lifeline On Friday, February 6, popular blockchain firm Santiment took to the social media platform X to discuss the recent correction and the subsequent recovery experienced by the XRP price going into this weekend. With the strong volatility witnessed in the market, XRP seemed to be bound for $1 in that downward movement. Related Reading: Ethereum Coinbase Premium Drops To 2022 Bear-Market Levels: Capitulation Or Further Downside? Santiment said on X: Panic sellers should have stopped to notice the massive activity on the XRP Ledger as speculators were discussing whether the coin would fall below $1.00. However, the fourth-largest cryptocurrency by market capitalization briefly reclaimed the $1.5 level on Friday, signaling the return of fresh buying momentum to the market. According to Santiment, this XRP price jump might have been triggered by the group of large investors known as the whales. The latest on-chain data shows that an “obvious” whale accumulation took place while the XRP price headed for the bottom. Santiment data shows that about 1,389 $100,000 whale transactions occurred during the dip, the highest volume seen over the past four months. Meanwhile, activity on the XRP Ledger has been on the rise since the altcoin’s price fell to its lowest level in over a year. According to Santiment’s post on X, the amount of unique addresses on the blockchain saw a notable surge to 78,727 in just one 8-hour candle, its highest level in approximately six months. The crypto analytics noted that these occurrences are both significant to the potential price resurgence of any asset. With an uptick in whale demand and network activity, the XRP price could build the foundation required to return to a bullish structure. However, investors might want to approach the market with extreme caution, as a relief rally is not the strangest phenomenon in a bear market. XRP Price At A Glance As of this writing, the price of XRP stands at around $1.46, reflecting an almost 25% jump in the past 24 hours. However, this single-day action is not enough to erase the past week’s losses, which still sit roughly over 16%. Related Reading: XRP Social Sentiment Still Bullish While Bitcoin Mood Sours Featured image from iStock, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|Santiment|xrp|XRP Price|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57820990,
    "published": 1770489000000,
    "title": "Why machine-to-machine payments are the new electricity for the digital age",
    "body": "If continuous M2M payments are the new electricity, then blockchains must be seen as the new power grid, Huang contends.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Opinion|Blockchains|Opinion",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57795041,
    "published": 1770494953000,
    "title": "South Korean Crypto Exchange Accidentally Gave Away $43 Billion in Bitcoin",
    "body": "The error was quickly corrected, Bithumb said, but not before some users sold off their Bitcoin, temporarily crashing its listed price.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57822633,
    "published": 1770494414000,
    "title": "Forget A Bitcoin Yearly Top, BTC Price Might Have Hit A 16-Year Cyclical Peak",
    "body": "Crypto expert Tony Severino has opined that Bitcoin isn’t just showing signs of a yearly top but also that the BTC price may have hit a 16-year cyclical peak. This comes amid the flagship crypto’s recent crash to $60,000, which sparked fears of a bear market. Bitcoin May Be Showing Signs Of A Peak Amid BTC Price Crash To $60,000 In an X post, Severino alluded to the yearly Bitcoin chart, which he said looks like a 16-year cyclical peak rather than just a yearly top. The expert also outlined several reasons this appears to be a major cyclical top for the BTC price. First, he noted that the white candlesticks have been decreasing in size over time, while black candlesticks engulf more white candles with each appearance. Related Reading: Bitcoin Price Just Hit A 15-Year Trendline After The Crash, What This Means Furthermore, Severino highlighted the Doji at the top of a rising wedge pattern while the Evening Star is in progress, which is a bearish reversal signal for the BTC price. Meanwhile, the Fischer Transform is crossing bearish with divergence, and the Stochastic is crossing bearish after being rejected from 80. He added that Bitcoin’s Relative Strength Index (RSI) is falling back below 70 after making it above this level on the highest timeframe chart. His analysis comes as the BTC price continues to decline, suggesting the crypto market may be in a bear market after topping last October. Bitcoin dropped to as low as $60,000 earlier this week, suffering its largest daily decline since the FTX collapse. Veteran trader Peter Brandt has also opined that Bitcoin is in a bear market, predicting that it could still drop to as low as $42,000 before it sees a bottom. Reason For The Recent BTC Crash BitMEX co-founder Arthur Hayes has commented on the reason for this recent Bitcoin crash, suggesting that it was due to external factors rather than part of an ongoing bear market. In an X post, he stated that the BTC price dump was probably due to a dealer hedging off the back of BlackRock’s BTC ETF structured products. Notably, BlackRock’s IBIT saw a record trading volume of $10 billion on the day of this crash to $60,000. Related Reading: Here’s What To Expect If The Bitcoin Price Maintains Support Above $74,400 Hayes’ comment comes on the back of Bitcoin’s rebound above $70,000, with the flagship crypto recording one of its largest ever daily gains yesterday following the crash to $60,000. Galaxy Digital’s Head of Research, Alex Thorn, suggested that the drop to $60,000 may mark the bottom for the BTC price. This came as he noted that the 200-week MA, which is around $60,000, has historically been a strong entry point for long-term investors. At the time of writing, the BTC price is trading at around $70,000, up over 6% in the last 24 hours, according to data from CoinMarketCap. Featured image from Pngtree, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|Alex Thorn|Arthur Hayes|bitcoin|Bitcoin news|bitcoin price|Bitcoin’s Relative Strength Index|BitMEX|BlackRock’s BTC ETF|btc|BTC news|btc price|btcusd|BTCUSDT|CoinMarketCap|doji|Galaxy Digital|IBIT|RSI|Tony Severino",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57824431,
    "published": 1770499841000,
    "title": "Bitcoin Taker Buy Ratio Signals Peak Bearish Sentiment — Relief Soon?",
    "body": "The price of Bitcoin experienced one of the most bearish periods in its history over the past week, losing one crucial technical level after the other. According to data, the cryptocurrency market has seen $1 trillion worth of capital flow out since mid-January. With no doubt about the emergence of the bear season, investors are now approaching the market with greater skepticism and caution. One of the on-chain metrics highlighting this shift in behavior is the Bitcoin taker buy ratio, which has fallen to new lows. BTC Taker Buy Ratio Drops To 0.48 In a new Quicktake post on the CryptoQuant platform, market analyst CryptoOnchain shared a fresh on-chain angle to the ongoing selling pressure in the Bitcoin market. This observation is based on the declining Taker Buy Ratio on Binance, the world’s largest centralized exchange by trading volume. Related Reading: Why The Market Cap Argument For XRP Price Not Reaching $10,000 Is ‘Flawed’ The Bitcoin Taker Buy Ratio is a sentiment indicator that estimates the proportion of trading volume owned by buyers against that of the sellers. Typically, values below 1 signal that taker sell volumes (aggressive selling) are outpacing taker buy volumes, which implies that sellers are overwhelming the buyers in the market. Highlighting data from CryptoQuant, CryptoOnchain revealed that the Bitcoin Taker Buy Ratio (14-day Moving Average) on Binance has dropped to 0.48, marking its lowest level since October 2025. Such a negative market sentiment on the world’s largest exchange spotlights a worrying trend in the general derivatives market. CryptoOnchain said: A drop to such a significant low suggests that sellers are overwhelmingly dominating the order book, aggressively hitting bids without sufficient buying resistance. As the crypto pundit also pointed out, this drop in the Bitcoin Taker Buy Ratio coincided with the recent price correction, which saw the premier cryptocurrency fall to around $61,000. CryptoOnchain noted that this metric needs to stabilize and begin to rise again if the BTC price is to see any relief. The Quicktake post concluded: For a potential reversal or a local bottom, we need to see this metric stabilize and begin to trend upwards, indicating that aggressive selling is exhausted and buyers are stepping back in. Until then, caution is advised as the momentum remains heavily in favor of the bears. Bitcoin Price At A Glance After one of the largest “red” days in the crypto market, the price of BTC appears to be recovering nicely, having returned above the $70,000 on Friday. As of this writing, the flagship cryptocurrency is valued at around $70,263, reflecting an over 11% price jump in the past 24 hours. Related Reading: 5 Red Months In A Row: What’s Going On With Bitcoin And The Crypto Market? Featured image from iStock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|BTC news|BTCUSDT|crypto",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57824941,
    "published": 1770501174000,
    "title": "Dorsey’s Block Cutting Up to 10% of Staff in Efficiency Push",
    "body": "Jack Dorsey’s Block Inc. has been notifying hundreds of employees that their jobs may be eliminated during annual performance reviews as the payments firm embarks on a broader business overhaul.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NYS:XYZ",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 57825968,
    "published": 1770505208000,
    "title": "Ethereum Libra Formation In Play: ETH’s Next Big Move Could Be Loading",
    "body": "Ethereum is quietly setting up for a potentially decisive move as the Libra formation remains active on the weekly chart. While confirmation is still pending, the structure has not been invalidated, keeping the upside scenario firmly on the table. With key resistance levels overhead and momentum beginning to stabilize, ETH may be entering a critical phase where the next major directional move starts to take shape. Weekly Libra Formation Keeps The Bullish Case Alive On the X platform, Kamile Uray highlighted that Ethereum is currently forming a Libra pattern on the weekly chart. With the weekly candle yet to close and no invalidation so far, the bullish formation remains active and continues to be a valid scenario. Related Reading: Ethereum Bulls Must Conquer $3,050 Or Momentum Quickly Fades According to the update, confirmation of a reversal would open the door for a move toward the $4,956 high, but the price may face notable resistance along the way, particularly around the $3,445 level. Kamile Uray noted that a daily close above $2,475 would serve as the first technical signal that upside momentum is strengthening and that the recovery could continue. Failure to sustain movement above this area could delay further progress and keep the price vulnerable to pullbacks. Since the Libra formation is developing on the weekly timeframe, the pattern would only be considered invalid if Ethereum breaks below the $1,388 low, underscoring the broader, long-term nature of the setup. Ethereum Stretches Higher At $2,086 After A Sharp 22% Run According to Can Özsüer, Ethereum is currently trading around $2,086, marking a strong rally from the $1,730 area. From that level to the current price, ETH has surged roughly 22% without a meaningful correction, which increases the likelihood of short-term profit-taking. After such a sharp move, light selling pressure typically emerges as the market cools off. Related Reading: Analyst Says You’re Not Bullish Enough On Ethereum – What Does He Mean? Can Özsüer notes that any selling from this region is expected to remain controlled rather than aggressive. The ideal pullback zone lies between $1,950 and $2,000, where the price could reset without damaging the broader bullish structure. A dip into this range would be considered healthy and could set the stage for the next leg higher. Once that corrective move plays out, the next upside objective comes in around the $2,200 level. However, if price pushes straight toward the target without offering a pullback, the strategy would need adjustment. In that scenario, chasing a long position becomes less attractive, as a stronger selling wave could follow once the target is reached. If a correction does materialize, Can Özsüer suggests that a long position on the pullback would be the preferred approach. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|Can Özsüer|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|ethusd|ETHUSDT|Kamile Uray|Libra Formation",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57829994,
    "published": 1770519628000,
    "title": "Ethereum Price Is Not Going To Keep Falling Forever, Analyst Says",
    "body": "Ethereum’s recent sell-off has weighed heavily on sentiment after the price fell below the $2,000 level and pulled much of the altcoin market lower alongside it. The move has caused sweeping fear and caution among Ethereum traders. However, some analysts are of the notion that a bullish upside will roll in soon. In a post shared on X, crypto analyst ChainHub said the current conditions point more toward exhaustion, and after massive downside comes massive upside. Related Reading: Bitcoin Edges Past Gold In Appeal, JPMorgan Says ETHBTC Structure Holds ChainHub emphasized that the ETH/BTC pair is still technically valid and has not seen any structural invalidation despite the recent price crash. Although Ethereum’s price fell much lower than many expected during the crash, it is not going to keep falling forever. He also pointed to fear levels that are now climbing to extremes rarely seen, noting that such environments always tend to appear near major turning points. “After massive fear and massive downside comes massive upside,” the analyst said. On Ethereum itself, ChainHub acknowledged that losing the $2,000 handle was important, but he highlighted the next major area of interest near $1,700. This zone is technically consistent with a broader corrective structure, and it is possible that Ethereum might not even fall that far before it rebounds. However, even if Ethereum does fall to $1,700, price action reaching this area means Ethereum is finally at a region where buyers may begin to reassert control. He linked this outlook to Bitcoin’s recent behavior. Bitcoin’s rejection at $72,000 opened the door to a retest of the upper portion of its summer 2024 demand range, which stretches from around $59,000 down to $49,000. ChainHub pointed out that this is the first significant interaction with that demand area since 2025, with Fibonacci alignment clustering around $57,000 to $58,000. This increases the odds that Bitcoin is in the process of forming a base, and that is where it establishes a bottom. Altcoins Touching Meaningful Demand Levels ChainHub also noted that Ethereum is not alone in testing critical levels. Several major altcoins, including Solana and XRP, have moved into important demand zones. Many of these altcoins have revisited August 2024 lows or filled prior wicks, areas that have not yet been broken on an initial attempt. Solana, for instance, has broken below $100 for the first time since January 2024 and recently traded at a low of $75. As noted by ChainHub, this move saw Solana finally touch meaningful demand for the first time in 2 years. Related Reading: Polygon Hits $3.50 Billion In Payments As Crypto Activity Expands Dogecoin, Cardano, and Avalanche have also all filled the downward wicks on October 10, restoring balance and touching the August 2024 low. Although there is still the possibility for limited downside, the expectation is that the market begins forming a range and then starts building bullish momentum in the coming weeks. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|blockchain|crypto market|crypto news|cryptocurrency|ETH|ethereum",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57832454,
    "published": 1770527449000,
    "title": "CFTC Pivot Gives Prediction Markets Tailwind Just Before Super Bowl",
    "body": "As the CFTC’s shift on “event contracts,” one expert sees Kalshi and Polymarket's real‑money prediction markets as a boost to civic engagement and probabilistic thinking.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57832200,
    "published": 1770526815000,
    "title": "XRP Price Has Just Reached Most Oversold Level In History And This Analyst Is Predicting A Bounce",
    "body": "The XRP price has hit oversold levels, marking its lowest readings in history. A crypto analyst has reported that each time XRP has reached these levels, a price bounce has followed. Based on this, he believes that XRP could be on the verge of another major rebound, projecting a potential rally above $2. XRP Price Sinks To Oversold Levels Ahead Of Rebound A crypto market analyst known as ‘Ripple Bull Winkle’ on X has outlined a short-term bullish outlook for XRP. Despite consistently breaking key support levels and now trading around $1.4, the analyst argues that XRP may be positioning itself for a substantial recovery that could ultimately push its price back above $2. Related Reading: Pundit Says XRP Price Is Not A ‘Crypto’ Question, But A Systemically Important Liquidity Asset The basis for Ripple Bull Winkle’s optimism stems from a recurring historical pattern that, in his view, has never failed to produce a bounce in the XRP price. Specifically, the analyst highlights a repeating Relative Strength Index (RSI) pattern. He announced that XRP recently reached an RSI of 20 on the daily chart, marking the most oversold reading in its history. According to the analyst, every time XRP has entered similarly extreme oversold territory, a price bounce of approximately 15-40% has always followed. He said such rebounds typically occur within two weeks of reaching these levels. He also emphasized that this recovery has not happened occasionally but consistently, reinforcing his confidence that XRP is likely to follow the same pattern and bounce again. If everything plays out as expected, Ripple Bull Winkle projects that XRP could see a relief bounce to $2.20-$2.50 before the end of February 2026. He noted that a rally to this bullish target is the highest-probability event the market has had this year. Analyst Shares Multiple Resistance Targets For XRP Looking at Ripple Bull Winkle’s accompanying price chart, he has marked several key resistance zones using red horizontal lines, indicating areas where XRP may encounter selling pressure or struggle to advance. These levels range from approximately $1.8-$1.91 to $2.06-$2.19, followed by $2.29-$2.41, $2.67-$2.78, and a higher resistance band near $3.10-$3.18. Related Reading: Rising Above The Ashes: XRP ETFs Set New Record Despite Market Crash Collectively, these levels serve as both potential barriers that could slow price movement and upside targets that XRP is expected to reach. The upward-pointing blue arrows in the chart also signal the analyst’s expectation of a bullish breakout or a sustained rally toward the stacked resistance levels if XRP builds enough momentum. As of writing, XRP appears to be recovering from its recent downtrend. Its price has rebounded by more than 10% over the past 24 hours and is currently trading above $1.4 after briefly dipping below $1.3, according to CoinMarketCap. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|CoinMarketCap|Relative Strength Index|Ripple|Ripple Bull Winkle|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57835204,
    "published": 1770536764000,
    "title": "Bithumb claws back 99.7% of overpaid Bitcoin, covers remaining shortfall",
    "body": "Bithumb says it has reclaimed most of the excess BTC credited during a promotional error and used company funds to cover 1,788 Bitcoin that had already been sold.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57838577,
    "published": 1770537601000,
    "title": "Ethereum’s Funding Rates Signal Sentiment Flip Across Major Exchanges",
    "body": "Ethereum (ETH) has declined noticeably over the past week, with price data from CoinMarketCap reporting a net 14% decline within this period. At the time of the most recent data, ETH is trading around $2,000, significantly lower than the past week’s level near $2,500. Related Reading: Ethereum Price Is Not Going To Keep Falling Forever, Analyst Says ETH Funding Rates Signal A Bullish Turn In a QuickTake post on the CryptoQuant platform, analyst Amr Taha draws attention to recent developments in ETH funding rates, a key sentiment indicator in perpetual futures. The funding rate shows the market sentiment, whether it’s optimistic/greedy (positive) or fearful/cautious (negative). Typically, when funding is highly positive or negative, it means that too many traders are on one side, positions are overleveraged, and then the market becomes unstable. At that point, even a small price move in the opposite direction can trigger liquidations, causing sharp and fast price moves. Although Ethereum’s funding rate was deeply negative over the week, analyst Amr Taha noted there has been a flip as ETH derivatives data shows a clear shift toward bullish positioning. Notably, Funding rates have turned strongly positive on BitMEX (Bitcoin Mercantile Exchange), reaching 0.049%, their highest level since October and well above the previous peak near 0.03. This signals aggressive leverage on the long side. Related Reading: XRP Price Has Just Reached Most Oversold Level In History And This Analyst Is Predicting A Bounce Extreme Optimism In ETH Could Spark Sharp Moves At the same time, ETH funding on Binance has moved from deeply negative levels at -0.025% on February 5 back towards neutral, indicating that short positions are being replaced by new long exposure. In essence, the market has moved from fear to optimism. While this shift reflects a rise in bullish sentiments, history shows that periods of extreme positive funding driven by leverage often increase the risk of liquidations and sharp corrective moves, rather than supporting sustained upside. In short, when everyone is bullish at the same time, the market becomes easier to knock over. In all, Ethereum Derivatives traders have become aggressively bullish, and while that can push price higher in the short term, history shows it often increases the risk of sudden corrective moves rather than a sustained uptrend. At the time of writing, Ethereum trades at $2,089 after a 14.9% decline in the past seven days. Meanwhile, the daily trading volume is down by 32.39% and valued at $37.39 billion. Featured image from Adobe Stock, chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|Binance|BitMEX|bullish sentiment|ethereum|ethusd|ETHUSDT|funding rates",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57839640,
    "published": 1770552019000,
    "title": "Bitcoin Sharpe Ratio Sinks To Historical Lows — Accumulation Next?",
    "body": "Since reaching its current all-time-high price of $126,000 in October last year, the Bitcoin market has been on a sell-off, translating into surmounting bear pressure. As a result, the flagship cryptocurrency has maintained a steady decline, falling until it recently reached $60,000 — a deviation of more than 52% from its all-time high. Bitcoin currently seems to be seeing a rebound, but price action alone reflects that it could as well be one of its short-term recoveries. Interestingly, a recent on-chain evaluation suggests that the current upward movement may be driven by a significant underlying metric. Related Reading: Bitcoin Taker Buy Ratio Signals Peak Bearish Sentiment — Relief Soon? What The Bitcoin Sharpe Ratio Is Saying In a Quicktake post on CryptoQuant, Darkfost reveals that the Bitcoin Sharpe Ratio is now at a zone historically relevant to the ends of bear markets. The Sharpe Ratio is a risk-adjusted performance metric that measures how much return an asset (Bitcoin, in this case) generates for risk taken. A high ratio signals that returns are strong in relation to risks taken; a declining ratio, on the other hand, reflects weakening returns, while risk remains elevated. On the severe end of the metric, a very low or negative Sharpe Ratio is a sign that market participants are taking very high risks for poor or negative returns. It is worth noting that very low Sharpe ratios are frequently seen during deep bear markets or even capitulation phases. According to historical data, Darkfost explains that the Sharpe Ratio is currently at a level so low as to be reminiscent of the final phases of past bear markets. This means that the Bitcoin price holds a higher practical risk, compared to returns, for current investors. Notably, the Sharpe ratio is not just at a low point, but continues in a steady state of decline. This, according to the market quant, is a sign that Bitcoin’s performance is yet to be attractive to any willing risk-taker. However, it is this specific dynamic that sets the pace for a turnaround in Bitcoin’s price. This is because sustained poor returns typically force capitulation events, where weaker hands are flushed out; this eventually sets the stage for renewed accumulation among stronger hands. Related Reading: Forget A Bitcoin Yearly Top, BTC Price Might Have Hit A 16-Year Cyclical Peak Two Main Approaches To Consider In This Scenario: Analyst Seeing as the current market condition is still mostly uncertain, Darkfost offers two ways to engage the current scenario. First, the analyst states that investors could begin increasing exposure gradually, and in line with the ratio’s movement towards lower risk zones. Second, Darkfost explains that a market participant could decide to wait for clear improvements in the Sharpe Ratio before entering the market at all. This is to serve as a confirmation strategy for the purpose of investor safety. However, Darkfost notes that the present bear phase could last a couple more months before any true reversal is seen, regardless of the signal being flashed by the Sharpe Ratio. As of this writing, Bitcoin stands at a $69,064 valuation. CoinMarketCap data reflects a 1.71% loss over the past day. Featured image from Unsplash, chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|bitcoin accumulation|bitcoin sharpe ratio|btcusd|BTCUSDT|cryptoquant|Darkfost",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57841501,
    "published": 1770557950000,
    "title": "Block weighs cutting up to 10% of jobs: Bloomberg",
    "body": "The company has told hundreds of employees their jobs are at risk as part of a broader overhaul.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Block|Payment Systems|Bitcoin News|Jobs|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57842829,
    "published": 1770562260000,
    "title": "Bitcoin bear market not over? Trader sees BTC price 'real bottom' at $50K",
    "body": "Bitcoin price analysis stayed bearish on the outlook for BTC, predicting new macro lows in a repeat of the 2022 bear market.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]