[
  {
    "id": 54568205,
    "published": 1763465400000,
    "title": "Crypto Markets Today: Fear Grips Market as BTC Tests Support, Volatility Spikes",
    "body": "Bitcoin hovered near $91,000 as sentiment hit \"extreme fear,\" volatility jumped and leveraged traders absorbed over $1 billion in liquidations while altcoins fell further.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54568474,
    "published": 1763465226000,
    "title": "Bitcoin Correction Mirrors April Drop As 2025 Buyers Fall Into The Red",
    "body": "Market drawdown pushes bitcoin below 2025 key cost basis levels.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Glassnode|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54570938,
    "published": 1763471362000,
    "title": "Fidelity Introduces FSOL ETF, Bringing Major Wall Street Name to Solana Funds",
    "body": "The firm’s staking-enabled Solana fund debuts as inflows into early SOL products accelerate.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Fidelity|ETFs|Solana News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54570867,
    "published": 1763471159000,
    "title": "Tether Invests in Ledn to Expand Bitcoin-Backed Lending Amid Surging Demand",
    "body": "The stablecoin issuer's investment comes as BTC-backed lending scales rapidly, with Ledn surpassing $1 billion in originations this year and positioning for global expansion.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Tether|Ledn|Lending|Crypto-Backed Lending|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54571205,
    "published": 1763471993000,
    "title": "How Pi Network’s 50M nodes could reshape the future of decentralized AI",
    "body": "Pi is turning its giant mobile community into a distributed compute grid, testing whether AI can run on a global crowd instead of the cloud.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54571616,
    "published": 1763473613000,
    "title": "Bitcoin Hashprice Falls to Five-Year Low",
    "body": "Falling revenue and record difficulty could tighten the squeeze on bitcoin miners, though many are more driven by their AI infrastructure initiatives.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Hash Power|Luxor & Hashrate Index|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54571896,
    "published": 1763474605000,
    "title": "Top Altcoins Heat Up as $BTC Trends Down – Bitcoin Hyper Could Pump Next",
    "body": "What to Know: The altcoin market is showing a distinct preference for projects with strong technological fundamentals and clear utility over purely speculative assets. Recent price predictions suggest a 300% pump for $SHIB if the token reaches two critical levels, which would set it up for an aggressive rally. Bitcoin Hyper introduces a Layer 2 solution that brings high-speed smart contracts to the Bitcoin ecosystem via a Solana Virtual Machine integration. The $HYPER presale raised over $27.8M so far with a token price of $0.013295 and staking rewards currently at 41%. The altcoin market is at a fascinating crossroads. While speculative assets have dominated cycles past, a clear trend toward utility is emerging. Investors are looking past fleeting hype, demanding projects with sustainable technology and real-world use cases. This shift in sentiment is reshaping the altcoin market outlook for 2025, forcing a re-evaluation of long-term value. Take top altcoins like Shiba Inu, for instance, which is currently at a crossroads, showing clear-cut signs of consolidation and momentum buildup. Trader’s expectation of a 300% $SHIB pump long-term is no longer unrealistic, provided $SHIB can hold two critical levels. Bitcoin, on the other hand, is currently at the opposite end of the spectrum, after crashing below $90K today. The reasons are multiple, from bulk whale sells to dwindling investor participation and increased fear. But there’s another problem worth talking about. Bitcoin, the original cryptocurrency, offers unparalleled security and trust but its slow transaction speeds, high fees, and lack of native smart contract capabilities, have hindered its investor appeal. Right now, Bitcoin ranks 30th in terms of TPS . A new contender, Bitcoin Hyper ($HYPER) aims to solve this trilemma directly. As the newest Bitcoin Layer 2 solution integrating the Solana Virtual Machine (SVM), Hyper promises to unlock Bitcoin’s dormant potential. By creating a high-speed execution layer on top of Bitcoin’s secure settlement, Bitcoin Hyper introduces the programmability and performance needed for modern dApps. This approach could fundamentally alter the competitive dynamics of the blockchain space, bringing high-performance applications to the industry’s most trusted network. Bitcoin Hyper Redefines Speed and Programmability Bitcoin Hyper ($HYPER) tackles Bitcoin’s core limitations head-on. Its modular architecture uses Bitcoin’s Layer 1 for ultimate security and settlement while a real-time SVM-based Layer 2 handles transaction execution. This allows for extremely low-latency processing and high-speed, low-cost transactions. The project’s decentralized Canonical Bridge facilitates seamless and secure cross-minting of $BTC into its L2 environment. By integrating the Solana Virtual Machine, Bitcoin Hyper brings fast, scalable smart contracts to the Bitcoin ecosystem. This move enables developers to build sophisticated DeFi applications, NFT platforms, and gaming dApps using familiar tools like the Rust programming language. This innovative approach is capturing significant attention. The ongoing presale for its native token, $HYPER, has already raised an impressive $27.8M+ at the time of writing, with $HYPER sitting at $0.013295. This strong demand signals major investor confidence in the project’s vision. If this type of hype continues, $HYPER could explode post release. Our price prediction for $HYPER , based on the project’s utility and community support, puts the token at $0.08625 by the end of 2026. In terms of ROI, we’re talking about potential profits of 548%. This is enough of an incentive for any crypto hunter looking for portfolio diversification. If this sounds like you, make sure you read our guide on how to buy $HYPER today. Check $HYPER’s live presale today. A New Ecosystem for DeFi, Gaming, and Payments The implications of bringing high-performance smart contracts to Bitcoin are massive. Bitcoin Hyper ($HYPER) unlocks a wide range of use cases previously impossible on the network, creating a new ecosystem for developers and users alike. Developers can build swaps, lending platforms, and staking protocols that leverage Bitcoin’s liquidity with the speed of an SVM chain. For everyday traders, use cases range from high-speed payments in wrapped $BTC with minimal fees to comprehensive DeFi protocols. With presale tokens currently priced at $0.013295, early participants are getting in at the ground floor – an opportunity which won’t last long anymore. The project has a projected release window between Q4 2025 and Q1 2026 so, if you want to invest, invest today. Secure your $HYPER today. This isn’t financial advice. DYOR and manage risks wisely before investing. Crypto is a high-risk market and presales have no success guarantee. Authored by Aaron Walker, NewsBTC: http://newsbtc.com/news/top-altcoins-optimistic-while-btc-crashes-bitcoin-hyper-next-outbreak",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 44,
        "NAME": "SHIB",
        "CATEGORY": "SHIB"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54571721,
    "published": 1763473696000,
    "title": "Crypto private key theft is now big business: Here’s what to know",
    "body": "Private key theft has become an automated, industrialized threat, highlighting the need for crypto users to remain vigilant, according to a report by GK8, a subsidiary of Galaxy Digital.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54572238,
    "published": 1763475704000,
    "title": "Stablecoins and “Skinny” Payment Accounts for Fintechs at the Fed",
    "body": "Skinny\" Payment Accounts for Fintechs at the Fed Will Support Stablecoin Issuance",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54572212,
    "published": 1763475593000,
    "title": "CoinDesk 20 Performance Update: Solana (SOL) Rises 5.8%, Leading Index Higher",
    "body": "Aptos (APT) was also a top performer, gaining 5.3% from Monday.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "CoinDesk Indices|CoinDesk Indices|CoinDesk 20|charts|Prices|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 70,
        "NAME": "APT",
        "CATEGORY": "APT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54573226,
    "published": 1763477487000,
    "title": "Cloudflare outage hits multiple crypto websites, social media channels",
    "body": "Many users reported not having access to websites, including Coinbase and Blockchain.com, and social media platforms after Cloudflare reported an “internal service degradation.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574036,
    "published": 1763478940000,
    "title": "Morning Minute: Aave Takes Aim at Banks, Fintechs with New Aave App",
    "body": "Aave's latest Neobank app will have TradFi sweating, with more yield and more insurance protection than ever offered before.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Opinion",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574300,
    "published": 1763496059000,
    "title": "HYPE Defies Market Carnage: Hyperliquid Price Rebounds After $96M Liquidation Shock",
    "body": "Hyperliquid’s native token, HYPE, is staging a surprisingly strong recovery just hours after the platform recorded one of the largest liquidation events in crypto history. Related Reading: 4 Bitcoin Indicators That Led To Market Rallies In The Last 2 Years Have Returned According to CoinGlass data, a massive $96.5 million BTC-USD perpetual contract liquidation hit Hyperliquid late Monday, part of a broader market washout that wiped out over 164,000 traders and triggered $814 million in total liquidations across exchanges. HYPE's price records some gains on the daily chart. Source: HYPEUSD on Tradingview Despite the carnage, Hyperliquid price has surged by 6% in the past 24 hours, climbing back above $41 on Tuesday and extending the rebound that began after defending the critical $36.51 support level last week. Whale Accumulation, Rising OI, and Strengthening On-Chain Metrics A wave of bullish catalysts is supporting the Hypeliquid price rebound. CryptoQuant data shows increasing whale activity, with large wallets steadily accumulating during recent dips. Exchange outflows have increased, active large addresses are expanding, and the average transaction size continues to rise. On the derivatives side, sentiment has clearly flipped. Coinglass reports that HYPE’s OI-weighted funding rate turned positive, hitting 0.026%, signaling that long traders are now paying shorts, an indication of bullish conviction. Open interest has also increased from $1.52B to $1.71B, indicating new capital entering the market and reinforcing upward momentum. Across pairs, HYPE is outperforming majors including BTC, ETH, SOL, and BNB, with analysts noting strong higher-lows structures developing on multiple charts. This relative strength suggests capital rotation is leaning toward Hyperliquid even as the broader crypto market cools. Technical Structure Points Hyperliquid Price Breakout Target at $48–$54 From a technical standpoint, the Hyperliquid price is consolidating within a symmetrical triangle, with the price being squeezed between rising support and descending resistance. Each compression cycle has produced higher lows, evidence that buyers are quietly gaining control. Momentum indicators echo this shift. The RSI has climbed to 48 and is turning upward toward neutral territory, while MACD histogram bars are shrinking, indicating fading bearish pressure. If the Hyperliquid price breaks above the $40–$41 diagonal resistance, analysts see a clear path toward the $44.48 zone. A confirmed breakout from the symmetrical triangle could then open the door to mid-range targets at $48 and $54, aligning with predictions from multiple market analysts tracking the ongoing consolidation. Related Reading: Bitcoin’s Drop Under $90K Sparks Bold Claims From Crypto Execs: ‘This Is A Generational Opportunity’ With whale accumulation rising, market structure tightening, and community sentiment firmly bullish, HYPE stands out as one of the few assets maintaining coordinated strength during a period of market-wide uncertainty. Cover image from ChatGPT, HYPEUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|Hype|HYPE price|Hype price anaysis|Hyperliquid|HYPEUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574299,
    "published": 1763494007000,
    "title": "Bitcoin ATM Company Founder Charged in Alleged $10 Million Money Laundering Scheme",
    "body": "Federal prosecutors in Chicago said the operator of a Bitcoin ATM network took in illicit funds and moved them through digital wallets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574298,
    "published": 1763492933000,
    "title": "Treasury Dept. Says Banks Can Keep Crypto On Their Balance Sheets in Certain Cases",
    "body": "National banks can now officially hold crypto to pay for network gas fees and engage in other crypto-related experiments, the OCC said Tuesday.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574293,
    "published": 1763492410000,
    "title": "Galaxy Digital Dumps 2,800 BTC as Bitcoin Crashes Below $90K",
    "body": "Bitcoin has officially slipped into dangerous territory after losing the $90,000 level for the first time since early spring, triggering widespread fear across the market. The drop has intensified concerns that BTC may be transitioning into a full bear market, as momentum weakens and buyers struggle to absorb the aggressive waves of sell pressure. Related Reading: Ethereum Approaches Historical Accumulation Level – Just 8% Away From LTH Cost Basis According to top analyst Darkfost, one of the driving forces behind the latest downturn is persistent selling from major institutional players. Data shows that Galaxy Digital has been offloading significant amounts of BTC. This steady stream of institutional selling has added weight to an already fragile market structure, likely accelerating last night’s drop. While sentiment is undeniably fearful, the combination of forced liquidations, institutional selling, and panic-driven exits may be creating the final stage of a broader reset — one that historically precedes major cycle reversals. Galaxy Digital’s Selling Accelerates Market Downside Darkfost reports that Galaxy Digital has been exceptionally active over the past several hours, adding considerable pressure to an already fragile Bitcoin market. According to the data, the firm moved more than 2,800 BTC, a sizeable amount given the current environment of fear and declining liquidity. A particularly notable portion of this activity is the 1,474 BTC transferred to Coinbase Prime, equivalent to roughly $135 million at recent prices. Such large inflows to an institutional exchange are typically interpreted as preparation to sell, and this wave of supply appears to have coincided with Bitcoin’s accelerated move below the $90,000 level. This type of selling activity from a major player like Galaxy Digital carries significant market implications. When large, sophisticated entities reduce exposure during a period of heightened volatility, it often intensifies fear among retail traders and shorter-term participants. The timing of these transfers — occurring as Bitcoin was already slipping through critical support zones — likely amplified the downside impact, contributing to the sharp overnight drop. However, while the immediate effect is clearly negative, analysts like Darkfost emphasize that such phases of heavy selling and forced repositioning are also characteristic of late-stage corrections. Once large sellers finish distributing, markets often stabilize and rebuild from stronger hands. Related Reading: $14B In Stablecoins Minted Since October Crash: Liquidity Returning To Crypto BTC Price Analysis: Testing Key MA as Fear Peaks Bitcoin’s price action on the 3-day chart shows a decisive breakdown, with BTC now trading around $90,400, sitting directly on top of the 200 moving average (red line) — a level that has historically acted as a final line of defense during major corrections. The rejection from the $110K–$115K zone triggered a cascade of lower highs, shifting market structure firmly into a short-term downtrend. Momentum has deteriorated quickly, and the clean break below both the 20-day (blue) and 50-day (green) moving averages confirms bearish control. Related Reading: Massive Bitcoin Bid Walls Spotted On Binance: Bulls Step In With 2,800 BTC Cluster Volume has spiked noticeably during the most recent candles, indicating forced selling and liquidation-driven moves rather than organic distribution. This aligns with the broader fear-driven environment and recent data showing large entities, including Galaxy Digital, offloading significant amounts of BTC. The high-volume flush suggests capitulation behavior, especially as Bitcoin revisits levels not tested since early 2025. If buyers defend this level and the price stabilizes, it could mark the beginning of a base formation. However, a clean breakdown below the 200 MA would expose the next major support near $82K–$85K, signaling deeper downside risk. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|Bitcoin breakdown|Bitcoin Galaxy Digital|Bitcoin news|Bitcoin Selling|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574255,
    "published": 1763490972000,
    "title": "Canada Approves Budget That Advances Policy for Stablecoins",
    "body": "The Canadian government narrowly won favor in Parliament for its budget push that includes a new policy governing stablecoins.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Canada|Bank of Canada|Stablecoins|Regulation|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 54574297,
    "published": 1763490601000,
    "title": "Crypto Selloff, REKT Dip, Monad Launch, & DAT trades!",
    "body": "Crypto majors are very red as btc briefly fell below $90k; btc -4% at $91,300; eth -5% at $3,050, bnb -2% at $915, sol -3% at $137. Icp (+9%), aster (+7%) and hype (+5%) led top movers. Crypto fear & greed remained in extreme fear at 11, now in that range for 6 straight days. Bitcoin wiped out its 2025 gains after falling below $92k (briefly sub-$90k), now down 2% on the ytd. The cboe unveiled “continuous” bitcoin and ethereum futures with 10-year terms as a perps-like alternative. The white house is considering to allow the irs to track and tax crypto holdings on foreign exchanges. Vitalik buterin and the ethereum foundation launched kohaku as a new initiative to bake privacy and security into ethereum wallets instead of treating them as add-ons. Trump international maldives announced tokenized real-estate stakes, letting investors buy blockchain-based shares in its 80-villa luxury resort. Hive stock jumped after posting record q2 revenue and landing new ai-infra deals, as investors rotated into miners despite broader crypto weakness. Japan is changing its crypto tax rules, dropping cap gains from 55% to 20%. Coinbase ventures announced an investment in usd ai.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574254,
    "published": 1763489882000,
    "title": "Chainlink's LINK Bounces 4% to Near $14 as Cryptos Rebound",
    "body": "LINK could target $14.50 if momentum sustains, CoinDesk Research's analysis tool suggested.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Chainlink|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574251,
    "published": 1763489751000,
    "title": "Bitcoin Backwardation Returns, a Pattern That Often Marks Market Bottoms",
    "body": "Futures prices for BTC are trading below spot prices, signaling \"extreme fear,\" which can sometimes be read as a contrarian buy signal.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Backwardation|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574249,
    "published": 1763489666000,
    "title": "Sen. Warren Keeps Pressure on Trump Crypto Ties as Market Structure Bill Negotiated",
    "body": "Senator Elizabeth Warren is maintaining political heat on President Trump's World Liberty Financial business interests in a letter to the Treasury and DOJ.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Elizabeth Warren|Jack Reed|Donald Trump|World Liberty Financial|crypto legislation|U.S. Senate|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574294,
    "published": 1763487656000,
    "title": "BTC Dipped to $90K! BTC wipes out 2025 Gains! Monad CoFounder Interview!",
    "body": "Crypto majors are very red as btc briefly fell below $90k; btc -4% at $91,300; eth -5% at $3,050, bnb -2% at $915, sol -3% at $137. Icp (+9%), aster (+7%) and hype (+5%) led top movers. Crypto fear & greed remained in extreme fear at 11, now in that range for 6 straight days. Bitcoin wiped out its 2025 gains after falling below $92k (briefly sub-$90k), now down 2% on the ytd. The cboe unveiled “continuous” bitcoin and ethereum futures with 10-year terms as a perps-like alternative. The white house is considering to allow the irs to track and tax crypto holdings on foreign exchanges. Vitalik buterin and the ethereum foundation launched kohaku as a new initiative to bake privacy and security into ethereum wallets instead of treating them as add-ons. Trump international maldives announced tokenized real-estate stakes, letting investors buy blockchain-based shares in its 80-villa luxury resort. Hive stock jumped after posting record q2 revenue and landing new ai-infra deals, as investors rotated into miners despite broader crypto weakness. Japan is changing its crypto tax rules, dropping cap gains from 55% to 20%. Coinbase ventures announced an investment in usd ai.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574291,
    "published": 1763487059000,
    "title": "Model Shows How XRP Could Hit $24 After ETFs Go Live",
    "body": "A new pricing model from Diana, a crypto analyst on X, projects that XRP could climb into the $7–$24 range within 60 days of the ETF launch, driven strictly by inflow pressure and the asset’s constrained liquid supply. The model reportedly relies on supply-absorption math, revealing how ETF-driven demand could shift XRP’s market pricing once XRP ETFs go live. New XRP ETF Inflow Model Maps A Direct Route To $24 Diana’s newly released “XRP ETF Launch Impact Model” outlines a clear, data-driven view on how ETF inflows alone could reprice XRP. Her framework tests multiple launch scenarios involving five to twenty ETFs, each seeded with $10 million to $45 million. Depending on the scale, total inflows range from $50 million to $900 million, absorbing between 0.08% and 1.50% of XRP’s estimated 60-billion-unit liquid supply. Related Reading: Here’s Why The Ethereum Price Is Crashing Again, Can It Breach $3,000? According to Diana’s projections, this level of liquidity absorption pushes XRP into a thirty-day range of $3.00 to $15.00, with the sixty-day window stretching from $3.80 up to $24.00. The top end of the model—where XRP approaches $24—emerges when twenty ETFs launch with maximum seed capital and nearly a billion dollars in early inflows. Diana argues that as issuers acquire XRP to build underlying exposure, the available float tightens, and the resulting supply squeeze forces a natural repricing cycle. However, XRP’s real-time price action tells a different story. Despite the successful debut of the Canary XRP ETF, XRP has failed to respond positively. The latest market data shows the asset trading near $2.14, posting a 13.5% decline over the week. Even so, Diana maintains that early price weakness is typical during ETF rollout phases and believes the projected inflow dynamics still position XRP for a sharp upward revaluation once institutional allocations begin to materialize. The Market Structure Delaying XRP’s Next Major Rally In a separate post, Diana outlined the market pattern she believes has been driving XRP’s recent price behavior. According to her, traders typically buy ahead of an ETF launch to front-run expected demand, creating a pre-launch rally driven by speculation rather than institutional activity. Once the ETF goes live, those early buyers take profit, producing the sharp launch-day dip that often surprises retail investors. Related Reading: What Will Trigger The XRP 1,300% Break To $36 This Bull Cycle? Diana noted that institutional inflows never arrive on day one. Wealth managers move through compliance checks, committee approvals, and allocation cycles, meaning real capital enters the market weeks later. She pointed to Bitcoin’s January 2024 ETF rollout as the clearest example, where the asset fell at launch but later surged to new highs as regulated inflows matured. She argues that XRP is showing the same early-stage pattern now: a weak market following the Canary ETF launch, profit-taking, and a temporary cooling phase. When these delayed inflows eventually begin to accumulate, Diana maintains that they will reinforce an upward pricing dynamic for XRP’s next major climb. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Ripple|ripple news|xrp|XRP ETF|XRP ETF News|XRP ETFs|XRP ETFs news|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574292,
    "published": 1763485262000,
    "title": "Prediction Market Myriad Partners With Walrus Decentralized Data Storage Layer",
    "body": "The partnership will see Myriad media stored on the developer platform, creating an immutable record with applications in DeFi and AI.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Our Company",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54574245,
    "published": 1763484135000,
    "title": "Bitcoin Gains Tuesday as Traditional Markets Slump in Rare Occurrence of Crypto Outperformance",
    "body": "After plunging below $90,000 overnight, BTC has regained the $93,000 level in U.S. morning action.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Breaking News|Market Wrap|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574243,
    "published": 1763483910000,
    "title": "U.S. Regulator OCC Clarifies How Banks Can Handle Network 'Gas Fees'",
    "body": "The U.S. Office of the Comptroller of the Currency explained to the national banks it oversees how they can hold crypto for paying gas fees.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Office of the Comptroller of the Currency|gas fees|crypto banking|Regulation|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574241,
    "published": 1763483156000,
    "title": "Société Générale’s SG-FORGE Issues First Tokenized Bond in U.S.",
    "body": "The bond uses Broadridge Financial Solutions' tokenization technology and runs on the Canton Network, a privacy-enabled blockchain infrastructure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Société Générale|Bond Markets|Tokenization|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      }
    ]
  },
  {
    "id": 54574239,
    "published": 1763482193000,
    "title": "Bitcoin Sell-Off Likely 'Complete', Rally Into Year-End Still in Play: StanChart Analyst",
    "body": "Standard Chartered’s Geoffrey Kendrick says bitcoin’s steep decline is part of a recurring pattern, with a rebound into year-end in his base case.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Standard Chartered Bank|MicroStrategy|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574286,
    "published": 1763481662000,
    "title": "European Bank Revolut Taps Ethereum Network Polygon for Remittances, Stablecoin Payments",
    "body": "Revolut is teaming with Ethereum scaling network Polygon to power crypto remittances and stablecoin payments.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "matic-network|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 38,
        "NAME": "MATIC",
        "CATEGORY": "MATIC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574289,
    "published": 1763481625000,
    "title": "With 42% Of XRP Holders Underwater, Analysts Say The Altcoin Could Crash Even Further",
    "body": "According to on-chain data and market reports, XRP is under fresh selling pressure because a large share of holders are now showing losses. Related Reading: Kiyosaki Stands His Ground—No Selling, More Bitcoin Buys Ahead Glassnode reports that 41.5% of XRP supply — or close to 27 billion tokens — sits in loss, the lowest profitability level since November 2024 when XRP traded near $0.53. At today’s levels, about four times higher than that November figure, a big share of holders bought above current prices and are now exposed. Holder Concentration Raises Selling Risk Market analysts say this positioning has changed trader behavior. Tony Sycamore, a market analyst at IG Australia, disclosed that many wallets likely picked up XRP when it was above $3.00 during months including January, July, August, September, and early October. That means a sizable group is now holding paper losses after the 40%+ slide from the July $3.65 peak. The scale of unrealized losses can encourage some investors to exit if prices keep drifting lower, which would add selling pressure. The share of XRP supply in profit has fallen to 58.5%, the lowest since Nov 2024, when price was $0.53. Today, despite trading ~4× higher ($2.15), 41.5% of supply (~26.5B XRP) sits in loss — a clear sign of a top-heavy and structurally fragile market dominated by late buyers. 📉… https://t.co/CBXPzDalxV pic.twitter.com/UpLNKV7LqD — glassnode (@glassnode) November 17, 2025 ETFs Could Bring Fresh Demand Or Little Impact Reports have disclosed a wave of exchange-traded funds tied to XRP that may alter flows. Canary Capital launched the first spot-XRP ETF on November 13 and posted the strongest first-day result for US ETFs in 2025. Franklin Templeton’s EZRP is scheduled to begin trading on November 18, with funds from Bitwise, 21Shares and CoinShares close behind. Traders hope these products will attract new money into XRP, but history shows initial demand can vary widely and depends on broader market liquidity and risk appetite. Key Foothold At the time of reporting, XRP trades around $2.19, down more than 10% in the last seven days. Analysts are watching the $2.16 area as a key foothold. 💥 JUST IN: FRANKLIN TEMPLETON’S SPOT $XRP ETF (EZRP) LAUNCHES TOMORROW. BULLISH 🚀 pic.twitter.com/rmGN1rdVGI — Amonyx (@amonbuy) November 17, 2025 If that level is defended, a bounce toward the $2.35–$2.60 band could be possible. If it fails, further retracement towards lower levels is a realistic outcome, in particular with a large portion of holders underwater and stop orders possibly clustered beneath current support. On-Chain Signals Paint A Top-Heavy Picture According to data from blockchain trackers, the market looks “top-heavy,” meaning that many of those who entered recently paid high prices for their coins and are thus more vulnerable. That pattern often makes rallies less stable until profit-taking pressure eases or fresh buyers step in. Related Reading: From Dotcom To Crypto: Veteran Analyst Says The Bull Run Isn’t Over At the same time, activity on the XRP Ledger has been rising, and renewed clarity around rules for digital assets in some jurisdictions has helped sentiment a bit. In the near term, price action will likely correlate with ETF inflows and whether buyers can defend the $2.15 level. A clear break above $2.60 could relieve selling pressure, while a break below support might trigger further selling by holders trying to limit losses. For now, XRP is stuck in a battle between the pressure of unrealized losses and new potential flows of capital from ETFs. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|altcoins|bitcoin|crypto|etf|xrp|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574233,
    "published": 1763481600000,
    "title": "Obex Raises $37M to Build 'Y Combinator' for RWA-Backed Stablecoins, Led by Framework, Sky",
    "body": "The incubator aims to fund stablecoin projects backed by compute, energy and fintech credit using Sky's up to $2.5 billion commitment, Framework Ventures' Vance Spencer said in an interview.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Stablecoin|Framework Ventures|MakerDAO|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 40,
        "NAME": "MKR",
        "CATEGORY": "MKR"
      }
    ]
  },
  {
    "id": 54574284,
    "published": 1763481521000,
    "title": "New Wave of Solana ETFs Hits the Markets as Fidelity, Canary, and VanEck Roll Out",
    "body": "Several Solana ETFs are launching across U.S. exchanges this week as asset managers test demand for products tied to altcoins and staking.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574283,
    "published": 1763465248000,
    "title": "How Tom Lee is Preparing For Ethereum’s Future",
    "body": "Fundstrat Global Advisors’ Head of Research Tom Lee, who is chairman of BitMine Immersion Technologies, shares his perspective on Ethereum. He explains how the asset is being leveraged by crypto treasury firms, as well as a growing number of financial institutions.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574593,
    "published": 1763496202000,
    "title": "Paxos debuts USDG0 to extend its regulated stablecoin across multiple blockchains",
    "body": "The new omnichain token brings fully backed dollar liquidity to Hyperliquid, Plume and Aptos while keeping a single regulated supply across networks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 70,
        "NAME": "APT",
        "CATEGORY": "APT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574379,
    "published": 1763494200000,
    "title": "Bitcoin charts flag $75K bottom, but analysts predict 40% rally before 2025 ends",
    "body": "Bitcoin whales are accelerating their purchasing despite BTC’s short-term bearish outlook. Meanwhile, Wall Street analysts expect BTC to hit new all-time highs before the end of 2025.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574377,
    "published": 1763493326000,
    "title": "Regulator clarifies US banks can handle gas fees using crypto holdings",
    "body": "The OCC said authorized national banks could hold crypto under specific circumstances, citing examples under the recently passed GENIUS act.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574371,
    "published": 1763486100000,
    "title": "Stablecoin giant Tether backs Ledn, targets global crypto lending",
    "body": "The investment from the stablecoin giant coincides with accelerating institutional interest and Wall Street participation in the crypto-backed loans sector.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574368,
    "published": 1763485200000,
    "title": "'Crypto Winter Is Here' — Mark Yusko Explains What May Come Next",
    "body": "In a recent Cointelegraph interview, Mark Yusko outlined the indicators pointing to a Bitcoin bear market and the forces shaping the road ahead.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574366,
    "published": 1763480741000,
    "title": "Institutions lean into crypto despite Bitcoin price slump",
    "body": "Institutions across the globe are adopting cryptocurrency, offering new services and buying into blockchain tech, despite slumping Bitcoin price.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54576535,
    "published": 1763499631000,
    "title": "Forget XRP, DFDV Exec Predicts Solana Price Is Headed For $10,000",
    "body": "A senior executive at DeFi Development Corp. (DFDV) has delivered one of the most aggressive long-term forecasts for the Solana price yet. According to him, Solana could see its value catapult to $10,000, leaving much of the market in the dust. This outlook, shaped by recent market turbulence and years of crypto experience, has drawn attention from industry experts as the DFDV executive outlines how SOL can reach this target by capturing a significant share of the global digital value. Solana Price To Reach $10,000 In 10 Years DFDV COO and CIO Parker White recently shared his long-term thesis on Solana following a rough week for risk assets in the market. White argued that Solana is poised for significant growth over the next decade, as digital value transfer becomes a core pillar of the global economy. Related Reading: Institutions Have Been Buying Solana Every Day For 2 Weeks, Is $300 Possible? In his view, the pressures of the past week only strengthen the case for Solana’s explosive upside potential. He emphasized that SOL is ideally positioned to capture an outsized portion of the global digital value, which he believes could propel the altcoin’s price toward the $10,000 mark. With SOL currently trading at $137 after declining by more than 25% in the past month, a surge to $10,000 would represent a massive gain of over 7,000%. As a Solana-focused treasury company, DFDV offers a different path of exposure. White has explained that he prefers building his position through the firm rather than purchasing SOL or a Solana ETF. He described the structure of DFDV as a Digital Asset Trust (DAT) controlled by him and a group of long-time colleagues, who collectively own more than 20% of the common stock. Furthermore, he stated that this concentrated level of ownership enables DFDV to aggressively grow its Solana per share much faster than a passive ETF could achieve. Responding to a comment questioning the purpose of such a structure, White emphasized that DFDV’s performance has already outpaced ETF alternatives. He pointed to a 32% annualized increase in Solana per share over the past three months, after accounting for operating costs, compared to the roughly 6% growth provided by ETFs after fees. For him, the long-term bet rests on achieving one SPS by late 2028—a milestone he believes could generate substantial wealth for both executives and token holders willing to endure ensuing market volatility. Why Volatility Is Central To DFDV’s Long-Term Outlook White made it clear in his X post that volatility is not a threat to DFDV’s model but a necessary factor. He highlighted that between now and 2028, he expects maximum volatility to flood the Solana market. He described DFDV as a volatility reactor designed to convert extreme market swings into long-term shareholder value, insisting that the firm can generate gains in both upward and downward market conditions. Related Reading: Solana To Dethrone Bitcoin And Ethereum? Here’s How The First SOL ETFs Are Faring For short-term traders, White advises that sharp price swings may provide opportunities to profit from rapid movements in SOL. He also stressed that long-term investors should prioritize accumulating and holding their investments, even during periods of high volatility. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Solana|DAT|DeFi Development Corp|DFDV|Digital Asset Trust|Parker White|Sol|SOL news|SOL Price|Solana ETF|Solana news|Solana Price|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54576295,
    "published": 1763499152000,
    "title": "Hawk Tuah Girl Added to Solana Meme Coin Lawsuit—After She Cooperated With Law Firm",
    "body": "After initially being left out, Haliey “Hawk Tuah” Welch has been named in a class action suit against the creators of the meme coin she promoted.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54576294,
    "published": 1763499151000,
    "title": "Man Who Went By 'Shrek' Pleads Guilty to Helping Steal $263 Million in Crypto",
    "body": "Authorities say stolen money was spent on luxury goods and exotic cars.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54577823,
    "published": 1763501689000,
    "title": "'Permissionless Assets’: Robinhood’s 3-Phase Tokenization Plan to Disrupt TradFi",
    "body": "Robinhood is working on infrastructure developments, said Offchain Labs' A.J. Warner, including 24/7 trading, and leveraging technologies like Arbitrum Stylus for compatibility.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Robinhood|Offchain labs|TradFi|Exclusive|Tokenization|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 71,
        "NAME": "ARB",
        "CATEGORY": "ARB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54577801,
    "published": 1763501510000,
    "title": "New Toku–PDAX partnership lets Filipino workers receive pay in stablecoins",
    "body": "The integration links token-based payroll with regulated cash-out rails, giving Filipino workers a way to receive stablecoin wages and convert them instantly to pesos.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54578772,
    "published": 1763503212000,
    "title": "XRP Supply In Profit Falls to 58.5% – Lowest Since 2024 Despite Higher Price",
    "body": "XRP is facing one of its most challenging moments in recent months as selling pressure accelerates and the broader crypto market slips into a risk-off environment. Bitcoin’s collapse below key psychological levels has dragged altcoins with it, and XRP has not been spared. Analysts are increasingly warning that the market may be entering a bear phase, pointing to tightening liquidity conditions, rising global economic uncertainty, and a sharp decline in investor appetite for risk assets. Related Reading: Ethereum Approaches Historical Accumulation Level – Just 8% Away From LTH Cost Basis What makes XRP’s situation more fragile is the growing number of holders sitting on unrealized losses. On-chain data reveals that many late buyers — particularly those who entered after the ETF announcement and during the previous rally — are now underwater as the price continues to slide. This top-heavy market structure is creating pressure on holders, amplifying sell-side momentum as fear spreads. The macro backdrop is adding fuel to the fire. With global markets adjusting to rate volatility, geopolitical tensions, and tightening dollar liquidity, capital is flowing out of speculative assets. XRP’s price is now caught at a crossroads: either it stabilizes at key support zones and absorbs the panic selling, or a deeper correction unfolds. XRP Supply in Profit Signals Structural Fragility According to new data from Glassnode, XRP’s market structure is weakening significantly as the latest sell-off unfolds. The share of XRP supply currently in profit has fallen to 58.5%, marking its lowest reading since November 2024, when XRP traded at just $0.53. Despite today’s far higher price — around $2.15, nearly four times last year’s level — an alarming 41.5% of the circulating supply remains at a loss. That represents roughly 26.5 billion XRP sitting underwater. This divergence highlights a critical issue: the market has become top-heavy, dominated by investors who entered late into the rally and bought at elevated price levels. These holders are now feeling acute pressure as prices retrace. Making the XRP supply distribution more fragile and increasing the probability of panic-driven selling. Historically, such setups often lead to accelerated downside movement unless strong demand steps in. The fact that so much supply is in the red even at current elevated prices suggests that speculative flows, rather than long-term conviction, fueled the previous surge. As these late buyers face losses, sell pressure can intensify, feeding into a vicious cycle of liquidation. Related Reading: $14B In Stablecoins Minted Since October Crash: Liquidity Returning To Crypto XRP Price Analysis: Testing Critical Support Levels XRP continues to struggle as selling pressure intensifies, with the chart showing a clear downtrend forming since early October. The price is now trading around $2.18, hovering just above a key horizontal support zone that has been tested multiple times throughout the year. Each bounce from this region has grown weaker, suggesting diminishing buyer strength and rising vulnerability to a deeper breakdown. The moving averages reinforce this weakening structure. XRP is trading below the 50-day, 100-day, and 200-day MAs, with all three beginning to curl downward. A classic sign of trend deterioration. The failed attempt to reclaim the 50-day MA in early November marked a significant shift, as sellers quickly regained control and pushed the price lower. Volume spikes during downswings further confirm that distribution is ongoing. Related Reading: Ethereum Whale Expands Position By 36,437 ETH – Bringing Total To $1.34B Additionally, the lower highs forming since the September peak signal that bulls are losing momentum. Each rally attempt is being sold into faster, and the wick rejections near the $2.50–$2.60 region highlight strong overhead resistance. If XRP loses the current support band, the next liquidity pocket sits near $1.70–$1.80, where buyers previously defended aggressively. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|xrp|XRP analysis|XRP Correction|xrp news|XRP Price|XRP supply|XRP Supply In Profit|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54578755,
    "published": 1763503131000,
    "title": "3 SOL data points suggest $130 was the bottom: Is it time for a return to range highs?",
    "body": "Charts and onchain data suggest that SOL might have bottomed at $130. Should traders anticipate a rally back to $200?",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54578893,
    "published": 1763503239000,
    "title": "When a Digital Dollar Isn’t Worth a Dollar Anymore Again",
    "body": "Muyao Shenwrites on how some of the initial damage from the tumble in crypto prices was first seen in the often opaque world of decentralized finance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54579888,
    "published": 1763504839000,
    "title": "Crypto Exchange Kraken Raises $800 Million at a $20 Billion Valuation",
    "body": "Kraken just raised $800 million, including $200 million from Ken Griffin’s Citadel Securities, ahead of a potential IPO.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54581060,
    "published": 1763506804000,
    "title": "Cardano on the Edge: Whale Loss Sparks Sell-Off as ADA Risks Drop to $0.43–$0.30 Range",
    "body": "Cardano (ADA) is once again under heavy market pressure after a series of whale-driven shocks and broken support levels sent the asset spiraling toward multi-month lows. Related Reading: Why Is Bitcoin Price Crashing? Arthur Hayes Isn’t Surprised Trading around $0.46–$0.49, ADA has slipped beneath several key zones that protected the price structure throughout 2024 and early 2025. Analysts now warn that the sell-off could deepen toward the $0.43 – $0.30 range if downward momentum continues. ADA's price trends to the downside on the daily chart. Source: ADAUSD on Tradingview ADA Slides as Whale Loss and Support Break Intensify Selling Pressure Much of the latest volatility stems from a dramatic whale incident. A dormant wallet holding 14.45 million ADA, inactive for five years, executed a swap into USDA, a pool so thin that the wallet absorbed devastating slippage. The whale walked away with only $847,000, realizing a staggering $6.2 million loss. The market’s response was immediate, confidence cracked, liquidity thinned, and sellers accelerated their exit. On-chain data shows broader whale activity amplifying the impact. More than 440 million ADA has been offloaded by large holders over the last month, further weakening the structure. ADA’s breakdown below $0.52, a level untouched since 2024, confirmed a bearish market regime dominated by lower highs, lower lows, and widening volatility bands. Technical Outlook Points Toward $0.43… or Even $0.30 Traders monitoring ADA’s trajectory highlight a crucial zone at $0.43, a technical target that aligns with the expanding bearish momentum reflected in indicators such as the MACD, RSI, and Bollinger Bands. The MACD’s deepening bearish crossover signals intensifying sell pressure, while the RSI hovering near oversold territory around 37 suggests weakness without confirming a recovery. Market analysts like Ali Martinez and Mr. Brownstone warn that failure to reclaim broken levels could expose ADA to a broader decline. Martinez identifies $0.30 as a long-term structural support, a cycle reset area that historically attracts accumulation during deep corrections. Analysts note that while capitulation metrics such as MVRV point to undervaluation, they do not eliminate the risk of further downside before any recovery materializes. Midnight’s NIGHT Token Launch Could Shift Sentiment, but Uncertainty Remains Even as ADA struggles, Cardano’s broader ecosystem is gearing up for a major milestone: the launch of Midnight’s NIGHT token on December 8, 2025. Midnight introduces privacy-focused smart contracts with selective disclosure, aiming to balance confidentiality with regulatory compliance. Analysts believe the NIGHT rollout could eventually inject positive momentum if adoption accelerates. Still, traders caution that ADA’s immediate outlook remains tied to technical fragility, liquidity challenges, and overall market sentiment. Related Reading: Dogecoin Cup And Handle Pattern Is Returning, What Happens To Price If It’s Completed? For now, ADA sits on a razor’s edge, stabilizing near support, but vulnerable to a deeper drop toward $0.43 and potentially $0.30 if sellers keep control. Cover image from ChatGPT, ADAUSD chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cardano|ADA|ADA price|adausd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54580991,
    "published": 1763506705000,
    "title": "Kraken Scores $800M Raise Backed by $200M Citadel Investment",
    "body": "The funding, which values Kraken at $20B, accelerates plans to integrate traditional markets with crypto infrastructure across multiple regions.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Kraken|Citadel Securities|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54581218,
    "published": 1763506800000,
    "title": "Bitcoin recovery expected as liquidity conditions change, but US macro remains a threat",
    "body": "Bitcoin’s recent weakness reflects broader economic stress, but improving liquidity and investors’ positive outlook for 2026 could set the stage for a strong rebound.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54584309,
    "published": 1763512093000,
    "title": "Trump Congressional Ally Discloses Latest Six-Figure Bitcoin Purchase",
    "body": "Brandon Gill has purchased up to $2.6 million in Bitcoin this year, according to House transaction reports.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54584144,
    "published": 1763511584000,
    "title": "Bitfury pivots to launch $1B tech fund after 14 years of mining Bitcoin",
    "body": "Bitcoin miner Bitfury started up in 2011, but has now pivoted to tech investing and will pour $1 billion into ethical AI and crypto startups.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54587469,
    "published": 1763517633000,
    "title": "XRP, Bitcoin Now In “Good Buy Zone,” Says Analytics Firm",
    "body": "On-chain analytics firm Santiment has revealed how Bitcoin, XRP, and other cryptocurrencies have dropped into a “buy zone” on a popular metric. MVRV Ratio Shows High Degree Of Short-Term Pain In Bitcoin & Altcoins In a new post on X, Santiment has discussed how the various assets in the cryptocurrency sector are looking based on the 30-day MVRV Ratio. The Market Value to Realized Value (MVRV) Ratio is an on-chain indicator that measures the ratio between the market cap and Realized Cap for a given coin. Related Reading: Bitcoin SSR Flashes Buy Signal: Rebound Incoming? The Realized Cap here refers to a capitalization model that calculates the asset’s total value by assuming the value of each individual token is equal to the price at which it was last transacted on the blockchain. In short, what this model captures is an estimation for the amount of capital that BTC investors as a whole have invested into the cryptocurrency. The usual market cap, on the other hand, represents the amount holders are carrying today. When the value of the MVRV Ratio is greater than 1, it means the market cap is greater than the Realized Cap. In other words, the overall network is in a state of profit. On the other hand, an indicator below this threshold implies the dominance of losses among investors. In the context of the current topic, the version of the MVRV Ratio that’s of interest is the 30-day one, tracking the profit-loss balance of the traders who purchased their coins within the past month. Below is the chart for the metric shared by Santiment that shows the trend in its value for five major cryptocurrencies: Bitcoin, XRP, Ethereum, Chainlink, and Cardano: As is visible in the graph, the 30-day MVRV Ratio has witnessed a plunge recently as the sector has gone through a bearish shift. Recent Bitcoin buyers are now about 11.5% underwater, while XRP ones are around 10.2%. Both of these are beyond the threshold that the analytics firm classifies as the boundary for a “good buy zone.” The 30-day investors have suffered even worse losses in the case of Ethereum, Cardano, and Chainlink, being down 15.4%, 19.7%, and 16.8%, respectively. All of these fall inside Santiment’s “extreme buy zone.” “In a zero sum game, buy assets when average trade returns of your peers are in extreme negatives,” noted the analytics firm. “The lower MVRV’s go, the higher the probability is of a rapid recovery.” Related Reading: Bitcoin Social Dominance Hits 4-Month High: What It Means It now remains to be seen whether market pain has been enough for XRP and others to cause a market rebound, or if more drawdown is coming. XRP Price At the time of writing, XRP is floating around $2.18, down more than 11% over the last week. Featured image from Dall-E, Santiment.net, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|bitcoin|Bitcoin MVRV|btc|xrp|XRP MVRV|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54588301,
    "published": 1763518983000,
    "title": "Canaan stock surges as Q3 revenue doubles on Bitcoin miner demand",
    "body": "Shares in Canaan jumped 20% on Tuesday as the Bitcoin mining hardware maker reported its third-quarter revenues doubled from last year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54588983,
    "published": 1763520094000,
    "title": "Kraken bags $800M for expansion plans at $20B valuation",
    "body": "Crypto exchange Kraken has raised $800 million across two funding rounds, which boosted its valuation to $20 billion.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54591589,
    "published": 1763524823000,
    "title": "Ethereum Price Will Bottom This Week, Predicts Tom Lee",
    "body": "Fundstrat co-founder Tom Lee says Ethereum is nearing a cyclical low, arguing that on-chain fundamentals and relative valuation versus Bitcoin indicate that ETH is “pretty close to bottoming this week.” “Personally, I think that we’re pretty close to bottoming this week,” Lee told CNBC, linking the current drawdown to a broader crypto correction that began after a sharp liquidation event on October 10. Despite that shock, he insisted that Ethereum’s core investment story remains intact. Will Ethereum Bottom This Week? For Lee, that story centers on Ethereum as neutral infrastructure for tokenization and stablecoins, increasingly relevant as Wall Street intensifies its on-chain ambitions. “There are stablecoin creations. Larry Fink and BlackRock and Wall Street want to tokenize assets, bring stocks, bonds, real estate onto the blockchain. And they have to find a neutral 100% uptime blockchain. That’s Ethereum. And that’s the fundamental story,” he said. Related Reading: Ethereum Approaches Historical Accumulation Level – Just 8% Away From LTH Cost Basis Lee framed crypto’s extreme volatility as structurally tied to how the market values long-term innovation rather than as a sign of fundamental weakness. “The price, of course, for Ethereum will fluctuate because crypto is hyper volatile. In fact, it’s kind of a… it’s sort of a feature of the blockchain itself,” he noted. “Crypto suffered from that liquidation event on October 10th, but because the fundamental story is intact and crypto discounts the future, that’s why it’s volatile, but it still looks pretty attractive here.” He placed the current move in the context of a broader risk-off environment and a continuing correction across digital assets. According to Lee, macro data remains a crucial driver of crypto cycles, particularly for Bitcoin. “The most correlated factor to Bitcoin prices when you see it… at a peak actually is the ISM,” he said, referring to US activity surveys. “So I think we’re still in a correction phase of crypto.” Asked specifically what underpins his bullish view on Ethereum now, Lee pointed to two structural “floor” mechanisms. First, he cited the value of assets locked on the Ethereum blockchain. “Ethereum kind of has several ways that it establishes a floor. One is the value of all the assets locked onto the blockchain, and that number is growing,” he said. “Historically, Ethereum bottoms when that ratio is about 50%. So I’d say we’re pretty close to that level. That’s why I think Ethereum is probably bottoming this week.” Related Reading: Ethereum Flashes Rare Oversold Signal As Price Hits Demand Zone — Major Rebound Loading? Second, he highlighted Ethereum’s valuation relative to Bitcoin, using both price and network value. “The other way to look at Ethereum is really its price ratio or even its network value ratio to Bitcoin. It currently sits at 0.032,” Lee said. “The long-term average, like the eight-year average, if we were just to trade to that eight-year average, would put Ethereum at around $12,000.” On that basis, Lee characterized Ethereum as undervalued versus its historical relationship with Bitcoin. “So I think Ethereum is undervalued because number one, the story is gaining relative to Bitcoin this year. But two, we’re getting this sort of intrinsic floor because of the value that the assets locked onto the Ethereum blockchain,” he argued. Summarizing Lee’s stance, the CNBC host concluded: “Tom Lee saying that Ethereum is bottoming this week.” Lee did not offer a specific price target or an exact day, but his message was clear: in his view, Ethereum is close to completing its correction as on-chain value and relative valuation metrics converge toward levels that have historically marked major bottoms. At press time, ETH traded at $3,018. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|BitMine|ETH|ETH news|eth price|Ether|ethereum|ethereum news|ethereum price|Tom Lee",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54593832,
    "published": 1763528427000,
    "title": "Global crypto rules for banks need reworking, says Basel chair",
    "body": "US and UK refuse to implement requirements for a risk weighting of 1,250 per cent for stablecoins",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54555322,
    "published": 1763476713000,
    "title": "Crypto market sheds $1.2tn as traders shun speculative assets",
    "body": "Bitcoin drops 28% in six weeks amid concerns about lofty tech valuations and US interest rates",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54594882,
    "published": 1763529866000,
    "title": "Senator Tim Scott pushes for December vote on crypto market bill",
    "body": "Senate Banking Chair Tim Scott says the committee could mark up a crypto market structure bill in December, sending it to President Donald Trump for early 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54595976,
    "published": 1763532053000,
    "title": "Bitcoin Short-Term Holders Panic: 65,200 BTC Sent To Exchanges At Loss",
    "body": "On-chain data shows Bitcoin short-term holders have transferred a large amount of BTC at a loss to exchanges, a sign of another capitulation wave on the network. Bitcoin Short-Term Holders Are Depositing To Exchanges At Loss As explained by CryptoQuant community analyst Maartunn in a new post on X, short-term holders (STHs) have just made another wave of underwater exchange deposits. Related Reading: XRP, Bitcoin Now In “Good Buy Zone,” Says Analytics Firm The STHs refer to the investors who purchased their Bitcoin during the past 155 days. This cohort is generally considered to include the weak hands of the market, who easily sell at the sight of market volatility. Recently, the market has been witnessing a bearish shift, which is exactly the type of event that STHs would be expected to react to. There are several ways to track the moves being made by these investors, with one such being the data of their exchange inflow transactions. Usually, the STHs transfer their coins to centralized exchanges when they are looking to sell, so a spike in exchange deposits from the group can be a sign of a selloff. During downtrends, loss selling is the most common type of distribution from the STHs due to the fact that their cost basis is at recent prices, which tend to be higher in bearish phases. Now, here is the chart shared by Maartunn that shows the trend in the 24-hour loss exchange inflows made by the STHs over the past month: As displayed in the above graph, the Bitcoin STHs made a large amount of loss deposits to exchanges when the cryptocurrency’s price crashed to $94,000 last week. The same appears to have followed during the latest downward move in the asset. In total, STHs have sent 65,200 underwater tokens to the exchanges over the last 24 hours. At the current exchange rate, this amount is worth a whopping $6.08 billion. This new wave of capitulation wave in the STHs came as BTC dropped toward $89,000. Interestingly, what has followed this FUD from the STHs has so far been a rebound for the asset. On-chain analytics firm Glassnode has also shared data related to the STH capitulation in a new X post. Glassnode’s chart is for the amount of loss that the STHs as a whole are realizing through their transactions across the network. The 7-day exponential moving average (EMA) value of this metric is currently sitting at $427 million, which is the highest that it has been since November 2022, when the last bear market bottomed out. Related Reading: Bitcoin SSR Flashes Buy Signal: Rebound Incoming? “Panic selling is elevated & clearly rising, now exceeding the loss levels seen at the last two major lows of this cycle,” noted the analytics firm. BTC Price Bitcoin witnessed a bounce back to $92,800 during the past day. Featured image from Dall-E, Glassnode.com, CryptoQuant.com, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin capitulation|Bitcoin Loss Selling|Bitcoin short-term holders|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54598028,
    "published": 1763535657000,
    "title": "Kraken Achieves $20 Billion Valuation With $200 Million Investment From Citadel",
    "body": "The US-based cryptocurrency exchange Kraken recently secured a substantial $200 million investment from Citadel Securities, a global market maker. This investment values the exchange at an impressive $20 billion. Kraken’s Growth Backed By Citadel Securities Citadel Securities has expressed enthusiasm about supporting Kraken’s growth, emphasizing the firm’s role in shaping the future landscape of digital innovation within markets. Related Reading: Bitcoin Price Alert: This Indicator Signals SELL, Could History Repeat With A 67% Drop? Jim Esposito, president of Citadel Securities, highlighted their commitment to collaborating with Kraken on risk management and market structure analysis, among other strategic initiatives. This capital infusion comes on the heels of a previous financing round back in September of this year, during which the digital asset platform successfully raised $600 million at a $15 billion valuation. Investors in this earlier round included Wall Street entities such as Jane Street, DRW, HSG (formerly known as Sequoia Capital China), Oppenheimer, Tribe Capital, and the family office of Arjun Sethi, who serves as the exchange’s co-CEO. IPO Plans Unhurried Despite Strong Figures Kraken’s fundraising efforts, totaling $800 million across its two recent financing rounds, have significantly strengthened the company’s financial position ahead of its planned initial public offering (IPO) in the upcoming year. Related Reading: Crypto Market Wipes Out $1 Trillion Since October: Analyzing The Forces Behind The Crash However, last week, Bitcoinist reported that Kraken has no plans to speed up its initial public offering, backed by robust financial figures. In a Yahoo Finance interview, Sethi stated, “We have enough capital on our balance sheet as a private company. We don’t race to the door as quickly as possible.” Arjun Sethi previously emphasized the importance of maintaining a prudent approach, ensuring that the company’s financial foundation remains robust and poised for sustainable growth. In the wake of the recent funding, Sethi stated: This investment represents long-term conviction in Kraken’s mission to build trusted, regulated infrastructure for the open financial system. Our focus has always been straightforward: to create a platform where anyone can trade any asset, anytime, anywhere. The exchange also disclosed substantial revenue growth in the third quarter of the year, reaching $648 million. Yet, its closest competitor, Coinbase—the largest exchange in the country—reported revenue growth of $1.9 billion. Kraken’s recent acquisitions, including its $1.5 billion purchase of the futures trading platform NinjaTrader, are further examples of the exchange’s strategic expansion efforts this year. Looking ahead, the exchange revealed in a blog post: We plan to enter new markets across Latin America, Asia Pacific and EMEA, while broadening our offerings beyond crypto to include additional asset classes, advanced trading tools and staking solutions, expanded payment services and enhanced institutional capabilities. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto|crypto market|crypto news|cryptocurrency|kraken|Kraken co-CEO|Kraken crypto exchange|Kraken IPO|Kraken IPO plans|Kraken news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54598026,
    "published": 1763535654000,
    "title": "Solana Reclaims $140 As Second Wave Of SOL ETFs Debut – Is A Rebound Coming?",
    "body": "Amid the second wave of crypto-based Exchange-Traded Funds (ETFs), Solana (SOL)-based investment products have been leading the charge, fueled by strong demand despite the recent market volatility. As a new group of investment products based on the altcoin hits the market and SOL’s price starts to recover, some suggest that a rebound could be underway. Related Reading: Analyst Shares Worst-Case Scenario For Bitcoin (BTC) As Price Shows Concerning Signs Solana ETFs Take Over The second wave of Solana ETFs has arrived in the market after the successful launch of SOL-based investment products. On Monday, VanEck debuted its Solana ETF (VSOL) on Nasdaq, becoming the third investment product based on the altcoin to launch over the past month. According to the announcement, the firm is waiving its 0.30% fee on the first $1 billion in assets under management (AUM) or until February 17, 2026. Meanwhile, its third-party staking provider will also waive its fee for staking services under the same conditions. Adding to the momentum, Fidelity and Canary Capital launched their FSOL and SOLC ETFs on Tuesday, after recently filing 8-A forms with the Securities and Exchange Commission (SEC). Senior Bloomberg analyst Eric Balchunas noted that Fidelity is “easily the biggest asset manager in this category with BlackRock sitting out,” adding that it is “Game on” with the other launches. Meanwhile, Nate Geraci also highlighted the new launch, but expressed surprise that BlackRock is “sitting this one out” as many anticipate a successful performance. Notably, Bitwise and Grayscale debuted their BSOL and GSOL ETFs at the end of October, registering a record-breaking performance since their launch. Farside Invest data shows that SOL-based investment products have recorded over $390 million in inflows, with 15 consecutive trading days of positive net flows, signaling strong institutional demand for the products. In a Tuesday X post, Bitwise’s CEO, Hunter Horsley, noted BSOL’s positive performance despite the market correction, affirming that “prices are in the eye of the beholder.” “ETF investors continue to buy the dip. Grateful for the trust in Bitwise to steward investor assets,” he added. Institutional Demand To Fuel SOL’s Rebound? Amid the Tuesday launches, SOL’s price bounced 8.4% from its five-month low of $128, recorded on Monday. The cryptocurrency has declined 12% over the past month, losing crucial levels during the market correction. However, Bybit recently suggested that the newly launched investment products could reshape “its price trajectory and market structure for years to come.” In a recent report, the crypto exchange’s analysts noted that the altcoin joined Bitcoin (BTC) and Ethereum (ETH) as one of the few digital assets with regulated brokerage access in the US. This “represents a structural shift in how SOL is accessed, traded and perceived,” significantly expanding SOL’s investor base and confidence. “If historical patterns hold, Solana could be on the cusp of a multi-quarter rally that redefines its position in the crypto hierarchy,” the exchange affirmed. Analyst Ted Pillows pointed out SOL’s price action, calling it “one of the worst-performing large caps recently.” However, he argued that, because of this, most of its downside liquidity has already been taken out, with “decent liquidity clusters around the $170-$200 level.” Related Reading: Crypto Market Wipes Out $1 Trillion Since October: Analyzing The Forces Behind The Crash To analysts, if the market starts to recover and stabilizes, Solana could rally 20%-40% to retest this area. Meanwhile, Daan Crypto Trades affirmed that SOL is “putting in quite the reversal relative to its BTC pair,” as the cryptocurrency has broken out of a three-week downtrend against Bitcoin after some failed attempts. As of this writing, Solana is trading at $141, a 25.3% decline in the monthly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitwise|BSOL|Canary Capital SOLC|crpyot market correction|crypto analyst|Fidelity FSOL|grayscale|Sol|SOL/BTC|Solana|Solana ETFs|Solana Price|SOLUSDT|VanEck VSOL",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54600955,
    "published": 1763541008000,
    "title": "Bitcoin Is 80% Into The Bear Market, Analyst Reveals What Will Confirm It 100%",
    "body": "With the Bitcoin price struggling recently, the expectations are that the crypto market is headed into another bear run. This is characterized by Bitcoin losing $100,000 after over four months, and has not been able to reclaim this major level. Meanwhile, sell-offs among whales have continued, putting billions of dollars worth of selling pressure on the cryptocurrency. As such, the probability that Bitcoin is going into a bear market has shot up considerably during this time. Analyst Warns Of Imminent Bitcoin Bear Market Crypto analyst Titan of Crypto has taken to the X (formerly Twitter) platform to share a warning with the broader crypto community. This warning was that the digital asset was more likely in a bear market compared to a bull market, giving an 80% score in favor of a bear market and only 20% in favor of a bull market. Related Reading: The ‘Insanely Bullish’ Dogecoin Setup That Will Trigger A 600% Rally To $1 This comes as there seems to be an erosion of the 4-year cycle that has characterized Bitcoin and the crypto market since its inception. The cycle expectations have deviated completely, especially as there has been no significant run for altcoins. Speaking on this cycle theory, the crypto analyst urges investors to look at the market with more nuance. This includes not following the market with blind optimism, but rather actually looking at the market for what it is and where it could be headed. The post shows the Bitcoin RSI and how it has looked before Bitcoin went into previous bear markets. Currently, there seems to be some similarity, but the crypto analyst believes that the direction will be determined next week. Titan of Crypto says that if the next week closes by November 24 looks the same, then it means that the bear market is here. Bear Market Indicators Triggered? In contrast to Titan’s stance, the Bull Market Peak Indicators tracked by the Coinglass website continue to show that the Bitcoin top is not in. This tracker consists of 30 indicators in total, showing if the Bitcoin top has been cracked in relation to historical performance, and none of them have been triggered. Related Reading: Ripple Exec Addresses Tax Issue On XRP Ledger, Where Does It Go? At the time of writing, the process bar sits just above 46% out of 100%, suggesting that it is not even halfway there to hitting the top. Thus, the indicators point toward a time to hold rather than sell, as the Bitcoin top has not been reached. The Crypto Fear & Greed Index has also fallen to an Extreme Fear score of 10, which is the lowest the index has been since March 2025. Interestingly, when the index is in the red is usually when the market sees a possible reversal. However, it remains to be seen how buyers will respond to the market from here. Featured image from Dall.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54601647,
    "published": 1763542254000,
    "title": "Next Crypto To Explode? Solana’s $130 Bottom Puts New Alts In Play",
    "body": "What to Know: Solana’s strong defense of $130, plus a V-shaped recovery pattern, keeps a move back toward the $180–$250 range firmly on the table. Spot SOL ETFs have now attracted around $420M in cumulative inflows, signalling sustained institutional interest even after the recent correction. SUBBD Token, PEPENODE, and Aster tap AI creators, GameFi mining, and perp DEX liquidity respectively, aligning with narratives favored in risk-on phases. Solana just printed the kind of setup traders love. After a sharp 25% drawdown from $173, $SOL bounced perfectly from weekly support around $130 and is now forming a V-shaped recovery pattern, with technicians eyeing a move back into the $180–$250 range if momentum holds. On the derivatives side, futures open interest has climbed back above $7B while funding has flipped positive, showing that both spot and leveraged buyers are stepping back in. At the same time, Solana’s spot ETFs have quietly stacked 15 straight days of inflows , with US products now sitting on $420M in cumulative net inflows and more issuers lining up launches. That is textbook ‘institutional dip-buying.’ Onchain, daily active addresses on Solana are up 18% in the last 30 days , reinforcing the idea that this isn’t just a speculative dead-cat bounce but a network with real usage. If the $130 level continues to act as a base, a proper rotation back into high-beta altcoins becomes much easier to justify. In that kind of environment, the hunt for the next crypto to explode usually shifts toward narratives that rhyme with what institutions are already buying: scalable infra, real revenue, and high-conviction niches like AI, creator platforms, and DeFi perps. That’s where SUBBD Token , PEPENODE , and Aster slot into the conversation as traders look beyond SOL itself. 1. SUBBD Token ($SUBBD) – AI Creator Rails For ETF-Age Liquidity If Solana’s ETF flows prove anything, it’s that institutions will pay for clean, narrative-driven exposure. SUBBD Token ($SUBBD) leans directly into that with an AI-powered subscription platform for creators, backed by over 2K top earners and 250M+ followers already plugged into its ecosystem. The token sits in presale at $0.056975, with more than $1.3M raised so far and staking yields set at 20% APY.The idea is simple but powerful: unify creator payments, AI content tools, exclusive access, and XP-style loyalty mechanics under one token. In a world where ad revenue is choppy, and platform fees can chew through 70% of creator income, an AI agent that automates management while keeping more upside on-chain is an easy sell. Price-wise, our SUBBD Token price prediction forecasts put potential 2026 highs for $SUBBD around $0.66 if the roadmap and onboarding of big-ticket influencers land as planned. From today’s presale level, that implies over 10x on a 2026 scenario, assuming broader market conditions don’t rug the sector. Those numbers obviously aren’t guaranteed, but they show how quickly an AI-plus-creator narrative can re-rate if ETF-era liquidity starts hunting for higher beta. For traders looking to position ahead of a potential SOL-led alt season rather than chasing it, SUBBD Token is one to watch. Front-run the tokenized content revolution. Check out the SUBBD presale now. 2. PEPENODE ($PEPENODE) – Mine-To-Earn Meme Energy With Fat Staking While Solana is attracting the suits, PEPENODE ($PEPENODE) is busy courting degen gamers.It wraps the ever-present Pepe meme around a ‘mine-to-earn’ browser game where players build virtual mining rigs, upgrade nodes and facilities, and earn not just $PEPENODE but also other meme coins like $PEPE as rewards. The presale has already crossed $2.1M raised, with the current token price around $0.0011546 and staking APYs at a chunky 595%. That combo of high yield plus GameFi upside is exactly the sort of risk-on profile that tends to catch a bid once majors like $SOL firmly reclaim trend. Our PEPENODE price prediction for 2026 forecasts highs around $0.0077 by the end of the year if the mine-to-earn economy, token burns from in-game spending, and CEX/DEX listings all come together. From today’s presale price, that translates to 567% gains. Again, that’s a modeled path, not a promise, but it shows how quickly things can move if the game actually hits and meme liquidity rotates back. For anyone betting that Solana’s bottom will drag meme beta back from the dead, PEPENODE is a high-octane candidate. Explore the PEPENODE presale today. 3. Aster ($ASTER) – Perp DEX Liquidity Play As $SOL Volatility Returns If $SOL really is grinding back toward the $180–$250 band, perp DEXs are obvious beneficiaries. Volatility plus leverage is their bread and butter. Aster ($ASTER) fits that bill as a next-gen, multi-chain perp and spot DEX, offering high leverage, hidden orders, and cross-chain trading without the usual bridging headaches.The token, $ASTER, currently trades around $1.31 with a market cap above $3.1B and deep daily volume of $1.2B, placing it firmly in large-cap DeFi territory rather than niche micro-cap land. It’s already listed on major centralized venues, with Binance handling a large chunk of liquidity via the ASTER/USDT pair, which makes it far easier for bigger players to size into positions compared with most perp-DEX tokens. On the infrastructure side, Aster has processed hundreds of billions in cumulative volume, with TVL and open interest both sizable enough to matter if leveraged trading really picks up again into a Solana-led recovery. For traders wanting a liquid, exchange-listed way to express a view on higher perp activity if $SOL volatility persists, Aster is a strong candidate. Consider adding Aster via Binance. Recap : Solana’s bounce from $130, backed by rising ETF inflows, growing open interest, and healthier onchain activity, has reopened the door to an altcoin rebound. In that context, SUBBD Token targets AI creator rails, PEPENODE leans into mine-to-earn meme gaming, and Aster offers leveraged DeFi exposure, giving different ways to position for a potential next crypto to explode rotation if $SOL’s recovery holds. This article is informational only; always do independent research and never invest money you can’t afford to lose. Authored by Aaron Walker, NewsBTC, www.newsbtc.com/news/next-crypto-to-explode-as-solana-finds-130-bottom/",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54602441,
    "published": 1763543658000,
    "title": "BlackRock's Bitcoin ETF, IBIT, Posts Record One-Day Outflow of $523.2 Million",
    "body": "The average spot bitcoin ETF buyer sits near a $90,000 cost basis, leaving most investors roughly flat.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|BlackRock|Bitcoin ETF|ETFs|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54604041,
    "published": 1763546432000,
    "title": "Crypto Traders See Bullish Tailwind: Hassett Jumps In Fed Chair Odds",
    "body": "Donald Trump has pushed the Federal Reserve back into the center of the crypto macro narrative, telling reporters he “already” knows who should succeed Jerome Powell and triggering a sharp repricing in real-money prediction markets in favor of Kevin Hassett. In remarks in the Oval Office, Trump said: “I think I already know my choice,” when asked about the next Fed chair. He added that he would “love to get the guy currently in there out right now, but people are holding me back,” a clear swipe at Powell without naming him. Trump also hinted at the shape of his shortlist, saying, “We have some surprising names and we have some standard names that everybody’s talking about. And we may go the standard way. It’s nice to every once in a while go politically correct.” That was enough to move markets. On Polymarket and Kalshi, contracts on “Who will Trump nominate as Fed Chair?” quickly converged around Hassett, with odds in the mid-40s to high-40s percent range. Jim Bianco summarized the shift by writing: “He wants Bessent but will take Hassett. The rest get to take selfies in the Oval Office.” In a follow-up, he noted that “Hassett (blue) is separating himself from the pack and is on the verge of being the first person to trade over 50%,” as prediction markets pushed his contract well clear of rivals. Kalshi’s own social media account underscored the move: “BREAKING: Trump thinks he ‘already knows’ who will be next Fed Chair. 47% chance it’s Kevin Hassett.” The pseudonymous trader Byzantine General zoomed out to the timeline, pointing out that “Powell’s term ends May next year,” and sketching out a Q2 scenario with “a FED chair that listens to Trump” and “tariff dividends for plebs,” before cautioning that “you never know with Trump of course, but man, there could be something cooking.” Related Reading: Crypto Market Wipes Out $1 Trillion Since October: Analyzing The Forces Behind The Crash What Hassett Could Mean For The Crypto Market For macro-oriented crypto traders, the key is the policy signal embedded in those probabilities. Hassett is widely perceived as more dovish than Powell and more aligned with Trump’s preference for easier financial conditions. That is why trader CRG (@MacroCRG), framed the moment as the arrival of a “New hand picked super dove as Fed chair coming soon.” Macro and crypto analyst Alex Krüger went further, arguing that the Fed-chair race is the real medium-term driver for risk assets once the current FOMC noise fades. “Here’s the next macro catalyst after the FOMC. A bullish catalyst the market is paying no heed to atm. It’s hard to peer into the horizon when stressed to the marrow about the present,” he wrote, adding that “the most bullish choices would be Hassett (likely), Rieder (possibly) and Zervos (unlikely).” Related Reading: Crypto Carnage Continues — Tom Lee Exposes What’s Really Going On The reason crypto traders care is straightforward: crypto assets trade as high-beta, liquidity-sensitive risk assets. A chair seen as more willing to cut rates faster, tolerate easier financial conditions or respond aggressively to equity and growth weakness is, in market logic, a structural tailwind for the long-run liquidity environment that underpins speculative flows into bitcoin and other cryptocurrencies. At the same time, Trump’s open pressure on Powell and his readiness to talk about replacing the Fed chair in overtly political terms reinforce another strand of the crypto thesis. The more investors worry about the politicization of US monetary policy and the erosion of central-bank independence, the more compelling the “Bitcoin as hedge against political and institutional risk” narrative becomes for a subset of allocators. For now, nothing has changed at the Fed. Powell remains in office, and all that has moved is a set of probability distributions on prediction markets. But as those distributions shift toward Kevin Hassett, crypto traders are already treating the prospective hand-off as a latent, potentially significant bullish tailwind building in the background. At press time, the total crypto market cap was at $3.11 trillion. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|Bitcoin news|crypto|Crypto market news|crypto news|fed|Kevin Hassett|Next Fed Chair",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54603995,
    "published": 1763546070000,
    "title": "Senators warn Trump-linked crypto firm may pose national security threat",
    "body": "Democratic senators are urging a probe into WLFI over alleged token sales to North Korea- and Russia-linked wallets, while researchers say some claims stem from false positives.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 205,
        "NAME": "TOKEN SALE",
        "CATEGORY": "TOKEN SALE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54604471,
    "published": 1763546811000,
    "title": "Ondo wins Liechtenstein approval to offer tokenized stocks in Europe",
    "body": "US tokenization platform Ondo is preparing to offer tokenized stocks and ETFs in 30 European countries after receiving approval in Liechtenstein.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54604742,
    "published": 1763547374000,
    "title": "US and UK revolt forces Basel to rethink brutal crypto capital rules for banks",
    "body": "Basel’s toughest crypto rules are under review as the US, UK, and the EU diverge, with booming stablecoin adoption forcing a rethink of 1,250% capital charges, the group’s chair told the FT.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54605619,
    "published": 1763548763000,
    "title": "BlackRock leads near $3B Bitcoin November ETF exodus with record $523M outflows",
    "body": "US Bitcoin ETFs are nearing $3 billion in November outflows as a fresh death cross, fading Fed rate cut odds, and smart money shorts weigh on sentiment.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54606465,
    "published": 1763550416000,
    "title": "New Hampshire’s Bitcoin Bond Bet Puts $140T In Play – Bitcoin Hyper Steps Up",
    "body": "What to Know: New Hampshire’s $100M Bitcoin-backed municipal bond gives $BTC a compliant route into a roughly $140T global debt market. The state’s strategic Bitcoin reserve law, allowing up to 5% of funds in Bitcoin, shows treasuries are treating crypto as long-term collateral. Bitcoin Hyper aims to provide a fast, SVM-powered Bitcoin Layer 2 so that this new collateral can move efficiently across DeFi and institutional rails. With $28M raised, audited contracts, and staking at 41%, $HYPER targets utility in Bitcoin’s evolving bond and reserve landscape. New Hampshire just did what crypto Twitter has been memeing about for years: it put Bitcoin in a suit and marched it into the bond market. The state’s Business Finance Authority has approved a first of its kind $100M municipal conduit bond backed by over-collateralized Bitcoin. The borrower posts around 160% of the bond value in $BTC as collateral, with liquidation only if coverage drops below roughly 130%. This mechanism effectively opens a path for digital assets into a global debt market worth about $140T. If more states, cities, and agencies copy the playbook, Bitcoin stops being just a macro hedge and starts behaving like high-grade collateral in traditional fixed income. New Hampshire is not acting in a vacuum either. Earlier this year, it became the first state to pass a strategic Bitcoin reserve law , letting the treasurer allocate up to 5% of public funds into Bitcoin and other mega-cap digital assets, held in tightly regulated custody. Taken together, a sovereign-style reserve plus a Bitcoin-backed bond framework is a clear signal: state-level actors are preparing to use Bitcoin as both reserve asset and working collateral. Once Bitcoin is locked into bonds, reserves, and tokenized debt rails, slow base layer transactions and high fees become a real problem. You cannot plug institutional-grade collateral into a creaky payment pipe. That is exactly where the Bitcoin Hyper ($HYPER) presale slides into the conversation. Bitcoin Hyper Builds Rails For Bitcoin’s New Collateral Era If Bitcoin is going to sit behind municipal bonds and state reserves, the market will need fast, programmable infrastructure that still respects Bitcoin’s security guarantees. Bitcoin Hyper ($HYPER) is aiming to be that middle layer. The project is building a Bitcoin Layer 2 that uses a canonical bridge and Solana Virtual Machine tech to move wrapped Bitcoin on a high-throughput chain. Users deposit $BTC to a monitored L1 address, an SVM smart contract verifies the transaction, and the equivalent amount is minted on the Hyper network. Transactions are then cleared on the L2 with near instant finality and are periodically settled back to Bitcoin. On top of that settlement layer, Bitcoin Hyper plans to support dApps, DeFi, NFTs, and gaming via SVM, so the same infrastructure that moves Bitcoin collateral can also host more complex products. $HYPER: The Potential ROI of $BTC’s New Infrastructure The alignment between what New Hampshire has just kicked off and what Bitcoin Hyper is building is hard to ignore. A Bitcoin that backs bonds and sits in strategic reserves needs more than cold storage vaults; it needs a performant, audited, programmable environment so value can actually move. Bitcoin Hyper is trying to occupy that lane while $HYPER is still under a cent and a half. The presale just surpassed $28M with $HYPER priced at $0.013295, which already makes this one of the best crypto presales of 2025. Considering the project’s long-term utility, investor support, and current presale numbers, our price prediction for $HYPER puts the token at $0.08625 by the end of 2026. A solid bull market could push it to $0.253 by 2030, likely higher once the implementation process kicks off. In terms of profit, think ROIs of 548% by 2026 and 1,802% or higher by 2030. If the thesis is that Bitcoin becomes pristine collateral for a chunk of that $140T debt pile, then high-speed, secure rails that keep that collateral moving are the picks and shovels. Bitcoin Hyper is positioning itself as one of those rails, so read our guide on how to buy $HYPER before the presale ends; Q4 2025-Q1 2026 is the projected window for the official launch. Go to the presale page and buy your $HYPER today. This isn’t financial advice. DYOR before investing. Authored by Aaron Walker, NewsBTC: https://www.newsbtc.com/news/new-hampshire-bitcoin-backed-bond-helps-bitcoin-hyper",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]