[
  {
    "id": 57773346,
    "published": 1770339624000,
    "title": "Why Is The XRP Price Falling Today? Weak On-Chain Signals Raise Risk of a Move Toward $1.00",
    "body": "The XRP price is facing renewed selling pressure, even as Ripple announces another step toward deeper institutional integration with the decentralized finance (DeFi) ecosystem. Related Reading: Bitcoin Crash To $72,000 Signals Major Reset: On-Chain Metrics Deteriorate The token is trading near $1.42, down more than 10% over the past 24 hours, as market participants focus less on corporate developments and more on weakening technical and on-chain signals. The divergence shows a familiar pattern in the markets, positive infrastructure news does not always translate into price support. The latest drop accelerated after XRP slipped below $1.60, a level that had previously served as short-term support. Once that floor gave way, automated selling and stop-loss orders appear to have intensified the move, pushing prices closer to levels not seen since the last broader market pullback. XRP's price trends to the downside on the daily chart. Source: XRPUSD on Tradingview XRP Price Slides as Key Support Breaks Technical indicators suggest the sell-off has been sharp. The Relative Strength Index is approaching oversold territory, reflecting strong downside momentum rather than a slow grind lower. Trading volumes have also picked up during the decline, a sign that sellers are acting with conviction rather than hesitation. On-chain data adds to the cautious outlook. Recent metrics show reduced network activity and limited evidence of sustained accumulation at current levels. In previous corrections, XRP price often stabilized when wallet activity and transaction counts began to rise. If the price fails to reclaim $1.60, analysts increasingly point to the $1.00 psychological level as the next area to watch. While oversold conditions can sometimes trigger short-term bounces, the broader structure suggests XRP remains vulnerable unless sentiment improves. Ripple’s Hyperliquid Integration Fails to Lift XRP The price weakness comes despite Ripple announcing that its institutional prime brokerage arm, Ripple Prime, has added support for Hyperliquid, a decentralized derivatives platform. The integration allows institutional clients to access on-chain perpetual futures while cross-margining those positions with assets such as foreign exchange, fixed income, and other digital assets through a single account. Market reaction has been mixed. While the move underscores Ripple’s push to bridge traditional finance and DeFi, it does not create a direct new demand driver for XRP itself. Some investors had hoped Ripple would prioritize deeper integration of the XRP Ledger. Diverging Signals Across the Market The contrast is clear elsewhere. Hyperliquid’s native token, HYPE, has shown relative strength following the integration news, trading above key moving averages even as the broader market weakens. That divergence suggests capital is flowing toward platforms tied to institutional trading activity, rather than toward legacy large-cap tokens facing technical breakdowns. Related Reading: Are We Near A Bitcoin Bear Market Bottom? History Offers A Framework For now, XRP’s trajectory appears driven more by market structure and on-chain signals than by Ripple’s expanding institutional footprint. Until buyers step in decisively, the risk of a deeper XRP price move toward $1.00 remains on the table. Cover image from ChatGPT, XRPUSD chart on Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|xrp|XRP Price|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57771878,
    "published": 1770336034000,
    "title": "Polygon Hits $3.50 Billion In Payments As Crypto Activity Expands",
    "body": "Reports have disclosed that Polygon closed the final quarter of 2025 with higher on-chain usage, driven by payments, stablecoin transfers, and tokenized assets. Related Reading: Crypto Could Bounce Soon As Fundamentals Firm Up, Tom Lee Says While traders watched MATIC drift inside a narrow range, activity on the chain told a different story, one focused on payments, stablecoins, and quiet institutional adoption rather than price momentum. Polygon Payments Use Grows Faster Than Prices According to Messari’s Q4 network review released on January 4, Polygon processed heavy payment traffic as fees stayed low and settlement times remained short. More than 50 apps built for payments handled about $3.50 billion in transfers during the quarter. That figure was 96% higher than the prior quarter and close to four times the level seen a year earlier. Stablecoin-linked cards added another layer of activity. Ten card programs together moved nearly $363 million using Mastercard and Visa rails, with Visa responsible for the larger share. Reports say this growth came from everyday spending rather than one-off events, a sign that Polygon is being used for routine transfers instead of short-term experiments. Beyond card payments, several firms expanded how they move money on the chain. DeCard allowed users to pay with USDC and USDT at a wide range of merchants. Flutterwave chose Polygon for cross-border business payments in 30 African countries. Revolut integrated cheap stablecoin transfers inside its app, while Stripe continued building subscription tools that rely on USDC. None of those moves grabbed market headlines, yet together they pushed steady volume through the network. Tokenized Assets Gain Ground Quietly Away from payments, tokenized real-world assets continued to stack up. Reports note Polygon ended Q4 with nearly $1.10 billion in RWAs, ranking ninth worldwide. Growth was driven less by retail hype and more by regulated structures. Stablecoin supply climbed to nearly 3 billion, led by USDC at $1.34 billion and DAI near $630 million. Latin America stood out as a key region, where non-USD stablecoin volume totaled $1.18 billion. Average daily DEX volume jumped 44% to a little over $200 million. MATICUSD trading at $0.19 on the 24-hour chart: TradingView MATIC Trades Sideways As Activity Builds MATIC’s price action stayed restrained despite the on-chain growth. The token slipped back from short-term resistance during broader market weakness and then stabilized as buyers defended key support zones. Related Reading: Russia’s Biggest Exchange To Launch XRP Indices And Futures Deeper losses were avoided, but strong upside moves failed to appear. Volume has yet to confirm a shift in trend. For now, Polygon shows rising use across payments and tokenized assets, while its token waits for a clearer signal from traders. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|bitcoin|crypto|digital currency|MATIC|POL|Polygon|RWA",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 38,
        "NAME": "MATIC",
        "CATEGORY": "MATIC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57771353,
    "published": 1770334573000,
    "title": "Strategy records $12.4B loss in Q4, shares dip 17% as Bitcoin tumbles",
    "body": "Strategy executives Phong Le and Andrew Kang say the company is on a strong financial footing despite it now being down 17.5% on its Bitcoin holdings.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57770632,
    "published": 1770332683000,
    "title": "Waymo’s ‘Self-Driving’ Claims Called into Question on Capitol Hill",
    "body": "Senators pressed Waymo over its use of human operators in the Philippines, questioning whether autonomy still means what Waymo says it does.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      }
    ]
  },
  {
    "id": 57770522,
    "published": 1770332435000,
    "title": "Bitcoin Price Just Hit A 15-Year Trendline After The Crash, What This Means",
    "body": "Crypto analyst Coinvo has revealed that the Bitcoin price has just hit a 15-year trendline following its latest crash to around $70,000. He declared this a buying opportunity, noting that the trendline has historically held on four prior occasions in past cycles. Bitcoin Price Hits 15-Year Trendline Against Gold In an X post, Coinvo stated that the Bitcoin price has hit the same RSI trendline on its gold chart as in 2011, 2015, 2019, and 2022. He further noted that this development has historically created a buying opportunity, as BTC has consistently outperformed gold when this happens. He urged market participants not to miss this as it is the “biggest opportunity” they have ever had. Related Reading: Bitcoin Set To Test Resistance At $80,600 After Bottoming At $74,000 His statement comes as the Bitcoin price crashed to a new yearly low at around $70,000, with the leading crypto asset now down over 19% year-to-date (YTD). Based on Coinvo’s analysis, this may mark the bottom for BTC despite concerns that the crypto market may be entering a deep bear market. In another X post, the analyst stated that the Bitcoin price is set to repeat the entire 2023 rally. He noted that the same pattern as in 2023 is playing out now, with BTC hitting the 200-day EMA, which marked a bear-market bottom back then by flipping into support. Coinvo added that most people are too focused on the bearish noise, but urged market participants not to let it obscure the truth, as Bitcoin is going higher. However, crypto analyst Benjamin Cowen has suggested that the Bitcoin price could still drop lower, having crashed below its April 2025 low. He noted that in the previous cycles, when BTC fell below the 100-week SMA, it crashed straight to the 200-week SMA before any relief bounce occurred. BTC Could Still Crash To As Low As $63,000 Veteran trader Peter Brandt shared an accompanying chart showing that the Bitcoin price could still drop to as low as $63,000. This came as he noted that the nature of BTC’s decline, with eight consecutive days of lower lows and highs, indicates campaign selling rather than retail liquidation. He noted that he has observed this pattern several times and that it is difficult to determine when it ends. Crypto analyst PlanB highlighted potential bear-market scenarios for BTC. He stated that an 80% drawdown from the current all-time high (ATH) could put the Bitcoin price at $25,000. Furthermore, a drop to the 200-week MA and current realized price could mean a crash to between $50,000 and $60,000. Meanwhile, a crash to the previous cycle’s ATH could mean that $70,000 is the bottom. Related Reading: Here’s What To Expect If The Bitcoin Price Maintains Support Above $74,400 At the time of writing, the Bitcoin price is trading at around $70,700, down over 7% in the last 24 hours, according to data from CoinMarketCap. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|Benjamin Cowen|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|CoinMarketCap|Coinvo|EMA|m&a|planb|RSI|Year-To-Date|YTD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57769118,
    "published": 1770328826000,
    "title": "Bitcoin, Ether Core Narratives Are Crumbling With Prices",
    "body": "Olga Kharif writes on how the plunge in the value of Ether is highlighting the debate around the prospects for the second-largest cryptocurrency.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57769088,
    "published": 1770328811000,
    "title": "Why The Bitcoin Price Could Quickly Revisit $81,000 Again After The Crash",
    "body": "The Bitcoin price has gone through an intense bout of volatility over the past few days, with a violent sell-off that has dragged its price into the $70,000 range. The move wiped out short-term bullish positioning and forced the price below several intraday support levels. Although there are risks of further downside, Bitcoin is now looking to stabilize and push to reclaim important reference levels. A technical outlook suggests that a path back to the $81,000 region could open up faster than expected if certain conditions are met. Sweep Of The Yearly Low One of the most important developments on the chart is the sweep of the last yearly candle low around $74,456. That move flushed liquidity resting below prior lows and was a clear downside grab that had been waiting for months. Related Reading: One Month In And 10% Of Dogecoin Millionaires Have Already Disappeared In 2026 – Details In terms of a market-structure perspective, this type of sweep is a reset point that clears weak hands and allows price to build a more stable base. The bounce that followed pushed Bitcoin back to $77,000, a move that shows buyers were willing to defend the area after the liquidation event. This is now transitioning into a decision zone, which is where the next directional move becomes more important. As noted by crypto analyst Minga on the social media platform X, Bitcoin went back to testing the weekly open just below $77,000. Holding above it would mean that the recovery has real follow-through, which in turn would allow the price to revisit the monthly open at $78,700. The chart shared by the analyst also shows multiple equal highs stacked above that region, right within the previous range low. Together, these elements form a pocket of unfinished business. If Bitcoin reclaims and sustains acceptance above the weekly open, the probability of a push through the monthly open increases, with that momentum then potentially carrying price into the $80,000s, where prior range liquidity is around $81,000. Bitcoin Price Chart. Source: @Mingarithm on X Related Reading: Where’s XRP Price Headed As Exchange Reserves Plunge To 1.7 Billion? Downside Scenario And The Relief Bounce Zone Below There is a valid alternate path if Bitcoin’s advances continue to reject at the weekly open, which is looking like the case in the current price action. In that case, there is a deeper downside target between $70,800 and $69,100. This area stands out as a high-confluence zone that aligns with a higher-timeframe order block, the 0.5 Fibonacci retracement, and the last cycle’s all-time high in 2021. At the time of writing, Bitcoin is trading at $70,930, down by 7.2% in the past 24 hours and is now at risk of losing $70,000. If price holds above this zone after the current test, then Bitcoin is likely to transition into a range before attempting continuation and breaking above $81,000. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57768793,
    "published": 1770327727000,
    "title": "EU tokenization companies push for DLT pilot changes amid US momentum",
    "body": "European tokenization companies urged EU lawmakers to quickly amend the DLT Pilot Regime, warning that current limits risk pushing onchain markets to the US.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57767956,
    "published": 1770325809000,
    "title": "Bitcoin Miners Could Face Crisis After BTC Price Falls 50% From Peak",
    "body": "The price of Bitcoin crashed below $63,000 on Thursday, not far above the average production cost of publicly traded miners.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57767970,
    "published": 1770325749000,
    "title": "Saylor’s Crypto Project Pounded After $12.4 Billion Loss",
    "body": "Bitcoin’s plunge below $65,000 is intensifying the crisis rocking the digital-asset complex — and few companies are more exposed than Michael Saylor’s Strategy Inc.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NMS:MSTR",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57767742,
    "published": 1770325230000,
    "title": "Bitcoin Hits Deep Demand As Liquidity Finally Sweeps The Lows",
    "body": "Bitcoin has finally swept the sell-side liquidity that had been building beneath the market, driving price into a deep demand zone where stronger buyers are expected to step in. With the downside move now largely complete, attention shifts to whether this level can spark a meaningful reaction or mark the start of a broader reset. Why The 100-Week SMA Remains A Proven Bitcoin Accumulation Zone Crypto analyst Brett emphasized that accumulating Bitcoin below the 100-week Simple Moving Average has repeatedly proven to be one of the most reliable long-term investment strategies. According to the expert, this zone has historically marked periods of maximum pessimism, where risk-to-reward strongly favors patient buyers rather than short-term traders. Related Reading: Bitcoin Drop Below $80,000 May Not Be The Final Capitulation Event, Checkonchain Says Brett explained that his personal approach deliberately avoids trying to pinpoint the exact market bottom. Instead, he focuses on steady accumulation by placing buy orders across a wide range between $55,000 and $75,000, supported by daily recurring purchases. For investors with a more conservative mindset, Brett pointed out that waiting for confirmation can be just as effective. Looking at past cycles, Brett noted that buying after Bitcoin moves back above the 100-week SMA has consistently delivered strong returns. He stressed that BTC has never fallen below the previous cycle’s 100-week SMA, reinforcing its importance as a structural support level. Those who followed this strategy in prior market cycles are now sitting on significant long-term profits. Breakdown Confirmed As Key Lows Failed To Hold According to the latest BTC Heatmap update by Columbus, the market has followed the exact trajectory previously mapped out. Columbus notes that the inability of the local lows to hold, combined with weak reactions on the tape, signaled that the liquidity stacked below would act as a magnet. Consequently, the continuation leg played out as an inevitable result of this structural weakness. Related Reading: Is The Bitcoin Bottom In? CMT Reveals What Investors Need To See Now In his analysis of the current price action, Columbus highlights that Bitcoin is now trading directly within a cluster of heavier bids located around the low-$70,000 region. The analyst identifies this specific zone as the first area where a “real reaction” is likely to occur, as it represents a significant concentration of buy-side interest. For Columbus, the sweep into these deeper pockets was the necessary clearing event to reach this primary demand zone. Columbus concludes that since the anticipated downside has fully played out, the focus now shifts entirely to the immediate response from buyers. With the liquidity targets hit and the price sitting on heavy support, Columbus is now closely watching for a definitive reaction to determine if this level will provide the foundation for the next leg of the trend. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|BRETT|btc|BTC news|btc price|btcusd|BTCUSDT|Columbus|SMA",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 114,
        "NAME": "BRETT",
        "CATEGORY": "BRETT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57767529,
    "published": 1770324543000,
    "title": "JPMorgan says bitcoin's lower volatility relative to gold might make it 'more attractive' in long term",
    "body": "ETF redemptions and futures liquidations are pressuring crypto markets, the bank said, even as rising gold volatility quietly strengthens bitcoin’s longer-term investment case.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Bitcoin spot etfs|Gold|JPMorgan Chase|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57759087,
    "published": 1770323366000,
    "title": "Bitcoin falls below $65,000 to wipe out ‘Trump rally’",
    "body": "Cryptocurrency returns to November 2024 level as it is swept up in tech stock sell-off",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57766922,
    "published": 1770322874000,
    "title": "Bitcoin slips under $64K as record-high selling intensifies: Where is the bottom?",
    "body": "Bitcoin touched new lows under $64,000 as market selling reached a historic level, and analysts warn that the bottom is not in. Does data support analysts’ sub-$60,000 prediction?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57766744,
    "published": 1770322038000,
    "title": "Tether backs Anchorage Digital in $100M equity investment",
    "body": "The investment extends an existing partnership with Anchorage and comes as the federally regulated crypto bank explores a major capital raise ahead of a potential IPO.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57765925,
    "published": 1770320083000,
    "title": "Bitcoin is the third most oversold ever, says one indicator, and violent upside could be next",
    "body": "The Relative Strength Index (RSI), a popular technical trading indicator, has plunged to 17. Only the bear market bottom in 2018 and the 2020 Covid crash saw lower reads.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57765745,
    "published": 1770319010000,
    "title": "Ether Tumbles to Eight-Month Low While Crypto Rout Deepens",
    "body": "Ether, the second-largest digital token, slid as as much as 10% on Thursday to $1,911, hitting its lowest intraday price since May as a months-long rout in cryptocurrencies prices deepens.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57765113,
    "published": 1770318016000,
    "title": "Crypto Bleeds For A 3rd Straight Month, A First In History: Analyst",
    "body": "Reports say an on-chain analytics account called Rand flagged a new milestone: crypto funds have recorded three straight months of outflows for the first time on record. Related Reading: Crypto Could Bounce Soon As Fundamentals Firm Up, Tom Lee Says That streak stands out because it breaks the pattern of sporadic withdrawals and inflows that marked earlier market cycles. Many investors are watching closely. Outflows Reach A Historic Turning Point According to market watchers, the run of withdrawals covers both retail and institutional flows. Spot Bitcoin exchange-traded funds (ETFs) in the US have been a major focus, with inflows that were once enormous now trimming down. Some of the earlier gains that piled into ETFs have been partially reversed, leaving holders with paper losses that many see as painful right now. US 🇺🇸 spot #Bitcoin ETF’s recorded 3 months of net outflows in a row. The first time in history that there has been 3 consecutive months of outflows. pic.twitter.com/WusDpXuSSm — Rand (@cryptorand) February 3, 2026 ETF Investors Holding Their Ground Reports say several prominent analysts have pointed out that, while the recent bleed looks alarming, ETF holders haven’t fled. James Seyffart noted that holders remain largely in place despite steep paper losses. Jim Bianco weighed in too, suggesting the average ETF stake is underwater by a meaningful margin yet still being held. This is not a full-scale selloff; it’s a slow retreat for now. Large sums entered the market during the peak months and those inflows dwarf the recent outflows when measured over the longer run. Sentiment has shifted, but conviction has not collapsed. What The Numbers Show Over 30 days, spot Bitcoin’s price slid by a sizable amount, and that drop helped push ETF positions into the red. Reports show some holders face losses around the low 40%, while shorter windows show steeper swings. The math is simple: big gains came fast, and some of that profit has been given back. At the same time, net positions remain sizable and a fair share of the capital that flowed in earlier is still parked in ETFs. Long Term Gains Versus Short Term Pain According to other market commentators, the bigger picture still favors those who kept faith through the rally years. Since 2022, Bitcoin’s cumulative rise outpaced several traditional stores of value, say analysts tracking long-term performance. That record is raised as a counterpoint to the current outflow story. Some investors see the current weak stretch as a pause; others see it as a warning. Related Reading: Russia’s Biggest Exchange To Launch XRP Indices And Futures What Comes Next The three-month outflow run is a sobering marker. It signals caution has spread beyond a handful of traders and reached products that many thought would smooth volatility. Money can return just as quickly as it left, or the slow drip could continue. For now, reports and the data both show a market in a rare place: bruised, but not emptied. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|btc|btcusd|crypto|digital currency|etf",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57763814,
    "published": 1770314430000,
    "title": "Why XRP Retail Holders Are Positioned Ahead Of Institutional Adoption",
    "body": "XRP has been misunderstood as just another retail-traded crypto asset, when in reality, it was engineered from the ground up to serve institutional finance. Most retail investors approach XRP through the lens of short-term price action, but that framing misses what the asset was actually built to do. XRP was never built for retail investors. Crypto trader Adam highlighted on X that from the outset, XRP was designed as institutional-grade infrastructure, powering liquidity corridors, cross-border settlements, and the movement of value between financial systems fast and efficiently. How Early Liquidity Providers Sit Ahead Of Demand The goal isn’t hype or speculation, but rather plumbing for global money flow. In this framework, the retail participant isn’t the target audience. Instead, retail holders occupy an early position, providing optional liquidity and gaining front-row access while the underlying rails are still being built. Related Reading: Ripple’s Next Steps: Where XRP Stops Being Trade And Starts Being Infrastrucutre As institutional adoption continues to expand, retail holders are positioned ahead of the curve and may benefit from utility demand, which ultimately drives long-term value. In this contest, being early doesn’t mean being excluded; it simply means being advantaged ahead of the curve. XRP has already transitioned into an institutional-grade asset. Analyst Xfinancebull has pointed out that the narrative from just two years ago was that many believed institutions would avoid XRP due to its uncertainty, perceived risk, and regulatory clarity, but that landscape has shifted. Currently, XRP exposure is available on major institutional platforms, including Vanguard, which manages over $10 trillion in assets and serves more than 50 million investors globally, and is second only to BlackRock. Multiple XRP ETFs are now live and accessible, including the Bitwise XRP ETF, Franklin Templeton XRP ETF, Canary XRP ETF, and Teucrium 2x XRP ETF. Despite this progress, XRP’s price remains low, and institutions are not emotional about the dip because they don’t buy green candles; they accumulate during the times of fear, and position their capital when retail interest is distracted or discouraged. XRP is now available on the same platforms used in managing retirement funds for millions of Americans and now offers direct XRP exposure. Once institutional allocations begin to flow, available supply can be absorbed quickly. “You’re either positioned before institutions move, or chasing after they’ve already entered,” Xfinancebull noted. Banks Are Already Testing XRPL Infrastructure According to Jake Claver, the CEO of DAGFamilyOffice, the global banking system currently has roughly $27 trillion locked in pre-funded accounts, which only exist because banks can’t settle transactions in real-time. Meanwhile, the XRP ledger alternative can handle that settlement in seconds, and banks are already testing this infrastructure. Related Reading: XRP Tops All Assets On Risk/Reward, Analyst Says The key question, as Claver frames it, is not whether real-time settlement is possible, but how long the current system can persist before the efficiency gains become impossible for banks to ignore. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|adam|bitwise|Canary|Franklin Templeton|Jake Claver|Ripple|Spot XRP ETF|Teucrium|Vanguard|XFinanceBull|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57763565,
    "published": 1770313769000,
    "title": "Treasury Secretary: Crypto 'Nihilists' Who Say They Don't Need Clarity Act 'Should Move to El Salvador'",
    "body": "Scott Bessent also appeared to empathize with the banking lobby’s concerns about the bill during Senate testimony on Thursday.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 57763812,
    "published": 1770313543000,
    "title": "Bitcoin Mining Revenue Gauge Falls to Record Low During Selloff",
    "body": "A closely-watched measure of Bitcoin mining revenue has dropped to the lowest on record with more of the large-scale computing outfits that make the cryptocurrency work unplugging equipment while prices tumble and energy costs climb.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57763403,
    "published": 1770313404000,
    "title": "AI Agents Gain Trust Via Ethereum: ERC-8004 On Mainnet",
    "body": "ERC-8004 is live on Ethereum mainnet, adding standard identity and reputation registries for AI agents and a foundation for interoperable agent markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57763366,
    "published": 1770313201000,
    "title": "U.S. Treasury's Bessent calls out crypto 'nihilists' resisting market structure bill",
    "body": "Treasury Secretary Bessent said market participants who don't want strong regulation should \"move to El Salvador.\"",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Scott Bessent|Mark Warner|Market Structure Legislation|Coinbase|Crypto lobbying|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57763248,
    "published": 1770312840000,
    "title": "Aster layer-1 blockchain testnet goes live, mainnet rollout targeted for Q1",
    "body": "Aster rebranded to become a crypto perpetual futures decentralized exchange in 2025, as perp DEX trading volume surged by trillions of dollars.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57762817,
    "published": 1770311791000,
    "title": "Polymarket, Circle partner in shift to native USDC settlement",
    "body": "Polymarket will migrate from bridged USDC on Polygon to Circle-issued native USDC, reducing reliance on cross-chain bridges as prediction markets expand.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 38,
        "NAME": "MATIC",
        "CATEGORY": "MATIC"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57762658,
    "published": 1770311473000,
    "title": "Gemini to exit U.K., EU and Australia, reduce staff by 25%, and focus on U.S. and prediction markets",
    "body": "The crypto exchange has instructed affected customers to sign up with eToro by the end of March for withdrawals, while deposits and new accounts have been suspended.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Gemini|Crypto Exchange|Prediction Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57761893,
    "published": 1770309331000,
    "title": "Bitcoin Crashes Below $67,000 As Stifel Warns Of Potential Drop To $38,000",
    "body": "Bitcoin (BTC) extended its sharp sell‑off on Thursday, briefly falling below the $67,000 level and marking its lowest price since November 2024. The renewed pressure follows commentary from market analyst Hugo Crypto, who pointed to a recent report from investment bank Stifel outlining a notably bearish outlook for Bitcoin. Deeper Bitcoin Drawdown Ahead? According to Stifel’s analysis, the leading cryptocurrency could continue declining toward $38,000. If reached, that target would represent an additional drop of roughly 43% from current levels and would place Bitcoin back at prices last seen in January 2024. Related Reading: Ripple Throws Weight Behind Hyperliquid, Fueling HYPE’s Rally Toward Crucial Levels Stifel’s forecast is built on several macro and market‑specific factors. The firm cited the impact of tighter US Federal Reserve (Fed) policy, ongoing uncertainty and stagnation around US crypto regulation, shrinking market liquidity, and sustained outflows from spot Bitcoin exchange‑traded funds (ETFs). The bank also framed its outlook within the context of historical Bitcoin market cycles. According to Stifel, Bitcoin’s peak near $126,000 in October 2025 fits a familiar pattern seen in prior cycles, which have typically been followed by extended and deep drawdowns. Additional warnings were echoed by market observer Walter Bloomberg, who highlighted weakening demand, a sharp slowdown in ETF inflows, and growing stress in derivatives markets. Futures markets, in particular, appear to be entering what he describes as a “forced deleveraging” phase, where leveraged positions are unwound rapidly, adding to selling pressure. BTC Faces Key Technical Test ETF data from Thursday further illustrates the strain on market sentiment. Spot Bitcoin ETFs have so far recorded net outflows of approximately 7,925 BTC on the day, equivalent to about $533 million. Over the past seven days, net outflows have totaled roughly 19,090 BTC, or around $1.28 billion, reinforcing concerns that institutional demand is fading rather than providing support. Related Reading: Bitcoin Crash To $72,000 Signals Major Reset: On-Chain Metrics Deteriorate From a technical perspective, analyst MartyParty highlighted the importance of the $68,000 level, which Bitcoin would need to reclaim to stabilize in the near term. This area aligns with the 200‑week exponential moving average, a level often viewed as critical during major market corrections. Failure to hold above that zone could open the door to a move toward the 200‑week simple moving average, currently near $58,000, according to technical analysts. At the time of writing, Bitcoin was trading around $67,100, down roughly 8% on the day and more than 20% over the past week, based on CoinGecko data. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|bitcoin|Bitcoin chart|Bitcoin news|bitcoin price|bitcoin technical analysis|btc|BTC news|BTCUSDT|crypto|crypto market|crypto news|cryptocurrency",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57761456,
    "published": 1770308199000,
    "title": "Solana Foundation's Liu: Focus on finance, not gaming 'misadventures'",
    "body": "Liu’s remarks come as cryptocurrencies plunge and other industry leaders are narrowing their own visions for blockchain utility.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Tech|Solana Foundation|Solana News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57761430,
    "published": 1770308145000,
    "title": "Tom Lee's Bitmine may be buying ETH, but Vitalik Buterin and everyone else appears to be selling",
    "body": "Ether has dropped below $2,000, underperforming other major cryptocurrencies as selling accelerates from leveraged traders, onchain liquidations and long-term holders.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Ether Price|Ethereum Futures|Bitmine|Vitalik Buterin|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57761429,
    "published": 1770307070000,
    "title": "After Slump, Bitcoin Now Trails S&P 500, Nasdaq 100, Gold Over Five Years",
    "body": "Bitcoin is no longer beating the big asset classes.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57760796,
    "published": 1770306316000,
    "title": "UK Teens Jailed After $4.3M Wrench Attack Robbery Caught on Police Video",
    "body": "Police video shows Sheffield teens posing as delivery drivers to steal $4.3 million in crypto at knife point from a London flat owner.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57760743,
    "published": 1770306118000,
    "title": "Bitcoin Crashes Below $67K, Erasing All Gains Since Trump's Election Win",
    "body": "Bitcoin has fallen more than 9% on the day, cratering to a price not seen since before President Trump's 2024 election win.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57760491,
    "published": 1770305421000,
    "title": "Solana Price Drops, But Open Interest Signals Growing Activity",
    "body": "Solana’s market looks like a tightly wound spring right now. Prices have been slipping while futures activity is picking up, and that gap is what traders are watching most closely. Related Reading: Russia’s Biggest Exchange To Launch XRP Indices And Futures It’s a setup that can keep losses rolling — or flip fast if a wave of short covering hits. Either way, the scene is driven more by bets than by steady buying. Derivatives Betting Intensifies According to reports, more futures contracts for SOL are being opened even as the price moves lower. That means fresh bets are being placed, not just old ones being closed. Funding rates for perpetual contracts have moved into negative territory. When funding is negative, those backing short positions are paying those on the long side. It’s a clear sign of bearish leaning in the derivatives market. Leverage A Big Part Of The Story Reports say many of these positions are sized up with leverage. Traders are piling on with borrowed exposure. That raises the odds of violent swings because margin calls can trigger cascades. A squeeze can happen quickly. If a piece of positive news appears or a large buyer steps in, those who are short may be forced to buy back, and that buying itself can push the price up fast. Price is going down. Open Interest is going up. Funding is going down.$SOL is getting heavily shorted here. pic.twitter.com/YuYAy9lzZ0 — Ted (@TedPillows) February 4, 2026 Price Action Shows Weakness Across short-term charts — intraday and daily — SOL has been under pressure. Spot trading volume remains light, which makes every trade count more. Some traders are trimming risk because volatility in larger coins has spooked the market. In plain terms: fewer hands are willing to hold SOL at these levels, and that lack of real buying support keeps the downside pathway open. Volatility Could Swing Either Way This environment is speculative. High open interest plus negative funding is a bearish combo, but it also loads the market with risk. Covered shorts can unwind in a hurry. Liquidity gaps are where big moves start. The same factors that drive downward momentum can, under different circumstances, accelerate a rebound. Related Reading: Crypto Could Bounce Soon As Fundamentals Firm Up, Tom Lee Says Based on reports, the clearest signals to follow are changes in open interest, shifts in funding rates, and sudden spikes in spot volume or order book depth. Also watch news flow closely; a single announcement can change sentiment overnight. Risk management matters here. Size positions so that forced liquidations are avoidable. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|altcoin|crypto|open interest|Sol|Solana|SOLUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57760271,
    "published": 1770304703000,
    "title": "Here is what industry veterans are saying as bitcoin tumbles below $70,000",
    "body": "\"This drawdown feels horrible not because of the magnitude, but because it’s unfair,\" said longtime bitcoin maxi Samson Mow.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57760192,
    "published": 1770304528000,
    "title": "Bitcoin falls under $68,000 with traders betting move to low-$60,000s",
    "body": "Crypto liquidations crossed $1 billion over the past 24 hours, wiping out about $980 million million in bullish leveraged bets",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57759578,
    "published": 1770302924000,
    "title": "Tether invests $100 million in U.S. crypto bank Anchorage, valued at $4.2 billion",
    "body": "Anchorage Digital is the firm issuing Tether's USAT stablecoin, designed for the U.S. market.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Tether|Anchorage Digital|Stablecoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57759178,
    "published": 1770301817000,
    "title": "Is The XRP Bottom In? Traders Pin The Floor Between $1.20 And $1.00",
    "body": "XRP is down 58% from its all-time high, and two popular chart-focused accounts on X are framing the drawdown as a potential accumulation window rather than a trend break. How Low Will XRP Price Go? Crypto Patel (@CryptoPatel) told followers on Feb. 4 that XRP/USD has “entered our first accumulation zone at $1.50–$1.30.” In his post, he urged staggered entries rather than trying to time a single bottom. “Start buying slowly at these levels, no rush, just steady accumulation,” he wrote, positioning the move as capital-preservation after what he described as an earlier call highlighting a “bottom accumulation zone.” On the risk side, Patel tied his next decision point to the $1.30 level, suggesting a deeper set of bids if that floor breaks. “If XRP breaks below $1.30, place your entry bids between $0.90–$0.70,” he wrote. “But here’s the thing — if price hits that zone, it could be the best long-term accumulation opportunity for maximum profits.” Related Reading: XRP Enters ‘Washout Zone,’ Then Targets $30, Crypto Analyst Says He added that his “long-term target remains $10,” arguing that entry discipline matters more than headline targets: “Buying at $3 or $2? Not ideal in my view. If the target is $10, why not aim for entries at $1.50–$1 during hard dips for much bigger returns?” Patel also leaned on his prior public call as evidence of a repeatable framework. He said he shared an XRP setup at $0.50 in the last bear market and that XRP later rallied to $3.66, which he characterized as “over 600% profit.” XRP Bottom In March? A separate post from Charting Guy framed the selloff less as a new regime and more as a familiar cycle structure. “XRP repeating 2021, bottom in march roughly around $1.20 imo,” he wrote, adding: “maybe wick to $1 to scare the hoes. The bear market is almost over.” When asked directly by another user—“Bear market ends in march?”—Charting Guy replied: “yep.” In Charting Guy’s weekly XRP/USD chart, the roadmap is framed around a rising multi-year trendline and a Fibonacci ladder drawn across the move, with several of those Fib levels clustering right where he expects a March low. On the retracement side, the chart labels the key downside bands at roughly 0.618 ($0.915) and 0.702 ($1.2149), with additional levels below at 0.5 ($0.615) and 0.382 ($0.413). Charting Guy’s “bottom in March roughly around $1.20” lines up almost directly with the 0.702 Fib (~$1.215), while his “maybe wick to $1” comment points toward a deeper flush into the space between $1.00 and the 0.618 Fib (~$0.915). Related Reading: Analyst Predicts XRP Price Wil Target 450% Rally To $7 What makes that zone more than just a horizontal level on his layout is the trendline confluence. The green, rising trendline he’s drawn from the 2020–2022 base is shown catching price into early March (his vertical marker sits around Mon 02 Mar ’26), with the trendline effectively rising into the same $1.00–$1.20 neighborhood. In other words, his implied “March bottom” isn’t just a date call, it’s a confluence call: trendline support rising into the 0.702 retracement area, with room for a volatility wick closer to the 0.618 if the market tries to force capitulation. Above spot, the chart also shows the upside Fib extensions he’s using as reference points: 0.786 ($1.612), 0.888 ($2.274), and the prior swing reference around 1.0 ($3.317), with higher extensions marked at 1.236 ($7.349), 1.272 ($8.297), 1.414 ($13.389), and 1.618 ($26.630). At press time, XRP traded at $1.3888. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|xrp|xrp news|XRP Price|XRP Price Analysis|XRP Technical Analysis",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57759289,
    "published": 1770301476000,
    "title": "Winklevosses’ Gemini to Cut Jobs, Scale Down in Crypto Retreat",
    "body": "The crypto exchange run by billionaires Tyler and Cameron Winklevoss is slashing as much as 25% of its workforce and winding down operations in the UK, European Union and Australia, marking a major pullback for two of the industry’s most high-profile figures amid a rout in the sector.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NMS:GEMI",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57758992,
    "published": 1770301357000,
    "title": "Vitalik Buterin: ‘ETH Devs Need to Move Past Clone Chains’ as BMIC Keeps Pumping",
    "body": "What to Know: Vitalik Buterin warns that ‘copy-paste’ EVM chains are reaching a dead end, urging developers to build genuine technical innovations. The market is rotating focus toward projects solving existential threats like ‘harvest now, decrypt later’ rather than just transaction speed. BMIC utilizes post-quantum cryptography and ERC-4337 to eliminate public key exposure, aligning with the demand for ‘deep tech’ solutions. Smart money is hedging against future cryptographic obsolescence by targeting infrastructure that secures assets against quantum computing. The Ethereum ecosystem is saturated. Co-founder Vitalik Buterin isn’t mincing words about it anymore. In recent commentary on the trajectory of Layer 2 solutions and alt-L1s, he emphasized a critical pivot: the era of copy-paste EVM chains is dead. For years, developers have been forking Geth (Go-Ethereum), tweaking a parameter or two, and launching ‘new’ networks that offer nothing but fragmented liquidity and identical user experiences. Buterin’s point? True scaling requires actual breakthroughs, specifically in privacy and security, not just cosmetic bridges. Why does this matter? Because the market is currently awash in ‘zombie chains’, networks boasting high valuations despite having zero distinct utility. When Ethereum’s co-founder signals that the infrastructure phase is shifting from quantity to quality, smart money tends to listen. The reaction has been subtle (for now), but telling: capital is rotating out of generic governance tokens and into plays that solve actual, forward-looking problems. That skepticism toward clones has created a vacuum for projects addressing the next decade’s threats, not last cycle’s hype. While Vitalik pushes for differentiation, a darker narrative is emerging around ‘harvest now, decrypt later’ attacks, a threat vector standard EVM forks can’t touch. This shift from speed to existential security has spotlighted BMIC, a project attempting to fill that deep-tech void. Read more about $BMIC here. Moving Beyond The EVM Copy-Paste Meta Vitalik’s critique hits at the lack of ambition in dev circles. Simply offering lower fees isn’t a unique selling point anymore; it’s the baseline. BMIC ($BMIC) breaks the mold by ignoring the ‘faster transaction’ race entirely. Instead, it focuses on a far more pressing issue: the coming obsolescence of current cryptographic standards. While generic L2s squabble over milliseconds, BMIC is building a Quantum-Secure Wallet stack designed to survive the inevitable arrival of quantum computing. The project uses post-quantum cryptography combined with ERC-4337 Smart Accounts to eliminate crypto’s biggest vulnerability: public key exposure. In standard wallets, once a public key is revealed during a transaction, it becomes a sitting duck for future quantum decryption. BMIC tackles this with a zero-exposure protocol and AI-enhanced threat detection. This is exactly the ‘Stage 2’ innovation Buterin often references, technology that fundamentally upgrades the stack rather than just copying it. By integrating a ‘Quantum Meta-Cloud’ for secure storage and offering burn-to-compute utility, the project moves beyond simple speculation. It provides an infrastructure hedge against the very technology that could render legacy blockchains obsolete. Explore the BMIC ecosystem. BMIC Presale Draws Attention With Quantum-First Utility The market’s hunger for genuine innovation is clear. The BMIC presale has already raised over $433K, suggesting investors are increasingly wary of legacy tech vulnerabilities. With the token currently priced at $0.049474, the entry point reflects an early valuation for a protocol attempting to secure the Ethereum ecosystem’s digital future. What distinguishes this raise from the typical memecoin frenzy? The utility proposition. This capital isn’t just funding a liquidity pool; it’s building a full Quantum-Secure Finance Stack. The tokenomics back this up via staking mechanisms that use quantum-secure validation with no exposed keys, a direct answer to the slashing risks prevalent in standard PoS systems. Plus, the ‘Burn-to-Compute’ model introduces a deflationary lever tied to actual network demand, not artificial scarcity. The correlation between Vitalik’s call for new tech and the rise of niche security protocols suggests the market is pricing in technical risk more seriously than in previous cycles. As developers heed Buterin’s advice and move past simple forks, protocols offering defensive moats against quantum threats are positioning themselves as essential infrastructure. The presale data indicates that while the masses chase green candles, forward-thinking participants are securing their downside against a potential cryptographic winter. Buy your $BMIC here. Disclaimer: This article is for informational purposes only and does not constitute financial advice. Cryptocurrency investments, particularly in presale stages, carry high risks including volatility and potential loss of principal. Always verify security protocols independently.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57758830,
    "published": 1770300835000,
    "title": "Deutsche Bank says bitcoin’s selloff signals a loss of conviction, not a broken market",
    "body": "The German lender pointed to institutional outflows, fading liquidity and stalled regulation as the real drivers behind bitcoin’s slump.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Bitcoin ETF|crypto regulation|Deutsche Bank|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57758889,
    "published": 1770300791000,
    "title": "Bitcoin price may drop below $64K as veteran raises ‘campaign selling’ alarm",
    "body": "Bitcoin risks a deeper slide as miners and US spot ETFs cut BTC exposure, adding supply pressure during a fragile downtrend.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57758705,
    "published": 1770300509000,
    "title": "Blockchains to Serve as AI Verification Platforms, Fueling $SUBBD’s $1.4M Presale",
    "body": "What to Know: Leading analysts and VC firms identify blockchain as the necessary verification layer to counter AI-generated deepfakes and content theft. SUBBD Token utilizes Ethereum-based smart contracts to verify ownership of AI voice clones and automated creator tools, solving key IP issues. The project has raised $1,472,529.11 in its ongoing presale, signaling strong demand for applied AI crypto solutions. Stakers can earn a fixed 20% APY in the first year, incentivizing long-term participation in the platform’s governance. The intersection of artificial intelligence and cryptographic verification is fast becoming the defining narrative for the next market cycle. As generative AI floods the internet with synthetic media, deepfakes, and automated agents, the ability to distinguish between human and machine, and to verify the provenance of digital content, has shifted from a luxury to a necessity. Leading venture capital firms, including Andreessen Horowitz (a16z), recently highlighted that blockchains are poised to become the essential ‘infrastructure of truth’ for the AI age. This isn’t just theory; it’s reshaping capital allocation strategies across the crypto market right now. Investors are moving away from generic governance tokens and toward protocols that offer tangible utility in verifying identity and ownership within the digital economy. The premise is straightforward: if AI creates infinite content abundance, blockchain provides the necessary scarcity and attribution layer. This macro trend helps explain the surging interest in specialized platforms bridging these two technologies. As the market seeks solutions that protect creator rights against AI encroachment while simultaneously using AI tools for growth, new entrants like SUBBD Token ($SUBBD) are emerging to capitalize on this demand. The project is already drawing significant liquidity during its early funding rounds. Read more about $SUBBD here. Integrating AI Verification into The $85B Creator Economy The rapid ascent of AI created a massive paradox for the $85B content creation industry. While tools for generation are better than ever, the risk of IP theft and platform de-platforming has never been higher. SUBBD Token ($SUBBD) addresses this fracture by deploying an Ethereum-based architecture that serves as a verification and monetization layer for creators. By using EVM-compatible smart contracts, the platform ensures that AI-generated assets, such as custom ‘AI Personal Assistants’ and ‘AI Voice Clones’, remain under the strict control of their human originators. This approach fundamentally alters the legacy model where centralized platforms extract up to 70% of revenue and retain ownership of user data. Sound familiar? SUBBD offers a decentralized alternative where creators can deploy AI influencers or gated content while retaining the majority of earnings. The platform’s use of blockchain for ‘proof of ownership’ over AI models allows for new revenue streams, such as renting out a verified voice clone for automated interactions, without the risk of unauthorized duplication. For the broader market, this represents a shift from speculative AI tokens toward “applied AI” infrastructure, where the token serves as the functional currency for a decentralized, automated economy. Read the SUBBD whitepaper. $SUBBD IS AVAILABLE HERE. $SUBBD Presale Momentum Signals Shift in Retail AI Sentiment The market’s appetite for projects merging Web3 sovereignty with AI utility is evident in the capital flows surrounding the SUBBD Token presale. According to official data, the project has successfully raised over $1.4M, a figure that suggests robust confidence despite broader market volatility. With tokens currently priced at $0.05749, early positioning indicates that retail investors are attempting to front-run the full launch of the platform’s beta features. It’s not just the capital raise, though; the protocol’s staking mechanics are driving engagement. SUBBD offers a fixed 20% APY for the first year, a strategic incentive designed to lock up liquidity while the platform scales its user base. This high-yield introductory period serves a dual purpose: it reduces circulating supply volatility and aligns long-term holders with the project’s development roadmap. The data points to a growing trend where investors favor projects offering immediate yield utility alongside a clear technological USP. As the creator economy seeks an exit from Web2 restrictions, SUBBD’s combination of lower fees, AI tooling, and transparent staking rewards positions it as a notable contender in the sector. View the $SUBBD presale. Disclaimer: The information provided in this article does not constitute investment advice, financial advice, trading advice, or any other sort of advice. Cryptocurrency investments are highly volatile and carry a high risk of loss. Conduct your own due diligence before making any financial decisions.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57758535,
    "published": 1770300000000,
    "title": "EU at risk of falling behind the U.S. in tokenization rules, digital asset firms warn",
    "body": "The EU must fix its pilot regime now or watch capital markets shift permanently to the U.S., a group of blockchain firms warned policymakers on Thursday.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|European Union|Tokenization|Real World Assets|Regulations|Securitize|Börse Stuttgart|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57758601,
    "published": 1770300000000,
    "title": "Multiliquid, Metalayer launch instant redemption backstop for RWAs on Solana",
    "body": "The new facility allows institutions to redeem tokenized real-world assets into stablecoins instantly, addressing a key liquidity bottleneck in onchain markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57757812,
    "published": 1770297879000,
    "title": "ZCash and Monero Lead 25% Privacy Sector Crash, While $MAXI Defies Gravity",
    "body": "What to Know: Monero and ZCash are leading a 25% sector decline driven by regulatory pressure and exchange delistings. Traders are exiting privacy-focused assets in favor of transparent, high-volatility tokens with strong community narratives. With over $4.57M raised and significant whale accumulation, Maxi Doge is capturing the liquidity leaving stagnant sectors. Unlike passive privacy coins, $MAXI gamifies the trading experience with competitions and high-yield staking. The privacy coin sector faces an existential crisis. Market leaders ZCash ($ZEC) and Monero ($XMR) have led a correction wiping out nearly a quarter of the segment’s value. While the broader market chops sideways, privacy assets are decoupling downward, suffocated by a tightening regulatory noose and fragmented liquidity. Recent moves by major centralized exchanges to delist privacy tokens in the EU have triggered a flight to safety. The premise of ‘untraceable money’ is clashing with global AML compliance, effectively forcing institutional capital to exit. But what makes this crash notable isn’t just the price action, it’s the volume. Selling pressure on $XMR has been sustained. It suggests long-term holders are capitulating, not buying the dip. Crucially, the irony is thick here: privacy coins were built to resist censorship, yet they’re being suffocated by the very access points, centralized exchanges, that gave them life. This capital flight created a liquidity vacuum. Traders rotating out of the sector aren’t necessarily moving into stablecoins; they’re hunting high-beta assets with transparency and aggressive upside. The narrative has shifted from ‘hiding wealth’ to ‘multiplying wealth.’ That rotation is driving volume straight into high-leverage culture tokens like Maxi Doge ($MAXI). The $MAXI presale is available here. Maxi Doge Brings “Leverage King” Culture to the Blockchain While ZCash struggles to justify its utility in a compliant world, Maxi Doge taps into current market psychology: aggressive conviction. Positioned as the ‘Leverage King,’ $MAXI isn’t just another canine derivative. It’s a utility token built specifically for the high-octane trading community. The project differentiates itself by gamifying the experience. Instead of passive privacy, Maxi Doge demands active participation via holder-only trading competitions. This addresses a real issue for retail traders who often lack the capital to make meaningful returns. By creating a ‘gym-bro’ culture centered on the mantra ‘never skip a pump,’ the project taps into the same adrenaline that fuels 100x leverage trading, but wraps it in a community ecosystem. This pivot from technological obscurity to culturally charged transparency is showing up on-chain. Smart money is voting with its wallet. Whales seem confident that the ‘lift, trade, repeat’ narrative will outpace the stagnating privacy sector. Learn more about Maxi Doge. Presale Data Signals a Shift in Retail Sentiment The contrast between the bleeding privacy sector and Maxi Doge inflows highlights a simple truth: liquidity follows narrative. While Monero battles regulatory delistings, $MAXI has secured significant early-stage capital, proving the market’s appetite for its ‘meme-first, utility-second’ hybrid model. According to the official presale page, Maxi Doge has raised $4.5M so far. That figure signals real demand for high-risk, high-reward environments. With tokens priced at $0.0002802, early adopters are entering before the token hits public exchanges. The project’s tokenomics are built to sustain that momentum. A dynamic APY staking mechanism distributes rewards daily from a 5% allocation pool, incentivizing holders to lock supply for up to one year. This effectively reduces circulating supply while the community expands. Plus, the Maxi Fund treasury supports the ecosystem by providing liquidity for partnerships and future exchange listings. In a market where ZCash is losing its use case to compliance friction, $MAXI offers a clear lane for speculation and engagement. Buy your $MAXI here. Disclaimer: The content of this article is for informational purposes only and does not constitute financial advice. Cryptocurrencies are highly volatile; conduct your own due diligence before investing.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 57,
        "NAME": "XMR",
        "CATEGORY": "XMR"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57757527,
    "published": 1770296819000,
    "title": "Record $1M Lightning transfer tests Bitcoin payments for institutions",
    "body": "A $1 million Lightning transfer between SDM and Kraken was used to test whether Bitcoin’s main scaling layer could handle seven‑figure, institutional‑grade payments.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57757238,
    "published": 1770296194000,
    "title": "Trump-linked WLFI faces probe over $500M UAE crypto deal",
    "body": "House Democrats probe $500 million UAE investment in Trump-linked WLFI, highlighting questions over dealings with the country's national security adviser.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57756666,
    "published": 1770294606000,
    "title": "PlanB Lays Out Four Bitcoin Bear-Market Scenarios",
    "body": "PlanB, the pseudonymous analyst behind the stock-to-flow model, says bitcoin’s drawdown has left markets staring at four plausible bear-market paths, ranging from a classic 80% drawdown to the possibility that the lows are already in. In a post on X and a follow-up video dated Feb. 4, PlanB framed the debate around where bitcoin typically finds bear-market bottoms relative to long-term trend metrics, while also arguing that the previous rally’s lack of momentum could translate into a shallower reset this time. Bitcoin closed January at $78,000, he said, marking a roughly 40% decline from the cycle’s all-time high at $126,000. On his chart, the 200-week moving average closed at $58,000 and realized price at $55,000, with the January RSI ending at 49, a level he treats as a regime shift. “RSI here, 49. RSI, as you know, is an index between 0 and 100. And everything above 50 is an uptrend. Everything below 50 is downtrend,” PlanB said. “So 49 is below 50, it’s downtrend. It’s a bear market… similar to 2014–15, 2018–19 and 2022–23.” Related Reading: Bitcoin Unrealized Losses Reach 22% – Still No Capitulation Phase 4 Bitcoin Bear Market Scenarios From there, he outlined four scenarios for how the drawdown could evolve. The first is the historical “worst case” that still sits in traders’ mental models: an 80% drop from the top. With an ATH of $126,000, PlanB said that would imply a move to roughly $25,000 — “somewhere here between these two lines” on his chart, even if he acknowledged it would “look really really odd.” The second scenario is more conventional by his own backtests: a bottom around the 200-week moving average and realized price, which he pegged in the $50,000–$60,000 level. PlanB pointed to prior cycles where price eventually “drop[s] to the moving average realized price levels,” highlighting 2022 and 2015 as examples where the RSI trough coincided with those long-term anchors. The third scenario is shallower still: a retrace that stops just above the prior cycle’s all-time high, around $69,000–$70,000. PlanB’s reasoning is that the preceding bull phase looked muted in his indicators, which could compress the magnitude of the bear. “So what I think is… because the bull market was very weak… it didn’t have the red dots, the high RSI peaks,” he said. “Because of that, the bear market could be very shallow. And that would mean, for example, going back to the level or just be above the level of the… previous all-time high, which was 69,000.” Related Reading: ‘Sell Gold, Buy Bitcoin’: Cathie Wood Makes The Rotation Call The fourth scenario is the one traders always want on their screens: that the market already printed its low. PlanB wrote that “yesterday’s $72.9k was the bottom,” and reiterated in the video that “maybe the $72.800 that we saw a couple days ago was already the bottom.” Notably, the BTC price already dropped to $70,140 on Wednesday, invalidating this scenario. IMO there are 4 bitcoin bear market scenarios: 1) -80% from ATH $126k => $25k 2) down to 200w MA / realized price => $50k-60k 3) down to just above previous ATH => $70k 4) yesterday’s $72.9k was the bottom I discuss these scenario’s in my new video: 👉 https://t.co/mXSxJK9LLx — PlanB (@100trillionUSD) February 4, 2026 PlanB also revisited his stock-to-flow framework, saying it remains at $500,000 as a value signal derived from scarcity while stressing it is not built to call turning points. “Stock to flow says nothing about tops and bottoms,” he said, adding that it speaks to “the four-year average” and periodic “phase transition every four or five years.” That caveat set up his final point: the cycle template may be shifting. PlanB noted that in his four-year-cycle view, the peak historically lands in the first or second year after a halving, but “it didn’t happen after 2024 halving.” In his telling, that leaves room for an upside phase later in the cycle, even as his nearer-term framework keeps the focus on whether bitcoin gravitates toward realized price and the 200-week average, holds the prior ATH zone, or validates a higher low in the low-$70,000s. At press time, BTC traded at $ Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin bear market|Bitcoin news|bitcoin price|btc|BTC news|btc price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57756663,
    "published": 1770294259000,
    "title": "Bitcoin Drops Below $61,000, Wiping Out Gain Since Trump’s Win",
    "body": "Bitcoin tumbled below $61,000, as the unwinding of leveraged bets and broader market turbulence deepened a selloff that has wiped out all of the gains since President Donald Trump’s election set off a speculative rush into cryptocurrencies.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57756547,
    "published": 1770294228000,
    "title": "Bitcoin's limited supply won't help stop the selloff",
    "body": "Your day-ahead look for Feb. 5, 2026",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Crypto Daybook Americas|Crypto Daybook Americas|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57756143,
    "published": 1770292842000,
    "title": "Fuite majeure des capitaux par les ETF Bitcoin : nouveau crash imminent ?",
    "body": "Les ETF Bitcoin traversent actuellement une phase délicate qui commence à faire douter une partie du marché. Après plusieurs semaines marquées par des sorties massives de capitaux, une question revient avec insistance : assiste-t-on aux prémices d’un nouveau crash ou à une simple respiration du cycle haussier ? Fuite massive des ETF Bitcoin Depuis la fin du mois de janvier, les ETF Bitcoin enregistrent des sorties nettes d’une ampleur rarement observée depuis leur lancement. En l’espace de quelques séances, plusieurs centaines de millions de dollars ont quitté ces produits, alimentant un sentiment de méfiance croissant chez les investisseurs institutionnels. Le mouvement s’est accompagné d’une nette pression vendeuse sur le prix du BTC , retombé brutalement sous des niveaux psychologiques clés. À première vue, le signal est préoccupant. Les ETF étaient jusqu’ici perçus comme le moteur principal de la demande institutionnelle, et leur retournement brutal a surpris même les acteurs les plus prudents. Pour certains, ces sorties reflètent une prise de bénéfices logique après une année exceptionnelle. Pour d’autres, elles traduisent un désengagement plus profond face à un environnement macroéconomique devenu moins favorable au risque. Il serait pourtant réducteur de n’y voir qu’un signal de panique généralisée. Les flux ETF sont par nature volatils et réagissent rapidement aux mouvements de prix . Une partie des capitaux sortants correspond probablement à des arbitrages de court terme ou à des réallocations vers d’autres classes d’actifs jugées temporairement plus attractives. D’ailleurs, quelques journées de flux positifs ont montré que certains investisseurs commencent déjà à se repositionner. Un autre élément souvent négligé concerne la structure du marché. Les ETF ne représentent qu’une fraction de l’offre détenue. Une part importante du Bitcoin reste verrouillée par des détenteurs long terme peu sensibles aux fluctuations à court terme. Tant que ces acteurs ne capitulent pas, parler d’effondrement structurel semble prématuré. Quelle cible de prix pour le bottom du BTC ? La correction actuelle a replacé le débat sur la table : jusqu’où le Bitcoin peut-il descendre avant de trouver un véritable point bas ? Après avoir marqué un sommet historique fin 2025, le BTC a déjà perdu une part significative de sa valeur, ce qui alimente naturellement les scénarios les plus pessimistes. Sur le plan technique, plusieurs zones attirent l’attention . Une première région de soutien se situe entre 70 000 $ et 75 000 $, correspondant à d’anciens niveaux d’accumulation. Si cette zone venait à céder durablement, le marché pourrait chercher de la liquidité plus bas, autour des 60 000 $. Ce niveau n’aurait rien d’anormal dans un cycle haussier de grande ampleur, même s’il serait psychologiquement difficile à encaisser. Pour autant, envisager un retour brutal vers des niveaux beaucoup plus bas me semble excessif à ce stade. Les indicateurs de long terme montrent que le Bitcoin reste largement au-dessus de ses supports structurels, et la pression vendeuse semble davantage liée à des ajustements de position qu’à une perte de confiance profonde dans l’actif. Mon scénario privilégié reste celui d’une phase de consolidation étendue . Un marché hésitant, parfois nerveux, mais globalement contenu dans une large fourchette. Une zone comprise entre 65 000 $ et 80 000 $ apparaît aujourd’hui comme un équilibre plausible, tant que le contexte macroéconomique ne se détériore pas brutalement. En résumé, les sorties des ETF constituent un signal à surveiller, mais pas nécessairement une alerte rouge. Le marché digère, réévalue et ajuste. Comme souvent avec le Bitcoin, le bruit est fort, mais la structure de fond reste, pour l’instant, étonnamment solide.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57756139,
    "published": 1770292837000,
    "title": "Bitcoin, ether slide 7% as market 'fear' increases, liquidations mount",
    "body": "Crypto markets extended losses amid heavy derivatives liquidations and macro headwinds, with traders bracing for further downside if bitcoin breaks key support.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|Derivatives|Altcoins|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57757323,
    "published": 1770292694000,
    "title": "Brazil moves to ban algorithmic stablecoins like Ethena’s USDe",
    "body": "New legislation requires all stablecoins to be fully backed by reserve assets and introduces penalties for issuing unbacked stablecoins.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Brazil|Stablecoins|Algorithmic stablecoin|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57755644,
    "published": 1770291394000,
    "title": "Bitcoin drops below $70,000 as crypto selloff deepens before U.S. equity market opens",
    "body": "\"Extreme fear\" grips crypto and metals while U.S. equities show resilience ahead of key earnings.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Google|MicroStrategy|Coinbase|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57774257,
    "published": 1770341072000,
    "title": "Bitcoin Plunges to Near $60,000 Before Paring Losses in Asia",
    "body": "Bitcoin sank in early Asia trading on Friday, extending a selloff that had already erased all the gains booked by the token since President Donald Trump’s 2024 election victory.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57774676,
    "published": 1770343242000,
    "title": "Dogecoin At ‘Cycle Reset’: Analyst Maps 5,500% Extension Toward $4",
    "body": "Chart analyst Crypto Patel (@CryptoPatel) is arguing Dogecoin has returned to the same macro support band that preceded its last major cycle runs, framing the current $0.10–$0.06 area as a “re-accumulation” zone with upside targets extending as high as $4 if history repeats. Dogecoin Hits Key Demand Zone Again In a Feb. 3 post on X, Crypto Patel shared a 2-week DOGE/USDT chart and wrote that DOGE is “at the EXACT level that triggered 17,000% pump,” pointing to a multi-year base that has repeatedly acted as demand since 2021. The post leans heavily on the idea that DOGE’s larger moves have originated from the same structural region, with the current drawdown presented as a typical cycle reset rather than a breakdown. “This Weekly / 2W Chart is Screaming Accumulation,” Patel wrote. “Macro Demand Zone Holding at $0.10–$0.06. Price Respects a Multi-Year Strong Support (Since 2021).” Related Reading: One Month In And 10% Of Dogecoin Millionaires Have Already Disappeared In 2026 – Details The argument is straightforward: DOGE has retraced sharply from its peak and is now back in a band where prior expansions began. Patel characterized the setup as “-87% Down From ATH – Classic Cycle Reset,” and added that “Every Previous Touch of This Zone Led to a Parabolic Expansion,” citing two historical bursts: the 2021 move described as a “+17,000%” rally and a 2024 advance labeled “+600%.” Patel’s roadmap defines three upside targets—$0.50, $1.50, and $4.00—described as a “Full Cycle Extension ~5,500%,” implying a multi-stage move rather than a single straight-line rally. The analysis also provides a clear line in the sand: “Invalidation: Weekly Close Below $0.06,” which would negate the thesis that the region is holding as higher-timeframe demand. Related Reading: Dogecoin Sits On A Make-or-Break Floor: Why It’s Now Or Never Beyond the technical framing, Patel attempted to bolster the long-term narrative with a catalyst claim tied to Elon Musk and SpaceX, writing: “LONG-TERM FUNDAMENTAL CATALYST (DON’T IGNORE THIS) 🚀 Elon Musk has Confirmed that SpaceX (@SpaceX) Plans to Send a Literal #Dogecoin to the Moon.” As Bitcoinist reported on Wednesday, Elon Musk revived the old “Dogecoin to the moon” narrative after replying on X to a fan and saying SpaceX could send a literal Dogecoin to the Moon “maybe next year”, which people interpret as around 2027. The broader message is a familiar positioning contrast: “Smart Money Accumulates When Sentiment Is Dead. Retail Buys When Price Is Vertical.” Whether DOGE’s current base behaves like prior cycles will hinge on the same variable the post flags: holding the $0.10–$0.06 band on a weekly closing basis while traders weigh how much of the “cycle extension” playbook still applies in a market that has already seen one sizable post-2021 rebound. At press time, DOGE traded at $0.09857. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57775381,
    "published": 1770345155000,
    "title": "Bitcoin Price Dumps Hard To $60K, Triggering Market Shockwaves",
    "body": "Bitcoin price extended its decline to $60,000. BTC is down over 10% and might struggle to recover easily above the $70,000 resistance. Bitcoin is attempting to recover but struggling to clear hurdles. The price is trading below $70,000 and the 100 hourly simple moving average. There is a bearish trend line forming with resistance at $70,600 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might dip again if it trades below the $62,500 and $61,200 levels. Bitcoin Price Dips Sharply Bitcoin price failed to remain stable above the $72,000 zone. BTC extended its decline below the $70,000 and $68,500 levels. The bears were able to push the price below $65,500. A low was formed at $60,500, and the price is now attempting to recover. There was a minor increase above the $62,000 and $63,200 levels. The price cleared the 23.6% Fib retracement level of the recent downward move from the $76,865 swing high to the $60,500 low. Bitcoin is now trading below $68,000 and the 100 hourly simple moving average. If the price remains stable above $62,000, it could attempt a fresh increase. Immediate resistance is near the $66,000 level. The first key resistance is near the $67,200 level. A close above the $67,200 resistance might send the price further higher. In the stated case, the price could rise and test the $68,500 resistance or the 50% Fib retracement level of the recent downward move from the $76,865 swing high to the $60,500 low. Any more gains might send the price toward the $70,500 level. There is also a bearish trend line forming with resistance at $70,600 on the hourly chart of the BTC/USD pair. The next barrier for the bulls could be $72,500 and $75,000. Another Decline In BTC? If Bitcoin fails to rise above the $68,500 resistance zone, it could start another decline. Immediate support is near the $63,200 level. The first major support is near the $62,500 level. The next support is now near the $61,200 zone. Any more losses might send the price toward the $60,500 support in the near term. The main support now sits at $60,000, below which BTC might struggle to recover in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $62,500, followed by $61,200. Major Resistance Levels – $67,200 and $68,500.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57775321,
    "published": 1770344904000,
    "title": "Does Bitcoin's Retreat Signal a New Bear Market for Crypto?",
    "body": "A single-day 14% drop and a drawdown of more than 50% have pushed Bitcoin into territory typically associated with bear markets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57776227,
    "published": 1770347349000,
    "title": "Bitcoin Miners IREN and CleanSpark Slide After Earnings Misses Deepen Sector Pressure",
    "body": "Shares fell after both companies reported quarterly revenue below Wall Street expectations as Bitcoin dropped sharply.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57776201,
    "published": 1770347286000,
    "title": "Ethereum Price Closes Sub-$2,000 Support As Crypto Rout Intensifies",
    "body": "Ethereum price extended its decline below $2,000 and $1,950. ETH is now attempting to recover from $1,750 but faces many hurdles near $2,200. Ethereum failed to stay above $2,000 and started a fresh decline. The price is trading below $2,000 and the 100-hourly Simple Moving Average. There is a major bearish trend line forming with resistance at $2,200 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh decline if it stays below the $2,200 zone. Ethereum Price Dips Over 15% Ethereum price failed to remain stable above $2,200 and extended losses, like Bitcoin . ETH price traded below $2,000 to enter a bearish zone. The bears even pushed the price below $1,880. A low was formed at $1,744 and the price is now attempting to recover. There was a move above $1,850. The price surpassed the 23.6% Fib retracement level of the downward move from the $2,341 swing high to the $1,744 low. Ethereum price is now trading below $2,000 and the 100-hourly Simple Moving Average . If the bulls remain in action above $1,800, the price could attempt another increase. Immediate resistance is seen near the $1,950 level. The first key resistance is near the $2,050 level and the 50% Fib retracement level of the downward move from the $2,341 swing high to the $1,744 low. The next major resistance is near the $2,200 level. There is also a major bearish trend line forming with resistance at $2,200 on the hourly chart of ETH/USD. A clear move above the $2,200 resistance might send the price toward the $2,350 resistance. An upside break above the $2,350 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $2,550 resistance zone or even $2,665 in the near term. More Losses In ETH? If Ethereum fails to clear the $2,050 resistance, it could start a fresh decline. Initial support on the downside is near the $1,850 level. The first major support sits near the $1,800 zone. A clear move below the $1,800 support might push the price toward the $1,750 support. Any more losses might send the price toward the $1,720 region. The main support could be $1,680. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI – The RSI for ETH/USD is now below the 50 zone. Major Support Level – $1,850 Major Resistance Level – $2,200",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57776111,
    "published": 1770346919000,
    "title": "Crypto sentiment at lowest point since 2022 crash as Bitcoin tanks to $60K",
    "body": "Bitcoin plummeted to a low of around $60,000 after the Crypto Fear & Greed Index hit its lowest score since mid-2022, when the Terra blockchain collapsed.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57776046,
    "published": 1770346822000,
    "title": "Hyperliquid’s HYPE Jumps 6.2% Post-Ripple Integration, as XRP Moves in the Opposite Direction",
    "body": "A volatile trading session on February 5 offered a clear example of how quickly narratives can diverge in the crypto market. While most large-cap assets moved lower amid regulatory uncertainty and heavy liquidations, Hyperliquid’s HYPE has posted a 6.2% gain following news of its integration with Ripple’s ecosystem. Related Reading: Bitcoin Crash To $72,000 Signals Major Reset: On-Chain Metrics Deteriorate At the same time, XRP extended its decline by 10%, weighed down by broader market pressure rather than project-specific developments. The contrast underlined how selective optimism can emerge even during a broad sell-off, especially when tied to infrastructure upgrades or ecosystem expansion. HYPE's price trends to the downside on the daily chart after recording some gains. Source: HYPEUSD on Tradingview HYPE Rallies After Ripple Integration Hyperliquid’s price moved higher, up 4.23%, after confirmation that the platform had integrated Ripple’s technology stack, a step aimed at improving interoperability and settlement efficiency. Market participants appeared to interpret the move as a practical enhancement rather than a speculative announcement, helping HYPE outperform a largely bearish market. The rally came despite worsening sentiment across the sector. Bitcoin traded near $71,000 after a sharp pullback, and total crypto market capitalization fell more than 6% on the day. Against that backdrop, HYPE’s gains stood out as traders rotated into assets linked to near-term network developments rather than macro-driven trades. While trading volumes in HYPE increased following the announcement, the move remained relatively contained, suggesting measured positioning rather than a surge of speculative leverage. XRP Slips as Market Weakness Dominates XRP, by contrast, declined alongside other major altcoins. The token fell close to 11% over 24 hours, tracking losses in Ethereum, Solana, and BNB as risk appetite faded. The drop occurred even as Ripple-related developments supported other parts of the ecosystem, underscoring how broader market conditions continue to outweigh individual catalysts for large-cap tokens. The sell-off was amplified by derivatives activity. Falling open interest and a rise in forced liquidations across centralized exchanges added to downside momentum, particularly for assets with high leverage exposure. XRP’s move appeared more sentiment-driven than fundamental, reflecting the day’s defensive tone. Broader Market Context Remains Fragile The divergence between HYPE and XRP played out as investors reacted to stalled discussions around a US crypto market structure bill and ongoing debates over stablecoin regulation. These issues contributed to a spike in volatility and more than $800 million in liquidations, mostly from long positions. Meanwhile, institutional positioning continued to shift. Grayscale’s recent decision to remove Cardano from its CoinDesk Crypto 5 ETF in favor of BNB reinforced the focus on liquidity and market depth, a theme that continues to shape capital flows. Related Reading: Are We Near A Bitcoin Bear Market Bottom? History Offers A Framework Hyperliquid’s rally indicates that targeted integrations continue to attract interest, despite weakness in the wider crypto market. Its durability, however, will depend on genuine adoption rather than sentiment alone. Cover image from ChatGPT, HYPEUSD chart on Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ripple|Hype|HYPE price|Hyperliquid|HYPEUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57776633,
    "published": 1770348456000,
    "title": "Bitcoin 'volatility fear gauge' hits FTX-blowup peak as prices crater to nearly $60,000",
    "body": "Bitcoin's volatility gauge, the BVIV, spiked to nearly 100%, its highest level since the 2022 FTX collapse.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Bitcoin Volatility|capital markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57776631,
    "published": 1770348432000,
    "title": "U.S.-Iran warning resurfaces ahead of nuclear talks, further pressuring bitcoin and crypto markets",
    "body": "",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57777611,
    "published": 1770350933000,
    "title": "XRP Price Snaps Back From $1.15 Collapse, Bulls Test The Waters",
    "body": "XRP price extended losses and traded below $1.30. The price is now consolidating losses but faces hurdles near $1.30 and $1.350. XRP price started another decline and traded below the $1.30 zone. The price is now trading below $1.30 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance at $1.380 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move down if it stays below $1.40. XRP Price Dips Over 15% XRP price failed to stay above $1.50 and extended its decline, like Bitcoin and Ethereum . The price declined below $1.450 and $1.40 to enter a short-term bearish zone. The price even extended losses below $1.250. A low was formed at $1.1356, and the price is now consolidating losses. There was a minor upward move above the 23.6% Fib retracement level of the downward move from the $1.6320 swing high to the $1.1350 low. The price is now trading below $1.30 and the 100-hourly Simple Moving Average. There is also a bearish trend line forming with resistance at $1.380 on the hourly chart of the XRP/USD pair. If there is a fresh recovery move, the price might face resistance near the $1.30 level. The first major resistance is near the $1.320 level. A close above $1.320 could send the price to $1.380, the trend line, and the 50% Fib retracement level of the downward move from the $1.6320 swing high to the $1.1350 low. The next hurdle sits at $1.40. A clear move above the $1.40 resistance might send the price toward the $1.420 resistance. Any more gains might send the price toward the $1.450 resistance. The next major hurdle for the bulls might be near $1.50. Another Drop? If XRP fails to clear the $1.320 resistance zone, it could start a fresh decline. Initial support on the downside is near the $1.240 level. The next major support is near the $1.2250 level. If there is a downside break and a close below the $1.2250 level, the price might continue to decline toward $1.20. The next major support sits near the $1.1650 zone, below which the price could continue lower toward $1.150. Technical Indicators Hourly MACD – The MACD for XRP/USD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $1.220 and $1.20. Major Resistance Levels – $1.320 and $1.380.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57777418,
    "published": 1770350459000,
    "title": "XRP Social Sentiment Still Bullish While Bitcoin Mood Sours",
    "body": "Data shows social media users are still optimistic about XRP even as sentiment around Bitcoin and Ethereum has declined alongside the market downturn. XRP Positive/Negative Sentiment Is Still At A Notable Level In a new post on X, analytics firm Santiment has talked about how social media sentiment has compared across Bitcoin, Ethereum, and XRP during the latest market decline. The indicator of relevance here is the “Positive/Negative Sentiment,” which tells us about how positive comments related to a given asset stack up against the negative ones on the major social media platforms. Related Reading: Social Media Now Talking Sub-$60,000 Bitcoin Prices As Fear Rises The metric works by assembling posts/comments/messages containing mentions of the asset and feeding them into a machine-learning model to classify them as bearish or bullish. It then counts up the number of posts in each category and finds their ratio. When the value of this ratio is greater than 1, it means positive comments related to the cryptocurrency outweigh the negative ones. On the other hand, the indicator being under this threshold suggests the dominance of bearish sentiment. Now, here is the chart shared by Santiment that shows the trend in the Positive/Negative Sentiment for Bitcoin, Ethereum, and XRP over the past month: As is visible in the above graph, the Positive/Negative Sentiment plunged across the three cryptocurrencies at the end of January as prices crashed. The indicator’s value slipped below 1 for each of them during this drop, indicating traders became bearish on the market as a whole. As prices have continued to slide down since then, however, a shift has occurred in the Positive/Negative Sentiment, with its value separating for the three. The chart shows that the metric’s latest value for XRP is nearly 2.2, indicating that social media users have become more optimistic about the coin. Meanwhile, the indicator continues to be inside the bearish zone for Bitcoin with a value of 0.79. Ethereum has seen some improvement in the metric to a neutral value of 1, but compared to the normal for January, this level could still be considered to reflect a bearish sentiment among the retail social media crowd. Related Reading: Bitcoin MVRV Z-Score Compresses To Levels Last Seen Near $29,000 Historically, digital asset markets have often tended to move in a direction contrary to the expectations of retail traders. This means that an extreme amount of fear can help prices rebound, while overhype can lead to tops. “There remains a strong argument for a short-term relief rally as long as the small trader crowd continues to show disbelief toward cryptocurrency as a whole,” explained the analytics firm. Given that trader sentiment has diverged for XRP recently, however, it only remains to be seen how the sector will develop in the near future. XRP Price At the time of writing, XRP is floating around $1.35, down more than 27% over the last seven days. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|bitcoin|bitcoin sentiment|btc|xrp|XRP Positive/Negative Sentiment|XRP Sentiment|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57778148,
    "published": 1770352269000,
    "title": "Crypto sentiment gauge hits FTX-era lows as 'extreme fear' reaches a 9 reading",
    "body": "A sharp rise in volatility, a spike in defensive positioning and an increase in fear-driven search interest typically push the index lower.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57778605,
    "published": 1770353529000,
    "title": "Senator Lummis Urges Banks to 'Embrace' Stablecoins Amid CLARITY Act Stalemate",
    "body": "The Wyoming Senator said stablecoins give banks an \"entirely new financial product\" as the crypto market structure bill faces a delay.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57778903,
    "published": 1770354537000,
    "title": "Dogecoin (DOGE) Sinks To $0.08 Amid Relentless Bear Pressure",
    "body": "Dogecoin started a fresh decline below the $0.10 zone against the US Dollar. DOGE is now consolidating losses and might face hurdles near $0.0950 and $0.10. DOGE price started a fresh decline below the $0.10 level. The price is trading below the $0.10 level and the 100-hourly simple moving average. There is a key bearish trend line forming with resistance at $0.0950 on the hourly chart of the DOGE/USD pair (data source from Kraken). The price could extend losses if it stays below $0.0880 and $0.0850. Dogecoin Price Dives Below Support Dogecoin price started a fresh decline after it closed below $0.1120, like Bitcoin and Ethereum . DOGE declined below the $0.10 and $0.0950 support levels. The price even traded below $0.0850. A low was formed near $0.080, and the price is now showing bearish signs. There was a recovery wave above $0.0840. The price climbed above the 23.6% Fib retracement level of the downward move from the $0.1007 swing high to the $0.080 low. Dogecoin price is now trading below the $0.0950 level and the 100-hourly simple moving average. There is also a key bearish trend line forming with resistance at $0.0950 on the hourly chart of the DOGE/USD pair. If there is a recovery wave, immediate resistance on the upside is near the $0.090 level. The first major resistance for the bulls could be near the $0.0950 level and the trend line. The next major resistance is near the $0.09850 level or the 61.8% Fib retracement level of the downward move from the $0.1007 swing high to the $0.080 low. A close above the $0.0985 resistance might send the price toward the $0.1050 resistance. Any more gains might send the price toward the $0.1120 level. The next major stop for the bulls might be $0.120. Another Decline In DOGE? If DOGE’s price fails to climb above the $0.10 level, it could continue to move down. Initial support on the downside is near the $0.0850 level. The next major support is near the $0.0820 level. The main support sits at $0.080. If there is a downside break below the $0.0750 support, the price could decline further. In the stated case, the price might slide toward the $0.0720 level or even $0.070 in the near term. Technical Indicators Hourly MACD – The MACD for DOGE/USD is now gaining momentum in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for DOGE/USD is now below the 50 level. Major Support Levels – $0.0865 and $0.0800. Major Resistance Levels – $0.0950 and $0.0985.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "DOGE|DOGE news|Doge price|DOGE USD|DOGE/BTC|DOGE/USDT|Dogecoin|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57778728,
    "published": 1770354005000,
    "title": "Ethereum Coinbase Premium Drops To 2022 Bear-Market Levels: Capitulation Or Further Downside?",
    "body": "Ethereum has faced intense selling pressure in recent sessions, with price action struggling to stabilize as broader market weakness persists. The asset has revisited the $2,100 zone, a level now being closely monitored by traders attempting to identify potential demand. Despite occasional relief bounces, momentum remains fragile, reflecting ongoing uncertainty across both derivatives and spot markets. Related Reading: Are We Near A Bitcoin Bear Market Bottom? History Offers A Framework A recent CryptoQuant report highlights a notable shift in investor behavior, particularly among US-based participants. The Ethereum Coinbase Premium Index, measured on a 30-day moving average, has dropped to its lowest level since July 2022. This metric compares ETH pricing on Coinbase—often considered a proxy for U.S. institutional flows—against global exchange benchmarks such as Binance. Sustained negative readings typically indicate stronger selling pressure from US entities relative to the broader market. This development suggests that institutional demand may currently be subdued, with some investors reducing exposure amid volatile macro conditions and declining crypto risk appetite. Historically, such deep negative premiums have appeared during periods of market stress, sometimes preceding stabilization phases, though not consistently signaling immediate bottoms. Coinbase Premium Signals Weak Institutional Demand The report notes that the last time the Ethereum Coinbase Premium 30-day moving average reached similarly negative territory was during the deepest phase of the 2022 bear market. Such readings historically reflect a material imbalance between US and global demand, with American investors either actively reducing exposure or remaining on the sidelines. Given the importance of US institutional flows in past crypto rallies, this absence of demand could limit the probability of a sustained near-term recovery. At the same time, the signal is not purely bearish. Extreme negative premiums have often appeared during capitulation phases, when aggressive sellers exhaust available supply. Under those conditions, the market can stabilize as selling pressure fades, even before new inflows fully materialize. This dynamic makes the indicator context-dependent rather than a standalone directional signal. From a technical standpoint, the $2,100 level now carries clear psychological and structural significance. Holding this zone would suggest that demand is beginning to absorb supply despite negative sentiment. However, a durable trend reversal typically requires confirmation from spot demand metrics. A normalization—or eventual return to positive territory—in the Coinbase Premium would indicate renewed institutional participation. Related Reading: Ethereum Transfer Surge Mirrors 2018 And 2021 Peaks – What Happens Next? Ethereum Tests Critical Support As Downtrend Intensifies Ethereum price action on this daily chart reflects a clear deterioration in market structure following the rejection from the $4,000–$4,800 distribution zone seen in late 2025. Since then, ETH has transitioned into a sustained downtrend characterized by lower highs, persistent selling pressure, and repeated failures to reclaim key moving averages. The most recent breakdown below the $2,300 region accelerated bearish momentum, with price now testing the psychological $2,100 support area. This level carries technical relevance because it previously acted as a consolidation zone during earlier phases of the cycle. However, the sharp decline toward it, combined with rising sell-side volume, suggests that market participants are still in risk-reduction mode rather than accumulation. Related Reading: Bitcoin Unrealized Losses Reach 22% – Still No Capitulation Phase Moving averages reinforce the bearish bias. The short-term average has crossed below the medium-term line, while the price remains well under the long-term trend indicator. This confirms structural weakness. Unless ETH can quickly reclaim the $2,400–$2,600 range, rallies are likely to be viewed as relief bounces rather than trend reversals. If $2,100 fails decisively, the next meaningful support could emerge closer to the $1,800–$1,900 zone, where historical demand previously stabilized price action. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum News|Coinbase Premium|ETH|ethereum|Ethereum Analysis|Ethereum Coinbase Premium|Ethereum correction|ethereum news|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57779164,
    "published": 1770355177000,
    "title": "Tether makes $150M investment in Gold.com in latest gold play",
    "body": "Tether and Gold.com are exploring options to allow the use of Tether’s stablecoins to purchase physical gold.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57779621,
    "published": 1770356494000,
    "title": "Crypto Sentiment Sinks to Lowest Level in 3.5 Years",
    "body": "Investor fear in crypto has sunk to levels last seen during the year of Terra's collapse as macro pressures intensify.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57779525,
    "published": 1770356169000,
    "title": "BlackRock's bitcoin fund hits $10 billion volume record, hinting at peak selling",
    "body": "Record volume, redemptions and pronounced tilt toward put options points to institutional capitulation.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|bitcoin spot ETF|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57779993,
    "published": 1770357621000,
    "title": "Bitcoin Crash Exposes Colossal Corporate Losses — Here’s Who’s Most Impacted",
    "body": "The latest downturn in Bitcoin (BTC) has begun to weigh heavily on publicly listed companies that built their balance sheets around the market’s leading cryptocurrency. On Thursday, Bitcoin hovered near the $65,000 level, continuing the sharp decline that began last October. This has impacted equity markets, causing the shares of crypto-exposed firms to decline significantly. Bitcoin Slide Pressures Digital Asset Treasury Firms According to a Reuters report, the renewed volatility in digital assets is dragging down the stock prices of companies that hold Bitcoin and other tokens, raising concerns that the stress could spread more broadly across the sector. The number of publicly traded firms investing in cryptocurrencies surged last year, as many executives bet that digital assets would continue to appreciate over the long-term. Related Reading: Bitcoin Crashes Below $67,000 As Stifel Warns Of Potential Drop To $38,000 However, the backdrop has shifted. Investor anxiety over stretched valuations in artificial intelligence (AI) stocks, combined with uncertainty surrounding the future path of Federal Reserve (Fed) interest rate cuts, has weighed on risk assets more broadly. As a result, Bitcoin has slid to its lowest level since October 2024, putting pressure on companies whose business models rely on holding digital assets. Many of these digital asset treasury firms saw their shares wobble sharply on Thursday. Seven Major Companies Suffer Strategy (previously MicroStrategy), the largest corporate BTC holder with over 700,000 coins, has been among the hardest hit. Its shares have fallen from around $457 in July to as low as $106 on Thursday. In December, the company cut its 2025 earnings outlook, pointing to weakness in Bitcoin prices, and announced plans to establish a reserve to help support dividend payments. The firm led by Michael Saylor said it now expects its full‑year results to range anywhere from a $6.3 billion profit to a $5.5 billion loss, a sharp downgrade from its earlier forecast of a $24 billion net profit. Related Reading: Ripple Throws Weight Behind Hyperliquid, Fueling HYPE’s Rally Toward Crucial Levels Other Bitcoin‑focused firms also felt the impact. Shares of the UK‑based Smarter Web Company fell nearly 18% on Thursday. Rival Bitcoin buyers Nakamoto Inc and Japan’s Metaplanet were also under pressure, dropping almost 9% and more than 7%, respectively. However, the sell-off pressure has not been limited to companies holding only BTC. On Thursday, crypto-related firms that stockpiled other digital tokens also traded lower amid the correction affecting broader digital asset prices. Alt5 Sigma, which announced last year that it would accumulate the Trump family’s World Liberty Financial (WLFI) token, saw its shares drop 8.4%. Similarly, SharpLink Gaming, which holds Ethereum (ETH), declined about 8%, while Forward Industries, a holder of Solana (SOL), slid nearly 6%. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|BTCUSDT|crypto|crypto market|crypto news|Digital Asset Treasuries|Microstrategy|Strategy",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57779984,
    "published": 1770357521000,
    "title": "Large Bitcoin holders’ share of supply hits 9-month low amid price drop",
    "body": "Santiment says the pattern of large holders selling while retail scoops up Bitcoin is “what historically creates bear cycles.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]