[
  {
    "id": 56806436,
    "published": 1767520849000,
    "title": "A Maduro Bet, A Market Alarm: US Lawmaker Targets Trading Abuses",
    "body": "US Rep. Ritchie Torres said he will introduce legislation to curb what he and other lawmakers describe as possible insider trading on prediction markets, after a single, highly timed wager on Polymarket paid off when Venezuelan President Nicolas Maduro was captured. Related Reading: Bitcoin Dominance Grows As Altcoins Post Another Losing Year: Analyst Reports have disclosed that the bill — being called the Public Integrity in Financial Prediction Markets Act of 2026 — would bar federally elected officials, political appointees and executive branch staff from trading on event markets when they hold material nonpublic information. Public Integrity In Focus According to reporting, a newly created Polymarket account placed roughly $32,500 in bets on a contract that asked whether Maduro would be out of power by January 31, 2026. That stake bought about 438,000 shares when the market price was as low as $0.07 per share late Friday. Within about 24 hours, after action by US forces and an announcement by US President Donald Trump, the position surged—returning more than $400,000 to the account. NEW — RITCHIE TORRES (D-N.Y.) will introduce a bill on this. Bill will be called the Public Integrity in Financial Prediction Markets Act of 2026 Description, per a source: This bill prohibits federal elected officials, political appointees, and Executive Branch employees… https://t.co/eZZ9BmAMgJ — Jake Sherman (@JakeSherman) January 3, 2026 The trade’s timing set off immediate questions. Social media users and some investors flagged the purchase as suspicious because it came hours before the public announcement. Observers noted that prediction markets can move quickly on small flows of information, and that enforcement rules vary across platforms. Reports note that other markets, like Kalshi, had priced similar outcomes at roughly $0.13, underlining how unexpected the outcome was to many traders. A newly created Polymarket account invested over $30,000 yesterday in Maduro’s exit. The US then took Maduro into custody overnight, and the trader profited $400,000 in less than 24 hours. Insider trading is not only allowed on prediction markets; it’s encouraged. https://t.co/EtZyW1IWTa pic.twitter.com/MzsU9kOU73 — Joe Pompliano (@JoePompliano) January 3, 2026 How The Bill Would Work Torres’s proposal would adapt principles from existing rules that limit trading by officials in traditional securities markets and extend them to online prediction exchanges. The draft language aims to make it unlawful for covered government figures to trade on contracts tied to government actions or political events when they possess nonpublic information because of their official roles. The measure would also task regulators with clarifying which platforms are covered and how violations would be enforced. Market Reaction And Questions Platform operators have long said their terms forbid trading on material nonpublic information, but critics say those rules are hard to police in real time. Some analysts and lawmakers argue that this episode shows a gap between written policies and effective oversight. Others warn against overreach that could stifle legitimate market activity used for forecasting and research. Related Reading: A Maduro Bet, A Market Alarm: US Lawmaker Targets Trading Abuses Investigations may look at the account’s origins and any links to people with privileged knowledge. Lawmakers, meanwhile, are pushing for clearer legal guardrails. If Congress moves quickly, new rules could reshape who may legally bet on political and national security events. Featured image from AFP/Getty Images, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|crypto|Insider Trading|Maduro|Polymarket|Venezuela",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56808905,
    "published": 1767531600000,
    "title": "Crypto rich threaten to leave California after new tax: Is it a bluff?",
    "body": "Crypto billionaires in California are threatening to leave the state, but are they ready to make good on their promise, or is an impending wealth exodus more of a paper tiger?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 56808749,
    "published": 1767531291000,
    "title": "Wrench attacks against crypto holders are rising and growing ‘more violent’",
    "body": "An analysis of “wrench attacks” shows physical assaults against crypto holders are increasing in number and severity, with Europe and Asia seeing the sharpest rise.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56812244,
    "published": 1767538804000,
    "title": "PwC ‘leans in’ to crypto as Donald Trump and lawmakers embrace sector",
    "body": "Big Four firm has made strategic pivot towards digital assets, says US boss",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56812212,
    "published": 1767538800000,
    "title": "Neobanks will fuel Ethereum's 2026 growth, says ether.fi CEO",
    "body": "Ethereum's next phase will be defined by financial products that feel familiar to everyday users, Mike Silagadze said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Ether.Fi|Consensus Hong Kong 2026|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56812760,
    "published": 1767539847000,
    "title": "Ghana Legalizes Crypto While Ghanaian Village Shows Bitcoin’s Potential",
    "body": "At the end of 2025, Ghana's parliament passed a law legalizing crypto, making it easier for projects like Bitcoin Dua to educate everyday Ghanaians about Bitcoin.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56813865,
    "published": 1767542436000,
    "title": "Dogecoin Enters Crucial Accumulation Zone — DOGE Price To $0.2?",
    "body": "After a difficult end to 2025, the altcoin market looks set to take the lead in the new year, being the most significant beneficiary from the recent post-holiday rally. Dogecoin, the largest meme coin by market capitalization, has jumped by nearly 24% since the turn of the year. According to the latest on-chain data, the price of Dogecoin appears to be in a critical region at the moment. The relevance of this zone suggests that the meme coin may be merely at the start of an extended upward trend over the next few months. Is It Time To Buy DOGE? In a January 3 post on X, Alphractal CEO and founder Joao Wedson said that Dogecoin has entered its most important accumulation zone. This on-chain observation is based on the recent changes in the CVDD (Cumulative Value Days Destroyed) Channel. Related Reading: Bitcoin Sharpe Ratio Flips Into Negative Territory— Is The Recovery Back On? For context, the CVDD Channel is an on-chain indicator that tracks the volume of aged capital being sent into the market (Dogecoin, in this case). This metric is typically used in highlighting zones of long-term support or resistance based on the movement of aged coins on-chain. Wedson highlighted in his post that the CVDD channels depend on Fibonacci-based levels on top of the CVDD curve. This metric creates historical value zones where price tends to react; with the blue CVDD lines, for instance, acting as strong structural support for the price of Dogecoin. As observed in the chart above, DOGE’s recent surge to around $0.15 came after its price bounced from the first blue level. In essence, these lower blue levels have historically proven to be good support cushions for the Dogecoin price. According to Wedson, the lower CVDD Fibonacci zones often coincide with long-term accumulation phases for Dogecoin. Hence, it might be time to accumulate the meme coin, especially as its price is wedged within the blue CVDD zones. Dogecoin Price Outlook 2026 As of this writing, the price of DOGE stands at around 0.1415, reflecting an over 2% jump in the past 24 hours. A broader look at the chart shows that Dogecoin seems to be heating up at the moment. According to data from CoinGecko, the meme coin’s value has increased by more than 15% in the last seven days. Related Reading: XRP Under $2? One Of The ‘Greatest Blessings’ We’ll See In Our Lifetime, Analyst Says Following its red-hot action to kickstart the new year, the price of Dogecoin looks set for a positive run in 2026. Moreover, the altcoin market is being tipped to outperform Bitcoin this year. Hence, a renewed bullish momentum and a long-overdue altcoin season could have the DOGE price reaching new highs in 2026. Featured image from iStock, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|CVDD|doge|dogecoin price|dogeusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56817241,
    "published": 1767549623000,
    "title": "Crypto Users Lose Far Less To Phishing As Losses Drop 83% – Details",
    "body": "Crypto phishing losses plunged in 2025, but experts warn the threat has only changed shape rather than disappeared. Reports show a sharp fall in money stolen by wallet-draining scams, even as attackers tested new tricks tied to recent protocol changes. Related Reading: Bitcoin Dominance Grows As Altcoins Post Another Losing Year: Analyst Scam Sniffer Data Shows Drop According to Scam Sniffer’s 2025 analysis, wallet drainer phishing losses fell to about $83.85 million — an 83% decline from roughly $494 million in 2024. The number of affected wallets dropped to around 106,000, a fall of about 68% year-on-year. These figures come from the security platform’s annual study and were picked up by major crypto outlets. Attackers Shift, Not Stop Only 11 incidents topped $1 million in 2025, down from 30 the prior year, signaling fewer headline grabs but a rise in smaller hits. The largest single theft recorded last year was roughly $6.5 million, tied to a malicious Permit signature attack. Average losses per victim fell to roughly $790, which suggests attackers moved toward more frequent, lower-value strikes. Market Moves Mattered Losses followed market activity. The third quarter logged the highest damage at about $31 million, when Ethereum’s rally brought more users and approvals onchain. Monthly peaks included August, which posted about $12.17 million, while December was the quietest with roughly $2 million. That pattern shows fraudsters target busy trading windows. 1/ Ever woken up to an empty crypto wallet? With scammers draining $107K+ across EVM chains JUST THIS WEEK (per @zachxbt), it’s scarier than ever! Shoutout to @realscamsniffer for their 2025 report – losses down 83%, but threats are evolving FAST. Let’s recap & warn on 2026… https://t.co/uSerpsg80d — JP (@rugpullfinder) January 3, 2026 Permit Signatures And New Vectors Reports highlighted Permit and Permit2 signature abuses as a major driver of big losses, accounting for a large share of multi-million cases. Scam Sniffer also flagged EIP-7702 batch signature techniques that were used in a few complex attacks after network upgrades. Security teams say these methods exploit user approval flows rather than raw smart-contract bugs. Why The Drop Happened Analysts attribute much of the improvement to better wallet warnings, wider use of approval revocation tools, and more active tracking by onchain monitors. Some defenders also point to reduced market froth in parts of the year, which lowered the pool of high-value targets. Still, multiple outlets stress that reduced totals do not equal safety. Related Reading: A Maduro Bet, A Market Alarm: US Lawmaker Targets Trading Abuses Based on reports, phishing will likely remain cyclical: losses could spike again during big rallies or when new signing features are introduced. Security firms urge users to check approvals, avoid blind signing, and use wallet tools that flag risky requests. Regulators and exchanges are watching the trend, but responsibility for many attacks still falls to individual users and wallet software. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|bitcoin|crypto|hackers|phishing|scam|Scam Sniffer",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56821545,
    "published": 1767558885000,
    "title": "Altcoins hold 'crucial' support, set for 'big leg' up, says analyst",
    "body": "The altcoin market is set to rally, based on technical analysis showing altcoins trading above critical support levels formed in October.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 56822235,
    "published": 1767560401000,
    "title": "$18 Million Ethereum Loss Sends Whale Running To Gold",
    "body": "A large crypto wallet that recently took a sharp loss on Ethereum has restructured its holdings, moving away from volatile tokens and increasing exposure to stablecoins and tokenized gold, according to on-chain tracking data. Related Reading: A Maduro Bet, A Market Alarm: US Lawmaker Targets Trading Abuses The address drew attention after an aggressive Ethereum purchase late last year went wrong. Between November 3 and November 7, 2025, the wallet spent about $110 million to acquire 31,005 ETH at an average price of $3,581. As prices slid, the position was unwound. Nearly the entire holding was sold for roughly $92.19 million, locking in a loss close to $18 million within two weeks. At current prices near $3,020, that same Ethereum stack would now be valued at around $93.6 million. Shift Away From Ether After Costly Exit Based on reports from blockchain monitoring platforms, the sell-off marked a clear change in behavior. The wallet, once heavily tied to Ethereum, no longer holds a large directional bet on the asset. Instead, balances have been spread across cash-like tokens and commodities. The move reflects caution rather than an attempt to quickly recover losses. An unknown whale, who lost $18.8M on $ETH in just 2 weeks, has abandoned $ETH and rotated into #gold. The whale has spent $14.58M to buy 3,299 $XAUT at $4,421 over the past 7 hours.https://t.co/hit6agWmHd pic.twitter.com/X7k94zV0iQ — Lookonchain (@lookonchain) January 2, 2026 Gold Buying Shows Preference For Lower Volatility According to on-chain records, the address began building a position in Tether’s tokenized gold product, XAUT. Starting on Friday, the wallet spent $14.58 million in USDT to buy 3,299 XAUT across several transactions. The average purchase price came in near $4,421 per token. This was not the first gold buy. A smaller XAUT acquisition was made on December 13, roughly three weeks earlier. As of the latest data, the wallet holds 3,386 XAUT tokens worth about $14.92 million. The broader portfolio now totals close to $91 million. About $58 million sits in USDT, another $18 million is held in USDC, while the remainder is split between XAUT and a reduced Ethereum balance. The composition points to capital protection rather than high-risk positioning. Metals Outperform Crypto In 2025 Returns from last year help explain the change. Reports have disclosed that Bitcoin fell by 6% in 2025, while Ethereum dropped 11%. Over the same period, gold surged over 60%, and silver rose an even steeper 147%. Related Reading: Bitcoin Dominance Grows As Altcoins Post Another Losing Year: Analyst Major stock indexes such as the S&P 500, Dow Jones, and Nasdaq 100 also posted stronger performance than much of the crypto market. With those results in view, some investors appear more comfortable holding assets linked to metals or cash. Meanwhile, analysts at asset manager VanEck have pointed to 2026 as a possible recovery year for the crypto market. Their view contrasts with the current behavior of large wallets moving into stablecoins and gold-linked tokens. The divide shows how uncertain sentiment remains after a year when metals and traditional assets delivered stronger gains than major cryptocurrencies. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|altcoins|crypto|ETH|Ether|ethereum|gold|yellow metal",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56829830,
    "published": 1767575905000,
    "title": "Bitcoin advocate Machado in running to replace Venezuela's Maduro",
    "body": "Nobel Prize-winning Bitcoiner María Corina Machado is one of three looking to replace Nicolás Maduro as Venezuela's President after he was captured on Saturday.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56832098,
    "published": 1767580671000,
    "title": "Bitcoin devs flocked back to work amid a big year for crypto",
    "body": "Key metrics tracking the development of Bitcoin Core show 2025 was a good year for the blockchain, with more developers contributing more code, says Jameson Lopp.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56832651,
    "published": 1767581847000,
    "title": "Bitcoin Price Surges Beyond Resistance, Market Sentiment Flips Bullish",
    "body": "Bitcoin price started a major increase above $91,200. BTC is now showing bullish signs and might extend gains above $93,000. Bitcoin started a fresh increase above the $91,200 zone. The price is trading above $92,000 and the 100 hourly Simple moving average. There is a key bullish trend line forming with support at $91,500 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move up if it stays above the $91,200 zone. Bitcoin Price Eyes More Upsides Bitcoin price remained supported above the $90,000 zone and started a fresh increase. BTC gained pace for a move above the $90,500 and $91,200 resistance levels. It even surpassed $92,000. A new multi-week high was formed at $93,333 and the price is now consolidating gains. It is stable above the 23.6% Fib retracement level of the recent upward move from the $90,804 swing low to the $93,333 high. Bitcoin is now trading above $92,000 and the 100 hourly Simple moving average . Besides, there is a key bullish trend line forming with support at $91,500 on the hourly chart of the BTC/USD pair. If the price remains stable above $91,500, it could attempt a fresh recovery wave. Immediate resistance is near the $93,200 level. The first key resistance is near the $93,500 level. The next resistance could be $94,000. A close above the $94,000 resistance might send the price further higher. In the stated case, the price could rise and test the $94,650 resistance. Any more gains might send the price toward the $95,000 level. The next barrier for the bulls could be $95,500 and $95,800. Another Decline In BTC? If Bitcoin fails to rise above the $93,200 resistance zone, it could start another decline. Immediate support is near the $92,200 level. The first major support is near the $92,000 level or the 50% Fib retracement level of the recent upward move from the $90,804 swing low to the $93,333 high. The next support is now near the $91,500 zone. Any more losses might send the price toward the $90,500 support in the near term. The main support sits at $90,000, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $92,000, followed by $91,500. Major Resistance Levels – $93,200 and $94,000.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56833454,
    "published": 1767583409000,
    "title": "Ethereum powers $8T in stablecoin transfers in Q4, smashing record",
    "body": "Ethereum processed $8 trillion in stablecoin transfers during Q4, nearly double Q2’s volume, while active addresses and daily transactions peaked.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56833274,
    "published": 1767583089000,
    "title": "Ethereum Price Rallies to $3,200, Bulls Press for Further Upside",
    "body": "Ethereum price started a steady upward move above $3,050. ETH is now consolidating gains and might aim for more gains above $3,200. Ethereum started a fresh increase above $3,000 and $3,050. The price is trading above $3,100 and the 100-hourly Simple Moving Average. There is a short-term bullish trend line forming with support at $3,120 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move up if it clears the $3,200 zone. Ethereum Price Eyes More Gains Ethereum price started a fresh increase after it settled above the $3,000 zone, like Bitcoin . ETH price gained pace for a move above the $3,050 and $3,120 resistance levels. The bulls even pumped the price toward $3,200. A high was formed at $3,218, and the price is now consolidating gains. It declined a few points below the 23.6% Fib retracement level of the recent increase from the $3,116 swing low to the $3,218 high. Ethereum price is now trading above $3,100 and the 100-hourly Simple Moving Average . Besides, there is a short-term bullish trend line forming with support at $3,120 on the hourly chart of ETH/USD. If the bulls are able to protect more losses below $3,120, the price could attempt another increase. Immediate resistance is seen near the $3,200 level. The first key resistance is near the $3,220 level. The next major resistance is near the $3,250 level. A clear move above the $3,250 resistance might send the price toward the $3,350 resistance. An upside break above the $3,350 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $3,450 resistance zone or even $3,500 in the near term. Another Decline In ETH? If Ethereum fails to clear the $3,220 resistance, it could start a fresh decline. Initial support on the downside is near the $3,165 level or the 50% Fib retracement level of the recent increase from the $3,116 swing low to the $3,218 high. The first major support sits near the $3,120 zone. A clear move below the $3,120 support might push the price toward the $3,050 support. Any more losses might send the price toward the $3,000 region. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI – The RSI for ETH/USD is now above the 50 zone. Major Support Level – $3,120 Major Resistance Level – $3,220",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56833323,
    "published": 1767582882000,
    "title": "Ethereum ready to solve blockchain trilemma: Vitalik Buterin",
    "body": "Ethereum's co-founder says PeerDAS and ZK-EVMs have solved crypto's scalability vs. security vs. decentralization trade-off.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56833939,
    "published": 1767584417000,
    "title": "Meme Coins Swell as Sector Outstrips Broader Crypto Market",
    "body": "Pepe, Bonk, and other meme coins soar with double-digit gains as risk-on sentiment renews amid improving geopolitical and fiscal policies.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "dogecoin|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56834666,
    "published": 1767586112000,
    "title": "XRP Price Explodes Higher, Unstoppable Rally Captures Trader Attention",
    "body": "XRP price started a strong increase above $2.00. The price is now consolidating gains and might aim for more gains above the $2.165 zone. XRP price started a fresh increase above the $2.00 zone. The price is now trading above $2.10 and the 100-hourly Simple Moving Average. There is a bullish trend line forming with support at $2.070 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move up if it settles above $2.20. XRP Price Regains Traction XRP price started a decent upward move above $2.00 and $2.020, like Bitcoin and Ethereum . The price gained pace for a clear move above the $2.10 resistance. The bulls even pumped the price above the $2.150 zone. A high was formed at $2.165 and the price started a consolidation phase above the 23.6% Fib retracement level of the upward move from the $1.983 swing low to the $2.165 high. The price is now trading above $2.10 and the 100-hourly Simple Moving Average. Besides, there is a bullish trend line forming with support at $2.070 on the hourly chart of the XRP/USD pair. If there is a fresh upward move, the price might face resistance near the $2.1650 level. The first major resistance is near the $2.180 level, above which the price could rise and test $2.20. A clear move above the $2.20 resistance might send the price toward the $2.250 resistance. Any more gains might send the price toward the $2.320 resistance. The next major hurdle for the bulls might be near $2.350. Downside Correction? If XRP fails to clear the $2.1650 resistance zone, it could start a fresh decline. Initial support on the downside is near the $2.120 level. The next major support is near the $2.070 level or the 50% Fib retracement level of the upward move from the $1.983 swing low to the $2.165 high. If there is a downside break and a close below the $2.070 level, the price might continue to decline toward $2.020. The next major support sits near the $2.00 zone, below which the price could continue lower toward $1.9650. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $2.10 and $2.070. Major Resistance Levels – $2.1650 and $2.20.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56836024,
    "published": 1767588346000,
    "title": "Bitcoin Climbs to Three-Week High After US Captures Maduro",
    "body": "Bitcoin hit a three-week high in early Asia trading, as political uncertainty continues after the US move to oust Venezuela’s president Nicolás Maduro over the weekend.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56836078,
    "published": 1767588331000,
    "title": "Bitcoin briefly hits $93,000 as crypto market extends new year rally with $260 million in liquidations",
    "body": "The rally in crypto was mirrored by a surge in commodities and Asian equities, driven by AI-led momentum and geopolitical developments.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56836439,
    "published": 1767588917000,
    "title": "PwC deepens crypto push as U.S. rules shift and stablecoins go mainstream: Report",
    "body": "PwC aims to enhance its audit and consulting services by exploring the use of stablecoins to improve payment efficiency.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|PwC|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56837058,
    "published": 1767591018000,
    "title": "Solana (SOL) Reclaims 132 Level, Momentum Turns Sharply Bullish",
    "body": "Solana started a fresh increase above the $130 zone. SOL price is now consolidating above $132 and might aim for more gains above the $138 zone. SOL price started a fresh upward move above the $130 and $132 levels against the US Dollar. The price is now trading above $132 and the 100-hourly simple moving average. There is a bullish trend line forming with support at $135 on the hourly chart of the SOL/USD pair (data source from Kraken). The pair could extend gains if it clears the $140 resistance zone. Solana Price Gains Momentum Solana price started a decent increase after it settled above the $125 zone, like Bitcoin and Ethereum . SOL climbed above the $130 level to enter a short-term positive zone. The price even smashed the $132 resistance. The bulls were able to push the price above $135. The price is now consolidating gains above the 23.6% Fib retracement level of the recent upward move from the $123 swing low to the $138 high. Solana is now trading above $135 and the 100-hourly simple moving average. Besides, there is a bullish trend line forming with support at $135 on the hourly chart of the SOL/USD pair. On the upside, the price is facing resistance near $138. The next major resistance is near the $140 level. The main resistance could be $145. A successful close above the $145 resistance zone could set the pace for another steady increase. The next key resistance is $150. Any more gains might send the price toward the $155 level. Another Decline In SOL? If SOL fails to rise above the $185 resistance, it could start another decline. Initial support on the downside is near the $134 zone and the trend line. The first major support is near the $130 level and the 50% Fib retracement level of the recent upward move from the $123 swing low to the $138 high. A break below the $130 level might send the price toward the $128 support zone. If there is a close below the $128 support, the price could decline toward the $120 support in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is gaining pace in the bullish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is above the 50 level. Major Support Levels – $135 and $130. Major Resistance Levels – $138 and $140.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Technical analysis|Sol|Solana|solbtc|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56837005,
    "published": 1767590888000,
    "title": "Bitcoin eyes longest daily winning streak in 3 months",
    "body": "Bitcoin rose over 1% during Monday's Asian trading session, marking a potential five-day winning streak.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Markets|btc|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56837500,
    "published": 1767591865000,
    "title": "BlackRock’s Bitcoin ETF Sees Biggest Inflow in Three Months as Crypto Prices Rise",
    "body": "Analysts cite Bitcoin portfolio rebalancing as institutional investors price in three more years of Trump's \"America First\" policy.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56838256,
    "published": 1767593183000,
    "title": "9 myths about Bitcoin energy use, debunked by data: ESG expert",
    "body": "Peer-reviewed studies contradict claims that Bitcoin mining destabilizes grids or increases costs, showing it uses more renewable energy instead.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56837937,
    "published": 1767592598000,
    "title": "PwC leaned into crypto after US regulatory shift, CEO says",
    "body": "PwC is one of the largest and most influential accounting and professional services companies in the world, with global revenues of around $56.9 billion as of October.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56832277,
    "published": 1767580821000,
    "title": "Memecoins rip into 2026 with 23% market cap pump",
    "body": "Transaction volume jumped nearly 300% as memecoin market capitalization rose more than 23%, rebounding sharply from late-2025 lows across the sector overall.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  }
]