[
  {
    "id": 57459047,
    "published": 1769355402000,
    "title": "RWA Tokenization Accelerates With Blockchain-Based Markets",
    "body": "TradFi continues to lead the push for mainstream crypto adoption, and invvestors should take notice",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57459373,
    "published": 1769356810000,
    "title": "XRP Charts Flash Familiar Signal As Analyst Calls For $11, Then $70",
    "body": "A growing number of chart watchers are pointing to a long stretch of sideways trading for XRP and saying this setup has come before big rallies. According to a widely followed analyst known as CryptoBull, the current price action echoes earlier runs in the token’s history. Related Reading: Crypto Meets Private Banking: UBS Weighs New Offering The signal is simple: long quiet periods sometimes lead to sharp moves when buying pressure returns. That does not mean a jump is guaranteed. Markets can stay quiet for a long time, and timing is uncertain. Pattern Mirrors Prior Cycles Based on reports, XRP’s weekly structure shows a stretch of range trading after strong breakouts from earlier years. The comparison reaches back several cycles. In past examples, long ranges eventually gave way to impulsive runs that pushed the price far above prior highs. The next impulse will take #XRP to $11 and the last wave to $70. The price pattern is copying the previous bullrun, only difference is time, which makes sense, as we need longer accumulation for higher prices. pic.twitter.com/WJxzYDVRKT — CryptoBull (@CryptoBull2020) January 23, 2026 CryptoBull argues the present consolidation has lasted longer than previous ones, which, he says, could compress price action and build fuel for a larger expansion when momentum flips. The idea rests on history repeating itself in broad strokes, not in exact moves. Longer Accumulation Could Support Bigger Targets Some analysts see a sixfold move as plausible if the same pattern plays out. That kind of rise would put XRP near $11, a figure being discussed by multiple commentators. There is also talk of a further, final wave lifting the token much higher in a later stage — talk that reaches $70 in extreme scenarios. A bottom test—where price revisits support to confirm strength before a new push—has appeared in a few past cycles and is being watched closely now. The presence of such tests can either validate a base or warn that the range has more work to do. Timelines are vague, and a long accumulation period can stretch for years before any decisive breakout. Related Reading: Money Keeps Leaving: Bitcoin ETFs Shed $1.72 Billion In Just 5 Sessions RLUSD Rumors Fuel Speculative Calls Reports that BlackRock may use Ripple’s RLUSD stablecoin have added fuel to the fire. News like that has pushed sentiment upward and sparked fresh technical calls, with some forecasts ranging from $6 to $14 in near- to mid-term scenarios. Other voices go far beyond, naming targets that would imply market caps so large they would be hard to reconcile with today’s market size. These more extreme numbers should be treated with caution, because they assume near-perfect conditions and massive capital flows that may never arrive. Still, adoption whispers can tilt sentiment and speed up moves when buyers pile in. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|BlackRock|Cypto|Ripple|RLUSD|Stablecoins|xrp",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57460289,
    "published": 1769360463000,
    "title": "How SharpLink Aims to Be the Most 'Focused, Disciplined' Ethereum Treasury in 2026",
    "body": "Ethereum treasury firm SharpLink Gaming hopes to stand apart from the pack by focusing on the long-term—with shareholders top of mind.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57460086,
    "published": 1769359359000,
    "title": "Tezos Tallinn upgrade now live, slashes block times to 6 seconds",
    "body": "The Tallinn protocol upgrade marks Tezos' 20th major update since launching in 2018, and was implemented without a network fork.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 206,
        "NAME": "FORKS",
        "CATEGORY": "FORKS"
      }
    ]
  },
  {
    "id": 57461216,
    "published": 1769364052000,
    "title": "Is Bitcoin Supercycle Truly On The Horizon? Analyst Predicts $31K Bottom In 2026",
    "body": "The calls of a potential Bitcoin supercycle in 2026 intensified over the past week after former Binance CEO Changpeng ‘CZ’ Zhao — yet another prominent voice in crypto — laid out his predictions for the new year. However, a popular analyst on the social media platform X has released an opposing view, predicting a deep bottom for the BTC price this year. BTC Price At Risk Of Further 65% Decline In a January 25th post on the X platform, prominent crypto trader Ali Martinez said, in a sarcastic tone, that “the super cycle is super cycling.” In what seemed like a response to the buzz around CZ’s Bitcoin supercycle projection, the market pundit tempered the expectations with a $31,000 price bottom call for the premier cryptocurrency in 2026. This bearish prediction is based on the appearance of price fractals on the BTC chart. For context, fractals are repeating patterns in price charts that can help map and project potential price movements for a particular cryptocurrency (Bitcoin, in this scenario). Related Reading: Gold Becomes The Whale Safe Haven As Bitcoin Takes A Back Seat As observed in the chart above, the price of BTC is currently following a similar movement pattern as in 2022. The premier cryptocurrency, after initially setting a then all-time high around $67,000 in early 2021, witnessed a nearly 55% correction to just above the $30,000 level by mid-July. While the price of Bitcoin recovered and went back to set a record high of above $69,000 by the end of 2021, the market leader spent the majority of the following year in a downward trend. Exacerbated by the various bearish events of 2022, BTC ended the year at a low of around $15,500. Martinez believes that the Bitcoin price is undergoing a similar movement pattern, having experienced an over 32% decline before climbing to the current all-time high of $126,080. The market pundit postulates that the premier cryptocurrency is currently witnessing the extended decline that saw its price reach $15,500 in 2022. However, it is worth mentioning that the target this time around lies at $31,800, nearly 65% drop from the current price point. Hence, if the historical patterns highlighted by Martinez are to go by, there seems to be a higher likelihood of the Bitcoin price embarking on an extended downward trend rather than a supercycle. Bitcoin Price At A Glance As of this writing, the price of BTC stands at around $88,528, reflecting an over 1% decline in the past 24 hours. Related Reading: Bitcoin Metric Suggests Miners Are In Recovery Mode — Price To Follow? Featured image from iStock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|bitcoin price|btc|BTC news|btc price|BTCUSDT|crypto",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57461044,
    "published": 1769363304000,
    "title": "Bitcoin slips below $88,000 ahead of Fed week and Big Tech earnings",
    "body": "Bitcoin and major tokens weakened Sunday as markets position ahead of the Federal Reserve’s next rate decision and a heavy slate of Magnificent Seven earnings.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57461817,
    "published": 1769366293000,
    "title": "Bitcoin sells off into weekly close as bulls face $86K BTC price reckoning",
    "body": "Bitcoin began losing gains as US futures prepared to open as markets geared up to deal with a host of potential downside volatility catalysts.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57463047,
    "published": 1769371201000,
    "title": "XRP Enters Phase 4 In Long-Term Chart Structure: Road To $21.5 Now Open",
    "body": "Technical analysis of XRP’s price action on the 3-week candlestick timeframe chart shows that the cryptocurrency is about to play out a road to the double-digit threshold based on its long-term structure. The analysis, which was shared on the social media platform X alongside a multiyear chart, points to XRP trading in what is labeled Phase 4. At the center of this setup is a clear technical target of a break above the previous all-time high and a run to at least $21.5 Related Reading: XRP Showing Strength, Analyst Points To $4 Potential XRP Price Action In Phases Technical analysis of XRP price action shows that the cryptocurrency has been trading in a series of four phases for more than a decade. One full sequence of four phases unfolded between mid-2013 and mid-2017 as the foundation for XRP’s first rally to price peaks. Since then, a second set of four phases has been developing and following a similar pattern. XRP transitioned into a new phase 1 and phase 2 sequence that led to a 2018 peak for phase 1 and then a pullback for phase 2 between 2018 and 2020. This was followed by an unusually long p3 that stretched from 2019 to mid-2024, visible on the chart as a broad, multi-year consolidation with converging trendlines of lower highs and higher lows. During this time, XRP’s price action was trapped inside the compression structure, just like the behavior seen during phase 3 of the first cycle. XRP Price Chart. Source: @amonyx On X Phase 4 Returns: XRP To Double Digits According to the technical analysis, phase 4 began in 2025, when XRP finally broke above the compression range in mid-2024. This breakout was the same structural transition seen in mid-2017, when XRP exited consolidation and entered expansion. Phase 4 has already been in progress for several months and includes the period when XRP rallied to new all-time highs in mid-2025, eventually topping out at $3.65 in July. Since that peak, however, XRP’s price action has been playing out a corrective downward trend and is down by roughly 48% at the time of writing. Despite the ongoing correction, the projection is that XRP is still in phase 4 and is going to break into new all-time highs soon. This shows that phase 4 could unfold over an extended period and not with a single impulse move. The current all-time high of $3.65 is the first major technical hurdle, and a break above it will serve as confirmation that XRP is back into price discovery. Related Reading: Gold Becomes The Whale Safe Haven As Bitcoin Takes A Back Seat Based on this technical analysis, past expansion ratios from the previous cycle are applied and a 6.618 Fibonacci extension is measured from the phase 3 support low. This points to a projected price level near $21.5. At the time of writing, XRP is trading at $1.89, meaning a move to that level would represent an increase of roughly 1,040% from current prices. Featured image from Pexels, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|crypto market|crypto news|cryptocurrency|xrp|xrp news|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57462904,
    "published": 1769370422000,
    "title": "'Opportunists' pushing protocol changes are BTC's biggest threat: Saylor",
    "body": "Major changes to the Bitcoin protocol should be well-thought-out and rare, Strategy co-founder Michael Saylor previously said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57463081,
    "published": 1769371262000,
    "title": "AI 'Swarms' Could Escalate Online Misinformation and Manipulation, Researchers Warn",
    "body": "A new academic paper examines how autonomous AI agents could make influence campaigns harder to detect and more effective at scale.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57464369,
    "published": 1769376028000,
    "title": "Foundry USA hashrate down 60% since Friday amid deadly storm: Report",
    "body": "Winter storm Fern is currently sweeping across the United States and has already left 1 million residents without electrical power.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      }
    ]
  },
  {
    "id": 57466735,
    "published": 1769385624000,
    "title": "Altcoins Don’t Move Slowly: 6-Week Window Can Rewrite Years Of Price Action",
    "body": "Crypto traders often assume that meaningful gains need long timelines to take place, and they often give up during the wait and silence. However, crypto has a habit of shattering that belief without warning. History shows that when conditions line up, altcoins do not grind higher over years. They release and erase multiple years of drawdowns in a matter of weeks. That memory was highlighted by a crypto commentator known as Waterman on the social media platform X, who noted a familiar seasonal window between February and late April to early May for an altcoin explosion. Related Reading: Gold Becomes The Whale Safe Haven As Bitcoin Takes A Back Seat Speed Matters More Than Time The most notable example of an altcoin rally season was in 2021, when the entire altcoin market went on a rally to new all-time highs, many of which are still unbroken for some cryptocurrencies. The 2021 cycle delivered some of the clearest reminders of just how fast capital can rotate once momentum takes hold. Solana moved from roughly $20 to $200 in about 50 days, a clean tenfold run. Although Solana has since broken above this peak to register a new all-time high of $293 in January 2025, this was still Solana’s most explosive rally to date. Dogecoin followed an even sharper trajectory, climbing from $0.07 to a peak of $0.73 in under a month due to speculative interest that flowed into other memecoins like Shiba Inu. Unlike Solana, Dogecoin is yet to reclaim or surpass this peak price. Avalanche went further, rallying from around $3 to $60 in less than 40 days, a twentyfold expansion that unfolded faster than most long-term projections ever anticipate. None of these moves required years of development or prolonged accumulation. A Timeframe To Watch Closely Notably, February through late April or early May has more often than not been the period where altcoin performance increases the most. If that pattern repeats, the coming weeks may matter far more than the years that came before them. At the time of writing, the notion of an altcoin season is still impeded by strong Bitcoin dominance. Much of that comes down to how the entire crypto industry ecosystem has changed massively since 2021, especially after the launch of crypto-based ETFs. That steady demand has kept capital inflows concentrated around Bitcoin and slowed the usual rotation into altcoins. Meme coins like Dogecoin and Shiba Inu have struggled to keep up in terms of price action, even with the launch of Dogecoin ETFs. Although the ETF has boosted visibility, it has not yet resulted into sustained upside. At the same time, investors have become more selective, favoring cryptocurrencies tied to clearer utility. As a result, many crypto communities have been working to create utility for their meme coins. Related Reading: XRP Showing Strength, Analyst Points To $4 Potential Nonetheless, as noted by Waterman, you only need about four to six weeks for an altcoin to wipe out three to four years of suffering. You don’t need one to two years for altcoins to make massive gains. Featured image from YouHodler, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|blockchain|crypto|crypto market|crypto news|cryptocurrency",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 44,
        "NAME": "SHIB",
        "CATEGORY": "SHIB"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57466741,
    "published": 1769385600000,
    "title": "Can’t Own SpaceX Or OpenAI? Tokenization Could Be The Next Best Thing.",
    "body": "Tokenization could unlock global access to an asset class historically reserved for pension funds, elite venture firms, family offices and sovereign wealth funds.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57467191,
    "published": 1769387413000,
    "title": "Crypto shaves $100B as Democrats threaten government shutdown",
    "body": "Senate Democrats have threatened to block a funding bill if it includes money for the Department of Homeland Security, making traders fearful of another possible US government shutdown.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 57468599,
    "published": 1769393497000,
    "title": "Gold tops $5,000 as bitcoin stalls near $87,000 in widening macro-crypto split: Asia Morning Briefing",
    "body": "Bitcoin’s onchain data points to supply overhang and weak participation, while gold’s breakout is priced by markets as a durable macro regime shift.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Gold|Bitcoin News|btc|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57469282,
    "published": 1769396362000,
    "title": "Bitcoin Price Breakdown Risk Grows As Bears Aim For $85K",
    "body": "Bitcoin price extended losses and traded below $88,500. BTC is consolidating losses and might attempt a recovery wave if it clears $88,500. Bitcoin started a minor recovery wave from the $86,000 level. The price is trading below $88,200 and the 100 hourly Simple moving average. There is a new bearish trend line forming with resistance at $88,000 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might recover if it manages to settle above $86,200 and $86,000. Bitcoin Price Dips Further Bitcoin price failed to stay above the $89,000 support and extended losses . BTC declined sharply below the $88,500 and $87,000 support levels. The bears even pushed the price below $86,500. A low was formed at $86,007, and the price is now attempting a recovery wave. There was a move above the 23.6% Fib retracement level of the downward move from the $91,099 swing high to the $86,007 low. Bitcoin is now trading below $88,500 and the 100 hourly Simple moving average . If the price remains stable above $86,500, it could attempt a fresh increase. Immediate resistance is near the $88,000 level. There is also a new bearish trend line forming with resistance at $88,000 on the hourly chart of the BTC/USD pair. The first key resistance is near the $88,500 level since it is close to the 50% Fib retracement level of the downward move from the $91,099 swing high to the $86,007 low. A close above the $88,500 resistance might send the price further higher. In the stated case, the price could rise and test the $89,200 resistance. Any more gains might send the price toward the $90,000 level. The next barrier for the bulls could be $91,000 and $91,500. More Losses In BTC? If Bitcoin fails to rise above the $88,500 resistance zone, it could start another decline. Immediate support is near the $86,700 level. The first major support is near the $86,200 level. The next support is now near the $85,500 zone. Any more losses might send the price toward the $83,500 support in the near term. The main support sits at $82,500, below which BTC struggle to recover in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $86,700, followed by $86,000. Major Resistance Levels – $88,500 and $89,200.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57469138,
    "published": 1769395178000,
    "title": "Bitcoin Starts Week on Shaky Ground Amid Geopolitical Jitters",
    "body": "Bitcoin suffered a sharp fall Sunday to start the week on shaky ground, even as it staged a minor rebound in early Asia, as global geopolitical tensions prompted a move away from risk assets and into safe havens such as gold.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57469578,
    "published": 1769397491000,
    "title": "Ethereum Price Sinks To $2,800, Raising Fresh Downside Fears",
    "body": "Ethereum price extended losses and traded below the $2,865 zone. ETH is now consolidating losses and might aim for a recovery if it clears $2,920. Ethereum remained in a bearish zone and traded below $2,950. The price is trading below $2,900 and the 100-hourly Simple Moving Average. There is a bearish trend line forming with resistance at $2,920 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase if it stays above the $2,800 zone. Ethereum Price Dips Further Ethereum price failed to remain stable above $2,950 and extended losses, like Bitcoin . ETH price declined below $2,880 and $2,865 to enter a bearish zone. The bears even pushed the price below $2,840. The price finally tested $2,800 and is currently consolidating losses. There was a minor upside above the 23.6% Fib retracement level of the downward wave from the $3,067 swing high to the $2,784 swing low. Ethereum price is now trading below $2,900 and the 100-hourly Simple Moving Average. If the bulls can protect more losses below $2,800, the price could attempt another increase. Immediate resistance is seen near the $2,920 level. There is also a bearish trend line forming with resistance at $2,920 on the hourly chart of ETH/USD. The first key resistance is near the $2,960 level or the 61.8% Fib retracement level of the downward wave from the $3,067 swing high to the $2,784 swing low. The next major resistance is near the $3,000 level. A clear move above the $3,000 resistance might send the price toward the $3,065 resistance. An upside break above the $3,065 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $3,120 resistance zone or even $3,150 in the near term. More Losses In ETH? If Ethereum fails to clear the $2,920 resistance, it could start a fresh decline. Initial support on the downside is near the $2,840 level. The first major support sits near the $2,800 zone. A clear move below the $2,800 support might push the price toward the $2,780 support. Any more losses might send the price toward the $2,720 region. The main support could be $2,650. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone. Hourly RSI – The RSI for ETH/USD is now below the 50 zone. Major Support Level – $2,800 Major Resistance Level – $2,920",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57469800,
    "published": 1769398299000,
    "title": "Gold hits record high over $5K, further diverging from Bitcoin",
    "body": "Gold reached a record over $5,000 amid trade tensions while Bitcoin fell to $86,000, marking a sharp divergence as the precious metal surged 17% in January.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57470408,
    "published": 1769401128000,
    "title": "XRP Price Bearish Continuation Confirmed As Downside Pressure Builds",
    "body": "XRP price extended losses and traded below $1.880. The price is now consolidating and might decline further if it remains below $1.920. XRP price started a fresh decline below the $1.90 zone. The price is now trading below $1.90 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance at $1.885 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move down if it stays below $1.90. XRP Price Dips Further XRP price failed to stay above $1.950 and started a fresh decline, like Bitcoin and Ethereum . The price declined below $1.920 and $1.90 to enter a short-term bearish zone. The price even spiked below $1.850. A low was formed at $1.810, and the price is now consolidating losses. There was a recovery wave above $1.850. The price cleared the 23.6% Fib retracement level of the downward move from the $1.963 swing high to the $1.810 low, but the bears remained active. The price is now trading below $1.90 and the 100-hourly Simple Moving Average. If there is a fresh upward move, the price might face resistance near the $1.8850 level and the 50% Fib retracement level of the downward move from the $1.963 swing high to the $1.810 low. There is also a key bearish trend line forming with resistance at $1.885 on the hourly chart of the XRP/USD pair. The first major resistance is near the $1.90 level. A close above $1.90 could send the price to $1.950. The next hurdle sits at $2.00. A clear move above the $2.00 resistance might send the price toward the $2.050 resistance. Any more gains might send the price toward the $2.120 resistance. The next major hurdle for the bulls might be near $2.20. Downside Break? If XRP fails to clear the $1.90 resistance zone, it could start a fresh decline. Initial support on the downside is near the $1.840 level. The next major support is near the $1.820 level. If there is a downside break and a close below the $1.820 level, the price might continue to decline toward $1.780. The next major support sits near the $1.750 zone, below which the price could continue lower toward $1.70. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now near the 50 level. Major Support Levels – $1.840 and $1.820. Major Resistance Levels – $1.8850 and $1.90.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57471154,
    "published": 1769404117000,
    "title": "Solana (SOL) Slips Further As Bears Target Deeper Support Zones",
    "body": "Solana failed to settle above $132 and extended losses. SOL price is now consolidating losses below $130 and might struggle to start a recovery wave. SOL price started a fresh decline below $132 and $130 against the US Dollar. The price is now trading below $130 and the 100-hourly simple moving average. There is a key bearish trend line forming with resistance at $126 on the hourly chart of the SOL/USD pair (data source from Kraken). The price could start a recovery wave if the bulls defend $118 or $115. Solana Price Dips Further Solana price failed to remain stable above $132 and started a fresh decline, like Bitcoin and Ethereum . SOL declined below the $130 and $126 support levels. The price gained bearish momentum below $122. A low was formed at $117, and the price is now consolidating losses. The price recovered a few points and climbed above the 23.6% Fib retracement level of the downward move from the $132 swing high to the $117 low. Solana is now trading below $130 and the 100-hourly simple moving average. On the upside, immediate resistance is near the $125 level or the 50% Fib retracement level of the downward move from the $132 swing high to the $117 low. The next major resistance is near the $126 level. There is also a key bearish trend line forming with resistance at $126 on the hourly chart of the SOL/USD pair. The main resistance could be $132. A successful close above the $132 resistance zone could set the pace for another steady increase. The next key resistance is $140. Any more gains might send the price toward the $144 level. Another Drop In SOL? If SOL fails to rise above the $126 resistance, it could continue to move down. Initial support on the downside is near the $119 zone. The first major support is near the $117 level. A break below the $117 level might send the price toward the $115 support zone. If there is a close below the $115 support, the price could decline toward the $102 support in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is losing pace in the bearish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is below the 50 level. Major Support Levels – $117 and $115. Major Resistance Levels – $126 and $132.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Technical analysis|Sol|Solana|solbtc|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57471417,
    "published": 1769404832000,
    "title": "Ether treasury ETHZilla buys plane engines amid tokenization focus",
    "body": "ETHZilla acquired two aircraft engines for $12 million, just weeks after the company said it was renewing its focus on tokenizing real-world assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 57473660,
    "published": 1769414423000,
    "title": "Japan plans framework that could permit crypto ETFs by 2028: Nikkei",
    "body": "Japan’s financial regulator is weighing rule changes that could allow crypto assets to qualify for ETFs, signaling a possible shift in retail access.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57474853,
    "published": 1769418645000,
    "title": "Matcha Meta breach tied to SwapNet exploit drains up to $16.8M",
    "body": "Matcha Meta urged users to revoke one-time approvals for SwapNet’s router contract after a smart contract vulnerability saw up to $16.8 million stolen on the Base blockchain.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 57475695,
    "published": 1769421742000,
    "title": "Metaplanet raises 2026 outlook as Bitcoin write-down tops $670M",
    "body": "Japanese Bitcoin treasury company Metaplanet has hiked its 2025 revenue and profit guidance, forecasting a near doubling of sales in 2026 as its BTC income and treasury strategy scale up.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57476096,
    "published": 1769423410000,
    "title": "Bitcoin Price Prediction: Analyst Forecasts 72.86% Crash To $30,000",
    "body": "A new Bitcoin price prediction has been put forward following a long-term technical analysis shared on the social media platform X by crypto analyst Leshka.eth. The analysis compares Bitcoin’s current structure on the weekly timeframe to the 2021 market peak, showing how price behavior is repeating an identical pattern. Based on how Bitcoin has interacted with a rising multi-year channel in previous cycles, the analysis proposes a projection as to how Bitcoin could be setting up for a powerful corrective move that sends the price back to as low as $30,000. Bitcoin Weekly Structure About To Break Technical analysis of Bitcoin’s price action on the weekly candlestick timeframe chart shows that the leading cryptocurrency has been trading with higher highs and higher lows since 2018. Interestingly, this trend of higher highs has led to repeated interaction with a rising resistance trendline that has defined every major cycle top. Related Reading: Ripple’s Next Steps: Where XRP Stops Being Trade And Starts Being Infrastrucutre As shown in the chart below, Bitcoin pushes into this upper boundary during each bull market, only to be rejected once momentum fades. These rejection points are clearly marked across multiple cycles, including the 2017 and 2021 peaks. This repeated failure is a defining feature of Bitcoin’s macro cycles of exhaustion after prolonged upside expansion. Bitcoin once again rallied into this same long-term trendline when it broke to new all-time highs in October 2025 before stalling and rolling over. Bitcoin’s price failed to hold above the trendline and has corrected by about 30% since then. The leading cryptocurrency is now trading below $90,000, and this technical outlook introduces the possibility that the current pullback is not yet complete and could extend further. Bitcoin Weekly Candlestick Chart. Source: @leshka_eth on X Bitcoin Crash Extension To $30,000? The chart also highlights the depth of prior bear market declines once Bitcoin was rejected at this long-term structure. After the 2017 cycle top, Bitcoin fell roughly 84.99% from peak to trough. Following the 2021 high, Bitcoin once again declined by about 77.47% before finding a bottom near the lower boundary of the broader rising channel. Based on the current setup, the projected downside move marked on the chart measures approximately 72.86%. Applying a drawdown of that magnitude from the recent cycle high places Bitcoin’s potential bottom around $30,000. Related Reading: Coinbase Exec Points Out The Big Difference Between Bitcoin And Central Banks Interestingly, Grok AI offered a more optimistic interpretation of Bitcoin’s near-term outlook based on responses to questions under the same technical post. According to Grok, aggregated views from sources such as CNBC, Reddit, and Forbes suggest that the probability of Bitcoin dropping into the $30,000 to $40,000 range is relatively low, estimated at around 15% to 25% by bearish cycle models. On the other hand, many analysts instead expect higher price floors, often above $50,000. Some long-term projections extend over $200,000, with names like Binance co-founder Changpeng Zhao predicting $200,000 and Tom Lee predicting $250,000 in 2026. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57476518,
    "published": 1769424755000,
    "title": "Bitcoin income windfall drives Metaplanet to revise full-year revenue forecast upward",
    "body": "The company forecasts revenue of over $100 million for FY2026, with 97.5% of projected sales coming from its Bitcoin Income Generation business.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|MetaPlanet|Bitcoin News|Bitcoin Options|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57477006,
    "published": 1769425547000,
    "title": "Japan ETFs said likely to trade by 2028 as SBI, Nomura ready products",
    "body": "The Financial Services Agency is moving to classify crypto as an eligible asset for exchange-traded funds, with potential inflows reaching $6.4 billion, according to Nikkei.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|exchange-traded funds|cryptocurrencies|Japan|Regulation|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57477184,
    "published": 1769427571000,
    "title": "Bitcoin risks fourth straight monthly loss, a streak not seen since 2018",
    "body": "A rare streak of four consecutive declines collides with January options expiry that could influence short term price action.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Deribit|Options|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57477558,
    "published": 1769428829000,
    "title": "Global Liquidity Says Bitcoin Is Extremely Undervalued – Here’s The ‘Real’ Figure",
    "body": "Crypto pundit Kyle Chassé has pointed to the rising global liquidity to prove that Bitcoin is currently undervalued. His comments come as fiat currencies like the Dollar and Yen continue to weaken amid concerns about governments’ fiscal policies. Global Liquidity Points To A Bitcoin Target Of $270,000 In an X post, Kyle Chassé shared an accompanying chart highlighting a Bitcoin target of $270,000 based on rising global liquidity. The pundit stated that the herd says that $90,000 BTC is expensive, but that the fiat ledger has reminded everyone why the digital ledger exists. This came as he revealed that the global M2 money supply has hit a record $98 trillion, driven by aggressive expansion from the U.S., the Eurozone, China, and Japan. Related Reading: Bitcoin Price Following The 2022 Fractal? Here Was The Previous Outcome Chassé further noted that year-to-date (YTD) global liquidity growth is now 6.2%, the fastest pace since the 2020 pandemic response. The pundit warned that in a system where the fiat denominator is permanently diluted, fixed-supply assets are not going up in price, but that cash is “loudly becoming worthless.” As such, he believes that BTC is a good hedge against currency debasement and potentially inflation. The pundit’s comments notably come amid a decline in the dollar, with the DXY down since the start of the year. The yen is also down YTD, as these fiat declines are coming amid a push by the governments to increase spending. Increased government spending is considered bullish for Bitcoin, given its fixed supply compared to fiat currencies, which governments continue to print. BitMEX co-founder Arthur Hayes had also recently predicted that a rise in dollar liquidity would spark higher BTC prices. However, that is yet to be the case as Bitcoin continues to trade like a risk asset and has erased its year-to-date (YTD) gains amid political tensions in the U.S. A U.S. government shutdown is also looking more likely by January 31, sparking a BTC drop below $87,000 yesterday. BTC Will Rise Once Liquidity Returns Crypto pundit Merlijn assured that Bitcoin will rise once liquidity comes back. In an X post, he urged market participants to zoom out and that the BTC pattern would become obvious. The pundit revealed that the flagship crypto has already recorded waves 1, 2, and 3 with lower highs, which signal trend fatigue. Related Reading: Here’s Why The Bitcoin, Ethereum, And Solana Prices Are Still Crashing Hard Now, Bitcoin is looking to form waves 4 and 5, which would signal a reset, absorption, and base building. Merlijn suggested that the bottom may not yet be in, but that once that happens, BTC could rally to as high as $124,000, bringing it close to its current all-time high (ATH) of $126,000. At the time of writing, the Bitcoin price is trading at around $87,700, down in the last 24 hours, according to data from CoinMarketCap. Featured image from Pngtree, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|Arthur Hayes|BitMEX|CoinMarketCap|dxy|Global M2 Money Supply|Kyle Chassé|Merlijn|Year-To-Date|YTD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57478532,
    "published": 1769432478000,
    "title": "Bitcoin Liquidations Spike to $750M Amid Weekend Slide",
    "body": "Long positions bore the brunt of a $750 million crypto liquidation spike, as prices slid toward $88K amid Japan's financial turmoil.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57479238,
    "published": 1769435069000,
    "title": "Michael Saylor’s Strategy buys 2,932 Bitcoin amid market sell-off",
    "body": "Strategy acquired $264 million of Bitcoin last week during the market pullback, lifting its holdings to more than 712,000 BTC, according to a Monday SEC filing.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57479330,
    "published": 1769435599000,
    "title": "Coreweave stock gains 9% on fresh $2 billion Nvidia investment",
    "body": "Already an investor in CoreWeave, Nvidia last September had agreed to purchase $6.3 billion of computing services from the AI infrastructure provider.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Coreweave|Nvidia|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57479305,
    "published": 1769435348000,
    "title": "Crypto users affected in massive 149M infostealer data dump",
    "body": "A researcher uncovered a 149 million-record credential dump from infostealer malware, including 420,000 Binance logins, exposing growing risks to crypto users.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57479851,
    "published": 1769437089000,
    "title": "US Bitcoin Miners Slow as Winter Storm Hits Power Grids",
    "body": "Extreme cold led miners to curb their electricity use, briefly cutting hashrate as grid stress spread across several regions.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57479819,
    "published": 1769436802000,
    "title": "UK banks block or delay 40% of crypto exchange transfers: Survey",
    "body": "A new UK Cryptoasset Business Council report found that almost all major banks are imposing blanket limits or blocks on transfers to crypto exchanges, effectively debanking crypto users.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57480756,
    "published": 1769439641000,
    "title": "Gold Hits Record $5K While Bitcoin Struggles To Keep Pace",
    "body": "Gold shone brightly today, racing to a new high while crypto took the back seat, and the gap between the two assets opened wide. Related Reading: Money Keeps Leaving: Bitcoin ETFs Shed $1.72 Billion In Just 5 Sessions On Monday, the precious metal moved past the $5,000 mark, registering a price point market sentinels had not witnessed before. Bitcoin, by contrast, failed to keep pace and traded well below its recent highs. Gold Hits Record Levels Safe-haven demand pushed gold sharply higher. Prices were up above $5k an ounce and inked roughly $5,110 at the peak. Silver, for its part, did not go unnoticed, jumping to fresh peaks near $107/ounce. Source: Gold Price Traders pointed to simmering geopolitical friction and talk of tougher trade moves led by US President Donald Trump as fuel for the rally. A weaker greenback made metals more attractive to customers overseas, and central bank buying provided steady backing. Liquidity in some corners were thin as investors rushed to shift cash into things that feel stable when risk elevates. Bitcoin Falls Behind Market numbers show Bitcoin hovering in the mid-$80,000s range, retreating from peaks seen late last year. Reports note the alpha crypto is roughly 30% below the highest level it hit reached in October 2025, leaving some holders quite jittery. Volatility was another factor. Where bullion is being sought for safety, Bitcoin is viewed more as a growth or speculative play, and that difference in investor application becomes clear when markets tighten. Some funds slashed their crypto exposure, signaling a short reroute away from high-risk gambits. Why Investors Are Shifting Analysts and traders described a simple choice: shelter or swing for gains. When headlines push worry, money flows into assets that are widely trusted across markets and governments. Metals fit that ticket. Based on market chatter, fears of a US government funding clash and fresh tariff announcements stacked pressure on stocks and added a sense of urgency to safe-haven acquisition. Options and futures trading hinted at a more cautious perpective, with volatility indexes rising and bond yields behaving in ways that made the yellow metal look more appealing by comparison. Related Reading: XRP Charts Flash Familiar Signal As Analyst Calls For $11, Then $70 What Traders Are Watching Market watchers said eyes will be glued on a few key metrics: The dollar’s path, moves by major central banks, and any sign that US politics escalates could keep metals elevated. For Bitcoin, network activity, large wallet flows, and regulatory headlines will likely set the tone. Some traders expect swings both ways. Others caution that when risk appetite is back, crypto may bounce hard, but that outcome is not a sure thing and will be dependent on a string of policy and macro moves. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btcusd|crypto|digital currency|gold|silver|tariffs|Trump|US Dollar",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]