[
  {
    "id": 58313911,
    "published": 1771738638000,
    "title": "Mentioning 'bitcoin' or crypto on AI agent OpenClaw's Discord will get you banned",
    "body": "The project's creator nearly deleted the viral AI agent after crypto scammers hijacked his accounts, launched a fake token that hit $16 million, and harassed him for weeks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Tech|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58319311,
    "published": 1771748064000,
    "title": "Bitcoin miner Bitdeer dumps entire BTC reserves, holdings drop to zero",
    "body": "Bitcoin miner Bitdeer liquidated 943 BTC from reserves and sold newly mined coins, cutting corporate holdings to zero.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58324763,
    "published": 1771747242000,
    "title": "Bitcoin OTC Balance Records Rapid Outflows — What’s Next For Price?",
    "body": "Over the past two weeks, the Bitcoin market saw an overwhelming sellers’ dominance, with no significant input from the bulls influencing the price. As the flagship cryptocurrency slipped into a downturn, investors increasingly fled the market out of fear, further pushing prices downwards. However, as the Bitcoin price seems to have found stability, an interesting on-chain revelation has also surfaced. If this change proves sustainable, it could mean something positive for the world’s leading cryptocurrency. Related Reading: Bitcoin Trades Below ETF Cost-Basis As MVRV Signals Mounting Pressure Accelerating OTC Outflows, Sign Of Possible Reversal? In their latest post on the CryptoQuant platform, CoinNiel shares an exciting hypothesis for the Bitcoin price, based on data from the Bitcoin: Total OTC Desk Balance. The analyst points out that the Bitcoin price might be at a point where a reversal is imminent. For context, the Bitcoin: Total OTC Desk Balance metric measures the total amount of Bitcoin currently being held in wallets associated with over-the-counter (OTC) trading desks. When the balance is rising, it often implies that more BTC is being moved to these OTC desks. This is also a telltale sign of increasing sell appetite among Bitcoin’s large holders. On the contrary, falling values on this metric typically indicate that Bitcoin is being withdrawn from OTC desks. By extension, it could imply that institutional demand is growing, or that large holders are no longer positioning for sales. According to the chart shared below, the Total OTC Desk Balance has taken on a sharp downtrend, meaning that there has been a significant amount of BTC sent out of the OTC market. Notably, this switch in investor behavior is happening around the same time as when Bitcoin regained its $68,000 footing. As a result, the BTC market sentiment appears to be shifting from pessimistic to slightly optimistic: instead of accumulating BTC for sale, OTC balances are instead contracting. This could be caused by increased buying from large holders or due to reduced selling appetite among Bitcoin’s market participants. In the scenario where there is increased institutional accumulation of Bitcoin, it could be a sign that the Bitcoin price would soon make a big upside move. On the other hand, reduced selling activity is also good for the Bitcoin price, as it translates as reduced selling pressure, allowing for the short-term recovery of the flagship cryptocurrency’s price. CoinNiel, therefore, states as a caveat that the true drivers behind this dynamic remain to be confirmed. As a result, investors and other market participants should be alert when engaging with the Bitcoin market. Related Reading: Saylor Makes Bold $1M Bitcoin Call — “It’s Zero Or A Million” Bitcoin Price At A Glance At press time, Bitcoin holds a value of $67,953, reflecting a 24-hour devaluation of 0.17% per CoinMarketCap data. Since the past seven days, the flagship cryptocurrency has so far lost about 2.81% of its value. Featured image from Unsplash, chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|bitcoin accumulation|BTCUSDT|Coin Niel|cryptoquant|Total OTC Desk Balance",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58324531,
    "published": 1771732843000,
    "title": "Bitcoin Sharpe Ratio Falls To -38: Why This Is Super Bullish, According To Analyst",
    "body": "Market analyst Michaël van de Poppe has noted an important on-chain development that implies a brewing market rebound. This market insight comes as Bitcoin continues to consolidate below $70,000, reporting a 2.38% loss in the past week. Related Reading: Bitcoin Whale Profit-Taking Sees 7th Surge Since 2024 — What To Expect Bitcoin Short-Term Sharpe Ratio Indicates Bear Market End In an X post on February 21, van de Poppe shares a bullish view on the Bitcoin market, referencing historical data of the Bitcoin Sharpe Ratio – an on-chain metric that measures how much excess return Bitcoin generates per unit of volatility. The Sharpe Ratio is cyclical. It’s highly positive during bull markets but turns negative during extended drawdowns. According to data shared by de Poppe, the Bitcoin Sharpe Ratio has dropped to -38.38 in the short term, which is historically recognized as a low risk accumulation zone. De Poppe explains that the Sharpe Ratio has touched similar levels in the past thrice, in early 2015, early 2019, and late 2022. Each time, this dip has preceded a major price rally. This is because a crash to these extremely low levels on the short-term chart suggests Bitcoin is underperforming in terms of risk-to-reward ratio, presenting the ideal point for a market entry. Over the past five months, Bitcoin has experienced a steep bear market, resulting in a total decline of 45.86% compared to its all-time high in October. In February alone, BTC prices have fallen by over 23% as prices dipped as low as $60,000 at the beginning of the month. De Poppe’s analysis shows that this recent crash has also negatively altered the BTC to Gold ratio, creating a potentially market opportunity due to the imbalance between both assets. Going by the historical price reaction to such conditions, the market expert explains that the Sharpe Ratio has highlighted this opportunity, which he described as super bullish. Related Reading: XRP Tipped As Central Bank Bridge Asset — Bigger Than Bitcoin? Bitcoin Market Overview At the time of writing, Bitcoin trades at $68,299, representing a 0.72% gain in the past day. However, the daily trading volume is down by 50.04% and is valued at $19.15 billion. Notably, market analyst KillaXBT expects Bitcoin to retrace to around $67,800 on Monday in an effort to fill the CME gap created over the weekend. The premier cryptocurrency has shown a solid record on this front, with 96% of the CME gaps observed since 2022 getting filled within a maximum of two weeks. Featured image from Unsplash, chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|bitcoin sharpe ratio|btcusd|BTCUSDT|Michael van de Poppe|Super bullish prediction",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58325006,
    "published": 1771758005000,
    "title": "AI agent OpenClaw confirms ban on Bitcoin, crypto discussions in Discord",
    "body": "OpenClaw creator Peter Steinberger confirmed that users can be removed for mentioning Bitcoin and crypto on Discord.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58328818,
    "published": 1771765200000,
    "title": "SportFi’s next act: onchain markets built around match-day results",
    "body": "An area of blockchain-based finance focused on increasing fans' engagement with sports teams, SportFi uses tokens to grant access to privileges such as limited voting rights and exclusive rewards.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Sports|Fan Tokens|Soccer|Chiliz|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 58328755,
    "published": 1771764974000,
    "title": "Crypto capital rotates from tokens to stocks as new launches struggle: DWF",
    "body": "More than 80% of 2025 token launches trade below listing price while IPO funding and M&A in the crypto sector surge, suggesting that investors prefer equity exposure.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58334668,
    "published": 1771776000000,
    "title": "To freeze or not to freeze: Satoshi and the $440 billion in bitcoin threatened by quantum computing",
    "body": "As quantum computing inches closer to reality, nearly 7 million bitcoin, including Satoshi Nakamoto’s 1 million coins, are potentially at risk.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Satoshi Nakamoto|Bitcoin News|btc|quantum computing|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58334239,
    "published": 1771775123000,
    "title": "Bitcoin see-saws around $68,000, DOGE, ETH slide as tariff uncertainty weighs on risk assets",
    "body": "President Donald Trump raised the global tariff rate to 15% despite a Supreme Court ruling against earlier emergency trade measures, keeping pressure on China and other partners.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58334836,
    "published": 1771776222000,
    "title": "Blockchain Apps Have Failed to Win Over the Masses, Ethereum Builders Admit",
    "body": "Ethereum builders at ETH Denver said that the crypto infrastructure has been laid—but not products people actually want to use.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58334721,
    "published": 1771776042000,
    "title": "Instant XRP Rewards: Japan-Based Financial Group Rolls Out Tokenized Bonds",
    "body": "SBI Holdings has quietly rolled out a new on-chain bond designed to give ordinary investors direct exposure to XRP while keeping the product inside Japan’s regulated market. Related Reading: XRP Tipped As Central Bank Bridge Asset — Bigger Than Bitcoin? Reports say the issue by the Japan-headquartered financial group totals 10 billion yen and is being recorded, issued and managed on a blockchain system rather than through the usual securities infrastructure. SBI Starts A New Kind Of Bond Based on reports, the bonds — nicknamed the “SBI Start Bonds” in some coverage — are being tokenized on a platform called ibet for Fin, a system built by BoosTry to register and manage securities onchain. Investors who buy into the offering receive XRP roughly at the time their purchase clears. The firm has also scheduled additional XRP benefits to be paid on interest dates stretching through 2029. How The Trading Will Work Trading of these security tokens is set to occur on a proprietary system operated by Osaka Digital Exchange, with secondary market activity expected to begin on March 25, 2026. Reports indicate the bonds carry a modest yield range, with some outlets citing an indicative coupon band in the low single digits — a feature that blends a fixed-income payout with crypto rewards. Japan’s SBI Holdings has launched a ¥10 billion ($64.5M) on-chain bond issuance that rewards investors with $XRP. https://t.co/X9U0nW3sd2 pic.twitter.com/b7hwHJTiEG — 𝗕𝗮𝗻𝗸XRP (@BankXRP) February 21, 2026 Who Can Get The XRP Eligibility rules are strict. Reports note that holders must be domestic residents and must hold an account with SBI VC Trade to collect the XRP benefit; there’s a procedural deadline for completing receipt steps by mid-May. In short, this is not an open global giveaway — the offer is aimed at onshore retail investors inside Japan and tied to local account requirements. Market Reaction And Possible Effects Based on reports and market commentary, the structure could nudge demand for XRP because the issuer needs to supply the token for distribution and future payouts. Related Reading: Bitcoin Market Bleeds $1 Trillion, Saylor Signals Strongest Crypto Conviction Yet Some market watchers point out that while the initial sum — about $64.5 million by rough conversion — is limited against the size of global crypto markets, the product matters more for what it represents: a mainstream financial group packaging a digital asset into a regulated bond product. That may make other Japanese firms think about similar moves. Featured image from Trade Brains, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|crypto|finance|Japan bank|SBI Group|xrp",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58336888,
    "published": 1771779910000,
    "title": "Bitcoin price may rebound to $85K as CME 'smart money' slashes shorts",
    "body": "Futures traders slashed bearish Bitcoin bets last month, a shift that preceded a 70% rally in 2025 and a 190% increase in the BTC price in 2023.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58338756,
    "published": 1771783200000,
    "title": "How decentralized AI is leveling the playing field",
    "body": "Forget OpenAI and Google. New decentralized networks are putting an end to Big Tech's monopoly.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Opinion|decentralized AI|Opinion",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58338807,
    "published": 1771783239000,
    "title": "Bitcoin Retail Investors To Resume Buying? Rising TRC-20 USDT Reserves Suggest",
    "body": "The crypto market has been showing signs of recovery, with the Bitcoin price trying to reclaim the psychological $70,000 over the past few days. Interestingly, the latest on-chain data suggests that the crypto market might just have the required liquidity to kickstart a resurgence. Stablecoin Inflows Surge During Key Support Retest In a recent QuickTake post on the CryptoQuant platform, market analyst CryptoOnchain revealed a dramatic increase in TRC-20 USDT balances on Binance, the largest cryptocurrency exchange by trading volume. Quoting data from CryptoQuant’s data, the on-chain analyst revealed that USDT reserves climbed from approximately $385 million on December 24 to about $5.2 billion as of February 21. What’s more interesting is, this roughly $4.8 billion spike in the stablecoin reserve on Binance occurred all under a month. Related Reading: Bitcoin Options Update: Market Panic Fades But Traders Remain Defensive – Details The crypto pundit highlighted that this significant rise in the TRC-20 UDST reserves on Binance actually coincides with the Bitcoin and Ethereum price approaching key support levels. This is typically a sign that demand is rising and positioning activity is ongoing, both of which often lead to the absorption of selling pressure. Typically, a significant increase in stablecoin accumulation on exchanges — especially during periods of price weakness — signals that liquidity is being rotated, and not completely exiting the market. According to CryptoOnchain, this means that more capital is being positioned for potential reentry into the Bitcoin or Ethereum market (among other assets). TRC-20 Usage Points To Increasing Retail Participation The on-chain analyst further highlighted that the adoption of TRC-20 USDT is often characteristic of a certain investor class, known as the retail participants. It is also widely known that large institutions — which do not typically chase cost-efficient transactions — often use the ERC20 network. Hence, CryptoOnchain concluded that “the increase in TRC-20 reserves may indicate stronger retail engagement during the correction.” Related Reading: Bitcoin Trades Below ETF Cost-Basis As MVRV Signals Mounting Pressure While stablecoin reserves indicate that market participants may be preparing for a bullish reversal of the Bitcoin price, it is worth noting that an immediate rebound is not guaranteed. This is because elevated reserves only reflect the presence of inert demand (known as dry powder), rather than real demand. Nonetheless, if the present market conditions should see stability in the near-term, this “dry powder” that waits on the sidelines could quickly become fuel to drive prices to the upside. Moreover, the Bitcoin apparent demand metric recently flipped positive, suggesting that a reversal might be imminent. As of this writing, Bitcoin is valued at around $67,971, reflecting no significant movement in the past 24 hours. Featured image from iStock, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|crypto|ethereum|ethereum price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58344202,
    "published": 1771792712000,
    "title": "Crypto infrastructure company BitGo named issuer for FYUSD stablecoin",
    "body": "The GENIUS Act-compliant stablecoin is geared toward institutional investors in Asia features a programmable layer for agentic AI commerce.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 58346391,
    "published": 1771796574000,
    "title": "SEC allows broker-dealers to take 2% 'haircut' on stablecoins",
    "body": "Staff said the US regulator would \"not object\" to broker-dealers counting stablecoin holdings toward their net capital requirements.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 58354027,
    "published": 1771810245000,
    "title": "Vitalik Buterin floats TX 'simulations' to enhance crypto security",
    "body": "Crypto users would specify what onchain action they want and then click “OK” or “Cancel” after seeing a transaction simulation of that action.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58354501,
    "published": 1771811351000,
    "title": "Bitcoin slides 5%,  tumbling below $65,000 as whale selling grows and recent buyers lock in losses",
    "body": "On-chain data from Glassnode and CryptoQuant shows large holders dominating exchange inflows while short-term investors continue to sell at a loss, pointing to a fragile base-building phase.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|btc crash|Bitcoin Price|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]