[
  {
    "id": 57867750,
    "published": 1770642537000,
    "title": "OpenClaw AI Faces Poisoned Plugins Crisis as SUBBD Token’s Presale Over-Performs",
    "body": "What to Know: The OpenClaw ‘poisoned plugin’ incident reveals critical security flaws in Web2 AI agent architectures. Investors are pivoting toward decentralized AI solutions that offer verifiable security and immutable smart contracts. SUBBD Token uses Web3 rails to eliminate high platform fees and secure AI tools for content creators. The project has raised over $1.47 million, signaling high demand for platforms merging AI utility with crypto incentives. The discovery of ‘poisoned plugins’ inside the OpenClaw AI ecosystem has rattled developers. It highlights a critical vulnerability in how autonomous agents handle third-party software. Security analysts identified a vector where malicious code, injected via compromised plugins, allows bad actors to hijack an AI agent’s execution flow. Why does that matter? It exposes a fatal flaw in the current Web2 AI stack: the reliance on blind trust within centralized marketplaces. When an AI agent’s hands are compromised, the agent itself becomes a liability. This isn’t just a technical glitch; it’s a structural warning sign for the $85B automation industry. As developers scramble to patch these holes, the market is already looking elsewhere, specifically toward platforms that mitigate these risks through decentralized infrastructure. Smart money appears to be hedging against this fragility. We’re seeing a rotation into Web3 projects that merge AI utility with blockchain transparency. If centralized vectors are the weak point, decentralized protocols offer the antidote through verifiable smart contracts. This flight to quality is visible in the crypto-AI sector, where specific presales are bucking the broader consolidation trend. One standout, SUBBD Token ($SUBBD) , has started capturing significant liquidity. It suggests investors are actively seeking platforms that return control and security to the users. Buy $SUBBD here. Decentralized Architecture Solves the Trust Deficit While OpenClaw battles supply chain vulnerabilities, SUBBD Token uses Ethereum-based smart contracts to build a tougher environment for the content economy. The project tackles the ‘black box’ problem of Web2 AI by integrating proprietary models, capable of chatbots, voice cloning, and object recognition, directly into a transparent Web3 framework. This setup ensures that revenue-generating tools aren’t subject to the arbitrary failures or malicious injections plaguing purely Web2 alternatives. The pitch extends beyond security; it targets economic inefficiency. Centralized platforms often extract up to 70% of creator earnings in fees. SUBBD Token disrupts this by using a decentralized payment rail that cuts friction. By offering features like AI Personal Assistants and token-gated content, the project moves beyond the speculative nature of many meme coins. It provides tangible utility. The data suggests the market is hungry for this specific intersection of AI utility and financial sovereignty. $SUBBD is available here. Presale Metrics Signal Shift in Investor Sentiment The financial performance of the SUBBD Token presale signals a decoupling from broader market stagnation. According to official data, the project has raised $1.4M. That figure points to strong confidence in the ‘AI + Crypto’ narrative. With tokens priced at $0.057495, early entrants are positioning themselves before the public rollout. This capital inflow is notable given the current risk-off sentiment in macro markets, suggesting that utility-driven AI projects are operating with a distinct liquidity premium. Staking mechanics help stabilize the token’s velocity. The project offers a fixed 20% APY for the first year, alongside perks like XP multipliers and access to exclusive ‘HoneyHive’ content. For investors, the math is simple: while legacy AI tools struggle with security patches, SUBBD Token offers a clean slate with integrated monetization. The presale’s over-performance likely stems from the realization that the future of content creation requires Web3 security combined with generative AI power. Visit the $SUBBD presale. Disclaimer: This article is for informational purposes only and does not constitute financial advice. Cryptocurrency investments, particularly in presale stages, carry high risks, including the potential for total loss of capital. Always conduct independent research before investing.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57868544,
    "published": 1770645044000,
    "title": "Saylor Buys $90M-Worth of Bitcoin Amidst Full Market Crash, While $HYPER Breaks Records",
    "body": "What to Know: MicroStrategy purchased an additional $90M in Bitcoin during the market crash, signaling strong institutional conviction despite bearish retail sentiment. Bitcoin Hyper utilizes the Solana Virtual Machine (SVM) to bring high-speed smart contracts and sub-second finality to the Bitcoin network. Despite the broader market downturn, Bitcoin Hyper has raised over $31.3M, with verified whale wallets accumulating significant positions. The divergence between falling asset prices and rising infrastructure investment suggests the market is prioritizing utility and scalability solutions. The crypto market is acting schizophrenic right now. On one side of the screen, retail traders are capitulating, panic-selling into a sea of red candles that define the latest crash. On the other? MicroStrategy’s Michael Saylor is doing exactly what he does best: buying the fear. The enterprise analytics firm just added another $90M worth of Bitcoin to its treasury, happily sweeping up coins at depressed prices. The $90 million price tag isn’t the headline here, that’s pocket change for MicroStrategy these days. It’s the timing. Institutional accumulation during high-volatility capitulation events historically signals a localized bottom. While the crowd sees a crash, smart money sees a discount. Saylor’s continued aggression suggests he believes short-term macro headwinds, whether regulatory noise or rate adjustments, are irrelevant compared to Bitcoin’s long-term settlement thesis. But the most interesting data isn’t coming from the legacy Bitcoin chart. It’s in the infrastructure layer being built on top of it. While the mainnet struggles with price action, liquidity is quietly rotating into high-performance Layer 2 solutions. The disconnect between price and development is widening. Investors are looking past the ‘digital gold’ narrative and hunting for actual utility. This capital shift explains why, even as the market bleeds, Bitcoin Hyper ($HYPER) is posting record-breaking fundraising numbers. Money isn’t leaving crypto; it’s just moving to where the tech is evolving. Buy $HYPER here. Bitcoin Hyper Integrates SVM To Solve Mainnet Congestion Bitcoin has always had a ‘trilemma’ problem: it’s the most secure network in existence, but it’s painfully slow. Previous attempts to scale it relied on sluggish sidechains or the complexity of Lightning. Bitcoin Hyper ($HYPER) is flipping the script by integrating the Solana Virtual Machine (SVM) directly as a Layer 2 solution. Why does that architecture matter? By using the SVM for execution while relying on Bitcoin L1 for settlement, the project aims for transaction speeds theoretically faster than Solana itself, all anchored to Bitcoin’s security. For developers, this opens the door to writing smart contracts in Rust. It enables high-frequency trading, complex DeFi protocols, and gaming dApps that were previously impossible on the Bitcoin network. Traders seem interested in this ‘best of both worlds’ approach. The protocol features a Decentralized Canonical Bridge for seamless $BTC transfers and a modular structure where a sequencer handles execution. This isn’t just about faster payments; it represents a shift toward making Bitcoin a programmable asset class (finally). Learn more about Bitcoin Hyper here. Presale Momentum Builds As Whale Wallets Accumulate $1M While the broader market struggles, capital inflows into the Bitcoin Hyper presale are decoupling from the general sentiment. According to the official presale page, the project has raised $31.3M a figure that stands in stark contrast to the low volume seen in legacy altcoins this week. You can actually see the smart money trail on-chain. Sophisticated actors are positioning themselves early, likely anticipating that the ‘Bitcoin DeFi’ narrative will outperform in the next cycle. Specifically, Etherscan records show that two whale wallets have accumulated $1M in recent transactions. The largest individual purchase, $500K , occurred on Jan 15, 2026, signaling high-conviction entry at these levels. With tokens currently priced at $0.0136753, the risk-reward ratio seems to be pulling volume that would otherwise sit in stablecoins. The project also incentivizes holding through a staking model that offers high APY immediately after TGE, with a modest 7-day vesting period for presale stakers. This structure is designed to mitigate the post-launch sell pressure that plagues many infrastructure launches. For investors watching MicroStrategy buy the L1 dip, the logical hedge seems to be allocating to the L2 infrastructure that makes that L1 usable. Visit the $HYPER presale now. Disclaimer: This article is for informational purposes only and does not constitute financial advice. Cryptocurrency investments, particularly presales and new Layer 2 protocols, carry significant risk and volatility. Always perform your own due diligence.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57868772,
    "published": 1770645773000,
    "title": "Bitcoin Miner Cango Sells 4,445 $BTC To Cover Collateralized Loan as $SUBBD Makes Waves",
    "body": "What to Know: Cango’s sale of 4,445 $BTC to cover loans underscores the post-halving profitability squeeze facing hardware-dependent mining operations. As infrastructure costs rise for legacy PoW miners, investment flows are shifting toward high-margin software protocols in the AI and Web3 sectors. SUBBD Token uses AI and Ethereum smart contracts to disrupt the $85B creator economy, offering a capital-efficient alternative to traditional mining investments. With over $1.4M raised, the project demonstrates strong market demand for decentralized solutions that lower fees and empower content creators. Cango just dumped 4,445 Bitcoin. That massive divestment, roughly $300M hitting the order books , marks a significant liquidity event in a market already struggling with post-halving economics. It highlights the crushing pressure on Proof-of-Work (PoW) entities to service their collateralized debt obligations. When a miner starts liquidating the family silver (treasury assets) rather than relying on freshly minted coins, the strategy shifts from accumulation to survival, a capitulation that often precedes a broader market rotation. Why does this matter? Because miners are usually the ultimate hodlers. When they sell to cover loans, it signals that operational costs and debt servicing have outpaced the immediate profitability of mining rewards. This structural squeeze is forcing smart money to look elsewhere for yield. While legacy infrastructure providers fight over thin margins and high overhead, capital is quietly rotating into capital-efficient, software-driven sectors. The intersection of AI and the $85B creator economy is emerging as a serious alternative, with projects like SUBBD Token ($SUBBD) catching a bid as miners deleverage. Read more about $SUBBD here. De-Leveraging The Blockchain: Why Capital Efficiency Shifts To AI People often view ‘miner capitulation’ solely through a bearish lens, but it frequently acts as a clearing event that redistributes liquidity. As Cango and similar entities sell BTC to satisfy creditors, the market absorbs the supply shock, often leading to consolidation. But look closer at the second-order effect: investors are becoming wary of the heavy infrastructure risks associated with pure-play mining stocks. They’re seeking exposure to Web3 protocols that offer immediate utility without the massive electricity bills. That’s where the creator economy creates a compelling divergence. Unlike Bitcoin mining—which competes for diminishing block rewards, the content creation industry is expanding. SUBBD Token ($SUBBD) addresses the sector’s most glaring inefficiency: the ‘middleman tax.’ Traditional Web2 platforms often snatch up to 70% of creator earnings in fees. By using Ethereum-based architecture, $SUBBD cuts out these intermediaries, letting creators keep the vast majority of their revenue. The platform distinguishes itself by integrating proprietary AI models directly into the workflow. Features like the AI Personal Assistant for automated interactions and AI Voice Cloning tools allow creators to scale their output without increasing their workload. It’s a sharp contrast to the capital-intensive nature of the Cango sell-off. While miners burn cash to solve hashes, SUBBD Token uses AI to solve the scalability issues of the creator economy. Buy $SUBBD here. SUBBD Token Integrates Web3 Tools For Creator Sovereignty Beyond the macro shift from hardware to software, the specific mechanics of the SUBBD Token ecosystem are turning heads. The project builds a circular economy where the token isn’t just a speculative asset, it’s fuel. Users use $SUBBD for subscriptions, pay-per-view (PPV) access, and tipping, while creators access advanced AI tools and token-gated content features. The market’s appetite for this utility is showing up in the order book. According to live data, the presale has already raised $1.4M so far, a solid figure for a specialized utility token. The current entry price of $0.0574925 offers an accessible price point relative to the project’s roadmap, which targets the massive disruption of arbitrary platform bans and fragmented payment systems. Plus, the protocol incentivizes long-term holding through a structured staking model, something notably absent from holding raw Bitcoin. Investors can lock tokens to earn a fixed 20% APY during the first year. That’s a predictable yield that contrasts with the volatility of mining stocks. This staking mechanism, combined with XP multipliers for platform engagement, aligns the incentives of creators, fans, and investors. As the platform rolls out features like AI-exclusive content and decentralized governance, the utility demand for $SUBBD is positioned to grow independently of Bitcoin’s price action. Buy $SUBBD here. Disclaimer: This article is for informational purposes only and does not constitute financial advice. Cryptocurrencies are high-risk assets, and presales carry inherent volatility. Always conduct your own due diligence before investing.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57869150,
    "published": 1770647106000,
    "title": "Why Maxi Doge is the 2026 Superstar: Analyzing the Shift to High-Leverage Culture",
    "body": "What to Know: The 2026 market cycle is favoring ‘culture coins’ that combine meme appeal with active utility, moving beyond passive holding models. Maxi Doge has seen significant smart money inflows, including a notable $314K single-wallet transaction recorded in October 2025. The project differentiates itself with Holder-Only Trading Competitions and a dynamic staking pool that rewards long-term conviction. With over $4.5M raised in its presale, the project has the liquidity runway to execute its ‘Leverage King’ marketing strategy. Crypto markets love a narrative shift. But spotting one before it hits the mainstream? That’s where the real alpha lives. As we pivot from the accumulation phases of late 2024 and early 2025, the focus for 2026 is moving squarely toward high-beta assets that combine cultural dominance with financial gamification. The ‘Meme Supercycle’ isn’t just a fringe theory anymore, it’s market reality. Retail capital no longer treats meme tokens as mere jokes, but as leveraged bets on specific communities and internet subcultures. That changes the liquidity game. In previous cycles, we watched capital rotate slowly, Bitcoin to Ethereum to large caps. Not this time. Current on-chain data suggests a faster, much more aggressive rotation directly into assets with a psychological ‘hook.’ The winners of 2026 won’t just be cute animals; they’ll be projects that embody the aggression and conviction of the bull market itself. Enter Maxi Doge ($MAXI) . It’s an ERC-20 token aiming for the sweet spot between meme culture and high-leverage trading. Unlike the passive “hold and hope” strategy of legacy coins, Maxi Doge positions itself as the ‘Leverage King.’ It leans heavily into the gym-bro and trading-bro aesthetics dominating Crypto Twitter right now. With a chunky presale volume already in the books, the project is positioning itself to outperform the original DOGE by leveraging a community obsessed with ‘gains’, both physical and financial. $MAXI is available here. Gamifying the Grind: Beyond the Standard Meme Model The biggest risk for memes in 2026? Attention decay. To fix that, Maxi Doge built its utility around action rather than passive holding. The project’s ethos, ‘Never skip leg-day, never skip a pump’, comes alive through Holder-Only Trading Competitions and presale. By incentivizing users to battle for leaderboard rewards, the project creates a retention loop most static tokens lack. Think of it as ‘Proof of Workout’ applied to your portfolio, a sticky ecosystem for traders who identify with the ‘1000x leverage’ mentality. Plus, the project attempts to build a floor for long-term holders via staking. The protocol features a dynamic APY driven by a daily automatic smart contract distribution from a 5% staking allocation pool. This mechanism is designed to lock up supply for up to one year, reducing sell pressure when the market gets shaky. In a market saturated with low-effort derivatives, a project linking its tokenomics directly to the psychological ‘grind’ of trading is refreshing. It gamifies the very act of being a bull. Then there’s the ‘Maxi Fund’ treasury. It uses capital for liquidity provisioning and strategic partnerships, including planned integrations with futures platforms. This moves the token beyond simple speculation and into utility territory for the high-frequency trading crowd. Check out the Maxi Doge presale. Whale Accumulation Signals Institutional Interest Retail sentiment drives noise; whale activity drives price discovery. A look at capital flows into the Maxi Doge presale shows a divergence from typical retail-only launches. According to the official presale page, the project has raised $4.58M, with tokens currently priced at $0.0002803. That level of capitalization prior to a Tier-1 exchange listing implies high conviction from early entrants positioning for the 2026 expansion. But the smart money movement is the real story. Etherscan data reveals 2 high-net-worth wallets accumulated $628K in recent transactions. The largest individual purchase, a massive $314K , occurred on Oct 11, 2025. Large buy orders executed this deep into a presale often indicate “insider” confidence or sophisticated syndicates positioning for a supply shock. A $4.5M+ raise combined with verified six-figure whale entries paints a picture of a project that has graduated from ‘experiment’ to serious contender. If Maxi Doge can sustain this momentum through its roadmap execution, it has a genuine shot at capturing the liquidity overflowing from Ethereum’s ecosystem. Buy $MAXI here. Disclaimer: This article is for informational purposes only and does not constitute financial advice. Cryptocurrency investments, particularly in the meme sector, carry high risk and volatility. Always conduct your own due diligence (DYOR) and consult with a financial advisor before making investment decisions.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57869005,
    "published": 1770646508000,
    "title": "CoinDesk 20 performance update: Bitcoin Cash (BCH) is only gainer, up 3.4%",
    "body": "Aptos (APT) declined 9.4% and NEAR Protocol (NEAR) fell 8%, leading index lower.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "CoinDesk Indices|CoinDesk Indices|CoinDesk 20|charts|Prices|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 12,
        "NAME": "BCH",
        "CATEGORY": "BCH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 70,
        "NAME": "APT",
        "CATEGORY": "APT"
      },
      {
        "TYPE": "122",
        "ID": 89,
        "NAME": "NEAR",
        "CATEGORY": "NEAR"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57869289,
    "published": 1770647440000,
    "title": "Ethereum Price Set To Break Out Against Bitcoin, But How High Can It Go?",
    "body": "The cryptocurrency industry went under intense pressure last week, with Bitcoin and Ethereum leading the crash and multiple cryptocurrencies hitting new multi-month lows. The crash was more pronounced with Bitcoin, though, and the imbalance in selling pressure is quietly shifting the relationship between the two assets. The interesting imbalance is relayed in Ethereum’s performance relative to Bitcoin. A technical analysis of the ETH/BTC ratio shared on the social media platform X by Jonathan Carter indicates that Ethereum may be approaching a critical breakout point against Bitcoin, following an extended period of compression on the 2-week candlestick timeframe chart. Long-Term Triangle On The Verge Of Break According to technical analysis of the ETH/BTC 2-week chart, Ethereum is nearing an important point against Bitcoin after years of consolidation beneath a descending trendline. This long-running pattern originates from a major peak in relative valuation in July 2017, when 1 ETH was worth 0.154 BTC in Bitcoin terms, and has since formed a series of lower highs to form a falling resistance trendline. The lower boundary of this pattern is a long-tested support zone around 0.02 that has repeatedly drawn buying interest for Ethereum in relation to Bitcoin. Related Reading: Ethereum Price Is Not Going To Keep Falling Forever, Analyst Says At the time of writing, the ETH/BTC ratio is trading around 0.030. However, the most recent 2-week candlestick has flipped green, and this development is important to the bullish outlook of Ethereum’s performance against Bitcoin. The bullish projection is based on a full playout of the green candlestick with a push towards the descending triangle’s resistance trendline. If the pair can convincingly break above the descending triangle’s upper trend boundary with sustained momentum, then this would allow Ethereum to enter a phase of sustained outperformance against Bitcoin. How High Could ETH/BTC Go If A Breakout Happens? Crypto analyst Jonathan Carter outlined a series of potential upside targets should the ETH/BTC pair break free from its downward trend. The first target is around 0.040 BTC, which would represent a clear departure from the compressed range seen across recent months. If momentum continues, higher potential objectives include 0.060, 0.085, 0.105, 0.124, and all the way up to the 2017 peak of 0.154. Related Reading: Here’s Why The Bitcoin And Ethereum Prices Are Still Trading Sideways Translating these ratio-based targets into absolute price levels is less straightforward, as the projections are based on Ethereum’s performance relative to Bitcoin and not standalone price moves. Such a performance can happen in two major ways: either Ethereum receives more inflows than Bitcoin, or Bitcoin could crash more than Ethereum during a market-wide correction. The former scenario would most likely translate into a sustained rotation into Ethereum and the wider altcoin market, setting the stage for an altcoin season. Nonetheless, both scenarios will see the otherwise strong Bitcoin dominance dropping massively. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|altcoin|Altcoin Season|bitcoin|bitcoin dominance|btc|Descending Trendline|ETH|ETH news|eth price|ETH/BTC|ethereum|ethereum news|ethereum price|ethusd|ETHUSDT|Jonathan Carter",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57869287,
    "published": 1770647436000,
    "title": "Signature Phishing Up 200% As January Losses Pass $6M",
    "body": "Nearly 4,700 victims lost $6.27 million in January as scammers exploit cheaper Ethereum fees and familiar wallet habits",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 57869898,
    "published": 1770649000000,
    "title": "Crypto Crashes Rattle Venture Capitalists After $19 Billion Haul",
    "body": "Crypto venture capital funds are confronting an identity crisis.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57870903,
    "published": 1770652848000,
    "title": "XRP Ledger Clears The Threshold For Institutional Settlement – Here’s How",
    "body": "The XRP Ledger has quietly crossed a critical milestone. What began as an experimental blockchain designed to challenge the inefficiencies of cross-border payments is now maturing into full-scale financial infrastructure. With the final constraints that once limited bank participation now removed, XRPL is no longer something institutions test; it’s something they can deploy. How XRPL Addressed Compliance And Operational Gaps Ripple has removed a key barrier that previously prevented banks from settling directly on the XRP Ledger, a change that could enable billions of inflows into the Ledger. Crypto analyst Diana has revealed that for years, a recurring question has surrounded Ripple’s network of over 300 bank partnerships: If adoption was so broad, why isn’t there massive on-chain volume on XRPL? Related Reading: Is XRP Poised To Replace SWIFT As Global Payments Infrastructure? As explained by Ripple Chief Technology Officer (CTO) and board member David Schwartz (JoelKatz), the reason was not technical performance; it was compliance and counterparty certainty. Institutions were unable to guarantee who was providing liquidity or whether counterparties met regulatory requirements when settling on-chain. That constraint is now being addressed. Permissioned Domains are live on XRPL, allowing institutions to operate within compliant, access-controlled environments while still benefiting from on-chain settlement. However, a Permissioned DEX, which is scheduled to go live on February 18, will enable institution-only liquidity pools designed specifically for regulated participants. A big week is ahead for Ripple XRP, with more token utility anticipated. BSCN on the X platform reported that the week ahead could be an important one for the Ripple community, with new updates focused on expanding the real-world utility of XRP set to be introduced. RippleXDev has announced that the XRP community day will take place on February 11, featuring a series of live social media events. One of the key discussion points will be how upcoming roadmap features translate directly into XRP utility. RippleXDev indicated that the session will explore several foundational pillars designed to drive adoption, including programmability through smart extensions and contracts, zero-knowledge proofs (ZKPs) for privacy and stability, and compliance building blocks such as permissioned domains and the permissioned DEX. Why Extreme Conditions Often Precede Relief Rallies XRP price has entered the most oversold condition in its history. According to Skipper, analysts are stating that every time the altcoin reached comparable extremes, the price eventually reversed to the upside. Based on this historical pattern, XRP may be approaching a significant rebound, with a move back above the $2 level now back in focus. Related Reading: XRP Price Bearish Continuation Confirmed As Downside Pressure Builds At the same time, the evolution of the classic DEX is accelerating. DEX Pro would bring together the critical market data into a single, streamlined interface, bridging the gap between decentralized execution and professional-grade data analysis and giving traders the tools to make smarter, faster, and more informed decisions. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|BSCN|David Schwartz|DEX|Diana|Ripple|RippleXDev|Skipper|xrp|XRP Ledger|xrp news|XRP Price|XRPL|XRPUSD|xrpusdt|ZKPs",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57871147,
    "published": 1770653656000,
    "title": "MegaETH debuts mainnet as Ethereum scaling debate heats up",
    "body": "The project, which had pitched itself as a layer-2 “real-time blockchain\" targeting more than 100,000 transactions per second, would make onchain interactions feel closer to traditional web apps than today’s crypto networks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Ethereum News|Layer2 scaling solution|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57872317,
    "published": 1770657078000,
    "title": "Investigators Circle as Bithumb Reveals Compensation Plan for $43 Billion Bitcoin Error",
    "body": "South Korean regulators are investigating Bithumb after its accidental $43 billion Bitcoin handout to customers last week.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57872741,
    "published": 1770658237000,
    "title": "Popular Tesla Investor Shares The Major Problem After Bitcoin Fell Below $70,000",
    "body": "Ross Gerber, a renowned Tesla investor and Co-founder of Gerber Kawasaki Wealth and Investment Management, has identified the primary reason Bitcoin (BTC) fell below $70,000. The CEO has attributed the decline in the leading cryptocurrency and the broader market to the rise of scam tokens and shit coins in the space. The Truth Behind Bitcoin’s Crash Below $70,000 The Bitcoin price dropped below $70,000 last week, sparking fear and uncertainty across the market. As the world’s largest cryptocurrency crashed, other major digital assets followed, fueling the broader market decline. In his X post on February 7, Gerber has shared insights into the factors driving Bitcoin’s recent downturn. Related Reading: 5 Red Months In A Row: What’s Going On With Bitcoin And The Crypto Market? According to him, the market is currently being undermined by a surge in scam tokens, citing meme-based cryptocurrencies such as the TRUMP coin. He explained that bad actors are increasingly entering the space, launching low-quality or fake tokens with little to no utility or real value while generating hype and FOMO. When investors buy these tokens, they often suffer losses from rug pulls, sudden crashes, or other fraudulent schemes. Based on Gerber’s report, scam tokens have not only eroded crypto investors’ confidence and discouraged market participation, but have also diverted capital that could have flowed into legitimate cryptocurrencies like Bitcoin. The Gerber Kawasaki CEO also highlighted that another key factor behind Bitcoin’s continued decline is the absence of new market catalysts. He suggested that the market is largely driven by the same underlying factors, with only minor fluctuations from short-term moves by bag holders. In 2024, Bitcoin experienced sharp gains following the launch of Spot Bitcoin ETFs. Additional momentum came from catalysts like an increase in institutional demand. Recently, this demand has been declining. Spot Bitcoin ETFs continue to record massive outflows, macroeconomic conditions remain uncertain, and Bitcoin continues to face strong sell-offs and volatility. Gerber also agrees that Bitcoin’s current downturn is exacerbated by selling pressure from leveraged traders, whose forced liquidations trigger a chain reaction that pushes prices lower. Related Reading: Here’s Why The Bitcoin, Ethereum, And Dogecoin Prices Are Still Crashing Today Despite the negative trend, Gerber frames the situation as an opportunity for long-term investors. He noted that the decline in Bitcoin’s price allows seasoned players to buy the cryptocurrency at discounted “panic-level” prices, positioning these investors for potential gains once market conditions stabilize. Analysts Predict Bitcoin Price Dump To $42,000 After Bitcoin’s brief decline below $70,000, analysts warn that further weakness may be imminent. Crypto expert Chiefy has forecasted that the Bitcoin price is preparing for another massive dump to $42,000 as early as next week. With its price currently trading above $69,800, this would reflect a more than 40% crash. Chiefy notes that BTC’s slight recovery a few days ago was the final bull trap of this cycle and cautioned that things are about to get much worse. He urged investors and traders to prepare for a real bear market. Featured image from Pngtree, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|Chiefy|Gerber Kawasaki Wealth and Investment Management|Ross Gerber|spot Bitcoin ETFs",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57874321,
    "published": 1770661800000,
    "title": "Bitcoin bottom at $60K? The answer might be in Tether's dominance chart",
    "body": "Bitcoin price more than doubled the last time Tether's crypto market dominance topped out, a signal that is flashing again in 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57875103,
    "published": 1770663633000,
    "title": "Crypto Industry Set For Big Shakeups, Massive Consolidation Expected: CEO",
    "body": "Big players in crypto appear ready to buy up smaller projects, and the shakeup could speed up now that prices have cooled. Related Reading: After Predicting XRP’s Drop, Analyst Says The Bottom May Be In According to Bullish CEO Tom Farley, the same consolidation that reshaped traditional exchanges is likely to play out across digital-asset firms, with acquisitions replacing a long run of stand-alone hopefuls. Farley says overblown price tags kept many weak businesses afloat longer than they should have, and that reality is finally catching up. Bigger Crypto Firms Eye Smaller Players Farley, who led the New York Stock Exchange (NYSE) until 2018, said during an interview on CNBC on Friday that many teams mistook products for businesses — a distinction he argues is costly. Companies with modest or stalled revenue were being talked about as if they were ready for blockbuster buyouts. That story, he added, ends when confidence in inflated valuations fades and buyers demand scale and repeatable income. Mergers will pick winners. Some teams will be swallowed; others will vanish. Valuations And VC Discipline Reports say venture capitalists have already tightened their grips. Eva Oberholzer, chief investment officer at Ajna Capital, said last September that VCs are far more selective now, shifting toward projects with steady revenue and clearer business models. That change in funding behavior has left many early-stage plays without the runway they once enjoyed. The money that once chased ideas now chases proof. Bitcoin Price Action Bitcoin’s swings are part of why buyers are cautious. Based on real-time data, BTC has been trading in the $68k-$70k lately, well off the October peak above $126,000. Daily moves of multiple thousands of dollars are common, and traders are jittery as broader markets wobble. Reports note that the recent volatility followed heavy losses across risk assets and a spike in hedging activity, which made short-term momentum hard to read. Related Reading: Breathe… XRP Is The ‘Oxygen’ Of The New Financial System, CEO Says What That Means For Teams And Workers When companies merge, duplication often follows. Engineers, product leads, and support staff may find roles cut as overlapping systems are folded together. Some projects will be integrated and given new life inside larger platforms; others will be wound down. For holders and small investors, the change can be abrupt. Buyers will prize clear revenue lines and strong custody, not dreams of a future payout. Featured image from AFP/Getty Images, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|Bear market|bitcoin|btc|btcusd|capitulation|crypto|crypto winter",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57875807,
    "published": 1770665123000,
    "title": "Jump Trading eyes Kalshi, Polymarket stakes as institutional interest grows: Report",
    "body": "Wall Street–style liquidity is reportedly moving into prediction markets, signaling a shift toward deeper markets, higher volumes and greater institutional participation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 57876548,
    "published": 1770666911000,
    "title": "ChatGPT Rolls Out Ads, Just Hours After Anthropic's Mocking Super Bowl Commercials",
    "body": "OpenAI started testing ads in ChatGPT on Monday, hours after Anthropic's Super Bowl commercials mocked the idea. The $8 billion loss explains why.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57876392,
    "published": 1770666217000,
    "title": "Fed’s Waller Says Trump-Induced Crypto Euphoria May Be Fading",
    "body": "Federal Reserve Governor Christopher Waller said initial optimism that lifted crypto markets after President Donald Trump was elected may now be fading amid a selloff that has rattled the asset class.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57876807,
    "published": 1770667659000,
    "title": "Polymarket Sues Massachusetts Ahead of Looming Ban of Kalshi Sports Markets",
    "body": "With temporary bans of prediction markets poised to take effect in Massachusetts and Nevada, Polymarket is asking a federal court to intervene.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57876556,
    "published": 1770666874000,
    "title": "Bitcoin Secured Put And Covered Call Strategies Are A Trainwreck",
    "body": "Static options strategies are easy to sell to clients, but tend to perform poorly given enough time. They can do well for stretches, but tend to fail ultimately.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57877250,
    "published": 1770669035000,
    "title": "XRP’s 1,500% Path To $24: Analyst Warns Investors To Be Prepared For When The Correction Resolves",
    "body": "Crypto analyst Austin has commented on how XRP could record a 1,500% rally to $24 based on an Elliot Wave theory. He also stated that the rally will be swift, which is why the analyst warned investors to be prepared when the current correction is over. XRP Eyes 1,500% Rally To $24 as Analyst Warns Investors To Be Prepared In an X post, Austin shared an accompanying chart showing that XRP could rally to $24 on Wave 5 of an Elliot Wave analysis. Meanwhile, the altcoin is expected to reach between $8 and $14 on Wave 3, which the analyst expects to happen anytime soon. He remarked that XRP is well-positioned to begin the macro 3rd wave into price discovery at any moment. Related Reading: XRP Price Has Just Reached Most Oversold Level In History And This Analyst Is Predicting A Bounce Austin further mentioned that the XRP rally on this Wave 3 could be right around the corner or that it could take a while longer to work out this correction before the next impulse. However, he warned investors to be prepared because when this correction resolves, which he is confident it will, it will result in swift and violent moves to higher prices just like the Wave 1 move. The analyst also noted that the 2.618 extension sits at $8.47 while the 4.236 extension is at $13.64. He stated that these are both good targets to aim for, but expects higher prices given the length of time XRP has been consolidating and building out its current structure. Why XRP Is Ready To “Blast” Into Price Discovery Austin stated that on the macro scale, XRP appears ready to enter price discovery at any moment. He explained that the altcoin has experienced a 7-year contracting triangle accumulation structure followed by an explosive 5-wave breakout to test the all-time highs (ATHs) at Macro Wave 1. Related Reading: Analyst Who Predicted XRP’s 600% Rally Forecasts The Bottom And A Target Of $10 The analyst further noted that XRP has been in an ABC correction/reaccumulation for over a year, which has resulted in mass fear and capitulation down to a .702 to .786 retrace. He assured that this has been nothing but a macro wave 2. Meanwhile, Austin also reminded investors that XRP is the only crypto asset with complete regulatory clarity in the U.S. following the settlement of the SEC lawsuit. He added that Ripple has continued to silently build out the infrastructure required to foster global adoption when the time is right to “flip the switch.” Notably, the crypto firm recently unveiled its roadmap for institutional DeFi on the XRP Ledger (XRPL), highlighting XRP’s role at the core of this infrastructure as it rolls out compliance-focused features to attract institutions. At the time of writing, the XRP price is trading at around $1.44, up in the last 24 hours, according to data from CoinMarketCap. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|ABC Correction/Reaccumulation|altcoin|Austin|CoinMarketCap|elliot wave theory|Ripple|US SEC|xrp|XRP Ledger|xrp news|XRP Price|XRPL|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57877215,
    "published": 1770668737000,
    "title": "Ripple expands institutional custody stack with staking and security integrations",
    "body": "The new integrations enable banks and custodians to deploy custody and staking services without operating their own validator or key-management infrastructure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57877546,
    "published": 1770669450000,
    "title": "Israel crypto industry pushes regulatory changes amid strong public support",
    "body": "Reform of Israel's digital asset regulations may add 70,000 jobs and $38 billion to the country's GDP, according to KPMG.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57878492,
    "published": 1770672458000,
    "title": "Banks Demand Delays as Crypto Firms Push for Fed Payment Access",
    "body": "Banks have formalized their opposition to giving crypto and fintech firms direct access to the Federal Reserve’s payment systems, escalating a fight over who controls access to the core of the US payments infrastructure.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57878491,
    "published": 1770671746000,
    "title": "Ether Slides in Bitcoin’s Shadow as Investors Pull Out in Droves",
    "body": "Bitcoin’s pummeling may be dominating headlines, but the second-largest cryptocurrency has also been suffering amid a protracted market downturn.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57879465,
    "published": 1770675872000,
    "title": "AI Promised to Save Time—Instead It's Created a New Kind of Burnout",
    "body": "UC-Berkeley and Yale researchers found that AI tools don't reduce work; they intensify it by creating workload creep and widespread burnout.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57881549,
    "published": 1770682386000,
    "title": "MrBeast buys Gen Z bank just weeks after BitMine's $200M bet",
    "body": "The banking acquisition follows a trademark filing for “MrBeast Financial” in October, which specifically mentioned “cryptocurrency exchange services.”",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57882372,
    "published": 1770685216000,
    "title": "Ethereum Crash Below $2,000 Triggers Record Token Movement: Hinting At Capitulation",
    "body": "Ethereum is holding above the $2,000 level as the market enters a consolidation phase following several days of intense selling pressure that forced prices sharply lower. While volatility has eased slightly, sentiment remains fragile as investors assess whether the recent decline represents a temporary correction or the early stage of a broader bearish cycle. Against this backdrop, new on-chain data is drawing attention to an unusual divergence between price behavior and network activity. Related Reading: Bitcoin At $65K: Market Cycle Indicator Points To Possible Bottom Zone A recent CryptoQuant report highlights that the Ethereum network is experiencing a substantial increase in token transfers even as prices struggle to recover. According to the analysis, as Ethereum corrected from roughly $3,000 down to the $2,000 region, on-chain activity accelerated rather than declined. Specifically, the 14-day moving average of total tokens transferred surged from about 1.6 million on January 29 to approximately 2.75 million by February 7. This represents the highest level observed since August 2025. Such a rapid rise in transfer volume during a price downturn often signals heightened stress in the market. It can reflect repositioning, forced liquidations, or large-scale portfolio adjustments. Although not a definitive capitulation signal on its own, the data suggests that underlying market dynamics remain tense, making the coming sessions particularly important for confirming Ethereum’s next directional move. Transfer Activity Signals Stress Rather Than Immediate Recovery The report indicates that the recent spike in ERC-20 token transfers reflects elevated stress conditions rather than organic network growth. During sharp price declines, increased token movement typically suggests panic-driven repositioning. Investors often rotate from volatile assets into stablecoins or move funds toward exchanges, preparing for liquidation or defensive portfolio adjustments. This behavioral shift tends to amplify short-term volatility and reinforces downward momentum. From a historical perspective, abrupt surges in transfer velocity during bearish phases frequently coincide with capitulation dynamics. Rapid increases in on-chain activity can signal that weaker market participants are exiting positions under pressure. Such “flush” phases compress selling into a short window, allowing the market to absorb excess supply more quickly than during gradual declines. Part of the current activity likely originates from decentralized finance mechanisms. Because the metric tracks token transfers broadly, a share of the increase probably reflects forced liquidations, collateral rebalancing, and automated risk management processes across DeFi lending and derivatives protocols. These cascades can intensify price swings even without new fundamental catalysts. Sentiment appears dominated by caution. Historically, when token transfer activity spikes sharply during downtrends, it sometimes precedes stabilization phases. While not a definitive bottom signal, this pattern often suggests that intense selling pressure may be approaching exhaustion. Related Reading: Binance SAFU Fund Adds 3,600 Bitcoin ($233M) As Market Faces Pressure Ethereum Tests Key Support As Momentum Weakens Ethereum’s weekly chart shows sustained downside pressure after failing to hold the $3,000 region, with price now hovering just above the $2,000 level. This zone has become a critical psychological and structural support, especially as recent candles reflect increasing volatility and sharp rejection from higher levels. The market appears to be transitioning from a corrective pullback into a broader consolidation phase, though downside risks remain evident. Technically, ETH is trading below major moving averages, with shorter-term averages trending downward and beginning to cross beneath longer-term ones. This configuration typically signals weakening momentum and suggests that buyers have not yet regained control. The 200-week moving average, currently near the mid-$2,000 range, may act as a pivotal reference level. Sustained trading below it would likely reinforce bearish sentiment. Related Reading: Bitcoin Short-Term Holders Deep In Loss: MVRV Signals Capitulation Phase Recent spikes in selling volume correspond with rapid price declines, indicating distribution rather than accumulation. Historically, such volume expansions during downtrends often precede either capitulation lows or extended sideways consolidation. From a structural standpoint, reclaiming the $2,400–$2,600 range would be necessary to stabilize momentum. Conversely, a decisive break below $2,000 could expose lower historical support zones, potentially accelerating volatility as leveraged positions unwind further. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum News|ETH|ethereum|Ethereum Analysis|Ethereum Capitulation|ethereum news|ethereum price|Ethereum supply|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57884011,
    "published": 1770690603000,
    "title": "TRON Doubles Down on TRX as Rising On-Chain Activity Supports Price Recovery",
    "body": "Tron Inc.’s recent moves in the TRX market are drawing attention at a time when investors are searching for signals beyond short-term price swings. Over the past week, the NASDAQ-listed company has steadily increased its exposure to TRX, while on-chain data points to sustained network usage. Related Reading: After Predicting XRP’s Drop, Analyst Says The Bottom May Be In Concurrently, these developments have helped stabilize the token after weeks of weakness, even as broader market caution remains visible in trading volumes. TRX's price trends to the downside following an important surge as seen on the daily chart. Source: TRXUSD on Tradingview Tron Inc. Expands TRX Treasury Holdings According to disclosures shared by Justin Sun, Tron Inc. has acquired an additional 179,408 TRX at an average price of $0.28. This purchase lifted the company’s total TRX treasury holdings to roughly 680.7 million tokens. The acquisition follows similar buys earlier in the month, including purchases on February 7 and February 8 at comparable price levels. The company has framed its accumulation strategy as part of a longer-term approach to building a Tron-based digital asset treasury. The designated on-chain wallet for these holdings is publicly trackable on Tronscan, allowing market participants to verify the transactions directly. While the latest purchase is modest relative to total circulating supply, the pattern of repeated accumulation has become a key data point for traders watching corporate involvement in crypto assets. TRX Price Reaction and Market Response TRX prices rebounded modestly following confirmation of the latest acquisition and Justin Sun’s public endorsement of the strategy. The token was trading around $0.2785 at last check, up about 0.5% on the day. Despite the recovery, performance over longer periods remains mixed, with TRX still down on both weekly and monthly timeframes. Trading activity suggests a more cautious market response. Reported 24-hour trading volume fell by roughly 16% to about $532 million, indicating that while prices have stabilized, participation has not fully returned. Analysts note that corporate accumulation often provides psychological support near purchase levels, but sustained upside typically requires broader demand. On-Chain Activity Adds Context Beyond treasury moves, Tron’s on-chain metrics continue to show steady usage. Transaction volumes, active addresses, and smart contract interactions remain elevated, supported by stablecoin transfers and decentralized application activity across the network. Related Reading: Solana (SOL) Below $80 Risks Restarting A Brutal Downtrend Historically, rising on-chain engagement has coincided with more resilient TRX price behavior, even during periods of uneven market sentiment. However, on-chain strength does not operate in isolation, as regulatory developments, macroeconomic conditions, and broader crypto market trends continue to influence price action. Cover image from ChatGPT, TRONUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tron|TRON|TRX|TRX Price|trxusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 51,
        "NAME": "TRX",
        "CATEGORY": "TRX"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57884834,
    "published": 1770692871000,
    "title": "Bitcoin rebound has hit a wall at $71,000 with sentiment at most fearful since 2022",
    "body": "Trading data show a broad risk-off unwind, with spot volumes on major exchanges down about 30% since late 2025 and retail participation fading",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57885110,
    "published": 1770694273000,
    "title": "‘No privacy’ CBDCs will come, warns billionaire Ray Dalio",
    "body": "Hedge fund manager Ray Dalio warns that CBDCs will eliminate financial privacy and enable governments to tax, seize funds, and cut off political opponents.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 57885367,
    "published": 1770695224000,
    "title": "Vitalik Buterin details how Ethereum could work alongside AI",
    "body": "The Ethereum co-founder sees crypto providing privacy rails, verification systems and economic layers to help decentralize AI and benefit society.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57885473,
    "published": 1770695732000,
    "title": "Crypto exchange Backpack to launch token with unlocks tied to IPO goal",
    "body": "Backpack founder Armani Ferrante says the company’s staff and investors won’t get an allocation at its upcoming token launch to avoid insiders “dumping on retail.”",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57886410,
    "published": 1770699214000,
    "title": "Ethereum Foundation teams up with SEAL to combat wallet drainers",
    "body": "SEAL and the Ethereum Foundation created a Trillion Dollar Security dashboard to track Ethereum security as part of efforts to fight wallet drainers.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57886880,
    "published": 1770700990000,
    "title": "US Sentences Fugitive to 20 Years Over $73 Million Crypto Scam",
    "body": "The sentence was handed down in absentia after prosecutors said the defendant cut off an ankle monitor and fled supervision.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57886782,
    "published": 1770700463000,
    "title": "Chainlink co-founder's 2 reasons this bear market feels different",
    "body": "Chainlink co-founder Sergey Nazarov says the recent crypto market downturn has inadvertently shown \"how far the industry has progressed.\"",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57887476,
    "published": 1770703244000,
    "title": "Tron Accumulates TRX, Price Pops As Justin Sun Weighs In",
    "body": "Tron’s blockchain operator has been adding to its stash of TRX and that activity is getting attention. Reports say the platform recently bought 179,408 TRX at an average cost of $0.28, lifting its treasury to about 680 million tokens. The buy was one more in a series of purchases that show a clear pattern: steady accumulation over several days. Related Reading: After Predicting XRP’s Drop, Analyst Says The Bottom May Be In Tron Increases Treasury Holdings According to on-chain records, the platform purchased tokens at slightly different prices across recent days. On February 7, it bought more than 184,000 TRX at $0.27 a piece. On February 8, another 181,000+ TRX were added at $0.28. The most recent move of 179,400 TRX followed those buys. These are not one-off trades. They read as deliberate, repeated steps to build a reserve of native tokens over time. Tron Inc. (NASDAQ: TRON) acquired 179,408 TRX tokens today at an average price of $0.28, further increasing its TRX treasury holdings to more than 680.7 million TRX in total. The company aims to further grow its Tron DAT holdings to enhance long term shareholder value. For live… — Tron Inc. (@TRON_INC) February 9, 2026 Tron’s founder, Justin Sun, posted a short message that read “Keep Going.” That simple line was taken by some traders as a vote of confidence. Reports note Sun’s public backing came while his legal fight with regulators remains on pause, and that political voices have criticized the pause. TRX Sees A Small Bounce, Volume Falls Market moves have been modest. The token is trading near $0.27, up about 0.75% from earlier in the day. Still, TRX has slipped 1.5% over the past week and 6% in the last month. Trading activity has cooled; 24-hour volume fell by 20% to roughly $520 million. That lower volume suggests fewer hands are moving funds, which can make any price uptick look fragile. What The Buying Might Mean Large-scale accumulation by a project is usually read two ways. For followers, it can be a sign the team expects future value or wants to support liquidity. For skeptics, it can also look like internal reshuffling or an effort to control supply dynamics. The repeated purchases at nearby price points point to a steady plan rather than panic buys, but steady plans don’t guarantee price rebounds when broader market sentiment is soft. Related Reading: Breathe… XRP Is The ‘Oxygen’ Of The New Financial System, CEO Says Reports say Tron intends to keep buying. If that continues over the next 10 days or longer, the treasury will grow and the narrative around its reserve will strengthen. Yet the wider market’s mood and regulatory pressure will probably matter more for TRX’s path than a handful of buys. Investors watching the token should note the low turnover and the modest nature of the price rise; both hint that stronger momentum has not yet arrived. Featured image from Yellow.com, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoin|bitcoin|crypto|Justin Sun|TRON|TRX",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 51,
        "NAME": "TRX",
        "CATEGORY": "TRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57888057,
    "published": 1770704956000,
    "title": "Vitalik Buterin Calls for Ethereum-Led Alternative to the 'Race for AGI'",
    "body": "The Ethereum co-founder has outlined a four-quadrant Ethereum-AI buildout spanning private AI use, agent markets, and governance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57889798,
    "published": 1770710404000,
    "title": "Ethereum Drops Under MVRV Band That Marked Last 3 Bottoms",
    "body": "On-chain data shows Ethereum dipped under a key Market Value to Realized Value (MVRV) pricing band during the latest price drawdown. Ethereum Fell Under The 0.80 MVRV Band Recently As explained by analyst Ali Martinez in an X post, Ethereum recently dropped below the 0.80 MVRV pricing band. The “MVRV Ratio” is a popular on-chain indicator that tracks the ratio between the ETH market cap and Realized Cap. Related Reading: Bitcoin Sentiment Worst Since 2022 Bear As Price Crash Continues The Realized Cap here refers to a capitalization model that calculates the asset’s total value by assuming that the value of each individual token is equal to the spot price at which it was last transacted on the blockchain. The last transfer of any token is likely to represent the last time that it changed hands, so the price at its time could be considered as its current cost basis. As such, the Realized Cap essentially measures the sum of the acquisition value of all coins in circulation. In other words, it provides an estimate for the amount of capital that the investors as a whole have put into the cryptocurrency. As the market cap can be considered as the value that holders are carrying in the present, its comparison with the Realized Cap in the MVRV Ratio tells us about the profit-loss status of the Ethereum userbase. When the value of the MVRV Ratio is greater than 1, it means the investors are in a state of net unrealized profit. On the other hand, it being under this mark suggests the dominance of loss on the network. Historically, profitability swinging to an extreme value either side of 1 has often paved way for reversals in the asset. At a high level above 1, this happens because investors become more likely to take their profits the higher that they get. Similarly, below 1, the asset can bottom out as losses dominate and selling pressure runs out. The MVRV Pricing Bands is a model that defines price levels for ETH where these behaviors become more apparent. Below is the chart shared by Martinez that shows the trend in this model’s bands for Ethereum. As is visible in the graph, Ethereum plunged below the 1.0 pricing band corresponding to $2,449 during its slide at the end of January. This means that the overall market went underwater due to the price drawdown. With bearish momentum continuing in the first week of February, losses only grew deeper for investors as the asset fell below another pricing band: 0.80. Currently, this level is valued at $1,959. Related Reading: Bitcoin Realized Loss Nears $900 Million, Highest Since FTX Crash “The last three times Ethereum $ETH dipped below the 0.80 Pricing Band, it marked a market bottom,” noted the analyst. It now remains to be seen whether the venture below the level would also mark a bottom for the asset this time. ETH Price Ethereum has rebounded a bit since its plunge last week as its price has returned to $2,044, recovering above the 0.80 MVRV pricing band. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ethereum|Ethereum Bottom|Ethereum MVRV Pricing Bands|Ethereum MVRV RAtio|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57890112,
    "published": 1770711058000,
    "title": "Bitcoin ETFs extend rebound as $145M in fresh inflows hit market",
    "body": "The Bitcoin ETF rebound comes as analysts flag slowing outflows, while early BTC holders trim positions rather than exit as BTC hovers near $70,000, according to Bitwise.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57891038,
    "published": 1770713273000,
    "title": "Ether Resumes Plunge, Tracking Bitcoin Slide on Risk-Off Mood",
    "body": "After a relatively quiet start to the week, the two largest cryptocurrencies began sliding again in early European hours on Tuesday as bearish sentiment weighed on digital assets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57891177,
    "published": 1770714012000,
    "title": "Bernstein Calls Bitcoin Crash A ‘Crisis Of Confidence,’ Maintains $150,000 Target",
    "body": "Despite a sharp decline in Bitcoin (BTC) prices since last October, analysts at Bernstein argue that the current downturn does not resemble a traditional crypto bear market. In a note to clients released on Monday, the firm described the pullback as “the weakest Bitcoin bear case in its history,” even as the asset has fallen about 44% from its all‑time highs in current trading. Bernstein Defends Bitcoin’s Fundamentals The analysis was led by Bernstein’s Gautam Chhugani, who said the recent sell‑off reflects a loss of confidence rather than deeper structural problems. The analysts emphasized that Bitcoin’s core fundamentals remain intact and that the decline should not be mistaken for a systemic breakdown. Bernstein reaffirmed its long‑term outlook, maintaining a $150,000 price target for Bitcoin by the end of 2026. Related Reading: Ethereum Price Set To Break Out Against Bitcoin, But How High Can It Go? Bernstein noted that many of the “red flags” that have historically preceded major Bitcoin crashes are missing this time. The analyst asserts that there have been no large institutional collapses, no exposure of hidden leverage, and no widespread failures across the crypto ecosystem. Instead, the firm sees a market weighed down by negative sentiment, even as broader conditions appear unusually favorable. The analysts pointed to what they described as strong institutional support for Bitcoin. This includes a pro‑Bitcoin US president, the continued expansion of spot Bitcoin exchange‑traded funds (ETFs), growing adoption by corporate treasuries, and sustained interest from large asset managers. In Bernstein’s view, these factors clearly distinguish the current cycle from past downturns that were driven by excess risk and fragile market structures. Holders And Miners Can Weather Long Downturn The firm also addressed shifting narratives around technology trends. Bernstein noted that some investors now argue Bitcoin has become irrelevant as global attention turns toward artificial intelligence (AI). The analysts dismissed that view, saying it reflects changing investor focus rather than a genuine threat to Bitcoin’s role. They added that fears around quantum computing have similarly been overstated, pointing out that such risks would affect all critical digital systems, not just Bitcoin. The firm further downplayed fears of forced selling driven by corporate treasuries or miner capitulation. Bernstein said major companies holding Bitcoin have structured their balance sheets to withstand prolonged downturns. Related Reading: After Predicting XRP’s Drop, Analyst Says The Bottom May Be In Referencing comments from Strategy’s recent earnings call, the analysts noted that only an extreme scenario—Bitcoin falling to $8,000 and remaining there for five years—would trigger a need for restructuring. Miners, they added, are also better positioned than in past cycles. Many have diversified their revenue by reallocating power resources toward AI data center demand, reducing reliance on Bitcoin mining alone and easing pressure from production costs. As of this writing, Bitcoin is trading at $70,627, having recorded losses of 20% and 22% over the past fourteen and thirty days, respectively. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin chart|Bitcoin news|bitcoin price|bitcoin technical analysis|btc|BTC news|BTCUSDT|crypto|crypto analyst|crypto market|crypto news|cryptocurrency",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57891171,
    "published": 1770713769000,
    "title": "LMAX unveils new exchange to break the wall down between crypto and FX",
    "body": "Omnia allows users to trade any asset directly against any other 24/7, without restrictions on size or type.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|LMAX Group|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57892053,
    "published": 1770716242000,
    "title": "Gemini exit a ‘blow for policymakers’ with UK crypto hub ambitions",
    "body": "Industry groups and exchanges say the United Kingdom’s slow, overlapping crypto rules and compliance frictions are undermining its “global hub” ambition.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57891853,
    "published": 1770715804000,
    "title": "I'm not confident we hit a true capitulation in bitcoin, derivatives expert says",
    "body": "Bitcoin's futures market doesn't show panic capitulation as in late 2022, analyst said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Derivatives|Bitcoin Futures|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57892347,
    "published": 1770717268000,
    "title": "Bitcoin ETFs Extend Inflow Streak as Institutional Capital Rotates Into $HYPER",
    "body": "What to Know: Spot Bitcoin ETFs continue to see consistent net inflows, creating a supply shock that historically precedes capital rotation into infrastructure altcoins. Bitcoin Hyper differentiates itself by integrating the Solana Virtual Machine (SVM) to bring high-speed, programmable smart contracts to the Bitcoin network. The project solves Bitcoin’s core limitations of slow transactions and high fees while preserving the security guarantees of the Layer 1 blockchain. Institutional appetite for digital assets isn’t showing any signs of slowing down. Spot Bitcoin ETFs just logged another week of consistent net inflows , signaling a distinct shift in market structure. The data points to a supply shock dynamic where issuers like BlackRock and Fidelity are absorbing coins faster than miners can produce them, effectively creating a rising price floor for the premier asset. That stability matters. Historically, when Bitcoin goes flat after a run, liquidity trickles down to high-beta infrastructure plays, specifically the ones solving Bitcoin’s scaling headaches. While Bitcoin remains the pristine collateral of the crypto economy, its network congestion and lack of programmability are still major barriers to mass adoption. Investors are now looking past the store-of-value narrative toward the execution layer. The market is hunting for protocols that can unlock the nearly $2T of dormant capital on the Bitcoin network. Amidst this search for yield, Bitcoin Hyper ($HYPER) has emerged as a focal point for developers and smart money alike. By integrating the speed of the Solana Virtual Machine (SVM) directly with Bitcoin’s security architecture, the project is positioning itself to capture the liquidity overflowing from the ETF-driven bull market. Solving The Execution Bottleneck: SVM Meets Bitcoin Security The current landscape of Bitcoin Layer 2s is a bit of a mess. Users are often forced to choose between speed and security. Bitcoin Hyper fixes this dichotomy with a modular architecture: it uses the Bitcoin L1 for final settlement while deploying a real-time SVM Layer 2 for execution. That’s a massive technical differentiator. By using the Solana Virtual Machine, the network achieves low-latency processing and high throughput that native Bitcoin script simply can’t support. For developers, this integration changes the calculus of building on Bitcoin. The protocol supports Rust-based smart contracts, allowing dApps to run with the performance users expect from modern DeFi, while anchoring their state to Bitcoin’s immutable ledger. This ‘best of both worlds’ approach, Solana’s speed plus Bitcoin’s trust, aims to solve the friction of high fees and slow block times that have historically plagued the ecosystem. The utility here extends beyond simple transfers. The infrastructure supports a decentralized Canonical Bridge for seamless $BTC transfers and offers a robust environment for NFT platforms and gaming dApps. By enabling high-speed payments in wrapped BTC and sophisticated DeFi protocols (like lending and staking), the network effectively transforms Bitcoin from a passive asset into a programmable financial instrument. VISIT THE OFFICIAL $HYPER PRESALE SITE Whale Accumulation Signals Confidence In Hyper’s $31M Presale Traders often watch ‘smart money’ wallet movements to gauge a project’s viability before the public launch. On-chain metrics for Bitcoin Hyper suggest real interest from high-net-worth individuals positioning themselves ahead of the Token Generation Event (TGE). According to the official presale page, $HYPER has already raised over $31M, a figure that underscores strong demand for Bitcoin-native DeFi solutions. With tokens currently priced at $0.0136754, the valuation reflects an early-entry opportunity relative to established L2s like Stacks or fast-execution chains like Solana. But even more telling is the behavior of large-volume buyers. Whales have been appearing in pods, with large purchases totalling over $1M; the largest of these was $500K . This specific accumulation during a presale phase implies a long-term conviction in the project’s roadmap and its high-APY staking incentives, which are designed to reward community governance. The combination of significant capital raises and whale activity suggests the market views this SVM-integration model not just as a technical upgrade, but as a necessary evolution for the Bitcoin ecosystem. VISIT THE OFFICIAL $HYPER PRESALE SITE The information provided in this article is not financial advice. Cryptocurrency investments carry high risk and volatility. Always conduct independent research.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57892484,
    "published": 1770717652000,
    "title": "Bitcoin Could See New Drop To $60,000 Despite Bounce – Here’s The Level To Defend",
    "body": "As the crypto market recovers from last week’s correction, Bitcoin (BTC) is attempting to reclaim a crucial price zone. Despite the bounce, some analysts have warned that the bottom may not be in yet, suggesting the flagship crypto could soon retest its recent lows. Related Reading: Ethereum Price Set To Break Out Against Bitcoin, But How High Can It Go? Bitcoin Bottom Below $60,000, Says Analyst On Monday, Bitcoin continued its sideways move, trying to turn a key area into support for the third consecutive day. After hitting a two-year low of $60,000 last week, the flagship crypto has bounced 17.5% to trade between $68,000 and $72,000 over the past few days. Nonetheless, the cryptocurrency has failed to reclaim the upper zone of its short-term price range, raising questions about the direction of BTC’s next move. As the price recovered, Crypto Bullet noted that the BTC printed a “strong weekly close” above the 200-week Exponential Moving Average (EMA), leaving Thursday’s correction as a long wick. The analyst cautioned that these wicks have usually been filled the following week, pointing to the late February 2025 and early October 2025 corrections and the subsequent performance. Based on this, he suggested that Bitcoin could retest the $60,000 area again, where the 200-week Moving Average (MA) is also located. Similarly, Ted Pillows highlighted BTC’s Monday bounce above $70,000, asserting that the key level to defend is the $68,000 support, where the EMA200 sits. If the price fails to hold this level, the market observer suggested a deeper correction could be expected, with Bitcoin risking a drop below the recent lows if that level also fails to hold. Meanwhile, Ali Martinez hinted that BTC’s bottom might not be in, as “Bitcoin has historically bottomed around the −1.0 MVRV Pricing Band.” According to the chart shared on X, that level currently sits at $52,040. BTC To See Leeser Relief Rally? Another market watcher highlighted BTC’s macro descending triangle pattern, which it has been forming in the monthly timeframe since mid-2024, suggesting that its potential bounce could be a “lesser relief rally compared to the 2024-2025 advance to the upside.” Rekt Capital noted that upon breakdown from its macro triangles, Bitcoin tends to react from the 50-Month EMA. However, it has historically been followed by a downside deviation below this level. “When viewed through the lens of the Macro Descending Triangle, history shows that Bitcoin has consistently failed to revisit the base of the Macro Triangle following breakdowns, which means BTC may fall short of $82.5k on any upcoming relief rally.” To the analyst, if BTC can build support above the $71,000 area, where the post-halving accumulation breakout occurred, the price could attempt a move into the mid-$70,000. Related Reading: XRP Ledger Clears The Threshold For Institutional Settlement – Here’s How However, the flagship crypto “is still negotiating whether it will locate itself within the Post-Halving Range,” and has not decisively reclaimed the upper zone of its current range as support, “is instead showing early signs of flipping into resistance on the Weekly timeframe.” As a result, Bitcoin could consolidate around its post-halving range again if the $70,000 mark confirms as resistance. “At roughly 30% of the way through this part of the market cycle, there remains ample time for further structural movement to unfold but history suggests whatever clustering develops will likely be distributive before continuing additional Bearish Acceleration,” Rekt Capital concluded. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|bitcoin bear market|Bitcoin breakdown|btc|BTC Anaysis|BTCUSDT|crypto analyst|Crypto bear market|crypto market correction|Crypto Market Recovery|Crypto trader",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57892443,
    "published": 1770717304000,
    "title": "Crypto scam mastermind gets 20 years for $73M pig butchering scheme",
    "body": "A US court sentenced Daren Li to 20 years in prison for leading a $73 million crypto pig butchering scam targeting American investors.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57892827,
    "published": 1770718667000,
    "title": "Fugitive foreigner sentenced in the U.S. to 20 years for $73 million crypto scam",
    "body": "A U.S. judge sentenced Daren Li to 20 years for a $73 million crypto fraud. The scam used Cambodia-based compounds to target victims via social media and dating apps.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|crypto scams|TRM Labs|Cambodia|U.S.|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57893862,
    "published": 1770721280000,
    "title": "South Korea probes Bithumb after $43B ‘phantom’ Bitcoin payout",
    "body": "South Korean authorities have launched an investigation into Bithumb after it mistakenly credited 620,000 BTC to users, adding to concerns about “paper Bitcoin” and internal controls.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57894163,
    "published": 1770722138000,
    "title": "Farcaster Founders Shift Focus to Payments as SUBBD Enters the Social Finance Arena",
    "body": "What to Know: Farcaster founders are pivoting toward stablecoin payments via Tempo, signaling that financial rails are the next major evolution for Web3 social platforms. The SocialFi sector is moving from pure communication protocols to monetization layers, validating the need for integrated payment and content solutions. SUBBD Token bridges the gap by combining low-fee Web3 payments with AI tools like voice cloning to disrupt the $85B creator economy. Early market response shows strong demand, with over $1.4M raised in the presale as investors seek yield-bearing utility tokens. Decentralized social media is shifting gears, fast. Farcaster founders Dan Romero and Varun Srinivasan, known for building Web3’s ‘town square,’ are pivoting their attention to the plumbing. Their new venture, Tempo, focuses on global stablecoin payments . It’s not just a roadmap tweak; it’s a tacit admission that social graphs are toothless without seamless financial rails behind them. The logic is brutal but sound. Building decentralized Twitter clones is cool tech, but financially hollow if creators can’t eat. Romero and Srinivasan seem to realize the next battle isn’t about owning data, but processing value. This mirrors giants like Stripe re-entering crypto with the $1.1B acquisition of Bridge to capture stablecoin flows. Web3 social is rapidly maturing into ‘SocialFi,’ where a like or subscribe isn’t just vanity, it’s a transaction. But fixing the pipes doesn’t automatically fill the pool. A gaping hole remains: how do creators actually generate that value in the first place? Payment rails are useless if the content platform feels archaic. While the Farcaster team tackles the stablecoin layer, SUBBD Token ($SUBBD) is surfacing to overhaul the $85B creation industry itself, attempting to bridge the gap between boring payments and AI-driven production. AI-Driven Monetization Disrupts The $85B Creator Economy While giants fight over financial infrastructure, SUBBD Token is re-architecting the engine. The project targets a specific friction point in the Web2 economy: the rake. Legacy platforms take up to 70% of revenue while enforcing arbitrary bans. SUBBD uses a decentralized architecture to cut the middleman, but the real differentiator is the AI integration. It’s not just a crypto-native OnlyFans; it’s a suite of tools designed to multiply output. Features like the AI Personal Assistant and Voice Cloning allow influencers to scale their presence beyond physical limits. That matters. It shifts the pitch from ‘censorship resistance’ (which frankly only appeals to a niche) to ‘revenue optimization,’ which appeals to everyone. By merging transparency with proprietary models, SUBBD offers utility beyond speculative trading. For traders, the distinction is critical. $SUBBD offers a staking protocol incentivizing long-term holding, with a fixed 20% APY for the first year. This structure acts as a volatility buffer, encouraging participants to lock supply while the user base expands. Farcaster validates the sector; SUBBD provides the tools to monetize it. LEARN MORE ON THE OFFICIAL $SUBBD PRESALE PAGE Presale Momentum Signals Demand For Yield-Bearing Social Utility The market’s appetite for this AI/SocialFi mix is showing up in the flows. $SUBBD has raised over $1.4M with tokens currently priced at $0.057495. That’s a solid capitalization for a pre-launch utility token, suggesting smart money is hunting for exposure beyond simple governance rights. The tokenomics aim for a circular economy. $SUBBD isn’t just for payouts; it’s required for token-gated content, buying AI tools, and voting on features. This creates buy pressure correlated with usage, not just Bitcoin’s mood. Plus, the ‘HoneyHive’ membership and XP multipliers gamify the holding experience, a tactic borrowed directly from successful gaming sectors. Not sure how to ge tin on the project? Check out our ‘ How to Buy SUBBD Token ‘ guide. What most coverage misses is the timing relative to the macro cycle. As stablecoin infrastructure (like Tempo) matures, the friction for fans to pay creators drops to near zero. SUBBD sits at the receiving end of these efficient rails. With Ethereum-based EVM compatibility, onboarding remains seamless for the existing DeFi liquidity base. BUY YOUR $SUBBD NOW This article is for informational purposes only and does not constitute financial advice. Cryptocurrency investments carry high risk, including the potential for total loss. Always verify smart contract addresses and conduct your own due diligence.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57894597,
    "published": 1770723261000,
    "title": "Backpack Launches Native Token with IPO Ambitions; LiquidChain Positions for Scalable Growth",
    "body": "What to Know: Backpack is pursuing a dual strategy: launching a native token while preparing for a potential future IPO to secure regulatory legitimacy. The industry is shifting toward infrastructure that abstracts complexity, moving away from manual bridging toward unified execution environments. LiquidChain offers a Layer 3 solution that fuses Bitcoin, Ethereum, and Solana liquidity, eliminating the security risks associated with wrapped assets. Early participation in the $LIQUID ecosystem is active, with over $533K raised as investors target interoperability solutions. The crypto exchange landscape is shifting. We’re moving from the ‘move fast and break things’ era to a race for regulatory permanence. Backpack, the Solana-based wallet and exchange ecosystem founded by Armani Ferrante, is reportedly structuring its roadmap to include a native token launch alongside long-term plans for a public listing (IPO). That strategy mirrors industry giants like Coinbase, though with a twist: keeping the agility of a Web3-native community. Exchange tokens are regaining momentum, shifting from mere discount coupons to genuine utility plays. By aiming for an IPO, Backpack signals to institutional capital that it plans to play by strict compliance rules while using a native asset to bootstrap liquidity. Why does that matter? It bridges the gap between chaotic DeFi innovation and the rigid structure of traditional finance. But let’s be real, execution is the hard part. Navigating SEC scrutiny while issuing a token has historically been a regulatory minefield for US-connected entities. While centralized venues like Backpack polish the front end, a deeper structural issue remains: liquidity fragmentation. Users can hold assets on a sleek interface, but moving value between Bitcoin, Ethereum, and Solana is still a friction-heavy process fraught with bridge risks. As exchanges fix the UI, new infrastructure protocols are unifying the back end. That’s exactly where LiquidChain ($LIQUID) , a Layer 3 (L3) infrastructure provider, steps in to fill the gap. LiquidChain Unifies Fragmented Ecosystems Through Layer 3 Architecture Cross-chain interaction is currently a mess of inefficiency. Moving capital from Ethereum to Solana usually involves wrapping assets, navigating third-party bridges, and eating slippage costs across multiple pools. That complexity isn’t just annoying; it’s a security vector (remember the billions lost in bridge hacks previously?). LiquidChain addresses this by deploying a Layer 3 protocol built specifically as a cross-chain liquidity layer. LiquidChain’s architecture functions as a single execution environment fusing liquidity from Bitcoin, Ethereum, and Solana. Instead of relying on vulnerable wrapping mechanisms, the protocol uses a Verifiable Settlement system allowing for single-step execution. For developers, the value prop is the ‘Deploy-Once’ architecture. A dApp built on the LiquidChain L3 can access users and capital from all connected chains instantly, no need to maintain separate smart contracts for each ecosystem. This tech suggests a massive shift in how value moves on-chain. By abstracting the complexity of cross-chain hops, the protocol positions itself as transaction fuel for the next generation of DeFi apps. The goal? Pure capital efficiency. Assets should flow where yields are highest without the friction of traditional bridging. EXPLORE THE UNIFIED LIQUIDITY LAYER WITH LIQUIDCHAIN Early Capital Flows Toward Interoperability Infrastructure Smart money is rotating into infrastructure plays that solve the ‘usability vs. security’ dilemma. While the broader market chases memecoins and consumer apps, the foundational layer required to make those apps work seamlessly is seeing consistent inflows. LiquidChain is capitalizing on this trend during its presale phase, offering a window into infrastructure investing before the public listing. So far, $LIQUID has raised over $533K. That figure indicates steady accumulation from early adopters who see the necessity of cross-chain VMs. With tokens currently priced at $0.0136, the valuation reflects an early-stage entry point compared to fully diluted Layer 2 or Layer 3 networks. Plus, the tokenomics model supports this growth by incentivizing liquidity staking, rewarding users who provide the essential capital fueling the cross-chain execution environment. $LIQUID could be one of the best altcoins to buy if you’re thinking about liquidity and ease of use. The market context backs this trajectory. As major ecosystems like Solana and Ethereum grow further apart technically, the premium on ‘glue’ protocols, middleware connecting these islands, rises. LiquidChain’s ability to merge these liquidity pools into a single interface offers a hedge against ecosystem maximalism. It’s a bet on a future where users interact with apps, not chains. GET YOUR $LIQUID FROM ITS OFFICIAL PRESALE PAGE The information provided here is for educational purposes only and does not constitute financial advice; crypto markets are volatile, and readers should conduct their own due diligence before investing.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57894549,
    "published": 1770723058000,
    "title": "Glassnode: XRP Is Back In Its 2021-2022 Playbook As SOPR Drops Sub 1",
    "body": "XRP is flashing a familiar on-chain stress pattern after slipping below its aggregate holder cost basis, a move Glassnode says has historically coincided with capitulation, loss realization, and a slow grind toward stabilization rather than an immediate rebound. In a Feb. 9 post on X, the on-chain analytics firm said XRP “lost its aggregate holder cost basis, triggering panic selling,” pointing to a sharp deterioration in spent output profitability. Glassnode flagged its Spent Output Profit Ratio (SOPR) on a 7-day EMA basis falling from 1.16 in July 2025 to 0.96 “now,” adding that “holders are realizing significant losses” and that “on-chain profitability flipped negative.” SOPR prints below 1 are typically read as the market spending coins at a loss on aggregate, a regime that can persist when sellers are forced to exit and bids are primarily coming from buyers with longer horizons. In Glassnode’s framing, that’s what makes the current setup rhyme with a prior XRP cycle: “This setup closely resembles the Sep 2021–May 2022 phase, where SOPR plunged to a <1 range for prolonged consolidation before stabilization.” Related Reading: XRP Ledger Clears The Threshold For Institutional Settlement – Here’s How The Feb. 9 warning isn’t an isolated call. On Feb. 1, Glassnode wrote that “The XRP Realized Price is trading at $1.48,” adding that “The current market structure is very similar to that of April 2022.” Weeks earlier, on Jan. 19, the firm again pointed to a 2022 echo, saying XRP’s structure “closely resembles that of February 2022,” and describing a cohort tension where newer buyers are accumulating below the cost basis of longer-held supply. Glassnode’s Jan. 19 post also emphasized the behavioral side of that structure: as the pattern persists, “psychological pressure on top buyers continues to build over time.” XRP Capitulation Or Breakdown Next? Some market participants treated the sub-1 SOPR regime less as a red flag and more as a process of transferring supply from weaker hands to stronger ones. One reply, from the account @investorie, framed it explicitly as a bottom-building signal: Related Reading: XRP Bounces Hard After Capitulation — Relief Rally Or Another Bull Trap? “This is a classic capitulation signal, not a structural failure. SOPR below 1 means weak hands are exiting at a loss. That pressure gets absorbed, and historically it’s how durable bases form, not how long-term trends end.” Another respondent, 0xsimba, drew a parallel to Bitcoin’s forced-selling episodes while echoing Glassnode’s historical comparison: “When SOPR drops below 1 for extended period, pain transferring from weak to strong hands. Sep 2021–May 2022 precedent, Prolonged consolidation then recovery. Setup is forming. Signal needs confirmation.” If Glassnode’s comparison holds, the near-term takeaway is less about a single inflection point and more about whether XRP remains trapped in a loss-realization regime long enough to exhaust marginal sellers, setting the stage for stabilization only after profitability metrics stop deteriorating and SOPR can reclaim, and hold, the break-even line. At press time, XRP traded at $1.4225. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP News|xrp|xrp news|XRP On-Chain Analysis|XRP On-Chain Data|XRP Price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57894793,
    "published": 1770723387000,
    "title": "Solana treasuries sitting on over $1.5B in paper SOL losses",
    "body": "Public companies that amassed large Solana positions in 2025 have paused accumulation as equity markets reprice SOL-heavy balance sheets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57895431,
    "published": 1770725379000,
    "title": "McHenry Sees ‘Huge Opportunity’ for Lame Duck Crypto Bill: LiquidChain Targets Cross-Chain Friction",
    "body": "What to Know: Patrick McHenry predicts a strong chance for crypto regulation passing in the post-election session, potentially legitimizing the asset class for institutions. Legal clarity will expose the technical flaws of fragmented blockchains, creating demand for seamless interoperability. LiquidChain solves this by merging Bitcoin, Ethereum, and Solana liquidity into a single L3 execution layer, removing the need for risky bridges. Retiring House Financial Services Committee Chair Patrick McHenry isn’t packing his bags just yet. Instead of fading out, he has signaled that the window for comprehensive crypto regulation is not closing, it’s cracking wide open. Speaking on CoinDesk Live at the Ondo Summit in NYC , McHenry suggested the post-election ‘lame duck’ session offers a prime opportunity to pass significant market structure legislation or a stablecoin bill before the new Congress takes office in January. Why does this matter? The market has spent two years pricing in regulatory gridlock. A sudden shift to clarity changes the risk calculus for institutional capital entirely. The logic is straightforward: political will often calcifies during election cycles but liquefies immediately after. McHenry, leaving office with a legacy to cement, views the bipartisan alignment on the FIT21 Act (which passed the House with significant Democrat support) as a template for year-end action. If legislation passes, it legitimizes digital assets in the eyes of traditional finance, potentially unlocking trillions in sideline capital currently barred by compliance mandates. However, a legislative green light exposes a secondary bottleneck: technical infrastructure. While Washington debates jurisdiction, the blockchain ecosystem remains a fragmented archipelago of isolated liquidity. There’s a lack of unified rails to move efficiently between Bitcoin, Ethereum, and Solana. This disconnect, between regulatory readiness and infrastructure maturity, is driving attention toward interoperability solutions like LiquidChain ($LIQUID) , which aims to solve the liquidity fragmentation problem before the institutional floodgates open. Regulatory Clarity Demands Unified Execution Layers If McHenry’s prediction holds and regulatory clarity arrives by early 2026, the narrative will shift rapidly from ‘is it legal?’ to ‘does it work at scale?’ Right now? The answer for cross-chain operations is a hard no. The industry relies on cumbersome bridges and wrapped assets, mechanisms that introduce counterparty risk and friction that institutional trading desks simply won’t tolerate. That is the gap LiquidChain ($LIQUID) targets. It positions itself not merely as another blockchain, but as a Layer 3 (L3) infrastructure designed to fuse the liquidity of major chains into a single execution environment. Instead of forcing users to navigate complex flows to move value from Solana to Ethereum, LiquidChain offers a ‘Unified Liquidity Layer.’ This allows for single-step execution where Bitcoin, Ethereum, and Solana assets can be utilized simultaneously. For developers, the ‘Deploy-Once Architecture’ creates a crucial efficiency: they can build an application once on the LiquidChain L3 and access the user bases of all connected chains immediately. The implication is huge. If regulatory hurdles fall, the next major valuation driver will be user experience (UX) and capital efficiency. Protocols that eliminate the need for wrapped assets and reduce transaction steps will likely capture the volume that regulations unlock. LiquidChain’s approach to verifiable settlement without the typical bridging risks addresses the exact security concerns that have historically kept large asset managers cautious. EXPLORE THE LIQUIDCHAIN UNIFIED LAYER LiquidChain Presale Data Signals Appetite for Infrastructure Plays While the broader market waits for the legislative gavel, smart money appears to be positioning itself in infrastructure plays that solve the ‘fragmentation trilemma.’ The ongoing LiquidChain presale offers a quantifiable glimpse into this sentiment shift. The $LIQUID presale has raised over $533K, with the token currently priced at $0.0136. The specific appeal of $LIQUID lies in its utility within the ecosystem; it functions not just as a governance token, but as fuel for cross-chain transactions and liquidity staking. The economics here favor early positioning. At $0.0136, the entry point reflects a valuation before the protocol captures mainnet volume. By fusing the three largest liquidity pools, Bitcoin’s deep capital, Ethereum’s DeFi dominance, and Solana’s speed, LiquidChain is theoretically addressing a total addressable market (TAM) in the trillions. It’s not surprising we see it as one of the best crypto presales. Plus, the project’s focus on ‘Liquidity Staking’ aligns with the yield-seeking behavior expected from the incoming wave of compliant capital. Rather than passive holding, the protocol incentivizes the provisioning of cross-chain liquidity, creating a flywheel effect where deeper liquidity attracts more volume, which in turn generates higher staking yields. As McHenry pushes for the regulatory ink to dry in Washington, the on-chain race is to build the rails that can actually handle the traffic. BUY YOUR $LIQUID FROM ITS OFFICIAL PRESALE PAGE This article is for informational purposes only and does not constitute financial advice. Cryptocurrency investments carry high risk. Always perform your own due diligence before investing.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]