[
  {
    "id": 54850819,
    "published": 1764002846000,
    "title": "Rumble Gains 13% After Tether Boosts Stake by 1M Shares",
    "body": "The advance occurred alongside a rally in data center and high-performance computing stocks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Cloud Computing|Tether|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54850721,
    "published": 1764002590000,
    "title": "Grayscale Dogecoin, XRP ETFs Add to Flurry of Altcoin Fund Debuts",
    "body": "New XRP and DOGE ETFs from digital asset focused investment firm Grayscale are now live for trading on NYSE Arca.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "dogecoin||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54851263,
    "published": 1764003641000,
    "title": "Attack On Cardano Founder Leads To Network Halt, What Really Happened?",
    "body": "Cardano faced an unexpected shock when a corrupted transaction aimed at Charles Hoskinson’s personal stake pool caused the network to split for several hours. The incident triggered confusion, exposed weaknesses, and sparked a heated clash over motive and responsibility. Here is how a single action spiraled into a full-scale disruption. Cardano Founder Targeted, Network Shaken The Cardano network faced unexpected disruption on November 21, 2025, after an incident targeting the founder’s personal stake pool. What began as a ‘test’ by a stake pool operator quickly escalated into a risky experiment on the main network, where he reportedly followed unverified AI-generated instructions and submitted a malformed transaction. Related Reading: Analyst Shares Why He’s Not Worried About XRP Price – ‘The Road To Valhala The transaction exploited an obscure 2022 cryptographic library bug, causing newer nodes to parse it incorrectly while older nodes rejected it. This triggered a chain split, disrupted block production, and left validators, DeFi protocols, and everyday users struggling to stay aligned for several hours. The operator later admitted that the entire situation was the result of poor judgment, one he described as a personal challenge he handled recklessly. He insisted he had no financial motives, no collaborators, and no intention to target the founder. His message expressed regret for the disruption caused to stake pool operators and developers who had to react immediately. Many operators lost block rewards, and some decentralized applications experienced inconsistent states. While user funds remained safe, the event revealed how one misstep could trigger a chain-wide disturbance. Hoskinson Says It Was Personal And Months In The Making Despite the stake pool operator claiming no intention of harm, Cardano founder Charles Hoskinson rejected the idea that this was an accidental mistake. He stated that the individual responsible had been active in online groups known for hostility toward Cardano and its leadership. According to him, the attacker had spent months discussing ways to disrupt the project’s operations and reputation. Hoskinson pointed out that his personal pool was the direct target. For him, this proved the act was intentional, not an experiment gone wrong. He emphasized that the disruption touched every user on the network, causing stake pool operators to miss earnings, parts of the DeFi ecosystem to stall, and Cardano developers to be forced into rapid emergency fixes. Related Reading: Barstools Founder Just Made A Million-Dollar Investment In XRP, Does He Know Something? He also stated that law enforcement had already stepped in, turning the event into a criminal matter. In his view, the public apology surfaced only after community investigators linked the operator to the incident and federal involvement became clear. The incident left the community divided between two narratives: one of reckless experimentation and one of calculated sabotage. What remains certain is that a targeted hit—intentional or not—exposed how quickly a malformed transaction can fracture the system and force an entire ecosystem into crisis mode. Cardano recovered, but the questions raised by this attack will continue to shape how the network prepares for the next potential threat. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cardano|ADA|ADA news|ADA price|adausd|ADAUSDT|Cardano news|Cardano price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 206,
        "NAME": "FORKS",
        "CATEGORY": "FORKS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54851601,
    "published": 1764004237000,
    "title": "Crypto Market Mood Lifted as Amazon Pours $50B Into AI Infrastructure",
    "body": "The price of bitcoin jumped back above $87,000 and crypto miners with a focus on AI/high-performance computing are surging.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin Mining|AI|Breaking News|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54851452,
    "published": 1764003994000,
    "title": "Neobank Revolut Boosts Valuation to $75 Billion Ahead of Potential Stablecoin Launch",
    "body": "Revolut’s share sale attracted investors like Fidelity and Franklin Templeton as the neobank continues expanding its crypto offerings.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|matic-network|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54851994,
    "published": 1764005053000,
    "title": "Franklin Templeton Joins XRP ETF Race, Calling It ‘Foundational’ to Global Finance",
    "body": "With XRPZ debuting on NYSE Arca, Franklin becomes the latest financial heavyweight betting on crypto’s future in global payments.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|XRP News|Franklin Templeton|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54852316,
    "published": 1764005710000,
    "title": "HBAR Gains 2.4% From Major Support as Axelar Integration Drives DeFi Activity",
    "body": "Volume surge validates advance despite token's underperformance versus broader crypto market rally.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 81,
        "NAME": "HBAR",
        "CATEGORY": "HBAR"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54853570,
    "published": 1764008134000,
    "title": "Stellar Climbs 3.5% to $0.25 as Technical Recovery Gains Momentum",
    "body": "Network fundamentals improved alongside price action as token demonstrated resilience following recent consolidation period.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54853614,
    "published": 1764007785000,
    "title": "Stand With Crypto to vet 2026 candidates on digital asset positions",
    "body": "After the crypto industry’s success in influencing the 2024 US elections, an advocacy group announced plans to continue its efforts for the 2026 midterms.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54853337,
    "published": 1764007584000,
    "title": "Crypto Analyst Who Called Bitcoin's Top Now Says It's Time To Buy",
    "body": "The analyst who warned clients against buying bitcoin at $120k says current prices present a buying opportunity, even as industry veterans turn bearish on 2025.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54854053,
    "published": 1764009048000,
    "title": "XRP Real Purpose: Documentation Shows Payment Utility Contrary To Viral Claims — Details",
    "body": "The viral claims suggesting that XRP has no connection to payments are quickly falling apart under a basic review of official documentation. As misinformation spreads across social platforms, the publicly available documentation continues to reinforce the asset’s real, payment-centric utility, contradicting the narrative gaining traction online. How Documentation Debunks The XRP Role Speculation In an X post, a researcher known as SMQKE has revealed that the narrative claim that XRP is just a cryptocurrency with no connection to traditional finance payments is sharply contradicted by the documentation that defines the asset. A surface-level review has already shown just how inaccurate that statement is. Related Reading: Something Big Coming For XRP? Ripple Engineer Reveals Major Development According to SMQKE, unlike many cryptocurrencies built purely for decentralized experimentation, XRP was designed to operate within the existing traditional finance system. The report highlights that XRP was intended to enhance international money transfers by serving as a neutral bridge between currencies and providing liquidity. Furthermore, the documentation also shows that XRP is a digital asset engineered specifically to address long-standing inefficiencies in the traditional payment system. The conversation around RippleNet isn’t about experiments. Crypto analyst Xfinancebull highlighted that more than 300 banks are not testing RippleNet; they are partnering with it. Brad Garlinghouse isn’t speaking in vague possibilities; instead, he is forecasting where XRP could capture up to 14% of current SWIFT volume by 2030, which is an estimated $21 trillion in annual value moving across the XRP Ledger infrastructure. His focus is not on the chart price movements. It’s about how global financial plumbing is being re-engineered in real-time. The idea centers on a system where banks could settle cross-border transactions instantly 24/7, with lower operational fees, all powered by XRP. From this perspective, the transformation is being built. While the retail traders often react to every red candle, the institutions are entering partnerships and signing integrations. “You don’t buy XRP for today. You buy it for the financial world that is coming,” Xfinancebull noted. Major Capital Shifts From Observing To Building A recent move from Ripple has shifted conversations entirely. XFBAcademy has pointed out that banks didn’t raise $500 million to reshape the future of money, but Ripple did. Moves like this indicate exactly why the long-term outlook around XRP will continue to build strength. Meanwhile, real utility is finally being funded at the highest institutional levels. Related Reading: Ripple Exec Addresses Tax Issue On XRP Ledger, Where Does It Go? XFBAcademy explains that when names like Fortress, Citadel, Pantera, Brevan Howard, and Galaxy participate simultaneously, it’s not speculation, but a signal where infrastructure is heading. This raise isn’t fueled by speculative propaganda. Instead, it is tied to RLUSD, institutional rails, and the treasuries moving into on-chain. This kind of capital doesn’t chase existing narratives but actively builds new ones. The expert frames moments like these as the real turning points. These are the junctures when the smartest money transitions from observation to funding the new plumbing of global finance. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|Brevan Howard|Citadel|fortress|galaxy|pantera|Ripple|RippleNet|RLUSD|SMQKE|swift|XFBAcademy|XFinanceBull|xrp|XRP Ledger|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54854363,
    "published": 1764009440000,
    "title": "Ondo turns to Figure’s stablecoin with $25M investment to back tokenized fund",
    "body": "The purchase broadens Ondo Finance’s onchain Treasury reserves and comes amid a renewed push into crypto-backed lending across fintechs, lenders and exchanges.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 108,
        "NAME": "ONDO",
        "CATEGORY": "ONDO"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54855015,
    "published": 1764010786000,
    "title": "5 Reasons Why Bitcoin Crashed—And Why It Could Fall Further: Deutsche Bank",
    "body": "Bitcoin crashed from $121K to $82K—Deutsche Bank explains the five factors behind the 32% plunge and uncertain recovery ahead.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54854825,
    "published": 1764010497000,
    "title": "Celestia’s TIA Token Rises as ‘Matcha’ Upgrade Preps Network for Cross-Chain Future",
    "body": "The event is being called its biggest software upgrade yet, which boosts the network’s capacity and improves token economics.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Celestia|Celestia labs|Tia|Upgrade|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 118,
        "NAME": "TIA",
        "CATEGORY": "TIA"
      }
    ]
  },
  {
    "id": 54854641,
    "published": 1764009440000,
    "title": "Ondo turns to Figure’s stablecoin with $25M investment to back tokenized fund",
    "body": "The investment broadens Ondo Finance’s onchain Treasury reserves and comes amid a renewed push into crypto-backed lending across fintechs, lenders and exchanges.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 108,
        "NAME": "ONDO",
        "CATEGORY": "ONDO"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54855273,
    "published": 1764011384000,
    "title": "CME Crypto Futures Volume Hits Record 795K Contracts Amid Volatility",
    "body": "A surge in institutional and retail demand has pushed CME’s crypto average daily volume up 132% year-over-year, with open interest climbing 82%.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|CME Futures|Cryptocurrency Derivatives|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54855888,
    "published": 1764012483000,
    "title": "Monad's $105 Million Airdrop Underwhelms Speculators as Token Debuts Near Sale Price",
    "body": "Monad completed its long-awaited airdrop of MON tokens on Monday, giving recipients over $100 million worth of cryptocurrency.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 204,
        "NAME": "AIRDROP",
        "CATEGORY": "AIRDROP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54856802,
    "published": 1764014403000,
    "title": "Analyst Who Predicted Bitcoin Price Action With Chinese Astrology Shares When Prices Will Surge",
    "body": "Crypto analyst Crypto Waterman, who predicted the Bitcoin price action with Chinese Astrology, has revealed when the flagship crypto will surge alongside altcoins. This comes as BTC looks to rebound from its recent crash to as low as $81,000. Analyst Reveals When The Bitcoin Price Will Surge In an X post, Crypto Waterman predicted that the Bitcoin price would surge from December 5 after it bottoms between November 28 and 29, when Mercury retrograde ends. He further remarked that there will be high swings up and down between November 29 and December 5, noting that the current market action is similar to mid-July 2021 in the previous cycle. Related Reading: Analyst Who Sold Bitcoin At $102,000 Predicts Crash To $40,000, But There’s Something Else The crypto analyst stated that the Bitcoin price rise will happen from December 5 to December 18 for two weeks, with the relief rally sending BTC to between $100,000 and $110,000. Once that happens, he predicts a three-week dip from December 18 to January 6, which will push BTC down to between $90,000 and $100,000. After the dip, Crypto Waterman predicts that the Bitcoin price will rise from December 6 to mid-February, hitting a new all-time high (ATH) during that period. He expects the flagship crypto to rally to between $140,000 and $145,000. Notably, the crypto analyst has so far accurately predicted the November BTC price action, which he claimed was with the help of Chinese astrology. Based on this, the crypto analyst is confident that the Bitcoin price is about to have its final leg in this bull market cycle. He also expects altcoins to witness one final rally to the upside, predicting that altseason should happen between January and February. Crypto Waterman also revealed that he plans to exit most of his bags in mid-February or the beginning of March as the market enters the horse year. ‘Too Early’ To Call For New ATH Crypto analyst Colin has indicated that it is too early to predict that the Bitcoin price could reach a new all-time high. This follows the recent BTC rebound from its lows of around $81,000 last week. The analyst explained that a bounce was inevitable after the flagship crypto was so oversold. However, he isn’t flipping macro bullish on expecting a new ATH too quickly. Related Reading: Bitcoin To Suffer 40% Crash From All-Time High? Analyst Reveals ‘Final Target’ The analyst further remarked that such a bounce says nothing about new ATHs and that BTC must reclaim major key levels well above current levels to have a chance of reaching new ATHs. He added that he expects the Bitcoin price to reach $100,000 on this bounce, but that won’t mean that a new ATH is in sight. At the time of writing, the Bitcoin price is trading at around $87,500, up almost 2% in the last 24 hours, according to data from CoinMarketCap. Featured image from Pngtree, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|altcoins|altseason|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|Chinese Astrology|CoinMarketCap|Colin|Crypto Waterman",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54856695,
    "published": 1764014236000,
    "title": "TON Rallies 8% as Telegram Ecosystem Expands With AI Launch, Tokenized Stocks",
    "body": "Recent developments include the launch of Confidential Compute Open Network (COCOON) and the integration of tokenized US stocks and digital collectibles.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|TON|Technical Analysis",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 98,
        "NAME": "TON",
        "CATEGORY": "TON"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54856993,
    "published": 1764014400000,
    "title": "Bitcoin data calls $80K the bottom, analysts say BTC bulls are back",
    "body": "One analyst said that Bitcoin’s dip to $80,000 marked the bottom and that there is a 91% chance that the current trend reversal will send BTC price back to $118,000.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54857507,
    "published": 1764015753000,
    "title": "XRP jumps 8% as Franklin Templeton, Grayscale ETFs begin trading",
    "body": "The investment vehicle tied to XRP launched amid other offerings from Grayscale, Bitwise Asset Management and Canary Capital.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54858707,
    "published": 1764018294000,
    "title": "Revolut hits $75B valuation following share sale, global push",
    "body": "Revolut has completed a private share sale with participation from major investment firms. The transaction also allowed employees to sell shares.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54860536,
    "published": 1764022448000,
    "title": "XRP, SUI Lead Crypto Rebound as Bitcoin Tops $89K; Relief Rally Faces $100K Wall, Trader Says",
    "body": "Traders now see a December rate cut increasingly likely, following fresh comments from San Francisco Fed President Mary Daly.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Market Wrap|Digital Asset Treasury|Federal Reserve|Wintermute|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 96,
        "NAME": "SUI",
        "CATEGORY": "SUI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54860460,
    "published": 1764022190000,
    "title": "Stablecoins Could 'Pose Stability Risks,' ECB Says in Latest Warning",
    "body": "The ECB reiterated its worries that the rapid growth of digital tokens could unsettle the wider financial system.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 54861197,
    "published": 1764023670000,
    "title": "XRP Jumps as Franklin Templeton Debuts Latest Crypto ETF",
    "body": "The Franklin XRP fund comes less than two weeks after the successful start of a Canary Capital XRP ETF.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54861874,
    "published": 1764025223000,
    "title": "CEO Reveals Ripple’s XRP Is Driving A JPMorgan Competitor, Is SWIFT Next?",
    "body": "The Chief Executive Officer (CEO) of Teucrium Trading, Sal Gilbertie, has given a bold endorsement of Ripple and XRP, positioning the crypto payments company as a potential competitor to JPMorgan Chase. He described Ripple as a highly interconnected ecosystem that could scale globally once it acquires a banking license. As Ripple grows to challenge the largest bank in the US, it raises the question about how its rapidly expanding network could also rival legacy banking systems like SWIFT. Ripple Positioned As New JPMorgan And SWIFT Rival Crypto enthusiast and XRP advocate Diana recently shared a striking interview between Paul Barron, founder of the Paul Barron Network, and Gilbertie. In the interview, the Teucrium Trading CEO shared his perspective on Ripple, showing full support for the crypto payment company’s growth and future potential. Related Reading: Ripple CEO Predicts XRP Rush, What Does He Mean? He explained that Ripple is actively building a fully operational financial institution capable of rivaling traditional banking giants like JPMorgan. The crypto payments company has also frequently been described as a competitor to SWIFT, positioning itself as a faster and more efficient alternative for cross-border payments. Gilbertie stressed that once Ripple obtains a banking license, it would operate with the capitalization and operational discipline typically associated with top-tier banks. Notably, the crypto payments company has been seeking a US national banking charter from the Office of the Comptroller of the Currency (OCC) to establish a new national trust bank. If authorized, Ripple could become one of the first crypto-native companies to obtain a US national bank license. Moving forward, Gilbertie said during the interview that XRP lies at the heart of this growing banking ecosystem. He noted that Ripple has no intention of selling XRP, describing the cryptocurrency as a strategic asset whose value is intended to appreciate over time through its use across the XRPL ecosystem. The Teucrium Trading CEO also called Ripple a “machine,” highlighting how the company operates in a disciplined, coordinated way, with its team growing and innovating while keeping the network strong and connected. Furthermore, he boldly claimed that Ripple is at the center of the universe, underscoring its pivotal role in potentially shaping the global banking landscape. Gilbertie’s Validation Confirms XRP’s Role The interview between Gilbertie and Barron drew strong, supportive reactions from many members of the crypto community, who interpreted the Teucrium Trading CEO’s statement as validation of XRP’s evolving role in institutional finance. Observers noted that hearing a regulated TradFi CEO describe Ripple as a JPMorgan rival offered rare institutional recognition that went beyond the usual industry speculation. Related Reading: Ripple Exec Addresses Tax Issue On XRP Ledger, Where Does It Go? They also pointed out that the timing of this endorsement coincides with the upcoming full enforcement of ISO 20022 standards and rising XRP ETF inflows. Diana, the XRP advocate who shared the interview, echoed this view, emphasizing that Gilbertie’s statements signal that infrastructure, compliance, and institutional interest are all aligning. She noted that price movements typically follow institutional and infrastructure rails, suggesting that XRP may be positioned for substantial growth once these rails are fully in place. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|Diana|ISO 20022 Standard|jpmorgan|occ|Office of the Comptroller of the Currency|Paul Barron|Paul Barron Network|Ripple|ripple news|Sal Gilbertie|swift|Teucrium Trading|TradFi|xrp|XRP Ledger|xrp news|XRP Price|XRPL|XRPL Ecosystem|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54863613,
    "published": 1764028827000,
    "title": "XRP Hits Exact Bull Target as Top Traders Celebrate Perfect Market Call",
    "body": "XRP’s market momentum accelerated this week as the cryptocurrency hit a key bullish target identified by a prominent trader, reinforcing growing confidence across the community. Related Reading: Will The Low XRP Price Force Ripple To Dump Its Holdings? Exec Answers Community The surge comes amid a wave of institutional inflows, multiple ETF launches, expanding utility, and renewed optimism from analysts who believe XRP is entering a powerful new phase of market participation. XRP's price trends to the downside on the daily chart. Source: XRPUSD on Tradingview Technical Breakout: Bull Flag Target Achieved A precise technical call from trader @kriptocumm caught the attention of XRP traders after the asset reached the exact bull flag target he outlined earlier in the week. KripTocuM’s analysis, shared on November 22, identified a textbook flag pattern with support at $1.8810 and a breakout requirement above $1.92. Using the pole height of roughly $1.37 added to the breakout point, he calculated a target of $2.1076. On November 24, XRP rallied past $2, coming within striking distance of the projected level, before stabilizing near $2.055. Trading volume jumped to $3.85 billion, reflecting heightened market participation and validating the breakout structure. Indicators remained tilted bullish, with RSI at 62 and a positive MACD crossover suggesting further upside potential. XRP ETF Momentum Pushes Institutional Demand Higher XRP’s move arrives during one of its strongest weeks of institutional interest to date. Franklin Templeton’s newly approved spot XRP ETF (XRPZ) debuted on the NYSE with projected first-day volumes of up to $30 million. The fund’s aggressive fee-waiver strategy, 0% on the first $5 billion until May 2026, has already drawn investor attention. Grayscale also launched its XRP Trust ETF (GXRP) with a temporary 0% fee, expanding access for traditional market participants seeking regulated exposure. Both products entered the market as XRP recorded $179.6 million in weekly inflows, sharply contrasting heavy outflows from Bitcoin and Ethereum ETFs. Analysts say this rotation signals a shift toward altcoins with clearer catalysts and strengthening fundamentals. Analysts See Expanding Utility and Long-Term Upside Growing utility narratives continue to enhance XRP’s appeal. CryptoSensei recently reiterated explosive price projections, conditional on supply constraints, while pointing to rising institutional adoption, expanding treasury use, and new stablecoin-related integrations as key pillars for long-term growth. Meanwhile, Ripple’s new Asian banking partnership and ongoing XRPL scalability upgrades are adding further confidence to XRP’s fundamental outlook. Related Reading: Dogecoin Just Replicated This Bullish Trend For The 3rd Time, Can Price Still Reach $1? With momentum building on both technical and institutional fronts, traders now look toward the next major resistance levels as the market gauges whether XRP can sustain its powerful new trend. Cover image from ChatGPT, XRPUSD on Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ripple|xrp|XRP Price|XRP Price Analysis|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54864576,
    "published": 1764030662000,
    "title": "Bitcoin Heist: Family Members Waterboarded, Sexually Assaulted as Attackers Steal $1.6 Million",
    "body": "Horrific details of a Bitcoin wrench attack in Canada were revealed, with victims held hostage, waterboarded, and sexually assaulted.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54864378,
    "published": 1764030301000,
    "title": "SEC Clears Fuse Energy Token in Win for US Crypto ‘Regulatory Clarity’",
    "body": "The SEC has granted no-action relief to Fuse’s rewards token, saying its value stems from consumer use rather than investment potential.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 54865360,
    "published": 1764032421000,
    "title": "63K Bitcoin Exits Long-Term Wallets: A Surge of Speculative Short-Term Buying",
    "body": "Bitcoin is struggling to reclaim momentum as it trades below the critical $90,000 level, with selling pressure dominating the market and fear spreading rapidly. Many analysts are leaning toward calling the start of a new bear market, arguing that Bitcoin likely topped in early October near $126,000. Momentum has weakened sharply since then, and investor behavior now reflects a shift toward risk-off positioning. Related Reading: Anti-CZ Whale Loses Big: $61M in Profit Wiped Out As Ethereum and XRP Longs Collapse A new report from CryptoOnchain, published via CryptoQuant, highlights one of the most significant developments of this cycle: a historic 63,000 BTC has moved from long-term holders (LTHs) to short-term holders (STHs). This unprecedented transfer is clearly visible in the Long-Term Holder Net Position Change chart, which shows a massive red bar — a negative daily difference signaling heavy outflows from long-term holder wallets. This type of behavior typically appears during late-stage bull markets or near local and cycle tops, when long-time investors with substantial profit margins begin realizing gains. At the same time, the corresponding Short-Term Holder Net Position Change chart shows a huge green bar, confirming that newer, more reactive market participants are buying these coins, often at elevated prices. Long-Term Holders Distribute as Short-Term Buyers Absorb Supply CryptoOnchain explains that the current market structure is being shaped by a clear divergence in behavior between Long-Term Holders (LTHs) and Short-Term Holders (STHs). LTHs — historically considered the “strong hands” of the market — are now heavily distributing, sending large amounts of Bitcoin into the market after months or even years of holding. At the same time, STHs are aggressively buying and accumulating this supply, often entering positions at elevated prices despite growing volatility. This dynamic is not inherently a bearish signal on its own. In fact, such transitions are common during late-stage bull markets, where early investors secure profits while new participants enter the market with fresh capital. It reflects a natural rotation of supply from experienced holders to newer ones, a pattern seen repeatedly in previous cycles. However, the volume of distribution is significant, and it raises an important risk: if incoming demand fails to fully absorb the coins being offloaded by LTHs, the market could face a deeper correction or extended consolidation phase. This supply pressure can weigh on price, especially in a context where sentiment is fragile and macro conditions remain uncertain. Related Reading: STH Panic Emerges as Bitcoin Crashes To $81K: Realized P/L Turns Negative For The First Time This Cycle Weekly Chart Signals a Critical Retest of Macro Support Bitcoin is attempting to stabilize around the $87,000 level after an intense multi-week sell-off that dragged price as low as $85,946. On the weekly chart, Bitcoin has now tapped the 100-week moving average (green line), a historically important support level during bull-market retracements. This line acted as a springboard in previous cycles, but the current bounce remains weak and indecisive, reflecting the fear dominating the market. Momentum has clearly shifted bearish. The breakdown from the $110K–$100K consolidation zone triggered accelerated selling, confirming a loss of market structure on the weekly timeframe. Candles over the past three weeks show high-volume distribution, with sellers overwhelming demand each time Bitcoin attempted to reclaim higher levels. The steep slope of the 50-week MA turning slightly down is another sign that trend strength has softened. Related Reading: Bitcoin OG Owen Gunden Deposits Final 2,499 BTC ($228M) to Kraken – Details However, the reaction at the 100-week MA is critical. Bulls aggressively defended this area in prior macro corrections, and holding above $83K–$86K keeps the long-term bull structure intact. A weekly close below this zone, however, opens the door to deeper downside toward the 200-week MA near $56K–$60K. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|Bitcoin Long-Term Holder|Bitcoin news|Bitcoin Short-Term Holder|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54865239,
    "published": 1764032170000,
    "title": "Solana Approaches $140 As Crypto Markets Regain Momentum",
    "body": "Solana prices rallied sharply on Monday, November 24, climbing to almost $140 as the crypto markets seemingly bounced back.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54866999,
    "published": 1764036052000,
    "title": "HBAR Price Pumps on Strong ETF Inflows, But Technical Risks Still Loom",
    "body": "Hedera (HBAR) is kicking off the week with a strong burst of momentum, climbing more than 5% in the past 24 hours to trade around $0.14. Related Reading: Will The Low XRP Price Force Ripple To Dump Its Holdings? Exec Answers Community The wider crypto market is finally flashing green, but the HBAR price is clearly outpacing the pack thanks to a wave of institutional interest, rising ETF inflows, and growing excitement ahead of Coinbase’s futures launch. Still, despite the bullish sentiment, chart signals warn that the token isn’t out of danger just yet. HBAR's price trends to the downside on the daily chart. Source: HBARUSD on Tradingview ETF Inflows, Futures Launch Fuel the Rally The sudden HBAR price acceleration comes at a moment when multiple catalysts are stacking in its favor. Trading volume has surged by more than 190%, pushing Hedera into the top gainer bracket of the day. A major driver is Coinbase’s upcoming rollout of 24/7 HBAR futures trading on December 5, which opens the door for more institutional hedging, speculation, and liquidity. The ETF space is also turning increasingly supportive. Canary Capital’s HBAR ETF has boosted its holdings to over 421 million HBAR, now valued at nearly $55 million, after three straight sessions of positive net inflows. Since its launch, the ETF has attracted over $72 million, a rare trend during a period when other major crypto funds, particularly those focused on Bitcoin and Ethereum, have experienced significant outflows. Additionally, the IRS’s new stance allowing staking inside ETFs and the SEC’s updated listing standards have brightened the long-term outlook for HBAR-based investment products. Meanwhile, real-world adoption narratives are strengthening thanks to Wyoming’s stablecoin pilot on Hedera and tokenized ETF assets deployed. HBAR Price Bullish Setup, But Still Below Key Trendlines Technically, the HBAR price is showing early signs of a possible reversal. Analysts highlight a triple bottom pattern forming around the $0.123 zone, an area buyers have defended multiple times this year. Rising futures open interest and an improving long/short ratio add to the bullish backdrop. However, Hedera remains trapped beneath a dominant descending trendline that has rejected every rally since September. The 20-day EMA at $0.155 continues to cap upside attempts, while the 50- and 100-day EMAs reinforce heavy resistance above. Momentum indicators have improved, but the broader trend remains bearish unless the HBAR price decisively breaks above $0.155. Short-Term Outlook: Cautious Optimism If buyers maintain pressure, the HBAR price could retest the $0.16–$0.18 region. A clean breakout above the falling channel would set the stage for a larger move toward $0.228, the neckline of the triple bottom. But failure to overcome resistance keeps the token vulnerable to retracements toward $0.14, then $0.125, and potentially $0.10 if bearish momentum resurfaces. Related Reading: Dogecoin Just Replicated This Bullish Trend For The 3rd Time, Can Price Still Reach $1? For now, ETF demand and growing futures interest are providing Hedera with a welcome boost; however, the technical challenges ahead remain difficult to ignore. Cover image from ChatGPT, HBARUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|HBAR|Hedera",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 81,
        "NAME": "HBAR",
        "CATEGORY": "HBAR"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54867331,
    "published": 1764036835000,
    "title": "Musk Says Real-World Data From X and Tesla to Drive AGI Efforts",
    "body": "SpaceX's CEO, Elon Musk, said Tesa’s fleet and X’s live data are providing him with training inputs that competitors lack.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54867434,
    "published": 1764037096000,
    "title": "Asia Morning Briefing: BTC Steadies as Polymarket Traders Lean Toward December Rate Cut",
    "body": "Rising odds of a Fed pivot helped calm crypto markets, while QCP and Glassnode point to a reset in leverage, fading sell pressure, and early signs of a bottoming structure as traders hedge both downside and late-year upside.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|btc|ETH|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54868108,
    "published": 1764038537000,
    "title": "South Korea’s Upbit parent plans US IPO after Naver merger: Report",
    "body": "US investors could soon get exposure to South Korea’s active crypto market, as crypto exchange Upbit’s parent company, Dunamu, reportedly eyes a Nasdaq listing.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54869225,
    "published": 1764041067000,
    "title": "Binance Faces Fresh Lawsuit Over Alleged Hamas Transactions",
    "body": "A court filing claims Binance’s structure and controls let users tied to U.S.-designated terrorist groups move funds through its exchange.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54869710,
    "published": 1764042037000,
    "title": "SEC issues ‘rare’ no-action letter for Solana DePIN project token FUSE",
    "body": "It comes several months after the SEC issued a similar no-action letter to DoubleZero, seen as a significant regulatory milestone for DePIN projects.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54869514,
    "published": 1764041695000,
    "title": "Bitcoin Approaches $90,000 After Bloodbath Ends",
    "body": "Bitcoin prices have climbed to almost $90,000 after the digital currency’s downward trend, which brought it to several local lows, seemingly ground to a halt.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54870487,
    "published": 1764043626000,
    "title": "BitMine, Strategy, SharpLink stocks outpace crypto market recovery",
    "body": "Digital asset treasury stocks surged on Monday, led by BitMine, even outpacing the broader crypto market’s gains as institutional ownership increased.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54870692,
    "published": 1764044286000,
    "title": "XRP Price Spikes Over 10% With Traders Rushing Back Into the Rally",
    "body": "XRP price started a steady increase above $2.20. The price is now consolidating gains and might aim for another increase if it stays above the $2.180 level. XRP price started a fresh increase above the $2.120 zone. The price is now trading above $2.20 and the 100-hourly Simple Moving Average. There was a break above a key bearish trend line with resistance at $2.00 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move up if it clears $2.280. XRP Price Gains Momentum XRP price started a decent upward move above $2.020 and $2.050, beating Bitcoin and Ethereum . The price gained pace for a clear move above the $2.120 resistance. Besides, there was a break above a key bearish trend line with resistance at $2.00 on the hourly chart of the XRP/USD pair. The pair even surpassed the $2.20 barrier. A high was formed at $2.286 and the price started a consolidation phase above the 23.6% Fib retracement level of the upward move from the $1.817 swing low to the $2.286 high. The price is now trading above $2.20 and the 100-hourly Simple Moving Average. If there is a fresh upward move, the price might face resistance near the $2.280 level. The first major resistance is near the $2.320 level, above which the price could rise and test $2.350. A clear move above the $2.350 resistance might send the price toward the $2.4620 resistance. Any more gains might send the price toward the $2.50 resistance. The next major hurdle for the bulls might be near $2.550. Another Decline? If XRP fails to clear the $2.280 resistance zone, it could start a fresh decline. Initial support on the downside is near the $2.180 level. The next major support is near the $2.080 level. If there is a downside break and a close below the $2.080 level, the price might continue to decline toward $2.050 and the 50% Fib retracement level of the upward move from the $1.817 swing low to the $2.286 high. The next major support sits near the $2.020 zone, below which the price could continue lower toward $1.9250. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $2.180 and $2.080. Major Resistance Levels – $2.280 and $2.320.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54873633,
    "published": 1764050410000,
    "title": "Tether, the gold whale",
    "body": "Gilty by association",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54873589,
    "published": 1764050405000,
    "title": "JPMorgan’s Alleged Short On Strategy (MSTR): How A 50% Price Jump Could Spell Major Troubles",
    "body": "Strategy, formerly known as MicroStrategy, the largest public holder of Bitcoin (BTC), finds itself at the center of a stormy controversy involving JPMorgan as Bitcoin prices continue to struggle. With signs of a potential bear market emerging, fresh rumors suggest that one of the world’s largest banks allegedly holds a significant short position on Strategy’s stock (MSTR), which has plunged 69% from its record high of $543 per share last year. Strategy Faces Potential MSCI Exclusion The turmoil escalated last week when JPMorgan issued a warning that Strategy might soon be removed from major equity indices, specifically the MSCI USA Index. JPMorgan’s analysts noted that the issues facing Strategy extend beyond the recent downturn in cryptocurrency prices, which have seen Bitcoin fall more than 30% from its all-time highs. As of this writing, Bitcoin is trading around $86,000, while the broader crypto market has experienced a staggering $1 trillion decline in total market capitalization over the past month. Related Reading: Why XRP Price Crash Below $2 Is Not A Problem – $20 Is Still The Target JPMorgan’s analysts indicated that MSCI is considering whether companies with over 50% of their total assets in digital currencies should qualify for inclusion in traditional equity indices. Given that Strategy’s balance sheet is heavily weighted with Bitcoin, it is at significant risk of exclusion. The analysts stated that “MicroStrategy [is] at risk of exclusion from major equity indices as the January 15th MSCI decision approaches.” They speculated that removal from the MSCI could trigger approximately $2.8 billion in outflows, and if other index providers follow MSCI’s lead, the total could reach as high as $8.8 billion. The situation is complicated by market dynamics, particularly the timing of JPMorgan’s bearish note, which coincided with Bitcoin’s weakness and MSTR’s decline, all while liquidity was thin and overall sentiment fragile. JPMorgan Faces Account Closures Surge According to analysts at the Bull Theory, JPMorgan has been noted for timing its market reports—bearing down when prices are already weak and striking a more bullish tone near market peaks. The analysts have highlighted that share lending for MSTR has reportedly increased, allowing brokers to lend shares to short sellers, which can exacerbate downward pressure on the stock price. Additionally, there are escalating reports of widespread account closures at JPMorgan, with thousands claiming to have exited due to perceived manipulation of both MSTR and Bitcoin. Related Reading: A Quiet Move In Bitcoin Options Is Starting To Raise Big Questions Amid these developments, the fear of a potential short squeeze is growing. The analysts believe that if Strategy’s stock were to rally around 40% to 50%, it could trigger a short squeeze in the bank’s position and spell major financial troubles. In response, Michael Saylor, the CEO of Strategy, has sought to clarify the company’s identity, emphasizing that it is not just a passive Bitcoin holder. He pointed out that Strategy operates as a software business with an active financial strategy, countering the narrative circulating around MSCI’s concerns. As the situation unfolds, several key points emerge. The October 10th crash appeared to align with the MSCI announcement, coinciding with an already fragile market state. JP Morgan’s strategic timing of its bearish insights has amplified existing fears, creating further uncertainty as MSCI’s final decision looms. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|btc|jpmorgan|JPMorgan news|Microstrategy|MicroStrategy Bitcoin|MicroStrategy news|MSTR|Strategy",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54873322,
    "published": 1764018294000,
    "title": "Revolut hits $75B valuation following share sale, global push",
    "body": "Revolut completed a private share sale with participation from major investment companies. The transaction also allowed employees to sell shares.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54873859,
    "published": 1764050673000,
    "title": "‘OG whale’ who called the October crash has a $44.5M long on Ether",
    "body": "The Hyperliquid whale that made $200 million in the October crash has just added another $10 million to its long position on Ether.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54873858,
    "published": 1764050619000,
    "title": "Crypto VC activity hits $4.6B in Q3, second-best quarter since FTX collapse",
    "body": "Half of the capital raised in the third quarter was from seven venture deals, with Revolut leading the way with a $1 billion investment.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54873746,
    "published": 1764014400000,
    "title": "Bitcoin data calls $80K the bottom as analysts say BTC bulls are back",
    "body": "One analyst said Bitcoin’s dip to $80,000 marked the bottom and that there was a 91% chance the current trend reversal would send BTC price back to $118,000.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54874429,
    "published": 1764051991000,
    "title": "XRP Surges 7% in Strongest Breakout in Weeks as Ripple Linked ETFs Go Live",
    "body": "Technical indicators suggest a bullish trend, with XRP testing a major descending channel that could lead to further gains.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54874853,
    "published": 1764052835000,
    "title": "DOGE Pops 5% as ETF Debut Sparks First Clear Reversal Signal in Weeks",
    "body": "ETF analysts characterized the launch as another major inflection point for memecoin legitimacy, with early volume estimates near $11 million.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Dogecoin Foundation|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54876159,
    "published": 1764055893000,
    "title": "Japan’s FSA to Mandate Liability Reserves for Crypto Exchanges to Enhance Security",
    "body": "Japan's Financial Services Agency is set to require digital asset exchanges to maintain liability reserves to protect users.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Japan|digital assets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54876893,
    "published": 1764057611000,
    "title": "Latest Crypto Crash Wipes $1 Billion Off Trump Family’s Wealth",
    "body": "The recent downturn in the crypto market, which saw total valuations plummet from an all-time high of nearly $4.3 trillion to below the $3 trillion mark, has severely impacted many investors. Among those affected is the Trump family, whose wealth reportedly decreased by $1 billion over the past month, according to Bloomberg. Their current net worth now stands at approximately $6.7 billion, down from $7.7 billion in September. Trump Family’s Crypto Portfolio Takes Major Hits The family’s crypto portfolio has suffered significant losses as a result of recent market conditions, including President Trump’s official memecoin, TRUMP, Eric Trump’s Bitcoin (BTC) mining firm, American Bitcoin (ABTC), and Truth Social—all of which are Bitcoin-related. Related Reading: XRP Real Purpose: Documentation Shows Payment Utility Contrary To Viral Claims — Details One of the hardest-hit entities is Trump Media & Technology Group (TMTG), the parent company of Truth Social. Last week, shares of the firm dropped to a record low, resulting in an estimated $800 million decline in Trump’s stake since September. The company has invested heavily in Bitcoin, spending roughly $2 billion on digital assets. Its stockpile of approximately 11,500 BTC, purchased when Bitcoin prices hovered around $115,000, now represents a significant downturn of about 25%. In addition, World Liberty Financial (WLFI), regarded as the Trump family’s principal crypto operation, has seen its value diminish rapidly. WLFI, which was once trading at $0.26, has now fallen to around $0.15 when writing. At its peak, the token’s total valuation reached about $6 billion, but it is now worth just over $4 billion. Despite the difficulties, a spokesperson for World Liberty Financial expressed optimism, stating that “Crypto is here to stay.” The spokesperson emphasized a long-term conviction in the technologies that support digital assets, suggesting that these innovations could transform financial services. Eric Trump Remains Optimistic Following his return to office in January, President Trump’s sons, Eric Trump and Donald Trump Jr., also began collaborating with Hut 8 Corp, a crypto company that supplies Bitcoin mining equipment. In exchange, they secured a controlling interest in a newly formed organization called American Bitcoin Corp. Eric Trump reportedly holds about 7.5% of this new venture. Related Reading: Attack On Cardano Founder Leads To Network Halt, What Really Happened? However, shares of Hut 8, which are traded on Nasdaq, have been cut by nearly half, wiping out over $300 million from Eric Trump’s wealth since September, with shares previously valued at $9.31. Amidst these financial challenges, Eric Trump conveyed a sense of optimism, suggesting that the recent market declines may present “a great buying opportunity.” He emphasized that those who purchase during downturns and embrace market volatility are likely to be the long-term winners in the cryptocurrency landscape. Currently, the market’s leading cryptocurrency has seen a 1.5% recovery on Monday toward $88,430, after reaching an 8-month low of $80,000 last Friday. This positions BTC nearly 30% below all-time highs of $126,000 reached back in October. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|btc|BTC news|btc price|BTCUSDT|crypto|crypto market|crypto news|cryptocurrency|Donald Trump|Donald Trump news|Eric trump|Trump family's crypto portfolio",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54877083,
    "published": 1764057795000,
    "title": "Exodus taps Bitcoin holdings to fund $175M move into onchain payments",
    "body": "Exodus is using its Bitcoin reserves to back a $175 million acquisition of W3C Corp, bringing Monavate and Baanx under its roof as it expands into onchain payments.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54881017,
    "published": 1764066715000,
    "title": "UAE’s new financial law pulls DeFi and Web3 into regulatory scope",
    "body": "Federal Decree Law No. 6 expands the UAE central bank’s authority over DeFi, ending the “just code” defense and imposing penalties of up to $272 million.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 54881734,
    "published": 1764068412000,
    "title": "Bitcoin To $40,000? Signal Behind Past 60% Crashes Is Back",
    "body": "A cryptocurrency analyst has pointed out how a technical analysis (TA) signal that led into major price declines in the past has returned for Bitcoin. Monthly MACD Has Turned Bearish For Bitcoin In a new post on X, analyst Ali Martinez has talked about a signal that has formed in the Moving Average Convergence/Divergence (MACD) for Bitcoin. MACD is a TA indicator that’s generally used for timing buys and sells in an asset’s price chart. Related Reading: USDC Floods Exchanges: Are Traders Buying The Bitcoin Crash? The indicator consists of two lines: MACD line and signal line. The first of these, the MACD line, is found by subtracting the 26-period exponential moving average (EMA) of the price from its 12-period EMA. The signal line tracks the 9-period EMA of this difference. Crossovers between the two lines can provide buy or sell signals for the asset. The MACD line breaking above the signal line could be considered a bullish signal, while the reverse type of crossover a bearish one. Now, here is the chart shared by Martinez that shows how the monthly MACD has changed for Bitcoin over the last several years: As displayed in the above graph, the Bitcoin MACD has registered a crossover recently. The MACD line has plunged as the asset has witnessed its bearish momentum and it’s now sitting under the signal line. As mentioned earlier, such a signal can be a bearish one. In the chart, the analyst has highlighted the past instances of this pattern. It would appear that the last three sell signals from the indicator all led into declines of more than 60% for the cryptocurrency. “If that repeats, the chart points to $40,000,” noted Martinez. It now remains to be seen whether the MACD will hold for Bitcoin, or if a different trend from the past will follow this time around. The MACD line falling under its signal line isn’t the only bearish crossover that BTC has faced recently. As the analyst has pointed out in another X post, a classic death cross has also appeared between the asset’s 50-day simple moving average (SMA) and 200-day SMA. From the chart, it’s apparent that the 50-day SMA has declined below the 200-day SMA alongside the latest Bitcoin market downturn. During the past couple of years, each such signal has marked local bottoms for BTC, but in 2022, this crossover kicked off the bear market. Related Reading: Is Bitcoin Yet To Top In This Cycle? What aSOPR Suggests So far since the death cross has appeared, the asset has continued to decline, a potential sign that this death cross may be different from the recent ones. BTC Price At the time of writing, Bitcoin is floating around $88,800, down over 4% in the last seven days. Featured image from Dall-E, charts from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin crash|Bitcoin MACD|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54881840,
    "published": 1764068214000,
    "title": "Solana ETFs pull $369M in November as investors look to productive yield assets",
    "body": "Solana ETFs pulled in $369 million so far this month as investors appear to favor yield-bearing products, while Bitcoin and Ether ETFs faced billions in redemptions.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54881855,
    "published": 1764067997000,
    "title": "Metaplanet Draws $130M for Further Bitcoin Acquisitions Under Credit Facility",
    "body": "The Japanese company executed new borrowing as part of its expanding bitcoin focused funding strategy.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|MetaPlanet|Bitcoin News|Loans|Digital Asset Treasury|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54882369,
    "published": 1764080398000,
    "title": "South Korea stablecoin framework stalls as regulators split over banks’ role",
    "body": "Regulators and the Bank of Korea remain at odds over bank dominance in issuing won-backed stablecoins, stalling a long-awaited framework expected this year.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 54882239,
    "published": 1764079920000,
    "title": "Swedish Buy Now, Pay Later Giant Klarna Rolling Out Stablecoin with Stripe's Bridge",
    "body": "Digital bank Klarna's stablecoin, issued by Stripe’s Bridge on top of the upcoming Tempo blockchain, is set to debut next year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Stablecoin|Klarna|Stripe|Bridge|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 54882275,
    "published": 1764079273000,
    "title": "Flow Traders Opens New Institutional Gateway to DeFi With Cap and EigenLayer",
    "body": "The liquidity provider and market maker is now operating through Cap, in a “blueprint” for bringing institutional finance on-chain.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54882273,
    "published": 1764079262000,
    "title": "Russian Man Detonates Airsoft Grenades in Botched Crypto Heist",
    "body": "The amateurish robbery attempt at a crypto firm in Russia comes amid a global surge in violent crypto attacks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54882236,
    "published": 1764079200000,
    "title": "The Coming Bitcoin Treasury Bubble",
    "body": "Today’s uncertain macroeconomic climate has created an environment where corporate leaders are desperate to look innovative – Bitcoin treasuries give them a way to do that, without fixing their broken business models, says Tony Yazbeck, co-founder of The Bitcoin Way.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Opinion|Digital Asset Treasury|MicroStrategy|Opinion",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54882446,
    "published": 1764079200000,
    "title": "U.S. Bancorp Tests Stablecoin on Finance-Focused Blockchain Amid New Crypto Gold Rush",
    "body": "U.S. Bancorp is testing its own stablecoin on the public blockchain Stellar as part of a broader push into digital assets, according to the Minneapolis-based financial institution.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "NYS:USB",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54882282,
    "published": 1764079055000,
    "title": "BitMine Bags 70K ETH As PEPENODE Mining Meme Coin Nears $2.2M in Viral Presale",
    "body": "What to Know: BitMine Immersion now controls 3% of Ethereum’s circulating supply after buying nearly 70K $ETH in a single week. Crypto treasury stocks have seen their market caps compress relative to holdings, even as major players keep accumulating $BTC and $ETH. PEPENODE’s mine-to-earn model turns virtual mining rigs and meme rewards into a high-engagement alternative to passive presale tokens. For degen-level risk-takers, $PEPENODE combines early-stage staking yield and meme exposure into one speculative ecosystem play. Ethereum treasuries are back in the spotlight. BitMine Immersion Technology just snapped up another 69,822 $ETH in a single week, lifting its stash to 3.63M $ETH (roughly 3% of the entire circulating supply), and boosting combined crypto and cash holdings to $11.2B. The timing is spicy. $ETH has dropped close to 30% over the past month, dragging the value of BitMine’s treasury down from over $12B to near $10–11B before the latest rebound. Yet BitMine keeps buying, effectively doubling down on an ‘own the network’ thesis while its stock trades under pressure like other crypto-treasury plays. It’s the same tension playing out in Bitcoin land. Large $BTC treasuries have seen their market caps slump relative to the value of the coins they hold. And yet, while some $BTC has bled off, the drumbeat of acquisitions continues. This ongoing trend generates a weird split: corporate balance sheets hoarding blue-chip crypto, public equity multiples compressing, and retail investors left wondering whether to buy the coins, the stocks, or something else entirely. That’s where high-yield narratives like PEPENODE start to look interesting, particularly for meme coin hunting retail traders. Instead of owning a listed treasury at a discount, you effectively buy into a mine-to-earn meme ecosystem with direct token exposure, aggressive staking yields, and gamified virtual mining mechanics. PEPENODE Turns Virtual Mining Into Meme-Driven Yield PEPENODE ($PEPENODE) is built as a mine-to-earn meme coin on Ethereum, but it doesn’t ask anyone to plug in an ASIC. Instead, the project unveils a fully virtual mining simulator where holders use $PEPENODE tokens to buy miner nodes and upgrade digital facilities. Here, you’re building out customizable server rooms that generate simulated hashpower and rewards inside a web app dashboard. The idea is simple but clever; virtual mining rewards put in a meme coin wrapper and accessible from any basic Ethereum wallet. No rigs, no cooling fans, no angry landlord. PEPENODE also leans into the meme economy. The roadmap includes rewards not only in $PEPENODE itself but also in some of the best meme coins like $PEPE and other community favorites. These rewards will go to the top leaderboard players once the full game is live. That turns the platform into a kind of meta-meme mining arcade: you’re using one frog coin to farm a whole basket of others. On top of the gameplay, the presale already offers staking, not at a whopping 589% rewards for early participants, with emissions distributed over two years. It fits the project’s pitch: reward early backers aggressively while the mine-to-earn ecosystem spins up. For anyone watching BitMine push toward a validator-heavy future with its planned US-based staking network, PEPENODE feels like the retail, gamified interpretation of the same meta, just with memes, frogs, and a leaderboard instead of a Nasdaq ticker. Check PEPENODE’s official website for more. $PEPENODE Presale Maps Out 2025–2026 Upside While treasuries like BitMine and the big Bitcoin holders wrestle with stock prices that occasionally drift below the value of their underlying crypto, $PEPENODE is still in pure token-issuance mode. The presale has already crossed $2.19M raised at a live token price of $0.0011638, with staged pricing designed to ratchet higher as each funding milestone is hit. That puts new buyers roughly in line with recent analyst models. Our $PEPENODE token forecast sees a potential high of $0.0077 for 2026 if the mine-to-earn game launches on schedule, exchange listings land, and crypto sentiment stays constructive. From today’s presale price, that implies a theoretical upside of roughly ~560% into 2026 under optimistic conditions. Learn how to buy $PEPENODE to join now. Instead of paying a premium or small discount for a listed treasury stock, whose upside is tied to multiples and macro flows, you’re taking on a high-risk, high-reward crypto with high-APR staking, decent upside potential, and optional exposure to multiple meme assets via the virtual mining rewards. Instead of just parking tokens and waiting for TGE, early buyers can stake immediately, then later deploy those same tokens into nodes and upgrades once Phase 3 of the roadmap kicks in. The result is a presale that behaves less like a static raise and more like a soft launch of the game economy. In a market where big treasuries are under valuation pressure but still hoarding $BTC and $ETH on conviction, that kind of asymmetric, gameplay-driven upside is exactly what many retail traders are hunting for on the risk curve. Explore the PEPENODE presale while early. This is not financial advice. Crypto and presale investments are highly volatile; never risk capital you cannot afford to lose. Authored by Aaron Walker, NewsBTC – https://www.newsbtc.com/news/bitmine-70k-eth-buy-pepenode-mine-to-earn-viral-presale/",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54882365,
    "published": 1764078780000,
    "title": "Portfolio diversification leading driver for crypto investment in 2025: Sygnum",
    "body": "Diversification has become the top driver for crypto investment in 2025, with rising ETF demand and lingering regulatory gaps shaping investor behavior.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54882232,
    "published": 1764078624000,
    "title": "Exodus’ W3C Deal Adds Stability as Firm Builds Full Payments Stack: Benchmark",
    "body": "The acquisition pushes the crypto-wallet maker toward a more fintech-style business model.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Exodus|Baanx|mergers and acquisitions|Benchmark|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54882229,
    "published": 1764078300000,
    "title": "Taurus Expands Institutional Footprint With Super Validator Role on Canton Network",
    "body": "The digital-asset infrastructure provider will help secure and govern the Canton Network while expanding custody services for institutions.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Taurus|Crypto Custody|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54882270,
    "published": 1764077531000,
    "title": "Morning Minute: Monad's $4B Debut",
    "body": "It was a launch day that beat most expectations for the newest high-speed L1 blockchain.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Opinion",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      }
    ]
  },
  {
    "id": 54882361,
    "published": 1764076604000,
    "title": "VanEck quietly backpedals on BNB ETF staking in latest SEC filing",
    "body": "VanEck’s amended BNB ETF filing scraps all staking plans, unlike its Solana product, explicitly distancing itself from BNB staking amid regulatory risk.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54882281,
    "published": 1764076138000,
    "title": "Franklin’s XRP ETF Move Puts SUBBD Token’s Payments Play In The Spotlight",
    "body": "What to Know: Franklin Templeton’s XRP ETF launch reinforces the idea that on-chain settlement assets are becoming part of mainstream financial infrastructure. As XRP’s payment narrative matures through regulated ETFs, investors increasingly look to smaller-cap projects building specialized on-chain payment rails. SUBBD Token targets the creator economy with Web3 subscriptions, AI-powered tools, and on-chain payments designed to streamline global creator–fan monetization. The SUBBD presale blends high-advertised staking rewards with payment-focused utility, offering a leveraged play on the broader settlement narrative. Franklin Templeton stepping into the XRP ETF race is more than another ticker lighting up on NYSE Arca. Its new product, XRPZ , is being positioned as a regulated gateway into an asset the firm says plays a ‘foundational role’ in global settlement. Coming from one of the world’s oldest asset managers , that language is a loud signal: on-chain payments aren’t a fringe experiment anymore, they’re entering the institutional toolkit. XRP’s pitch has always been straightforward: faster, cheaper cross-border settlement that overlays existing banking infrastructure instead of trying to rip it out. When a legacy manager wraps that thesis in an ETF and labels it core infrastructure, it effectively tells traditional capital that this is now part of the plumbing, not a speculative side quest. The market backdrop strengthens that read. XRP has been outperforming relief rallies as traders shift into payment and settlement narratives, while regulators in major jurisdictions are increasingly treating it as a utility-grade asset rather than a high-beta security proxy. The broader story of real-world payments, speed, and transaction efficiency is finally maturing just as institutional wrappers arrive. That’s where the ripple effects start. Once big funds get comfortable with the payments narrative through products like XRPZ, their next instinct is to look further down the risk curve for emerging infrastructure plays. If XRP is the ‘blue-chip’ settlement asset, the hunt naturally shifts to smaller-cap projects aiming to modernize payments in niche, high-growth verticals. And that’s exactly where SUBBD Token ($SUBBD) lands, a creator-economy payment and subscription layer enhanced by AI automation tools, currently live in presale and positioning itself as the next wave of Web3 settlement infrastructure. SUBBD Token Builds Payment Rails For The Creator Economy SUBBD positions itself as a Web3 subscription stack for the creator economy: recurring payments, gated content, AI-powered automation, and fan interactions, all unified by a single token. Instead of relying on card processors, unpredictable platform policies, and high take-rates, $SUBBD aims to let fans subscribe, tip, and unlock exclusive content fully on-chain, giving creators more control over revenue, distribution, and audience data. The core pitch mirrors the same value proposition that’s suddenly making XRP ETFs appealing to TradFi: efficient, programmable payments. Where XRP focuses on global settlement infrastructure, SUBBD targets the $80B+ creator economy, a sector still running on siloed, fee-heavy rails where creators depend on platforms that can change rules overnight. By moving subscriptions and microtransactions on-chain, SUBBD removes chargebacks, reduces intermediaries, lowers international friction, and makes cross-border creator payments effectively instant. At the center of that system is the token. $SUBBD powers platform payments, unlocks premium features, and rewards active participation across the ecosystem. Fans can request custom content, tip creators directly, or access authenticated AI-generated assets and subscriber-only experiences. Creators earn a native asset they can stake, reinvest into perks, and, as governance evolves, potentially help steer platform direction. Staking is a major part of the early flywheel. The presale advertises headline yields up to 628%, a clear attempt to incentivize early adopters who want long-term exposure rather than short-term speculation. For investors watching XRP ETFs normalize on-chain settlement, a model where value flows back to participants instead of intermediaries fits neatly into the same macro trend. With that backdrop, SUBBD stops looking like a random presale and starts reading as a focused bet on where sector-specific payment rails are heading next, especially for investors tracking the overlap between creator monetization, AI tooling, and on-chain settlement. SUBBD Token Presale Targets High-Upside XRP-Style Thesis On the numbers front, the SUBBD presale has already cleared $1.36M in commitments, with tokens currently offered at around $0.057025. For a project still pre-listing, that level of early demand suggests the payments narrative is resonating with at least part of the market, especially notable given how choppy broader conditions remain. The presale is set to run into Q4 2025, giving the team a long runway to expand the product suite, ship AI creator tools, and secure platform partnerships before major exchange listings. That buffer matters. If XRP-style payment narratives continue gaining institutional traction through ETFs and regulated wrappers, smaller projects positioned as niche payment rails could benefit from both narrative spillover and practical integration into everyday creator workflows. Our price predictions have SUBBD reaching a potential year-end 2025 high of around $0.438 — roughly a 7.7x gain from today’s presale pricing — assuming execution stays on track and market momentum continues. Looking ahead, the same framework floats a 2026 high around $0.66, which would imply roughly 11–12x upside under bullish conditions if user adoption and listings track positively. None of these scenarios is guaranteed. Hitting them would require SUBBD to deliver on its roadmap, onboard real creators and audiences, and avoid the typical post-listing unwind that derails many presales. But set against Franklin Templeton’s renewed push into XRP’s settlement thesis, the broader picture becomes clearer: If blockchains are increasingly being used as real settlement layers, then application-layer tokens specializing in high-frequency, creator-driven payments represent a logical higher-beta extension of that trend. For traders comfortable with that profile, the combination of live presale pricing, aggressive staking incentives, and a payments-first narrative aligned with XRP’s new institutional moment is the kind of setup that tends to catch early-stage attention. Risk-tolerant investors who want exposure to the narrative can follow our full guide on how to buy SUBBD . This article is for informational purposes only and does not constitute financial advice; always conduct independent research. Authored by Aaron Walker, NewsBTC – https://www.newsbtc.com/news/franklin-xrp-etf-bet-subbd-token-presale-creator-payments",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54882279,
    "published": 1764075634000,
    "title": "Bitcoin Flashes A Triple Bearish Divergence: CMT Sounds The Alarm",
    "body": "Bitcoin’s three-year advance may be rolling over, according to Chartered Market Technician Tony Severino, who argues that BTC has now completed a “triple bearish divergence” on higher timeframes – a structure he characterises as the trend “dying under the hood” even as price printed fresh highs. Bitcoin Has Hit A Triple Bearish Divergence In a video published on November 24 and shared on X, Severino says he had to go beyond standard references to formalise the pattern. “I really never heard that statement before,” he admits of the term triple negative divergence. “There wasn’t a lot of information on Google I turned to AI, turned to ChatGPT.” His working definition: “three successive higher highs on price and three successive lower highs on the technical indicator.” Related Reading: Bitcoin Local Bottom To Fall Between These Two Levels – Analyst A standard bearish divergence occurs when price makes a higher high while an oscillator such as RSI, MACD or Stochastic posts a lower high, signalling trend exhaustion. Extending that to three peaks, Severino says, amplifies the warning: “A triple negative or triple bearish divergence is basically the market screaming, price is still drifting higher, but under the hood, this trend is dying.” Later he adds, “A single divergence is already a warning. A triple divergence is like yellow, orange, flashing red.” Severino maps this pattern onto Bitcoin’s bull cycle using the monthly chart, anchored around three key highs. The first, he argues, came around the spot ETF launch and aligned with a wave-three impulse in his Elliott Wave count. “This was our ETF launch and it was during our wave three impulse […] everybody’s excited. We had the ETF launch […] strong volume, strong momentum,” he says, calling it the cycle’s momentum peak. The second high broke that level but on weaker internals. “Second high breaks the old high. The indicator’s high is weaker. This represents fewer aggressive buyers. Early participants start taking profits. This was me. I started taking profit here,” he notes. In his interpretation, that push represented a fifth wave. The third high, marginally above prior peaks near $126,000, is where he sees exhaustion. “On the third high, price index is higher. Marginal new high […] I sold around $105k […] we went to $126k, so I left only a very small amount on the table to not get caught up in what comes after all this,” he says. The oscillator, however, made yet another lower high: “Buyers are exhausted at this point. Shorts are covering, late FOMO buyers push it just a little bit higher. Pros use this zone to offload positions or start shorting.” He argues that sentiment at the top was complacent rather than euphoric. “I don’t think we were euphoric here. I think we were euphoric at this one […] but we were very complacent this whole time […] everybody just was like, it’s going up forever.” Related Reading: Is Bitcoin Yet To Top In This Cycle? What aSOPR Suggests Crucially, Severino insists the divergence is a setup, not a standalone trigger: “You want confirmation before acting.” He points to several. First, a break of the rising trendline connecting the major swing lows: “Here is our trend line and we are below. There is our confirmation.” Second, loss of key moving averages such as the 20 and 50 EMA that had supported the uptrend. Third, a regime shift in weekly RSI: during the bull, it repeatedly bounced in the 40–50 zone, but now, he says, “falling below it is confirmation that the trend is now no longer holding.” On volume, he warns against reading the recent spike on a down candle as capitulation. While the FTX bottom showed extreme, climactic volume, the latest breakout in selling may instead be “the breakout and start of a trend” to the downside, he suggests, especially given the declining volume into Bitcoin’s final highs. How Low Can Bitcoin Go? For potential downside, Severino overlays Fibonacci levels on the full advance and references guidance that triple divergences often resolve toward the 0.5–0.618 retracement between $44,100 and $34,409. In Bitcoin’s case, he marks a wide lower zone where an A-B-C structure could terminate, estimating “about like 60 something percent, maybe even closer to 70” from the top – “very par for the course for a Bitcoin bear market,” in his words. More ominously, he hints at a “bigger version of this” on even higher timeframes, suggesting a larger triple divergence may be forming with the recent structure nested inside it. “This could not be so great for the higher time frames Bitcoin,” he says. Still, he repeatedly stresses uncertainty and risk management. “I can’t say that this signal is the end-all be-all […] it doesn’t guarantee anything,” he says. “I definitely don’t want you to be like, hey, Tony, well, I believe you 100%. Immediately, I’m going to sell my coins. No, it’s not financial advice […] It’s more about how you manage risk.” At press time, Bitcoin traded at $87,658. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54882391,
    "published": 1764075601000,
    "title": "Klarna launches stablecoin to cut cost of cross-border payments",
    "body": "Digital token will aimed at merchants moving large sums and may also be offered to consumers",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54882359,
    "published": 1764074299000,
    "title": "XRP price ‘looking very bullish’ after 25% weekly gain: How high can it go?",
    "body": "XRP is rebounding strongly from $2, with multiple indicators suggesting upside toward $3.30–$3.50 is possible in the coming weeks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54882269,
    "published": 1764074150000,
    "title": "Altcoin ETFs Including XRP, Solana in Green Amid Crypto Market Uncertainty",
    "body": "Experts cite regulatory clarity and selective institutional reallocation as being behind recent capital inflows into XRP and Solana ETFs.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54882277,
    "published": 1764074130000,
    "title": "MSCI, JPMorgan, Strategy, and Why Bitcoin Hyper Is Suddenly On Everyone’s Radar",
    "body": "What to Know: MSCI’s consultation to exclude $BTC-heavy ‘digital asset treasury’ companies from major indexes has turned Strategy into a test case for forced selling risk. JPMorgan’s bearish note on Strategy landed in a weak, thin market, amplifying fear, rumors of shorts, and even a grassroots JPMorgan boycott narrative. Bitcoin Hyper’s $HYPER token offers a crypto-native way to play Bitcoin scaling, combining a $BTC Layer-2 design with audited contracts, staking, and presale access. When the market tanked on October 10, there was no obvious macro bomb, no ETF denial, no regulatory headline. Just a brutal, mechanical flush that felt … engineered. The missing piece turned out to be MSCI. On 10 October, the index giant quietly launched a consultation that could exclude companies whose balance sheet holds 50% or more in Bitcoin or other digital assets from its global equity indexes. That hits Strategy ($MSTR) right where it lives, because the stock is essentially a leveraged proxy on corporate Bitcoin accumulation. If MSCI goes ahead, index funds that track those benchmarks are forced sellers. In a market already thinned out by quantitative tightening and drained dollar liquidity, the mere prospect of billions in automatic selling was enough to flip $BTC and $MSTR from ‘buy the dip’ to ‘get me out’. Then JPMorgan walked in with a bearish note. Exactly while $BTC was sliding, liquidity was thin, and $MSTR was already down badly, the bank resurfaced the index-exclusion risk and put numbers on it: roughly $2.8B of potential forced selling from MSCI indexes alone. Analysts flagged that the note leaned on an MSCI document that had been sitting for weeks, and only became ‘urgent’ right as markets were on the ropes, fuelling accusations that sentiment was being steered rather than merely described Around that, a familiar set of narratives exploded: rumors that large institutions might short $MSTR, concerns about brokers lending out client shares to fuel those shorts, and an online boycott campaign where thousands of users claim to be closing JPMorgan accounts in protest. Michael Saylor pushed back, stressing that Strategy is not a passive Bitcoin fund but a software and financial engineering company with revenue, products, and $BTC-backed instruments, arguing that MSCI is misclassifying a live business as a treasury wrapper. 💣 Even so, the consultation runs until year-end, and the decision scheduled for January 15 2026 still hangs over every $BTC-heavy equity. So this isn’t just a one-off crash story anymore. It’s about how index rules, bank research notes, and rumor cycles can yank liquidity away from anything that looks like a Bitcoin proxy. Which is exactly why a bunch of capital is rotating into pure-play Bitcoin infrastructure and presale tokens like Bitcoin Hyper ($HYPER). Bitcoin Hyper ($HYPER) As A Clean $BTC Narrative Play Bitcoin Hyper ($HYPER) is building a dedicated Bitcoin Layer-2 that lets $BTC itself move faster, cheaper, and in more programmable ways. The $HYPER token will power the Layer-2 for gas, governance, and staking. Mechanically, the design is pretty straightforward for anyone used to Layer-2s. $BTC is locked on the Bitcoin Layer-1 via a canonical bridge. A relay program will verify Bitcoin block headers and proofs, then mint a representation on the Layer-2. Transactions will execute on a Solana Virtual Machine environment with high throughput and low latency, while batches and zero-knowledge proofs will be periodically committed back to Bitcoin. That’ll keep settlement anchored to $BTC’s security while letting you actually do things like payments, DeFi, NFTs, and meme coins. From a positioning angle, that’s important. If MSCI and other index providers are about to penalize companies that warehouse $BTC on their balance sheets, the market’s next question is: where does all the ‘Bitcoin leverage’ go instead? ⚡️ One obvious answer is native $BTC Layer-2s, where returns are tied to actual network usage rather than index inclusion politics. Bitcoin Hyper is very explicitly trying to be that ‘speed layer’ for $BTC. In short, while banks debate whether Strategy qualifies for index membership, Bitcoin Hyper is trying to earn its place as infrastructure. For anyone who wants $BTC exposure without giving MSCI and JPMorgan veto power over flows, that pitch lands pretty well. ➡️ Looking for more information on the project that could change Bitcoin forever? Check out our Bitcoin Hyper review. Inside The Bitcoin Hyper Presale And Staking Mechanics There’s also upside math at play here. Our Bitcoin Hyper price prediction believes that if the project team ships its initial roadmap – mainnet, bridge, early dApps, and listings – $HYPER has the potential trade as high as $0.08625 by late-2026, assuming execution and broader $BTC strength. Against a current presale price of $0.013325, that’s an ROI of over 547% if everything lines up. That is not a guarantee; it’s a roadmap-plus-sentiment scenario. But it explains why some traders are rotating a slice of their ‘$MSTR proxy’ play into a direct Layer-2 bet instead. 🐳 Under the hood, the presale numbers are already big enough that this isn’t just a niche side quest anymore. $HYPER has raised over $28.45M. We’ve also seen some impressive whale buys as high as $502.6K, showing smart-money confidence. On top of that, staking has become its own flywheel. Currently, staking APY is 41%, with close to 1.3B $HYPER already locked. In practice, that means a big chunk of supply is out of circulation before the token even lists, which can dampen initial sell pressure if demand holds up. The flip side is obvious: high APYs don’t last forever, and when cliffs, unlocks, or yield rotations kick in, late entrants can get clipped hard. Timeline-wise, the project is targeting mainnet launch around Q4 2025/Q1 2026, with exchange listings and a DAO rollout following in 2026 to handle governance and developer grants. That lines up almost perfectly with the MSCI decision window. 🚀 Get in on the $HYPER action before the next price increase. Disclaimer: Remember, this isn’t intended as financial advice, and you should always do your own research before investing. Authored by Aaron Walker, NewsBTC – www.newsbtc.com/news/msci-jpmorgan-mstr-shakeup-boosts-bitcoin-hyper-presale",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54882276,
    "published": 1764073257000,
    "title": "Solana Nears $140 As Crypto Rotates Back to Risk: Could Maxi Doge Run Next?",
    "body": "What to Know: Solana’s move back toward $140, powered by strong ETF inflows and rising network revenue, signals a broader return of risk appetite in crypto. Fresh institutional interest in non-Bitcoin assets often precedes capital rotating into smaller caps and meme coins with higher volatility and upside. Maxi Doge uses meme culture plus staking, contests, and partner events to turn speculative energy into a more structured holder incentive model. The $MAXI presale, already above $4M raised with live staking, targets degen traders seeking yield-backed meme exposure in a renewed bull backdrop. Solana is back, flirting with $140, and the market finally looks like it remembers what a bull run feels like. Spot data shows $SOL trading in the high $130s , with a market cap around $76B and solid 24-hour volume; the kind of liquidity that tells you big players are back in the game. The new driver this time isn’t just hype. Solana has posted roughly $2.85B in annualized network revenue , and its spot ETFs have pulled in more than $380M in net inflows within weeks of launch. A second wave of SOL ETFs has already hit the market, with cumulative inflows pushing past $480M as funds try to front-run a potential next leg higher. That’s serious money signaling it’s willing to go further out on the risk curve than just Bitcoin. When institutions are comfortable owning $SOL through ETFs, you’re looking at a market that’s shifting from survival mode back to opportunity mode. Historically, that’s when capital starts hunting for higher beta plays, from smaller caps to full-blown meme coins. In the last cycle, that rotation carried Dogecoin and Shiba Inu to eye-watering returns once the majors had already moved. This time, the meme meta looks different: communities want culture, but they also want utility and yield. That’s where Maxi Doge ($MAXI) slots in; an Ethereum-based meme coin that wraps degen leverage culture around staking rewards, trading contests, and partner events. $MAXI positions itself as a way to lean into the risk-on mood around $SOL, one of the best altcoins , not just buying another dog logo and hoping. Maxi Doge Turns Meme Volatility Into Staking-Powered Upside Maxi Doge ’s core pitch is simple: take the over-caffeinated, 1000x-leverage trader archetype and turn it into a meme coin with actual on-chain incentives. The mascot is a body-builder Doge who never skips leg day, but beneath the jokes there’s a basic structure designed to keep holders engaged rather than just praying for a one-and-done pump. The token lives on Ethereum, which immediately solves liquidity and access: you can come in with $ETH, $BNB, stablecoins, or even a bank card via the presale widget, then later trade on Uniswap and (if the roadmap plays out) centralized exchanges. Smart-contract audits from firms like SolidProof and Coinsult reassure traders who like memes but also like their funds to actually be there tomorrow. Community trumps utility, but $MAXI holders get extra benefits. First, staking: $MAXI holders can lock tokens into a rewards pool that distributes yield via smart contract, currently 73% APY Second, $MAXI trading contests, where high-ROI traders and active community members can compete for extra rewards Third, proposed partner events that aim to plug Maxi Doge into third-party platforms The tokenomics lean heavily into growth. Out of a 150.24B maximum supply, 40% is allocated to marketing, while a further 25% is held in the Maxi Fund, all aimed at driving virality and adoption. That’s aggressive, but it matches the goal: saturate degen culture feeds while giving early buyers a meaningful allocation. Nobody should confuse $MAXI with a complex DeFi protocol. This is a culture token with staking and incentives layered on top. If that’s appealing, learn how to buy $MAXI. In a market where Solana is proving that users still love high-speed trading, NFTs, and meme coins, that blend of narrative and yield is exactly what many retail traders are looking for. Watch Maxi Doge if you’re leaning into the meme-plus-utility narrative. Inside the Maxi Doge Presale as Capital Hunts Higher Beta The $MAXI presale is structured in stages. Right now, entries are $0.00027 with nearly $4.19M already raised. Staking is live during the presale itself. That means early buyers aren’t just parking capital and waiting; they can immediately start compounding, which helps explain why billions of tokens are already locked. In a macro backdrop where Solana ETFs are soaking up institutional flows, and traders expect a broader alt rotation, being able to put a meme bag to work is a strong differentiator versus old-school ‘just hold and hope’ coins. The roadmap is very on-brand but surprisingly clear. After closing the presale, the project plans a DEX launch (with Uniswap v3 flagged as the first stop), followed by CEX listings and partnerships with futures platforms to push the high-leverage narrative. That narrative is succeeding; major whale purchases include two $314K token buys (here’s the on-chain proof ). None of this guarantees performance, and meme coins remain some of the riskiest assets you can touch in crypto. But in a cycle where Solana approaching $140 signals a renewed appetite for risk, a project like Maxi Doge – meme-heavy, $ETH-native, audited, and wrapped in staking incentives – is exactly the sort of asset many traders will want on their watchlist. Track the $MAXI presale while it’s open. This article is informational only, not financial advice. Crypto and meme coins are highly volatile; always do independent research before investing. Authored by Aaron Walker for NewsBTC – www.newsbtc.com/news/solana-140-rally-sends-maxi-doge-presale-soaring",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 44,
        "NAME": "SHIB",
        "CATEGORY": "SHIB"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54882274,
    "published": 1764072026000,
    "title": "What Happens If Dogecoin Moves Out Of This Massive Wyckoff Accumulation?",
    "body": "After hitting a new two-year peak back in 2024, the Dogecoin price had trended downward, and the result of this was a move into a major accumulation trend. Since then, the meme coin has been caught in this accumulation trend, with the majority of the price action favoring a bearish market. But with the tides changing, there could be a different approach for the cryptocurrency as Dogecoin flashes what seems to be an end to the accumulation trend. The Wyckoff Accumulation Holding Back Dogecoin Crypto analyst Trader Tardigrade shared that the Dogecoin price has been caught in a massive Wyckoff Accumulation, which is the main thing that has kept the price down. However, there is still hope for the meme coin if it is able to break out of this accumulation trend. Related Reading: Top Analyst Sounds Alarm: Bitcoin Is Highly Unlikely To Spring Back Anytime Soon Pointing to the 5-Phase theory, the analyst explained that Dogecoin could be getting set to break out after completing Phase C of the cycle. As Trader Tardigrade explains, Phase C is always the lowest of all of the phases, meaning its completion could mean that the Dogecoin price is now nearing a bottom. If this bottom is completely formed at this level, then it could end the Wyckoff Accumulation, which apparently began back in 2024. The end of this year-long accumulation is entirely bullish and could propel the price even further than expected. As for the last two phases of the 5-phase theory, Phase D and Phase E, the analyst also shared what to expect. For Phase D, the Dogecoin price is expected to be pushed back toward the resistance that is mounting above $0.16, a level that has proven difficult in the past. Related Reading: XRP Approaches Macro Breakdown Zone, Analyst Warns About One Final Leg Lower The last and final stage of this, Phase E, is the most bullish of all, and could propel Dogecoin’s price toward new yearly highs. This phase is expected to send the meme coin’s price back above the accumulation range between $0.29 and $0.3, signaling an end to the massive Wyckoff Accumulation. Interestingly, Dogecoin’s open interest has crashed toward yearly lows, which suggests that this is a good time for buyers to step in for the meme coin. With open interest sitting at #1.3 billion compared to its $6 billion all-time high, according to data from Coinglass, DOGE could be uniquely positioned for a major breakout as the crypto market rebounds. Featured image from Dall.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54882272,
    "published": 1764071275000,
    "title": "Next Crypto to Explode? Best Wallet Token Presale Ends in 3 Days with $17.4M Raised",
    "body": "What to Know: Crypto users still face fragmented, clunky wallet experiences, forced to juggle multiple apps, bridges, and DEXs just to access basic DeFi and presale opportunities. Many leading wallets remain either centralized with potential custodial risks or decentralized but unintuitive on mobile, offering few meaningful rewards or value-add features for long-term users. Best Wallet Presale aims to become the best crypto wallet by 2026, targeting 40% market share with a secure, mobile-first, feature-rich, non-custodial design. The project combines Fireblocks-powered MPC security, a vetted presale discovery portal, cross-chain DEX aggregation, and $BEST staking rewards into one unified Web3 command center. After a chaotic year of altcoin whiplash, one trend has cut through the noise: investors are still piling into infrastructure projects that actually make crypto easier to use. Meme coins spike, vanish, and reappear like seasonal allergies, but everyone still needs a secure, mobile-first way to hold, swap, and earn without battling clunky UX or playing hide-and-seek with custodians. It’s no surprise, then, that wallet innovation has quietly become one of crypto’s fiercest battlegrounds. The problem? The best crypto wallets in this space come with baggage. Some are polished but basically centralized front-ends in disguise. Others are proudly non-custodial but feel like they were designed by someone who has never onboarded a new user in their life. And if you’ve ever bounced between three wallets, a bridge, and two DEX tabs just to buy a presale token or chase a yield pool… you already know the experience is overdue for a reboot. Enter the Best Wallet Presale , which pitches a very simple idea: what if the ‘best crypto wallet’ actually lived up to its name? Think security, presale access, cross-chain swaps, staking, and a clean mobile interface, all in one app. No Frankenstein toolkit. No duct-taped workflow. Just a single control center for your crypto life, whether you’re buying your first $50 of BTC or juggling a multi-chain DeFi setup. And the ambition doesn’t stop there. The team wants to grab 40% of the global crypto wallet market by the end of 2026, a bold target, but backed by a straightforward playbook: launch a feature-heavy, non-custodial wallet, reward $BEST holders with real perks, and use the presale’s momentum to jump-start user growth. With only three days left in the token sale and analysts already debating where the $BEST token could land, this is shaping up to be one of the most aggressive wallet pushes of the year. Best Wallet Presale Targets the “All-In-One” User Experience Best Wallet is pitching itself as the crypto super-app people keep asking for but never quite get: a next-gen, non-custodial wallet that doesn’t force you to choose between security, usability, or actual features. Its mobile-first interface bundles Fireblocks MPC-CMP security with custom multi-wallet portfolios and native support for thousands of assets (soon to expand across 50+ chains). It gives both newcomers and hardcore DeFi users the same clean, unified experience. But where Best Wallet really separates itself is in the extras most competitors skip. Its Upcoming Tokens portal surfaces curated presales with a frictionless purchase flow. At the same time, the Best DEX aggregator, powered by Rubic, searches across multiple chains, DEXs, and cross-chain bridges to find optimal routes. Instead of being just another place to store your assets, the wallet becomes the discovery engine for new opportunities, tying directly into the presale and DeFi narratives driving recent price-prediction hype. So far, the strategy seems to be landing. The presale has pulled in over $17.4M, with tokens priced at $0.025995, signaling strong demand for a wallet that fuses security, yield, presale access, and lower trading fees. Add in exclusive benefits for $BEST holders, and the vision becomes clear: your wallet shouldn’t just hold your crypto, it should help you grow it. $BEST Price Outlook, Staking Incentives, and Whale Interest If the Best Wallet Presale captures even 5% of the global crypto wallet market, $BEST price forecasts put the token at a $0.05 high in 2026, nearly a 2x jump from the current presale price of $0.025995. Nothing is guaranteed, but the math shows how a relatively small slice of a massive market can translate into meaningful price repricing. For investors tracking the next breakout token, now is the time to understand $BEST before it hits exchanges. Momentum is already building behind the scenes. Smart money wallets have started accumulating, with big whale buys of between $50K and $70K . For early-stage infrastructure tokens, concentrated accumulation like this often shows up before retail notices, typically right as the mobile app rolls out and real utility goes live. The tokenomics also lean into long-term alignment rather than hype trading. $BEST is an ERC-20 token with 8% of supply (800M tokens) dedicated to staking rewards (currently giving 75% APY). APY scales based on your share, and staking is already live during the presale, allowing early buyers to start compounding before the exchange trading begins. Staking isn’t just a yield mechanic; it’s a key part of the app’s ecosystem design. $BEST stakers are positioned to unlock higher yields via the upcoming in-app staking aggregator, reduced transaction fees across supported networks, and potential boosts or priority allocations for vetted presales featured in the wallet’s discovery portal. In short: stake $BEST to get more out of the entire ecosystem. As the mobile app, cross-chain DEX aggregator, and presale discovery hub gain traction, the flywheel becomes obvious: more users → more activity → more fee savings and perks for $BEST holders → stronger incentives to stake and hold. For anyone looking for a wallet-focused token with real utility rather than recycled hype cycles, this narrative is worth keeping an eye on. With just days left in the presale and more than $17.4M already committed, Best Wallet is heading into launch with the capital to ship features, complete audits, and scale marketing. Suppose the team delivers on its mobile-first UX and continues to curate high-quality presales and DeFi integrations. In that case, Best Wallet’s utility token has a real chance to graduate from a ‘speculative crypto’ to a ‘daily-use asset.’ Get $BEST tokens before the presale ends. This article is for informational purposes only and does not constitute financial, investment, or trading advice. Always do your own research. Authored by Aaron Walker, NewsBTC – https://www.newsbtc.com/news/next-crypto-to-explode-best-wallet-token",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 205,
        "NAME": "TOKEN SALE",
        "CATEGORY": "TOKEN SALE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54882356,
    "published": 1764070473000,
    "title": "Monad airdrop farmer spends full $112K MON reward on gas for failed trades",
    "body": "A suspected airdrop farmer burned through their entire $112,000 of MON rewards in hundreds of failed transaction attempts.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 204,
        "NAME": "AIRDROP",
        "CATEGORY": "AIRDROP"
      }
    ]
  },
  {
    "id": 54882223,
    "published": 1764070323000,
    "title": "Crypto Markets Today: Bitcoin Leads Rebound, Altcoins Rally During Longer-Term Downturn",
    "body": "Bitcoin recaptured $87,000 on Tuesday as improving risk appetite and a strong equities session helped lift major altcoins.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54882355,
    "published": 1764069543000,
    "title": "Strike CEO debanked by JPMorgan, Lummis sounds ‘Chokepoint 2.0’ alarm",
    "body": "Strike CEO Jack Mallers said JPMorgan closed his accounts without explanation, reigniting fears of Operation Chokepoint 2.0 and renewed pressure on crypto companies.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]