[
  {
    "id": 56182230,
    "published": 1766409389000,
    "title": "Strategy boosted cash reserve by $748 million last week",
    "body": "Led by Executive Chairman Michael Saylor, the company raised the funds entirely by sales of common stock.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|MicroStrategy|Bitcoin News|Michael Saylor|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 56181800,
    "published": 1766408655000,
    "title": "Aave governance vote sparks backlash over rushed escalation",
    "body": "Critics say the decision to fast-track a brand ownership vote exposed weaknesses in how one of DeFi’s largest DAOs handles governance process.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56182952,
    "published": 1766410341000,
    "title": "Aptos Gains 4.5% to $1.63, outpacing broader crypto market",
    "body": "The APT token has support at $1.59 and resistance at $1.65.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Aptos|Technical Analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 70,
        "NAME": "APT",
        "CATEGORY": "APT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56182863,
    "published": 1766410235000,
    "title": "Fundstrat Predicts Ethereum Drop To $1,800 In H1 2026",
    "body": "A screenshot attributed to Fundstrat Research is stirring debate over whether Tom Lee’s firm is projecting a sharp first-half 2026 correction in crypto markets—despite Lee’s recent public bullishness on Ethereum. Wu Blockchain shared the image via X, describing it as an internal client note titled “2026 Crypto Outlook: Near-Term Headwinds, Second-Half Upside,” timestamped Wednesday, Dec. 17, 2025 at 7:34 p.m. ET. Fundstrat’s Bearish Call Vs. Tom Lee’s Bull Case The document is credited to Sean Farrell, Fundstrat’s head of digital asset strategy, and includes a base-case scenario calling for a “meaningful drawdown in 1H 2026,” with target ranges of bitcoin at $60,000–$65,000, ether at $1,800–$2,000, and solana at $50–$75. The note adds that those levels would represent “attractive opportunities into year-end,” and that if the view is wrong, the preference is still to “play defense” until strength is confirmed. The ETH range is what set the market chatter off. Ether is trading around the $3,000 area, making $1,800 a material downside scenario if taken at face value. Related Reading: Ethereum ETFs Record Over $600M In Outflows — Warning Signal For Traders? The controversy, such as it is, comes from the proximity to Lee’s own messaging. At Binance Blockchain Week, Lee said ethereum at roughly $3,000 looked “severely undervalued,” a stance that reads very differently than a research framework explicitly mapping a potential move to the high-$1,000s. Over the past few weeks, Lee even publicly shared his predictions that ETH could reach $20,000 next year and $62,000 over the next several years. Farrell responded directly on X on Dec. 20, arguing the framing of “internal conflict” misunderstands how Fundstrat operates. The firm, he said, houses several analysts with independent processes, each designed for different client objectives and time horizons. Lee’s work, Farrell wrote, is aimed at large institutions that might allocate 1%–5% to BTC and ETH and is structured around longer-term macro and “secular” trends. Farrell’s research, by contrast, is positioned for investors with heavier crypto exposure—he referenced portfolios with ~20%+ allocations—where active risk management and rebalancing matter more than maintaining a single long-duration thesis through volatility. Related Reading: Ethereum Exchange Outflows Soar To $978M: Sign Of Dip Buying? That distinction is central to interpreting the leaked-style targets. Farrell’s public explanation wasn’t “we are bearish,” but rather “we are cautious in the near term.” He said markets appear priced for “near-perfection” while risks remain elevated—citing government shutdown dynamics, trade volatility, uncertainty around AI capex, and a Federal Reserve chair transition, alongside tight high-yield spreads and low cross-asset volatility. He also highlighted mixed flow conditions. In Farrell’s telling, long-term ETF demand could improve as wirehouses onboard, but near-term pressures persist from “OG selling,” miners, fund redemptions, and even the possibility of an MSCI MicroStrategy delisting—an item that stood out because it suggests the risk lens extends beyond spot crypto into the crypto-equity complex that has become a key liquidity and sentiment barometer. Farrell’s stated base case: “an early-year bounce followed by another 1H drawdown, creating a more attractive opportunity into year-end.If I’m wrong, I’d rather wait for confirmation (trend breaks, flows, momentum, or a clear catalyst). Crypto is reflexive, and for my objective, patience matters in no-man’s land.” The thread ends on a point many readers missed in the initial screenshot-driven outrage cycle: Farrell still expects BTC and ETH to “challenge new ATHs by year-end,” describing a shorter, shallower bear that could compress the traditional four-year cycle narrative. “For those who tuned into the outlook: I still expect BTC and ETH to challenge new ATHs by year-end, effectively ending the traditional four-year cycle with a shorter, shallower bear,” he wrote via X. At press time, Ethereum traded at $3,043. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|Fundstrat",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56182767,
    "published": 1766409079000,
    "title": "Bitcoin reclaims $90,000, but risk of U.S. trading day awaits",
    "body": "Futures open interest rose steadily as BTC pushed higher, climbing toward $60 billion across major venues.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56183576,
    "published": 1766410812000,
    "title": "Ghana passes law to legalize crypto trading, central bank governor says",
    "body": "Ghana legalizes cryptocurrency and gives its central bank authority to regulate and license providers to reduce fraud and systemic risks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56183071,
    "published": 1766410405000,
    "title": "Clarity Act delays led to $952M in crypto fund outflows: CoinShares",
    "body": "Crypto funds broke three weeks of net positive flows, after US investor sentiment took a hit following delays to the long-awaited CLARITY Act, set to reach the Senate in January 2026.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56183043,
    "published": 1766410339000,
    "title": "JPMorgan Is Exploring Crypto Trading for Institutional Clients",
    "body": "JPMorgan Chase & Co. is considering offering cryptocurrency trading to its institutional clients, as large banks around the world deepen their involvement in the asset class.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "NYS:JPM",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56184149,
    "published": 1766412063000,
    "title": "The Year in Bitcoin 2025: Breaking Records as Governments, Wall Street Take Interest",
    "body": "From Wall Street to Washington, Bitcoin reached new heights in 2025, despite tensions flaring over changes to the network's codebase.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Long Reads",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56184131,
    "published": 1766412000000,
    "title": "Prediction markets beat Wall Street in forecasting inflation, Kalshi says",
    "body": "Kalshi's markets aggregate information from diverse traders with financial incentives, creating a \"wisdom of the crowd\" effect, the platform said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Kalshi|Prediction Markets|Wall Street|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 56184592,
    "published": 1766412818000,
    "title": "Hut 8’s AI data center deal is bigger than meets the eye: Benchmark lifts price target to $85",
    "body": "Shares of the bitcoin miner jumped higher last week on its $7 billion pact with Google-backed Fluidstack.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Hut 8|AI|Bitcoin Mining|Benchmark|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56185040,
    "published": 1766413360000,
    "title": "JPMorgan weighs crypto trading for institutions amid growing demand",
    "body": "The largest U.S. bank is exploring spot and derivatives services for hedge funds and pensions as regulatory clarity improves, a person familiar with the matter told Bloomberg.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|JP Morgan|Breaking News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56185037,
    "published": 1766413242000,
    "title": "Trump’s World Liberty Financial token ends 2025 down over 40%",
    "body": "The Trump family’s crypto project, World Liberty Financial, has seen its fair share of controversy, and its token is ending the year significantly down.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56185593,
    "published": 1766414159000,
    "title": "The clock is ticking for crypto tax loss harvesting",
    "body": "Investors might be able to take advantage of the recent crypto market downturn in order to lower their taxable income.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Opinion|Crypto Taxes|Opinion",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56186595,
    "published": 1766415625000,
    "title": "Pundit Shares Why XRP Will Become Expensive And A $1,000 Price Tag Is Possible",
    "body": "Crypto pundit BarriC has explained why an XRP rally to $1,000 is possible, even though it could mean the altcoin would have a market cap of almost $100 trillion. The pundit also raised the possibility of XRP rallying to as high as $50,000, which he described as “absolutely possible.” Why XRP Could Rally To $1,000 In an X post, BarriC stated that XRP will have to become extremely expensive so that it can be fractionalized and allocated to every bank and financial institution globally. He noted that this will be the case if every bank and financial institution around the world adopts and utilizes the altcoin. Related Reading: XRP Price About $1,000 Is A Necessity, Analyst Claims In line with this, BarriC declared that this is why a $1,000, $10,000, and $50,000 price tag is “absolutely possible” for XRP. The pundit has continued to reiterate that XRP can hit the $1,000 price target despite how ambitious it sounds, considering what the altcoin’s market cap will be. In another X post, he stated that the altcoin could still close out this year at $100 and hit $1,000 early next year. The pundit admitted that quite a few things would have to happen simultaneously, but that anything is possible in crypto. It is worth noting that finance expert Dr. Camila Stevenson recently echoed BarriC’s sentiment that XRP needs to be expensive to be easily adopted by banks for larger volumes. Meanwhile, BarriC is confident that the XRP adoption among banks is already happening. He recently noted that Swiss bank AMINA plans to start utilizing Ripple payments and, by association, XRP. The pundit also alluded to the fact that Ripple is on course to become a Trust bank after the OCC granted it a conditional approval. Other Potential Catalysts For Higher Price Crypto pundit X Finance Bull highlighted a Trump stimulus and XRP ETFs as catalysts that could drive the XRP price higher. He noted that 20% to 28% of U.S. adults now own crypto, equating to 50 to 65 million people with wallets and market impact. The pundit then raised the scenario in which a small percentage of the proposed $2,000 stimulus check flows into XRP. Related Reading: Here’s Why The XRP Price Keeps Crashing X Finance Bull declared that this will create billions in demand, hitting an already rising market. The pundit also mentioned that the infrastructure is in place as XRP ETFs keep launching and banks are onboarding. He added that liquidity finds utility, which is why he is confident that a significant amount of global liquidity could flow into the XRP ecosystem, sparking higher prices for the altcoin. At the time of writing, the XRP price is trading at around $1.92, up in the last 24 hours, according to data from CoinMarketCap. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|altcoin|BarriC|CoinMarketCap|Dr. Camila Stevenson|occ|Ripple|Spot XRP ETFs|Swiss Bank AMINA|Trump Stimulus|X Finance Bull|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56189017,
    "published": 1766418996000,
    "title": "JPMorgan explores crypto trading for institutional clients: Report",
    "body": "The move by the traditional banking giant would represent a significant deepening of ties to the crypto industry and change in CEO Jamie Dimon’s approach to digital assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56188679,
    "published": 1766418379000,
    "title": "Ethereum analysts see ‘upward breakout’ as ETH price returns to $3K",
    "body": "Ether rebounded 16% to reclaim $3,000 as whales accumulate heavily, exchange supply hits nine-year lows, and network activity surges.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56189654,
    "published": 1766420010000,
    "title": "Vincetrust Launches Digital Asset Retirement Portfolio for Structured, Technology-Driven Long-Term Wealth Growth",
    "body": "As digital assets continue to gain prominence within global financial markets, retirees are increasingly seeking diversified and forward-looking wealth management solutions. London-based digital asset management firm Vincetrust has announced the launch of its Digital Asset Retirement Growth Portfolio , offering a structured and automated alternative to traditional retirement planning. The initiative integrates algorithmic asset management models with blockchain-based infrastructure, providing participants with a transparent and compliance-oriented framework designed to support long-term financial planning. Addressing Retirement Planning in Evolving Markets “Blockchain is transitioning from a speculative instrument into foundational infrastructure for long-term wealth management,” says digital finance researcher Laura Bennett . “For retirees, the emphasis is no longer on short-term performance, but on how technology can support sustainable planning through transparency, automation, and disciplined risk management.” Persistent inflation and declining yields from conventional pension products have led many retirees to reassess their asset allocation strategies. In response , Vincetrust ’s retirement portfolio focuses on digital asset infrastructure and income-oriented strategies, enabling participants to access alternative return opportunities within a clearly defined and structured framework. About Vince Trust Founded in 2019 and headquartered in London, Vince Trust provides blockchain cloud computing and digital asset management services to users worldwide. As of 2025, the platform has served more than 6.3 million registered users across over 150 countries and regions, managing assets exceeding US$74 billion. The platform supports mainstream digital assets including BTC, ETH, and XRP, with a strong emphasis on institutional-grade risk management, security standards, and operational transparency. Key Features 1.No technical barriers No hardware installation or specialised technical knowledge required. 2.Automated management and settlement Asset allocation, performance calculations, and daily income settlements are handled automatically through intelligent systems. 3.Professional oversight Operations are supervised by a global team of experienced financial professionals and technical specialists. 4.Global accessibility Users can access the platform from anywhere via smartphone or compatible devices, with no geographic or nationality restrictions. Security and transparency Data confidentiality, transparent contract structures, and real-time earnings monitoring are prioritised. Contract plans are underwritten by the internationally recognised L&G Group , allowing participants to focus solely on long-term performance outcomes. Getting Started Register on the Vince Trust platform to receive a welcome bonus providing immediate access to the newcomer rewards package.Trade using supported digital assets such as BTC, ETH, XRP, USDT, and others.Select a curated retirement savings investment portfolio and purchase contracts directly.Profits are automatically settled every 24 hours and can be withdrawn at any time. Conclusion As the financial landscape grows increasingly complex, Vince Trust offers a structured, automated, and compliance-focused approach to digital asset retirement planning. By combining cloud-based algorithms with blockchain infrastructure, the platform establishes a modern long-term wealth management framework centred on transparency, efficiency, and disciplined risk management. For those exploring compound interest strategies and long-term digital asset allocation, visitors are encouraged to spend a few minutes reviewing the https://vincetrust.com/ official website to learn more about Vince Trust .",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56189206,
    "published": 1766419273000,
    "title": "BlackRock names bitcoin ETF a top 2025 theme despite price slump",
    "body": "The world's largest asset manager is promoting its underperforming bitcoin fund over higher-fee winners, signaling long-term commitment.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|BlackRock|Bitcoin ETF|ETFs|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56189829,
    "published": 1766420294000,
    "title": "U.S. bipartisan lawmakers draw up tax bill with stablecoin and staking relief",
    "body": "New House proposal would exempt some stablecoin payments from capital gains taxes and allow stakers to defer income recognition for up to five years.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|House of Representatives|Bill|crypto tax|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 56192135,
    "published": 1766423339000,
    "title": "Tokenized US Treasurys surge 50x since 2024, marking shift toward on-chain finance",
    "body": "From niche experiment to $7 billion market, tokenized US Treasurys are quietly becoming a major driver of institutional onchain yield.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      }
    ]
  },
  {
    "id": 56192728,
    "published": 1766424753000,
    "title": "BNB lags market despite break above $860 as scrutiny of Binance grows",
    "body": "The underperformance came over an investigation alleging Binance failed to stop suspicious transactions, despite agreeing to pay $4.3 billion to settle a U.S. criminal case in 2023.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Technical Analysis|BNB",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56192498,
    "published": 1766424250000,
    "title": "How US banks are quietly preparing for an onchain future",
    "body": "Behind the scenes, US banks are rebuilding core financial infrastructure so cash, custody and funds can move onchain under regulatory oversight.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 56193772,
    "published": 1766426463000,
    "title": "Binance Failed to Prevent Suspicious Accounts from Moving $144M After 2023 Plea Deal: Report",
    "body": "Details have been leaked of 13 suspicious Binance accounts which moved $144 million since the 2023 settlement, and $1.7 billion since 2021.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56194514,
    "published": 1766427547000,
    "title": "David Sacks calls CFTC, SEC picks a crypto regulation ‘dream team‘",
    "body": "Following Michael Selig's confirmation, White House official David Sacks said the SEC and CFTC were set to offer \"clear regulatory guidelines\" for digital assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56196063,
    "published": 1766430063000,
    "title": "5 Biggest Crypto Airdrops of 2025",
    "body": "Crypto users were the recipients of billions in \"free money\" token airdrops during 2025. Here's a look at the biggest.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 204,
        "NAME": "AIRDROP",
        "CATEGORY": "AIRDROP"
      }
    ]
  },
  {
    "id": 56198869,
    "published": 1766434599000,
    "title": "Thiel-Backed Crypto Hoarder ETHZilla Sells Tokens to Pay Debt",
    "body": "ETHZilla Corp., a cryptocurrency accumulator backed by billionaire Peter Thiel, appears to be shifting focus as investors abandon what was briefly one of the stock market’s hottest trades.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56199986,
    "published": 1766437224000,
    "title": "Dogecoin Weekly Fractal Hints At A Bigger Move Brewing",
    "body": "Dogecoin is doing that thing again, not pumping, not capitulating, just sitting there on the weekly like it’s waiting for a cue. And if you’re the type who still believes memes have market structure like in 2017 and 2021, one chart making the rounds on X says this is exactly what the pre-run “calm” has looked like before. Crypto analyst Cryptollica (@Cryptollica) posted a weekly DOGE chart marking four major structural points across the coin’s history, arguing the current stretch maps onto prior accumulation phases. “We are looking at a textbook fractal setup,” Cryptollica wrote. “The chart highlights four distinct structural points (1, 2, 3, 4). We are currently at Point 4, and the structure is rhyming perfectly with the pre-bull run accumulation phases of the past.” Will History Repeat For Dogecoin? The pitch is basically: zoom out, stop staring at intraday noise, and look at the cycle cadence. In his framing, Zones 1 and 2 were the “boredom phases,” the stretches where volatility dried up, price rounded out a base, and the market slowly rotated from weak hands to more patient holders. Zone 2, he says, was the launchpad that ultimately led into the 2021 face-melter. Related Reading: Dogecoin Holds The Floor, But Momentum Says Otherwise — A Critical Standoff Unfolds “Zones 1 & 2: These were the ‘boredom phases’ where volatility died, and smart money accumulated,” he wrote. “Zone 2 specifically was the launchpad for the massive 2021 parabolic run. Zone 4 (Current Price Action): We are seeing the exact same rounding bottom formation.” That “rounding bottom” bit matters, because it’s not the dramatic reversal traders love to screenshot. It’s the opposite. It’s price stabilizing, forming a heavy base, refusing to break down — and doing it slowly enough that most people stop paying attention. Which, again, is kind of the point. Then there’s the RSI argument, and it’s the cleaner one. Cryptollica highlighted a weekly RSI floor around the low-30s area, suggesting DOGE has repeatedly found major cycle bottoms when momentum reset to that band. “Look at the RSI indicator at the bottom. The red line (~32 level) acts as a historical floor,” he wrote. “Every single time the weekly RSI touched or hovered near this baseline (Points 1, 2, and 3), it marked a macro bottom. Now: The RSI has reset back to this critical support level.” Related Reading: Dogecoin Breakdown Ahead? Analyst Flags 2022-Style Signal That’s the “sellers are exhausted” claim — not because a candle says so today, but because the longer-term momentum gauge has already done the full trip down to where DOGE previously stopped bleeding out and started building again. And he’s not being subtle about what comes next, at least in the cleanest version of the fractal. “This isn’t just random noise; it’s a cyclical reset,” Cryptollica wrote. “The chart suggests we are in the ‘Golden Pocket’ for accumulation. If the fractal plays out like it did in 2020 (Zone 2), the current price action is simply the calm before the storm.” To be clear, fractals aren’t guarantees. DOGE isn’t trading in a vacuum, and the macro/liquidity backdrop can absolutely mess with tidy historical comparisons. But if history repeats for DOGE, the best days could be ahead. At press time, Dogecoin traded at $0.13294. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56201213,
    "published": 1766439478000,
    "title": "Arizona lawmaker proposes barring taxes on crypto and blockchain",
    "body": "Two bills and one resolution proposed by state lawmaker Wendy Rogers could allow Arizona voters to change the state's taxation laws applied to digital assets and blockchain.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56203621,
    "published": 1766444429000,
    "title": "Dogecoin Reclaiming $0.128 Support Could Signal The Perfect Chance For Long Positions",
    "body": "Dogecoin (DOGE) is trading above a price level that could determine whether its recent decline turns into a base or extends into deeper weakness. A crypto analyst has identified a critical support level at $0.128, which could change Dogecoin’s bullish outlook if it continues to hold above it. According to the analysis, holding above this key level could create the ideal conditions for investors seeking long positions. Analyst Identifies $0.128 As Critical Support For Dogecoin The Dogecoin price is above a make-or-break zone that could define its next significant price move and signal how investors position themselves in the long term. Market expert Crypto Tony has shared an updated outlook on Dogecoin, focusing on the importance of reclaiming the key support zone around $0.128 before considering long positions. Related Reading: Dogecoin Open Interest Crashes To April Levels, Here’s What Happened Last Time Notably, Crypto Tony has stated that a long setup could become more favorable and appealing if DOGE’s price can hold steadily above the $0.128 level. The support zone also emerges as Dogecoin’s price action shows early signs of stabilization after a sustained downside pressure. For the past few months, the meme coin has been in a decline, mirroring the broader market downturn and sustained risk-off sentiment. The analyst’s chart shows Dogecoin recently selling off sharply before finding temporary stability slightly above $0.128 a few days ago. The meme coin’s price is also trading below the highlighted horizontal line on the chart, which aligns closely with the support area. Visual projections on the chart further suggest a period of sideways movement between $0.128 and $0.130, followed by a potential breakout to the upside. Crypto Tony pinpoints a bullish target near $0.135, representing a more than 2.2% surge from Dogecoin’s price of $.0132, as of writing. Dogecoin Weekly Chart Signals Extended Correction Before Price Explosion Pseudonymous crypto analyst Cantonese Cat has also delivered a weekly analysis of Dogecoin, highlighting a prolonged corrective phase in its market structure. According to him, DOGE has already endured roughly 13 months of bearish price action, which aligns with a potential Wave 2 correction. The analyst stated that this downturn stage would precede an explosive Wave 3, which could see the meme coin’s price jump to new highs. Related Reading: Dogecoin Price Squeeze Maps Out Two Possible Scenarios From Here Cantonese Cat revealed in his analysis that his Dogecoin bullish setup may feel unlikely to many traders at the moment. This is especially true given that Dogecoin has been trending downwards for most of the year, failing to break out of its bearish position. Despite this, the analyst notes that the skepticism is precisely why the scenario remains plausible. The analyst’s chart shows that Dogecoin’s first wave has already completed, followed by a declining Wave 2. Price action is also interacting with multiple Fibonacci retracement levels while respecting a long-term downward trendline. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|Cantonese Cat|Crypto Tony|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt|Fibonacci retracement levels|meme coin",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56203353,
    "published": 1766443739000,
    "title": "Palmer Luckey’s Erebor hits $4.3B valuation as regulators advance bank charter",
    "body": "Luckey-backed Erebor raised $350 million at a $4.35 billion valuation as OCC and FDIC approvals signal momentum for crypto- and AI-focused banking.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 56203351,
    "published": 1766443735000,
    "title": "EU council endorses offline and online versions of digital euro",
    "body": "The Council of the European Union endorsed the launch of the European Central Bank’s digital euro in both an online and a privacy-focused offline version.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 56205288,
    "published": 1766448007000,
    "title": "The Gold-to-Bitcoin Rotation Narrative Gains Strength: A Data-Driven Review",
    "body": "Bitcoin is once again attempting to reclaim the $90,000 level, but price action remains capped below this key psychological threshold. Despite several short-lived relief rallies, momentum has failed to follow through, reinforcing growing concerns that the broader market structure is weakening. As volatility persists and upside attempts stall, an increasing number of analysts are beginning to openly discuss the possibility that Bitcoin may be transitioning into a bear market phase. Sentiment across derivatives and spot markets has turned noticeably more cautious, with risk appetite continuing to fade. Related Reading: Bitcoin Price Lags Network Utility: A Valuation Reset Is Underway In this context, a recent report by Darkfost draws attention to a familiar but controversial narrative: capital rotation from gold into Bitcoin. With gold setting a new all-time high above $4,420 per ounce, the idea that investors may soon shift capital toward Bitcoin is resurfacing across the market. Historically, this narrative has gained traction during periods when traditional safe-haven assets outperform, fueling speculation that Bitcoin could follow as an alternative store of value. However, Darkfost cautions that this assumption is far from well-grounded. While the rotation thesis has been widely repeated throughout this cycle, empirical evidence linking gold outperformance directly to sustained Bitcoin inflows remains weak. Rather than signaling an imminent bullish turn, the current setup suggests that Bitcoin remains vulnerable, caught between macro-driven narratives and deteriorating internal market structure. Testing the Gold-to-Bitcoin Rotation Thesis Darkfost emphasizes that the popular narrative of capital rotating from gold into Bitcoin lacks direct, verifiable evidence. To address this, he constructed a comparative framework to identify periods where such rotations may have occurred. He did this without assuming a causal relationship. The core issue, as he notes, is that on-chain and market data cannot conclusively prove that capital exiting gold is the same capital entering Bitcoin. To approximate potential rotation phases, Darkfost applied a simple but disciplined signal structure. A positive signal appears when Bitcoin is trading above its 180-day moving average while gold is trading below its own 180-day moving average. In theory, this configuration suggests relative strength shifting toward Bitcoin. Conversely, a negative signal is triggered when both Bitcoin and gold trade below their respective 180-day moving averages. Indicating a broad risk-off environment rather than a rotation. This methodology allows historical comparison across cycles, highlighting moments where relative performance diverged. However, the results challenge the simplicity of the narrative. As shown on the chart, these signals do not produce consistent or reliable outcomes. In several instances, supposed rotation periods failed to generate sustained upside for Bitcoin. At other times, Bitcoin rallied independently of gold’s trend. The takeaway is clear: capital rotation between gold and Bitcoin is not an absolute or mechanical process. Market behavior appears far more nuanced. Driven by broader macro conditions, liquidity dynamics, and investor positioning rather than a straightforward asset-to-asset rotation. Related Reading: Ethereum Traders Chase Upside With Historic Leverage – Breakout Fuel Or Fragile Setup? Price Struggles Below Key Moving Averages Bitcoin is attempting to stabilize after a sharp corrective phase, but the chart highlights that price action remains structurally fragile. BTC is currently trading just below the $90,000 level, an area that has flipped from support into near-term resistance following the recent breakdown. While the latest bounce shows short-term buying interest, it has not yet altered the broader bearish structure that formed after the October highs. From a trend perspective, Bitcoin is now trading below the 50-3D moving average (blue), which has started to slope downward, signaling weakening momentum. The failure to reclaim this level suggests that recent upside moves are corrective rather than impulsive. Related Reading: Legendary Bitcoin OG Deepens Ethereum Bet Despite Losses Exceeding $70 Million Below the current price, the 100-3D moving average (green) sits near the $85,000–$86,000 zone and has acted as interim support during the rebound. A sustained loss of this area would likely expose BTC to a deeper retracement toward the 200-3D moving average (red), currently rising near the low $80,000 region. The sell-off was accompanied by elevated volume. While the rebound has occurred on comparatively lighter participation, pointing to a lack of conviction from buyers. Structurally, Bitcoin is consolidating in a lower range. With lower highs and compressed volatility suggesting a pause rather than a trend reversal. For bulls, reclaiming and holding above $90,000 and the declining 50-3D moving average is critical to invalidate the bearish bias. Until then, price action favors range-bound trading with downside risk still present. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|bitcoin gold|Bitcoin news|bitcoin review|bitcoin vs gold|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56206290,
    "published": 1766449928000,
    "title": "Recent Bitcoin miner capitulation may signal bottom is near: VanEck",
    "body": "Bitcoin has often surged after sustained hashrate drops, a trend that would provide much-needed relief to many struggling Bitcoin miners at current prices.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56206987,
    "published": 1766451634000,
    "title": "XRP Enters The Quiet Accumulation Phase For Institutional Players",
    "body": "As the broader crypto markets remain fixated on volatility and short-term narratives, XRP is quietly transitioning into the accumulation phase. Institutional players are increasingly positioning in silence, favoring strategic accumulation over public signaling. This phase is rarely loud or obvious, and it’s defined by patience, regulatory awareness, and long-term infrastructure planning rather than short-term speculation. While the broader crypto market debates short-term price swings, a quieter story is unfolding behind the scenes. According to skipper_xrp’s post on X, institutions and banks are methodically positioning themselves, and the word on the street is that they’re betting big on XRP. Why Institutions Accumulate XRP In Silence Many analysts believe that the asset is entering a phase where price discovery could accelerate beyond the $100 mark, and this sudden price increase will come as a shock to investors. At the same time, the XRP Ledger is expanding beyond its traditional role in cross-border payment into decentralized media in the US. Related Reading: ‘Think Again’ Before Selling Your XRP; Expert Tells Investors Adding to the momentum, BXE is set to list on a major US exchange on January 21st, following its partnership with a leading node provider. The increased network activity means higher usage of the XRP Ledger with more XRP being burned. Despite BXE trading at $0.06 and a fixed supply of 500 million, many investors view it as undervalued. An investor and crypto trader known as Xaif Crypto has mentioned that from 2019 to 2021, MoneyGram actively integrated Ripple’s On-Demand Liquidity (ODL) service, by leveraging XRP as the bridge asset for real-time foreign exchange settlement. However, when the US SEC filed its lawsuit against Ripple in late 2020, regulatory uncertainty forced MoneyGram to suspend the partnership despite XRP proving its effectiveness as a liquidity bridge. Currently, with Ripple largely moved past its regulatory overhang and gaining clearer legal standing, the industry is revisiting questions that were left unresolved: Will banks and payment institutions return to an XRP-based liquidity solution? Nonetheless, if institutions prioritize speed, capital efficiency, and regulatory clarity, history suggests that XRP already demonstrated all of the benefits and can work at scale before it was paused. The only variable missing at the time was regulatory certainty. How Institutional-Grade Yield Comes To XRP Holders Crypto trader Xaif Crypto has also revealed upcoming features for the XRP Ledger. According to Xaif, the XRPL lending protocol, a protocol-native framework that underwrites credit built directly into the Ledger, enabling fixed-term and fixed-rate loans, is on the horizon. Related Reading: XRP Advances As A Recognized Digital Asset In Regulated Markets — Here’s How Each loan operates within a Single Asset Vault (SAV), which offers risk isolation per facility and supporting assets such as XRP and RLUSD. This design unlocks compliant, on-ledger lending for institutions and introduces a clear, structured pathway to institutional-grade yield for XRP holders. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|BXE|moneygram|ODL|Ripple|Ripple's On-Demand Liquidity|RLUSD|SAV|Single Asset Vault|Skipper_xrp|US SEC|Xaif Crypto|xrp|XRP Ledger|xrp news|XRP Price|XRPL|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56208648,
    "published": 1766455222000,
    "title": "Bitcoin Inflow Slowdown: CryptoQuant Founder Says Sentiment Could Take Months To Recover",
    "body": "The founder and CEO of on-chain analytics firm CryptoQuant has revealed how Bitcoin on-chain capital inflows have stalled over the last couple of months. Bitcoin Realized Cap Has Witnessed A Slowdown Recently In a new post on X, CryptoQuant founder and CEO Ki Young Ju has talked about how on-chain capital inflows have been weakening for Bitcoin recently. “After about 2.5 years of growth, realized cap has stalled over the past month,” noted Young Ju. The “Realized Cap” here refers to an on-chain capitalization model for Bitcoin that calculates its total value by assuming the value of each coin in circulation is equal to the price at which it was last transacted on the blockchain. Related Reading: Bitcoin & Ethereum Diverge: Longs Dominate BTC, While ETH Shorts Rise Since the last transaction of any coin is likely to represent the last instance of it changing hands, the price at that time can be considered as its current cost basis. Therefore, the Realized Cap is just a sum of the cost basis of the entire BTC supply. In other words, it tracks the capital that the investors used to purchase their tokens. Realized Cap had been enjoying growth for the last couple of years, but as the CryptoQuant founder has revealed, capital inflows have dropped off. This suggests a decline in sentiment around Bitcoin. The turnaround in sentiment is also visible through the analytics firm’s PnL Index, which incorporates key on-chain indicators to build a single valuation metric for BTC. The indicators in question are the MVRV Ratio, NUPL, and STH/LTH SOPR. The first two both deal with the amount of unrealized profit or loss held by the investors as a whole, while the latter provides a look into investor profit-taking. Below is the chart shared by Young Ju that shows the trend in the 365-day moving average (MA) of the Bitcoin PnL Index over the history of the asset. From the graph, it’s visible that the Bitcoin PnL Index saw its 365-day MA reach a high earlier in the year, implying that the coin had potentially become overvalued. Since then, the metric has seen a reversal to the downside. Currently, its value is still notably positive, so the cryptocurrency may be considered to be in a bullish phase, but historically, drawdowns have tended to lead into bear markets. Though there were a couple of instances where this pattern didn’t hold. One being the aftermath of the COVID crash and the other the decline that occurred in the early months of 2025. Related Reading: Ethereum Exchange Outflows Soar To $978M: Sign Of Dip Buying? So far, the indicator hasn’t shown signs of any turnaround back to the upside, although it should be noted that it’s an average over the past year, so there is some delay attached. Based on the on-chain trend, Young Ju has said, “Sentiment recovery might take a few months.” BTC Price Bitcoin has made recovery from last week’s plunge as its price is now back at $89,800. Featured image from Dall-E, CryptoQuant.com, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin inflows|Bitcoin Realized Cap|bitcoin sentiment|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56209756,
    "published": 1766457678000,
    "title": "Bitcoin Price Holds Firm, Upside Extension Now in Trader Focus",
    "body": "Bitcoin price started a decent recovery wave above $88,000. BTC is now consolidating below $89,000 and might aim for a fresh increase. Bitcoin started a recovery wave above the $87,500 zone. The price is trading above $87,500 and the 100 hourly Simple moving average. There is a bullish trend line forming with support at $87,900 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move up if it settles above the $89,100 zone. Bitcoin Price Eyes More Gains Bitcoin price attempted a fresh recovery wave above $87,500 and $88,000. BTC even cleared the $88,800 resistance and tested the $90,500 hurdle. A high was formed at $90,552 and the price is now consolidating gains. There was a minor decline below $89,000 and $88,500. The price dipped below the 23.6% Fib retracement level of the upward move from the $84,420 swing low to the $90,552 high. Bitcoin is now trading above $87,800 and the 100 hourly Simple moving average . There is also a bullish trend line forming with support at $87,900 on the hourly chart of the BTC/USD pair. If the price remains stable above the trend line, it could attempt more gains. Immediate resistance is near the $89,100 level. The first key resistance is near the $89,500 level. The next resistance could be $90,500. A close above the $90,500 resistance might send the price further higher. In the stated case, the price could rise and test the $92,000 resistance. Any more gains might send the price toward the $92,500 level. The next barrier for the bulls could be $93,200 and $93,500. Another Decline In BTC? If Bitcoin fails to rise above the $89,500 resistance zone, it could start another decline. Immediate support is near the $88,000 level and the trend line. The first major support is near the $87,500 level. The next support is now near the $86,750 zone and the 61.8% Fib retracement level of the upward move from the $84,420 swing low to the $90,552 high. Any more losses might send the price toward the $85,450 support in the near term. The main support sits at $84,500, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $88,000, followed by $87,500. Major Resistance Levels – $89,500 and $90,500.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56210405,
    "published": 1766458842000,
    "title": "BlackRock pins Bitcoin ETF as major theme alongside T-bills, tech stocks",
    "body": "BlackRock’s IBIT Bitcoin ETF has featured on the $13.5 trillion asset manager's homepage, representing one of three major investment themes as the market heads into 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56211418,
    "published": 1766460763000,
    "title": "Bitcoin perpetual open interest rises as traders bet on year-end rally",
    "body": "Bitcoin perpetual open interest climbed to 310,000 BTC while funding rates doubled, signaling bullish positioning for the year-end.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56212340,
    "published": 1766462424000,
    "title": "Here’s Why This Bitcoin Bounce Is Designed To Hurt The Most",
    "body": "Bitcoin’s recent bounce may look like a sign of renewed strength, but the price action tells a more deceptive story. With downside liquidity still thin and support holding firm, the market appears primed for a move that draws in eager bulls rather than rewarding them. This rally could be less about recovery and more about setting the stage for maximum pain when sentiment flips. Aligning The Mid- And Long-Term Bitcoin Outlook During an in-depth technical and psychological analysis, Mr. Wall Street explained that his broader outlook on Bitcoin had already been clarified a week earlier, after some confusion around his mid and long-term stance. With those time horizons now clearly defined, he turned his focus to the short-term picture, outlining current market behavior. Related Reading: Bitcoin In Standby Mode: Weekend Ranges Rule Before Holiday ‘Chop’ He reiterated that while his mid-term bias on Bitcoin remains bearish, the short-term structure has turned bullish. The reason centered on insufficient downside liquidity to justify market makers initiating the next major leg lower. This imbalance supported the case for a temporary relief move to the upside. Thus, Mr. Wall Street placed long positions around the Value Area Low between $80,000 and $84,000 on a bounce that could later evolve into a bull trap. Shortly after, Bitcoin dipped and successfully retested the $84,000 level, which aligns with the weekly MA100, following several deceptive upside moves. As a result, his long orders were filled as planned, leaving him holding a position from $84,550. The analyst noted that he plans to exit only in the $98,000–$104,000 zone, where a Fair Value Gap converges with heavy liquidity, making it an ideal area to take profit. Being In Longs Doesn’t Change The Macro Bearish Thesis Mr. Wall Street clarified that holding long positions does not signal a bullish shift on Bitcoin. The broader outlook remains bearish, with expectations for the next major downside move toward the $64,000–$70,000 region. In the short term, Bitcoin is sitting at strong support while downside liquidity is limited, which reduces the probability of an immediate continuation lower. Related Reading: Citi Analysts Project Bitcoin Price Could Reach $189,000 Next Year In Bullish Scenario A more logical scenario involves market makers engineering a bullish move to attract retail participation. As late buyers enter long positions, they gradually become exit liquidity, setting the stage for a larger downside move once sufficient liquidity is built. He also mentioned the $68,000–$74,000 zone had become too widely anticipated to function as a true “maximum pain” area capable of resetting market structure. For that reason, the downside target was revised lower to the $64,000–$70,000 range, with expectations that this zone could be reached in late Q1 or early Q2 of 2026. This level represents an initial major target rather than the final bottom. Recent price action was highlighted as a clear example of these dynamics. Bitcoin’s rapid move from $87,000 to $90,000, followed by a sharp drop to $85,000 within hours, resulted in widespread liquidations. Many traders chased the upside and were quickly trapped, and fake moves in both directions are likely to continue as liquidity is built ahead of a larger move lower. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|m&a|Mr. Wall Street|Value Area Low",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56212631,
    "published": 1766462881000,
    "title": "XRP Price Trims Upside, Slow Decline Signals Seller Dominance",
    "body": "XRP price started a decent increase above $1.920. The price is now correcting gains and might struggle to stay in a positive zone. XRP price started a downside correction and tested the $1.880 zone. The price is now trading below $1.90 and the 100-hourly Simple Moving Average. There is a declining channel or a possible bullish flag pattern forming with resistance at $1.9250 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could start another increase if it clears $1.950. XRP Price Fails At Resistance XRP price started a downside correction from the $1.950 zone, like Bitcoin and Ethereum . The price dipped below the $1.920 and $1.90 levels to enter a consolidation phase. The price even dipped below the 23.6% Fib retracement level of the upward move from the $1.770 swing low to the $1.9578 high. However, there is a declining channel or a possible bullish flag pattern forming with resistance at $1.9250 on the hourly chart of the XRP/USD pair. The price is now trading below $1.90 and the 100-hourly Simple Moving Average. If there is a fresh upward move, the price might face resistance near the $1.90 level. The first major resistance is near the $1.920 level, above which the price could rise and test $1.950. A clear move above the $1.950 resistance might send the price toward the $2.00 resistance. Any more gains might send the price toward the $2.050 resistance. The next major hurdle for the bulls might be near $2.120. More Losses? If XRP fails to clear the $1.920 resistance zone, it could start a fresh decline. Initial support on the downside is near the $1.8650 level and the 50% Fib retracement level of the upward move from the $1.770 swing low to the $1.9578 high. The next major support is near the $1.8420 level. If there is a downside break and a close below the $1.8420 level, the price might continue to decline toward $1.8150. The next major support sits near the $1.770 zone, below which the price could continue lower toward $1.720. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $1.8650 and $1.8420. Major Resistance Levels – $1.920 and $1.950.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56214704,
    "published": 1766466011000,
    "title": "New Crypto Tax Proposal: Bipartisan House Duo Pushes For Stablecoin Safe Harbor",
    "body": "In the wake of a significant shift in crypto regulation spurred by the new White House administration under President Donald Trump, lawmakers are working on a fresh tax framework aimed at providing clarity and a safe harbor for certain transactions involving stablecoins. Proposed Crypto Tax Framework Representatives Max Miller from Ohio and Steven Horsford from Nevada have drafted a preliminary proposal that seeks to align the tax treatment of cryptocurrencies with that of traditional securities. According to a recent report by Bloomberg, the draft consists of a blend of policy objectives and bill language not yet formally approved. Related Reading: Pundit Shares Why XRP Will Become Expensive And A $1,000 Price Tag Is Possible One of the key features of this draft legislation is its aim to exempt capital gains tax for transactions involving regulated stablecoins. Specifically, the proposal proposes to shield transactions that consistently maintain a value between $0.99 and $1.01 from taxation. However, this exemption is limited to transactions under $200, and the final text may modify which tokens will qualify for this safe harbor, as advised by aides to both congressmen. The proposal also attempts to establish safe harbors for rewards earned through activities like staking, which involves verifying blockchain transactions. Representative Miller emphasized that “America’s tax code has failed to keep pace with modern financial technology.” He described the bipartisan bill as a means to inject clarity, fairness, and common sense into the taxation of digital assets. The proposed draft also addresses the taxation of rewards earned through staking and mining cryptocurrencies, which involves verifying transactions within blockchain networks. Aligning Digital Assets With Securities Tax Regime Under guidance from the Internal Revenue Service (IRS) issued during the Biden administration, rewards obtained from staking are taxed at the time of receipt. Republican lawmakers have voiced concerns regarding this approach, arguing that it taxes assets before owners realize a gain. Conversely, Democrats maintain that these rewards should be classified as compensation and taxed upon receipt. To navigate this divide, Miller and Horsford aim to find a compromise, allowing taxpayers to defer tax on rewards for up to five years. After this period, the rewards would be taxed as income based on their fair market value. Pro-crypto Senator Cynthia Lummis, who recently announced that she will not be running for re-election next year, had previously introduced crypto tax legislation that would leave such rewards untaxed until they are sold. This legislation would align more closely with industry preferences. Related Reading: Saylor Sparks Bitcoin Speculation With ‘Green Dots’ Signal Additionally, the draft aims to bring digital assets under the same tax regime that governs securities and, in some cases, commodities transactions. It proposes to include cryptocurrencies in capital gains tax exemptions for foreign investors trading securities through US-based intermediaries like brokers or exchanges. Furthermore, the plan would permit cryptocurrency traders to utilize mark-to-market accounting, allowing them to recognize unrealized gains and losses based on fair market value at the end of each year. The proposed legislation also seeks to impose restrictions on deducting losses from wash trades for digital assets and “close existing loopholes” that facilitate transactions designed to lock in cryptocurrency gains while postponing the associated tax liability. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto|crypto market|crypto news|crypto tax|Crypto tax proposal|Crypto tax regulations|cryptocurrency|US crypto news|US crypto regulation",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56214964,
    "published": 1766466387000,
    "title": "Bitcoin heads for its worst year since 2018 as traders see further fatigue",
    "body": "Data from CoinGlass shows bitcoin is down more than 22% so far in the fourth quarter, making 2025 one of the weakest year-end periods outside of major bear markets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56217204,
    "published": 1766469620000,
    "title": "Dogecoin Breaks Key Support as Traders Reassess Long-Term Outlook Ahead of 2026",
    "body": "Dogecoin’s (DOGE) drop below a long-held support level has pushed traders and long-term holders to reassess the token’s outlook heading into 2026. Once viewed as relatively resilient within the speculative crypto space, DOGE is now under pressure after losing key technical structure and momentum. Related Reading: Bitcoin Feels The Weight Of Quantum Risk Concerns, Industry Leaders Warn DOGE is down about 66% over the past year and trades near $0.13, far below levels that previously drew consistent buying. The decline reflects thinner liquidity, weaker speculative interest, and a market increasingly favoring assets with clearer narratives, suggesting that market size alone may no longer be a price support. DOGE's price trends to the downside on the daily chart. Source: DOGEUSD on Tradingview Key Support Gives Way as Selling Pressure Builds In the past week, Dogecoin (DOGE) slipped below the $0.129 area, a level that had capped losses through several consolidation phases. The breakdown was accompanied by elevated trading volume, signaling active selling rather than a slow drift lower. Intraday volatility expanded to around 4%, reflecting heightened sensitivity as traders reacted to the loss of range support. Technical analysts note that DOGE has also broken a multi-year ascending trendline that guided price action through much of the 2024 cycle. On shorter timeframes, the token now trades below key moving averages, with rebounds toward $0.132–$0.134 consistently meeting selling interest. Technical Signals Point to a Fragile Dogecoin Structure Momentum indicators continue to lean lower, and several analysts warn that failure to hold the nearby $0.128 level could expose DOGE to deeper downside. Below that, the next widely watched support zone sits near $0.090, implying a potential decline of around 30% from current levels if bearish pressure accelerates. Ichimoku-based signals have also turned negative, reinforcing the view that the broader trend has shifted. While short-term countertrend patterns occasionally emerge, they carry less weight against the backdrop of a confirmed break in higher-timeframe structure. Long-Term Outlook Faces a Test Into 2026 Beyond charts, Dogecoin’s longer-term outlook remains uncertain. Spot DOGE ETFs launched in late 2025 introduced a new source of demand, but it is still unclear whether that capital will prove sticky enough to offset ongoing selling. Meanwhile, discussions around adding utility through sidechains or layer-2 solutions continue within the developer community, though progress has been slow and fragmented. Related Reading: Pundit Shares Why XRP Will Become Expensive And A $1,000 Price Tag Is Possible Dogecoin is still the largest meme coin by market value, but that status alone does not provide a clear investment thesis. As 2026 approaches, traders appear increasingly focused on whether DOGE can stabilize above broken support and attract sustained demand. Cover image from ChatGPT, DOGEUSD chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|Doge price|dogeusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56217923,
    "published": 1766423339000,
    "title": "Tokenized US Treasurys surge 50x since 2024, marking shift toward onchain finance",
    "body": "From niche experiment to $7 billion market, tokenized US Treasurys are quietly becoming a major driver of institutional onchain yield.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      }
    ]
  },
  {
    "id": 56219724,
    "published": 1766473234000,
    "title": "XRP ETFs Record 25-Day Streak As Price Eyes Key Resistance Level",
    "body": "While most leading crypto-based Exchange-Traded funds (ETFs) recorded significant outflows last week, XRP investment products went against the current and attracted over $80 million in inflows, ending the week with a green performance. Related Reading: Analyst Shares ‘Cold, Hard Truth’ For Bitcoin Investors As Price Struggles XRP ETFs Steal The Spotlight XRP ETFs continue to show strong demand, recording a 25-day streak last Friday and closing the week with a positive net flow. Notably, crypto investment products registered a negative performance last week, seeing nearly a billion dollars in outflows. According to CoinShares’ weekly report, digital asset-based funds ended the week in the red for the first time in four weeks, with outflows totaling $952 million. This marks the products’ fourth-worst weekly performance of the year. CoinShares’ Head of Research, James Butterfill, suggested that the negative market reaction was fueled by the delays in the US crypto market structure bill, which was initially anticipated to be passed before the end of the year. This “has prolonged regulatory uncertainty for the asset class, alongside concerns over continued selling by whale investors,” the report noted. The negative market sentiment was mostly focused in the US, which recorded $990 million in outflows last week. Ethereum (ETH) funds suffered the largest outflows, registering $555 million in negative net flows. Meanwhile, Bitcoin (BTC) investment products came in second with $460m in outflows. On the contrary, XRP ETFs saw overall support with positive net flows throughout the whole week. According to SoSoValue data, the category closes the week with $82.04 million in inflows, marking a 6-week positive streak. XRP’s Correction Already Over? Amid this performance, XRP’s price also ended the week recovering from the latest market correction, which sent its price to a two-month low of $1.77. Market observer BitGuru affirmed that XRP has completed its downtrend and liquidity grab, and is currently stabilizing at a key historical demand zone. Per the analyst, “selling pressure is fading, structure is flattening, and this is where smart money usually starts positioning, not where panic happens.” Similarly, trader Niels suggested that XRP’s corrective phase may be over as it appears to be forming a double bottom pattern. “RSI has bottomed out already, and now the price is showing good signs too,” the trader affirmed, adding that “XRP had a fakeout below the support level before reclaiming the zone.” To Niels, if the market shows momentum, the cryptocurrency could surge 20%-25% toward the $2.30-$2.50 area in the next few weeks. Recently, the trader affirmed that once XRP breaks above the $2.20 resistance, where the pattern’s neckline is situated, it could rally to the $2.80-$3.00 area within a month. Related Reading: Fundstrat Predicts Ethereum Drop To $1,800 In H1 2026 Meanwhile, analyst ChartNerd highlighted a bullish divergence on XRP’s chart. “Price action is adhering to the lower low price action trendline whilst forming higher lows on the RSI,” he explained, suggesting that price could move to higher levels. He also noted that if the altcoin fails to break the 20 EMA, currently around the $1.98 level, the price would “simply resort back to the lower low trendline for support, where we likely see more relief.” As of this writing, XRP is trading at $1.93, a 1.1% increase in the weekly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|coinshares|crypto analyst|Crypto ETFs|crypto market correction|Crypto Market Recovery|Crypto trader|ethereum|xrp|XRP ETFs|XRP Price|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56219357,
    "published": 1766472349000,
    "title": "Aave falls 18% over week as dispute pulls down token deeper than major crypto tokens",
    "body": "The move added to selling pressure that had already been building since the governance proposal moved to a Snapshot vote.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56222228,
    "published": 1766476833000,
    "title": "Bitcoin Perps Heat Up Again As Leveraged Longs Rise",
    "body": "Data shows traders have set up fresh Bitcoin positions on the perpetual futures market during the past day, and the Funding Rate suggests they are long bets. Bitcoin Open Interest Has Witnessed An Uptick According to data from on-chain analytics firm Glassnode, the surge Bitcoin has seen to kick off Monday has come alongside a spike in the Bitcoin perpetual futures Open Interest. Related Reading: Bitcoin Inflow Slowdown: CryptoQuant Founder Says Sentiment Could Take Months To Recover The “Open Interest” refers to an indicator that keeps track of the total amount of BTC perpetual futures positions that are currently open on all derivatives exchanges. When the value of this metric rises, it means the investors are opening up fresh positions on the market. Since such a trend usually accompanies an increase in leverage for the sector, it can lead to more volatility for the asset. On the other hand, the indicator going down implies investors are either pulling back on risk or getting liquidated by their platform. This kind of trend can result in the cryptocurrency’s price behaving in a more stable manner. Now, here is a chart that shows the trend in the Bitcoin Open Interest over the last couple of weeks: As displayed in the above graph, the Bitcoin Open Interest rose from 304,000 BTC to 310,000 BTC as the cryptocurrency observed a recovery surge to $90,000 during the past day. This represents an increase of about 2%, which isn’t much, but still signals that the rally encouraged traders to open up new positions on the perpetual futures market. The Open Interest includes both types of positions when calculating its value, so it contains no information about whether positions have a bias toward shorts or longs. Another metric called the Funding Rate can be used to determine that instead. This indicator measures the amount of periodic fee that perpetual futures traders are exchanging between each other. A positive value implies long investors are paying a premium to the shorts in order to hold onto their positions, while a negative one implies bearish bets are dominant. Related Reading: Ethereum Exchange Outflows Soar To $978M: Sign Of Dip Buying? As the below chart shows, the Bitcoin Funding Rate has been positive for much of the last two weeks, indicating that a bullish sentiment has been shared by the majority of perpetual futures traders. This metric also noted an uptick alongside the increase in the Open Interest, going from 0.04% to 0.09%. “This combination signals a renewed buildup in leveraged long positioning, as perpetual traders position for a potential year-end move,” noted Glassnode. BTC Price Bitcoin has seen a bit of a pullback since its surge above $90,000 as its price is now back at $89,500. The trend in the price of the coin over the last five days | Source: BTCUSDT on TradingView Featured image from Dall-E, Glassnode.com, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin Funding Rate|bitcoin futures|Bitcoin Open interest|Bitcoin Perpetual Futures|Bitcoin Perps|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56222184,
    "published": 1766476633000,
    "title": "Bybit to discontinue services for Japanese residents, citing regulations",
    "body": "Bybit will phase out services for Japan-based users starting in 2026, following earlier steps to halt new registrations.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56224958,
    "published": 1766480436000,
    "title": "Hageman video fuels Senate chatter as Lummis leaves Wyoming seat open",
    "body": "Harriet Hageman’s “Soon” teaser on X sharpens talk of a 2026 Senate bid to replace crypto ally Cynthia Lummis, raising the stakes for Wyoming’s pro‑crypto brand.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56225086,
    "published": 1766407181000,
    "title": "Bitcoin ‘Santa rally’ targets $120K as key BTC metric flips bullish",
    "body": "Bitcoin approached $90,000 amid Santa rally speculation, backed by bullish derivatives and chart patterns that target a BTC price above $100,000.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56226146,
    "published": 1766482239000,
    "title": "Altcoin Season Index Crashes To Low 17 As Bitcoin Price Struggles, What This Means",
    "body": "There’s been a major shift in profitability since the Bitcoin price crashed from $126,000, and altcoins have borne the brunt of it. With major altcoins down between 30% and 80% from their all-time high values, calls for an altcoin season have gone down drastically. This has been reflected in the performance of the Altcoin Season Index, falling to one of the lowest recorded levels in 2025 as the year draws to an end. Altcoin Season Index Says Losses Are The Order Of The Day The Altcoin Season Index Chart on the CoinMarketCap website, which tracks the performance of altcoins against Bitcoin, has now fallen below 20 again. This index collates the performance of the top 100 altcoins in the market, comparing their 90-day performance to that of Bitcoin, in order to pinpoint whether the market is currently experiencing an altcoin season. Related Reading: Bitcoin Price Remains Stuck Inside This Range, But A Breakout Could Follow The index ranks the performance on a scale of 1-100, depending on how many altcoins out of the top 100 are outperforming Bitcoin, and uses that to score the market. At the time of writing, the Altcoin Season Index was sitting at a score of 17, which means only 17 of the top 100 altcoins have seen a better performance than Bitcoin in the last 90 days. With the index’s score sitting this low, it suggests that altcoins are currently in a bear market. Additionally, Ethereum, which is often the altcoin leader when it comes to an alt season, is still underperforming compared to Bitcoin. The second-largest cryptocurrency has recorded a 28.30% decrease in the last 90 days, while Bitcoin is down 21.10% in comparison. How To Know If Altcoins Are In A Bull Run? To know if the altcoin market is experiencing an altcoin season, the index would have to read at a score of 75 or higher. This is when the majority of altcoins are outperforming Bitcoin in a 3-month period, and their combined market cap surpasses that of the leading cryptocurrency. Related Reading: Pundit Shares Why XRP Will Become Expensive And A $1,000 Price Tag Is Possible Scores lower than 75 suggest that the market is yet to enter a full-blown altcoin season, and the lower it goes, the higher the chances that altcoins are experiencing a bear market. However, the higher the Altcoin Season Index score is, nearing 100, the more likely it is that the altcoin market may be experiencing a top. Altcoin seasons are often characterized by rapid increases in price, with 100% rallies on a daily basis being the norm. The last major altcoin season was back in 2021, and while the expectation was that another altcoin season would begin in 2025, this has not been the case. Featured image from Dall.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|altcoin|altcoin news|Altcoin Season|altcoins|Altcoins news|crypto|crypto adoption|crypto market|crypto news|cryptocurrency|cryptocurrency market",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56225714,
    "published": 1766481387000,
    "title": "Ether ETFs break outflow streak while XRP products hit multi-week highs",
    "body": "Altcoin ETF flows are beginning to diverge, with Ether stabilizing, XRP drawing steady demand and smaller funds getting uneven traction.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56231064,
    "published": 1766489383000,
    "title": "Crypto Markets Today: Cardano-based NIGHT crashes, ZEC, XMR also drop",
    "body": "Most tokens that debuted this year are trading below their initial valuations.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|Markets|market analysis|Derivatives|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 57,
        "NAME": "XMR",
        "CATEGORY": "XMR"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56231627,
    "published": 1766490171000,
    "title": "ZOOZ's Bitcoin treasury play faces Nasdaq delisting clock",
    "body": "ZOOZ’s minimum bid‑price notice makes it the latest Bitcoin treasury stock to brush up against Nasdaq’s listing rules.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56232121,
    "published": 1766490806000,
    "title": "Bitcoin's growing roadblock: The trendline from $126,000 limits gains",
    "body": "Trendline from record highs capped BTC's recovery attempt Monday.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Technical Analysis|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]