[
  {
    "id": 57402508,
    "published": 1769131659000,
    "title": "Capital One to Acquire Fintech Company Brex for $5.15 Billion",
    "body": "The deal brings a startup-focused spend platform with artificial intelligence and stablecoin capabilities into a major U.S. bank.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 57403034,
    "published": 1769133621000,
    "title": "Bitcoin At The Core: ARK Sees $28 Trillion Digital Asset Future",
    "body": "ARK Invest’s new roadmap puts a big number on the table, and it’s hard to ignore. Reports say Cathie Wood’s firm’s “Big Ideas 2026” research paints a scenario where the total value of crypto climbs to about $28 trillion by 2030. Related Reading: Trove’s New Token Craters 95%, Sparking Investor Revolt Big Ideas Point To A Shift According to ARK and its public writeups, that $28 trillion is not blind optimism. The firm breaks the future into three main drivers: Bitcoin, decentralized finance, and tokenized real-world assets. Reports note Bitcoin could make up roughly 70% of that total, which would mean about $16 trillion in Bitcoin market cap by 2030. DeFi And Tokenized Assets Take The Stage DeFi platforms and smart-contract networks are expected to grow a lot. ARK’s scenario puts smart money and on-chain services as a major contributor to market value in the run up to 2030. The firm also projects tokenized real-world assets — things like tokenized bonds, property shares, and other financial products moved onto ledgers — to climb into the trillions, with some reports pointing toward around $11 trillion for tokenization. How Bitcoin Fits Into The Picture Given the share ARK assigns to Bitcoin, the math pushes toward very large per-coin prices if that scenario plays out. Reports say ARK’s base case uses a little over 20 million Bitcoins in supply by 2030 and implies a per-coin price that could sit near the high hundreds of thousands — commonly quoted numbers range up to about $950,000 to $1,000,000 in that framework. Fast Growth Assumptions To reach $28 trillion, the forecast depends on very steep growth each year. ARK points to an implied compound annual growth rate near 61% from present levels to 2030. That is aggressive. It would mean rapid gains across many segments of the crypto market, not just a single rally. Related Reading: Bitcoin’s Sharp Reversal Leaves Over $800 Million Liquidated In 1 Day Reports and industry analysts warn that the path to that future has a long list of hurdles. Regulation must become clearer in many places. Institutional rails and custody tools need to expand and prove reliable. Market sentiment has to stay positive long enough for major capital flows to arrive. Any of these things going wrong would change the numbers quickly. ARK’s “Big Ideas 2026” details a robust vision of a $28 trillion ecosystem driven by Bitcoin, DeFi, and tokenization. Although it holds a rather ambitious 61% growth trajectory riddled with numerous regulatory and market obstacles, the vision reinforces the faith of ARK Invest in the transformation of the digital asset space from being a speculative domain to the nucleus of the global finance system. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|ark invest|bitcoin|Cathie Wood|crypto|DeFi|digital currency|Stablecoins",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57403984,
    "published": 1769137232000,
    "title": "Bitcoin Supply In Profit Stalls At 71%: Still Not Enough For A Sustainable Recovery",
    "body": "Bitcoin is facing a critical test as volatility returns and price action remains unstable around the $90,000 level. Bulls are attempting to defend this psychological zone after recent turbulence, but confidence across the market is still fragile. With uncertainty dominating short-term sentiment, many traders are treating every bounce as a potential trap rather than the start of a confirmed recovery. Related Reading: Bitcoin’s Power Shift: New Whales Now Control The Market According to top analyst Darkfost, the market is still missing a key ingredient for a sustainable bullish continuation: a broad base of investors sitting in profit. He argues that despite Bitcoin’s resilience, there are not yet enough participants in positive territory to build the kind of structural comfort that fuels long-lasting uptrends. This matters because latent profits are not inherently bearish. In healthy conditions, when most holders are in profit, the market tends to stabilize. Investors feel less pressure to sell, panic fades, and holding becomes easier. That environment often supports stronger trend development and reduces the risk of sharp downside reactions. Still, Darkfost warns that profit dynamics only help up to a point. When unrealized gains become extreme across the entire market, they can eventually turn into overhead supply, triggering corrective phases. Bitcoin’s Profit Structure Still Isn’t Bullish Enough Profit distribution across holders can become a double-edged sword for Bitcoin. When the supply in profit climbs above 95% and approaches 100%, unrealized gains stop being supportive and begin turning into overhead pressure. At those extremes, investors have little incentive to hold through volatility, and even small shocks can trigger profit-taking that fuels corrective phases. From a structural perspective, Darkfost argues the market needs to reclaim the 75% supply-in-profit threshold to rebuild a healthier foundation. Historically, Bitcoin has tended to sustain bullish conditions when this metric holds above that level, as most participants remain comfortable and less reactive to downside volatility. Right now, however, the market sits near 71%, after dropping as low as 64%. Darkfost notes that readings this low have often appeared near the early stages of bear markets, even when the headline drawdown looks relatively contained. In this case, the decline of roughly 31% was enough to push a large portion of recent buyers underwater, suggesting many entered late in the move. The recent rebound briefly lifted supply in profit back to 75%, but it failed to hold. That rejection likely reflects investors using the bounce to exit at breakeven or reduce losses. Going forward, reclaiming 75%–80% would signal stabilization, while further weakness could amplify panic-driven selling. Related Reading: Ethereum Supply Tightens On Binance As Reserves Hit Lowest Level Since 2016 Volatility Keeps Bulls on the Defensive Bitcoin is attempting to stabilize near the $90,000 mark after a volatile correction that reshaped the market structure over the past few months. The chart shows BTC printing a major peak around $125,000 before rolling over into a sharp selloff. Accelerating into November and eventually finding a local floor near the mid-$80,000s. That drop marked a decisive break in momentum and triggered a shift toward a lower range, where price has struggled to regain prior support levels. Since the rebound off the lows, Bitcoin has moved into a consolidation phase, repeatedly testing resistance around $92,000–$95,000 but failing to generate sustained continuation. Each recovery attempt has been met with selling pressure, suggesting that short-term supply is still active near former breakdown zones. The latest bounce back toward $90,000 signals buyers are defending the level. But the structure still looks fragile without a clean breakout. Related Reading: Binance Order Flow Suggests Ethereum Is In Correction Mode: Demand Still Missing Volume also reflects uncertainty, with higher activity during selloffs and more muted participation during rebounds. Bulls likely need to hold $88,000–$90,000 and reclaim the $92,000 region with conviction. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|Bitcoin news|bitcoin recovery|Bitcoin supply|Bitcoin Supply In Profit|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57404972,
    "published": 1769140807000,
    "title": "Bitcoin Influencers Get Spotlight In X’s New ‘Starterpacks’",
    "body": "X is rolling out a feature called Starterpacks that will let new users follow ready-made groups of accounts tied to specific interests. It’s designed to make finding people to follow faster, and yes — that includes lists focused on Bitcoin and other crypto topics. Related Reading: Bitcoin’s Sharp Reversal Leaves Over $800 Million Liquidated In 1 Day Reports say the company has spent months building these curated sets and plans to launch them in the coming weeks. Starterpacks Include Crypto And Hundreds Of Categories According To X’s product team, the feature will span more than 1,000 interest categories so people can join subject feeds without hunting around. Some packs will pull together prominent Bitcoin commentators, active traders and market watchers so newcomers land in front of the right conversations quickly. The idea echoes a feature that already exists on rival apps, but X’s lists are picked internally rather than built by users. Over the last few months, we scoured the world for the top posters in every niche & country We’ve compiled them into a new tool called Starterpacks: to help new users find the best accounts—big or small—for their interests ⬇️ Reply below with a topic you’re most interested in… pic.twitter.com/MYIIQAaJaL — Nikita Bier (@nikitabier) January 21, 2026 Why Crypto Is Getting Special Attention Reports note that crypto chatter on X cooled last year. Posts mentioning Bitcoin fell by a noticeable margin in 2025, according to platform watchers who track engagement. That slide appears to have pushed product staff to make it easier to surface crypto creators again. The change is meant to reduce friction for users who want to jump into market talk without following dozens of accounts one by one. A Look At How The Packs Work Each Starterpack groups a small set of accounts around a theme. Users can accept a pack as a starting point and then add or remove people just like that. Some packs will be regional, while others target hobbies or professional beats. The lists were assembled by the product team after a global search for active voices in each niche. In practice, this means a newly joined user could pick a crypto pack and instantly follow a mix of analysts, podcasters and traders. Community Reaction Has Been Mixed Crypto users on X had already been vocal about visibility and moderation. A number of creators welcomed any effort that helps their posts reach new readers. Other people worried that curated packs could favor certain voices over others or steer attention away from smaller accounts. Debate over how feeds are shaped is expected to continue as Starterpacks roll out. Related Reading: Trove’s New Token Craters 95%, Sparking Investor Revolt What To Watch Next Product updates will appear gradually. Reports say the rollout will start in the coming weeks, and X’s team will likely adjust the approach based on feedback. For people who follow Bitcoin and crypto, Starterpacks could mean quicker discovery and more steady streams of market talk. For the platform, it’s one more attempt to make joining feel less like starting from scratch. Featured image from Getty Images, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|crypto|elon musk|influencers|Starterpacks|X",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57405182,
    "published": 1769141555000,
    "title": "Capital One bank buys stablecoin fintech Brex for $5.15B",
    "body": "Capital One acquired Brex, potentially gaining stablecoin capabilities just months after the fintech launched support for the tokens.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 57405109,
    "published": 1769141284000,
    "title": "XRP Price Signals Trouble As Bears Prepare Another Push Lower",
    "body": "XRP price extended losses and traded below $1.920. The price is now consolidating and might decline further if it remains below $1.980. XRP price started a fresh decline below the $1.920 zone. The price is now trading below $1.9250 and the 100-hourly Simple Moving Average. There are two bearish trend lines forming with resistance at $1.95 and $2.00 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move down if it stays below $1.950. XRP Price Dips Again XRP price failed to stay above $2.00 and started a fresh decline, like Bitcoin and Ethereum . The price declined below $1.950 and $1.9350 to enter a short-term bearish zone. The price even spiked below $1.920. A low was formed at $1.90, and the price is now consolidating losses. There was a recovery wave above $1.9120. The price cleared the 23.6% Fib retracement level of the downward move from the $1.987 swing high to the $1.90 low, but the bears remained active. The price is now trading below $1.950 and the 100-hourly Simple Moving Average. If there is a fresh upward move, the price might face resistance near the $1.9450 level and the 50% Fib retracement level of the downward move from the $1.987 swing high to the $1.90 low. There are also two bearish trend lines forming with resistance at $1.95 and $2.00 on the hourly chart of the XRP/USD pair. The first major resistance is near the $2.00 level and the second trend line. A close above $2.00 could send the price to $2.050. The next hurdle sits at $2.10. A clear move above the $2.10 resistance might send the price toward the $2.120 resistance. Any more gains might send the price toward the $2.150 resistance. The next major hurdle for the bulls might be near $2.20. Downside Break? If XRP fails to clear the $1.95 resistance zone, it could start a fresh decline. Initial support on the downside is near the $1.90 level. The next major support is near the $1.870 level. If there is a downside break and a close below the $1.870 level, the price might continue to decline toward $1.8480. The next major support sits near the $1.820 zone, below which the price could continue lower toward $1.7880. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $1.90 and $1.870. Major Resistance Levels – $1.950 and $2.00.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57405041,
    "published": 1769140916000,
    "title": "South Korea loses millions of seized Bitcoin to phishing scam: Report",
    "body": "Prosecutors in South Korea have reportedly lost $47 million worth of seized Bitcoin through a phishing attack and are investigating and tracking the theft.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57405011,
    "published": 1769140908000,
    "title": "Crypto’s 2025 ‘whipsaw’ year drove capitulation as markets look toward a 2026 rebound, Pantera says",
    "body": "In its ‘Navigating Crypto in 2026’ outlook, the fund says non-bitcoin tokens have been sliding since late 2024, weighed down by weak value capture, slowing on-chain activity, and fading retail flows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Altcoins|Pantera Capitol|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57405442,
    "published": 1769142641000,
    "title": "Dogecoin falls 2% as liquidation pressure hits meme coins",
    "body": "Trading remains a sell-the-rally environment, with resistance entrenched around $0.126 to $0.127 and only tentative, short-lived bounces emerging on intraday.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57406041,
    "published": 1769144541000,
    "title": "Bitcoin Profit Cycle Turns Negative for First Time Since 2023: CryptoQuant",
    "body": "Bitcoin’s slide below $90,000 has pushed on-chain realized profit metrics into negative territory, a level last seen before the previous bear market.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57406055,
    "published": 1769144422000,
    "title": "Crypto security company Ledger plots $4bn New York listing",
    "body": "French group enjoys record year as more investors seek protection from hacking",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      }
    ]
  },
  {
    "id": 57406314,
    "published": 1769145461000,
    "title": "South Korea probes loss of seized bitcoin in phishing attack",
    "body": "Internal audit showed the coins were likely lost via a phishing attack during official storage, according to local media reports.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|South Korea|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57406968,
    "published": 1769148016000,
    "title": "Bitwise Says Crypto Has Likely Bottomed, Echoing Q1 2023 Setup",
    "body": "Bitwise Asset Management is arguing that crypto’s current drawdown has the fingerprints of a cyclical low: weak prices alongside strengthening on-chain and business fundamentals, a pattern the firm says last appeared in Q1 2023 before a multi-year rally. In its Q4 2025 “Crypto Market Review,” Bitwise Chief Investment Officer Matt Hougan frames the quarter as an unusually important inflection point precisely because the signals are not all moving in the same direction. “But sometimes—every once in a while—the charts are mixed,” Hougan wrote. “The last one I remember was Q1 2023. At the time, we were starting to rebound post-FTX, and the data was topsy-turvy; some up, some down, some sideways. In the two years that followed, crypto prices soared.” Bitwise’s core claim rests on a divergence between market performance and usage metrics in Q4. The firm notes that Ethereum fell 29% over the quarter, even as Ethereum and Layer 2 transactions “soared to new all-time highs (up 24.5%).” Crypto equities also sold off, down 20% in Q4 by Bitwise’s measure while the underlying companies’ revenues were “on pace to grow 3x faster than any other sector of the stock market,” according to the report. Related Reading: Crypto Boom Ahead? Pantera Capital Pinpoints Major Catalysts For 2026 Success The price tape was undeniably heavy. The Bitwise 10 Large Cap Crypto Index fell 26.29% in Q4 and finished 2025 down 10.64% year-to-date; Bitcoin was down 23.48% in Q4 (down 6.26% in 2025), while Ethereum fell 28.59% in Q4 (down 11.03% in 2025). Yet the report also shows the market retaining scale: total crypto market capitalization stood at roughly $2.78 trillion as of Dec. 31, with bitcoin representing 63.6% and ether about 12.9%. Where Bitwise sees “green shoots” is in rails and revenue. The executive summary argues that “both stablecoin AUM and stablecoin transaction activity soared to new all-time highs,” presenting that as evidence a durable adoption wave is underway. Four Crypto Catalysts Bitwise Is Watching In 2026 Bitwise argues the market’s next leg will be shaped less by narrative rotation and more by identifiable catalysts, starting with US market-structure legislation. “All eyes are on the CLARITY Act,” the report says, describing it as a Senate-moving bill that could provide a “strong regulatory foundation” but also carries the risk of a weaker outcome or no bill at all. Related Reading: Trump Media Set to Issue Non-Transferable Crypto Tokens, Cutoff Date February 2 The second catalyst is what the firm calls a “stablecoin supercycle,” positioning stablecoins as payment infrastructure that is increasingly decoupled from directional crypto beta. Bitwise writes that 2025 annual stablecoin transaction volume topped $32 trillion, up 73% year-over-year, “more than doubling Visa’s volume through the first nine months of the year,” and says that data “confirm[s] their arrival in the mainstream.” The third is macro, specifically the coming change at the Federal Reserve. Bitwise notes Chair Jerome Powell’s “looming departure in May,” giving President Trump an opportunity to appoint new leadership. Between named candidates Kevin Warsh and Kevin Hassett, Bitwise says Hassett is viewed as the more dovish on rates and fiscal policy, adding that a dovish appointment would increase the likelihood of rate cuts and “should drive crypto assets higher.” The fourth is plumbing: distribution at major US wealth platforms. Bitwise points to “initial wirehouse ETF flows” following Q4 approvals, writing that financial advisors at three of the four major wirehouses gained access to crypto ETFs in Q4 after previously being barred from recommending exposure. Those advisors “control ~$16 trillion in assets,” and Bitwise expects early flows to start slowly in Q1 before accelerating. Hougan stops short of calling any single variable decisive, but ties the bottom thesis to whether the underlying data keeps improving. He wrote he was drafting the memo on Jan. 16 after crypto had already begun posting strong early-year returns and added: “If the fundamental data in this report stays steady, I think that trend could continue.” At press time, the total crypto market cap stood at $3.00 trillion. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto|crypto news|cryptocurrency|Is The Crypto Bottom In|Is The Crypto Bull Run Over",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57407182,
    "published": 1769148752000,
    "title": "Coinbase lets users borrow up to $1 million against staked ether without selling",
    "body": "The new feature allows U.S. users to borrow USDC against cbETH while keeping their staked ETH exposure intact.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Staked eth|Coinbase|ETH|Base|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57407444,
    "published": 1769149854000,
    "title": "DOJ Flags Three Crypto Cases in 'America First' Push Against Fraud",
    "body": "The Justice Department ramps up crypto fraud enforcement as scams surge, losses hit record highs, and AI aids financial crime.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57407872,
    "published": 1769151600000,
    "title": "Why Buying Cardano (ADA) Here Could Mean Weeks Of Dead Money",
    "body": "Cardano’s (ADA) current price may look tempting, especially as it sits deep in oversold territory, but cheap doesn’t always mean opportunity. When momentum is absent and structure remains weak, early buyers often find themselves stuck watching price drift sideways for weeks. For ADA, the real question isn’t how low it has gone; it’s whether it has the strength to escape. Trapped In the Red Zone: Pressure, Not Opportunity Trend Rider, in a recent update shared on X, explained that ADA’s daily chart has been flashing signals that many traders interpret as a “perfect bottom.” With the price sitting at the lower end of the bands and deep in the red, the temptation to buy looks obvious. However, Rider cautioned that low prices alone are not a guarantee that a move higher is ready to begin. Related Reading: Bitcoin’s Next Peak Might Ignite ADA’s Rally, Says Cardano Creator According to the analysis using the Rider Algo, Cardano is currently pinned inside a dark red zone. While some see this area as a solid floor, Trend Rider views it as a zone of heavy pressure and exhaustion, where price often drifts sideways for extended periods, leaving traders stuck in unproductive consolidation. Rider emphasized that trying to catch absolute bottoms rarely works out, often resulting in either catching a falling knife or watching capital remain stagnant while other assets show clearer momentum. As a result, Rider’s focus is not on buying at the lowest possible price, but on waiting for confirmation that strength is returning as the key is not support, but escape. Trend Rider expects Cardano to demonstrate the ability to climb out of the red zone with conviction. Specifically, the analyst is watching for a decisive breakout and a daily close above the $0.45 level. Until that happens, the bears still control the market structure. For now, Rider’s plan is to enter at a higher price with confirmed momentum than gamble on a “perfect bottom” and hope it holds. Currently, trading is about correct timing, not arriving first. Cardano Buyers Defend $0.33–$0.36 From Marcus Corvinus’s analysis, Cardano is currently reacting from a key demand zone between $0.33 and $0.36, an area where buyers have previously stepped in to defend the price. This zone is now under close watch as it could once again play a crucial role in determining the next move. Related Reading: Cardano Nears End Of 2020-Style Correction: Is $5 To $10 Next? Corvinus noted that if the demand zone holds and bullish momentum begins to build, ADA could see a more sustained bounce, potentially opening the way toward the next major resistance level around $0.53. As things stand, this area is shaping up to be a decision point for the market. Continued buyer defense could help rebuild structure and gradually shift pressure back to the upside. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cardano|ADA|ADA news|ADA price|adausd|ADAUSDT|Cardano news|Cardano price|Marcus Corvinus|Rider Algo|Trend Rider",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57408249,
    "published": 1769153053000,
    "title": "Will XRP price double again? 'Latent' buy pressure puts shorts in danger",
    "body": "Similar XRP funding conditions preceded rebounds of roughly 50% in August and September 2024 and about 100% in April 2025.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57408349,
    "published": 1769153573000,
    "title": "Bitcoin returns fail to match risks, just like 2022",
    "body": "The metric highlights weak risk-adjusted performance during periods of volatility, a feature of drawdowns that can persist for months.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Volatility|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57409047,
    "published": 1769156366000,
    "title": "Ledger said to be in talks with Goldman Sachs, Barclays on US IPO: FT",
    "body": "The Financial Times reports that Ledger is plotting a US IPO at a $4 billion valuation as hardware wallet demand rises amid growing crypto fraud and hacks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57409268,
    "published": 1769157259000,
    "title": "Buterin calls 2026 the year to reclaim self-sovereign computing",
    "body": "Ethereum’s Vitalik Buterin details his 2026 “self-sovereign” tech stack, swapping Big Tech apps for encrypted, open-source and local privacy tools.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57409635,
    "published": 1769158816000,
    "title": "Expert Analyzes XRP, Ethereum, And Solana: Predictions For The Next Altcoin Season",
    "body": "As the crypto market faces uncertainty and continues in a consolidation phase, market expert Sam Daodu has issued a report examining the potential for XRP, Ethereum (ETH), and Solana (SOL) to emerge as frontrunners if a new altcoin season arises in 2026. XRP, ETH, And SOL Price Forecasts Daodu began his analysis by pointing out that Bitcoin’s (BTC) dominance is currently hovering around 59%, alongside an Altcoin Season Index reading of 55. These indicators suggest that 2026 could herald a substantial rotation towards altcoins, mirroring significant shifts experienced during cycles in 2016-2017 and 2020-2021. The expert outlines several bullish scenarios for each. For XRP, he envisions a potential surge past the $6-$8 range if exchange-traded fund (ETF) inflows maintain a monthly average exceeding $400 million and RippleNet continues to expand its influence in global banking. Related Reading: ‘I’m Very Bullish’: Ripple CEO Forecasts Record Performance For Crypto In 2026 ETH, on the other hand, could see itself climbing toward $12,000-$18,000 if Layer 2 (L2) adoption unlocks broader usage and ETF inflows rebound. Daodu highlights that active addresses are at cycle highs, indicating organic demand that may translate to higher prices once institutional sentiment shifts positively. For SOL, the outlook is similarly optimistic. Solana might rocket to the range of $500-$800 if its transaction finality of 150 milliseconds and low fees attract a new wave of applications. Additionally, the rise in ETF filings could lead to significant capital inflows. Potential Risks Ahead In more stable scenarios, Daodu suggests that XRP might consolidate between $2.50-$3.50 if institutional adoption progresses steadily without dramatic catalysts. He also speculates that Ethereum could trade within the range of $5,000-$9,000, benefiting from consistent demand driven by staking yields and decentralized finance (DeFi) growth. Meanwhile, Solana might trend between $200-$350, assuming that developer growth and retail adoption continue at their current pace without major breakthroughs. However, Daodu cautions that XRP could fall below $1.50 if demand for ETFs wanes or if regulatory uncertainties arise. Similarly, ETH could fall below $2,500 if scalability issues arise or if regulatory challenges become more pronounced. SOL could drop below $100 if outages persist or if it faces increased competition from other Layer 1 platforms. What AI Models Anticipate AI predictions provide additional insight into the expected performance of these altcoins. For XRP, forecasts vary significantly, with ChatGPT estimating a range of $0.80-$3.00, while Grok presents a more bullish outlook with a target of $1.50-$6.00. Related Reading: Crypto Boom Ahead? Pantera Capital Pinpoints Major Catalysts For 2026 Success Ethereum’s AI predictions show a range of $3,000-$9,000 from ChatGPT, while Gemini anticipates a high of $7,000-$18,000 through increased tokenization. Lastly, Solana’s predictions range from $120-$350 from ChatGPT to a more optimistic $300-$800 from Gemini, depending on the growth of consumer applications. XRP was trading at $1.93 at the time of writing, down 2% in the previous 24 hours. ETH traded at roughly $2,952, while SOL traded at $128, both experiencing comparable declines during the same time period. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|crypto news|ETH|eth price|ethereum|ethereum news|Ethereum prediction|ethereum price|Sol|SOL Price|Solana news|Solana Price prediction|xrp|xrp news|XRP Price|XRP price predictions",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57410544,
    "published": 1769162419000,
    "title": "Dogecoin Foundation-Backed ETF Launches On Nasdaq As Analysts Call For Massive DOGE Rally",
    "body": "21Shares has announced the launch of the first spot DOGE Exchange-Traded Fund (ETF) backed by the Dogecoin Foundation, aiming to offer investors regulated, physically backed access to the largest memecoin by market capitalization. Related Reading: Bitcoin To $80,000? Analyst Warns Of Potential Free Fall As BTC Erases 2026 Gains Dogecoin Goes From Memecoin To Wall Street On Wednesday, financial services company 21Shares announced the launch of its 21Shares Dogecoin ETF (TDOG) on Nasdaq to provide “a new way to gain physically-backed DOGE exposure in traditional portfolios.” According to the announcement, the firm’s DOGE ETF is the only investment product of its category to be officially endorsed by the Dogecoin Foundation, the nonprofit organization dedicated to supporting the ecosystem’s development. Notably, two other spot DOGE ETFs are live: Grayscale’s GDOG and Bitwise’s BWOW. As reported by NewsBTC, the funds debuted in late November, becoming the first DOGE ETFs in the US market. TDOG’s launch builds on 21Shares’ collaboration with the House of Doge, the corporate arm of the foundation supporting the ecosystem, to create new opportunities across the Dogecoin ecosystem. The newly launched product will offer investors direct exposure to DOGE through a fully backed, transparent, and exchange-traded vehicle, holding the asset on a 1:1 basis in institutional-grade custody. Regarding its decision to launch a DOGE ETF, 21Shares affirmed that the memecoin “captures the spirit of internet culture and continues to evolve in our digital economy.” Moreover, the firm argued that it has “helped onboard many new users to crypto, and for many people, this may serve as their first step into crypto.” Federico Brokate, 21Shares’s Global Head of Business Development, stated that “Dogecoin is a unique asset with a global community and expanding real-world use cases,” adding that “TDOG offers investors regulated, physically backed exposure to DOGE through an ETF structure they already understand and trust.” DOGE Prepares For New Rally Analyst Bitcoinsensus suggested that the leading memecoin “could be on for a massive rally to the upside” based on its performance throughout this cycle. The market watcher explained that the cryptocurrency has been experiencing “mini cycles” since 2023, which have led to “bigger and bigger rallies.” According to the chart, after its late 2022 pump, Dogecoin consolidated within a tight range before a 190% breakout in early 2024. Similarly, the memecoin repeated the same pattern throughout 2024, accumulating for months before a 480% breakout at the end of that year. Now, DOGE has been consolidating within the $0.125-$0.280 price range for nearly a year, leading the analyst to believe that a breakout towards a higher target near the $0.750 level is possible. Meanwhile, Trader Tardigrade also suggested that Dogecoin may be preparing for a massive breakout as it appears to be following its performance between late 2022 and 2024. Related Reading: BitMine’s Ethereum Holdings Near 3.5% Supply Milestone As ETH Falls Below $3,000 At the time, the cryptocurrency had apparently bottomed out but ultimately recorded another local low before reversing. Based on this, the analyst affirmed that the memecoin “might see a slightly lower low” in the coming weeks, before the next massive surge occurs. As of this writing, Dogecoin is trading at $0.1249, a 1.75% decline in the daily timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|21Shares Doge ETF|crypto analyst|crypto market correction|Crypto trader|doge|DOGE Analysis|DOGE ETFs|Dogecoin|Dogecoin ETF|dogecoin foundation|dogecoin price|dogeusdt|House of Doge",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57410857,
    "published": 1769163320000,
    "title": "Kansas bill would create state-managed Bitcoin and digital assets reserve",
    "body": "The proposal would fund the reserve with unclaimed crypto and staking rewards rather than direct state Bitcoin purchases.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57411692,
    "published": 1769166791000,
    "title": "Farcaster to return $180M to investors following Neynar takeover",
    "body": "Decentralized social network Farcaster says it remains operational after its acquisition by Neynar and confirms plans to return $180 million in capital to investors.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 57411592,
    "published": 1769166476000,
    "title": "Bitcoin in ‘early-stage bear market’ as $84K becomes crucial for BTC Price",
    "body": "Bitcoin profit cycle has turned negative for the first time since 2023, and suggested that BTC was transitioning into a bear market",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57411528,
    "published": 1769166225000,
    "title": "Kansas Lawmakers Propose State-Run Bitcoin and Digital Assets Reserve Fund",
    "body": "The proposal seeks to place abandoned digital assets under state custody, allowing staking rewards to flow into a reserve fund.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57411931,
    "published": 1769167810000,
    "title": "XRP Targets $6–$14 After Final Shakeout: Certified Elliott Wave Analyst",
    "body": "Certified Elliott Wave analyst XForceGlobal (@XForceGlobal) told followers on X that “$5+ remains on the horizon,” arguing that the token’s past year of range-bound trading is validating an Elliott Wave “flat” correction that typically resolves with a sharp, final move before a continuation higher. In a 10-minute video shared alongside the post, the analyst framed XRP’s recent price action as the late stage of a flat pattern, an extended period where neither bulls nor bears can force a clean trend. “A flat occurs when the market fails to trend on both sides. They’re basically evenly matched,” he said. “And that’s not a sign of weakness, it’s a sign of balance.” XRP Traders ‘Exhausted’ As Breakout Nears XForceGlobal positioned the structure as a corrective phase within a larger bullish sequence, describing the market as forming a new floor rather than breaking down. “This is where the buyers and sellers enter a Mexican standoff with each other, creating a new price floor,” he said, adding that the sideways feel is the point: “They’re not designed to go anywhere, basically. And the markets naturally alternate between expansion and compression.” Related Reading: Santiment Says XRP Social Sentiment Hits ‘Extreme Fear’: Buy Signal? The analyst emphasized the psychological aspect of prolonged consolidation, arguing that flats tend to “eliminate even the leverage traders through time rather than price” by exhausting both sides. “By the time the flat actually resolves, which is very close, in my opinion, most traders are emotionally already exhausted,” he said. “Positioning has been pretty much neutralized, and the path for continuation, to me, becomes very clear.” In Elliott Wave terms, XForceGlobal described the flat as a three-part A-B-C structure, with waves A and B unfolding as corrective “three-wave” moves and wave C completing as an impulsive “five-wave” move. He argued that this final phase is the moment the market stops drifting and forces a resolution. “Wave C must be impulsive because it represents the resolution of the balance that we have for waves A and B,” he said. “It’s not the continuation of a larger structure to the downside.” He framed impulsiveness as behavioral rather than directional, attributing it to urgency and follow-through once one side “decisively gives up,” clearing out the range that built during the earlier legs. That distinction matters for positioning, because his base case anticipates one more decisive shakeout before a move higher. He said the market is currently in an “expanded flat” configuration where wave B pushed above the prior high, and he expects a break of local structure “once” before the market turns up. He highlighted $1.70 as a prior low that could be undercut as part of the process without invalidating the larger setup, so long as broader support holds. Related Reading: XRP Distribution Phase Continues, But Funding Rates Suggest Shorts Are Overextended XForceGlobal’s post leaned heavily on conviction built over time—“I didn’t spend 2,000+ days accumulating XRP for no reason!”—while also stressing that he has already taken some profit. In the transcript, he said he “personally took some profits around the $2.70 level” and would continue to “sell into strength.” On upside expectations, he called for higher levels “in this current cycle,” tying potential targets to the duration of the consolidation. “The longer that we distribute here, the higher the targets are going to be,” he said, adding that “a minimum of a $6 range all the way up to even the $14 range is my personal target.” He also flagged conditions that would change the trade management. If the market shows “red flags” and breaks further structure than he expects, he suggested that is where risk management should take priority. For XRP traders, the practical takeaway from his framework is timing and path, not direction: a final, forceful leg lower could still be consistent with a bullish continuation thesis while a deeper structural breakdown would challenge it. At press time, XRP traded at $1.91. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|xrp|xrp news|XRP Price|XRP Price Analysis|XRP Technical Analysis",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57411785,
    "published": 1769167272000,
    "title": "Hardware Wallet Manufacturer Ledger Eyes $4B US IPO Listing: Report",
    "body": "The hardware wallet firm is following BitGo in tapping U.S. public markets, amid renewed crypto investor appetite.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|||Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57412584,
    "published": 1769170491000,
    "title": "Binance applies for EU crypto license in Greece under MiCA framework",
    "body": "The exchange confirmed it has applied for regulatory approval under the MiCA regime, part of a broader effort to regain footing in major markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Binance|Europe|MiCA|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57412980,
    "published": 1769171847000,
    "title": "Ledger said to seek $4 billion IPO in New York, tripling 2023 valuation: FT",
    "body": "Ledger is working with Goldman Sachs, Jefferies and Barclays to list in New York, potentially tripling its last valuation, the Financial Times reported.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Ledger|hardware wallet|IPO|NYSE|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      }
    ]
  },
  {
    "id": 57412978,
    "published": 1769170196000,
    "title": "Ethereum blockchain beats its own speed-ups, but there's a catch",
    "body": "Ethereum’s daily active addresses climbed above major layer-2 networks in January as lower fees revived on-chain activity.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Ethereum News|blockchain contracts|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57413335,
    "published": 1769173217000,
    "title": "Here’s Why The Bitcoin, Ethereum, And Solana Prices Are Still Crashing Hard",
    "body": "Crypto researcher Axel has provided insights into why the Bitcoin, Ethereum, and Solana prices are still crashing. This comes as BTC continues to see a supply overhang, which threatens to put more downward pressure on crypto prices. Why The Bitcoin, Ethereum, and Solana Prices Are Still Crashing In a research report, Axel noted that anomalous exchange inflows accompanied the BTC breakdown below the $90,000 zone as sellers prepared in advance. The market is also still at risk of further selling pressure as the 1.0 level of the short-term holders’ SOPR is now acting as a resistance rather than support. As such, there is a possibility that Bitcoin, Ethereum, and Solana prices will decline further. Related Reading: Altcoin Season In Q1? Bitcoin, Ethereum Breakdown Maps Out Performance Further commenting on Bitcoin netflows into exchanges, Axel noted that between January 20 and 21, almost 17,000 BTC flowed into exchanges, coinciding with BTC dropping to as low as $87,000, while Ethereum and Solana prices also dropped. The crypto researcher explained that these anomalously high values followed a period of predominantly negative netflow in the first half of this month. In the context of the falling Bitcoin price, Axel stated that such a spike is more likely to reflect supply preparation than neutral transfers. In other words, the breakdown below $90,000 appears to be structural rather than emotional. Meanwhile, Bitcoin netflow returned to neutral levels yesterday, but the accumulated inflow still creates a supply overhang, which could lead to further declines in the prices of Bitcoin, Ethereum, and Solana. Axel noted that a signal of improvement would be if netflow turns negative again amid rising prices, which could indicate that the overhang has cleared. However, with the short-term holders’ 7-day SMA SOPR below 0.996, the crypto researcher suggested that BTC faces increased selling pressure on every recovery as these holders look to sell at breakeven. He added that a reversal trigger could be confirmed if the SOPR breaks above 1.0 from below, with the 7-day SMA holding unity for three to five days to filter out false spikes after the selloff. Why A Break Above $100,000 Looks Unlikely For Now In its latest research report, on-chain analytics platform Glassnode explained that a Bitcoin rally above $100,000 looks unlikely for now as the supply overhang persists. They noted how this overhang supply above $98,000 remains the dominant sell-side force capping short to mid-term rebounds. Related Reading: Bitcoin Price Following The 2022 Fractal? Here Was The Previous Outcome Alluding to the Unspent Realized Price Distribution metric, Glassnode noted that the recent BTC rally has partially filled the prior air gap between $93,000 and $98,000, driven by redistribution from top buyers into newer market participants. However, the unresolved supply overhang is expected to likely cap attempts above the $98,400 short-term holders’ cost basis and the $100,000 level. A meaningful and sustained acceleration in demand momentum is said to be required for a clean breakout above $100,000 to occur. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|Axel Adler Jr|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|ETH|ethereum|glassnode|Sol|Solana|Unspent Realized Price Distribution",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57413954,
    "published": 1769175426000,
    "title": "US yield spread hits 2021 highs: A warning for Bitcoin price?",
    "body": "BTC price faces pressure as markets brace for a sustained rise in long-term yields driven by economic deficits, particularly in Japan.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57414131,
    "published": 1769176127000,
    "title": "UBS weighing crypto trading for private banking clients: Report",
    "body": "The plan would give ultra-high net worth clients an in-house crypto on-ramp at one of the world's biggest private banks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57414424,
    "published": 1769177447000,
    "title": "Swiss banking giant UBS planning to offer crypto services to specific clients",
    "body": "UBS will gradually introduce crypto services, starting with select private clients in Switzerland, according to Bloomberg.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|UBS|Bitcoin News|Ether|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57414714,
    "published": 1769178635000,
    "title": "Ripple’s Next Steps: Where XRP Stops Being Trade And Starts Being Infrastrucutre",
    "body": "Ripple is laying out a transition in which XRP is no longer positioned primarily as a traded asset, but as infrastructure supporting tokenized finance and institutional settlement. At the World Economic Forum 2026, Ripple CEO Brad Garlinghouse described how this shift is already taking shape through live tokenization activity, regulated integration with banks, and on-chain settlement at scale. XRP Tokenization Shifts From Theory To Balance-Sheet Reality Garlinghouse used tokenization as the primary context for explaining this transition. He described tokenization as a process that has already moved beyond experimentation and into operational use across financial institutions. To support that claim, he pointed to activity on the XRP Ledger, where tokenized asset volume expanded significantly over the course of a single year, rising from roughly $19 trillion to $33 trillion. Related Reading: Coinbase Exec Points Out The Big Difference Between Bitcoin And Central Banks That level of growth signals institutional commitment rather than exploratory testing. Tokenized assets at this scale imply the involvement of banks, custodians, and regulated entities moving real value. According to Garlinghouse, institutions are now focused on how to integrate tokenized assets into existing balance sheets, liquidity structures, and settlement processes. This shift changes what infrastructure is required. Tokenization at institutional scale demands networks that can process high volumes consistently, provide deterministic settlement, and operate continuously. The XRP Ledger is being positioned within this framework as a system capable of supporting that throughput. The emphasis is not on innovation for its own sake, but on reliability and execution under real financial constraints. As tokenized assets become embedded in core financial operations, the supporting rails stop being optional. They become foundational. That is the context in which XRP is being discussed, not as a standalone asset, but as part of the machinery enabling tokenized finance to function. Connecting Regulated Assets And On-Chain Liquidity Garlinghouse also addressed the structural challenge that emerges as tokenization intersects with decentralized finance. Institutions want access to programmability and liquidity, but they cannot compromise compliance, custody, or trust. He described this tension as the central problem Ripple is working to solve. Related Reading: Is Dogecoin About To Repeat NVIDIA’s Run? Here’s What The Chart Says Rather than positioning itself against traditional finance, Ripple is working directly with global banks to build regulated pathways between tokenized assets and on-chain liquidity. The objective is to allow institutions to interact with decentralized systems without stepping outside regulatory frameworks. Within this design, XRP serves as a settlement and connectivity layer, enabling movement between systems. This approach reframes XRP’s utility. Its value lies in facilitating finality, liquidity access, and interoperability across regulated and on-chain environments. As tokenized assets, decentralized rails, and institutional settlement converge, networks capable of delivering finality at scale become increasingly important. Garlinghouse emphasized that the XRP Ledger already provides this capability, giving it a structural advantage. As a result, XRP is no longer positioned primarily as a tradeable asset; it is being aligned as infrastructure that enables the issuance, movement, and settlement of value within an increasingly tokenized financial system. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Ripple|ripple news|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57414940,
    "published": 1769179647000,
    "title": "Buying ether and Bitmine Immersion ahead of weekend a good bet: Standard Chartered",
    "body": "Increasing transaction activity on Ethereum and Tom Lee's continued buying bode well for the crypto, which has tumbled from 2026 highs in recent days, said Geoff Kendrick.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Ethereum News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57415628,
    "published": 1769182498000,
    "title": "Bitcoin slips back to $88,500 as silver tops $100 for first time ever and gold eyes $5,000",
    "body": "Spot bitcoin ETFs booked over $1.6 billion in outflows in four days, underscoring the rapid reversal in investor demand after last week's strong inflows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Silver|Wintermute|Copper|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57415969,
    "published": 1769184058000,
    "title": "Dogecoin Is A ‘Client-Statement Risk’ For Advisers, ETF Experts Say",
    "body": "Dogecoin’s attempt to join the institutional ETF lineup is running into a basic problem: institutions may not want it. In a Jan. 22 conversation on the Crypto Prime podcast, Bloomberg Intelligence ETF analyst James Seyffart and host Nate Geraci who is also the President of NovaDius Wealth Management said spot Dogecoin ETFs have attracted “near zero” demand so far, an outcome they tied to who typically buys DOGE, and how financial advisers think about reputational risk inside client portfolios. The Dogecoin datapoint landed inside a broader discussion about a crowded crypto ETF pipeline. Seyffart said his running tally of crypto ETF filings has climbed “over 150 unquestionably,” with many products spanning spot and derivatives, income overlays, buffers, and multi-asset structures. The surge, he argued, looks like issuers “throw[ing] the spaghetti at the wall” in 2026. Dogecoin ETF Reality Check But volume of filings doesn’t guarantee demand, and Dogecoin is the clearest example offered of that gap thus far. Pressed on which existing products stood out, Seyffart said “nothing really stands out,” before singling out Dogecoin as the exception, precisely because it has not resonated. Related Reading: Dogecoin Flirts With An Inverse Head And Shoulders: $0.15 Break Is The Trigger “The real honest answer is like nothing really stands out to me honestly if I have to pick one thing that kind of stands out, it’s probably that the Doge ETFs have gotten almost no interest whatsoever,” he said. He added that while some newer altcoin products have done “decently well,” Dogecoin has not. My conversation w/ @JSeyff on current state of crypto ETFs… We discuss: -Crypto ETF sentiment -150+ crypto-related ETF filings -Morgan Stanley crypto ETFs -BlackRock’s next move -Index & active crypto ETFs -Recent flows -What’s nexthttps://t.co/2TzJAnKXuK via @CryptoPrimePod pic.twitter.com/mtDuuDirB7 — Nate Geraci (@NateGeraci) January 22, 2026 Seyffart and Geraci converged on a demand thesis: the marginal buyer of DOGE likely already has the tooling and habit set to buy it directly, rather than through an ETF wrapper. “I remember talking to the guys at Bitwise. I was like, I don’t think anyone’s going to buy this,” Seyffart said. “But maybe I’m wrong. I’ve been wrong plenty of times before. But I mean, literally no one has bought like the Doge ETFs […] I had pretty low expectations, but I thought maybe they could get to a point where they’re slightly profitable.” Seyffart pointed to Bitwise’s product—ticker BWOW—as an early scoreboard: “it’s under a million in assets right now,” he said, calling that “near zero demand.” He cautioned the funds are still new, noting the Bitwise product launched at the end of November, but framed the initial traction as “very minuscule.” Geraci’s explanation was blunter: ”The people who buy that, in general, these are degens and they already know how to access this. They already have digital wallets. They don’t need an ETF to access this […]. And I think that’s going to be a lot of these other coins that are much further down the market cap spectrum.” Related Reading: Dogecoin Foundation-Backed ETF Launches On Nasdaq As Analysts Call For Massive DOGE Rally Geraci argued Dogecoin faces an additional headwind that doesn’t show up in crypto-native narratives but matters in the ETF market: advisers. “The other aspect here […] is what I call client statement risk,” Geraci said. “So financial advisors, they’re the biggest driver of ETF flows. And so let’s take Dogecoin as an example […] If you’re a financial adviser and you have a Dogecoin ETF show up on a client statement […] it’s like a flashing red light saying, ‘Please fire me and go find another adviser.’” That framing matters because the episode repeatedly returned to distribution realities. Seyffart said he’s most excited about basket and index-style crypto ETFs, in part because advisers don’t want to “pick those winners and losers” across a growing long tail of assets. In Geraci’s view, a basket is the “easy button” for professional allocators who want crypto exposure without underwriting each token’s story or defending it to clients. Seyffart also suggested “what the actual chain is doing” can shape adviser appetite, contrasting niche infrastructure plays such as Chainlink, which he described as connecting DeFi and TradFi, against meme assets like DOGE, which he implied may be less “appetizing” for ETF buyers. At press time, DOGE traded at $0.12479. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|doge|DOGE news|Doge price|Dogecoin|Dogecoin ETF|Dogecoin news|dogecoin price|Spot Dogecoin ETF",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57415936,
    "published": 1769183889000,
    "title": "Crypto ‘flex’ gone wrong exposes $90 million wallet tied to U.S. government seizure",
    "body": "A recorded online dispute between alleged threat actors led blockchain investigator ZachXBT to trace millions in illicit crypto to a single wallet.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Zachxbt|crypto crime|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57415904,
    "published": 1769183700000,
    "title": "Spot Bitcoin ETFs Shed $1.62B in Four-Day Negative Streak",
    "body": "U.S. spot Bitcoin ETFs have seen a four-day outflow streak as fading basis trade yields and macro jitters force a hedge fund retreat.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57416174,
    "published": 1769184758000,
    "title": "Grayscale files for ETF tracking Binance's BNB token, following VanEck’s bid",
    "body": "The proposed \"GBNB\" trust would offer investors exposure to the native token of the BNB chain without having to directly own the tokens, but approval still hinges on Nasdaq’s filing.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bnb chain|Grayscale|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57416460,
    "published": 1769185833000,
    "title": "'Professional Money Launderer' Ordered to Pay UK $7.6M Over Zhimin Qian Case",
    "body": "The Crown Prosecution Service has given Zhimin Qian’s fixer Sen Hok Ling three months to cough up the funds.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57416769,
    "published": 1769187166000,
    "title": "UBS Planning Bitcoin, Ethereum Trading for Some Wealthy Clients: Bloomberg",
    "body": "UBS will reportedly offer Bitcoin and Ethereum trading to select private banking clients in Switzerland, signaling growing crypto adoption.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57416702,
    "published": 1769186609000,
    "title": "Grayscale seeks SEC approval for spot BNB ETF in expansion beyond BTC, Ether",
    "body": "The product, if approved, would give US investors access to regulated BNB exposure without needing to hold the token themselves.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57416941,
    "published": 1769187989000,
    "title": "Crypto custodian BitGo down 12%, falling well below IPO price on second trading day",
    "body": "The company came public at around a $2 billion valuation on Thursday.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|BitGo|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 57417314,
    "published": 1769189430000,
    "title": "Stablecoins May Soon Power Payments Made Entirely By AI—CEO",
    "body": "Circle’s chief executive painted a brisk picture at Davos this week: autonomous software agents that act for people could be using stablecoins to pay for everyday things within three to five years. He said these agents will need a money system that is stable, fast, and programmable. That, he argued, points to stablecoins as the likely choice. Related Reading: Bitcoin’s Sharp Reversal Leaves Over $800 Million Liquidated In 1 Day AI Agents And Money According to reports, Jeremy Allaire of Circle said “literally billions” of AI agents may be transacting on behalf of users in the near term. “Three years, five years from now, one can expect that there will be billions, literally billions of AI agents conducting economic activity in the world on a continuous basis,” Allaire said during the World Economic Forum in Davos, Switzerland. He described work on new networks and tools aimed at letting software act like small businesses or helpers that buy services, settle bills, and tip content creators. This idea is simple on the surface: software needs a reliable unit of account when it spends, and tokenized dollars can fit that role. Building The Tools Reports say companies across the crypto and tech world are racing to build the plumbing for this future. Circle is pitching USDC as a neutral payments layer that software can plug into. Other firms are testing protocols that let a machine sign off on a payment when certain conditions are met. Some large tech groups are also exploring ways for their platforms to let software pay for services automatically. Progress is visible, but the path is not yet clear. What Regulators Might Ask Regulators will have questions. Reports note concerns about money flow, consumer protections, and where bank deposits sit if stablecoins grow rapidly. At Davos, the CEO pushed back on the idea that stablecoins would drain bank deposits the way some fear, saying comparisons to other financial instruments are more fitting. Still, lawmakers in the US and elsewhere are watching closely. Rules could move faster if policy makers see real volume coming from so-called agentic commerce. New Networks, New Risks Based on reports, the technical choices will shape both convenience and danger. If agents can move value at scale, fraud and theft risks may rise too. Related Reading: Bitcoin Influencers Get Spotlight In X’s New ‘Starterpacks’ Systems will need clear identity checks, fault handling, and ways to stop runaway payments. Some safety work is already under way, but much remains to be designed and tested. Featured image from Pexels, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|AI|AI Agents|bots|crypto|payments system|smart contract|Stablecoins",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57417306,
    "published": 1769189213000,
    "title": "French authorities investigate data breach of crypto tax platform",
    "body": "A local news outlet reported that a hacking group called the Shiny Hunters sent ransom demands to Waltio after seizing personal data from about 50,000 users.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57417249,
    "published": 1769188800000,
    "title": "Bitcoin prediction markets say $100K BTC price out of reach for now",
    "body": "Bitcoin bull market optimism has suffered since the October crash, as chances of a short-term BTC price rally above $100,000 appeared to be fading.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57417559,
    "published": 1769190395000,
    "title": "Bitcoin surges to $91,000, showing signs of life on suspected Bank of Japan intervention",
    "body": "Having earlier breached $100 per ounce for the first time ever, silver has risen to $101, while gold sits just shy of $5,000 per ounce.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Market Wrap|Breaking News|top news|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57417978,
    "published": 1769192086000,
    "title": "Olympic Snowboarder Turned Alleged Crypto Crime Kingpin Arrested in Mexico",
    "body": "Ryan James Wedding was accused of using stablecoin Tether to fuel a cocaine smuggling and murder operation in Latin America and the U.S.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57418303,
    "published": 1769193360000,
    "title": "U.K. FCA moves closer to crypto regulation with final consumer duty consultation",
    "body": "The UK regulator said crypto firms must ensure good outcomes for customers without stifling innovation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|FCA|crypto regulatioin|United Kingdom|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57418687,
    "published": 1769194859000,
    "title": "Ethereum Funding Rates Pushing Towards Negative: What’s Going On?",
    "body": "Ethereum is currently trading under pressure after failing to push above the $3,000 level again over the past 24 hours, a move that is reflecting trader sentiment across the derivatives markets. ETH is currently trading at $2,925, down 2.7% on the day, after moving within a 24-hour range capped at $3,012.99 and finding lows around $2,909.60, according to price data from CoinGecko. As price action weakens, a notable change has been developing, with on-chain data showing funding rates drifting toward negative territory and derivative positioning beginning to tilt more defensively. Funding Rates Slide As Shorts Gain Ground Ethereum’s failure to hold above $3,000 is an important psychological break for traders, especially after several failed attempts to hold above that level in January. Price action over the past week shows sellers maintaining control after ETH rejected around $3,360 on January 18, followed by a steady push lower toward the high-$2,900s. Related Reading: The Ethereum MACD Crossover That Could Lead To A Massive Bull Wave Although the pullback has so far been orderly above $2,900, this decline has come alongside fading momentum across the derivatives market. One of the clearest signals for this can be seen in Ethereum’s OI-weighted funding rate, which has been steadily compressing and is now edging toward negative levels. At the time of writing, Ethereum’s OI-weighted is at 0.0008%, close to breaking into negative territory and far below readings around 0.009%, which it registered earlier in the month. Funding rates turning negative typically indicate that short positions are paying longs, meaning stronger demand for downside exposure. Funding spikes that previously accompanied the price rebound in early January have faded, and the overall trend suggests bearish positioning is slowly gaining the upper hand. Open Interest, Liquidations, And What’s Next Although Ethereum’s price action fell below $3,000, derivatives traders have stayed in the market, keeping total open interest at high levels. Data from CoinGlass shows aggregate Ethereum open interest increasing by 0.68% in the past 24 hours, which shows that many traders are not exiting Ethereum entirely. At the time of writing, the total open interest is sitting at about 13.36 million ETH, equivalent to roughly $39.19 billion. Related Reading: Ethereum’s 4-Hour Chart Says A Big Dump Is Coming, Here’s The Target Looking across major exchanges, Binance has the largest share of ETH open interest, accounting for about $8.95 billion, but it is down by 0.8% in the past 24 hours. CME follows with approximately $5.73 billion in open interest, up by 3.72% in the past 24 hours. Gate comes next at around $4.01 billion, while MEXC comes in close at $3.51 billion worth of ETH open interest. Over the past 24 hours, Ethereum liquidations totaled $64.34 million, with long positions ($52.52 million) accounting for the majority of losses. A hold above $2,900 could allow Ethereum’s funding rates to normalize and open the door for another rebound attempt to $3,000. However, a continued fall in funding rates into negative territory could see bearish control pushing Ethereum below $2,900. Featured image from Pexels, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum|Binance|CME|Coinglass|ETH|ETH news|eth price|ethereum|Ethereum Funding Rates|ethereum news|Ethereum open interest|ethereum price|ethusd|ETHUSDT|Gate|MEXC",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57418594,
    "published": 1769194384000,
    "title": "BitGo’s IPO pop turns volatile as shares slip below offer price",
    "body": "The digital asset custodian’s choppy debut reflects shifting investor sentiment and tighter scrutiny of new listings as crypto markets struggle to regain momentum.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57419522,
    "published": 1769198179000,
    "title": "‘Bitcoin trade is over,’ Bloomberg strategist says in 2026 macro outlook",
    "body": "Bloomberg commodity strategist Mike McGlone explains his bearish turn on Bitcoin outlook and broader market expectations for 2026.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57420033,
    "published": 1769200208000,
    "title": "Ethereum Emerges As Likely Candidate In BlackRock Tokenization Vision – Here’s Why",
    "body": "Recent remarks from BlackRock CEO Larry Fink have pointed toward the need for a single, unified blockchain for tokenized markets, and have intensified the focus on platforms capable of handling institutional-scale liquidity, compliance, and settlement. With its long track record in smart contracts, extensive developer ecosystem, and growing role in regulated financial products, Ethereum is now emerging as the most likely candidate to serve as the settlement layer for tokenized capital markets. Why Asset Managers Prefer Familiar Infrastructure In an X post, the Ethereum Daily shared a video in which BlackRock CEO Larry Fink made it clear that tokenization is necessary. Speaking at the World Economic Forum, Fink said the financial system must move rapidly toward digitization, adding that a single, common blockchain could reduce corruption and improve transparency across the global markets. Related Reading: Ethereum Gains Institutional Support, Though ETH Price Outlook Remains Contested While Fink did not name a specific network, the most plausible candidate could be ETH, based on BlackRock’s own initiatives and public statements that emphasized the role of ETH in asset tokenization. The firm has consistently highlighted ETH as a core platform for its on-chain strategy. Meanwhile, BlackRock launched its BUIDL tokenized money market fund directly on ETH, a product that has already grown to over $2 billion in total value locked. “There’s no second best,” Ethereum Daily noted. In the staking space, Bitmine has turned Ethereum staking into a multi-billion-dollar business. An analyst known as Milk Road has revealed that the company now has 1.83 million ETH staked, worth roughly $6 million at current prices, and plans to scale that figure toward 4.2 million ETH over time. Over the past months, Bitmine Immersion Technologies Inc. (BMNR) has accounted for nearly 50% of all new ETH entering the staking queue. Staking at this scale is important because it removes ETH from the liquid supply and locks it into long-term infrastructure rather than keeping it for short-term trading. When one player is willing to commit billions of dollars worth of ETH to staking, it reflects confidence in ETH’s future economic prospects. A lower liquid supply, combined with sustained network demand, will create structural pressure over time. How Support Built Through Multiple Market Cycles Analyst Milk Road has also highlighted that Ethereum is holding near a critical support zone around $3,000, hovering just above the lower boundary of its long-term rising structure, an area that has acted as a stress test for ETH throughout the cycle. Historically, when ETH drifts into this area, the market will need to decide whether the weakness is temporary or structural. Related Reading: Ethereum Maintains Structural Strength Despite Resistance Near $3,400 The $2,750 level remains the key line because it has repeatedly stopped downside pressure after macro-driven or narrative-driven pullbacks, making it a reliable floor for the broader trend. As long as ETH holds above that level, the broader multi-year uptrend will remain intact. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|Bitmine Immersion Technologies Inc.|BlackRock|BMNR|buidl|ETH|ETH news|eth price|ethereum|ethereum network|ethereum news|ethereum price|Ethereum staking|ethusd|ETHUSDT|Larry Fink|Milk Road|The Ethereum Daily|world economic forum",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57420430,
    "published": 1769201797000,
    "title": "Remittances ‘more important than aid’ as Africa turns to stablecoins",
    "body": "Speaking at the World Economic Forum in Davos, Switzerland, economist Vera Songwe pointed to remittances and inflation hedging as key drivers of stablecoin use across Africa.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 57420837,
    "published": 1769203268000,
    "title": "BitGo Stock Plunges Below IPO Price on Second Day of Trading",
    "body": "BitGo's stock fell nearly 22% on day two of trading after the crypto custody firm's IPO, diving below the offering price.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57421046,
    "published": 1769203957000,
    "title": "CertiK keeps IPO on the table as valuation hits $2B, CEO says",
    "body": "Speaking from Davos on Thursday, co-founder and CEO Ronghui Gu said a CertiK public listing would represent a significant advancement for companies involved in Web3.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57421427,
    "published": 1769205725000,
    "title": "FBI arrests ex-Olympian drug 'kingpin' who allegedly used crypto to move proceeds",
    "body": "The U.S. caught a top-ten most-wanted fugitive when they arrested Ryan Wedding, a former top snowboarder who's said to have used digital assets in his crimes.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Federal bureau of investigation|U.S. Department of Justice|Criminal Activities|drug trafficking|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57421783,
    "published": 1769206902000,
    "title": "SEC dismisses lawsuit against billionaire Winklevoss twins-backed Gemini over Earn product",
    "body": "The SEC said Gemini Earn customers had already received 100% of their assets back through Genesis' bankruptcy, warranting the dismissal of the case.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|SEC|Genesis|Gemini|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 57422130,
    "published": 1769208198000,
    "title": "SEC dismisses civil action against Gemini with prejudice",
    "body": "The SEC was satisfied with Gemini’s agreement to contribute $40 million toward the full recovery of Gemini Earn investors’ assets lost as a result of the Genesis bankruptcy.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 57422813,
    "published": 1769211059000,
    "title": "XRP Price Recovery Is Possible If It Reclaims This Ichimoku Base",
    "body": "The XRP price may be preparing for a long-overdue recovery, as a crypto analyst has just highlighted a critical area that could flip the cryptocurrency’s downward momentum into a bullish one. According to the market expert, XRP must reclaim the Ichimoku Base before it can resume its upside to new levels. XRP Price Recovery To Resume Above Ichimoku Base Market analyst Xaif Crypto took to X this Thursday to deliver a fresh weekly update on XRP as the cryptocurrency enters a pivotal technical area after months of downside pressure. The accompanying chart shows price retreating from a prior peak in late 2024 and sliding back into a clearly marked demand zone in the blue box. Related Reading: What the Triple-Tap At $1.80 Means For The XRP Price According to the analyst, the recent retreat follows a clear downtrend, with lower highs pushing price back toward a previous consolidation zone. This blue-box area represents the main battleground, as prior trading activity built a base that could act as support if XRP revisits that level. So far, XRP appears to be stabilizing within this demand zone. Candles on the chart show hesitation and reduced selling pressure. The chart also draws attention to an Ichimoku structure, with XRP attempting to reclaim its Ichimoku Base. According to Xaif Crypto, this base will determine XRP’s next big move. The analyst has suggested that reclaiming this level could signal a potential shift in market sentiment. He disclosed that a strong close above it could favor upside continuation, weakening the ongoing downtrend and giving buyers more room to target upper resistance levels. Conversely, Xaif Crypto predicts that a break below the Ichimoku Base would likely lead to a deeper correction for XRP, as support would be lost and selling could accelerate. For now, XRP sits at a make-or-break level that could decide whether it recovers from its current slump. Xaif Crypto’s chart has outlined potential targets if the cryptocurrency manages to reclaim and hold above the Ichimoku Base. Currently hovering around $1.95, XRP faces potential bullish targets at $2.09, $2.20, $2.31, and $2.45. The analyst has also highlighted that traders and investors should closely watch the weekly close for confirmation of a sustained recovery. Analyst Says XRP Is Planning A Major Reversal Despite dropping below $2 earlier this week, analysts remain optimistic about XRP’s price outlook. According to market expert Crypto GVR, XRP could be attempting a major price reversal from the $1-$1.5 range. Based on his chart analysis, the analyst predicts that XRP could decline first from its current price around $1.95 to roughly $1.13 before rebounding sharply to new highs. Related Reading: XRP Price Could Surge Another 30% If This Trend Is Confirmed He has set a bullish target at $3.25. marking the next upside for XRP. If XRP were to crash to $1.13 and then surge to $3.25, this would represent a staggering 187% increase in value. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Crypto GVR|Ichimoku Base|Ripple|Xaif Crypto|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57424222,
    "published": 1769216408000,
    "title": "Litecoin Structure Intact, But $63 Remains The Line Bulls Must Defend",
    "body": "Litecoin is once again at a critical crossroads, with its long-term structure remaining intact after years of successful defenses. However, the margin for error is thin. As price hovers near key levels, $63 has emerged as the line bulls must protect. A break below it could shift momentum sharply, while holding above keeps the broader bullish structure alive and sets the stage for the next decisive move. Structure Gives Way, Expansion Phase Begins Columbus’s latest LTC update highlights that the multi-year compression that previously capped price action has finally resolved, resulting in a clean break of the long-term chart setup. This structural change confirms a shift from a neutral state to a clearly bullish one. Related Reading: Here’s Why The Litecoin Price May Be Getting Ready For Another Massive Rally The current price action is described as a pause before expansion rather than the conclusion of the rally. In this phase, Litecoin is holding steady above old resistance levels, allowing the market to load for the next leg of the move, turning previous barriers into new support. Litecoin’s projected path forward is based on the typical behavior of expansion cycles following structural breaks. The strategy follows a clear three-step progression: the initial breakout, followed by the current phase of acceptance. Once the market fully accepts these new price levels, the “real move” begins, representing a phase where the most significant gains are expected to materialize. The 9-Year Trendline That Still Controls Litecoin Matthew Dixon highlighted the immense historical significance of the Litecoin long-term trend line. This line has acted as an unbreakable floor for nine years, with the price never closing below it. While the market has dipped under this line multiple times in the past, every attempt to break down has ultimately failed, maintaining a remarkably consistent structural defense. Related Reading: Litecoin Follows Bitcoin’s Momentum, But Resistance Looms At $79.60 Currently, the market environment is putting this nearly decade-long support to the test once again. Dixon emphasizes that we cannot rely on intra-month volatility to determine the outcome. Instead, the definitive signal rests solely on the monthly candle close. This closing price will serve as a macro-economic pivot point that dictates the primary direction for the coming months. A successful hold above the trend line would be a powerful bullish confirmation, suggesting the long-term uptrend remains intact despite external pressures. Conversely, a confirmed close below this line would shift the narrative to bearish, marking a historic breakdown of a nine-year support system. Specific technical triggers are also in play, particularly the $63 level. Dixon warns that falling below $63 would be devastating, as it would effectively nullify the hidden bullish divergence currently supporting the price. Given these risks, Dixon recommends exercising patience until the monthly close or ensuring strict stop losses are in place for any active trades. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Litecoin|Columbus|Litecoin news|litecoin price|ltc|LTC news|ltc price|ltc/usd|LTCUSDT|Matthew Dixon",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 33,
        "NAME": "LTC",
        "CATEGORY": "LTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]