[
  {
    "id": 54367116,
    "published": 1763078423000,
    "title": "SUI Silent Comeback: The Underdog Preparing For A $20 Charge",
    "body": "In a latest update, BeLaunch posed the high-stakes question: Could SUI really reach $20 in the next bull cycle? After getting hit hard during the October 10 flash crash, SUI is starting to show strength again, and the charts are now painting a very interesting picture that could signal the beginning of a major turnaround. Potential Scenarios For SUI BeLaunch recently outlined two possible scenarios for SUI’s next move, each with distinct probabilities and implications. According to the analysis, the token is currently at a critical juncture, where its next few moves could determine the broader market‘s direction. Related Reading: SUI Eyes Key Retest As Price Breaks Out Of Downtrend – Rally To $3 Ahead? In the primary scenario, which carries an 8/10 probability, SUI is testing a crucial breakout above the red dashed resistance line. Wave (2) appears to have completed its cycle, setting the stage for Wave (3) — typically one of the most impulsive moves in the Elliott Wave structure. A confirmed breakout at this level could propel SUI toward new highs. The alternative scenario, rated at a 3/10 probability, suggests that the current price structure could remain corrective. In this case, SUI may form an alternative X wave near the $5.37 region before extending into another corrective phase (Alt Y). Although less likely, BeLaunch noted that traders should still monitor this possibility closely. Technical and On-Chain Alignment Suggests Market Bottom Nearing According to BeLaunch, on-chain fundamentals for SUI are showing early signs of recovery, despite broader market attention remaining elsewhere. The data reveals that Total Value Locked (TVL) has been holding firm around $1.4 billion, though the analyst notes that a move above the $2 billion threshold would mark a more decisive shift in momentum. At the same time, Daily Active Users (DAU) have been climbing gradually, now sitting near 900,000. Related Reading: Analyst Says SUI Price Could Be Heading To $9: 4 Reasons Why BeLaunch noted that despite this encouraging on-chain behavior, SUI’s price remains lagging, a common indicator of a classic accumulation phase. During such periods, investors often underestimate the asset’s underlying strength while long-term players quietly position themselves ahead of a potential breakout. Historically, SUI has shown a tendency to rally within two to four weeks after both TVL and DAU metrics begin trending upward. If this pattern repeats, it could signal that SUI is currently in a quiet accumulation window before a stronger move to the upside. This alignment between historical behavior and present data gives a subtle yet compelling bullish undertone. Overall, BeLaunch emphasized that the technical and on-chain setup appears robust. Fundamentals are stabilizing, momentum indicators are shifting, and WaveTrend signals are flashing a bottom below 40. If the current trend persists, SUI could soon emerge from consolidation and enter a new bullish phase. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "SUI|belaunch|daily active users|DAU|SUI price|SUIUSD|SUIUSDT|Total Value Locked|TVL",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 96,
        "NAME": "SUI",
        "CATEGORY": "SUI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54367824,
    "published": 1763079783000,
    "title": "Threshold: Upgraded bridge to funnel $500B institutional BTC into DeFi",
    "body": "Threshold has introduced upgrades to its tBTC bridge, which it claims will better position the $500 billion worth of Bitcoin held by institutions and whales to access DeFi opportunities.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54368601,
    "published": 1763081320000,
    "title": "Blue Origin Marks First Ocean Landing of New Glenn Booster After Second Attempt",
    "body": "Blue Origin has landed its New Glenn booster at sea after launching NASA’s ESCAPADE Mars mission.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Space",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54368565,
    "published": 1763081144000,
    "title": "3 reasons why Bitcoin and risk markets sold off: Is a recovery on the horizon?",
    "body": "Bitcoin’s recent weakness mirrors broader economic uncertainty, as unreliable economic data and shifting expectations on US growth and policy cloud investor confidence.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54370630,
    "published": 1763085628000,
    "title": "Who’s Selling Bitcoin? Fidelity Research Boss Breaks It Down",
    "body": "Visible buying from spot bitcoin ETPs and corporates has not translated into decisive upside, leaving traders to ask a blunt question: who is supplying the market? For Chris Kuiper, CFA, vice president of research at Fidelity Digital Assets, the answer is clear. “ ‘Who is selling?’ is the number one question I’ve been getting regarding bitcoin’s continued price pressure against a backdrop of visible buying,” he wrote on X on November 12. “I’m not unique in suggesting it’s the long-term holders (or HODLers).” Kuiper points to a simple but powerful on-chain gauge: the percentage of outstanding bitcoin that has not moved for at least one year. Glassnode’s “Percent of Supply Last Active 1+ Years Ago” rises in bear markets as coins age in place and investors sit on unrealized losses, then typically falls sharply when bull markets let those same investors exit into strength. Related Reading: Bitcoin Death Cross Is Coming: Don’t Be Fooled By The Name “As you can see in the chart below, this line goes up during bear markets … and then usually a dramatic decline as these longer-term holders sell into the strength of a bull market,” Kuiper explained. What stands out to him today is that “with this cycle” the drawdown is “a relatively gentle slope down.” When bitcoin hit new highs earlier this year, the long-term-holder line “didn’t plunge,” he said. Instead, the market has been experiencing “a consistent slow bleed as the market has slowly moved sideways and up.” That slow bleed aligns with what Kuiper says he hears from the client side. “Bitcoin’s performance has recently lagged gold’s, even the S&P, and people are getting tired,” he wrote. Many investors, in his view, had been positioned for a textbook four-year cycle blow-off and were “waiting to sell into the historically strong seasonality of October and now November.” When October’s typical strength did not materialize and year-end approached, “long-term holders are looking to make year-end tax and positional changes, calling it a day with the gains they already have.” Related Reading: Bitcoin “Arguably Undervalued,” Says Analytics Firm: Here’s Why The Glassnode chart shows how different this looks from past cycles. In the 2017–2018 run-up and subsequent reversal, the share of coins last active more than a year ago rolled over violently as price spiked and then collapsed. In the current cycle, the curve that represents long-term-holder supply has been trending lower since 2023, but without the vertical collapse normally associated with euphoric distribution. On-chain analyst Julio Moreno of CryptoQuant added another layer by reframing the same dynamic as “1-year inactive supply drawdown” in percentage points of total supply. “Here’s another way to visualize this,” he replied to Kuiper, “by looking at the 1-year inactive supply drawdown in terms of % of total Bitcoin supply.” Moreno quantified the last three major cycles. In 2017–2018, 1-year inactive supply declined by about 20 percentage points of total supply. In the 2021 cycle, the drawdown was around 10 percentage points. In the 2024–2025 period so far, the decline is again roughly 10 percentage points. The CryptoQuant chart, which uses an inverted scale, renders that as a purple wave that rises as more long-dormant coins are spent or reallocated. This means that long-term holders have already released a volume of supply comparable to the 2021 cycle, even if it is still well below the 2017–2018 peak. What differs is the tempo. Rather than a short burst of profit-taking at the top, the market has absorbed roughly a 10-percentage-point reduction in inactive supply over a longer, choppier price path. Kuiper welcomed the alternative visualization, replying simply: “Great chart!” He also made clear what he will be monitoring from here. “I will be watching this slope along with some other metrics to gauge seller exhaustion,” he said. For now, he argues that “the positive fundamental developments and lackluster price action continue to diverge.” At press time, BTC traded at $102,609. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|fidelity",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54371123,
    "published": 1763086641000,
    "title": "Bitcoin Drops Under $100K as Risk Appetite Fades in Crypto Markets",
    "body": "Bitcoin price failed to recover above $104,000. BTC is down over 4% and there are chances of more downsides below $98,000. Bitcoin started a fresh decline below $102,000 and $100,000. The price is trading below $100,000 and the 100 hourly Simple moving average. There is a bearish trend line forming with resistance at $102,200 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move down if it settles below the $98,500 zone. Bitcoin Price Dips Sharply Bitcoin price failed to stay in a positive zone above the $103,500 pivot level . BTC bears remained active below $102,500 and pushed the price lower. The bears gained strength and were able to push the price below the $100,000 handle. A low was formed at $98,000 and the price is now consolidating losses near the 23.6% Fib retracement level of the recent decline from the $103,999 swing high to the $98,000 low. Bitcoin is now trading below $100,000 and the 100 hourly Simple moving average. Besides, there is a bearish trend line forming with resistance at $102,200 on the hourly chart of the BTC/USD pair. If the bulls attempt another recovery wave , the price could face resistance near the $100,500 level. The first key resistance is near the $101,000 level and the 50% Fib retracement level of the recent decline from the $103,999 swing high to the $98,000 low. The next resistance could be $102,200. A close above the $102,200 resistance might send the price further higher. In the stated case, the price could rise and test the $103,500 resistance. Any more gains might send the price toward the $104,200 level. The next barrier for the bulls could be $105,000 and $105,500. More Losses In BTC? If Bitcoin fails to rise above the $102,200 resistance zone, it could start another decline. Immediate support is near the $98,500 level. The first major support is near the $98,000 level. The next support is now near the $96,500 zone. Any more losses might send the price toward the $95,000 support in the near term. The main support sits at $92,500, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $98,500, followed by $98,000. Major Resistance Levels – $100,500 and $101,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54371037,
    "published": 1763086435000,
    "title": "Bitfarms Will 'Wind Down' Bitcoin Mining and Pivot to AI After $46 Million Loss",
    "body": "Bitcoin miner Bitfarms will end its Bitcoin operations in the coming years, shifting focus to providing infrastructure for growing AI demand.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54371879,
    "published": 1763088001000,
    "title": "XRP ETF Posts Year’s Strongest Debut With $58 Million in First-Day Trading",
    "body": "Canary's XRP fund opened with record activity for the year despite a broader market pullback that has weighed on crypto prices.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54372455,
    "published": 1763089203000,
    "title": "Bitcoin Moves Beyond Retail — Institutional Ownership Now Defines The Market",
    "body": "Bitcoin is no longer the speculative playground it once was. What began as a retail-driven movement powered by early adopters and crypto enthusiasts has evolved into a market increasingly shaped by institutional capital, from BTC ETFs absorbing billions in inflows to corporations and hedge funds adding BTC to their balance sheets. Why Institutional Accumulation Has Changed Bitcoin Volatility The narrative around Bitcoin has undergone a fundamental transaction. According to the Arch Network post on X, the institutional participant in Bitcoin is no longer emerging; it’s already established. Spot Bitcoin ETF now holds over 1 million BTC, which is roughly 5% of the total supply. Daily inflows through mid-2025 have averaged between $300 and $500 million, with a cumulative asset close to $60 billion. Related Reading: Bitcoin (BTC) Recovers Past $105K as Shutdown Relief and Whale Buying Fuel Bullish Reversal Furthermore, the reach of this integration is global, with more than half of the world’s top asset managers now having indirect exposure to BTC through these accessible ETF structures. However, while this level of adoption is bullish, a significant challenge is that most of this BTC remains idle in cold storage. This model secures exposure but fundamentally does not generate return. Presently, for the institutions managing trillions in assets, the model is losing relevance. A productive BTC stack that combines robust security with consistent yield generation is becoming the natural next step for capital markets. An ambassador at NEARProtocol and Somnia_Network, Trader Onur, has highlighted that Bitcoin ETF recorded $524 million daily inflows on Tuesday, marking the biggest since the crash. The derivatives market is flashing similar signals that smart money just stacked $8.5 million in BTC longs. This shows retailers are still nervous, but institutions are quietly positioning. If the upcoming Consumer Price Index (CPI) print is favorable, it could set the tone for the year-end momentum. How Flows Can Confirm Or Contradict Market Mood The selling momentum in Bitcoin spot ETF flows has stalled for now. A full-time crypto trader and investor, Daan Crypto Trades, has pointed out that the BTC price has held the $100,000 region for now, as a lot of outflows and bad sentiment have taken place. However, the BTC price is also failing to push higher on the back of it. Related Reading: Bitcoin At A Battleground — This Price Range Will Decide the Next Cycle Phase As Daan noted, ETF flow data is a lagging indicator and useful mostly in hindsight. Nonetheless, when large outflows occur and the price refuses to drop further, it could be considered as short-term bullish absorption. Additionally, when heavy inflows fail to lift the price higher, it can signal local tops. These patterns have played out multiple times in this cycle, and they often occur at the key pivot zones where market direction shifts. Daan believes that it’s still valuable to watch how the price behaves around major ETF in- and outflow days. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|Arch Network|bitcoin|Bitcoin news|bitcoin price|Bitcoin Spot ETFs|btc|BTC news|btc price|btcusd|BTCUSDT|Consumer Price Index|CPI|Daan Crypto Trades|NEARProtocol|Somnia_Network|Trader Onur",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54372223,
    "published": 1763088419000,
    "title": "Bitfarms plunges 18% after plan to wind down Bitcoin mining ops",
    "body": "Bitfarms said it plans to shift its Bitcoin mining sites over the next two years and convert them to power AI, starting with its major site in Washington.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54372675,
    "published": 1763089687000,
    "title": "Ethereum Sheds 5% Amid Market Pullback, Raising Risks of Deeper Correction",
    "body": "Ethereum price failed to stay above $3,350 and extended losses. ETH is down over 5% and might struggle to recover above $3,450 in the near term. Ethereum started a fresh decline after it failed to stay above $3,500. The price is trading below $3,350 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance at $3,500 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move down if it settles below the $3,150 zone. Ethereum Price Dips Sharply Ethereum price failed to continue higher above $3,550 and started a fresh decline, like Bitcoin . ETH price dipped below $3,500 and entered a short-term bearish zone. The decline gathered pace below $3,350 and the price dipped below $3,250. A low was formed at $3,153 and the price is now correcting some losses. There was a move toward the 23.6% Fib retracement level of the recent decline from the $3,561 swing high to the $3,153 low. Ethereum price is now trading below $3,350 and the 100-hourly Simple Moving Average. If there is another recovery wave , the price could face resistance near the $3,300 level. The next key resistance is near the $3,350 level and the 50% Fib retracement level of the recent decline from the $3,561 swing high to the $3,153 low. The first major resistance is near the $3,500 level. There is also a key bearish trend line forming with resistance at $3,500 on the hourly chart of ETH/USD. A clear move above the $3,500 resistance might send the price toward the $3,650 resistance. An upside break above the $3,650 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $3,800 resistance zone or even $3,880 in the near term. More Losses In ETH? If Ethereum fails to clear the $3,350 resistance, it could start a fresh decline. Initial support on the downside is near the $3,200 level. The first major support sits near the $3,150 zone. A clear move below the $3,150 support might push the price toward the $3,050 support. Any more losses might send the price toward the $3,000 region in the near term. The next key support sits at $2,880 and $2,850. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI – The RSI for ETH/USD is now below the 50 zone. Major Support Level – $3,150 Major Resistance Level – $3,350",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54372555,
    "published": 1763089334000,
    "title": "Ban on rewards tied to stablecoin payments is un-American: Coinbase",
    "body": "Coinbase Institute has criticized banking groups for asking regulators to prevent merchant rewards for stablecoin customers, arguing the request has no merit under the GENIUS Act.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54374313,
    "published": 1763092847000,
    "title": "Bitcoin Sentiment Most Fearful Since March: Is A Bottom Near?",
    "body": "As Bitcoin continues to show a bearish trajectory, the cryptocurrency Fear & Greed Index has fallen to its lowest extreme fear level since March. Bitcoin Fear & Greed Index Suggests Investors Are Extremely Fearful The “Fear & Greed Index” refers to an indicator created by Alternative that tells us about the average sentiment that’s present among traders in the Bitcoin and wider cryptocurrency markets. Related Reading: Chainlink’s Next Major Move Comes After This Range, Analyst Says The index uses the data of the following five factors to determine the investor mentality: trading volume, volatility, market cap dominance, social sentiment, and Google Trends. It then represents the sentiment using a scale running from 0 to 100. All values above 53 correspond to a net sentiment of greed, while those below 47 imply fear in the market. The indicator being between these two cutoffs naturally suggests a neutral mentality among the investors. Besides these three main zones, there are also two “extreme” sentiments: extreme fear and extreme greed. The former takes place below 25 and the latter above 75. Currently, the Fear & Greed Index is in one of these zones. As is visible above, the Fear & Greed Index has a value of 15 at the moment, firmly inside the extreme fear territory. Sentiment among investors was already poor on Wednesday, but this latest value is even worse. The deterioration of sentiment is a result of Bitcoin retracing its recent recovery. While traders may be highly bearish toward the market right now, BTC and other assets don’t necessarily have to live up to expectations. In fact, if history is anything to go by, cryptocurrencies have often shown moves that directly go contrary to the crowd’s opinion. Many major tops and bottoms in the sector have formed alongside a sentiment of extreme greed and extreme fear, respectively. Given this, it’s possible that the latest foray into extreme fear could also lead to a bottom for Bitcoin and others. When that might happen, however, is anyone’s guess. The latest extreme fear sentiment is the strongest since early March, but the low back then didn’t coincide with BTC’s real bottom. That said, Bitcoin did find a temporary turnaround just a few days after, which lasted until the end of the month. In April, the market crashed again, and the Fear & Greed Index declined to a low of 18. This time, the extreme fear sentiment was enough to reignite real bullish momentum. Related Reading: Bitcoin “Arguably Undervalued,” Says Analytics Firm: Here’s Why It now remains to be seen whether the current low in the indicator will be enough for the market to reach a bottom, or if sentiment will worsen still. BTC Price At the time of writing, Bitcoin is trading around $103,100, down 2% over the last 24 hours. Featured image from Dall-E, Alternative.me, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin Extreme Fear|Bitcoin Fear & Greed Index|bitcoin sentiment|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54374590,
    "published": 1763093327000,
    "title": "XRP Price Turns Red as Bulls Step Back and Bears Test Market Strength",
    "body": "XRP price started a fresh decline from $2.550. The price is now showing bearish signs and might extend losses if it dips below $2.250. XRP price started a fresh decline below the $2.450 zone. The price is now trading below $2.40 and the 100-hourly Simple Moving Average. There is a short-term contracting triangle forming with resistance at $2.235 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move down if it settles below $2.250. XRP Price Dips Further XRP price attempted more gains above $2.50 but failed to continue higher, like Bitcoin and Ethereum . The price started a fresh decline below $2.450 and $2.420. There was a move below the $2.320 pivot level. A low was formed at $2.2754, and the price is now consolidating losses with a bearish angle below the 23.6% Fib retracement level of the recent decline from the $2.525 swing high to the $2.2754 low. The price is now trading below $2.40 and the 100-hourly Simple Moving Average. If there is a fresh upward move, the price might face resistance near the $2.2350 level. There is also a short-term contracting triangle forming with resistance at $2.235 on the hourly chart of the XRP/USD pair. The first major resistance is near the $2.40 level, above which the price could rise and test $2.450 or the 76.4% Fib retracement level of the recent decline from the $2.525 swing high to the $2.2754 low. A clear move above the $2.450 resistance might send the price toward the $2.520 resistance. Any more gains might send the price toward the $2.580 resistance. The next major hurdle for the bulls might be near $2.650. Another Decline? If XRP fails to clear the $2.40 resistance zone, it could start a fresh decline. Initial support on the downside is near the $2.280 level. The next major support is near the $2.250 level. If there is a downside break and a close below the $2.250 level, the price might continue to decline toward $2.20. The next major support sits near the $2.120 zone, below which the price could continue lower toward $2.050. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $2.250 and $2.20. Major Resistance Levels – $2.40 and $2.450.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54375464,
    "published": 1763095102000,
    "title": "Canary's XRP ETF Tops 2025 Debuts with $58M Day-One Volume",
    "body": "The XRPC ETF narrowly surpassed Bitwise’s Solana ETF in first-day trading volume.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|XRP|ETF|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54376133,
    "published": 1763096432000,
    "title": "First Spot XRP ETF Smashes Initial Expectations, Expert Suggests Record-Breaking Debut",
    "body": "Canary’s spot XRP Exchange-Traded Fund (ETF) has surpassed most of the experts’ predictions, and it is currently on track to see a record-breaking debut after registering strong institutional demand on its first day. Related Reading: Winklevoss Twins Back Zcash (ZEC) Treasury Company With $58M Investment First Spot XRP ETF Begins Trading On Thursday, the first single-token XRP spot ETF began trading on Nasdaq, smashing the initial performance expectations of multiple experts after clearing the last regulatory hurdles this week. Following the launch of Canary Capital’s spot XRP ETF (XRPC), the investment management firm asserted its conviction that “XRP Ledger represents a leading framework for global payments — purpose-built for interoperability and real-world settlement.” Notably, Canary Capital recently completed its 8-A filing for its XRPC ETF with the US Securities and Exchange Commission (SEC) and received the stock exchange’s green light on Wednesday afternoon. The Thursday launch comes amid the end of the US Government shutdown, which officially lasted 43 days and was forecasted to delay the long-awaited Altcoin ETFs until its conclusion. For context, the SEC was expected to approve multiple crypto-based investment products between early October and November, after the regulatory agency postponed the decision deadline in Q3 and released new generic listing standards for the products. However, the second wave of crypto-based investment products arrived despite the government setback, with the first set of ETFs launching over two weeks ago. On October 28, Canary Capital’s spot Litecoin and Hedera ETFs and Bitwise’s Solana Staking ETF (BSOL) began trading after filing 8-A forms with the SEC. As crypto journalist Eleanor Terret explained, the launch was possible because an open government wasn’t required to continue the process, and the 8-A filings are “just as important” as the S-1 forms, since they register ETF shares under the Securities Exchange Act of 1934. Canary’s XRPC To Challenge BSOL’s Debut Ahead of the launch, multiple experts predicted that Canary’s spot XRP ETF could see strong demand and reach between $15 million and $35 million in volume on its first day. Senior ETF analyst at Bloomberg, Eric Balchunas, initially suggested that the investment product could hit $17 million in volume. Following the first half-hour, the XRP ETF saw $26 million in volume, the analyst noted, breaking past his original expectations. As a result, Balchunas suggested that the XRPC had a “good shot” at surpassing BSOL’s first-day volume and becoming the biggest ETF launch of 2025. As reported by NewsBTC, Bitwise’s SOL Staking ETF recorded an impressive volume of $10 million in the first 30 minutes of trading, which surged to $33 million by the half-day mark. The investment product closed its first day with around $57 million in volume, beating all other launches of this year. Related Reading: SUI Eyes Key Retest As Price Breaks Out Of Downtrend – Rally To $3 Ahead? In the afternoon, analyst James Seyffart noted that Canary’s XRP ETF had recorded around $46 million in volume by the half-day mark, with a few more hours of trading ahead. The analyst initially suggested that XRPC could see around $34 million in volume on day one. “This is almost guaranteed to be near the top of the list for 2025 launches and still has a shot at beating $BSOL for the top spot,” Seyffart concluded. As of this writing, XRP trades at $2.30, a 3.3% decline in the daily timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitwise|BSOL|Canary Capital|Canary Capital’s spot XRP ETF|Crypto ETFs|Eric Balchunas|ETF Expert|James Seyffart|NASDAQ|Spot XRP ETFs|US SEC|xrp|XRPC|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54375996,
    "published": 1763095939000,
    "title": "Bitcoin can win US voters regardless of political lean, survey finds",
    "body": "Bitcoin’s ability to boost financial inclusion, allow transactions without government interference, and strengthen the energy grid means it can align with the values of nearly any voter.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54376358,
    "published": 1763096903000,
    "title": "Solana (SOL) Below $150 Again, Exposing Price to Additional Bearish Swings",
    "body": "Solana started a fresh decline below the $150 zone. SOL price is now consolidating losses below $150 and might decline further below $142. SOL price started a fresh decline below $155 and $150 against the US Dollar. The price is now trading below $150 and the 100-hourly simple moving average. There is a key bearish trend line forming with resistance at $148 on the hourly chart of the SOL/USD pair (data source from Kraken). The price could start a recovery wave if the bulls defend $142 or $140. Solana Price Dips Again Solana price failed to remain stable above $162 and started a fresh decline, like Bitcoin and Ethereum . SOL declined below the $155 and $150 support levels. The price gained bearish momentum below $150. A low was formed at $141, and the price is now consolidating losses. The price recovered a few points but remained below the 23.6% Fib retracement level of the downward move from the $172 swing high to the $141 low. Solana is now trading below $150 and the 100-hourly simple moving average. On the upside, immediate resistance is near the $148 level. There is also a key bearish trend line forming with resistance at $148 on the hourly chart of the SOL/USD pair. The next major resistance is near the $152 level. The main resistance could be $160 and the 61.8% Fib retracement level of the downward move from the $172 swing high to the $141 low. A successful close above the $160 resistance zone could set the pace for another steady increase. The next key resistance is $172. Any more gains might send the price toward the $180 level. Another Decline In SOL? If SOL fails to rise above the $152 resistance, it could continue to move down. Initial support on the downside is near the $142 zone. The first major support is near the $140 level. A break below the $140 level might send the price toward the $132 support zone. If there is a close below the $132 support, the price could decline toward the $120 support in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is gaining pace in the bearish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is below the 50 level. Major Support Levels – $142 and $140. Major Resistance Levels – $148 and $152.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Technical analysis|Sol|Solana|solbtc|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54376298,
    "published": 1763096761000,
    "title": "XRP ETF Fails to Bump Bulls as Ripple-Linked Token Plunges 7.3% Amid BTC Selloff",
    "body": "Brutal selloff breaks psychological $2.30 floor, erasing recent gains as distribution overwhelms historic XRPC debut.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54376220,
    "published": 1763096419000,
    "title": "Why Trump’s team is betting on stablecoins",
    "body": "The administration sees these digital assets as a tool in the fight against de-dollarisation",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54377962,
    "published": 1763100029000,
    "title": "Bitcoin Crashes To $98,000 As HODLer Selling Accelerates",
    "body": "On-chain data shows Bitcoin long-term holders have been ramping up their selling recently, a potential reason behind BTC’s fall under $100,000. Bitcoin Long-Term Holders Have Been Booking Profits In a new post on X, on-chain analytics firm Glassnode has discussed about the latest trend in the supply of the Bitcoin long-term holders (LTHs). These are referred to as the investors holding their coins for a period longer than 155 days, without selling or involving them in a transaction on the blockchain. Related Reading: Bitcoin Sentiment Most Fearful Since March: Is A Bottom Near? Statistically, the longer an investor holds onto their coins, the less likely they become to sell them in the future. As such, the LTHs with their long holding times are usually considered to be resolute entities. Despite their resilience, however, there are times when even these diamond hands can decide to part with their holdings. One such time happens to be right now. As the below chart shared by Glassnode shows, the Bitcoin LTHs have been reducing their supply recently. This latest wave of selling from the LTHs isn’t their first for the cycle. As is apparent in the graph, these HODLers sold into both the 2024 rallies as well. In between these selloffs, their supply was rising with significant speed. Something to note is that while LTH selling is instantly registered in the chart, the same isn’t true for buying. When the LTH supply grows, it doesn’t mean any accumulation is happening in the present. Rather, what it implies is that some coins were bought five months ago, which have now been held long enough to clear the LTH threshold. The last wave of coin maturation into the LTH cohort peaked in mid-2025. Since then, the group has been shedding coins at a variable rate. The latest trend has clearly been that of acceleration, as the below chart visualizes. The accelerating wave of distribution from the LTHs has arrived as Bitcoin has been suffering from bearish momentum. It’s possible that some of the HODLers are thinking this could be their last chance to take profits, so they have decided to exit. Related Reading: Chainlink’s Next Major Move Comes After This Range, Analyst Says During the last few days, BTC was trying to hold above $100,000 in the face of this selloff, but the asset appears to have buckled during the past day as its price has breached under the mark. Historically, bull markets have sustained so long as fresh demand has kept coming in to absorb the selling from the diamond hands, so it remains to be seen whether the price plunge will be met with an injection of demand, or if this selling will lead into an extended bearish phase for Bitcoin. BTC Price At the time of writing, Bitcoin is floating around $98,500, down 3% over the last 24 hours. Featured image from Dall-E, Glassnode.com, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin hodlers|Bitcoin long-term holders|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54377946,
    "published": 1763099857000,
    "title": "US regulator mulls guidance for tokenized deposit insurance, stablecoins",
    "body": "Acting FDIC Chair Travis Hill said the agency is also working on a regime for stablecoin issuance and expects to issue a proposal for an application process by the end of year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54378073,
    "published": 1763100246000,
    "title": "Bitcoin Spot ETFs See $869M Outflow, Second-Largest on Record",
    "body": "Investors have pulled out $2.64 billion over three weeks",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin|Markets|ETFs|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54379774,
    "published": 1763103625000,
    "title": "By The Numbers: First Spot XRP ETF Achieves Record Launch Amid 900 Competitors",
    "body": "Canary Capital’s XRP ETF made a historic debut on Thursday, surpassing its competitors by hitting $58 million in trading volume on its first day, setting a record for the most traded ETF launch this year. This milestone was lauded by Bloomberg expert Eric Balchunas on the social media platform X (formerly Twitter), underlining the remarkable success of the XRP ETF in the market. The launch of the first XRP ETF in the United States earlier today had a notable impact on the XRP price, propelling it towards the crucial $2.5 level. However, subsequent market movements saw a 4% retracement, bringing the token’s current trading price to $2.3. XRP ETF Potential Canary Capital’s CEO, Steven McClur, recently expressed confidence in the potential of an XRP ETF, suggesting that it could outperform the achievements of Solana (SOL). He highlighted XRP’s strong liquidity and global utility, foreseeing substantial institutional investment influx in the near future. The XRP ETF by Canary Capital has indeed outperformed Bitwise’s Solana Staking exchange-traded fund, with a trading volume of $57 million, falling just short of Canary’s fund by a mere million-dollar difference. Related Reading: Who’s Selling Bitcoin? Fidelity Research Boss Breaks It Down Analysts predict that the approval of asset managers like Franklin Templeton, Bitwise, and Grayscale in the upcoming days of November could attract significant institutional investments ranging from $4 to $8 billion, potentially leading to a substantial price surge due to the low liquidity in the market. As a result, market analysts foresee a bullish rally for XRP, hinting that the token may be approaching the end of consolidation. They suggest long-term price targets ranging from $10 to $37. If these bullish scenarios materialize, these surges could result in new all-time highs and significant potential gains, with projections of 334% and a staggering 1,500%, respectively, from current trading levels. XRP Price Could See 150% Increase To $6 by 2030 In addition to the significant ETF debut by Canary Capital, industry experts like Dark Defender have shared key technical analyses that could complement the performance of the XRP ETF market. Notably, Dark Defender highlighted signals on the weekly time frame indicating a potential surge for XRP, with resistance at $2.85, support at $2.22, and targets projected at $18.22 and $36.76. Related Reading: Dormant Bitcoin Giant Stirs, Unloads 12,000 BTC In Surprise Move Geoffrey Kendrick at Standard Chartered anticipates substantial gains in the forthcoming years, largely attributed to the potential of spot XRP ETFs. He has set a target price of $12.50 for 2028, implying annual returns of 73%. Analysts at the Motley Fool have also weighed in, drawing parallels to Bitcoin’s (BTC) price appreciation following the SEC approval of spot Bitcoin ETFs in January 2024, projecting a 150% increase to $6 for XRP by 2030. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|Canary Capital’s spot XRP ETF|crypto news|Spot XRP ETF|Spot XRP ETFs|XRP ETF|XRP ETF News|xrp news|XRP Price|XRP Price Analysis|XRP Price Forecast|XRP price news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54381833,
    "published": 1763107506000,
    "title": "Aave to offer zero-fee stablecoin ramps in Europe after MiCA approval",
    "body": "Aave said compliant, audited payment pathways are crucial for onboarding new users to decentralized finance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54382486,
    "published": 1763109000000,
    "title": "The Descending Channel That Can Trigger A Bitcoin Price Crash To $88,000",
    "body": "Over the last few weeks, analysts have been predicting that the Bitcoin price could crash again after the initial October 10 crash. This is because of the weakening market trends that have shown that Bitcoin is still favoring a downtrend at this point. Crypto analyst Lixing_Gan on the TradingView website also shares this view, with the appearance of a descending trend pattern that suggests that the Bitcoin price is more likely to fall than rise. Bitcoin Price At Risk Of Major Crash Below $90,000 So far, the Bitcoin price has been able to maintain its hold above the psychological level of $100,000, despite bears briefly pushing the price below this level. It has been trading in a tight range of $101,000 to $105,000 during this time, but with no notable momentum that could push its price higher. This tight range, unfortunately, plays into the descending pattern that maps a path downward. Related Reading: Abundance of Catalysts Suggests XRP Price Could Take Off This Week According to the crypto analyst’s chart, the descending pattern was formed at the start of October, well before the historic 10/10 crash. This means that the bearish trend had begun much earlier, and the resultant crash was only in response to bullish positions weakening across the board. This was triggered by massive sell-offs, mainly among whales and holders that have held onto their BTC for a notable amount of time. Over the last few months, these long-term holders have sold off more than 390,000 BTC, triggering billions of dollars in selling pressure. Given this, it is no surprise that the Bitcoin price broke down the way it did at the start of October. These sell-offs from the long-term holders, though, the crypto analyst believes, are a distribution phase. As they sell off their holdings to newer investors, the cost basis for each Bitcoin begins to rise, increasing the likelihood that buyers will hold for longer. Looking at the descending trendline from here, technical analysis suggests that the Bitcoin price is still testing the upper bound of the trendline. As the analyst explains, this upper bound happens to coincide with $106,500, which has been a major resistance for the cryptocurrency. Related Reading: Institutions Have Been Buying Solana Every Day For 2 Weeks, Is $300 Possible? In addition to the resistance above $106,000, the Bitcoin Ichimoku cloud also shows a rise in bearish pressure. This means that the $100,000 psychological level is still at risk, and if it breaks, then the current decline could deepen. The targets for this Bitcoin price crash lie well below the $90,000 level. The first major support is at $93,000, but a break below here could extend the decline to as low as $88,000 before the bulls find their footing again. Featured image from Dall.E, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54382425,
    "published": 1763108972000,
    "title": "3 Key Charts to Track as Ether Strengthens Against Bitcoin",
    "body": "Ether strengthens against bitcoin, raising hopes of a bullish breakout.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Ether|Bitcoin|XRP|Technical Analysis|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54383622,
    "published": 1763111529000,
    "title": "Bitcoin Maximalism Is Fading As Top Altcoins Like PEPENODE Rise",
    "body": "What to Know: Bitcoin’s ETF-driven evolution into digital gold is softening strict maximalism and encouraging more diversified crypto portfolios. Capital is rotating into top altcoins with real narratives, especially in infrastructure, AI and DePIN rather than pure speculation. PEPENODE mixes meme culture with gamified virtual mining and multi token rewards to keep holders engaged. For most of crypto’s history the script was simple: own Bitcoin, ignore everything else. That mindset is fading. Bitcoin now behaves more like digital gold, while the real experimentation (and much of the upside) is shifting to newer chains and app layers. Spot Bitcoin ETFs accelerated that shift. Many veteran holders in the US are moving coins from self custody into ETF wrappers to gain tax advantages and easier reporting without giving up long term $BTC exposure. Yes, OG whales definitely aren’t selling their Bitcoin for nothing – they’re going the ETF way. On chain, that unlocks fresh capital that no longer needs to sit idle. Instead of chasing random memes, that capital is rotating into infrastructure and narrative rich plays. High throughput networks like Avalanche, DePIN platforms such as Peaq and experimental designs like Kaspa’s blockDAG are drawing serious research time from investors who once swore they would never touch an altcoin. In this more mature market, Bitcoin can remain the macro anchor, while the upside shifts toward the top altcoins that pair clear stories with working products and lean tokenomics. Meme coins still matter, but they now need actual hooks. PEPENODE ($PEPENODE) tries to be one of those hooks. It blends Pepe style culture with a mine to earn model that turns virtual mining into a browser based strategy game. With more than $2.1M already raised at a presale price of $0.0011454 and 605% staking rewards, it gives rotated Bitcoin profits a defined, higher risk lane. PEPENODE’s Mine-To-Earn Model And Presale In One Snapshot PEPENODE ($PEPENODE) starts from a basic problem – most crypto presales and staking pools are passive: you buy, you lock, you wait, and attention fades long before launch. The project’s whitepaper instead describes a virtual mining simulator. After TGE, holders will build a server room inside a web app by buying Miner Nodes and upgrading Facilities with $PEPENODE. A dashboard tracks simulated hashrate, energy use and rewards so it feels like running a mining farm without hardware, noise or power bills. PEPENODE also plugs into existing meme liquidity instead of ignoring it. Leaderboards and bonus pools aim to pay rewards not only in $PEPENODE but also in some of the best meme coins such as $PEPE and $FARTCOIN. One active position can become exposure to several assets, which appeals to traders who prefer to keep their stack working instead of parked in a single token. On the funding side, the presale runs as a community first public sale with no private rounds or insider allocations. Pricing began around $0.001 and sits at $0.0011454 in the current stage, with $ETH, $BNB, $USDT and card payments accepted. Here’s how to buy PEPENODE now. Early staking yields at 605% are live alongside the raise and are designed to step down as more tokens are locked, encouraging commitment rather than quick flips. Our $PEPENODE price prediction sees a potential high near $0.0031 in 2025, with a 2026 range between roughly $0.0022 and $0.0077 if the game ships on time and user numbers grow. From a presale level around $0.0011454, that translates into indicative moves of about 2.7x at the first target and up to roughly 6.7x at the top of the 2026 band. For investors who now hold Bitcoin exposure through ETFs and want a defined risk sleeve for growth, PEPENODE offers a narrative that lines up with the wider rotation into utility driven altcoins and interactive on chain products. Consider PepeNode when shaping your next altcoin sleeve. This article is informational only, not financial advice; cryptocurrencies are highly volatile and can lead to full loss of invested capital. Authored by Elena Bistreanu, NewsBTC – https://www.newsbtc.com/news/bitcoin-maximalism-fading-top-altcoins-pepenode-rise",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54384521,
    "published": 1763113196000,
    "title": "Bitcoin, Ethereum ETFs Shed Over $1 Billion in Assets as XRP Fund Soars",
    "body": "BlackRock’s iShares Bitcoin Trust totaled more than a quarter billion in investments, in the worst day of Bitcoin ETF outflows since February.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||||Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54385865,
    "published": 1763116098000,
    "title": "Bitcoin ETFs bleed $866M in second-worst day on record, but some analysts still bullish",
    "body": "Bitcoin ETFs saw $866 million in outflows as the US shutdown ended, pushing BTC to a six-month low and raising new concerns over market structure and investor demand.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54386199,
    "published": 1763116887000,
    "title": "Community Bankers Ask OCC to Block Sony's Crypto Bank Ambitions",
    "body": "The banking group warned that Sony's stablecoin charter could undermine consumer protections and bypass rules.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 54385925,
    "published": 1763116189000,
    "title": "Cathie Wood’s ARK bags $46M of Circle stock as price dips below $90",
    "body": "Cathie Wood’s investment company, ARK Invest, is back to buying Circle, making its first purchases since selling 1.7 million shares in June.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54386092,
    "published": 1763116098000,
    "title": "Bitcoin ETFs bleed $866M in second-worst day on record, but some analysts still bullish",
    "body": "Bitcoin ETFs saw $866 million in outflows as the US shutdown ended, pushing BTC to a six-month low and raising concerns over market structure and investor demand.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54386817,
    "published": 1763118082000,
    "title": "Jack Dorsey’s Cash App Backs Stablecoins On Solana – Why That’s Bullish For Best Wallet Token ($BEST)",
    "body": "What to Know: Cash App will add stablecoin send/receive using Solana rails in 2026, pushing fast, low-cost dollar payments into the mainstream. Stablecoin UX at scale shifts power to wallets that simplify cross-chain swaps, presales access, and spending – the core Best Wallet stack. Best Wallet’s utility narrative – multichain, non-custodial, integrated DEX, card roadmap – maps cleanly onto the new payments landscape. $BEST’s $17M+ presale has a $0.025945 price, with 77% APY staking that declines over time to balance rewards and supply. Jack Dorsey just widened the rails for mainstream crypto payments. Cash App unveiled plans to let users send and receive stablecoins, with the rollout targeted for 2026. In a twist that may raise maxi eyebrows, the feature will initially lean on Solana’s network for speed and cost efficiency rather than Bitcoin’s base chain. Stable, fast, cheap – the combo is tailor-made for everyday payments and remittances. Cash App’s announcement pairs with a broader push: Lightning Network support for consumer payments now, stablecoins next. The message is simple – keep Bitcoin as money, use super-fast stablecoins for dollar-denominated spending. It’s a blueprint others can follow, and it puts stablecoin UX front and center for tens of millions of US users. That kind of distribution tends to ripple across wallets, DEXs, and on-chain tools that help people actually hold and move assets. ⚡️ Solana’s selection isn’t random. The network already handles large stablecoin flows thanks to low latency and low fees. If Cash App pipes $USDC over Solana, millions will experience chain-native payments that settle in seconds. This is the moment self-custody wallets have been waiting for: lower friction, more volume, broader use cases. Projects positioned at the wallet layer – where users start and finish transactions – look set to benefit most. And that’s where the Best Wallet app and its native Best Wallet Token ($BEST) come in. 🏆 Best Wallet marries a multi-chain, non-custodial wallet with a token that unlocks cheaper fees, staking rewards, and curated access to vetted presales. With payment rails going stable and fast, the next winners likely sit where users manage assets, swap across chains, and discover new opportunities – all in one place. That’s the $BEST thesis in a nutshell, and the Cash App news strengthens it. Best Wallet Lines Up With The New Stablecoin Reality The Best Wallet ecosystem lays out a practical, mobile-first stack: a non-custodial wallet, an integrated DEX aggregator powered by Rubic for best-rate cross-chain swaps, and a forthcoming Best Card for spending. The $BEST token ties it together with reduced in-app fees, governance rights, and direct access to ‘Upcoming Tokens’ – a presale portal that removes third-party risks and friction. In short, it’s a self-custody hub designed for what users actually do. 📖 Discover more about the Best Wallet Token in our detailed $BEST review. As more users meet stablecoins through familiar fintech frontends, many will look for deeper, lower-cost control via self-custody. Best Wallet’s presale aggregator and cross-chain swaps address the next steps: acquire assets directly, move them cheaply, and deploy them into opportunities – all without leaving your wallet. ⚙️ Utility isn’t hand-wavy either. The whitepaper details dynamic staking paid from a dedicated rewards allocation, plus smart-contract architecture on Ethereum for security and composability. That mix of EVM credibility and multichain reach fits a world where dollars move on Solana at retail scale while value accrues across chains. The wallet is the bridge; $BEST is the key. ⬇️ Download the Best Wallet app for free today. $BEST Presale Sails Past the $17M Milestone Presales live or die on clear value. Yesterday, however, the $BEST presale (now in its final two weeks) has surpassed the $17M mark. With the presale end rapidly drawing to a close, $BEST is currently priced at $0.025945. Staking is a central draw, too: early participants can lock $BEST at a 77% APY that dynamically declines as more holders join the pool. That structure aligns incentives – grow users, keep costs rational, and let APY normalize as TVL scales. 💰 Forward pricing also matters. Our price prediction for $BEST places the end-2026 target at a potential $0.05106175. From a $0.025945 entry, we’re talking an ROI of 96.8%. ➡️ Take a look at our guide to buying $BEST if you want to join the presale. Catalysts are mostly executional: expanding the wallet’s chain support and DEX depth, shipping the Best Card, and onboarding more vetted presales into the in-app portal. The official roadmap is pretty comprehensive in this sense. Context helps. Best Wallet – which has set an ambitious goal to capture ‘40% of the crypto wallet market share by the end of 2026‘ – is backed by Fireblocks’ MPC-CMP technology and a mobile-first UX. If stablecoin payments over Solana become routine, user onboarding will likely accelerate. As a non-custodial wallet that also lowers fees and opens curated deal flow, Best Wallet could well be the number one choice for many. That’s exactly where $BEST accrues value, making it one of the best crypto presales to join this year. 🚀 Ready to jump in? Head to the official presale page and buy your $BEST today. Disclaimer: This article is not financial advice. Always do your own research and be sure to invest wisely. Authored by Aaron Walker, NewsBTC – https://www.newsbtc.com/news/stablecoin-payments-cash-app-solana-best-wallet-token",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54386735,
    "published": 1763117872000,
    "title": "Chainalysis says pig-butchering is becoming a national security threat",
    "body": "Pig-butchering scams are expanding into a transnational crime model, blending trafficking and crypto laundering on a massive scale.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54386932,
    "published": 1763118301000,
    "title": "Crypto Markets Today: Bitcoin Breaches $98K as Liquidations Top $1.1B",
    "body": "A sharp liquidity crunch sent bitcoin and altcoins plunging, triggering over a billion dollars in derivatives liquidations as traders brace for a potential trend reversal.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54387022,
    "published": 1763117872000,
    "title": "Chainalysis says pig-butchering is becoming national security threat",
    "body": "Pig-butchering scams are expanding into a transnational crime model, blending trafficking and crypto laundering on a massive scale.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54388188,
    "published": 1763120617000,
    "title": "XRP ETF debut outshines all 2025 launches with $250M inflows, record volume",
    "body": "Canary Capital’s XRP ETF outperformed all 900 ETF launches of 2025, inspiring a bullish rotation among the industry’s most successful traders, who are now betting on XRP’s price increasing.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54389511,
    "published": 1763123437000,
    "title": "What Will Trigger The XRP 1,300% Break To $36 This Bull Cycle?",
    "body": "The weekly chart for XRP has compressed into a decisive structure that now sits on the edge of a major move, and the latest projection from crypto analyst Dark Defender outlines how this structure could push to as high as $36 this bull cycle. His outlook centers on an Elliott Wave pattern that started forming in June, and the chart behind the analysis shows a sequence that is approaching the point where momentum returns with force. Elliott Wave Structure Points To A Wave Three Expansion Technical analysis of the XRP’s weekly candlestick timeframe chart shows that the cryptocurrency has spent the past several months compressing inside a tightening structure, forming a narrowing support and resistance triangle. This analysis attempts to map out where this pressure leads next, particularly as XRP is now trading around the peak of this triangle, where volatility could return in force. Related Reading: Pundit Dunks On XRP Triple-Digit Dreams; Price Isn’t Going To $100 This Year Dark Defender’s projection is built on a five-wave Elliott structure that traces its origin back to mid-June, when XRP delivered its initial impulsive rally that formed Wave One. That first advance carried the price on a rally from the lower ranges into a new all-time high of $3.65 before losing steam. Since then, the second wave, which is naturally corrective based on the theory, has dragged the price action sideways to create lower highs beneath descending resistance and higher lows above the support. The chart below shows that this corrective phase is now entering its final stretch, with candles clustering inside the narrowing triangle. The technical message is straightforward: once the correction exhausts itself, the next phase of the Elliott count would be a Wave Three expansion. This third wave is the strongest and longest of the five waves, and it often receives the largest percentage gains in the entire cycle. The Breakout Zone: $2.22 Support And $2.85 Resistance The analysis marks two levels that now define XRP’s breakout conditions. The support band around $2.22 has held firm throughout the entire consolidation, providing the foundation of the structure. The resistance line is at $2.85, and this has capped every rally attempt since the summer. Related Reading: Chinese And US Governments Fighting Over Bitcoin? Here’s What We Know A weekly close above $2.85 is the trigger that would officially transition XRP out of Wave 2 and into the impulsive third wave. Any break below $2.22 would delay the bullish outlook. The Fibonacci extension levels on the chart indicate the next significant checkpoints after the Wave 3 expansion starts. The first leg of the anticipated impulse, the 261.8% extension, is located close to $5.85. However, the wider Wave 3 target is located at the 361.8% level around $18.22. Following this, the Wave 4 pullback is expected to cool the momentum before the final Wave 5 impulse completes the broader structure. The final wave reaches into the 423.6% extension, which is positioned around $36.76 on the price chart. At the time of writing, XRP is trading at $2.31, down by 8.2% in the past 24 hours. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Ripple|ripple news|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54389556,
    "published": 1763123400000,
    "title": "Proof of reserves is crypto’s key to rebuilding trust and transparency",
    "body": "Transparency through proof of reserves is essential for restoring and maintaining trust in crypto exchanges, ensuring security through independent audits and verifiable reserves.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54389146,
    "published": 1763121600000,
    "title": "Retail Traders Left Exposed in High-Stakes Crypto Treasury Deals",
    "body": "Executives are turning to a novel structure to fund crypto accumulation vehicles as investor appetite thins.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54390961,
    "published": 1763126461000,
    "title": "Morning Minute: Bitcoin Breaks Below $95K",
    "body": "It's a bloody morning for the crypto board and has got people asking—has the bear market officially begun?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Opinion",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54392134,
    "published": 1763128803000,
    "title": "Crypto On Alert: Raoul Pal Hints At Macro Twist Post-US Govt Shutdown",
    "body": "As the latest US government shutdown ends and markets refocus on macro plumbing, Raoul Pal has sketched out a strikingly liquidity-heavy roadmap on X – one that, in his framework, has direct implications for crypto. “So now the US Gov has reopened, what’s next?” Pal asks. He immediately points to the Treasury General Account (TGA): “Expect a few days for TGA spending to begin to significantly add to liquidity and should persist for several months.Obviously, QT ends in Dec and the balance sheet will crawl higher. We should see the dollar begin to weaken again.” Mechanically, TGA drawdowns push cash back into bank reserves and money markets, reversing the reserve drain that built up while the government was partially shut. At the same time, the Federal Reserve has already confirmed that quantitative tightening (QT) will end on December 1, 2025, shifting from active balance-sheet reduction to full reinvestment of maturing Treasuries and a more “maintenance” stance. When Will Crypto Prices Rise Again? Pal’s point is that both channels tilt the system toward more dollars sloshing through funding markets, a backdrop he has long argued is constructive for risk assets, including crypto. The near-term risk, in his view, is a classic year-end funding squeeze. “The next key step is to avoid a Year End funding squeeze. Expect several ‘temporary’ measures to add liquidity. Term Funding and SRF operations are most likely.” Related Reading: SEC Chair Sets Out Plans For Crypto Taxonomy To Define Digital Asset Classification Here he is referring to term repo or funding facilities and the Standing Repo Facility (SRF), which the Fed can scale up to backstop banks’ access to cash if overnight rates spike. That reading aligns with recent Fed communication that elevated SRF usage and tighter money-market conditions were central reasons for ending QT early. Pal then escalates from tactical tools to structural regulation: “That will eventually morph into the desperately needed changes to the SLR to allow banks to absorb more issuance and re-lever their balance sheets. This is a big liquidity bazooka. Expect in Q1. SLR should lower rates as banks buy more bonds.” The Supplementary Leverage Ratio (SLR) caps large banks’ overall balance-sheet size, regardless of asset risk. Loosening it for Treasuries and reserves has been debated for years as a way to let dealers warehouse more government debt without breaching constraints. If regulators move in that direction, it would, as Pal notes, free capacity for banks to buy more bonds and could exert downward pressure on yields—again easing financial conditions. Related Reading: The 2025 Year-End Crypto Outlook: The Catalysts That Will Decide Everything For crypto, that matters indirectly: Pal’s core macro thesis is that improving liquidity and lower real yields are the primary tailwinds for digital assets. Regulation is explicitly on his radar too: “Also expect CLARITY Act for crypto to begin to get finalized.” The Digital Asset Market Clarity Act of 2025 (“CLARITY Act”) has already passed the US House and is now before the Senate. It would define digital asset categories and divide oversight between the CFTC and SEC, replacing much of the current “regulation by enforcement” model. Pal’s remark signals his expectation that the shutdown’s end clears the way for renewed legislative momentum – a key piece of the institutional puzzle for non-bitcoin crypto. He closes by broadening the lens to global and fiscal policy: “There will also be stimulus payments and the Big Beautiful Bill fiscal goosing. China will continue balance sheet expansion. Europe will add fiscal stimulus or extra spending. The debts must be rolled and the Gov wants to super heat the economy into the Mid-Terms. This is the Liquidity Flood…. the spice must flow.” Taken together, Pal is describing a synchronised regime: post-shutdown TGA spending, the end of QT, potential SLR relief, progressing US crypto legislation, and ongoing fiscal and monetary support in China and Europe. For crypto investors who share his liquidity-centric lens, the message is not subtle: the macro “spice,” in his view, is about to flow again. At press time, the total crypto market cap dropped to $3.24 trillion. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto|Crypto market news|crypto news|Crypto Prices|Raoul Pal",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54391855,
    "published": 1763127932000,
    "title": "Uniswap revives ICO-style token launches with new onchain auction system",
    "body": "Uniswap launched Continuous Clearing Auctions, a new onchain token sale mechanism designed to offer transparent price discovery, debuting with Aztec’s sale.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 53,
        "NAME": "UNI",
        "CATEGORY": "UNI"
      },
      {
        "TYPE": "122",
        "ID": 205,
        "NAME": "TOKEN SALE",
        "CATEGORY": "TOKEN SALE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54392573,
    "published": 1763129371000,
    "title": "UK central bank still ‘disproportionately cautious’ about stablecoins",
    "body": "Some crypto industry observers believe that the Bank of England’s new proposed regulations for stablecoins are unnecessarily restrictive.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54392323,
    "published": 1763129143000,
    "title": "Bitcoin Hyper Whale Buy Fuels 1000x Talk As Presale Nears Finish",
    "body": "What to Know: A single $HYPER purchase of $502.6K added credible whale validation to a late-stage presale narrative. Bitcoin Hyper aims to deliver SVM-level throughput while settling to Bitcoin, targeting fast, low-fee $BTC transactions and usable DeFi rails. The $HYPER presale raised over $27.5M so far with a token price of $0.013275 and a staking reward of 42%. Based on $HYPER’s current price, investing now could reward you with an ROI of 572% or 1,805% by 2026 and 2030 respectively. Big money keeps circling fresh Bitcoin infrastructure plays. This week, a single on-chain purchase worth roughly half a million dollars in $HYPER lit up whale trackers, throwing a spotlight on Bitcoin Hyper’s ($HYPER) layer-2 pitch just as its presale enters the final stretch. The buy-in arrived at a moment when Bitcoin scaling narratives are driving capital flows across Layer-2s and sidechains. Faster settlement, cheaper fees, more programmable rails for $BTC – that’s where the puck is going, and that’s the lane Bitcoin Hyper wants to own. Bitcoin Hyper positions itself as a Bitcoin Layer-2 built around a Solana Virtual Machine (SVM) execution layer, bridging $BTC into a high-throughput environment while committing its state back to Bitcoin for security. The promise is simple: near-instant $BTC transactions and a workable home for Bitcoin-centric DeFi and apps without abandoning Bitcoin’s base-layer assurances. That combination – speed from an SVM stack, settlement discipline from Bitcoin – is the core of the project’s pitch. The momentum is already there, even without whales adding more fuel to the fire. Fresh capital validates the story, adds perceived scarcity pressure, and sets a reference point for what deep-pocketed traders are willing to risk ahead of a first listing. ➡️ Read more about this innovative project with 1000x potential in our detailed Bitcoin Hyper review. SVM-Powered Bitcoin Layer-2 Targeting Real Throughput Under the hood, Bitcoin Hyper’s ($HYPER) design will funnel $BTC through a canonical bridge, mint an equivalent value on its Layer-2, process transactions in an SVM environment for high throughput, and then commit proofs back to Bitcoin’s Layer-1. The intent is to preserve Bitcoin-grade security while overcoming Layer-1 bottlenecks. The Hyper roadmap references sequencing research, zero-knowledge proofs, and periodic state commitments – the right ingredients for a Layer-2 that wants to run payments, order books, and staking without grinding to a halt. For developers, the SVM angle taps an ecosystem that already understands performant, parallelized runtime patterns. For users, the value prop is faster finality and lower fees while still settling to Bitcoin. Utility is the point here. If the bridge and execution stack work as described, Bitcoin Hyper can become the place where $BTC actually moves at app speed. That creates room for payments, market venues, and on-chain tools tied directly to the asset people already hold. The upshot for presale buyers is straightforward: useful block space tends to find demand, and demand is what sustains fees and token utility. Presale Success as it Draws to a Close Presales are about price, runway, and conviction. The Bitcoin Hyper presale has already cleared $27.5M+, with a current token price of $0.013275 and staking rewards set at 42% for early participants. Our $0.08925 price prediction for $HYPER suggests a potential ROI of 572% if the hype momentum holds. By 2030, following a successful implementation, $HYPER could get to $0.253, for a return rate of 1,805% based on today’s price. ➡️ Read our guide to buying $HYPER if you’re thinking of buying in. On signals, whale activity is setting the tone. Yesterday’s whale transaction saw 155.62 $ETH routed through the presale contract, with distributions to multiple recipient addresses and an associated $HYPER transfer of 36.86M tokens. 💰 Historical cost accounting at the execution time puts the gross outlay at $502.6K – massive enough to register, spot on the ‘half a million’ mark to move sentiment. In presales, that matters. It tells mid-sized buyers the order book isn’t only retail. On runway, the presale’s $27.5M+ haul and 42% staking rewards set a clear incentive for early participants while the network spins up. If the staking mechanism draws sufficient lock-in ahead of TGE, it softens the initial float and can stabilize early price action if listings open with typical volatility. Couple that with the SVM narrative and the broader hunt for Bitcoin-centric block space, and you get a presale with enough story, enough numbers, and now, enough whale interest to justify a closer look before the window shuts. It’s no wonder that, in terms of numbers and community support, Hyper already qualifies as one of the best crypto presales of 2025. Bitcoin Hyper is eyeing a Q4 2025/Q1 2026 release window, so there’s not much time left to join the presale. Plus the presale price goes up in stages, while the staking APY lowers as more holders join the pool. 🚀 Don’t delay – buy your $HYPER today. Disclaimer: This isn’t financial advice. Always do your own research before making any investment. Authored by Aaron Walker, NewsBTC – https://www.newsbtc.com/news/bitcoin-hyper-whale-buy-1000x-potential-presale-near-finish",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54393046,
    "published": 1763116098000,
    "title": "Bitcoin ETFs bleed $866M in 2nd-worst day on record, but the bull narrative refuses to die",
    "body": "Bitcoin ETFs saw $866 million in outflows as the US shutdown ended, pushing BTC to a six-month low and raising concerns over market structure and investor demand.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54393974,
    "published": 1763132393000,
    "title": "Ether Tumbles 8% as ETFs Bleed Over $1.4B, Long-Term Holders Sell",
    "body": "ETH plunged below $3,100 on Friday as the crypto selloff accelerated with bitcoin losing the $100,000 level.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Ethereum|AI Market Insights|Ether ETFs|Glassnode|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54394306,
    "published": 1763133016000,
    "title": "Crypto Bulls Get Rekt as Ethereum, XRP Fall Harder Than Bitcoin",
    "body": "Think Bitcoin is having a bad day? Altcoins have been hit much harder, and crypto liquidations are piling up.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54394852,
    "published": 1763134203000,
    "title": "Why Are The Bitcoin, Ethereum, And Dogecoin Prices Down Again?",
    "body": "The cryptocurrency market is experiencing a wave of declines, leaving investors concerned as the Bitcoin, Ethereum, and Dogecoin prices fall sharply. Despite experiencing a period of recovery earlier this week, all three digital assets are now facing renewed downward pressure. The latest price declines are driven by both macroeconomic uncertainty and internal market factors, underscoring how sensitive the crypto market remains to changes in investor sentiment. FED Skepticism Fuel Decline In Bitcoin, Ethereum, And Dogecoin The recent decline in cryptocurrency prices comes amid growing doubts over the Federal Reserve’s (FED) approach to interest rates. Recent remarks from FED officials, including the President of the Federal Reserve Bank of Minneapolis, Neel Kashkari, have cast uncertainty on whether the central bank will deliver a third consecutive easing of policy during the December FOMC meeting. Related Reading: Why The Bitcoin Price Crash Is Important If Wave 5 Corrects To $94,000 According to Bloomberg reports, Kashkari noted that recent economic data suggested more resilience than was initially anticipated, sparking a debate over the necessity of further rate cuts. This cautious stance has unsettled financial markets, causing investors to reconsider earlier positions as former expectations of a rate now appear uncertain. Notably, Bitcoin, Ethereum, and Dogecoin have reacted sharply to the prevailing sentiment caused by the doubts in monetary easing. Their prices have plummeted, accelerating the broader correction that has been dragging on for months. This decline is also being augmented by large-scale whale sell offs and lingering ambiguity surrounding new developments in the previous US government shutdown. How Much BTC, ETH, And DOGE Declined This Week In addition to macroeconomic factors, market dynamics are also contributing to crypto losses. CoinMarketCap’s data shows that the Bitcoin price crashed below $97,000 for the first time since May 2025. It has fallen more than 5% over the week and dropped another 6.4% in a single day. Related Reading: Analysts Share Forecasts As Ethereum Price Struggles Below $4,000, And It’s Very Bearish Amidst this decline, long-term BTC holders are reportedly selling at record levels, fueling the downtrend. Additionally, institutional demand is weakening while investor sentiment has turned negative. Even Spot Bitcoin ETF activity is plummeting, recording over $866.7 million in net outflows yesterday—the second largest in its history. Ethereum has also been hit hard, losing more than 10% in the past 24 hours and over 5% this week. The price has steadily trended downward for weeks and shows no clear signs of recovery. At the time of writing, ETH is trading at $3,200, down more than 35% from the ATH levels above $4,950 set in August this year. Dogecoin, while only slightly affected by the broader bearish trend, is now trading at $0.165. It has fallen by approximately 2.3% during the week and by an additional 8% in one day. Collectively, these widespread declines suggest that the market may be experiencing a period of extreme stress, as all three cryptocurrencies have recorded double-digit monthly losses. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|Bank of Minneapolis|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|CoinMarketCap|ethereum|fed|federal reserve|FOMC Meeting|Neel Kashkari|pot Bitcoin ETF",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54394621,
    "published": 1763133626000,
    "title": "Detroit Man Jailed for 9 Years Over Bitcoin Donations Intended for ISIS",
    "body": "Operating “in the shadows,” the man sent Bitcoin to a federal informant he believed was an ISIS operative.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54395318,
    "published": 1763135046000,
    "title": "This $2.5 Billion BlackRock Fund Is Coming to Binance and BNB Chain",
    "body": "BlackRock’s $2.5 billion USD Institutional Digital Liquidity Fund (BUIDL) is expanding to Binance and BNB Chain, Securitize said Friday.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54395839,
    "published": 1763135978000,
    "title": "CFO Convicted for Losing $35 Million of Company Money in Crypto Side Hustle",
    "body": "Nevin Shetty invested the stolen funds in DeFi lending protocols in 2022, and was starting to turn a handsome profit—until Terra and the broader crypto market collapsed.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|terra-luna-2|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54396201,
    "published": 1763136781000,
    "title": "BlackRock’s $2.5B Tokenized Fund Gets Listed as Collateral on Binance, Expands to BNB Chain",
    "body": "The $2.5 billion BUIDL fund, tokenized by Securitize, deepens its utility for institutional traders and expands to a new blockchain.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Tokenization|Real World Assets|Securitize|Binance|BlackRock|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54396359,
    "published": 1763136907000,
    "title": "How Square’s new Bitcoin payments could change how merchants accept money online",
    "body": "Square’s new Bitcoin payments may redefine how merchants accept money online with faster settlement, lower costs and greater financial control.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54397591,
    "published": 1763139637000,
    "title": "This Analyst Called The Bitcoin Crash Below $20,000 In 2021, He’s Back With A Shocking Prediction For Solana",
    "body": "A crypto analyst who famously forecasted the dramatic Bitcoin (BTC) crash to $20,000 in 2021 has caught the attention of investors and traders with a new warning about Solana (SOL). In a technical analysis, he identifies a critical resistance zone that he believes must be reclaimed soon. Without recovery, he warns that the SOL price could break down toward a much lower level, deepening the cryptocurrency’s already persistent downtrend. Bitcoin Crash Caller Issues New Solana Alert After projecting BTC’s collapse four years ago, crypto market expert DonAlt is highlighting new risks in Solana. In one of his latest analyses, DonAlt shared a detailed look at Solana’s price structure, including a chart that highlights a major red resistance zone between $190 and $215. Related Reading: Ripple Exec Reveals Why The Bitcoin Price Is So High Now According to him, this is the range level Solana must recover to avoid a deeper correction. The analyst explained that his stance on Solana has been bearish for some time, and the recent rejection from this key resistance area has only reinforced that outlook. The SOL price chart shows several failed attempts to close above the red box, suggesting that sellers may still be controlling the trend despite recent accumulation. The upper range line around $250 has acted as an unyielding ceiling for months now, and DonAlt has indicated that as long as Solana trades significantly below it, the market should be considered structurally weak. Currently, the altcoin’s price has slipped toward mid-range levels, and the weekly timeframe is starting to exhibit early signs of a bearish breakdown. In a previous report, DonAlt presented the same chart structure, emphasizing that Solana’s price action remains “awful” unless buyers step in within two days to rescue the weekly close. If they fail to do so, he expects the cryptocurrency’s price to fall back toward the range support at $126. At the time of writing, Solana is trading around $141, meaning a decline to $126 would represent a more than 10% drop in value. Notably, the bearish pressure is visible on the chart candles, which continue to weaken each time Solana approaches the red resistance zone. The trend reflects a diminishing strength and a steady decline in momentum, further augmented by the broader crypto downtrend and rising volatility. SOL HTF Chart Signals Severe Breakdown Risk DonAlt has also displayed a High-Time Frame (HTF) chart that he considers one of the most bearish he has seen in recent months. The chart shows a clean rejection from the upper boundary near $208, underscoring the weakness developing in higher timeframes. Related Reading: XRP Set To Lead The Next Bull Rally: Crypto Research Firm Blows The Lid Open While many traders assume that bearish setups fail when they become too obvious, DonAlt suggests that the current situation with Solana is opposite. He points out that almost no one is panicking or even discussing the potential risks, which is even more unusual, indicating that this silence may be masking real vulnerability. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Solana|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|Sol|SOL news|SOL Price|Solana news|Solana Price|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54397234,
    "published": 1763137394000,
    "title": "Bitcoin below $95k! Majors nosedive 8-12%! JPMorgan bullish on Circle!",
    "body": "Crypto majors fell 7–12% in one of the year’s biggest selloffs, with Bitcoin down 8% to $95,200, Ethereum down 11% to $3,100, BNB down 7% to $895, and Solana down 12% to $137. A few assets bucked the trend, with ZEC up 3% and LEO up 1% among top movers. Bitcoin miners and crypto-related equities were hit as well, including declines in MicroStrategy (-7%), Coinbase (-7%), and Robinhood (-9%). Market sentiment remained deeply negative, with the Crypto Fear & Greed Index holding in Extreme Fear at 16. In more positive news, JPMorgan analysts turned bullish on Circle, upgrading the stock to Overweight and raising their price target on expectations of faster USDC and stablecoin growth; Cathie Wood’s ARK added $30 million in shares. Jack Dorsey’s Cash App announced that stablecoin payments on Solana and other networks are planned for early 2026. Separately, reports surfaced that China state-backed hackers allegedly used Anthropic’s Claude Code to assist in a major cyberattack affecting roughly 30 companies. Additional disclosures revealed Epstein estate emails referencing Bitcoin discussions between Brock Pierce and Larry Summers at Jeffrey Epstein’s Manhattan townhouse. Meanwhile, Emory University doubled its Bitcoin holdings in Grayscale’s BTC Trust, bringing its total to $52 million.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54398455,
    "published": 1763141401000,
    "title": "'Some Bad Shit. Very Bad': Jeffrey Epstein Was Worried About Bitcoin and Crypto Taxes, Emails Reveal",
    "body": "A year prior to his death, the sex offender attempted to influence the Trump administration's crypto policy through Steve Bannon.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54398123,
    "published": 1763140797000,
    "title": "Oklahoma Man Gets Five-Year Sentence for $9.4M Crypto Ponzi Scheme",
    "body": "Travis Ford pleaded guilty to conspiracy to commit wire fraud in January, in a case involving millions in investor losses.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 54398936,
    "published": 1763142409000,
    "title": "U.S. DOJ Pursues North Korea's Illicit Money Machine, Seizes More Crypto",
    "body": "U.S. authorities secured several criminal convictions and gathered another $15 million in proceeds from North Korean crypto heists, the Justice Department said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Federal bureau of investigation|U.S. Department of Justice|Crypto Seizures|North Korea|Bitcoin Strategic Reserve|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54398965,
    "published": 1763142356000,
    "title": "Michael Saylor Denies Bitcoin Sale Rumors, Says Strategy's BTC Buys Are 'Accelerating'",
    "body": "Strategy's co-founder and executive chairman described the company's hunger for Bitcoin as insatiable, while denying rumors of a recent sale.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54399367,
    "published": 1763143203000,
    "title": "Analyst Highlights Interesting Dogecoin Double Top Adam & Eve Pattern",
    "body": "Crypto analyst Tripy has highlighted a double-top Adam and Eve pattern that could send the Dogecoin price as low as $0.16. Meanwhile, crypto XAU has also highlighted a bearish setup that could spark a further decline to $0.15. Dogecoin Price Risks Drop To $0.16 With Double Top Adam And Eve Pattern In a TradingView post, Tripy revealed that a classic Adam and Eve pattern has formed for the Dogecoin price. The analyst warned that market participants may see volatility around the breakdown, but that the pattern rarely fails. His accompanying chart showed that DOGE could suffer a decline to as low as $0.16 due to this double top pattern. Related Reading: Analyst Predicts Dogecoin Price “Historic Mega Run” – Here’s The Target Tripy also revealed that the MACD and volume are falling, indicating that a sell-off is coming for the Dogecoin price. A positive is that the analyst expects DOGE to rebound from the $0.16 range. The sell-off in the foremost meme coin is underway, with DOGE recording a significant decline yesterday as Bitcoin dropped below $100,000 for the second time this month. Crypto analyst XAU drew a bearish setup toward $0.15 for the Dogecoin price. He noted that DOGE remains under strong bearish pressure, following multiple Breaks of Structure (BOS) and Market Structure (MSS) on the 3-hour timeframe. The analyst further stated that after a brief consolidation phase, the price continues to respect the descending trend, indicating a lack of bullish strength. Notably, the Dogecoin price had attempted a minor upward correction toward the psychological $0.2 level but failed to reclaim the zone. As a result, XAU has warned that this may trigger a sharp drop toward the $0.15 level, which will confirm continuation of the broader bearish trend. The analyst added that momentum remains weak and sellers continue to dominate short-term rallies, indicating further downside pressure. DOGE Reenters Broadening Wedge In an X post, crypto analyst Trader Tardigrade revealed that the Dogecoin price has reentered the broadening wedge after a “Spring Action.” He added that this pattern was last seen in 2024, just before a massive surge. His accompanying chart showed that DOGE could still rally to $0.8, despite the current bearish price action. A rally to this level would mark a new all-time high (ATH) for the foremost meme coin. Related Reading: Dogecoin Price Rally Above $0.74 ATHs In The Works As HTF Trend Holds In the short term, Trader Tradigrade indicated that the Dogecoin price could reclaim the $0.2 level. He stated that DOGE has returned to the previous level as the RSI indicates a breakout of a trendline. His accompanying chart showed that DOGE could reach $0.26 after reclaiming the $0.2 level. At the time of writing, the Dogecoin price is trading at around $0.163, down over 5% in the last 24 hours, according to data from CoinMarketCap. Featured image from Peakpx, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Dogecoin|Adam and Eve Pattern|bitcoin|BOS|Breaks of Structure|CoinMarketCap|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt|MACD|Market Structure|meme coin|MSS|RSI|Trader Tardigrade|Tripy|xau",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54399782,
    "published": 1763144040000,
    "title": "Tether eyes €1bn funding deal with AI robotics start-up Neura",
    "body": "Cryptocurrency giant seeks to build on sprawling investment portfolio with bet on German humanoid robotics group",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54400352,
    "published": 1763145000000,
    "title": "ETH long-term holders dump 45K Ether per day: Is a price drop to $2.5K next?",
    "body": "Ether price is at risk of a 23% drop to $2,500 if long-term investors maintain their current pace of selling. Cointelegraph explains what must happen for a bullish reversal to take place.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54399978,
    "published": 1763144180000,
    "title": "‘We are buying’: Michael Saylor denies reports of Strategy dumping BTC",
    "body": "Strategy will add to its 640,000 Bitcoin holdings by continuing to buy amid a flash crash in BTC price, Michael Saylor said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54400692,
    "published": 1763145634000,
    "title": "'Demonic': AI App That Lets Users 'Talk' to Dead Loved Ones Faces Backlash",
    "body": "2Wai’s new “HoloAvatar” tool turns minutes of footage into lifelike replicas of deceased loved ones, igniting ethical alarms over consent, privacy, and the commercialization of grief.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54400423,
    "published": 1763144611000,
    "title": "BlackRock Fund Offered on Binance Marks Shift in Crypto Plumbing",
    "body": "BlackRock Inc.’s tokenized fund will be accepted as collateral on Binance Holdings Ltd., in a step that broadens access of the asset manager’s blockchain-linked products on the largest crypto trading platform and marks Wall Street’s deepening ties with the digital-asset world.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "NYS:BLK",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54401219,
    "published": 1763146800000,
    "title": "Bitcoin falls to 6-month low as ETF demand collapses: Finance Redefined",
    "body": "Bitcoin drops to a six-month low as spot ETF outflows resume despite the US shutdown ending, signaling weak demand and renewed pressure on crypto markets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54403072,
    "published": 1763150411000,
    "title": "Dogecoin Shows Relative Strength: Breakout Signal Sits At This Price",
    "body": "Dogecoin is showing unexpected resilience while the broader crypto market trades in a weak pattern, according to trader Daan Crypto Trades (@DaanCrypto). In a chart posted on X on November 13, he highlighted a potential “range retake” that could set up a move toward the previous range high at roughly $0.218—if DOGE can break and hold above $0.18. Dogecoin Bulls Have A Target “DOGE has been relatively strong the past few days. Overall market is obviously weak and choppy,” he wrote. At the time of his chart, Dogecoin traded around $0.172 on Binance, sitting just below a key green support band marking the range low between $0.17 and $0.18 . The range high—drawn at $0.21817 —remains the upside target if price can reclaim the lower boundary. The distance between the band and the top of the range is 23.1%, a move Daan considers technically clean if momentum aligns. The trader also pointed to a narrative circulating in US markets: proposed 2,000-dollar stimulus or dividend checks by the Trump administration. He noted the psychological connection many retail traders still have to the “stimmy check” era of 2020–2021, when Dogecoin was one of the cycle’s strongest performers. Related Reading: Dogecoin Whales Load Up: 4.72 Billion DOGE Vanish Into Mega Wallets “I think the 2,000 dollar stimulus/dividend checks to US workers might have re-ignited some muscle memory,” he said, adding that younger traders often look for speculative assets rather than Bitcoin or Ethereum when deploying unexpected cash. Technically, the setup he is monitoring is straightforward: DOGE previously broke below its established range, flushed to lower lows, and is now attempting to push back into the band. His chart shows two rounded swing lows, suggesting a potential base forming. A reclaim of the green zone—validated by closing strength above $0.18 —would signal that sellers have lost control and that the upper boundary at $0.218 could come back into focus. Related Reading: Dogecoin Whales Load Up: 4.72 Billion DOGE Vanish Into Mega Wallets “Regardless of all that, I am watching closely here for this range retake,” he wrote. “I think it could make for a clean setup for a move back to the range highs. Need BTC & ETH to hold the floor for that to play out obviously.” That final clause underscores the conditional nature of his view. Dogecoin often behaves as a high-beta expression of market risk, and Daan is explicit that a broader market breakdown would invalidate the scenario, even if DOGE briefly trades above $0.18. Questions about his seemingly long-oriented emphasis prompted clarification. One user asked why he focuses mainly on upside setups, prompting Daan to respond: “I do both sides personally for short term scalps. But the moment you post short setups people get quite angry.” He added that long setups tend to offer better risk-to-reward for most traders and that shorting after recent “big liquidation flushes” like the October 10 event is generally less appealing. His posted chart reflects that preference: a potential bullish reclaim rather than an attempt to fade resistance. For now, the key remains unchanged—confirmation only comes with a sustained break above $0.18. Without that level, Dogecoin stays inside its lower consolidation, with Bitcoin and Ethereum setting the broader context for whether the memecoin can extend its relative strength. At press time, DOGE traded at $0.15943. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54403588,
    "published": 1763151004000,
    "title": "‘Volatility is your friend’: Eric Trump not bothered by Bitcoin, crypto carnage",
    "body": "Eric Trump shrugs off an extended crypto sell-off as American Bitcoin ramps up its holdings and climbs into the top ranks of public BTC treasuries.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54403660,
    "published": 1763088419000,
    "title": "Bitfarms plunges 18% after plan to wind down Bitcoin mining ops",
    "body": "Bitfarms said it plans to shift its Bitcoin mining sites over the next two years and convert them to power AI, starting with its major site in Washington.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54403788,
    "published": 1763151564000,
    "title": "Strategy’s NAV falls under 1, critics raise alarm after $5.7B Bitcoin wallet move",
    "body": "Strategy moves $5.7 billion in Bitcoin as its net asset value to its Bitcoin holdings drops below one for the first time, sparking valuation concerns amid marketwide speculation.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54404084,
    "published": 1763089334000,
    "title": "Ban on rewards tied to stablecoin payments is un-American: Coinbase",
    "body": "Coinbase Institute has criticized banking groups for asking regulators to prevent merchant rewards for stablecoin customers, arguing the request has no merit under the GENIUS Act.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54404083,
    "published": 1763088419000,
    "title": "Bitfarms plunges 18% after plan to wind down Bitcoin mining ops",
    "body": "Bitfarms said it plans to shift its Bitcoin mining sites over the next two years and convert them to power AI, starting with its major site in Washington.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54404653,
    "published": 1763089334000,
    "title": "Ban on rewards tied to stablecoin payments is un-American: Coinbase",
    "body": "Coinbase Institute has criticized banking groups for asking regulators to prevent merchant rewards for stablecoin customers, arguing the request has no merit under the GENIUS Act.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54404528,
    "published": 1763089334000,
    "title": "Ban on rewards tied to stablecoin payments is un-American: Coinbase",
    "body": "Coinbase Institute has criticized banking groups for asking regulators to prevent merchant rewards for stablecoin customers, arguing the request has no merit under the GENIUS Act.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54404207,
    "published": 1763089334000,
    "title": "Ban on rewards tied to stablecoin payments is un-American: Coinbase",
    "body": "Coinbase Institute has criticized banking groups for asking regulators to prevent merchant rewards for stablecoin customers, arguing the request has no merit under the GENIUS Act.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54405162,
    "published": 1763154031000,
    "title": "Why This Pundit Believes XRP Could Become A ‘Joke’ As ETFs Go Live",
    "body": "A recently shared image on X showing the full lineup of pending XRP ETF filings prompted a blunt response from market commentator Robert Ledferd. Instead of offering predictions or excitement, he framed the moment as a straightforward test for the asset, noting that if XRP cannot climb into double-digit territory once this many ETFs are live, the market may end up treating it as a joke. The comment brings into question what price level actually represents meaningful progress once institutional money enters the picture for XRP. Why The Comment Landed Strongly Ledferd reacted to a screenshot listing nearly every major issuer preparing an XRP product, including firms such as Bitwise, Grayscale, Fidelity, VanEck, Invesco, CoinShares, Franklin Templeton, Hashdex, and ARK Invest. The number of issuers alone means that XRP is entering a phase where institutional exposure will no longer be theoretical. Related Reading: Analyst Predicts XRP “Supply Crisis” To Trigger The Next Parabolic Rally The general consensus is that when these ETFs hit the market, XRP will receive massive institutional inflows comparable to that of Bitcoin and Ethereum, which, in turn, would be reflected in its price action. With this in mind, the pundit noted that XRP will be the “joke of the year” if these ETFs do not bring the cryptocurrency’s price to at least double digits.” Where XRP Needs To Trade For ETFs To Matter The numerical reality behind this expectation is straightforward. XRP is currently trading well below the $3 price level. Particularly, XRP is trading at $2.3, which means even a return to its $3.65 all-time high would require a price increase of about 40% from present levels. To reach actual double digits above $10, it means the price of XRP would need to rise more than 320% from its current price. Before XRP can target double digits, however, it must convincingly break and close above the region between $3 and $3.65. This region is a structural pivot because it is where previous rallies have lost momentum If ETF demand is genuine, the first sign of it will be whether XRP can push above the $3 line and hold it as support. Such a move would confirm that new inflows are not being neutralized by selling pressure and that the buying pressure is absorbing tokens at a faster rate than they are being distributed. Related Reading: Analyst Says Don’t Get Left Behind As Massive Liquidity Wave Is Coming For XRP XRP currently has a total circulating supply of 60 billion tokens. Therefore, a move to $4 implies a market cap of $240 billion. On the other hand, a move to $10 implies a valuation above $600 billion. A $600-billion valuation would place XRP behind only Bitcoin in terms of market cap rankings. These numbers matter because ETF impact is not measured by price alone but by how much capital is required to move an asset of this size. If Spot XRP ETFs begin attracting even a small fraction of the inflows seen in early Bitcoin ETF trading, the push to $4 becomes more realistic. At the time of writing, the first US Spot XRP-backed ETF has officially been launched by Canary Capital with ticker XRPC and began trading on the Nasdaq Stock Market on November 13, 2025. Featured image from Peakpx, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP News|ark invest|bitwise|Canary Capital|coinshares|fidelity|Franklin Templeton|grayscale|Hashdex|Invesco|Ripple|Robert Ledferd|Spot XRP ETF|VanEck|xrp|xrp news|XRP Price|XRPC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54404896,
    "published": 1763089334000,
    "title": "Ban on rewards tied to stablecoin payments is un-American: Coinbase",
    "body": "Coinbase Institute has criticized banking groups for asking regulators to prevent merchant rewards for stablecoin customers, arguing the request has no merit under the GENIUS Act.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54405319,
    "published": 1763154238000,
    "title": "Binance adds BlackRock’s BUIDL as off-exchange collateral for institutional traders",
    "body": "The integration marks another step in centralized exchanges adopting tokenized Treasurys, expanding RWA collateral across major trading platforms.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54406266,
    "published": 1763155800000,
    "title": "Bitcoin's 2-year trend is about to collapse: Will bulls defend $90K?",
    "body": "Bitcoin lost multiple critical support areas as data show short-term investors holding on to capitulation-level losses, raising fears of a deeper breakdown in BTC price.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54406436,
    "published": 1763155930000,
    "title": "Bitcoin miners retreat sharply as BTC pulls back from recent highs",
    "body": "Major mining stocks dropped 20%–50% this week, erasing billions in value as the sector continued to lag Bitcoin’s latest pullback.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54406635,
    "published": 1763099857000,
    "title": "US regulator mulls guidance for tokenized deposit insurance, stablecoins",
    "body": "Acting FDIC Chair Travis Hill said the agency is also working on a regime for stablecoin issuance and expects to issue a proposal for an application process by the end of year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54406563,
    "published": 1763095939000,
    "title": "Bitcoin can win US voters regardless of political lean, survey finds",
    "body": "Bitcoin’s ability to boost financial inclusion, allow transactions without government interference, and strengthen the energy grid means it can align with the values of nearly any voter.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54406383,
    "published": 1763095939000,
    "title": "Bitcoin can win US voters regardless of political lean, survey finds",
    "body": "Bitcoin’s ability to boost financial inclusion, allow transactions without government interference, and strengthen the energy grid means it can align with the values of nearly any voter.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54406315,
    "published": 1763095939000,
    "title": "Bitcoin can win US voters regardless of political lean, survey finds",
    "body": "Bitcoin’s ability to boost financial inclusion, allow transactions without government interference, and strengthen the energy grid means it can align with the values of nearly any voter.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54407145,
    "published": 1763157635000,
    "title": "Solana Core Evolution: Here’s The Underrated Impact Of The BIT Narrative",
    "body": "Solana is evolving faster than most market participants realize, and it has been celebrated for its blistering speed and low transaction costs. The BIT narrative movement within the SOL ecosystem is quietly driving a core evolution of the platform, cementing the network’s position as a leading blockchain. How BIT Is Reshaping The Solana Infrastructure BIT is quietly becoming one of Solana’s most underrated narratives right now. An analyst known as CryptoDoc has revealed on X that Bitdealernet is building an asset-backed meme launchpad, where every token launch on their platform is tied to real iGaming products with millions of active players. Related Reading: Solana DEX Volume Hits $5B as Best Wallet Token Surpasses $16.9M The project has integrated directly with major Solana Decentralized Finance (DeFi) platforms, including Meteora and Jupiter, which gives the token instant access to SOL’s premier DeFi tools. Additionally, it has established direct connections with popular trading platforms, including Axiom, Bonkbot, Photon, and BullX; an integration that provides liquidity, reach, and utility from day one. This project leverages over 4 million users across its gaming ecosystem this year alone. With the corporation of KOL rev share mechanics, which creates powerful incentives that align with the entire ecosystem to be deflationary by design. These features are why this looks like the next evolution of meme economics. According to cryptoDoc, this is not just another meme, but it’s a meme with a business behind it, and BIT is setting the new standard for sustainable meme tokens. Strategic Deployment Of The Bitdealer App Chain An X analyst, BCBlueSkyVC, has also mentioned that Bitdealer may still be in its early stages, but the vision it is building toward is undeniably massive. While Bitdealernet is currently laying its foundational pieces, the roadmap reveals a bold, structured direction with important steps. Related Reading: Western Union Reveals Plans For USDPT Stablecoin On Solana, Set To Debut In 2026 The rollout of the Bitdealer App Chain is creating its own dedicated infrastructure for the ecosystem and expanding the iGaming catalog to diversify the iGaming experience. This launching of NFT-based Player Profiles innovation transforms user identity into valuable digital assets, increasing transparency in token management and strengthening community trust. If executed with precision, Bitdealer could evolve into a segment-defining platform where meme culture meets iGaming utility and DeFi incentives to create a unified Web3 experience. The project’s vision is bold, and its direction is clear, which will make crypto a fun and transparent space to be in that truly rewards real users, not just speculators. Bitdealer is not simply building another launchpad, but it’s creating a cultural-financial hub on Solana, where digital culture, gaming, and decentralized finance resonate in oneness to reward real users. Featured image from Pxfuel, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Solana|Axiom|BCBlueSkyVC|Bit|Bitdealer|Bitdealer App Chain|Bonkbot|BullX|CryptoDoc|decentralized finance|DeFi|igaming|KOL|NFT|Photon|Sol|SOL news|SOL Price|Solana news|Solana Price|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54407127,
    "published": 1763099857000,
    "title": "US regulator mulls guidance for tokenized deposit insurance, stablecoins",
    "body": "Acting FDIC Chair Travis Hill said the agency is also working on a regime for stablecoin issuance and expects to issue a proposal for an application process by the end of year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54406807,
    "published": 1763099857000,
    "title": "US regulator mulls guidance for tokenized deposit insurance, stablecoins",
    "body": "Acting FDIC Chair Travis Hill said the agency is also working on a regime for stablecoin issuance and expects to issue a proposal for an application process by the end of year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54407058,
    "published": 1763099857000,
    "title": "US regulator mulls guidance for tokenized deposit insurance, stablecoins",
    "body": "Acting FDIC Chair Travis Hill said the agency is also working on a regime for stablecoin issuance and expects to issue a proposal for an application process by the end of year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54407007,
    "published": 1763099857000,
    "title": "US regulator mulls guidance for tokenized deposit insurance, stablecoins",
    "body": "Acting FDIC Chair Travis Hill said the agency is also working on a regime for stablecoin issuance and expects to issue a proposal for an application process by the end of year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54407633,
    "published": 1763099857000,
    "title": "US regulator mulls guidance for tokenized deposit insurance, stablecoins",
    "body": "Acting FDIC Chair Travis Hill said the agency is also working on a regime for stablecoin issuance and expects to issue a proposal for an application process by the end of year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54407382,
    "published": 1763099857000,
    "title": "US regulator mulls guidance for tokenized deposit insurance, stablecoins",
    "body": "Acting FDIC Chair Travis Hill said the agency is also working on a regime for stablecoin issuance and expects to issue a proposal for an application process by the end of year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54408175,
    "published": 1763159400000,
    "title": "SOL drops to 5-month low despite Solana spot ETF success: Is $100 next?",
    "body": "Solana ETFs recorded inflows for 13 consecutive days, but SOL price lost key technical support levels, sparking fears of a drop to $100.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54407999,
    "published": 1763107506000,
    "title": "Aave to offer zero-fee stablecoin ramps in Europe after MiCA approval",
    "body": "Aave said compliant, audited payment pathways are crucial for onboarding new users to decentralized finance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54408119,
    "published": 1763107506000,
    "title": "Aave to offer zero-fee stablecoin ramps in Europe after MiCA approval",
    "body": "Aave said compliant, audited payment pathways are crucial for onboarding new users to decentralized finance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54407998,
    "published": 1763099857000,
    "title": "US regulator mulls guidance for tokenized deposit insurance, stablecoins",
    "body": "Acting FDIC Chair Travis Hill said the agency is also working on a regime for stablecoin issuance and expects to issue a proposal for an application process by the end of year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54408117,
    "published": 1763099857000,
    "title": "US regulator mulls guidance for tokenized deposit insurance, stablecoins",
    "body": "Acting FDIC Chair Travis Hill said the agency is also working on a regime for stablecoin issuance and expects to issue a proposal for an application process by the end of year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54408540,
    "published": 1763107506000,
    "title": "Aave to offer zero-fee stablecoin ramps in Europe after MiCA approval",
    "body": "Aave said compliant, audited payment pathways are crucial for onboarding new users to decentralized finance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54408422,
    "published": 1763107506000,
    "title": "Aave to offer zero-fee stablecoin ramps in Europe after MiCA approval",
    "body": "Aave said compliant, audited payment pathways are crucial for onboarding new users to decentralized finance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54408608,
    "published": 1763107506000,
    "title": "Aave to offer zero-fee stablecoin ramps in Europe after MiCA approval",
    "body": "Aave said compliant, audited payment pathways are crucial for onboarding new users to decentralized finance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54409137,
    "published": 1763107506000,
    "title": "Aave to offer zero-fee stablecoin ramps in Europe after MiCA approval",
    "body": "Aave said compliant, audited payment pathways are crucial for onboarding new users to decentralized finance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54409261,
    "published": 1763107506000,
    "title": "Aave to offer zero-fee stablecoin ramps in Europe after MiCA approval",
    "body": "Aave said compliant, audited payment pathways are crucial for onboarding new users to decentralized finance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54408968,
    "published": 1763107506000,
    "title": "Aave to offer zero-fee stablecoin ramps in Europe after MiCA approval",
    "body": "Aave said compliant, audited payment pathways are crucial for onboarding new users to decentralized finance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54409748,
    "published": 1763107506000,
    "title": "Aave to offer zero-fee stablecoin ramps in Europe after MiCA approval",
    "body": "Aave said compliant, audited payment pathways are crucial for onboarding new users to decentralized finance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54409331,
    "published": 1763107506000,
    "title": "Aave to offer zero-fee stablecoin ramps in Europe after MiCA approval",
    "body": "Aave said compliant, audited payment pathways are crucial for onboarding new users to decentralized finance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54409381,
    "published": 1763107506000,
    "title": "Aave to offer zero-fee stablecoin ramps in Europe after MiCA approval",
    "body": "Aave said compliant, audited payment pathways are crucial for onboarding new users to decentralized finance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]