[
  {
    "id": 55542533,
    "published": 1765270849000,
    "title": "New Bitcoin Crash Incoming? Twenty One Capital Moves 43,500 BTC Amid Major Losses",
    "body": "Twenty One Capital, a major player in the Bitcoin (BTC) treasury sector founded by Jack Mallers, is on the verge of going public in the United States. However, ahead of its highly anticipated debut on December 9, the company has moved a substantial sum of 43,500 BTC—approximately worth $4.5 billion—into an escrow wallet. This move has sparked market concerns about a potential sell-off, which could create major selling pressure for the leading cryptocurrency as it attempts to consolidate above the key $90,000 support level. $1.5 Billion Loss In Bitcoin Investments Experts on the social media platform X (formerly Twitter), such as OxNobler, have pointed out that the company is currently grappling with a significant $1.5 billion loss on its Bitcoin investment. He warned that this financial pressure could potentially lead to a new crash for Bitcoin and adversely affect the broader cryptocurrency market as well. Related Reading: Here’s How High The Dogecoin Price Will Go Once The MACD Bullish Cross Happens The apprehension surrounding this situation is reflected in Bitcoin’s price action, as the leading cryptocurrency dipped below $90,000 earlier on Monday amid growing uncertainty about its future trajectory. However, Jack Mallers had previously addressed the reasoning behind this monumental Bitcoin transfer. According to him, this step is part of the preparations for Twenty One Capital’s upcoming listing on the New York Stock Exchange (NYSE). As part of the transaction, the company is transitioning 43,500 BTC from third-party custody to a self-custody account, ensuring transparency by updating its proof of reserves accordingly. The firm, backed by major players like Tether and SoftBank, aims to take on Michael Saylor’s Bitcoin proxy firm Strategy (previously MicroStrategy) in the competitive Bitcoin treasury sector. A significant milestone was reached on December 3, when shareholders of CEP approved a business merger with Twenty One Capital, paving the way for the company’s initial public offering (IPO). Once the transactions are finalized, the combined entity will operate as Twenty One Capital, Inc., with its shares expected to begin trading on the NYSE under the ticker symbol “XXI.” Twenty One Capital Gears Up For IPO Amid the preparations for its anticipated debut in the US, the firm has indicated that it will focus exclusively on Bitcoin-related ventures, offering shareholders new opportunities to gain exposure to BTC through equity markets. With a Bitcoin-native operating framework and a long-term strategy designed for value creation, Twenty One intends to establish itself as a leading platform for capital-efficient Bitcoin accumulation and related business initiatives. Related Reading: Analysts Split on XRP Future Outlook as Centralization Debate Intensifies This move to go public follows a tumultuous period for Mallers, who disclosed that JPMorgan Chase had abruptly closed his accounts in September without explanation. “Last month, J.P. Morgan Chase threw me out of the bank… Whenever I asked them why, I received the same response: ‘We aren’t allowed to tell you,’” Mallers recounted on November 23. The closure letter cited “concerning activity” and referenced the Bank Secrecy Act, preventing him from reopening accounts at the bank. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|BTCUSDT|crypto|crypto news|Twenty One Capital|Twenty One Capital IPO|Twenty One Capital news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55542431,
    "published": 1765270417000,
    "title": "Circle gets Abu Dhabi greenlight amid UAE stablecoin and crypto push",
    "body": "Circle has secured a license in Abu Dhabi, enabling it to operate as a licensed Money Services Provider as the UAE accelerates its rollout of crypto regulations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55542277,
    "published": 1765269845000,
    "title": "Malaysian Royal Launches Ringgit-Backed Stablecoin for Payments",
    "body": "The eldest son of Malaysia’s billionaire king is launching a ringgit-backed stablecoin in the latest example of crypto tokens designed for payments expanding across the Asia-Pacific region.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55544684,
    "published": 1765274449000,
    "title": "Bitcoin Speculation Muted: Glassnode Analyst Calls Perps A ‘Ghost Town’",
    "body": "Glassnode’s senior researcher has pointed out how Bitcoin perpetual futures market is looking like a “ghost town,” with Open Interest continuing to be at muted levels. Bitcoin Futures Open Interest Has Remained Low Since October Reset In a new post on X, Glassnode senior researcher CryptoVizArt.₿ has talked about the recent trend in the Bitcoin Open Interest for the perpetual futures market. The “Open Interest” refers to an indicator that measures the total amount of positions related to the asset that are currently open on all centralized derivatives platforms. Related Reading: This 11.7 Billion Dogecoin Wall Could Be Key Resistance For DOGE, Analyst Says When the value of the metric rises, it means the investors are opening new positions related to the asset. Generally, new positions come with fresh leverage for the sector, so the cryptocurrency’s price can become more volatile following an increase in the Open Interest. On the other hand, the indicator going down suggests the perpetual futures traders are either closing up position of their own volition or getting forcibly liquidated by their platform. Such a trend can lead to more stable price action for BTC due to the clearing of leverage. Now, here is the chart shared by CryptoVizArt.₿ that shows the trend in the Bitcoin perpetual futures Open Interest (BTC-denominated) over the last few months: As displayed in the above graph, the BTC-denominated Bitcoin perpetual futures Open Interest saw a sharp plunge back in October as a result of the crash in the cryptocurrency’s price. Following the leverage flush, the indicator traveled sideways around its lows, but in mid-November, speculation noted an uptick as the asset’s drawdown continued, with the metric’s value peaking alongside the level that has so far acted as the bottom. Since this high, however, the indicator has cooled off once again and approached the same lows as the ones that followed the massive liquidation event in October. Thus, with Open Interest back under 310,000 BTC, it seems speculative interest in the market has once again become muted. The recent decline in speculative participation has come alongside a drop in the perpetual futures Funding Rate, a metric tracking the amount of periodic fee being exchanged between the short and long investors. From the chart, it’s visible that the Bitcoin perpetual futures Funding Rate has been going down since a while now. “This persistent drift lower reflects a decline in leveraged long conviction, with traders unwilling to pay a premium to maintain upside exposure,” noted the Glassnode researcher. Related Reading: Bitcoin Market Structure Echoes 2022 Bear Start, Glassnode Warns Based on the recent developments, CryptoVizArt.₿ has called the perpetual futures market a “ghost town.” BTC Price At the time of writing, Bitcoin is floating around $90,500, up almost 6% over the last seven days. Featured image from Dall-E, Glassnode.com, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin Open interest|bitcoin speculation|btc|BTCUSDT|glassnode",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55545819,
    "published": 1765276000000,
    "title": "Will Zcash's ZEC return to $500 or higher before 2026?",
    "body": "Bullish reversal signals and rising whale demand raise ZEC’s chances of hitting $500 in December, though some caution remains warranted.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      }
    ]
  },
  {
    "id": 55546593,
    "published": 1765277177000,
    "title": "HashKey crypto exchange opens Hong Kong IPO subscription, targets $215M",
    "body": "HashKey opens IPO subscriptions as it seeks to raise $214.7 million, valuing Hong Kong’s largest crypto exchange at around $2.5 billion.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55546410,
    "published": 1765276972000,
    "title": "ASIC Expands Digital Asset Relief For Stablecoin Intermediaries",
    "body": "The Australian regulator indicated the framework could expand as additional stablecoin and wrapped token issuers secure AFS licences.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55547079,
    "published": 1765278000000,
    "title": "Plume Secures ADGM Commercial License, Eyes Middle East RWA Expansion",
    "body": "Plume Network has received a commercial license from the Abu Dhabi Global Market, allowing expansion into the Middle East.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Real World Assets|UAE|Middle East|Tokenization|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55547387,
    "published": 1765277805000,
    "title": "BMW Uses JPMorgan Blockchain System for Automated FX Transfers",
    "body": "BMW AG has started using a blockchain-based system to automate some of its foreign exchange transactions as firms increasingly look to crypto’s underlying technology to accelerate and simplify billions of dollars in crossborder payments.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "NYS:JPM|GER:BMW",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55548261,
    "published": 1765279846000,
    "title": "Crypto Markets Today: Bitcoin Slips Back Toward Danger Zone Ahead of Fed Decision",
    "body": "Bitcoin surrendered gains from earlier in the week, fell back toward $90,000 as traders braced for Wednesday’s Federal Reserve rate decision.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|Derivatives|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55548215,
    "published": 1765279727000,
    "title": "Polygon deploys Madhugiri hard fork, aims for 33% throughput boost",
    "body": "Polygon’s hard fork cuts consensus time to one second, supports Fusaka EIPs, and lays the groundwork for stablecoin and RWA-focused scaling.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 38,
        "NAME": "MATIC",
        "CATEGORY": "MATIC"
      },
      {
        "TYPE": "122",
        "ID": 206,
        "NAME": "FORKS",
        "CATEGORY": "FORKS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55548789,
    "published": 1765280613000,
    "title": "‘Elite’ traders hunt dopamine-seeking retail on prediction markets: 10x Research",
    "body": "Rising retail participation incentivizes data-driven, “elite” traders to use “information asymmetry” and spreads caused by casual investors seeking a quick buck, 10x said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      }
    ]
  },
  {
    "id": 55549509,
    "published": 1765281662000,
    "title": "VeChain Unveils New 'Hayabusa' Consensus and Tokenomics Upgrade",
    "body": "With more than 5.5 million app users in the last year, VeChain is focusing on tangible use cases for crypto that “you can hold in your hands.”",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|vechain|Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 101,
        "NAME": "VET",
        "CATEGORY": "VET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55549399,
    "published": 1765281600000,
    "title": "Tassat Wins U.S. Patent for 'Yield-in-Transit' Onchain Settlement Tech",
    "body": "The IP covers intraday, block-by-block interest accrual during 24/7 settlement and underpins Lynq, an institutional network Tassat co-launched in July.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Tassat|Blockchain Adoption|Settlements|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55550196,
    "published": 1765282792000,
    "title": "OCC Chief: Banks Blocking Crypto Custody Is 'Recipe for Irrelevance'",
    "body": "Comptroller of the Currency Jonathan Gould warned that restricting national trust banks from digital assets would stifle innovation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55550010,
    "published": 1765282500000,
    "title": "Bitcoin's ‘bear flag pattern’ targets $67K as BTC spot demand slumps",
    "body": "The absence of new buyers and weakening ETF demand are factors likely to keep the Bitcoin price pinned below $93,000 as a bear flag targets $67,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55551355,
    "published": 1765284616000,
    "title": "Forget Interest Rates—Traders Are Quietly Braced For A $6.5 Trillion Fed Surprise That Could Blow Up Stocks, Crypto And The Bitcoin Price",
    "body": "Traders are looking past the Fed’s December interest rate decision to whether its going to start growing its $6.5 trillion balance sheet and blow up stocks, crypto and the bitcoin price...",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55551348,
    "published": 1765284528000,
    "title": "Dogecoin ETFs lose their bite as Bitcoin, Ethereum big dogs lead the pack",
    "body": "The total value traded for spot DOGE ETFs reached its lowest point since launch, signaling a fading of the early hype as liquidity and flows lag well behind those of major crypto ETFs.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55551165,
    "published": 1765284322000,
    "title": "Standard Chartered Slashes 2025 Bitcoin Forecast to $100K",
    "body": "The bank has cut its 2025 Bitcoin price target by half, citing the end of corporate buying and sharply slowing ETF inflows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55550913,
    "published": 1765283966000,
    "title": "IREN Raises $2.3B, Repurchases Debt in Balance Sheet Overhaul",
    "body": "The bitcoin miner extended maturities, reduced coupon costs and strengthened its capital structure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Iren|Bitcoin News|Cloud Mining|Bonds|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55551730,
    "published": 1765285255000,
    "title": "Dogecoin Price Will Rally Before It Crashes, But What’s The Target?",
    "body": "The Dogecoin price is already struggling amid the bearish pressure that has dominated the crypto market recently. After the initial fall to $0.2, DOGE bulls had attempted to hold support, pushing for a rebound. However, with the bearish headwinds of the last quarter of the year, the Dogecoin price has since succumbed and is now trading below the $0.15 support level, and continues to struggle. Despite the already troubling price performance, crypto analyst Weslad says that the worst might be yet to come. This is due to a corrective structure that has appeared on the meme coin’s price chart, and the result of this has been a bearish flag. As these technical developments unfold, the crypto analyst has warned investors of what to expect, outlining why the Dogecoin price could see a major crash while attempting to recover. Dogecoin Price To Rise And Then Fall The analysis, which was shared on the TradingView website, points to the bearish flag as a precursor of what is to come. Weslad explains that the bearish flag had triggered the Dogecoin price breakdown that had led to the downward leg. As a result, the sentiment has skewed negative so far, suggesting that there could be more declines to come. Related Reading: Bitcoin RSI Shows Shocking Similarities To 2012-2015, But What Happened Last Time? However, the crypto analyst points out that the Dogecoin price is still well below its breakout zone. Given this, it is likely that there could be an initial relief rally for the meme coin. If this rally plays out, then there would be an initial decline below $0.12 to form support above $0.118. Once this support is established, then the resulting bounce is expected to push the Dogecoin price to $0.2. Once this move is completed, though, the analyst predicts an even deeper crash on the horizon. From the $0.2 mark, Weslad’s chart shows that the Dogecoin price could decline another 70%, falling toward $0.05 in the process, which would mean a return to 2-year lows. Related Reading: Confirming The Bitcoin Price Direction: Analyst Reveals What You Should Look Out For “The immediate plan is to monitor a pullback toward the minimum bearish flag targets around the $0.12 region, which aligns with the former structure support and breakout zone,” the crypto analyst said. This bottom area serves as a “supply on the retest” and could trigger the next decline. For now, the analyst expects that the Dogecoin price will continue on its bearish path. This is dependent on the broader market performance, and so far, a breakdown looks to be more likely. Featured image from Dall.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55552726,
    "published": 1765286789000,
    "title": "Crypto nears its ‘Netscape moment’ as industry approaches inflection point",
    "body": "Crypto is at a mainstream tipping point due to the emergence of regulated investment products, according to Matt Huang of Paradigm.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55552718,
    "published": 1765284300000,
    "title": "PNC Launches Bitcoin Trading With Coinbase for Wealthy Clients",
    "body": "PNC Financial Services Group Inc.’s high-net-worth customers can now trade Bitcoin directly through their investment accounts, fulfilling an initial goal of the Pittsburgh-based lender’s partnership with Coinbase Global Inc. announced in July.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "NMS:COIN|NYS:PNC",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55553395,
    "published": 1765287900000,
    "title": "IBM’s $11B Confluent Deal Rewrites The Future Of AI And Blockchain",
    "body": "IBM’s $11B Confluent acquisition reshapes AI and blockchain, uniting real-time data, trust, and intelligent systems for the next wave of enterprise innovation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 55553431,
    "published": 1765287805000,
    "title": "Malaysia’s crown prince launches ringgit stablecoin, Zetrix treasury",
    "body": "Malaysia’s crown prince launches a stablecoin on Zetrix and a $121 million digital asset treasury modeled after MicroStrategy despite sector bubble fears.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55553909,
    "published": 1765288807000,
    "title": "XRP Secures $1B AUM Milestone, Sets ETF Speed Record In The US",
    "body": "XRP Spot ETFs have nearly crossed the $1 billion mark in assets under management (AUM), marking one of the quickest ramps since Ethereum, according to Ripple’s CEO. Related Reading: All-In On XRP: Why This Leading Investor Sold His Entire Bitcoin Stack Rapid Fund Growth In Weeks According to the disclosure, the four XRP ETF products now hold about $1.23B in total net assets, which equals 597 million XRP at a reported XRP price of $2.06. Reports have disclosed a fresh inflow of $30 million on Monday, Dec. 8, and the cumulative net inflow into these products stands close to $935 million. Ripple CEO Brad Garlinghouse highlighted that the collective figure reached the $1 billion level in under four weeks after the first fund hit the market. Canary Capital Leads With Heavy Flows Canary Capital’s XRPC grabbed the most attention at launch, bringing roughly $245 million in net flows on its debut day on Nov. 13. Canary’s fund holds about 335.889 million XRP, valued at approximately $691 million, which represents 56% of the combined assets across the four funds. 👀<4 weeks, and XRP is now the fastest crypto Spot ETF to reach $1B in AUM (since ETH) in the US. With over 40 crypto ETFs launched this year in the US alone, a few points are obvious to me: 1/ there’s pent up demand for regulated crypto products, and with Vanguard opening up… — Brad Garlinghouse (@bgarlinghouse) December 8, 2025 The other managers hold smaller shares: Grayscale’s product holds 104.381 million XRP, about $215 million or 17.47% of the total; Bitwise carries 93.827 million XRP valued at $193.284 million or 15.7%; Franklin Templeton has 62.99 million XRP worth about $131.829 million, or 10.71%. A Wave Of Approved Crypto Funds Based on reports, this development follows a broader rollout of spot and futures crypto ETFs since US spot Bitcoin ETFs arrived in January 2024. Ethereum spot products launched in July 2024, and Solana listings came in October 2025. The US Securities and Exchange Commission has approved more than 40 crypto-related ETF products this year, which market participants say has opened familiar rails for mainstream investors. Vanguard’s choice to allow crypto access inside standard retirement and broker accounts is being cited as a change that lets many Americans gain exposure without deep crypto know-how. What This Means For Investors According to analysts and market observers, the speed of these flows underlines strong demand for regulated crypto vehicles. Big-name asset managers entering the market have helped create options that look and act like other mutual funds or ETFs, which can ease the path for retirement plans and advisers to take part. At the same time, a large share resting in a single debut fund shows concentration risk: Canary’s XRPC accounts for more than half of the total net assets, and that matters for liquidity and fund dynamics if flows shift. Related Reading: Banking Meets Bitcoin: French Banking Giant Offers Crypto To Millions Fresh Inflows & ETF Demand While $1.23 billion is a headline figure, market watchers will be watching fresh inflows, trading volumes, and how price moves react to ETF demand. For now, XRP listings have drawn sizable attention, and the coming weeks should make clearer whether the early momentum will spread more evenly across products and push broader investor participation. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|Brad Garlinghouse|crypto|etf|Ripple|xrp",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55554243,
    "published": 1765289391000,
    "title": "A16z-Backed Daylight Brings Electricity Markets Onchain with New DeFi Protocol",
    "body": "The DayFi protocol aims to turn electricity cash flows into a crypto-native yield product, bridging capital to new solar power installations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Real World Assets|Yield|DeFi|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55554177,
    "published": 1765289274000,
    "title": "PNC Bank Rolls Out Spot Bitcoin Access for Private Clients After 2025 Reveal",
    "body": "The Coinbase-backed feature, first announced in July, lets PNC clients buy, sell and hold bitcoin directly in their digital banking accounts.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Coinbase|PNC Bank|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55554899,
    "published": 1765290600000,
    "title": "Crypto Wallet Firm Exodus Bets on Stablecoins for Real-World Payments With 2026 App",
    "body": "The company launched Exodus Pay, which aims to remove crypto friction by letting users send, spend, and earn with stablecoins from one app.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Exodus|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55555521,
    "published": 1765291534000,
    "title": "Securitize hires former PayPal exec as US tokenization gains traction",
    "body": "Securitize hires a former PayPal executive as it expands regulated tokenized securities for US investors and builds on fresh approvals in Europe.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 55555623,
    "published": 1765291151000,
    "title": "Bitcoin Firm Twenty One Falls 25% After Cantor Equity Merger",
    "body": "Twenty One Capital Inc. fell 25% in its trading debut Tuesday, after it merged with special-purpose acquisition company Cantor Equity Partners Inc. to become the latest public crypto company.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55555622,
    "published": 1765290600000,
    "title": "Stripe and Paradigm Open Tempo Blockchain to Public, Add Kalshi, UBS as Partners",
    "body": "Stripe Inc. and crypto venture firm Paradigm have launched a public trial for their joint blockchain project, Tempo, opening the network to any company interested in building real-world stablecoin payments applications.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "VTX:UBSG",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55555986,
    "published": 1765292453000,
    "title": "Pundit Highlights The Condition That Will Trigger A 2,300% XRP Rally To $50",
    "body": "The XRP price is currently more than 45% below its all-time high and continues to decline amid broader market uncertainty. Despite the slow price action and weak momentum, a crypto analyst has projected that XRP could explode to $50 soon, providing reasons for his ambitious forecast. He boldly stated that the cryptocurrency will not experience a gradual climb to $5 or $10 first, but will instead jump straight to $50. XRP To Hit $50 With A Ripple Bank Charter Crypto analyst Pumpius has outlined a compelling scenario that could dramatically transform XRP’s market outlook. The market expert claims that a single regulatory event could catapult XRP’s price to $50, representing more than a 2,300% increase from current levels around $2. In his thread post on X, he explained the reasons for his bold prediction and the trigger behind this parabolic surge . Related Reading: Here’s How High The Dogecoin Price Will Go Once The MACD Bullish Cross Happens Pumpius believes that XRP could skyrocket to $50 once Ripple secures a national trust bank charter from the United States Office of the Comptroller of the Currency (OCC). According to him, approval of this banking license would give Ripple the same powers as major US banks, as well as direct access to the Federal Reserve (FED). The analyst noted that through the charter, Ripple could gain the authority to custody crypto and tokenized assets, issue stablecoins, and settle securities under complete regulatory oversight. He described the potential approval of the banking license as a foundational move that could establish Ripple as a leading force in US tokenized finance. Pumpius highlighted that XRP remains at the centre of the changes, positioned as the native bridge asset in this potential structure. He suggested that with a charter in place, banks, brokers, and funds could bypass intermediaries and interact directly with Ripple to move value into tokenized markets. According to the analyst’s predictions, the result of this shift could be a massive, sustained surge in liquidity and institutional demand for XRP, creating the ideal conditions for an unprecedented price rally. He explains that with $6.6 trillion moving through banks each day in global settlements, even a small fraction routed through XRP’s limited supply could drive its price higher toward $50. While the market expert’s forecast is ambitious, it hinges entirely on the OCC’s decision, which is not guaranteed and could be influenced by compliance standards, risk assessments, and broader financial policy considerations. Even with approval, actual integration by major institutions would likely take considerable time and depend on competition with existing settlement networks. Ripple Legal Victory Paves Way For $50 XRP Price In his post, Pumpius suggested that Ripple’s prolonged legal battle with the US Securities and Exchange Commission (SEC) was part of a broader strategy to secure regulatory clarity. He viewed the former lawsuit as a smokescreen intended to delay, filter, and prepare the path for a national trust bank charter under the OCC. With the case now resolved, the analyst indicates that the timing is perfect for Ripple to pursue full regulatory approval and integrate XRP into mainstream banking channels. Related Reading: Ethereum Founder Breaks Silence With Major Upgrade Proposal Pumpius boldly declared that the day the OCC approves Ripple’s banking license will mark a turning point for XRP, transforming it from a cryptocurrency to “the rails of US finance.” At that point, the analyst argues that a $50 price target would be significantly undervalued. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Ripple|ripple news|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55555979,
    "published": 1765292400000,
    "title": "Blockchain Network Canton, With $6T of Real-World Assets, Taps RedStone for DeFi Access",
    "body": "The integration aims to connect RedStone’s data feeds to Canton’s institutional blockchain infrastructure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      }
    ]
  },
  {
    "id": 55556060,
    "published": 1765292400000,
    "title": "Most Influential: Don Jr., Eric and Barron Trump",
    "body": "The sons of U.S. President Donald Trump have capitalized on their family name and crypto’s political momentum, carving out a profitable niche for themselves in the booming industry.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Eric Trump|Donald Trump|Barron trump|Most Influential 2025|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55556995,
    "published": 1765294212000,
    "title": "Bitcoin Treasury Company Twenty One Drops 25% in NYSE Debut, Trades Near PIPE Pricing of $10",
    "body": "The company is led by Strike CEO Jack Mallers and began trading under the XXI ticker today following its SPAC merger with Cantor Equity Partners.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Jack Mallers|Bitcoin News|Tether|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55556625,
    "published": 1765293103000,
    "title": "Crypto’s Liquidity Engine Breaks Down With $5 Billion ETF Exodus",
    "body": "Bitcoin is struggling to turn recent good news into a substantive rebound, highlighting the ongoing weakness and thin liquidity in digital asset markets that have played a role in keeping prices subdued.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55557540,
    "published": 1765295344000,
    "title": "Stripe-Backed Blockchain Tempo Starts Testnet; Kalshi, Mastercard, UBS Added as Partners",
    "body": "Tempo, built by Stripe and Paradigm, has started testing payment-focused blockchain and has onboard a slew of institutional partners.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Stripe|Paradigm|Stablecoin|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      }
    ]
  },
  {
    "id": 55557157,
    "published": 1765294640000,
    "title": "UK Political Parties Call for Investigation into Reform UK Crypto Donations",
    "body": "The Liberal Democrats have raised concerns over conflicts of interest, after Nigel Farage namechecked Tether in a September interview.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55557898,
    "published": 1765296019000,
    "title": "Shiba Inu’s Volume Explosion: Leading Meme Coin Barrels Ahead In This Metric",
    "body": "Shiba Inu has recorded a notable surge in spot trading activity on several exchanges over the last seven days. This provides a bullish outlook for the second-largest meme coin by market cap, which has been one of the underperformers in this market cycle. Shiba Inu Sees Surge In Spot Trading Activity CoinGlass data show a 154% surge in Shiba Inu USD spot trading volume on Kraken over the last seven days. There has also been a significant surge on other major exchanges, such as Binance, Bybit, OKX, and Gemini, during the same period. This indicates that spot buyers may be stepping in to defend the SHIB price at a critical support amid the broader crypto market decline. Related Reading: Will A Shiba Inu ETF Follow After Dogecoin? The Lone SHIB Filing Standing Against The Crowd Notably, Shiba Inu is one of the altcoins that are in the green over the last week, suggesting that the bulls may be in control at the moment. CoinMarketCap data shows that the second-largest meme coin by market cap is up almost 7% during this period despite Bitcoin’s choppy price action. Meanwhile, further data from CoinGlass also shows that most leverage traders are currently betting on an increase in the Shiba Inu price, with the long/short ratio currently above 1. However, it is worth noting that derivatives volume is down by over 10% and open interest is down by almost 4%, which presents a bearish outlook for the meme coin. Another positive for Shiba Inu, besides the surge in spot trading volume, is that the Fed is likely to cut interest rates again at this week’s FOMC meeting. This could inject more liquidity into the crypto market, with altcoins like SHIB benefiting from it. Meanwhile, Bitcoin is currently looking to hold above the psychological $90,000 level, which could pave the way for higher prices for SHIB given their positive correlation. Community Gives Update On SHIB’s Progress In an X post, Shiba Inu community member Shibizens gave an update on SHIB’s progress over the last few days. The community member noted that over 45 billion SHIB have been moved off exchanges, indicating that holders are accumulating. Shibizens also alluded to a $35 million whale transfer into a private wallet, suggesting that SHIB whales are also bullish. Related Reading: Will The Shiba Inu Price Hit A New All-Time High In 2025? Machine Learning Algorithm Answers Furthermore, Coinbase is set to launch Shiba Inu futures on December 12 for institutional and retail investors, which could boost the meme coin’s adoption. Meanwhile, NYSE Arca has filed the 19b-4 for T. Rowe’s Shiba Inu ETF, bringing the ETF one step closer to launch. Shibuzens also highlighted upgrades on the Shibarium network, which could provide a major boost for SHIB. This includes the RPC upgrade, while a full privacy upgrade has been confirmed using encrypted tech. There are plans to roll this out by next year. At the time of writing, the Shiba Inu price is trading at around $0.000008498, up in the last 24 hours, according to data from CoinMarketCap. Featured image from Peakpx, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Shiba Inu|Binance|bybit|coinbase|Coinglass|CoinMarketCap|FOMC|Gemini|NYSE ARCA|OKX|RPC|SHIB|SHIB news|SHIB price|Shiba Inu ETF|Shiba Inu news|Shiba Inu Price|Shibarium|SHIBUSD|SHIBUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 44,
        "NAME": "SHIB",
        "CATEGORY": "SHIB"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55557777,
    "published": 1765295740000,
    "title": "PNC Bank Enables Bitcoin Trading for Customers via Coinbase",
    "body": "PNC Bank debuted a service allowing some customers to trade Bitcoin on its banking platform, broadening access through Coinbase.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55558947,
    "published": 1765297738000,
    "title": "Marjorie Taylor Greene Claims 'CBDC Loophole Remains' in GENIUS Act",
    "body": "A regulatory attorney told Decrypt that Greene’s claims about a CBDC loophole do not ‘have a real legal basis.’",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 55559519,
    "published": 1765298876000,
    "title": "Bitcoin Surges to $94K One Day Ahead of Expected Fed Rate Cut",
    "body": "The change from what's become typical bearish U.S. session action could signal seller exhaustion.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Market Wrap|Breaking News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55559430,
    "published": 1765298400000,
    "title": "Circle moves toward privacy-focused stablecoin with USDCx project",
    "body": "A new Circle–Aleo stablecoin project highlights the growing demand for privacy features as firms weigh blockchain use against the risks of transparency.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      }
    ]
  },
  {
    "id": 55560001,
    "published": 1765299684000,
    "title": "Michael Saylor Urges Middle East to Become the 'Switzerland of Bitcoin Banking'",
    "body": "The executive chairman of Strategy pitched BTC-backed banking and yield products as a $200 trillion opportunity at the Bitcoin MENA conference.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Michael Saylor|Charles Schwab|Citi|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55559936,
    "published": 1765299633000,
    "title": "Wall Street Giant Bernstein Predicts Bitcoin Price To Hit $1 Million By 2033",
    "body": "Wall Street research firm Bernstein has reiterated one of the boldest long-term calls in traditional finance, confirming a $1 million Bitcoin price target for 2033 while materially revising how and when it expects the market to get there. Bernstein Keeps $1 Million Price Target For Bitcoin The latest shift surfaced after Matthew Sigel, head of digital assets research at VanEck, shared an excerpt from a new Bernstein note on X. In it, the analysts write: “In view of recent market correction, we believe, the Bitcoin cycle has broken the 4-year pattern (cycle peaking every 4 years) and is now in an elongated bull-cycle with more sticky institutional buying offsetting any retail panic selling.” The analyst from Bernstein added: “Despite a ~30% Bitcoin correction, we have seen less than 5% outflows via ETFs. We are moving our 2026E Bitcoin price target to $150,000, with the cycle potentially peaking in 2027E at $200,000. Our long term 2033E Bitcoin price target remains ~$1,000,000.” Related Reading: Did 2025 Mark A Bear Market For Bitcoin? Predictions Point To A $150,000 Rally In 2026 This marks a clear evolution from Bernstein’s earlier cycle roadmap. In mid-2024, when the firm first laid out the $1 million-by-2033 thesis as part of its initiation on MicroStrategy, it projected a “cycle-high” of around $200,000 by 2025, up from an already-optimistic $150,000 target, explicitly driven by strong US spot ETF inflows and constrained supply. Subsequent commentary reiterated that path and framed Bitcoin firmly within the traditional four-year halving rhythm: ETF demand would supercharge, but not fundamentally alter, the classic post-halving boom-and-bust pattern. Reality forced an adjustment. Bitcoin did break to new highs on the back of ETF demand, validating Bernstein’s structural call that regulated spot products would be a decisive catalyst. However, price action has fallen short of the earlier timing: the market topped out in the mid-$120,000s rather than the $200,000 band originally envisaged for 2025, and a roughly 30% drawdown followed. Related Reading: Bitcoin To Hit $50 Million By 2041, Says EMJ Capital CEO What changed is not the end-state, but the path. Bernstein now argues that the four-year template has been superseded by a longer, ETF-anchored bull cycle. The critical datapoint underpinning this view is behavior in the recent correction: despite a near one-third price decline, spot Bitcoin ETFs have seen only about 5% net outflows, which the firm interprets as evidence of “sticky” institutional capital rather than the reflexive retail capitulation that defined previous tops. In the new framework, earlier targets are effectively rescheduled rather than abandoned. The mid-2020s six-figure region is shifted out by roughly one to two years, with $150,000 now penciled in for 2026 and a potential cycle peak near $200,000 in 2027, while the 2033 $1 million objective is left unchanged. In that sense, Bernstein’s track record is mixed but internally consistent. The firm has been directionally right on the drivers—ETF adoption, institutionalization, and supply absorption—but too aggressive on the speed at which those forces would translate into price. The latest note formalizes that recognition: same destination, slower ascent, and a Bitcoin market that Bernstein now sees as governed less by halvings and more by the behavior of large, ETF-mediated capital pools over the rest of the decade. At press time, BTC traded at $90,319. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|Bernstein|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55559930,
    "published": 1765299600000,
    "title": "Cascade Unveils 24/7 Neo-Brokerage Offering Perpetuals on Cryptos, U.S. Stocks",
    "body": "The platform will let retail traders use one margin account to trade round-the-clock perpetual markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Crypto Trading|perpetual contracts|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55560163,
    "published": 1765299877000,
    "title": "Crypto Shorts Get Rekt as Bitcoin, Ethereum and XRP Spike Ahead of Fed Decision",
    "body": "Bitcoin is surging towards $95,000 on Tuesday ahead of the Fed's interest rate decision, hitting its highest price since mid-November.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55561044,
    "published": 1765301425000,
    "title": "Why the world should worry about stablecoins",
    "body": "Dollar-based digital currencies offer benefits for the US, but Britain and the EU are better off resisting them",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55560621,
    "published": 1765300814000,
    "title": "SEC Approves U.S.’ Second Crypto Index ETP with Bitwise’s BITW",
    "body": "The Bitwise 10 Crypto Index Fund now trades on NYSE Arca, joining the ranks of gold and oil funds in regulated exchange products.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Bitwise Asset Management|Bitwise|NYSE Arca|cryptocurrency ETP|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 16,
        "NAME": "COMMODITY",
        "CATEGORY": "COMMODITY"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 55561934,
    "published": 1765303239000,
    "title": "Why The Litecoin Price Could Stage A 33% Rally To $110",
    "body": "A crypto analyst has forecasted that the Litecoin price is gearing up for an explosive rally to $110. Unlike Bitcoin and Ethereum, which have seen considerable declines over the past few months, Litecoin appears to be stabilizing, gaining about 7.8% this past week, according to CoinMarketCap. Although LTC has seen its fair share of declines this year, analysts still hold hope that the cryptocurrency could cross the $100 threshold and reclaim former highs. Litecoin Price Targets A $110 Breakout Litecoin may be preparing for a strong upward move, according to a new analysis from TradingView market expert MadWhale. The analyst has indicated that the cryptocurrency has the technical structure needed to break out of its long-term descending channel and potentially climb toward $110. With its current price sitting around $83, a surge to this level would represent a significant 33% rally. Related Reading: Litecoin 2M Bollinger Band Width Hits New Lows, CMT-Certified Analyst Reveals What It Means MadWhale has based his bullish LTC forecast on weekly candlesticks and how the cryptocurrency has consistently responded to past support and resistance levels. He explained that the altcoin had been trapped in a descending channel that has controlled its price for several weeks now. According to the TradingView analyst, Litecoin is now approaching the upper resistance region of the descending channel–a point where traders usually watch for either a clean breakout or a sharp rejection. From the analyst’s price chart, Litecoin’s support zones have repeatedly held firm, showing that buyers consistently defended the area. Due to this steady support, he expects Litecoin’s bounce near the descending channel’s upper resistance to build momentum. If the support holds, MadWhale suggests the cryptocurrency could skyrocket to $110, completing its breakout from the descending channel. A breakout could signal a significant shift, potentially transforming Litecoin’s recent downtrend into a new bullish phase. MadWhale’s chart also highlights the cryptocurrency’s volatility, showing that in early October, LTC had rallied around 33.84%, climbing above $120. However, just days later, it crashed more than 17%, coinciding with the October 10 liquidation event that shook the market. Update On LTC’s Price Action Litecoin is approximately 79% below its all-time high of over $410, recorded during the 2021 bull run. The cryptocurrency has dropped 17.68% over the past week and is down 33% for the year, mirroring the broader decline seen across altcoins. Despite its performance, LTC’s Fear and Greed Index remains in the neutral zone, suggesting that crypto investors are cautiously optimistic. Related Reading: Analyst Reveals How Litecoin Can Turn $3,700 Into $1 Million For Investors According to market analyst CW on X, the next sell wall for Litecoin is at $98, about 15% above its current price. Once the cryptocurrency reaches this level, CW expects a significant number of sellers to offload their coins. His chart also highlights the next key resistance levels for LTC, suggesting a potential surge to $98 first and then to the $106-$110 range. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Litecoin|altcoin|CoinMarketCap|CW|Descending Channel Pattern|Litecoin news|litecoin price|ltc|LTC news|ltc price|ltc/usd|LTCUSDT|MadWhale|tradingview",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 33,
        "NAME": "LTC",
        "CATEGORY": "LTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55561894,
    "published": 1765303016000,
    "title": "What a $440,000 Hack Shows About the Rising Threat of Ethereum 'Permit Scams'",
    "body": "A single mistake cost one user nearly half a million dollars, highlighting how scammers are escalating phishing attacks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|DeFi",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 55562852,
    "published": 1765304714000,
    "title": "Privacy-Centric Version of Circle's USDC Stablecoin Rolling Out via Aleo Network",
    "body": "A new privacy-focused stablecoin powered by Circle's xReserve platform is launching on the testnet of layer-1 blockchain, Aleo.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55562686,
    "published": 1765304132000,
    "title": "PNC Bank launches Bitcoin trading for eligible clients via Coinbase integration",
    "body": "The move makes PNC the first major US bank to offer spot Bitcoin trading within its own digital platform, starting with private bank clients.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55563581,
    "published": 1765306232000,
    "title": "Aptos Rises 8% After Breaking Through $1.80 Resistance",
    "body": "Strong volume and technical momentum distinguished APT's gains from the broader market action.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Aptos|Technical Analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 70,
        "NAME": "APT",
        "CATEGORY": "APT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55563614,
    "published": 1765306200000,
    "title": "UK crypto lobbying group joins Digital Chamber in cross-border policy push",
    "body": "The partnership between the two advocacy groups was the latest move in efforts by US and UK policymakers to work closer together on crypto regulation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55563523,
    "published": 1765306053000,
    "title": "Ether Surges 8%, Outpacing Bitcoin Gains Amid Staking ETF, Tokenization Optimism",
    "body": "BlackRock's filing for a staking ether ETF earlier this week has contributed to ETH's relative strength to bitcoin, one market strategist noted.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Ethereum News|Ether ETFs|Staking|Tokenization|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55564220,
    "published": 1765307380000,
    "title": "Senator Booker: Low Odds for Crypto Bill Without Democrats Appointed at CFTC, SEC",
    "body": "The Senate Democrat, who is leading negotiations on a crypto market structure bill, said promises from the White House on the escalating issue would not be enough.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55564772,
    "published": 1765308467000,
    "title": "Dogecoin Surges as Ether Zooms 8%, Sparking Bullish Reversal For Memecoins",
    "body": "The breakout now sets up a clean continuation zone—provided bulls defend the mid-range pivot they just reclaimed.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Dogecoin|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55565767,
    "published": 1765310427000,
    "title": "Bitcoin Sees Largest Annual Exchange Drop: Over 400,000 Coins Gone",
    "body": "Bitcoin’s on-exchange supply has dropped sharply, and traders are taking note. According to Santiment, more than 403,000 BTC have left exchanges since December 7, 2024 — roughly 2% of Bitcoin’s total supply. Related Reading: Banking Meets Bitcoin: French Banking Giant Offers Crypto To Millions That shift, measured against an on-exchange balance of about 2.11 million BTC in late November, is being seen as a sign that fewer coins are poised for quick sale. Exchange Balances Shrink Santiment said lower exchange balances have historically been linked with fewer sudden sell-offs, an observation many market watchers find encouraging. The math is straightforward: when a big chunk of supply sits outside exchanges, there is less immediately available stock to meet selling pressure. 📊 As Bitcoin’s market value hovers around $90K, crypto’s top market cap continues to see its supply moving away from exchanges. Over the past year, there has been: 📉 A net total of -403.2K $BTC moving off exchanges 📉 A net reduction of -2.09% of $BTC‘s entire supply moving… pic.twitter.com/Y0JTC880Np — Santiment (@santimentfeed) December 8, 2025 Institutions Step In Based on reports from BitcoinTresuries.Net and others, exchange outflows are not only going to private cold wallets. ETFs and public firms are also accumulating. BitBo lists ETFs holding over 1.5 million BTC and public companies holding over 1 million. Combined, those holdings represent nearly 11% of the total Bitcoin supply. According to analysts, institutional vehicles have quietly absorbed a lot of coins, changing where Bitcoin sits and who can sell it. Supply Moves Matter This is more than bookkeeping. Coins locked in institutional or self-custodied vaults are not sold on a whim. That makes available supply tighter. At the same time, coins leaving exchanges can lead to sharper price moves when demand surges because the pool of sellable coins is smaller. Some of the effects are already visible on price charts; others may show up later if buying pressure picks up. Price Action And Macro Focus Bitcoin traded near $90,650 with a small rise of 0.28% in recent action. Year-to-date gains stand at 11%. The market swung from a daily low of $89,540 to a high of $92,290, showing active trading around current levels. Traders are watching a Federal Reserve meeting closely, and the outcome is expected to drive short-term volatility. Interest-rate cues often move broader markets, and crypto is no exception. Related Reading: All-In On XRP: Why This Leading Investor Sold His Entire Bitcoin Stack Market Outlook And Risks Overall, the move off exchanges looks like a bullish backdrop because it reduces immediate selling liquidity. Still, that same scarcity can make prices more sensitive to changes in demand, which raises the possibility of sharper swings. Analysts will be watching whether ETFs and public firms continue to add to their holdings or start to slow down purchases. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|etf",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55565070,
    "published": 1765309001000,
    "title": "XRP Underperforms Market as Sudden Bitcoin Surge Forces $387M of Liquidations",
    "body": "XRP's technical outlook remains uncertain, with support at $2.05 and resistance at $2.17, as traders watch for volume expansion",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55566601,
    "published": 1765312129000,
    "title": "JPMorgan Analysts Doubt Crypto Winter Is Coming, Despite 'Meaningful' Bitcoin Sell-Off",
    "body": "The investment bank continues to have a positive outlook on the crypto market, even with Bitcoin and other assets down.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55566911,
    "published": 1765312657000,
    "title": "US bank regulator clears national banks to facilitate crypto transactions",
    "body": "The guidance confirms that facilitating customer crypto trades falls within the “business of banking,” expanding the range of activities that national banks may offer under existing law.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55567525,
    "published": 1765314021000,
    "title": "Circle Gains Major Regulatory Foothold in UAE With ADGM License to Scale Stablecoin Adoption",
    "body": "Circle’s slow but steady expansion into the Middle East has taken a decisive step forward, as the USDC issuer secured a Financial Services Permission (FSP) license from Abu Dhabi Global Market (ADGM). Related Reading: Shiba Inu Whales Spike To 6-Month High: What’s Brewing? The move positions the company at the center of the UAE’s growing digital-asset ecosystem, strengthening its ability to scale stablecoin adoption across the region. For a market actively developing clearer regulatory frameworks and attracting global crypto players, Circle’s entry underscores the central role stablecoins have come to play in payment infrastructure and cross-border finance. ETH's price trends to the downside on the daily chart. Source: ETHUSD on Tradingview Circle Secures ADGM Approval and Expands Regional Strategy The license, granted by ADGM’s Financial Services Regulatory Authority, permits Circle to operate as a regulated Money Services Provider within the financial free zone. This follows preliminary approval earlier this year and gives the firm formal permission to offer USDC-powered payment, settlement and on-chain financial tools to businesses and institutions across the UAE. Alongside the approval, Circle appointed Dr. Saeeda Jaffar as managing director for the Middle East and Africa. A long-time payments executive with leadership experience at Visa and major consulting firms, she will guide Circle’s expansion efforts, deepen local partnerships, and help integrate USDC into regional prospects. Her appointment reflects Circle’s intent to localize operations and strengthen ties with banks, enterprises, and government entities. UAE Supports Push Toward Regulated Digital Finance Circle’s regulatory milestone comes as the UAE increases its efforts to build an institutional-grade digital asset ecosystem. ADGM and Dubai’s DIFC have both issued stablecoin and token frameworks designed to offer clarity for companies operating in the sector. USDC and EURC were recognized earlier this year under Dubai’s crypto token regime, providing Circle with visibility across both major financial zones in the country. The approval also coincides with a wave of regulatory progress for other major players. Binance received full authorization to operate its global platform under ADGM oversight this week, while Tether secured recognition for USDT across multiple blockchain networks. These developments show how Abu Dhabi is positioning itself as a global hub for regulated stablecoin activity, driven by remittance demand, trade flows, and a growing emphasis on compliance. Stablecoin Adoption Enters New Phase The UAE’s structured approach comes at a time when stablecoins are gaining broader acceptance in global finance. With regulatory guardrails expanding internationally and stablecoins increasingly used for cross-border payments, Circle’s license opens the door for wider USDC adoption in corporate finance, developer applications, and digital-asset settlement. Related Reading: Bitcoin Speculation Muted: Glassnode Analyst Calls Perps A ‘Ghost Town’ For Circle, the ADGM license marks a pivotal foothold in one of the world’s fastest-moving regulatory environments. For the UAE, it reinforces an ambition to lead in compliant digital-asset innovation while shaping standards for a rapidly evolving sector. Cover image from ChatGPT, ETHUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|circle|crypto|ETH|ethereum|ethusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 44,
        "NAME": "SHIB",
        "CATEGORY": "SHIB"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55567467,
    "published": 1765313864000,
    "title": "Proposed ‘AfterDark’ Bitcoin ETF Would Skip U.S. Trading Hours",
    "body": "The fund would hold bitcoin only overnight, betting on data showing bitcon gains mostly occur outside regular market hours.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin ETF|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55567461,
    "published": 1765313716000,
    "title": "New ETF proposal bets Bitcoin returns are made after hours",
    "body": "ETF analyst Eric Balchuas said there was a chance that such an investment vehicle “could put up better [returns]” based on BTC price moves after trading hours.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55568477,
    "published": 1765315813000,
    "title": "Real Finance secures $29M to build institutional rails for tokenized assets",
    "body": "Real Finance’s raise comes as tokenization accelerates and institutions push deeper into RWAs, including fast-growing money market funds.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55569216,
    "published": 1765317725000,
    "title": "Stripe's Tempo Payments Blockchain Opens to Public With Mastercard, UBS Onboard",
    "body": "Tempo, the payments-focused blockchain from Stripe and Paradigm, is now open to the public following its global testnet launch.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      }
    ]
  },
  {
    "id": 55569143,
    "published": 1765317640000,
    "title": "Bitcoin Addresses Holding Over 0.1 BTC Haven’t Grown in Two Years, What Does This Mean?",
    "body": "Since Bitcoin’s launch, the number of addresses holding more than 0.1 BTC has climbed steadily through every market cycle, until now. Data shows that addresses in this cohort haven’t grown at all over the past two years, breaking a trend that held for more than a decade. The stagnation indicates a change in how smaller and mid-sized investors engage with Bitcoin, even as broader institutional activity in the market continues to rise. Small Holder Participation Reaches A Standstill The 0.1 BTC threshold has historically represented an important milestone for retail holders, large enough to signal commitment but small enough to remain widely attainable. For more than a decade, wallets crossing that line grew year after year, even during drawdowns when long-term buyers were accumulating quietly. Related Reading: The $13.5 Billion Liquidity Injection That Could Send Bitcoin And Crypto Prices Flying That pattern is no longer intact. The number of addresses with more than 0.1 BTC has flattened since 2023 and is showing no signs of returning to its previous trajectory. Particularly, data from the on-chain analytics platform Santiment shows that the number of these addresses has stalled at around 4.44 million for the past year. This suggests that fewer new participants are choosing to build self-custodied Bitcoin positions at this level. The stagnation becomes more notable considering Bitcoin’s rising mainstream visibility and repeated pushes toward new all-time highs this year. In earlier cycles, such conditions have led to a surge in retail accumulation. This time, the address count has stayed frozen, and this means retail addresses holding Bitcoin might actually be plateauing. How Bitcoin’s Holder Base Is Changing Although on-chain data points to a slowdown in the growth of overall Bitcoin addresses holding more than 0.1 BTC, it doesn’t necessarily signal a decline in overall adoption. For many market participants, Bitcoin exposure now happens entirely off-chain. Related Reading: Confirming The Bitcoin Price Direction: Analyst Reveals What You Should Look Out For Larger investor cohorts, from high-net-worth individuals to funds and corporate entities, are buying huge amounts of Bitcoin. For instance, Santiment data shows that large Bitcoin holders controlling more than 100 BTC have increased their balances throughout 2024 and 2025, even as smaller address cohorts have stalled. At the same time, more investors are choosing to access Bitcoin through custodial avenues instead of managing their own wallets. Spot Bitcoin ETFs have become one of the most important gateways for new BTC exposure. In the US alone, Spot Bitcoin ETFs now control almost $120 billion worth of Bitcoin, with BlackRock’s IBIT consistently recording the strongest demand. Together, these developments point to a new phase in Bitcoin’s development. What was once dominated by individual self-custodied users is now increasingly shaped by institutions, ETFs, funds, and professionally managed capital. Therefore, the numbers from on-chain wallet metrics reflect a smaller portion of the actual user base. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|BlackRock’s IBIT|btc|BTC news|btc price|btcusd|BTCUSDT|Santiment|spot Bitcoin ETFs",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55569323,
    "published": 1765317776000,
    "title": "Blockchain trial on Canton Network tests collateral reuse with tokenized US Treasurys",
    "body": "The latest trial explored multiple stablecoins and showed tokenized US Treasurys can be reused instantly across counterparties on shared infrastructure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      }
    ]
  },
  {
    "id": 55570623,
    "published": 1765321244000,
    "title": "Ethereum Sees Largest Binance Inflow Since 2023 – Warning Sign?",
    "body": "Ethereum has spent the past several days consolidating in a tight range between $3,000 and $3,200, signaling a moment of hesitation as the broader market struggles to find direction. Despite attempts to push higher, momentum has flattened, and uncertainty continues to dominate sentiment. Many analysts now warn that Ethereum may be entering a deeper bearish phase, pointing to weakening spot demand, fragile market structure, and fading optimism across major exchanges. Related Reading: Smart Whales Align: Top Performers Go All-In On Ethereum Long Positions With Over $425M in Exposure However, one on-chain development has captured the market’s attention. According to new data from CryptoQuant, December 5, 2025 saw a massive spike in Ethereum Exchange Netflow to Binance, marking one of the largest daily inflows in years. Such a surge typically raises questions about investor intentions: large inflows often signal that holders are moving ETH onto exchanges with the potential to sell, increasing the probability of short-term volatility or downside pressure. Yet the broader context matters. Ethereum’s price remains above key support, suggesting that the market is in a critical decision zone rather than a confirmed breakdown. This combination of consolidation, rising caution, and an unusually large exchange inflow sets the stage for what could become a pivotal moment for ETH as traders prepare for the next major move. Massive Netflow Surge Raises Caution for Ethereum According to data from CryptoOnchain shared on CryptoQuant, Ethereum experienced a striking shift in exchange activity on December 5, 2025. The netflow to Binance reached 162,084 ETH while the price hovered near $3,021, marking the largest daily positive netflow since May 2023. Such an influx is significant, not only because of its size but because of what it typically signals: a rise in the number of investors moving ETH from self-custody to exchanges. Historically, large positive netflows are interpreted as potentially bearish, suggesting that holders may be preparing to sell or rebalance. When deposits drastically outweigh withdrawals, it can precede heightened selling pressure, especially when the market is already in a fragile state. Inflows of this magnitude can act as a temporary supply shock; if even a portion of this ETH hits the order books as market sells, the price could face increased volatility or short-term corrective pressure. Because of this, traders should closely monitor how Binance absorbs this liquidity. Watching order book depth, open interest reactions, and subsequent netflow patterns will reveal whether this was a one-off spike or the beginning of a broader shift in investor behavior. In a market this delicate, even a single inflow event can set the tone for the days ahead. Related Reading: Ethereum Loses Momentum While OI Holds Steady: Binance Data Shows A Market Reset ETH Price Attempts Stabilization Ethereum’s daily chart shows a market in the process of stabilizing, but still weighed down by significant structural resistance. After dipping below $2,800 in late November, ETH has managed to reclaim the $3,100 region, where it has been consolidating for several days. This range-bound behavior signals a pause in the prior downtrend, yet the recovery lacks the strong momentum typically seen in bullish reversals. The 50-day and 100-day moving averages remain positioned above the current price, forming a clear zone of resistance between $3,250 and $3,500. These declining MAs highlight that the broader trend still favors sellers, and ETH will need a decisive breakout above them to shift market sentiment. The 200-day MA, sitting higher, reinforces the idea that Ethereum is still trading below its long-term trend structure. Related Reading: Bitcoin Must Break $97K To Restore Confidence Among Youngest Long-Term Holders – Details Volume has also weakened during this rebound, suggesting that buyers are hesitant to commit aggressively at current levels. The recent spike in exchange netflows adds another layer of caution, raising the possibility of increased near-term selling pressure. ETH is showing early signs of stabilization, but the path forward requires stronger conviction. Until price breaks above the cluster of moving averages, this recovery remains fragile and vulnerable to renewed downside pressure. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ethereum|Ethereum Analysis|Ethereum Binance|Ethereum exchange inflows|Ethereum Inflows|ethereum news|ethereum price|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55572160,
    "published": 1765324824000,
    "title": "Dogecoin Stabilizes Above Key Support as Adoption Rises and Long-Term Outlook Strengthens",
    "body": "Dogecoin (DOGE) is, in another consecutive week, settling into a familiar pattern: holding firm at a crucial support zone while market participants weigh technical signals, shifting adoption trends, and the ever-present influence of its community. Related Reading: New Bitcoin Crash Incoming? Twenty One Capital Moves 43,500 BTC Amid Major Losses As the token trades around $0.14, its price behavior reflects a broader phase of consolidation, characterized by tighter volatility and increasing on-chain engagement. With new real-world use cases emerging and traders watching for a breakout, DOGE’s long-term trajectory is becoming a point of renewed discussion. DOGE's price trends to the downside on the daily chart. Source: DOGEUSD on Tradingview Network Activity Strengthens as Dogecoin Price Holds Key Support Despite muted market reaction to Dogecoin’s 12th anniversary, activity on the network continues to rise. Daily active addresses reached over 67,000 earlier in December, marking the second-highest level in three months. This increase comes as DOGE repeatedly defended the $0.14 support, forming a tight compression range between $0.1406 and $0.1450. Short-term charts indicate multiple rebounds from the $0.14 level, accompanied by decreasing sell volume, an early sign of accumulation. Analysts identify $0.16 as the threshold that would shift DOGE from range-bound movement into a potential trend continuation. Failure to hold support, however, could expose deeper downside toward $0.081, an area highlighted by realized on-chain distribution clusters. Adoption Expands Beyond Market Narratives Recent developments show Dogecoin slowly expanding beyond its memecoin label. In Argentina, certain taxes can now be paid using DOGE, while Alternative Airlines has begun accepting the token for ticket purchases. These integrations, although still modest, indicate real-world traction that supports a longer-term use case narrative. Broader sentiment, however, remains closely tied to macroeconomic conditions. Analysts note that liquidity trends, regulatory developments, and institutional risk appetite continue to shape DOGE’s outlook. The launch of the first Dogecoin ETF in November drew little initial inflow, signaling that large investors remain cautious despite the token’s growing visibility. Long-Term Structure Points to Potential Upside From a structural standpoint, Dogecoin continues to follow a multi-year pattern that some analysts view as constructive. Long-term charts show price action moving within a large triangle formation dating back to 2021, with a cup-and-handle structure still intact on higher timeframes. Weekly RSI levels near 50 resemble conditions seen before DOGE’s 2021 rally, while MACD indicators approach bullish crossovers on both weekly and monthly charts. Forecasts place Dogecoin’s path toward $1 as a possibility later in the decade, with projections suggesting a climb toward that level by 2030. In the near term, the $0.145–$0.16 zone remains the defining barrier that could determine whether DOGE transitions into a stronger upward phase or remains confined to its current band. Related Reading: Bitcoin Speculation Muted: Glassnode Analyst Calls Perps A ‘Ghost Town’ As Dogecoin stabilizes above key support and real-world adoption increases, traders are closely watching for the next catalyst, whether it be network expansion, macroeconomic shifts, or renewed community-driven momentum. Cover image from ChatGPT, DOGEUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|Doge price|dogeusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55573876,
    "published": 1765328913000,
    "title": "Bitcoin Prices Approach $95,000 As Fed Rate Cut Speculation Fuels Gains",
    "body": "Bitcoin prices approached the $95,000 level today as speculation surrounding Federal Reserve policy combined with other bullish factors to fuel gains.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55574952,
    "published": 1765331056000,
    "title": "Vivek Ramaswamy's Strive to raise $500M to buy Bitcoin",
    "body": "Strive, co-founded in 2022 by American entrepreneur Vivek Ramaswamy, launched a $500 million preferred stock offering to acquire more Bitcoin and Bitcoin-related products.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55574626,
    "published": 1765330448000,
    "title": "Stripe’s stablecoin blockchain Tempo launches public testnet",
    "body": "Public testnet for the Stripe-and-Paradigm-built payments blockchain is now live, featuring tools for developer onboarding and stablecoin testing.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      }
    ]
  },
  {
    "id": 55575373,
    "published": 1765332046000,
    "title": "Institutions Scoop Up 9,000 Ether, Fueling Bullish Signals",
    "body": "Ethereum saw a flurry of big moves that traders say could matter for its next price swing. In just a few hours, major accounts pulled large sums off an exchange and big wallets opened sizable margin longs. Market watchers are parsing those moves for clues. Related Reading: All-In On XRP: Why This Leading Investor Sold His Entire Bitcoin Stack Institutions Shift Big Stakes According to Arkham Intelligence, Amber Group and Metalapha pulled out 9,000 Ether from Binance in a short span, a haul worth more than $28 million at current prices. Based on reports, institutional flows have been heavy for months — nearly 4 million ETH has been accumulated by institutions over five months. Those kinds of transfers are often linked to custody setups or long-term holdings rather than quick trades. Whales Add Margin Bets Several large wallets added roughly $426 million in margin long exposure. Wallets named 1011short and Anti-CZ are among the accounts that expanded long bets. That kind of activity raises the chance of sharper moves in either direction: if prices rise, longs can feed a rapid upswing; if a pullback hits, forced selling could amplify losses. Market structure is tighter now than it was several months ago. 🚨 INSTITUTIONS ARE ACCUMULATING $ETH ~ QUIETLY. In the last few hours: • Amber Group withdrew 6,000 ETH ($18.8M) from Binance • Metalapha withdrew 3,000 ETH ($9.4M) That’s 9,000 ETH pulled off exchanges in a single morning. This is the same pattern we’ve seen for weeks:… pic.twitter.com/MBgyXoPfJz — BMNR Bullz (@BMNRBullz) December 8, 2025 Available Supply Shrinks On-chain data shows only 8.7% of ETH is currently held on exchanges. More than 28 million ETH is locked up in staking, custody, and what reports call long-term storage. Staking inflows remain high, with over 40,000 ETH added per day on average. Less supply on exchanges can lower immediate selling pressure, making price swings more dependent on fresh buy orders. Price Range And Key Levels Ethereum has gained 2.5% in the last 24 hours and is trading near $3,050. According to an analyst’s chart, ETH has been moving inside a tight range between $3,050 and $3,200, with $3,100 acting as a support line. Traders say a clear break above the $3,300–$3,400 band could open the way toward $3,700 to $3,800. Failure at that resistance would likely push prices back toward $3,000, where buyers may step in again. Related Reading: Banking Meets Bitcoin: French Banking Giant Offers Crypto To Millions Regulatory Step Could Matter In a related development, the US Commodity Futures Trading Commission has launched a pilot that allows Ethereum, USDC and Bitcoin to be used as collateral in regulated derivatives venues. Acting Chair Caroline Pham unveiled the plan in Washington and said the move will let regulators observe how tokenized collateral behaves in stressed conditions. The program sets rules for custody, segregation, and valuation tests inside a controlled environment. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|bitcoin|crypto|ETH|ethereum|ethusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55575164,
    "published": 1765331524000,
    "title": "Teachers Union Urges Senate to Scrap Crypto Market Structure Bill",
    "body": "The union urged lawmakers to abandon the draft, arguing it would erode securities protections and heighten risks for pension holders.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 55576310,
    "published": 1765333798000,
    "title": "Bitcoin Price Shows Fresh Strength—Could This Spark a Rapid Rally?",
    "body": "Bitcoin price started a decent increase above $92,000. BTC is now consolidating gains and might aim for another increase if it clears $93,400. Bitcoin started a downside correction from the $94,500 zone. The price is trading above $92,000 and the 100 hourly Simple moving average. There is a bullish trend line forming with support at $91,500 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move up if it settles above the $93,400 zone. Bitcoin Price Holds Support Bitcoin price managed to stay above the $91,000 zone and started a fresh increase . BTC gained strength for a move above the $92,500 and $94,000 levels. However, the bears were active near $94,500. A high was formed at $94,583 and the price recently corrected some gains. There was a drop toward the 50% Fib retracement level of the upward move from the $89,545 swing low to the $94,583 high. However, the bulls were active near the $92,000 support. Bitcoin is now trading below $92,000 and the 100 hourly Simple moving average . Besides, there is a bullish trend line forming with support at $91,500 on the hourly chart of the BTC/USD pair. If the bulls remain in action, the price could attempt another increase. Immediate resistance is near the $92,800 level. The first key resistance is near the $93,200 level. The next resistance could be $94,000. A close above the $94,000 resistance might send the price further higher. In the stated case, the price could rise and test the $94,500 resistance. Any more gains might send the price toward the $95,500 level. The next barrier for the bulls could be $96,200 and $96,500. More Losses In BTC? If Bitcoin fails to rise above the $94,000 resistance zone, it could start another decline. Immediate support is near the $92,000 level. The first major support is near the $91,500 level and the 61.8% Fib retracement level of the upward move from the $89,545 swing low to the $94,583 high. The next support is now near the $90,750 zone. Any more losses might send the price toward the $90,000 support in the near term. The main support sits at $88,800, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $92,000, followed by $91,500. Major Resistance Levels – $93,200 and $94,000.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55578034,
    "published": 1765336696000,
    "title": "Ethereum Smashes Resistance—Bitcoin Left Behind as Momentum Flips Bullish",
    "body": "Ethereum price started a fresh increase above $3,25 0. ETH is now consolidating gains and might aim for more gains if it clears the $3,380 resistance. Ethereum started a fresh increase above the $3,200 and $3,250 levels. The price is trading above $3,200 and the 100-hourly Simple Moving Average. There is a bullish trend line forming with support at $3,210 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move up if it settles above the $3,350 zone. Ethereum Price Rallies Over 8% Ethereum price managed to stay above $3,000 and started a fresh increase, beating Bitcoin . ETH price gained strength for a move above the $3,120 and $3,250 resistance levels. The bulls even pushed the price above $3,350. However, the bears were active below $3,400. A high was formed at $3,396 and the price is now consolidating. There was a minor drop below the 23.6% Fib retracement level of the upward wave from the $3,094 swing low to the $3,396 low. Ethereum price is now trading above $3,200 and the 100-hourly Simple Moving Average. There is also a bullish trend line forming with support at $3,210 on the hourly chart of ETH/USD. If there is another upward move, the price could face resistance near the $3,320 level. The next key resistance is near the $3,350 level. The first major resistance is near the $3,380 level. A clear move above the $3,380 resistance might send the price toward the $3,420 resistance. An upside break above the $3,420 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $3,500 resistance zone or even $3,550 in the near term. Pullback In ETH? If Ethereum fails to clear the $3,380 resistance, it could start a fresh decline. Initial support on the downside is near the $3,250 level and the 50% Fib retracement level of the upward wave from the $3,094 swing low to the $3,396 low. The first major support sits near the $3,210 zone. A clear move below the $3,210 support might push the price toward the $3,150 support. Any more losses might send the price toward the $3,050 region. The next key support sits at $3,000. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI – The RSI for ETH/USD is now above the 50 zone. Major Support Level – $3,210 Major Resistance Level – $3,380",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55582058,
    "published": 1765342988000,
    "title": "Solana Liquidity Plummets to Bear Level Territory Amid $500M Liquidation Overhang",
    "body": "On-chain data shows Solana's liquidity has contracted to bear-market levels, with $500M in long positions at risk if its price drops 5.5%.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55581945,
    "published": 1765342848000,
    "title": "Bitcoin Exchange Reserves Fall To Lowest Levels on Record: The Bullish Signal Most Traders Are Missing",
    "body": "Bitcoin is holding above $90,000 as the market heads into a highly anticipated FOMC meeting, a moment that could define the next direction for risk assets. But while price action keeps traders on edge, on-chain indicators are painting a surprisingly different picture beneath the surface. According to a new CryptoQuant report by XWIN Research Japan, Bitcoin’s exchange reserves have continued to fall sharply throughout 2025, even as price corrected toward the $90K range. Related Reading: Smart Whales Align: Top Performers Go All-In On Ethereum Long Positions With Over $425M in Exposure The data shows that the total amount of BTC held on centralized exchanges has dropped to 2.76 million BTC, reaching one of the lowest levels ever recorded. What makes this trend even more striking is its timing: during the steep November–December sell-off, exchange balances did not rise—they fell faster. The report highlights this behavior in the red-marked zone of the chart, showing accelerating outflows while the price was dropping. This pattern signals something unusual: investors are not sending coins to exchanges to sell into weakness. Instead, they continue withdrawing BTC into long-term custody, suggesting confidence rather than capitulation. As volatility builds ahead of the FOMC decision, the contrast between short-term price fear and long-term accumulation is becoming one of the most important dynamics in the current Bitcoin market. Shrinking Exchange Reserves Signal Structural Strength The report emphasizes that Bitcoin’s rapidly shrinking exchange reserves carry important structural implications for the market. When fewer coins sit on centralized exchanges, it means less Bitcoin is available for immediate sale, effectively tightening the liquid supply. According to the data, this decline is not being driven by short-term speculators but by long-term holders and institutional entities steadily moving BTC into self-custody or cold storage. What makes this trend remarkable is its timing. Historically, sharp price declines trigger a wave of inflows to exchanges as investors prepare to sell or panic-exit their positions. This cycle, however, tells a very different story. Even as Bitcoin corrected into the $90K region, exchange balances kept falling, suggesting that buyers with a long-term outlook are actively accumulating rather than retreating. This divergence between price action and on-chain behavior signals underlying strength. While short-term volatility may continue—especially around macro catalysts like the FOMC meeting—the broader structure points toward a market quietly tightening its available supply. As reserves move toward historic lows, a future “supply shock” becomes increasingly plausible. Despite the weak spot market performance, on-chain metrics are slowly turning bullish, hinting that the foundation for the next major trend may already be forming beneath the surface. Related Reading: Ethereum Loses Momentum While OI Holds Steady: Binance Data Shows A Market Reset BTC Tests Critical Support as Market Awaits Direction Bitcoin’s price action on the 3-day chart shows a market attempting to stabilize after a sharp corrective phase. BTC is currently trading around $90,437, hovering just above the 200-day moving average — a level that has historically acted as a major dynamic support during mid-cycle retracements. The recent bounce from the $87K–$88K region suggests that buyers are defending this zone, but the structure remains fragile as long as the price stays below the 50-day and 100-day moving averages, both of which are now sloping downward. The chart reveals a clear shift in momentum. After months of steady higher lows, Bitcoin broke its ascending structure in late November, leading to a fast drop toward the high-$80K range. Volume increased during the decline, indicating stronger participation on the sell side. However, the subsequent candles show shrinking sell volume, hinting at exhaustion among short-term sellers. Related Reading: Ethereum Shows Signs Of Accumulation As CVD Strengthens And Correlation Stays Elevated For a meaningful recovery, BTC must reclaim the $95K–$97K area, where previous support turned into resistance. Failure to break that zone would likely keep the market in a consolidation phase, with risks of another retest of the 200-day MA. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|Binance Bitcoin Exchange Reserve|bitcoin|bitcoin analysis|Bitcoin Bullish|Bitcoin exchange reserve|Bitcoin news|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55582584,
    "published": 1765343934000,
    "title": "Rep. Keith Self Moves to 'Fix the Bill' With CBDC Ban Before Key Hearing",
    "body": "The amendment follows Republican outcry over broken commitments to ban central bank digital currencies in the defense bill.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 55582914,
    "published": 1765344358000,
    "title": "Binance Co-CEO Yi He’s WeChat Account Hacked to Push Meme Coin MUBARA",
    "body": "The attackers profited by selling the memecoin after creating artificial demand through the false endorsement.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 55584030,
    "published": 1765346453000,
    "title": "Ethereum Price Climbs Toward $3,300 For The First Time Since November: What’s Driving The Surge?",
    "body": "On Tuesday, the Ethereum price experienced a notable surge, climbing by 6.5% and reclaiming the critical $3,300 mark for the first time in nearly a month. This has allowed Ethereum to outpace its peers among the top ten cryptocurrencies by market capitalization, showcasing a nearly 12% recovery for the leading altcoin over the past week. ETH Grows In Demand Analysts from Bull Theory attribute this resurgence to several key factors, including significant institutional interest in Ethereum. The firm highlighted BitMine, which holds the largest public company collection of ETH, as a major player in this recovery phase. In a recent social media update on X (formerly Twitter), the analysts pointed out that demand for ETH is on the rise as Wall Street quietly builds on the Ethereum platform. Related Reading: Crypto Market Structure Talks: Senator Lummis Addresses Latest Legislation Plans Notably, major financial institutions are beginning to make substantial moves in the Ethereum space. BlackRock, which manages $13.5 trillion, is launching tokenized funds and has filed for a staked Ethereum exchange-traded fund (ETF). Other notable players include JPMorgan with $4 trillion in assets, Deutsche Bank at $1.1 trillion, and Standard Chartered with $800 billion. These firms are developing tokenization and decentralized finance (DeFi) infrastructure specifically on Ethereum and its Layer 2 (L2) solutions. In addition, well-known financial entities such as Amundi, HSBC, BNY Mellon, Coinbase (COIN), Kraken, and Robinhood (HOOD) are incorporating Ethereum into their operations for functions like custody, settlement, and rollup infrastructure. As a result, these large companies are holding and staking ETH to generate yield, significantly increasing the altcoin’s demand. BitMine, for instance, anticipates earning over $400 million annually from its staking position. Could The Ethereum Price Hit $12,000? Such institutional involvement has led market experts like Tom Lee to speculate that the Ethereum price could potentially reach $12,000 by 2026, driven by growing staking demand and the scaling of tokenization efforts. Adding to the momentum, Arkham reported that Tom Lee’s Ethereum treasury firm acquired 138,452 ETH since last week, valued at approximately $431.97 million. BitMine currently holds $12.05 billion in ETH and has an additional $1 billion allocated for further purchases. Related Reading: Wall Street Giant Bernstein Predicts Bitcoin Price To Hit $1 Million By 2033 In a different development that could bolster the Ethereum price further, Chris MacDonald, an analyst for The Motley Fool, highlighted reports indicating that the Office of the Comptroller of the Currency (OCC) confirmed US banks can now legally conduct “riskless principal” transactions in crypto assets. The analyst asserted that this new regulatory approval may lead to an influx of capital into digital assets, which would likely benefit the Ethereum price and holders, as well as other top cryptocurrencies. As of this writing, the Ethereum price is trading at $3,325. Despite recent gains, the price is still nearly 33% below the all-time high of $4,946, which was reached earlier this year. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|BitMine|Bitmine Ethereum|crypto|crypto news|ETH|ethereum|Ethereum Bitmine|ethereum news|ethereum price|Ethereum Price analysis|Ethereum price news|ETHUSDT|Latest Ethereum News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55584020,
    "published": 1765346417000,
    "title": "XRP Sell Pressure Emerges as Ripple Linked Token Fails to Sustain $2.12 Break",
    "body": "Despite briefly reaching $2.17, XRP failed to maintain momentum, suggesting large holders may be unwinding positions rather than accumulating.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55584026,
    "published": 1765346402000,
    "title": "Historic Reversal: Ethereum ETF Flows Plunge To Worst Month Since Launch",
    "body": "Ethereum’s momentum in institutional markets just hit a major roadblock. After months of enthusiasm surrounding spot Ethereum exchange-traded funds (ETFs), new data has shown that ETF flows have sunk to their worst monthly total since their launch. The sharp drop reflects a broader cooldown in investor demand, as market volatility and shifting risk appetite weigh on crypto allocations. Will Staking ETFs Emerge To Stabilize Flows? In an X post, a crypto analyst known as Milk Road revealed that the Ethereum ETFs had just printed their worst month on record since launch, which is roughly $1.4 billion in net outflows, the largest single-month withdrawal that ETH has ever encountered. Related Reading: Ethereum Shows Signs Of Accumulation As CVD Strengthens And Correlation Stays Elevated Historically, ETF flow reversals tell more about liquidity pressure in the broader financial system than the long-term fundamentals of the asset itself. When redemptions spike this hard, it’s usually a sign that broader risk sentiment is cracking, not that the asset itself broke. Meanwhile, most investors don’t know that while ETFs were handing back, Digital Asset Treasuries (DATs) stepped in as aggressive buyers. BitMine Immersion Technologies (BMNR) quietly added over 300,000 ETH, worth nearly $800 million at the time, to its treasuries. If the ETF outflow continues to accelerate, the near-term price action will remain choppy as liquidity gets strained at the edges. However, if DAT inflows continue scaling, it builds the foundation for a tighter supply setup into 2026. The tension between this panicked short-term selling pressure and the quiet structural long-term accumulation is the most important dynamic for positioning. Why ETH Reserves Are Becoming Strategic Corporate Assets Crypto trader Bull Theory has noted that last week, BitMine bought an astonishing 138,452 ETH, worth $437.7 million. This single transaction solidifies their position as the largest ETH treasury in the world, holding 3.86 million ETH, valued at $12.4 billion and accounting for 3.2% of the entire circulating supply. Related Reading: Here’s Why Ethereum Emerges As The Global Capital Rails For On-Chain Finance The true source of rising ETH demand is that Wall Street is quietly building on ETH. BlackRock, with $13.5 trillion AUM, has launched tokenized funds on ETH and has filed for a staked ETH ETF. JPMorgan, with $4 trillion, Deutsche Bank, with $1.1 trillion, and Standard Chartered, with $800 billion, are developing tokenization and DeFi infrastructure using ETH and its Layer-2 networks. Institutions like Amundi, HSBC, BNY Mellon, Coinbase, Kraken, and Robinhood are all using ETH rails for custody and settlement or rollup infrastructure for scaling and security. Furthermore, large companies are now holding and staking ETH for yield. BitMine alone expects to generate $400 million+ a year in staking revenue from its position. Tom Lee believes that as staking demand grows and institutions scale tokenization increases, ETH could reach $12,000 in 2026. “A Bitcoin miner is now the largest Ethereum whale, Wall Street is building on ETH, and treasuries are shifting toward yield. ETH is quickly becoming part of the Global Financial System.” Bull Theory noted. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum|Amundi|and Robinhood|bitcoin|Bitmine Immersion Technologies|BMNR|BNY Mellon|Bull Theory|coinbase|DATs|Digital Asset Treasuries|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|ethusd|ETHUSDT|Global Financial System|hsbc|kraken|Milk Road|wall street",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55586131,
    "published": 1765350035000,
    "title": "Cathie Wood Says Bitcoin Is ‘Climbing Another Wall Of Worry’– Here’s Why",
    "body": "Ark Invest’s CEO and CIO, Cathie Wood, joined Fox Business’s “Morning With Maria” to discuss her investment strategy as she believes the US is entering a “historic productivity surge,” and why she is bullish on Bitcoin (BTC) for 2026. Related Reading: All Eyes On Ethereum: Price Attempts Key Breakout As BlackRock Files For Staked ETH ETF The Four-Year Cycle Will Be ‘Disrupted’ On Tuesday, Ark Invest’s CEO, Cathie Wood, shared her perspective on the recent Bitcoin performance, which has retraced over 10% in the past month and struggled to reclaim crucial levels over the past few weeks. To Wood, Bitcoin has been behaving like a risk-on asset and is currently “climbing another wall of worry” that has made investors wary of the leading crypto asset’s upcoming performance. As she explained, there is a fear of the four-year cycle, which suggests that 2026 will be a corrective year for Bitcoin. Historically, BTC has seen significant price pullbacks during bear markets, with retraces of up to 75% to 90% in previous cycles. The aggressive Q4 2025 correction has shattered most investors’ expectations of an end-of-year bull run, raising concerns that the crypto market has already entered the bearish phase of the cycle after the more than 30% drop from the October highs. However, Ark Invest’s CEO considers that “the four-year cycle is going to be disrupted” as volatility has significantly diminished over the past few years, and large-scale investors turn to the rapidly growing industry. “We think that the move by institutions into this new asset class is going to prevent much more of a decline,” Wood affirmed, noting, “we might have seen it a couple of weeks ago,” when BTC managed to hold the $80,000 barrier during the late November correction. She previously asserted that growing institutional adoption will be a powerful driver for long-term value for the cryptocurrency, adding that institutions “really have just dipped their toes into this space. We have just started, so we have a long way to go.” Bitcoin To Outperform Gold Soon? During the interview, Wood also reaffirmed her previous forecast that the flagship crypto will outperform gold next year, despite its choppy performance during the last quarter of 2025. She highlighted that “gold is more of a risk-off asset,” and its 60% year-to-date (YTD) rise is “proof” that Bitcoin is climbing a wall of worry as investors “are using gold as a hedge against geopolitical risks.” Nonetheless, Ark Invest’s CEO pointed out that between the early 80s and the late 90s, gold peaked and “went down as we were in the golden age of innovation, ending with the internet.” Related Reading: Wall Street Giant Bernstein Predicts Bitcoin Price To Hit $1 Million By 2033 Now, she believes that the same could happen soon, as what she calls “the AI age” starts and the market potentially recovers. Meanwhile, she forecasted that Bitcoin would remain risk-on and outperform gold in 2026. “I really believe we are moving from a rolling recession where we’ve been for the last three years, into a rolling recovery, which we think we are entering now. Then, a productivity-driven boom the likes of which we have never seen before,” Wood concluded. As of this writing, Bitcoin is trading at $94,011, a 3.75% increase in the daily timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|ark invest|bitcoin|bitcoin bear market|Bitcoin Gold Price Forecast|bitcoin price|bitcoin vs gold|btc|BTCUSDT|Cathie Wood|crypto market bull run 2025|crypto market correction|crypto market recovey",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55587078,
    "published": 1765351444000,
    "title": "IMF Flags Stablecoins as Source of Risk to Emerging Markets, Experts Say We Aren't There Yet",
    "body": "The IMF warns that USD-pegged stablecoins could undermine local currencies in emerging markets by facilitating currency substitution and capital outflows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Stablecoins|Markets|IMF|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55588254,
    "published": 1765353650000,
    "title": "Standard Chartered Cuts 2026 Bitcoin Price Prediction By 50%",
    "body": "Standard Chartered has sharply reduced its famously bullish Bitcoin roadmap, cutting its 2026 price target in half and acknowledging that its previous near-term projections were too aggressive, even as it keeps an ultra-optimistic long-term view intact. Standard Chartered Downgrades Bitcoin Price Predictions In a note shared on X by VanEck head of research Matthew Sigel, Standard Chartered argues that Bitcoin’s traditional halving cycle has been overtaken by ETF-driven flows. The bank writes: “With the advent of ETF buying, we think the BTC halving cycle is no longer a relevant price driver. The logic in previous cycles (when US ETFs did not exist) – i.e., prices would peak about 18 months after each halving and decline thereafter – is no longer valid, in our view.” The report adds that it will “take a break of the current all-time high ($ 126,000 on 6 October 2025) to prove that; we expect this to happen in H1-2026.” Related Reading: Bitcoin In An Opportunity Zone? Hash Ribbons Flash New Buy Signal Alongside that shift in framework, the bank re-profiled its multi-year Bitcoin targets. According to the figures shared by Sigel, Standard Chartered has lowered its 2025 forecast from $200,000 to $100,000, its 2026 target from $300,000 to $150,000, its 2027 projection from $400,000 to $225,000, its 2028 estimate from $500,000 to $300,000, and its 2029 prediction from $500,000 to $400,000 while keeping a $500,000 target for 2030. Geoff Kendrick, Standard Chartered’s head of digital assets research, characterises the recent drawdown as painful but not structural. He describes the current phase as “a cold breeze,” explicitly rejecting the notion of a new crypto winter and noting that the magnitude of the pullback remains consistent with corrections seen in past bull cycles. At the same time, he points out that weaker valuations for listed Bitcoin treasury companies have curtailed their ability to act as major marginal buyers, leaving spot ETFs as the primary driver of near-term gains. Related Reading: Bitcoin To Hit $50 Million By 2041, Says EMJ Capital CEO Wall Street Giant Bernstein Agrees The downgrade also lands in the context of a broader rethink on Wall Street. One day earlier, on December 8, Sigel shared a separate note from Bernstein that reached a similar conclusion about Bitcoin’s market structure. Bernstein wrote that “the Bitcoin cycle has broken the 4-year pattern (cycle peaking every 4 years) and is now in an elongated bull-cycle with more sticky institutional buying offsetting any retail panic selling.” Despite an approximately 30% correction, the firm notes that “we have seen less than 5% outflows via ETFs.” On that basis, Bernstein now moves its 2026 Bitcoin price target to $150,000, sees the cycle “potentially peaking in 2027E at $200,000,” and keeps its long-term 2033 target at roughly $1,000,000 per BTC. Both Standard Chartered and Bernstein are converging on the same structural message: the halving alone no longer explains Bitcoin’s trajectory. ETF flows, institutional positioning and balance-sheet dynamics are now the core variables, even if their precise price targets and timelines diverge. At press time, Bitcoin traded at $92,686. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|bitcoin price prediction|Bitcoin Price Prediction 2026|btc|BTC news|btc price|Standard Chartered",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]