[
  {
    "id": 57350483,
    "published": 1768977123000,
    "title": "Rolex, Patek lead high-end watch market rebound even as bitcoin struggles",
    "body": "Secondary watch prices are up about 4% over six months, even as crypto slides and gold and silver absorb the macro stress trade.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|btc|Watches|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57350586,
    "published": 1768977107000,
    "title": "Bhutan to deploy Sei validator in Q1, eyes tokenization collab",
    "body": "Bhutan is adding to its growing list of blockchain initiatives. It already runs a Bitcoin mining operation and also launched a self-sovereign ID system powered by Ethereum.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57351065,
    "published": 1768978854000,
    "title": "Trove’s New Token Craters 95%, Sparking Investor Revolt",
    "body": "Trove Markets’ new token collapsed almost immediately after trading began, wiping out the vast majority of early gains and leaving many backers angry and confused. The drop was brutal. Traders who bought early watched their holdings shrink by about 95% in a matter of hours. Related Reading: Bitcoin Bulls Fired Up As Saylor Teases ‘Bigger Orange’ After Huge Buy Token Price Plunges After Launch Initial prices implied a market value near $20 million. Based on reports, the token fell to roughly $0.0008 per unit, trimming the market cap to below $1–2 million. Some wallets unloaded huge chunks of coins right after the token generation event. That selling pressure coincided with a flood of posts on social platforms calling the launch a rug pull. Trove Had Raised Millions Before The Fall According to reports, the project raised roughly $11.5 million in its public sale. The Trove team announced it would keep about $9.4 million to fund further work and pay for a switch of blockchains. Refunds totaling about $2.44 million were returned to some investors, and another $100,000 was earmarked for additional reimbursements. The numbers left many buyers feeling shortchanged and asking why a large share of the money stayed with the team. Team Keeps Majority Of Funds On-chain analysts and tracing tools flagged unusual transfers tied to a handful of new accounts. Reports note that a meaningful slice of the token supply moved into one cluster of wallets, and some transfers were routed through services like ChangeHero. That activity raised questions about whether all token allocations were handled openly. Legal calls and demands for public audits followed soon after. Investors reacted quickly. Some demanded full refunds. Others threatened legal steps. Community moderators and influencers amplified complaints and demanded clear timelines for fixes. We’re pivoting Trove to Solana. After recent sentiment around Trove, the liquidity partner that had been supporting our Hyperliquid path chose to unwind their 500k $HYPE position. That was their decision and we fully respect it. This changes our constraints: we’re no longer… — unwise (@unwisecap) January 18, 2026 Trove posted updates, saying a partner had pulled out and that the pivot to Solana was necessary to keep the project alive. The team promised to continue building and to be more open about their choices, while pledging to deliver a working platform that might justify holding the funds. https://t.co/sc8b59sjYE — TROVE (@TroveMarkets) January 19, 2026 Related Reading: Bitcoin Senses Risk As Trump Balks At Europe With Major Tariffs Trust Hinges On Delivery And Transparency What happens next will matter more than the words now being exchanged. If the team can show tangible progress on the exchange and create real trading depth, some anger may fade. If not, the episode could be used as a warning: token sales that change terms late in the process can trigger swift market punishment and reputational damage. Regulatory scrutiny could also increase if large sums are held after a collapse like this. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|crypto|meme coins|Rug Pull|Solana|Trove",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57351705,
    "published": 1768980793000,
    "title": "Bitcoin stages rebound to nearly $90,000 as traders await Trump’s Davos talks",
    "body": "BTC and major altcoins saw early signs of stabilization after macro-driven losses.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57352768,
    "published": 1768983694000,
    "title": "Nansen launches AI crypto trading tools on Base and Solana",
    "body": "The new AI-powered crypto trading platforms aim to replace traditional trading charts and order books with trading execution offered through natural language processing.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57354213,
    "published": 1768987888000,
    "title": "Solana Mobile launches SKR token airdrop for Seeker phone users",
    "body": "Solana Mobile's airdrop of almost 2 billion SKR tokens for 100,000 Seeker users is claimable for 90 days, with staking rewards starting immediately.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 204,
        "NAME": "AIRDROP",
        "CATEGORY": "AIRDROP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57354218,
    "published": 1768988117000,
    "title": "Binance to add Ripple’s RLUSD stablecoin on Ethereum, XRP Ledger support is coming",
    "body": "The dollar-backed stablecoin be available starting Thursday on Ethereum, with support for the XRP Ledger expected soon.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|XRP News|Rlusd|Listings|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57355871,
    "published": 1768992619000,
    "title": "GameFi Tokens Axie Infinity, The Sandbox Defy Crypto's Bearish Trend",
    "body": "The crypto gaming tokens posted double-digit weekly gains, bucking the broader market downturn—but experts urge caution.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|decentraland|the-sandbox|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 9,
        "NAME": "AXS",
        "CATEGORY": "AXS"
      },
      {
        "TYPE": "122",
        "ID": 36,
        "NAME": "MANA",
        "CATEGORY": "MANA"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57356593,
    "published": 1768994422000,
    "title": "Gen Z and Millennials see crypto as future of finance, Boomers stick with banks",
    "body": "With Boomers controlling more than half of US household wealth, the coming generational transfer could funnel a portion of this capital into crypto markets, a new OKX survey shows.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57356489,
    "published": 1768994173000,
    "title": "Can Bitcoin regain $90K? Bulls at risk as long-term holders ramp up selling",
    "body": "Bitcoin risks a further decline to $84,000, following rising whale exchange deposits and accelerated long-term holder selling.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57356781,
    "published": 1768995287000,
    "title": "SlowMist flags Linux Snap Store attack targeting crypto seed phrases",
    "body": "Attackers hijacked trusted Snap Store publishers via expired domains, allowing malicious wallet updates to reach long-time Linux users.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57357354,
    "published": 1768996799000,
    "title": "Sam Altman Hits Back at Elon Musk Over ChatGPT Safety Claims",
    "body": "The feud between the tech leaders has escalated after Musk publicly warned against using OpenAI's ChatGPT on his social media platform X.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57357968,
    "published": 1768998600000,
    "title": "Trade finance is the biggest opportunity in blockchain",
    "body": "Trade finance’s financing gap and paper-based inefficiencies create blockchain’s largest opportunity. Tokenized receivables can unlock global liquidity for SMEs.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      }
    ]
  },
  {
    "id": 57358082,
    "published": 1768998690000,
    "title": "Bitpanda expands into stocks and ETFs with universal exchange push",
    "body": "More crypto platforms are edging toward universal exchange ambitions, with research firms predicting a crypto “super app” race.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57358613,
    "published": 1769000409000,
    "title": "Pundit Clarifies XRP Roadmap To $10: How Price Will Play Out In 2026",
    "body": "Although the XRP price has remained in a downtrend and largely range-bound since falling below its 2025 peak, a crypto analyst believes it could still surge to $10 in 2026. The analyst has shared a detailed roadmap supporting this bullish outlook, outlining how XRP’s price could play out this year and the key factors that could influence its movements. A Roadmap To XRP $10 Price Surge In a YouTube video released on January 20, crypto market analyst Zach Rector laid out his honest expectations for XRP’s outlook in 2026, offering insights into how it could get to $10 and the catalysts that could fuel this rally. According to the analyst, the XRP market is currently dominated by Fear, Uncertainty, and Doubt (FUD), along with signs of capitulation, which have pushed the price down and negatively impacted the sentiment and confidence of newer investors. Related Reading: Is Dogecoin About To Repeat NVIDIA’s Run? Here’s What The Chart Says Rector revealed that long-term XRP holders are also becoming increasingly frustrated with the prolonged downtrend, with many wishing they had taken profits during last year’s rally, particularly when XRP rose to a peak around $3.6. He added that there has also been discontent and negative sentiment regarding XRP’s slow adoption, delay in industry regulation, and more. However, from both a technical and investment standpoint, the analyst said he remains excited and optimistic about XRP’s price prospects in 2026. He explained that the market is already entering a renewed liquidity cycle, a shift that typically leads to an expansion in the broader business cycle. According to him, this stage has always correlated with powerful bull runs during an altcoin season. Rector mentioned that although many investors and analysts expected an altcoin season in 2025, it never came. He believes that market conditions could still align for an altcoin season this year, with XRP positioned for significant gains during that period. He further acknowledged that he does not expect XRP to skyrocket to $50 or $100 in 2026, calling those price targets highly ambitious. For his more realistic projection, Rector said he believes XRP could rise to between $5 and $10 in 2026. He noted that a significant sell wall exists around this range, as many investors are likely to take profits amid potential price volatility. Despite this, the analyst said that XRP still brings a strong ROI opportunity for investors. He pointed to factors that could drive the market, including US interest rate cuts, the implementation of the CLARITY Act, and billions of dollars expected from the Fed’s QE programs. XRP Could Double ROI Faster Than Gold And Silver In his video, Rector compared XRP’s long-term profitability potential to that of gold and silver. He noted that both precious metals performed exceptionally during this cycle, reaching new all-time highs. Silver, in particular, exceeded expectations, breaking past $95 in the last 24 hours after experiencing a years-long downtrend. Related Reading: Shiba Inu Whales Are On The Move Again, 361 Billion SHIB Stuns Community Rector believes that the chances of silver doubling to $200 or gold reaching $9,000-$10,000 per ounce this year are low. However, he says XRP has much stronger upside potential, forecasting a surge to $4 and beyond. If this happens, long-term investors who bought at or below $2 could effectively double their ROI. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Ripple|ripple news|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57358850,
    "published": 1769001090000,
    "title": "Chainlink is one of crypto’s most undervalued infrastructure bets: Bitwise",
    "body": "Chainlink is a dominant software platform quietly powering stablecoins, tokenization, DeFi and institutional adoption across crypto, said Matt Hougan.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Chainlink|Bitwise|Analysts|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57359184,
    "published": 1769001935000,
    "title": "Spot Bitcoin, Ether ETFs see heavy outflows as ‘institutional caution’ grows",
    "body": "Crypto markets dip as global macro pressures mount, with US-EU trade tensions and Japanese bond sell-offs fueling institutional caution.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57359117,
    "published": 1769001756000,
    "title": "Blockchain technology can accelerate global GDP growth, Citizens says",
    "body": "The bank said the technology is shifting from experimentation to real-world deployment, with implications for capital markets, governments and global GDP.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Blockchain Adoption|AI|Tokenization|Analysts|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 57359107,
    "published": 1769001588000,
    "title": "Bitcoin sharks scoop up BTC like it's 2013 despite 'perfect bull trap'",
    "body": "Several chartists warn that Bitcoin could decline toward $30,000 in February as the price action mirrors previous four-year cycles.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57359541,
    "published": 1769003026000,
    "title": "Vitalik Buterin proposes simpler ‘distributed validator’ staking for Ethereum",
    "body": "The aim is to make staking more resilient while dramatically reducing technical complexity for large ETH holders.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Ethereum News|Vitalik Buterin|Staking|Validators|distributed validator technology|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57359445,
    "published": 1769002704000,
    "title": "Trump coin price plunges 94% in a year as memecoin frenzy fades",
    "body": "Token falls sharply from its peak just before US president’s inauguration in January 2025",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 57359934,
    "published": 1769004002000,
    "title": "Bitcoin utility blockchain VerifiedX debuts ‘Venmo-for crypto’ payment app Butterfly",
    "body": "The Butterfly app goes live in partnership with Crypto.com, Moonpay and Blockdaemon.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|payments|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57359999,
    "published": 1769004107000,
    "title": "Guernsey Authorities Seize $11.4M Tied to ‘Cryptoqueen’ OneCoin Fraud",
    "body": "A court in Guernsey, a self-governing British finance hub, upheld a German forfeiture order linked to crypto fraud proceeds.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57360597,
    "published": 1769005833000,
    "title": "Solana Will Become A ‘Decentralized Nasdaq’ In 2026, Delphi Digital Predicts",
    "body": "Delphi Digital is betting that Solana’s next major upgrade cycle will reposition the network as an “exchange grade” environment capable of supporting onchain order books that can realistically contend with centralized venues on latency, liquidity depth, and market structure. In a Jan. 20 post on X titled “2026 is the Year of Solana”, the research firm argued Solana’s 2026 roadmap is its “most aggressive upgrade cycle” yet, one that “overhaul[s] everything from consensus to infrastructure to become the decentralized Nasdaq.” Why Delphi Digital Calls 2026 “The Year Of Solana” Delphi framed the roadmap less as a grab bag of performance enhancements and more as a capital-markets push: “Solana’s roadmap is about transforming it into an exchange grade environment where a native onchain CLOB can viably compete with CEX latency, liquidity depth, and fairness. Here are all the upgrades making this possible.” In that view, shaving milliseconds matters only insofar as it produces predictable, enforceable execution outcomes for applications like high-frequency trading and central limit order books. The centerpiece, Delphi wrote, is Alpenglow, a consensus redesign it called “the most significant protocol level change in Solana’s history.” The firm said Alpenglow introduces a new architecture built around Votor and Rotor, with Votor changing how validators reach agreement. Rather than “chaining multiple voting rounds together,” validators would aggregate votes offchain and “commit to finality in one or two rounds,” producing “theoretical finality in the 100-150 millisecond range, down from the original 12.8 seconds.” Related Reading: Solana At Risk Of Breakdown After Key Rejection – Is $100 Next? Delphi emphasized Votor’s parallel finalization paths as a resilience feature, not just a speed play. If a block gets “overwhelming support (80%+ stake)” it finalizes immediately; if support is between 60% and 80%, a second round triggers, and finality follows if that also clears 60%. The goal, Delphi argued, is to preserve finality even with unresponsive segments of the network. Alpenglow also introduces what Delphi called a “20+20” resilience model: safety holds as long as no more than 20% of stake is malicious, while liveness persists even if another 20% is offline, “tolerat[ing] up to 40% of the network being either malicious or inactive while still maintaining finality.” Under this design, Proof of History is “effectively deprecated,” replaced by deterministic slot scheduling and local timers. Delphi said the upgrade is expected to roll out in early to mid 2026. Delphi also pointed to Firedancer, Jump’s C++ validator client, as a structural upgrade aimed at reducing a long-standing operational risk. Solana has historically relied on a single client, now known as Agave, and Delphi described that “monoculture” as a central weakness because client-level faults can cascade into broader network halts. Firedancer’s objective, Delphi said, is a deterministic, high-throughput engine that can process “millions of TPS with minimal latency variance.” Ahead of full readiness, Delphi highlighted “Frankendancer,” a transitional build that combines Firedancer’s networking and block production modules with Agave’s runtime and consensus components, as a bridge to “substantially” increased client diversity. On infrastructure, Delphi spotlighted DoubleZero as a private fiber overlay for validators, likening its transmission profile to traditional exchange connectivity: “the same infrastructure traditional exchanges like Nasdaq and CME rely on for microsecond level transmission.” The argument is that as validator sets expand, propagation variance becomes the enemy of tight finality windows. By routing messages along “optimal paths” and supporting multicast delivery, Delphi said DoubleZero can narrow latency gaps across validators—an enabler for both Votor’s quorum formation and Rotor’s propagation design. Related Reading: SOL Price Faces Key Support Amid Solana’s Rapid Network Expansion Delphi also framed Solana’s block-building roadmap as a market-structure project. It described Jito’s BAM (Block Assembly Marketplace) as separating ordering from execution via a marketplace and privacy layer, with transactions ingested into TEEs so “neither validators nor builders can see raw transaction content before ordering takes effect,” reducing pre-execution behavior like frontrunning. Harmonic, meanwhile, targets builder competition by introducing an open aggregation layer so validators can accept proposals from “multiple competing builders in real time,” with Delphi summarizing: “Think of Harmonic as a meta-market and BAM as a micro-market.” Raiku rounds out the thesis by adding deterministic latency and programmable execution guarantees adjacent to Solana’s validator set, using Ahead-of-Time (AOT) transactions for pre-committed workflows and Just-in-Time (JIT) transactions for real-time needs—without modifying L1 consensus. Delphi ultimately tied the technical roadmap to market demand: Solana’s spot trading gravity, the consolidation of onchain perps toward a handful of venues, and the need to reach performance parity with centralized platforms. It cited expectations for “new Solana native perps like Bulk Trade coming early next year,” and pointed to products like xStocks bringing “onchain equities directly to Solana,” arguing that liquidity and attention are consolidating toward a chain with faster settlement, better UX, and denser capital. At press time, SOL traded at $127. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Solana|Delphi Digital|Sol|SOL news|SOL Price|Solana news|Solana Price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57360593,
    "published": 1769005800000,
    "title": "Ondo Finance Brings 200+ Tokenized U.S. Stocks and ETFs to Solana",
    "body": "The expansion comes as tokenized real-world assets continue to gain traction across crypto markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 108,
        "NAME": "ONDO",
        "CATEGORY": "ONDO"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57353831,
    "published": 1768986900000,
    "title": "Gen Z To Inherit $15 Trillion—And They Trust Crypto More Than Banks",
    "body": "As $84 trillion transfers from Boomers to younger generations, a survey shows heirs trust crypto five times more than their parents do. Gen Z prefers crypto to stocks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57360984,
    "published": 1769006916000,
    "title": "Trump aimes to sign major crypto bill 'very soon' in a push to make U.S. crypto capital of the world",
    "body": "U.S. President Donald Trump said he supported efforts to legislate crypto because of the political support he received for doing so.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Donald Trump|crypto policy|China|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57361460,
    "published": 1769007927000,
    "title": "Bitcoin eyes $90K as Donald Trump sees crypto bill signing 'very soon'",
    "body": "Bitcoin joined stocks in a relief bounce as US President Donald Trump hinted at new legislation \"very soon\" and a doubling of the Dow Jones.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57361699,
    "published": 1769008769000,
    "title": "Trump’s AI and crypto czar says crypto and traditional banks will become ‘one industry’",
    "body": "Sacks believes the divide between banking and crypto industries will disappear, with banks potentially seeing stablecoin issuance as a way to enter the market.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|crypto industry|Trump Administration|banks|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57361767,
    "published": 1769008241000,
    "title": "Iran Turns to Crypto Assets to Offset Rial Crisis, Report Says",
    "body": "The Central Bank of Iran bought more than $500 million in dollar-backed digital assets in the past year to mitigate a currency crisis and bypass US sanctions, blockchain analytics company Elliptic said in a report.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57362234,
    "published": 1769010217000,
    "title": "Fast-food chain Steak n Shake to pay hourly workers a bitcoin bonus",
    "body": "This follows news from a few days ago that the company added $10 million worth of bitcoin to its corporate treasury.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Fold App|Bitcoin Payments|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57362113,
    "published": 1769009980000,
    "title": "BlackRock names crypto and tokenization as ‘themes driving markets’ in 2026",
    "body": "The $10 trillion asset manager includes bitcoin, ether and stablecoins in its 2026 outlook, spotlighting blockchain as a rising force in modern finance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|BlackRock|Tokenization|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57362605,
    "published": 1769011238000,
    "title": "The Macro Wave 5 Move THat Could Trigger 3,000% For Dogecoin Price",
    "body": "Dogecoin price has returned to a level that should be watched closely for long-term price action, as multi-year chart structures begin to resemble conditions that preceded its last historic rally. Still spending years correcting from its 2021 peak, Dogecoin is now trading inside a well-defined accumulation zone on the higher time frame, according to a new technical analysis shared by Crypto Patel on X. The analyst noted that this phase may be setting the stage for a macro Wave 5 expansion that takes the meme coin to new price highs, provided important support levels continue to hold. Dogecoin Sitting In High-Timeframe Accumulation Zone Technical roadmap on the 2-week candlestick timeframe chart breaks Dogecoin’s price action after the 2021 price high into Elliott Wave phases. Wave 1 and Wave 2 are marked as complete, followed by a strong Wave 3 advance that topped around $0.48 in December 2024. Since then, DOGE has entered a Wave 4 corrective phase, forming a descending channel that has guided price lower for over a year without invalidating the broader bullish structure. Related Reading: Why The Dogecoin Price Could Outperform Bitcoin Again This descending channel is important to this technical analysis. Similar corrective behavior appeared just before Dogecoin’s last major expansion in 2021, where the price consolidated for an extended period before breaking upward decisively. Dogecoin is now trading inside a high-timeframe demand zone that acted as the base for its 2020 to 2021 parabolic rally. This area sits just above a long-term horizontal support level that has held firm for an extended period, including through the depths of the 2022 bear market. According to the analyst, this region between $0.115 and $0.09 is a clear zone of sustained accumulation, where buying pressure has consistently prevented deeper breakdowns. Wave 5 Targets Multi-Year Expansion Path If the accumulation zone continues to hold and the price breaks out of the descending channel, then the next projection is the playout of a Wave 5 impulse move. Crypto Patel’s mapped targets for this phase start around $0.28, followed by higher extensions at $1, $2, and ultimately $4. Related Reading: Dogecoin Is Breakout Ready: Analyst Shows Major Target For The Meme Coin King At the time of writing, Dogecoin is trading at $0.1247. Therefore, from current levels, that final target of $4 would represent a move of over 3,100%. However, this is small compared to the magnitude of Dogecoin’s previous macro expansion of 26,800% in the previous cycle. On the other hand, the analysis noted that invalidation is also well defined. A weekly close below $0.06 would break the higher-timeframe structure and invalidate the Wave 5 thesis. Until then, the technical analysis suggests Dogecoin is in a compression phase where downside risk is increasingly defined, but upside expansion into new price highs is possible if Dogecoin embarks on the final impulse of the cycle. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|Crypto Patel|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57363363,
    "published": 1769013504000,
    "title": "Iran’s central bank bought $507 million USDT to underpin rial, report finds",
    "body": "Elliptic traced more than $500 million in USDT tied to Iran’s central bank, suggesting the stablecoin was used to manage foreign-exchange pressures and build a “sanctions-proof” alternative to dollar banking.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Iran|Central Bank of Iran|Elliptic|Stablecoins|Sanctions|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57363798,
    "published": 1769014696000,
    "title": "Bitcoin turns negative for 2026 as Trump's calming Greenland remarks fail to reverse slide",
    "body": "There was a modest bounce after the president said the U.S. had no intention of taking Greenland by force, but prices quickly resumed their decline.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Breaking News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57363657,
    "published": 1769014239000,
    "title": "Solana outpaces crypto market as Claude Code-linked token frenzy lifts network activity",
    "body": "Network activity has risen, driven by speculation around AI tokens, with active addresses increasing from 14.7 million to 18.9 million in a week.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Solana News|Technical Analysis",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57364503,
    "published": 1769016646000,
    "title": "Bitcoin’s Sharp Reversal Leaves Over $800 Million Liquidated In 1 Day",
    "body": "Bitcoin tumbled sharply this week and erased the gains it had made in 2026. Reports from CoinGlass show that over the past 24 hours, 167,513 traders were forced out of their positions, with total liquidations reaching $857 million, with most of those losses coming from long bets. The price slid below the key $88,000 area on major exchanges as traders were forced out of leveraged positions. Related Reading: Bitcoin Senses Risk As Trump Balks At Europe With Major Tariffs Liquidations And Quick Drop According to CoinGlass and market trackers, the liquidations were concentrated in long positions, which amplified the fall and made the move faster than a simple sell-off would have been. Crypto market value fell by hundreds of millions over the same short span. Markets Turned Risk-Averse As Tariff Threats Spread Reports note that renewed tariff threats from US President Donald Trump toward some European countries set off a fresh “Sell America” trade, which pushed investors away from US assets and toward safer bets. Stocks fell and the dollar weakened. At the same time, traders were watching big moves in Japan’s bond market, where yields jumped sharply, increasing pressure on global liquidity. Those bond moves are important because they can force carry trades to unwind, pulling money out of risk assets — including crypto. A Tug Between Liquidity And Safe Havens The sell-off did not happen for only one reason. Reports point to a mix of political shocks, bond-market stress, and a wave of forced liquidations as the main drivers. As cash flowed into safe havens, gold surged to fresh highs while crypto lost ground. Many investors treated Bitcoin like a risky asset in this episode, selling it to cover losses or margin calls elsewhere. Different trackers gave slightly different figures on total market losses and exact liquidations over 24 and 48 hours. That is normal when markets move fast and data is pulled from different exchanges and windows. Still, the broad picture was clear: a fast, leveraged unwind sent prices lower and erased the year’s gains for Bitcoin. Related Reading: Trove’s New Token Craters 95%, Sparking Investor Revolt Markets Will Watch Liquidity And Diplomacy Looking ahead, investors will likely watch three things closely: moves in global bond markets, any escalation or de-escalation around the tariff threats tied to Greenland, and whether forced selling slows. If liquidity conditions calm, risk assets can recover more easily. If they keep tightening, the pressure on crypto and stocks could persist. Featured image from Pexels, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|tariffs|Trump",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57364960,
    "published": 1769017567000,
    "title": "Bitcoin’s Slide Erases Gains Posted Since the Start of the Year",
    "body": "Bitcoin’s Santa Claus rally appears to have come to an end.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57365413,
    "published": 1769019256000,
    "title": "Steak ’n Shake taps Bitcoin bonus program for hourly employees",
    "body": "The fast-food chain said employees will receive a BTC bonus per hour worked, with payouts vesting after two years and limited to company-operated locations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57365354,
    "published": 1769019121000,
    "title": "Farcaster founders step back as Neynar acquires struggling crypto social app",
    "body": "Farcaster raised $150 million by Paradigm and a16z in 2024 but has struggled to sustain growth.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Farcaster|Paradigm|A16z|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57366386,
    "published": 1769022041000,
    "title": "XRP Goes Institutional: Flare Networks Unveils New Infrastructure Support",
    "body": "XRP is taking a decisive step toward institutional relevance as Flare Networks unveils new infrastructure designed to support enterprise-grade financial use cases. For years, XRP has been recognized for its speed and efficiency in cross-border payments, and XRP has often been discussed as a liquidity asset, but with limited programmability and on-chain utility. Flare’s latest move changes that equation, unlocking new layers of functionality that position XRP as more than just a settlement token. How Flare Expands XRP Smart Contract Capabilities Flare Networks is taking concrete steps to activate XRP for institutional-grade financial infrastructure. In a recent Genfinity interview that was revealed on X, the Flare Networks team breaks down how its infrastructure is enabling traditionally idle digital assets, starting with XRP, to participate in a programmable financial system. Related Reading: Ripple Strengthens Market Infrastructure With $150M Investment In LMAX – What This Means For XRP The conversation focuses on execution rather than theory. This includes bringing FXRP live, integrating directly with wallets, custodians, exchanges, and removing technical friction so that participation won’t require users to manage on-chain technical complexity. Flare’s strategy is not about an isolated pilot experiment, but about building durable infrastructure that can scale across different users, assets, and environments. A core design principle is risk abstraction at the protocol level, through platforms like Firelightfi, where exposure is structured, collateralized, allowing larger participants to engage with clearer parameters, predictable outcomes, and stronger operational safeguards. This approach shifts participation from speculative usage toward structured financial activity. The discussion makes it clear that XRP is the first implementation, not the final destination. However, the Flare broader objective is to activate multiple digital assets within a unified framework that prioritizes usability, security, and seamless integration into existing financial workflows. As highlighted in the Genfinity interview, this approach reflects the current stage of digital asset infrastructure, transitioning from experimentation toward real-world execution. What This Means For The Future Of XRP And Tokenized Media Crypto analyst Skipper_xrp has mentioned that SBI Group President Yoshitaka Kitao emphasized that Ripple is no longer just building products; it is creating a full-stack financial ecosystem with XRP and RLUSD integrated into every layer of its infrastructure. Related Reading: Japan’s XRP Integration Signals A Shift In Global Capital Flows The vision is already moving into execution as Ripple Labs has confirmed its collaboration with major Japanese financial institutions to launch a high-profile innovation program aimed at professionalizing the XRP Ledger ecosystem. Meanwhile, BXE Token is preparing to debut on a US-regulated exchange with more than 12 million users and over $900 billion in annual trading volume, alongside compliance coverage across 49 countries. At the same time, decentralized media platforms are preparing for the US market. Featured image from Pngtree, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 122,
        "NAME": "FLR",
        "CATEGORY": "FLR"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57366722,
    "published": 1769023129000,
    "title": "BlackRock’s IBIT powers new bitcoin annuity for U.S. retirees via Delaware Life",
    "body": "The first-of-its-kind FIA, according to the companies, offers crypto exposure with principal protection, aiming to attract cautious investors near retirement.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|BlackRock|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57367162,
    "published": 1769024481000,
    "title": "Bitcoin moves back to $90,000 as Trump pulls tariff threat after 'productive meeting' with NATO chief",
    "body": "\"The solution, if consummated, will be a great one for the U.S. and all NATO nations,\" said President Trump in a Truth Social post.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Trump|Breaking News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57367304,
    "published": 1769024884000,
    "title": "Private credit may be the breakout use case for tokenization: Maple's Sidney Powell",
    "body": "Maple Finance CEO Sidney Powell said blockchain’s biggest opportunity isn’t tokenized Treasury bills or funds — instead, it’s bringing opaque, illiquid private credit markets onchain.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Tokenization|Maple finance|Credit|Exclusive|Consensus Hong Kong 2026|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 57367801,
    "published": 1769026253000,
    "title": "XRP flashes signal that last triggered 68% price drop",
    "body": "A bearish signal from XRP’s cost-basis metric projected a major price drop, fueled by a weakening technical structure and spot ETF outflows. Will bulls defend XRP's critical price support?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57368172,
    "published": 1769027407000,
    "title": "Bitcoin Spike to $90K Boosts Crypto Liquidations Above $1 Billion as Trump Dumps Tariffs",
    "body": "President Trump said Wednesday that he won't impose tariffs related to his quest for Greenland, boosting Bitcoin and stocks in the process.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57368903,
    "published": 1769029562000,
    "title": "Native American Tribes Claim Kalshi Prediction Markets 'Siphon' Money From Casinos",
    "body": "Connecticut tribes said in an amicus brief supporting the state's crackdown on prediction market operators that Kalshi siphons away casino revenue.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57369543,
    "published": 1769031632000,
    "title": "Steak 'n Shake to Pay 'Bitcoin Bonus' to Hourly Employees—Here's How Much",
    "body": "Restaurant chain Steak 'n Shake is expanding its Bitcoin operations, this time with a pay bump for hourly employees paid out in BTC.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57369895,
    "published": 1769032817000,
    "title": "XRP Drops Below $2 as ETF Outflows Spike and Stablecoin Settlement Debate Clouds Outlook",
    "body": "XRP has slipped below the $2 mark, extending a week-long decline that has unsettled traders and renewed questions about the token’s short-term outlook. Related Reading: What the Triple-Tap At $1.80 Means For The XRP Price The drop comes amid heavy outflows from XRP exchange-traded funds (ETFs), broader market weakness tied to U.S. tariff developments, and fresh debate over Ripple’s growing focus on stablecoins for global payments. After briefly recovering to around $2.20 in mid-January, XRP fell as low as $1.85 over the weekend following what market commentators described as a liquidity sweep. XRP's price trends to the downside on the daily chart. Source: XRPUSD on Tradingview XRP ETF Outflows Add to Selling Pressure XRP-linked ETFs recorded their largest daily outflow since launching in November 2025. On January 20, investors pulled roughly $53 million from these products, with the Grayscale XRP ETF accounting for most of the losses. Cumulative net inflows have now fallen back to levels last seen in early January. The outflows mirrored a wider risk-off move across U.S. markets. Bitcoin and Ethereum ETFs also saw heavy redemptions, while only Solana and Chainlink products attracted fresh capital. The sell-off followed renewed concerns over Trump’s tariff threats against Europe and Greenland, which triggered the biggest intraday market drop since October 2025. Technical and On-Chain Signals Remain Weak From a technical standpoint, XRP is trading below key moving averages, including the 50-day and 200-day levels, with resistance forming near the $2 zone. Indicators such as the Percentage Price Oscillator and MACD suggest continued bearish momentum. Analysts note that $1.85–$1.90 is now a critical support range, with further downside possible if selling pressure persists. On-chain data also points to rising stress among longer-term holders. According to Glassnode, investors who bought XRP six to twelve months ago are holding at higher cost bases than recent buyers. This dynamic, similar to patterns seen in early 2022, can encourage selling into small rallies as underwater holders look to exit positions. Stablecoin Focus Raises Questions for XRP Adding to uncertainty is Ripple’s recent emphasis on stablecoins as the future of global settlement. Company president Monica Long has said regulated stablecoins like Ripple USD (RLUSD) are likely to become foundational in global payments over the next five years, particularly in business-to-business transactions. Related Reading: Trove’s New Token Craters 95%, Sparking Investor Revolt While Ripple executives continue to say XRP and the XRP Ledger remain central to the company’s infrastructure, the lack of direct references to the token in recent statements has unsettled some holders. RLUSD’s market capitalization has grown rapidly, and stablecoin activity on the XRP Ledger has increased, but investors are watching closely to see how this translates into sustained demand for XRP itself. Cover image from ChatGPT, XRPUSD chart on Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|xrp|XRP Price|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57369813,
    "published": 1769032470000,
    "title": "Ethereum Sentiment Flips Bearish as Traders Brace for Drop to $2.5K",
    "body": "Bears dominate Ethereum outlook as prediction markets signal 62.5% chance of drop to $2,500, though validator sentiment remains steady long-term.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57369929,
    "published": 1769032965000,
    "title": "Crypto Boom Ahead? Pantera Capital Pinpoints Major Catalysts For 2026 Success",
    "body": "On Wednesday, Pantera Capital, one of the largest venture capital firms in the crypto industry, released its latest blockchain letter. In this edition, the firm reflects on the challenges faced in 2025 while projecting optimism for the remaining months of 2026. Pantera Capital Identifies Growth Catalysts Pantera begins by acknowledging that last year was not fundamentally driven when it came to returns within the crypto markets. It cites macroeconomic factors, market positioning, and structural influences as the main drivers that shaped performance, particularly for assets beyond Bitcoin (BTC). Related Reading: Where Does Hyperliquid (HYPE) Stand Now? A Deep Dive Into Key Metrics Post-2025 The firm highlights several positive developments, including the passage of the GENIUS Act and the rise of digital asset treasuries (DATs). These factors contributed to a more stabilized market sentiment, especially with the onset of Federal Reserve (Fed) rate cuts. However, the firm also describes a challenging fourth quarter in 2025, where a significant selloff on October 10 led to the largest liquidation cascade in crypto history. Despite this and many other setbacks during last year’s performance, Pantera expresses optimism about the future, identifying several catalysts poised to drive growth in the coming months. First and foremost, institutional adoption of blockchain technology continues to expand. Many enterprises are now integrating blockchain into their core offerings, with examples like Robinhood’s tokenized equities and JPMorgan’s initiatives. Moreover, the firm distinguished that there has been a notable drop in barriers to entry for major financial players into the crypto market, including sovereign reserves and large asset management firms. Crypto Sectors Set To Rise In 2026 Pantera Capital also explored specific sector predictions for 2026. They anticipate that Real-World Assets (RWAs) will take off. They expect that treasuries and private credit could double, with tokenized stocks and equities experiencing rapid growth as well. The firm further forecasts that prediction markets will attract acquisition interest as they consolidate around institutional infrastructure. The demand for sports-focused platforms is also expected to grow, expanding their presence in the market. Related Reading: Bitcoin Bear Market Depths: A Closer Look At How Low BTC Could Go In terms of banking innovation, ten major banks are reportedly exploring the issuance of a consortium stablecoin pegged to G7 currencies, which could provide a compliant and risk-managed way for people and institutions to utilize digital currencies. The macro perspective remains positive as well, with a significant percentage of Bitcoin now held by public companies, exchange-traded funds (ETFs), and nations, indicating a shift towards compliance and institutional investment in the crypto market. Finally, Pantera asserts that 2026 is poised to be a landmark year for Initial Public Offerings (IPOs) in the digital asset space. Following a significant uptick in 2025, expectations for further growth in crypto-friendly listings are high, as companies look to tokenize assets and expand their portfolios. Featured image from DALL-E, char from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|bitcoin|btc|BTCUSDT|crypto|Crypto forecast 2026|crypto market|crypto news|Crypto Predictions|Crypto Predictions 2026|cryptocurrency|pantera capital",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57371071,
    "published": 1769036309000,
    "title": "BlackRock: Ethereum Is Anchoring Wall Street's Tokenization Race",
    "body": "The Ethereum network underpins 65% of tokenized assets, BlackRock said in its 2026 thematic outlook.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57371070,
    "published": 1769036247000,
    "title": "What Bubble? Nvidia CEO Says AI Needs Trillions More in Investments",
    "body": "Nvidia's CEO told the World Economic Forum that AI infrastructure needs trillions more in investment to avoid a bubble collapse—even as fears mount that the industry is already overheating.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      }
    ]
  },
  {
    "id": 57371665,
    "published": 1769038241000,
    "title": "Ethereum Loses Structure After $3,220 Rejection — Is This Distribution Or Just The First Crack?",
    "body": "Ethereum has taken a sharp turn after facing a firm rejection at the $3,220 level, with price breaking structure and slipping into a weaker posture. The speed of the drop and lack of strong buying interest raise an important question for traders: Is this merely an early warning sign within a broader uptrend, or the start of a deeper distribution phase that could pressure ETH further in the near term? Rejection At $3,220 Signals Distribution, Not A Shakeout Crypto analyst PEPE is Friend highlighted that Ethereum’s sharp rejection at the $3,220 level was deliberate rather than random. The drop was clean, with key structure breaking down, selling pressure accelerating, and price quickly flushing toward the $3,106 area, aligning with a classic distribution behavior rather than a simple shakeout. Related Reading: Ethereum Poised For $4,000 Breakout? Expert Pinpoints On-Chain Triggers For Potential Rally Assessing the current price reaction, there are still no signs of a true reversal. The bounce has been notably weak, trading volume remains thin, and buyers have yet to show a strong commitment. Instead of signaling renewed bullish momentum, the move higher appears to be a technical pullback within a broader weakening structure. The key technical zone remains well-defined. ETH is trading below the former support band between $3,170 and $3,200. As long as the price stays below this range, any upside move is likely to be viewed as a selling opportunity rather than the start of a sustained recovery. When this price action is viewed alongside Ethereum spot ETF data, the picture becomes clearer. While ETF flows remain positive daily, they lack strong momentum or a standout confirmation day. Capital appears to be absorbed rather than aggressively deployed, suggesting institutional demand is not yet strong enough to drive a decisive breakout. Until that changes, sellers are expected to remain in control below the $3,170–$3,200 resistance zone. Ethereum Slips Below $3,062 As Bears Regain Short-Term Control In an X post, Kamile Uray noted that Ethereum has closed below the $3,062 level, shifting attention toward the next major downside zone at $2,623. This level is now critical, as holding above it could allow ETH to stabilize and attempt another recovery move. Related Reading: Ethereum Maintains Structural Strength Despite Resistance Near $3,400 On the upside, a clean break above the pink-box resistance near $3,445 would activate bullish formations such as a cup-and-handle or an ascending triangle, opening the door for a move toward the $3,894 area. Further strength would be confirmed if ETH manages to close above the $3,661 high, which would mark the first higher high on the daily chart relative to the previous downtrend, improving the bullish outlook. Still, $3,894 remains a key level, as it aligns with the 0.618 Fibonacci retracement of the last decline. On the downside, a clear break below the $2,623 low would expose ETH to deeper losses, with the $2,274–$2,104 zone emerging as the next major support area. This region hosts a potential bullish “Libra” reversal setup, and Ethereum could once again attempt a bounce toward its previous all-time high if reversal confirmation appears there. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum|Ascending Triangle Formation|Cup and Handle Pattern|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|Ethereum Spot ETF|ethusd|ETHUSDT|Kamile Uray|PEPE is Friend",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 93,
        "NAME": "PEPE",
        "CATEGORY": "PEPE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57371646,
    "published": 1769038092000,
    "title": "Expect AGI Within a Few Years, Says Anthropic CEO—and Job Losses Too",
    "body": "Advances toward human-level AI are accelerating, raising risks of disruption to jobs and institutions, industry leaders said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57373138,
    "published": 1769042748000,
    "title": "UN receives Circle grant to upgrade cross-border refugee aid",
    "body": "Circle said digital financial infrastructure, including stablecoins, can save 20% of the cost of delivering humanitarian aid.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57373377,
    "published": 1769043518000,
    "title": "Crypto bill likely delayed for weeks by Banking Committee after Coinbase pulled its support",
    "body": "The momentum for new crypto rules in Washington has slowed to a crawl and and it is not expected to resume for at least several weeks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Breaking News|Policy|Senate|Market Structure Legislation|crypto legislation|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57374553,
    "published": 1769046183000,
    "title": "BitGo Is Said to Price US IPO at $18 Per Share, Above Range",
    "body": "BitGo Holdings Inc. priced its initial public offering at $18 per share, above the marketed range, according to people familiar with the matter.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 57374873,
    "published": 1769047829000,
    "title": "Crypto bill could see delays as Senate focuses on affordability: Report",
    "body": "The Senate Banking Committee is backing Donald Trump’s move to bar institutions from buying family homes, which could delay the market structure bill, Bloomberg reports.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 57374941,
    "published": 1769048240000,
    "title": "Bitcoin Price Defends Support As Traders Question Next Upside Push",
    "body": "Bitcoin price started a fresh decline below $89,500. BTC is consolidating losses and might attempt a recovery wave if it clears $92,000. Bitcoin started another drop below $90,000 and $89,000. The price is trading below $90,500 and the 100 hourly Simple moving average. There are two bearish trend lines forming with resistance at $90,300 and $93,000 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move down if it stays below the $92,000 zone. Bitcoin Price Dips To New Weekly Lows Bitcoin price failed to stay above the $91,000 support and started a fresh decline . BTC declined sharply below the $90,000 and $89,500 support levels. The bears even pushed the price below $88,000. A low was formed at $87,200, and the price is now consolidating losses. There was a minor recovery wave above $89,200 and the 23.6% Fib retracement level of the recent decline from the $95,475 swing high to the $87,200 low. Bitcoin is now trading below $90,500 and the 100 hourly Simple moving average . If the price remains stable above $88,000, it could attempt a fresh increase. Immediate resistance is near the $90,500 level. Besides, there are two bearish trend lines forming with resistance at $90,300 and $93,000 on the hourly chart of the BTC/USD pair. The first key resistance is near the $91,000 level. The next resistance could be $91,350 or the 50% Fib retracement level of the recent decline from the $95,475 swing high to the $87,200 low. A close above the $91,350 resistance might send the price further higher. In the stated case, the price could rise and test the $93,000 resistance. Any more gains might send the price toward the $94,000 level. The next barrier for the bulls could be $95,000 and $95,500. Another Decline In BTC? If Bitcoin fails to rise above the $91,350 resistance zone, it could start another decline. Immediate support is near the $89,150 level. The first major support is near the $88,000 level. The next support is now near the $87,200 zone. Any more losses might send the price toward the $86,500 support in the near term. The main support sits at $85,500, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $89,150, followed by $88,000. Major Resistance Levels – $91,350 and $92,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57375250,
    "published": 1769049001000,
    "title": "US stocks, crypto creep up as Trump calls off Greenland-linked tariffs",
    "body": "The S&P 500 climbed, crypto stocks were mixed and Bitcoin and Ether posted modest gains on Wednesday after Donald Trump called off his recent tariff threat.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57375685,
    "published": 1769050458000,
    "title": "X to roll out 'Starterpacks' featuring Bitcoin and crypto's top posters",
    "body": "X head of product Nikita Bier said the feature will launch in a few weeks, and already has over 1,000 pre-made \"packs\" of accounts to follow in each interest category — such as memecoins trading and crypto.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57376237,
    "published": 1769052286000,
    "title": "Bank lobby targets stablecoin yield and open banking in policy push",
    "body": "The American Bankers Association’s latest priorities aim to limit how digital dollars earn returns and how financial data is shared as lawmakers debate U.S. crypto market structure legislation.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Stablecoin|Banking Regulation|banking|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57376905,
    "published": 1769054097000,
    "title": "BitGo prices IPO at $18, pitching custody growth over crypto trading swings",
    "body": "With recent listings underperforming the CoinDesk 20, BitGo is positioning itself as a rare pure play on institutional crypto custody and long term adoption.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|BitGo|IPO|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57377287,
    "published": 1769055489000,
    "title": "XRP Price Recovery Meets Strong Resistance, Upside Under Threat",
    "body": "XRP price started a recovery wave above $1.950 but failed near $2.00. The price is now showing a few bearish signs and might decline below $1.920. XRP price started a recovery wave above the $1.950 zone. The price is now trading below $2.00 and the 100-hourly Simple Moving Average. There is a bearish trend line forming with resistance at $2.00 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move down if it settles below $1.920. XRP Price Faces Key Hurdle XRP price remained supported above $1.8650 and started a recovery wave, like Bitcoin and Ethereum . The price was able to climb above $1.90 and $1.920 to enter a short-term positive zone. There was also a move above the 50% Fib retracement level of the downward move from the $2.028 swing high to the $1.868 low. The price even spiked above $1.980 before the bears appeared. The bulls failed to clear the $2.00 resistance. There is also a bearish trend line forming with resistance at $2.00 on the hourly chart of the XRP/USD pair. The price is now trading below $2.00 and the 100-hourly Simple Moving Average. If there is a fresh upward move, the price might face resistance near the $1.990 level or the 76.4% Fib retracement level of the downward move from the $2.028 swing high to the $1.868 low. The first major resistance is near the $2.00 level. A close above $2.00 could send the price to $2.0650. The next hurdle sits at $2.10. A clear move above the $2.10 resistance might send the price toward the $2.150 resistance. Any more gains might send the price toward the $2.20 resistance. The next major hurdle for the bulls might be near $2.250. Another Drop? If XRP fails to clear the $2.00 resistance zone, it could start a fresh decline. Initial support on the downside is near the $1.920 level. The next major support is near the $1.90 level. If there is a downside break and a close below the $1.90 level, the price might continue to decline toward $1.8650. The next major support sits near the $1.820 zone, below which the price could continue lower toward $1.750. Technical Indicators Hourly MACD – The MACD for XRP/USD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $1.920 and $1.90. Major Resistance Levels – $2.00 and $2.065.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57378115,
    "published": 1769058003000,
    "title": "‘I’m Very Bullish’: Ripple CEO Forecasts Record Performance For Crypto In 2026",
    "body": "Despite a mixed performance in the early weeks of 2026, Ripple CEO Brad Garlinghouse remains optimistic about the future of crypto markets, predicting new record highs for digital assets this year. Ripple CEO Optimistic About Long-Term XRP Potential Speaking at the World Economic Forum in Davos, Switzerland, Garlinghouse noted that recent regulatory developments, including the landmark GENIUS Act, have “unlocked a lot of activity” in the sector. Related Reading: Bitcoin Bear Market Depths: A Closer Look At How Low BTC Could Go When asked about crypto performance during an interview with CNBC, Garlinghouse confidently stated, “I’m very bullish, and yes, I’ll go on record as saying, I think we’ll see an all-time high.” He emphasized that major financial institutions are increasingly showing interest in cryptocurrencies, labeling this shift as a “massive sea change.” However, he believes that this development is not fully reflected in current market prices. Despite his optimistic outlook, XRP, Ripple’s associated cryptocurrency, was trading at $1.88 and had experienced a notable 13% decline over the past week. The current market performance has led analysts to speculate about the possibility of a new bear market on the horizon. Nonetheless, he expressed confidence in the long-term potential of the XRP ecosystem, stating, “We are a very vested party in what goes on in the XRP ecosystem. In another five or 10 years, you’re going to see continued, very positive momentum.” Garlinghouse Confident CLARITY Act Will Pass Garlinghouse also anticipated that 2026 would see significant use cases for digital assets, mentioning that cryptocurrency exchange Binance is likely to re-enter the US market. He asserted that the GENIUS Act would facilitate the growth of stablecoins, potentially making operations like payroll more efficient. He believes cryptocurrencies are well-positioned for growth over the next decade. Regarding the crypto market structure bill, or the CLARITY Act, a vital framework for regulating crypto, Garlinghouse voiced confidence that it will eventually succeed. “It’ll get done. We are as close as we have ever been,” he said. However, the proposed market structure bill has encountered significant challenges, particularly after key provisions came under scrutiny. Coinbase CEO Brian Armstrong withdrew support for the bill just 24 hours before an anticipated markup scheduled for January 15, leading to a postponement of the process. Related Reading: Where Does Hyperliquid (HYPE) Stand Now? A Deep Dive Into Key Metrics Post-2025 Garlinghouse was taken aback by Armstrong’s strong opposition to the CLARITY Act, noting that “the rest of the industry, including exchanges that compete with Coinbase, were still supporting it.” The executive claimed that he still remains hopeful that industry leaders can navigate the current legislative impasse. “If we want the industry to continue to grow, we need things like the GENIUS Act and the CLARITY Act,” he affirmed. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ripple|CLARITY Act|crypto|crypto market|Crypto Market Structure Bill|crypto news|cryptocurrency|Genius Act|Ripple Brad Garlinghouse|Ripple CEO|Ripple CEO Crypto Forecast|ripple news|xrp|xrp news|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57378372,
    "published": 1769058623000,
    "title": "Columbia professor says NYSE tokenization plan reads like 'vaporware'",
    "body": "NYSE unveiled a plan on Monday to enable blockchain-based 24/7 trading and instant settlement of stocks and ETFs, in addition to custody features.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 57378281,
    "published": 1769058506000,
    "title": "Solana (SOL) Recovery At Risk With Bears Guarding Resistance",
    "body": "Solana failed to settle above $140 and nosedived. SOL price is now consolidating losses below $135 and might struggle to start a recovery wave. SOL price started a fresh decline below $136 and $135 against the US Dollar. The price is now trading below $135 and the 100-hourly simple moving average. There is a key bearish trend line forming with resistance at $138 on the hourly chart of the SOL/USD pair (data source from Kraken). The price could start a recovery wave if the bulls defend $128 or $125. Solana Price Dips Further Solana price failed to remain stable above $140 and started a fresh decline, like Bitcoin and Ethereum . SOL declined below the $138 and $135 support levels. The price gained bearish momentum below $132. A low was formed at $124, and the price is now consolidating losses. The price recovered a few points and climbed above the 23.6% Fib retracement level of the downward move from the $143 swing high to the $124 low. Solana is now trading below $135 and the 100-hourly simple moving average. On the upside, immediate resistance is near the $134 level or the 50% Fib retracement level of the downward move from the $143 swing high to the $124 low. The next major resistance is near the $136 level. The main resistance could be $138. There is also a key bearish trend line forming with resistance at $138 on the hourly chart of the SOL/USD pair. A successful close above the $138 resistance zone could set the pace for another steady increase. The next key resistance is $144. Any more gains might send the price toward the $150 level. Another Decline In SOL? If SOL fails to rise above the $133 resistance, it could continue to move down. Initial support on the downside is near the $129 zone. The first major support is near the $125 level. A break below the $125 level might send the price toward the $120 support zone. If there is a close below the $120 support, the price could decline toward the $112 support in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is losing pace in the bearish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is above the 50 level. Major Support Levels – $129 and $125. Major Resistance Levels – $133 and $138.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Technical analysis|Sol|Solana|solbtc|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57379184,
    "published": 1769061244000,
    "title": "Bitcoin swings trigger rare split liquidation as longs and shorts both get hit",
    "body": "Nearly equal losses across long and short positions showed traders were wrong-footed as crypto prices swung violently within hours.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57379565,
    "published": 1769062338000,
    "title": "Thailand plans crypto ETF rules as institutional interest increases",
    "body": "Thailand’s SEC is planning new crypto ETF and futures trading regulations as the country looks to position itself as a regional crypto hub for institutions.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57379417,
    "published": 1769061673000,
    "title": "Saga pauses chainlet after $7M exploit that depegged its stablecoin",
    "body": "Saga’s US dollar-pegged stablecoin has dropped to $0.75, while the protocol's total value locked has fallen by around 55% over the past 24 hours.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  }
]