[
  {
    "id": 57182808,
    "published": 1768469575000,
    "title": "Bitcoin ETFs post record 2026 inflows as BTC rallies above $97K",
    "body": "Spot Bitcoin ETFs attracted over $1.7 billion in a three-day streak as BTC hit two-month highs and sentiment turned bullish.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57183546,
    "published": 1768472119000,
    "title": "Bitcoin sees key bottom signal as BTC eyes unique $101K bear market reclaim",
    "body": "Bitcoin leading indicators stayed bullish for BTC price action, with $101,000 of key importance as a resistance reclaim area next.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57183484,
    "published": 1768471759000,
    "title": "LSEG brings commercial bank money onto blockchain rails with DiSH",
    "body": "The London Stock Exchange's new Digital Settlement House uses tokenized bank deposits for instant, round-the-clock settlement across blockchain and traditional payment networks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 57184312,
    "published": 1768474469000,
    "title": "Sygnum sees tokenization and state Bitcoin reserves taking off in 2026",
    "body": "Sygnum predicts US crypto regulation could spur sovereign Bitcoin reserves and accelerate tokenized bond issuance by major financial institutions in 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57184390,
    "published": 1768473992000,
    "title": "Post-quantum crypto startup Project Eleven raises $20 million in funding round",
    "body": "The Series A round was led by Castle Island Ventures with participation from Coinbase Ventures.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|quantum computing|Series A|Fundraising|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57184980,
    "published": 1768476616000,
    "title": "XRP Price Is Approaching A Key Decision Zone, But Structure Is Still Firmly Bullish",
    "body": "Market analyst Egrag Crypto said the XRP price structure remains largely bullish despite the cryptocurrency’s recent struggles to break above $2. The analyst has presented a chart analysis showing XRP slowly approaching a key decision zone that could determine its next upward move and push it firmly out of its current consolidation. XRP Price Structure Still Bullish On Wednesday, January 14, Egrag Crypto said the XRP 3-day chart shows obvious, strong signals. He stated that XRP remains structurally bullish despite experiencing long periods of consolidation following its last rebound above $2 this year. According to the analyst, XRP’s price is currently compressing within a descending channel as it moves closer to a key decision zone between $2.30 and $2.40. He explained that this type of compression often appears after a strong move and can lead to a larger price expansion. Related Reading: Bitcoin Price Crash To $57,000: The Bullish Path That Could End In Tears In his post on X, Egrag Crypto shared key trends he observed on XRP’s 3-day chart. He revealed that the 50 Exponential Moving Average (EMA) has begun to flatten, indicating that selling pressure for XRP may be easing. At the same time, the 200 EMA continues to move higher, supporting the analyst’s opinion that the macro trend for XRP is still bullish. Egrag Crypto also emphasized that XRP is holding above the EMA cluster, a sign of structural strength rather than weakness. He highlighted that the upper boundary of the descending channel aligns precisely with the critical resistance areas at $2.3, marked by a red line on the chart. As these four developments occur simultaneously on the XRP chart, Egrag Crypto shared insights into their potential price impacts. He stated that a clean 3-day close above $2.40 would likely confirm XRP’s breakout from the descending channel. Based on the chart structure, he added that such a move could open the door for a continuation toward the $2.70 and $3.13 levels. If XRP is rejected at the channel’s resistance, Egrag Crypto has said that the price would likely remain range-bound. He concluded his analysis by emphasizing that as long as XRP continues trading above $2.0, its bullish structure will remain intact, and this ongoing consolidation phase should be seen as a period of compression ahead of a potential major price expansion. Related Reading: This Ethereum Triangle Breakout Puts Price Above $24,000, Here’s The Path Chart Signals Potentially Deeper Downtrend In Egrag Crypto’s chart, the lower boundary of the descending channel touches a key support area, marked by a white line. This could mean that if XRP fails to hold $2 and even drops below it, it could invalidate the analyst’s bullish thesis and trigger a decline toward the next support level at $1.65, representing a roughly 17.5% drop from current prices. If price falls further below $1.65, XRP could crash toward the last highlighted support level just around $1.0, reflecting an approximately 50% decrease from around $2.1. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Ripple|ripple news|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57184872,
    "published": 1768476000000,
    "title": "Bitcoin’s $100K comeback hinges on $98K breakout and spot demand",
    "body": "A pickup in Bitcoin spot demand and persistent spot ETF inflows could push BTC above the next significant hurdle at $98,000 and secure a sustained recovery.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57184972,
    "published": 1768475545000,
    "title": "Crypto Firms Buoyed by Trump Get Rocked as Crucial Bill Delayed",
    "body": "The unbridled optimism that permeated the crypto industry during Donald Trump’s first year back in power is giving way to angst, after a much-awaited digital-asset bill was delayed in the Senate amid frenzied debate over the treatment of stablecoins.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NMS:COIN",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57185296,
    "published": 1768477617000,
    "title": "Bitcoin spot demand builds as short squeeze risk increases",
    "body": "Onchain and derivatives data point to a healthier bitcoin price advance in early 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Futures|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57185257,
    "published": 1768477299000,
    "title": "Indian crypto platforms push for tax rethink ahead of February budget",
    "body": "Industry leaders say transaction-level taxes and loss restrictions are draining liquidity as India tightens crypto compliance and enforcement.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57185327,
    "published": 1768477649000,
    "title": "Societe Generale works with Swift to settle tokenize bonds using cash and stablecoins",
    "body": "The bank’s digital asset division SG-FORGE used its MiCA-compliant EUR CoinVertible stablecoin.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|SocGen|Stablecoins|SWIFT|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57186108,
    "published": 1768480235000,
    "title": "Russia Drafts Bill That Could Change Who Can Buy Crypto",
    "body": "Russia is preparing a landmark legal transformation that would expand who are qualified to buy and own cryptocurrencies in the country. Reports have disclosed that lawmakers in the State Duma are in the final phase of text meant to lower barriers for ordinary Russians, even as they keep safeguards and restrictions in place. Related Reading: Bitcoin’s New Power Buyers: Companies Bought 3 Times What Miners Produced The draft bill has drawn attention because it marks a shift from years of strict limits. According to TASS, the proposal would take cryptocurrencies out of a special financial regulation regime so they become a more common part of financial life for people across Russia. Lawmakers say this could make buying and holding crypto something regular citizens do, instead of a privilege for a few. “A bill has already been prepared that removes cryptocurrencies from special financial regulation, which means, they will be a common occurrence in our lives,” Anatoly Aksakov, chair of the State Duma’s Financial Market Committee, said. Expanded Access With Caps Under the current text, people who are not considered “qualified investors” would be able to buy digital coins up to a certain limit. The figure mentioned is 300,000 rubles per year, which is roughly $3,800. This cap aims to let more Russians participate in crypto while trying to prevent big losses if prices swing wildly. Ordinary buyers would still face conditions. Reports say they will have to meet some basic criteria or checks before gaining access, such as passing a short risk‑awareness step and trading only through licensed brokers or exchanges. This is meant to keep unregulated peer‑to‑peer trading from dominating. Professional or qualified market players would face fewer limits. They could trade and hold a wider range of cryptocurrencies with no annual restrictions, though they may still have to demonstrate understanding of risks. Legislative Push And Timing Lawmakers have said the draft is ready and will be discussed during Russia’s spring parliamentary session. If the State Duma passes the bill, implementation could start later in 2026. Aksakov told state media that this move could make crypto “a normal part of life” for many Russians. At the same time, Russian regulators continue to work on other crypto rules. The Bank of Russia has said it plans to set out penalties for illegal crypto intermediaries starting in 2027 and is pushing for a wider regulatory framework that covers both qualified and ordinary investors. Related Reading: Ethereum Could Surge To $7,500 And Leave Bitcoin Behind, Banking Giant Says Balancing Risk And Use Russia still bans using cryptocurrencies to pay for goods and services within the country, a rule in place since 2021. Officials say the new bill would not change that. Instead, the focus is on investment and holding, not daily spending. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|bitcoin|crypto|digital currency|russia",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57186341,
    "published": 1768480865000,
    "title": "Short squeeze hits top 500 cryptos as traders unwind bearish bets",
    "body": "Crypto markets saw the largest short squeeze since October as short positions were liquidated and Bitcoin outperformed the US dollar amid geopolitical uncertainty.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57186198,
    "published": 1768480200000,
    "title": "Universal blockchains buckle under real-world demands",
    "body": "General-purpose blockchains can’t solve industry disputes over construction changes or equipment usage. Specialized layer 1s are optimized for stateless audit trails and regulatory compliance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57186856,
    "published": 1768482671000,
    "title": "Tom Lee's Bitmine invests $200 million in billionaire YouTube star MrBeast’s company",
    "body": "The investment gives Bitmine a stake in a brand with strong Gen Z and millennial appeal, reaching over 450 million subscribers across its YouTube channels.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Bitmine|YouTube|Crypto|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57187492,
    "published": 1768484635000,
    "title": "SWIFT trials euro stablecoin in tokenized bond payments with SG-Forge",
    "body": "Societe Generale-Forge said its EUR CoinVertible stablecoin is the first MiCA-compliant digital asset that is “natively compatible” with SWIFT’s interoperability capabilities.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57187343,
    "published": 1768484031000,
    "title": "Galaxy closes first $75M blockchain-based loan deal on Avalanche",
    "body": "Galaxy Digital has completed its first tokenized CLO, using blockchain infrastructure to bring private credit and crypto-backed loans onchain.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57187792,
    "published": 1768485600000,
    "title": "Stablecoins and self-custody are driving the rise of crypto neobanks",
    "body": "For years, crypto’s most ambitious builders focused on blockchains’ plumbing. But a growing number of projects are now stepping away from the base layer and focusing on payments and neobank-like services.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57187793,
    "published": 1768485600000,
    "title": "Lower volatility, bigger allocations: Ark Invest sees bitcoin entering its next chapter",
    "body": "With ETFs and corporate treasuries absorbing more bitcoin than expected, the market is entering a more institutional, lower-volatility era.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|ARK Invest|Bitcoin News|Exclusive|Bitcoin ETF|Digital Asset Treasury|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57187988,
    "published": 1768485946000,
    "title": "MrBeast Nabs $200 Million Investment from Tom Lee’s Bitmine",
    "body": "Bitmine Immersion Technologies Inc., the largest corporate holder of the cryptocurency Ether and chaired by Fundstrat’s Tom Lee, said it will invest $200 million for a stake in Beast Industries, the private company behind YouTube star Jimmy “MrBeast” Donaldson.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57188958,
    "published": 1768489204000,
    "title": "Analyst Says XRP Price Just Entered Neutral State – What This Means",
    "body": "A crypto analyst has announced that the XRP price has just entered a neutral state and could be gearing up for a major rally. He explains how this phase has historically appeared before strong rallies and outlines what the current market structure may signal for XRP moving forward. XRP Price Enters Neutral State Before Bull Rally Crypto expert and data analyst CW recently shared a fresh update on XRP’s price action, noting that the cryptocurrency has broken out from its bottom and moved into a neutral state. He said this shift marks the early stage of a larger bull rally, with a decisive move above the previous all-time high acting as the key signal for price acceleration. Related Reading: XRP Analyst Says This Is What They Aren’t Showing You, ‘Don’t Get Shaken Out’ The chart he shared shows XRP following a repeated four-phase pattern across multiple market cycles, first from 2014 to 2018 and again from 2017 to date. In the 2014 cycle, Phase 1 began with a sharp breakout to TP1, setting a new ATH. From that peak, XRP entered Phase 2, which formed a Symmetrical Triangle. During this phase, XRP moved sideways within a tightening range for several months. Phase 3 came next, marking a long consolidation period for XRP. Eventually, XRP’s price broke the upper boundary of the symmetrical triangle and entered Phase 4. In this final phase, XRP surged to TP2, reaching a second ATH at the 6.618 Fibonacci extension level. According to the chart, XRP has already completed Phases 1-3 in the current cycle and has entered Phase 4. After hitting its first peak around $3.5 (TP1) earlier in 2025, the cryptocurrency recently broke above the upper boundary of a similar Symmetrical Triangle pattern, entering a “neutral state.” Now that XRP has reached this state, CW noted that it has entered Phase 4, the final stage of the four-phase historical pattern. The analyst has projected a second new all-time high for XRP near $21.5, aligning with the 6.618 Fibonacci extension level from the 2014 cycle. How Momentum Indicators Reacted During Each Phase At the bottom of CW’s price chart is a Stochastic Oscillator and a Moving Average Convergence Divergence (MACD) histogram. The stochastic shows overbought and oversold conditions for each cycle. Related Reading: Analyst Breaks Down Why Investors Will Make More Money With XRP Than Bitcoin In Phase 2 of each cycle, the stochastic frequently hits oversold levels, which align with the extended consolidation and price decline observed in that period. During Phase 3, it stays around the middle range, reflecting a neutral state. Finally, in Phase 4 of the 2014 cycle, it spikes toward overbought levels, coinciding with strong price breakouts. Meanwhile, the MACD histogram mirrors momentum shifts in each phase. During Phase 1, the histogram shows strong positive bars during the initial breakout. Phase 2 saw negative bars as the price declined, signaling bearish momentum. After this, Phase 3 showed small, fluctuating bars, indicating low momentum. Lastly, in Phase 4, the histogram rapidly expands on the breakout, pushing its price to new ATHs in 2014. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|CW|MACD Histogram|Moving average convergence divergence|Ripple|Stochastic Oscillator|Symmetrical Triangle Pattern|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57188988,
    "published": 1768489146000,
    "title": "JPMorgan sees 2026 crypto inflows topping the $130 billion hit in 2025",
    "body": "The bank said global capital moving into digital assets hit a record last year and is poised to grow further as institutional investors return.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|JPMorgan|Bitcoin News|Institutional Adoption|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57189223,
    "published": 1768490073000,
    "title": "Michael Saylor's Strategy still has major upside despite 2025 plunge, says TD Cowen",
    "body": "Strategy remains an effective proxy for bitcoin exposure, particularly for investors with a long-term view, analyst Lance Vitanza said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Strategy|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57189123,
    "published": 1768489688000,
    "title": "Bank of America CEO says stablecoins could drain trillions in bank deposits",
    "body": "BofA CEO Brian Moynihan echoed other banks in warning that $6 trillion in bank deposits were at stake, even as he said the bank will “be fine.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Bank of America|JPMorgan|American Bankers Association|Stablecoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 57189144,
    "published": 1768489670000,
    "title": "Crypto Wallet MetaMask Adds Tron Support Following Bitcoin, Solana Expansions",
    "body": "MetaMask continues adding chains as it expands beyond Ethereum, adding Tron support Thursday following last month’s Bitcoin move.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57189090,
    "published": 1768489624000,
    "title": "Crypto bill delay 'may ultimately be constructive' for final product, Benchmark says",
    "body": "Delayed markups could give Congress time to resolve issues that may determine how, and whether, institutions fully enter U.S. crypto markets, broker Benchmark said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|crypto regulation|Market Structure Legislation|Benchmark|Stablecoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57189375,
    "published": 1768490100000,
    "title": "These three XRP charts hint at a price rally toward $2.80",
    "body": "XRP’s technical and onchain signals hint at a bullish breakout, with bulls eyeing a significant rally toward $2.80 by the month’s end.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57189688,
    "published": 1768491388000,
    "title": "DeadLock Ransomware Using Polygon Smart Contracts to Evade Detection",
    "body": "The ransomware family’s abuse of Polygon smart contracts echoes techniques recently seen in Ethereum-based attacks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|polygon|Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 38,
        "NAME": "MATIC",
        "CATEGORY": "MATIC"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57189646,
    "published": 1768491024000,
    "title": "State Street Is Joining Crypto Rush With Digital-Asset Rollout",
    "body": "State Street Corp. is rolling out a suite of tokenized products as the firm pushes to grow in the increasingly popular asset class.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "NYS:STT",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57190076,
    "published": 1768492800000,
    "title": "Crypto for Advisors: Blockchain’s Impact on Government",
    "body": "The CLARITY Act, expected to clarify digital asset rules, will enable blockchain to bring real-time transparency to government operations and public spending.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "CoinDesk Indices|Financial Advisors|Clarity Act|CoinDesk Indices|Crypto for Advisors|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57189915,
    "published": 1768492276000,
    "title": "Galaxy Digital stock rises 4% after Texas grid operator approves data center expansion",
    "body": "The expansion supports Galaxy's AI and high-performance computing plans, with construction underway on the first phase.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Galaxy Digital|Texas|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 57189881,
    "published": 1768492119000,
    "title": "Bitcoin slides below $96,000 as key crypto bill stalls in Congress",
    "body": "After a brief reprieve, crypto returned to selling off during U.S. market hours on Thursday.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Market Wrap|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57190371,
    "published": 1768493557000,
    "title": "Elon Musk's X Bans Access to ‘InfoFi’ Crypto Projects Amid ‘AI Slop’ Backlash",
    "body": "X is making major changes to its API to prevent access by \"InfoFi\" crypto projects that seek to incentivize \"reply spam,\" an exec said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57190697,
    "published": 1768494659000,
    "title": "Bitcoin Rally Reflects Buyer Conviction On Coinbase Spot Markets, Bull Run Back On?",
    "body": "The recent Bitcoin rally may be driven by real spot demand on Coinbase. Data indicating elevated spot activity on Coinbase suggests that this move higher is bolstered by direct purchases rather than leveraged positioning in derivatives markets. This distinction matters because Spot buying reflects a real capital commitment, not a temporary bet. Why Risk Management When Demand Is Structural The Bitcoin rally since Sunday’s Powell subpoena news has been largely linked to Coinbase spot buyers. Crypto trader Alex Krüger has highlighted on X that both the Adjusted Coinbase Premium and Cumulative Volume Delta (CVD) show steady spot accumulation, which is exactly why this has been a true hated rally even among bitcoiners. For over a month, the dominant narrative in every crypto chat room has been that BTC is lagging while equities and commodities are moving upward. Related Reading: Analyst Outlines The Bulllish And Bearish Scenarios For Bitcoin – Here’s What To Know However, the fun fact is that equities are not accurate, but 40% of the S&P 500 (Standard & Poor’s 500) stocks have actually closed red in 2025, (39.2% to be precise). Perception is doing a lot of work here, and the United States Department of Justice (DOJ) move on Powell represented a major macro litmus test for BTC. Kruger claims that the BTC long-term value proposition is about protecting against the tail risk of central bank profligacy. On Monday, BTC surged upward, although the move was just a little surge. According to Krüger, the BTC key battlefield remains the 50-week moving average (WMA), which is currently around $101,420. Meanwhile, the trader is looking to take some profits into short liquidations right above the $100,000 mark. Why Bitcoin Benefits First From Institutional Flows The Digital Asset Market Clarity Act is set for markup today, January 15th, 2026, in the Senate Banking Committee. According to the update by BTC_road_to200k on X (Formally Twitter), this is where the lawmakers will debate and shape the final version of the bill before it moves forward. Related Reading: Bitcoin Price Stays Pinned Above Support, Setting Up a Bigger Move This matters because the art aims to clear up the ongoing regulatory uncertainty between the Securities and Exchange Commission (SEC) and the Commodity Futures Trading Commission (CFTC), which has been a major source of hesitation for large institutional players looking to move into Bitcoin and other digital assets. Furthermore, the Clarity Act will be a turning point as it aims to clear rules that will bring more confidence to banks, pension funds, and large investors, which often translates into higher demand and stronger price momentum for BTC. As the regulatory clouds lift, the market might start experiencing a renewed wave of institutional money flowing in, and that’s obviously bullish for BTC. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|Adjusted Coinbase Premium|Alex Kruger|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|BTC_road_to200k|btcusd|BTCUSDT|cftc|CLARITY Act|coinbase|Commodity Futures Trading Commission|cumulative volume delta|CVD|doj|S&P 500|sec|Securities and Exchange Commission|Standard & Poor’s 500|United States Department of Justice",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57190749,
    "published": 1768494742000,
    "title": "MrBeast Eyes DeFi as Tom Lee's Ethereum Treasury BitMine Invests $200 Million",
    "body": "BitMine Immersion Technologies unveiled a $200 million investment in Beast Industries, a company founded by YouTube creator MrBeast.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57191249,
    "published": 1768496449000,
    "title": "Chainlink, Cardano and Stellar Futures Begin Trading on CME Next Month",
    "body": "CME Group plans to launch Cardano, Chainlink, and Stellar futures on February 9, pending approval.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57191323,
    "published": 1768496343000,
    "title": "Bitcoin’s renewed push to $100K sparked by fresh institutional demand",
    "body": "Sustained US Bitcoin ETF inflows are supporting prices near $97,000, raising questions about whether institutional demand is reshaping Bitcoin’s market cycle.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57191548,
    "published": 1768495774000,
    "title": "Massive Coinbase News! Bitcoin Rips to $96,750! Football.Fun TGE Interview with Founder!",
    "body": "Crypto majors are very green with Bitcoin making a new another 2-month high; BTC +2% at $96,7500; ETH +2% at $3,360, SOL even at $145; XRP -1% to $2.11. DCR (+30%), DASH (+10%), ICP (+10%) and ZEC (+7%) led top movers; XMR hit another new ATH at $800 before retracing to $725. Coinbase pulled support for the Senate’s crypto market structure bill ahead of a key vote, citing major concerns with the latest draft, leading to the Senate delaying the bill. Zcash avoided SEC action after the Zcash Foundation said the agency’s investigation has concluded. Ripple secured a Luxembourg license as its European expansion continued. Pakistan teamed with World Liberty Financial to explore stablecoin use cases for remittances and cross-border payments. The Human Rights Foundation awarded nearly $1.3M in Bitcoin grants to projects tied to human rights and freedom tech. Figure unveiled a new public equity network designed to enable on-chain issuance of stocks and related assets. FTX prepared another round of creditor payments and outlined timing details for the next distribution on March 31. Sui came back online after a nearly six-hour network stall, marking another reliability test for the chain.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57192045,
    "published": 1768499030000,
    "title": "Kaito to sunset 'Yaps' as X cracks down on InfoFi apps, token falls 17%",
    "body": "The crypto analytics firm is replacing its reward-driven social product with a more selective creator marketing platform after X revised its API policies to curb spam.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Social Media|X|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57191831,
    "published": 1768498414000,
    "title": "Citrea unveils U.S. Treasury-backed stablecoin for its Bitcoin ecosystem",
    "body": "The first stablecoin issued through MoonPay’s launchpad aims to solve liquidity fragmentation by issuing natively on Citrea.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Stablecoins|MoonPay|Layer 2s|Zero-Knowledge Proofs|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57192599,
    "published": 1768500701000,
    "title": "CME Group to expand crypto futures with Cardano, Chainlink and Stellar contracts",
    "body": "The planned altcoins listings will expand CME’s regulated crypto derivatives contracts beyond Bitcoin, Ether, XRP and Solana.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57192758,
    "published": 1768501362000,
    "title": "DeFi sees ‘bad’ crypto bill’s collapse as win, not setback",
    "body": "The latest push to establish a comprehensive U.S. crypto market structure framework hit a snag this week, but leaders in DeFi don’t seem alarmed by the collapse.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Coinbase|crypto market|Congress|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57192726,
    "published": 1768501180000,
    "title": "House Democrats slam SEC for dropping crypto cases with  Trump ties",
    "body": "In a letter on Thursday, lawmakers accused the SEC of enabling a \"pay-to-play\" dynamic after dropping cases against Binance, Coinbase, Kraken and Justin Sun.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Policy|SEC|Paul Atkins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57192972,
    "published": 1768501852000,
    "title": "US lawmakers demand action from SEC on Justin Sun enforcement case",
    "body": "Three House Democrats warned that leaving the SEC's case against the Tron founder unresolved could ”undermine investors’ confidence” in the financial regulator.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 57193311,
    "published": 1768502937000,
    "title": "Bitcoin whale balances see 21% bounce after fastest sell-off since 2023 ends",
    "body": "Increasing Bitcoin whale balances highlight reaccumulation, aligning with renewed spot BTC ETF inflows. Will $100,000 become support soon?",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57193740,
    "published": 1768504534000,
    "title": "XRP Will Skyrocket Beyond $18: Analyst Suggests 800% Growth Potential In 2026",
    "body": "Market expert Bird has recently issued a bold forecast for XRP, the fifth-largest cryptocurrency, suggesting that it could experience a major upside of 800% within this year. If this prediction holds true, XRP could reach a new all-time high of $18.40 per coin. Forecast Indicates XRP Might Rival Ethereum Bird’s forecast hinges on the XRP/BTC ratio, which he predicts will reach 1:5,000 by the end of 2026. This means that 5,000 XRP would be equivalent to 1 Bitcoin (BTC). Currently, the XRP/BTC ratio trades at approximately 0.00002235. Related Reading: Crypto Market Bill Draft Criticized For Allowing Continued Developer Prosecution For Bird’s envisioned target to materialize, the ratio must increase to 0.0002 BTC per token, representing a substantial gain of around 794% from current levels. With a total supply of 100 billion coins, this price projection implies an overall valuation of approximately $1.84 trillion for XRP. Such a figure would place the cryptocurrency in close competition with Ethereum—and striking distance of Bitcoin’s market cap. Additional Price Scenarios For The Altcoin Market expert Sam Daodu also outlined alternative scenarios for XRP’s future performance. In a base case, where the altcoin garners continued institutional support but doesn’t close the gap with Bitcoin’s market capitalization, the price could range between $3 and $4. This outcome would depend on exchange traded funds (ETFs) attracting a “few billion in assets” while Bitcoin’s dominance falls to the 40–50% range during a broader altcoin rotation. Related Reading: Zcash Foundation Investigation Closed: SEC Decision Sparks 12% Jump In ZEC Price Conversely, there exists a bear case where macroeconomic challenges or obstacles within the crypto ecosystem could hinder XRP’s price growth. Factors such as geopolitical instability could redirect capital back to Bitcoin and gold, while banks might opt for private ledgers and established stablecoins instead of adopting XRP. Monthly escrow releases from Ripple of 1 billion coins, accompanied by a potential diminishing exchange-traded fund demand, might cap any potential upside action for the cryptocurrency, leaving it to trade around its current trading prices of $2. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|bitcoin|crypto|crypto news|ethereum|Ripple|xrp|xrp news|XRP Price Analysis|XRP Price Forecast|XRP price forecasts|XRP price news|XRP/BTC ratio|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57193994,
    "published": 1768505407000,
    "title": "Ethereum Chart Turns Bullish: New Cycle Energy Points To $5,000",
    "body": "Ethereum is back to trading just above $3,300 per ETH in a slow bullish extension over the past week. After months of wide swings and failed follow-throughs above $3,000, the structure on the monthly timeframe chart is beginning to look bullish in a way that traders should take seriously. A recent technical breakdown shared by Merlijn The Trader on X shows that Ethereum is approaching a moment where consolidation could give way to forceful expansion, with $5,000 as the most important inflection point. Bullish Pennant Says Bullish Momentum About To Be Unlocked The chart showing the technical analysis from Merlijn shows a bullish pennant forming on Ethereum’s monthly timeframe. This bullish pennant shows that price action has been compressing between a rising support line and a descending resistance line, and this has created a narrowing structure since 2021. Related Reading: Here’s Why The Bitcoin, Ethereum, And Dogecoin Prices Are Surging Today Ethereum briefly pushed above the upper boundary of this pennant in 2025, rallying to just under the $5,000 mark before momentum faded and corrective moves followed. Since then, price action appears to be gravitating back toward the former resistance line, now acting as a key area of interest. As it stands, Ethereum is now retesting the upper trendline of this bullish pennant for a final upward move. Based on this projection, the first major barrier for Ethereum to break is around $3,300. A clean break above that level would likely open a path toward $3,600, an area that previously acted as a turning point during past rallies. The most consequential zone, however, is around the August 2025 all-time high of $5,000. A break above this zone would unlock bullish momentum based on the bullish pennant and play out in the majority of 2026. How Can This Breakout Play Out? Merlijn’s chart doesn’t stop at the breakout trigger once it breaks above the upper trendline of the pennant. It sketches a full road map for how the move could unfold once Ethereum leaves the pennant. The first step in that projection is a push above $3,600 before a more meaningful test around $5,000. Once Ethereum is able to break above $5,000, then the door is open for new price highs. Related Reading: Why The Ethereum Price Could Bounce Above $3,500 Soon However, the breakout is expected to come with volatility and retests, not a straight line upward, but still resolves higher if the pennant thesis holds. From $5,000, the projection turns into a two-stage expansion. The first stage shows a force move, where Ethereum goes on a rally to as high as $6,000, then chops through another sharp dip to $4,000 and another recovery sequence before the larger leg higher. The larger leg, higher projected on the chart, points to $8,400 as the final price target zone for Ethereum. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|Bullish Pennant Pattern|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|ethusd|ETHUSDT|Merlijn The Trader|Upper Trendline",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57194165,
    "published": 1768505796000,
    "title": "After Coinbase Reversal Forces Delay on Crypto Bill, Is There a Path Forward?",
    "body": "Crypto industry leaders scrambled Thursday to salvage the market structure bill—but some conceded the bill now has lower chances of passage.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57194702,
    "published": 1768507554000,
    "title": "Lightning Strikes Twice as Solo Bitcoin Miners Beat the Odds, Each Earning $300K",
    "body": "Two solo Bitcoin miners struck rare wins this week, each earning nearly $300,000 as U.S. mining dominance continues to slip.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57194984,
    "published": 1768508456000,
    "title": "Bank of America CEO warns interest-bearing stablecoins could pull $6T from US banks",
    "body": "In an earnings call transcript shared on X, BofA CEO Brian Moynihan pointed to studies suggesting yield-bearing stablecoins could draw trillions from the banking system.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 57195309,
    "published": 1768509669000,
    "title": "DTCC aiming to make all 1.4 million securities in its custody digitally eligible",
    "body": "The company's Brian Steele suggests the industry giant aims to redefine the limits of tokenization in capital markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|DTCC|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57195299,
    "published": 1768509465000,
    "title": "Baidu's ERNIE 5 AI Model Rises Up the Rankings—A Math Wiz That Beats OpenAI's GPT 5.1",
    "body": "Baidu's ERNIE-5.0-0110 ranks #8 globally on LMArena, becoming the only Chinese model in the top 10 while outperforming GPT-5.1-High.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57195698,
    "published": 1768510859000,
    "title": "Bitcoin Breaks Free From The Current Range — $107,000 Now The Level To Watch",
    "body": "Bitcoin is starting to emerge from its consolidation phase, suggesting that a decisive move may be underway. After holding above the former resistance, the market is starting to show early signs of confidence returning. The spotlight now shifts to the $107,000 level, where the strength of this breakout will be truly tested. Holds Firm Despite A Weak Start To The Session Bitcoin Meraklsi, in a recent BTC market update, outlined a largely positive outlook despite the day beginning with some downside pressure. While early trading showed red across the board, the analyst emphasized that the broader structure remains healthy, with Bitcoin still trading comfortably above the $96,000 region. Related Reading: BTC Breaks Higher as Record Bitcoin ETF Inflows Trigger Wave of Bearish Liquidations A major technical development highlighted in the update is Bitcoin’s breakout above the long-watched $94,800 resistance level, which previously capped upside moves, and is now acting as support. So far, price action suggests that buyers are stepping in on pullbacks, reinforcing the strength of this level and reducing the risk of an immediate reversal. As long as BTC continues to hold above $94,800, the bullish roadmap remains unchanged. The next clear upside target sits at $107,300, a level that could mark the next phase of expansion if momentum continues to build. The analyst also addressed why altcoins have yet to respond meaningfully to Bitcoin’s strength. In the view, the wider market is still waiting for confirmation and confidence from BTC itself. That confidence is more likely to emerge once Bitcoin reaches the $107,300 region. At that point, improved sentiment and risk appetite could spill over into altcoins, setting the stage for a stronger, more synchronized market move. Bitcoin Tests The Upper Boundary Of A Long-Standing Range According to Crypto Candy, Bitcoin appears to be transitioning out of a prolonged consolidation phase after spending considerable time moving sideways. At the time of the post, price was challenging the upper boundary of the $94,000–$96,000 range, signaling a potential shift in market momentum as buyers attempt to regain control. Related Reading: Wall Street Analyst Is Still Bullish On Bitcoin, Predicts Price Recovery BTC is now trading above it, but it must continue to hold above the range, which serves as a crucial validation zone. Sustained strength above this area would confirm bullish intent and increase the probability of a continued advance, with the $107,000 region standing out as the next major upside objective in the weeks ahead. However, the setup is not without risk. If Bitcoin fails to maintain its position above $94,000, the current move could quickly lose traction and be labeled a false breakout. Such a development invites renewed selling pressure, potentially dragging the price back toward lower support zones as the market reassesses direction. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin Meraklsi|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|Crypto Candy",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57196219,
    "published": 1768512187000,
    "title": "West Virginia lawmaker introduces bill to allow state crypto investments",
    "body": "The legislation would allow the state‘s treasury to hold digital assets with a market capitalization of more than $750 billion, which applied only to Bitcoin as of January.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57196890,
    "published": 1768514417000,
    "title": "Zcash Surges Post-SEC Probe: Is a Fresh Yearly High on the Horizon?",
    "body": "Zcash (ZEC) is back on investors’ radar after U.S. regulators ended a long-running investigation into the Zcash Foundation without enforcement. The decision removes a key source of uncertainty that had followed the privacy-focused cryptocurrency since 2023. Related Reading: XRP Price Is Approaching A Key Decision Zone, But Structure Is Still Firmly Bullish Markets reacted quickly, with ZEC posting double-digit gains in some sessions and stabilizing above the $400 level. While regulatory clarity has helped improve sentiment, questions around governance and long-term development remain. ZEC's price trends sideways after a violent move upwards on the daily chart. Source: ZECUSD on Tradingview SEC Closes Two-Year Zcash Investigation The U.S. Securities and Exchange Commission confirmed it has concluded its review of the Zcash Foundation, which began with a subpoena issued on August 31, 2023. The inquiry focused on potential securities law concerns tied to Zcash’s funding model, governance structure, and token distribution. According to the foundation, the SEC does not intend to recommend enforcement action, fines, or operational changes. This outcome marks a notable shift for privacy-focused cryptocurrencies, which have often faced heightened regulatory scrutiny due to concerns about illicit use. The decision suggests that Zcash’s privacy features alone were not deemed sufficient grounds for action under existing securities laws. The closure also aligns with a broader trend of the SEC withdrawing from several high-profile crypto investigations in recent months under new leadership. For Zcash, the end of the probe removes a regulatory overhang that had weighed on investor confidence for nearly two years. Market Reaction and Price Projections Following the announcement, ZEC surged between 5% and 14% across major exchanges, briefly testing the $440–$450 resistance zone. Currently, the token is trading around $427–$442, holding above the $400 psychological support level. Technically, ZEC remains in a consolidation phase after falling from its January high near $535. Resistance is clustered around $450–$470, while support sits near $400, with a deeper floor around $350 if sentiment weakens. Some analysts point to a symmetrical triangle pattern on longer timeframes, often viewed as a continuation structure after strong rallies. A confirmed breakout above the upper trendline could open the door toward higher levels, including a potential retest of the $1,000 mark later in 2026. Governance Uncertainty Clouds the Outlook Despite the regulatory win, internal challenges persist. Earlier this month, the full development team at Electric Coin Company (ECC), which has led core Zcash development, resigned following a dispute with its nonprofit board. Former ECC leaders cited deteriorating working conditions and have since announced plans to launch a new privacy-focused wallet, cashZ, based on Zcash technology. Related Reading: Arthur Hayes Bets On MSTR, Metaplanet And Zcash As Bitcoin Liquidity Turns The Zcash Foundation has stated that network operations and protocol stability remain unaffected by the personnel changes. Still, the departures have raised concerns about governance stability, development continuity, and long-term coordination within the ecosystem. Cover image from ChatGPT, ZECUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Zcash Zec|ZCash|ZEC|ZEC Price|zecusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57196956,
    "published": 1768514432000,
    "title": "Brian Armstrong’s Crypto Bill Diatribe Was Only the Beginning",
    "body": "Emily Masonand Olga Kharif sum up just about everything the crypto industry disliked in a bill that was postponed by the Senate Banking Committee just before it was about to go to markup.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NMS:COIN",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57197561,
    "published": 1768516200000,
    "title": "Bitcoin rally collapses at $97K as funding rate stalls, retail traders sit out",
    "body": "Bitcoin failed to hold $97,000 as its funding rate stalled and retail traders watched from the sidelines. Will TradFi reignite the rally to $100,000?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57197854,
    "published": 1768517204000,
    "title": "Democrats Blast SEC Over Crypto Retreat, Justin Sun’s Alleged China Ties",
    "body": "House Democrats have accused the SEC of selectively enforcing laws against crypto firms, while spotlighting Tron founder Justin Sun.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57198107,
    "published": 1768518027000,
    "title": "Sui Restores Service After Major 6-Hour Outage Shook Network",
    "body": "Sui’s blockchain resumed normal activity after a network stall that halted transactions for roughly six hours on January 14, 2026. According to reports, validators identified the problem in the mid-afternoon and worked to roll out a fix that restored block creation and transaction processing later that evening. Related Reading: Bitcoin’s New Power Buyers: Companies Bought 3 Times What Miners Produced Outage Timeline And Recovery Based on reports, Sui’s team first flagged the issue at about 2:52 pm UTC when block production and checkpoint creation stopped. Validators applied changes and began bringing nodes back into sync. Service was reported as restored at about 8:44 pm UTC, a span of roughly five hours and 52 minutes from detection to recovery. During that interval, no new blocks were finalized and user activity stopped across wallets and decentralized apps. The Sui network is now back and fully operational. Transactions are flowing normally. If you are still seeing issues, please refresh your app or browser window. Thanks for your patience. We will share a full incident review in the coming days. Please check… — Sui (@SuiNetwork) January 14, 2026 Transactions Halted And Value Frozen The halt left a large amount of on-chain value inactive while the network was stalled. Reports indicate more than $1 billion in value was effectively frozen during the outage, though there were no signs of funds being stolen or altered. Users and apps that rely on the chain saw failed or queued transactions, and many dApps displayed errors until validators finished their updates. Cause, Response And Market Reaction Reports have disclosed that the problem was recorded as a consensus outage, meaning the mechanism used to agree on new blocks stopped finalizing. A full technical root-cause writeup has not yet been published. The Sui Foundation said an incident report will appear later with more detail. The SUI token showed modest movement during the event, trading around $1.80–$1.85 in the hours after the network came back, with a brief spike recorded on some exchanges as the news circulated. Past Interruptions And Context Sui launched mainnet in May 2023, and this outage follows previous incidents that raised similar questions about validator coordination and uptime. One earlier major disruption occurred in November 2024, which also involved issues around consensus and validator operation. Developers who build on Sui said many of their services experienced interrupted user flows while the chain was stalled. Related Reading: Russia Drafts Bill That Could Change Who Can Buy Crypto Questions About Network Reliability Some community members and outside observers have asked how often such consensus stalls can happen and what measures will reduce future occurrences. Validators and the Sui team said they were focused on patching the immediate bug and improving monitoring so problems are detected faster. Based on reports, the foundation plans to share specific steps for validators and node operators in the upcoming post-mortem. Sui’s team has said transactions are flowing again and advised users to refresh wallets or apps if they still see problems. The network’s operators have promised more transparency with a formal incident report, which will be watched closely by developers, exchanges, and investors who depend on the chain’s steady operation. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|altcoins|blockchain|crypto|DeFi|memecoins|SUI",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 96,
        "NAME": "SUI",
        "CATEGORY": "SUI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57199003,
    "published": 1768520756000,
    "title": "BitMine expects $400 million income on ether holdings, bet on MrBeast could '10x'",
    "body": "BitMine Chair Tom Lee told investors that the company could generate over $400 million income on its $13 billion worth of ether holdings, primarily via staking.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Bitmine|Ethereum Treasury|Digital Asset Treasury|Ethereum News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      }
    ]
  },
  {
    "id": 57199296,
    "published": 1768521608000,
    "title": "Dogecoin Price Is Following This Bullish Signal With A Major Target",
    "body": "Crypto analyst Trader Tardigrade has revealed that the Dogecoin price is following a bullish signal, which could lead to a rally above the $0.15 level. This comes as the crypto market rebounds, with Bitcoin rallying to a new yearly above $97,000. Dogecoin Price Eyes Rally Above $0.15 With This Bullish Signal In an X post, Trader Tardigrade hinted that the Dogecoin price could rally above $0.15 after rebounding from the Kumo support, which was exactly what the bullish signal flagged. The rebound comes amid the broader crypto market rally, with major crypto assets also recording significant gains as Bitcoin rallies above $97,000, with the psychological $100,000 level now in sight. Related Reading: Dogecoin Rapid Accumulation Suggests Sharp Upward Sweep Is Coming In another X post, Trader Tardigrade revealed that the Dogecoin price has formed a bull flag on the weekly chart and is now targeting the $0.195 price level. This will bring the leading meme coin close to the psychological $0.2 level, with a break above it paving the way for new local highs. Crypto analyst Crypto Tony highlighted the $0.154 level as being critical for the next leg up for the Dogecoin price. His accompanying chart showed that reclaiming this level would spark a rally above $0.16. One factor that could contribute to this bullish run for the foremost meme coin is renewed inflows into the Dogecoin ETFs. SoSoValue data shows that these Dogecoin ETFs still recorded zero flows on January 14 despite the rebound in the Dogecoin price. However, this could change soon, as these funds notably saw increased demand at the start of the year, when DOGE rallied to as high as $0.15, making it one of the best-performing crypto assets among the top 10 coins by market cap. What’s Next For DOGE As It Targets New Highs In an X post, crypto analyst Kevin Capital stated that a successful retest followed by a new local high will be further evidence that the corrective phase for the Dogecoin price has ended. This came as he noted that DOGE, like BTC and many other altcoins, has since come back and successfully tested its key 4-hour MAs after breaking out of them, attempting to end its major corrective phase. The analyst added that a new high would be a break of $0.157. Related Reading: Here’s Why The Bitcoin, Ethereum, And Dogecoin Prices Are Surging Today Meanwhile, crypto analyst Bitcoinsensus has suggested that the Dogecoin price could rally to as high as $4.5 if DOGE is repeating its macro cycle pattern. The analyst noted that so far this cycle, the meme coin has maintained its ground and has mainly been moving sideways. As such, it remains to be seen if this cycle can be as explosive as the last ones. At the time of writing, the Dogecoin price is trading at around $0.143, down in the last 24 hours, according to data from CoinMarketCap. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|altcoins|bitcoin|Bitcoinsensus|btc|CoinMarketCap|Crypto Tony|doge|DOGE news|Doge price|Dogecoin ETFs|Dogecoin news|dogecoin price|dogeusd|dogeusdt|Kevin Capital|SoSoValue|Trader Tardigrade",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57200057,
    "published": 1768523750000,
    "title": "Viral ‘Stranger Things’ AI Videos Raise New Concerns Over Deepfakes",
    "body": "Excerpts warn how the demos using Kling’s Motion Control AI spotlight new risks as full-body identity swaps flood social media.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57200501,
    "published": 1768525208000,
    "title": "Bitcoin Rally Accompanied By ‘Very Bullish’ Whale-Retail Behavior, Santiment Says",
    "body": "On-chain analytics firm Santiment has revealed how Bitcoin is currently in a bullish zone based on the behavior of whale and retail investors. Bitcoin Major & Retail Entities Have Shown Opposite Trajectories Recently In a new post on X, Santiment has talked about how Bitcoin investor behavior currently compares between the top and low ends. Sharks and whales make up for the former category, while retail investors represent the latter. Formally, the wallet ranges of the two sides of the market are defined as 10 to 10,000 BTC and less than 0.01 BTC. Below is the chart shared by Santiment that shows the trend in the Bitcoin supply held by each of these cohorts over the last few months. Related Reading: Bitcoin Fear & Greed Index Turns ‘Neutral’ For First Time Since October As is visible in the graph, the Bitcoin sharks and whales have seen their combined supply rise during the last few days, indicating that the large investors have been accumulating. Meanwhile, the retail investors have sold instead. This could imply that the big-money hands are backing the latest price rally, while small holders don’t believe the run will last, so they are exiting with their profits. If history is to go by, this may actually be a positive signal. According to the analytics firm, whale and retail behavior diverging in this manner puts the market in what it defines as the “Very Bullish” zone. “This is the ideal setup for a bull run,” noted Santiment. In the chart, the analytics firm has also highlighted four other zones for BTC based on the trajectories followed by the whale and retail supplies. “Very Bearish” (colored in red) follows the same contrarian logic as the Very Bullish region, with the zone appearing when large entities are selling, and retail is accumulating. Bearish (orange), Neutral (yellow), and Bullish (blue) map out the spectrum between the two extreme regions. Bitcoin’s latest venture into the green Very Bullish zone has come as sharks and whales have loaded up on 32,693 BTC (worth about $3.1 billion) since January 10th, corresponding to a supply increase of 0.24%. Retail investors have sold 149 BTC ($14.4 million) in this window instead, equivalent to a drop of 0.30%. Related Reading: Litecoin Whale Activity Spikes To 5-Week High: Reversal Or Continuation Signal? It now remains to be seen whether BTC will stay in this region for long or if another shift in investor behavior will take place. “How long it lasts depends on how long retail doubts the mini rally that has formed,” explains Santiment. BTC Price Bitcoin witnessed a break beyond the $97,000 level on Wednesday, but the bullish momentum has since cooled, with the BTC price returning to the $96,900 mark. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin rally|Bitcoin retail|Bitcoin whales|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57200566,
    "published": 1768525200000,
    "title": "Uniswap lands on OKX’s X Layer as exchange deepens DeFi strategy",
    "body": "The integration marks a key step in the crypto exchange's second-phase rollout, bringing Uniswap’s markets directly to its layer-2 network.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 53,
        "NAME": "UNI",
        "CATEGORY": "UNI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57200768,
    "published": 1768525767000,
    "title": "Kaito winds down crypto-backed ‘Yaps’ as X bans payments for ‘AI slop’",
    "body": "The Kaito.ai and Cookie DAO tokens fell over 15% after X’s ban, a move X’s head of product Nikita Bier said should improve user experience on the social media platform.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57201713,
    "published": 1768528766000,
    "title": "Nexo to pay $500K fine to California regulator over ‘risky loans’",
    "body": "California’s finance watchdog claims Nexo made nearly 5,500 loans to Californians without a valid license and did not properly assess their ability to repay.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57201622,
    "published": 1768528426000,
    "title": "Iran’s crypto ecosystem spikes to $7.8B amid mass protests: Chainalysis",
    "body": "Bitcoin has become an “element of resistance\" in Iran, providing liquidity in an increasingly restricted economic environment, says Chainalysis.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57202837,
    "published": 1768532447000,
    "title": "Keyrock Flags 12 Crypto Charts You Need To Watch This Year",
    "body": "Keyrock and Dune have published a “12 Charts to Watch in 2026” dashboard that tries to pin next year’s crypto narrative to measurable market structure, where liquidity is forming, where value is being returned, and which rails are quietly becoming systemically important. The report’s premise is straightforward: each chart pairs a live dataset with an explicit 2026 prediction. Taken together, the set reads like a checklist of whether crypto’s core primitives: trading, issuance, payments, and funding are becoming deeper and more institutional in their behavior. 12 Crypto Metrics To Watch This Year Keyrock puts prediction markets near the top of the stack after a 2025 run that saw weekly volume rise 9.2x to just under $5 billion, with Kalshi, Polymarket and Opinion controlling a combined 98.4% share at the time of writing. For 2026, it forecasts a 5x jump versus the 2025 run-rate to $25 billion in weekly volume, and a matching 5x rise in open interest as markets deepen and positions persist longer. Related Reading: Crypto Market Bill Draft Criticized For Allowing Continued Developer Prosecution On tokenization, the chart tracks non-stablecoin onchain RWA AUM, explicitly excluding stablecoins to isolate whether capital markets assets are moving onchain. Keyrock says non-stablecoin RWA AUM grew 3.4x in 2025 and projects more than 4x growth in 2026, led by tokenized cash-like products (T-bills and money market funds) and private credit, with early signs of equities and ETFs as market structure and regulation mature. A third adoption vector is x402, which Keyrock describes as an open payments protocol pioneered by Coinbase in 2025 to let software, including AI agents pay for digital services using stablecoins. Its measurable call: weekly x402 volume exceeding $100 million in 2026, framed as a proxy for “machine-native commerce” showing up in production. For onchain asset management, Keyrock tracks vault AUM across major providers and argues 2025 was about product maturity; 2026 is positioned as distribution. Its headline forecast is vault AUM tripling to $36 billion before year-end, alongside a prediction that at least one major broker-dealer offers an onchain vault “yield shelf.” Related Reading: New Hope For Crypto: Senators Introduce Blockchain Regulatory Certainty Act Derivatives are treated as the clearest stress test for depth. Keyrock highlights how the DEX-to-CEX futures trading ratio grew more than 3x in 2025, from 6.34% to 21%, and says open interest—not volume—is the key signal for whether venues can “hold risk in size” as new asset classes migrate onchain. The 2026 target: onchain perp OI exceeding $50 billion. Value return is monitored via buybacks. The report notes multi-million-dollar programs in 2025 from Hyperliquid, Raydium and Pump.fun, and predicts weekly buyback spend reaches at least 2x 2025 levels, plus a shift away from “fixed percentage of fees” models toward “value-aware” execution (pacing bands, triggers, disciplined accumulation). Solana MEV is framed as a distribution problem as much as a trading one. Keyrock notes tip-based MEV (validator + Jito tips) fell from a peak of 100,000 SOL (about $25 million at the time) to a low of 1,000 SOL (about $139,000), then points to the Block Assembly Marketplace (BAM) as the mechanism that could reshape where MEV is captured, away from reflexive tip spikes and toward explicit execution pricing set by apps and venues. Moreover, Keyrock uses “shielded ZEC” as a privacy proxy and forecasts shielded deposits rising from 4.9 million to more than 7 million by end-2026. On Ethereum, it tracks whether blobs develop a meaningful fee floor and predicts a median hourly blob cost of at least $0.05 per blob on a full-year basis. Payments show up in consumer form via crypto card spend, with the report forecasting a $500 million monthly spend print at least once in 2026. TradFi integration is tracked via spot BTC ETF AUM, with Keyrock projecting holdings surpass 2.5 million BTC in 2026 and net inflows positive in at least eight months. Finally, the stablecoin funding chart anchors on Aave’s USDC variable borrow APY on Ethereum, which it says ranged from 2.4% to 9.8% in 2025. The forward-looking claim is about rate stability rather than level: a drop in 30-day rolling volatility of USDC borrow APY to an average below 0.25 versus roughly 0.40 in 2025—positioned as a prerequisite for longer-duration, institution-style strategies. At press time, the total crypto market cap stood at $3.25 trillion. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto|Crypto Charts|crypto news|ethereum|Keyrock|Solana",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57202891,
    "published": 1768532513000,
    "title": "DeadLock ransomware hides using exploited Polygon smart contracts",
    "body": "Group-IB found a ransomware dubbed DeadLock that is exploiting Polygon smart contracts to rotate proxy addresses to evade takedowns.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 38,
        "NAME": "MATIC",
        "CATEGORY": "MATIC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57203281,
    "published": 1768533656000,
    "title": "Utah Man Gets Three Years for $2.9M Fraud Tied to Crypto Cash Scheme",
    "body": "The sentencing of a Utah man links investor fraud and unlicensed cash-to-crypto activity under the same prosecution.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 57204006,
    "published": 1768536039000,
    "title": "Bitcoin Bull Score Hits Level Seen Only 7 Times In 6 Years – A Rare Historical Signal",
    "body": "Bitcoin has shown renewed bullish momentum in recent sessions, pushing price back toward the $97,000 level after weeks of persistent selling pressure. For much of the recent consolidation, the market struggled under distribution from short-term participants and cautious positioning from traders who remained uncertain about the broader trend. That dynamic now appears to be shifting. While price action alone does not confirm a full trend reversal, the latest rebound suggests that downside pressure is easing and that buyers are becoming more willing to absorb available supply. Related Reading: Bitcoin Bulls Take Control: Futures Positioning Turns Bullish for First Time Since October This improvement in price behavior is supported by on-chain context rather than pure speculation. A quick insight from a CryptoQuant analyst highlights a rare development in market sentiment: the Bitcoin Bull Score Index has dropped to 20, a level that has historically appeared only a handful of times over the past several years. Such readings typically reflect deeply pessimistic conditions, when bullish signals across multiple indicators are scarce. Paradoxically, these environments often coincide with transitional phases rather than sustained declines. When bearish sentiment becomes widespread and measurable optimism disappears, markets tend to become increasingly sensitive to even modest improvements in demand. Bitcoin Bull Score Hits A Rare Historical Level Over the past six years, the Bitcoin Bull Score Index has fallen to levels of 20 or lower only seven times. The market is now experiencing the seventh occurrence, placing the current environment among the rarest sentiment regimes in Bitcoin’s history. This index aggregates multiple on-chain and market indicators to assess whether conditions favor bullish continuation or reflect broad-based weakness. Readings near 20 indicate that very few bullish signals are active at the same time, highlighting a market dominated by caution rather than optimism. Historically, such extremes have tended to appear during transitional phases. They often emerge late in corrections, when selling pressure has largely played out, but confidence has not yet returned. This does not guarantee an immediate reversal. However, it does suggest that downside momentum is becoming increasingly fragile, as most participants who wanted to de-risk have already done so. The timing of this signal is particularly relevant as Bitcoin approaches a critical psychological zone near $100,000. This level represents both a major round-number resistance and a key reference point for short-term and long-term holders. The coming weeks will be decisive. A sustained push toward and above $100K, accompanied by improving breadth in on-chain indicators, would likely mark a shift away from defensive positioning. Conversely, failure at this level could reinforce consolidation and prolong uncertainty. Related Reading: OG Bitcoin Selling Slows Sharply: Long-Dormant Coins Go Quiet Weekly Chart Shows Recovery Attempt Below Resistance Bitcoin’s weekly chart shows a market attempting to reassert strength after a prolonged corrective phase, with price now trading around the $96,000–$97,000 zone. This area is technically important, as it aligns with a former consolidation range that acted as support during mid-2025 and later flipped into resistance after the November breakdown. The recent rebound suggests buyers are willing to defend higher lows, but confirmation remains incomplete. From a trend perspective, Bitcoin is still trading below the declining 50-week moving average, which currently caps upside attempts. This level has acted as dynamic resistance during previous bear-to-neutral transitions. And will be a critical area to reclaim for trend continuation. Below the price, the 100-week moving average continues to slope upward and has provided structural support during the recent pullbacks. Reinforcing the idea that the broader market structure remains intact despite short-term weakness. Related Reading: Bitcoin Short-Term Holders Near A Profit Flip: A Key Level Comes Into Focus Volume behavior is also notable. The rebound toward $97,000 occurred without a major expansion in volume, revealing that the move may still lack strong conviction. This supports the view that the current advance could be a recovery leg within a larger consolidation rather than the start of an impulse. If Bitcoin can consolidate above $95,000 and eventually reclaim the 50-week moving average, the probability of a continuation toward the $105,000–$110,000 region increases. Failure to hold this zone would expose the market to renewed downside tests toward the mid-$80,000s. Keeping the broader consolidation unresolved. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|Bitcoin Bull Score|Bitcoin Bull Score Index|Bitcoin Indicator|Bitcoin news|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57204581,
    "published": 1768537552000,
    "title": "Crypto sentiment drops amid unease over US market structure bill",
    "body": "The Crypto Fear & Greed Index slipped by 12 points to “neutral” on Friday amid heightened anxiety over the future of a long-awaited crypto bill in the US.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57204366,
    "published": 1768537107000,
    "title": "XRP Price Loses Most Gains, Next Support Now in the Crosshairs",
    "body": "XRP price extended losses and traded below $2.10. The price is now consolidating and might decline further if it trades below $2.020. XRP price started a fresh decline below the $2.120 zone. The price is now trading below $2.10 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance at $2.0850 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move down if it stays below $2.10. XRP Price Dips Again XRP price failed to stay above $2.150 and started a fresh decline, like Bitcoin and Ethereum . The price declined below $2.120 and $2.10 to enter a short-term bearish zone. The price even spiked below $2.080. A low was formed at $2.052, and the price is now consolidating losses. There was an attempt to clear $2.080 and the 23.6% Fib retracement level of the downward move from the $2.193 swing high to the $2.052 low, but the bears remained active. There is also a key bearish trend line forming with resistance at $2.0850 on the hourly chart of the XRP/USD pair. The price is now trading below $2.10 and the 100-hourly Simple Moving Average. If there is a fresh upward move, the price might face resistance near the $2.0850 level and the trend line. The first major resistance is near the $2.120 level. It is close to 50% Fib retracement level of the downward move from the $2.193 swing high to the $2.052 low. A close above $2.120 could send the price to $2.1395. The next hurdle sits at $2.20. A clear move above the $2.20 resistance might send the price toward the $2.250 resistance. Any more gains might send the price toward the $2.320 resistance. The next major hurdle for the bulls might be near $2.350. More Losses? If XRP fails to clear the $2.120 resistance zone, it could start a fresh decline. Initial support on the downside is near the $2.050 level. The next major support is near the $2.020 level. If there is a downside break and a close below the $2.020 level, the price might continue to decline toward $1.950. The next major support sits near the $1.920 zone, below which the price could continue lower toward $1.880. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $2.050 and $2.020. Major Resistance Levels – $2.0850 and $2.120.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57205252,
    "published": 1768539669000,
    "title": "California Fines Crypto Wealth Platform Nexo $500K Over 'Unlicensed' Loans",
    "body": "Nexo faces fresh headwinds as California regulators take action against the digital assets platform for the second time in three years.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57205197,
    "published": 1768539653000,
    "title": "Ethereum Staking Hits Record Levels As Buterin Urges Builders To Deliver Real Apps",
    "body": "According to ValidatorQueue data, staked Ethereum has climbed to close to 36 million, equal to nearly 30% of the circulating supply. That figure now represents more than $119 billion at current prices. Staking rose from 35.5 million to almost 36 million since early January, even though ETH has fallen more than 30% since August. Related Reading: Futures Frenzy Pushed Crypto Exchange Volume To Nearly $80 Trillion In 2025 The unstaking queue is zero, while the staking queue topped 2.5 million ETH — its highest level since August 2023. Based on reports, those moves point to strong long-term bets on the network. Ethereum Staking Shows Strong Conviction Institutional interest helped push the numbers higher. Publicly listed Digital Asset Treasuries and big staking services are said to be among the active participants. Some of the latest increases came during a stretch that had been mostly flat since last August. Market watchers say that rising stakes add to the protocol’s security profile, and the large queue suggests demand for on-chain commitments remains high even with price weakness. Buterin Says Infrastructure Is Ready Meanwhile, reports have disclosed that Ethereum’s founder, Vitalik Buterin, has urged builders to stop experimenting only in theory and start shipping real products. He has argued that the technical pieces are finally functional: the chain runs on proof of stake, transaction costs are lower, and scaling through ZK-EVMs and Layer 2s is working. Messaging that began with Whisper has been adapted into Waku, and apps such as Status and Railway were cited as examples that already use these systems. In 2014, there was a vision: you can have permissionless, decentralized applications that could support finance, social media, ride sharing, governing organizations, crowdfunding, potentially create an entire alternative web, all on the backs of a suite of technologies.… pic.twitter.com/ihU9qOrXfG — vitalik.eth (@VitalikButerin) January 14, 2026 He used the term “walkaway test” to describe a simple check: if a decentralized app’s operator disappears, can the data and functionality remain available to users? Fileverse, a decentralized document editor, was pointed to as a case where documents would survive even if the team behind it vanished. Builders Urged To Ship Practical Apps Buterin also criticized the trend toward overly centralized consumer devices and services that lock users into accounts and subscriptions. He warned against appliances that require registration and that may collect data on routine tasks. He contrasted those products with tools that a person truly owns and controls. The message was clear: now that infrastructure is in place, developers should focus on practical software people will actually use, not just experiments that live on testnets. What This Means Going Forward The split between the technical optimism and the market reality is visible. On one side, nearly 36 million ETH staked and a swollen staking queue show investor conviction in the protocol’s future. Related Reading: Bitcoin’s New Power Buyers: Companies Bought 3 Times What Miners Produced On the other, price pressure since August has been real and is still being felt. Reports emphasize that the climb in staked ETH strengthens the network’s security, but the call to build usable, user-friendly apps remains loud. If developers respond by shipping useful products that meet everyday needs, the combination of a secure chain and working applications could push broader adoption. For now, the numbers and the rhetoric are both sending a clear signal: the ingredients exist, and attention is shifting toward turning them into tools people rely on. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|bitcoin|crypto|ETH|ethereum|ethusd|Staking|Vitalik Buterin",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57205112,
    "published": 1768539221000,
    "title": "Ethereum activity doubles with influx of new users: Glassnode",
    "body": "Ethereum saw activity retention nearly double to 8 million addresses in a month while daily transactions hit an all-time high of 2.8 million amid soaring stablecoin use.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57205364,
    "published": 1768540137000,
    "title": "Solana (SOL) Slips Back to Support, Setting Up a High-Tension Test",
    "body": "Solana failed to stay above $146 and corrected gains. SOL price is now trading below $145 and might find bids near the $140 zone. SOL price started a downside correction below $145 against the US Dollar. The price is now trading below $145 and the 100-hourly simple moving average. There is a bullish trend line forming with support at $141 on the hourly chart of the SOL/USD pair (data source from Kraken). The pair could extend losses if it dips below the $140 zone. Solana Price Starts Downside Correction Solana price failed to surpass $150 and started a downside correction, like Bitcoin and Ethereum . SOL dipped below $146 and $145 to enter a short-term bearish zone. There was a move below the 61.8% Fib retracement level of the upward wave from the $138 swing low to the $149 high. However, the bulls are active above $140. Besides, there is a bullish trend line forming with support at $141 on the hourly chart of the SOL/USD pair. Solana is now trading below $145 and the 100-hourly simple moving average. On the upside, the price is facing resistance near the $144 level. The next major resistance is near the $146 level. The main resistance could be $148. A successful close above the $148 resistance zone could set the pace for another steady increase. The next key resistance is $155. Any more gains might send the price toward the $162 level. More Losses In SOL? If SOL fails to rise above the $146 resistance, it could start another decline. Initial support on the downside is near the $141 zone and the trend line. The first major support is near the $140 level and the 76.4% Fib retracement level of the upward wave from the $138 swing low to the $149 high. A break below the $140 level might send the price toward the $132 support zone. If there is a close below the $132 support, the price could decline toward the $124 support in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is gaining pace in the bearish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is below the 50 level. Major Support Levels – $141 and $140. Major Resistance Levels – $146 and $148.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Technical analysis|Sol|Solana|solbtc|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57205815,
    "published": 1768541125000,
    "title": "Crypto plumbing, policy improved in 2025, but prices ‘did not cooperate’: Binance",
    "body": "Regulated investment vehicles such as exchange-traded funds expanded in 2025, and corporations added crypto to their balance sheets, opening up more pathways for user access.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57206638,
    "published": 1768543476000,
    "title": "State Street rolls out new crypto tokenization tools",
    "body": "State Street said its new crypto platform would help clients build tokenized money market funds, exchange-traded funds, and products such as tokenized deposits and stablecoins.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57206835,
    "published": 1768544065000,
    "title": "US housebuilder to launch crypto rewards after SEC ‘no-action’ letter",
    "body": "Megatel Homes says it’s launching a program where renters could receive rewards for paying their rent using a crypto token.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57208554,
    "published": 1768549665000,
    "title": "CME Group to offer cardano, chainlink, stellar futures as institutions seek regulated risk-management tools",
    "body": "The new futures contracts, available in micro and standard sizes, are set to launch on Feb. 9, pending regulatory approval.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57208821,
    "published": 1768550446000,
    "title": "CME Group To Launch Cardano, Chainlink, Stellar Futures Amid Crypto Lineup Expansion – Details",
    "body": "Leading derivatives exchange CME plans to add futures contracts tied to Cardano (ADA), Chainlink (LINK), and Stellar (XLM) to continue growing its roster of regulated crypto derivatives. Related Reading: Analyst Says It’s Time For Ethereum’s ‘Big Test’ – Is ETH Season Loading? CME Adds New Altcoins To Crypto Derivatives Lineup On Thursday, Chicago-based derivatives exchange CME Group announced a new expansion of its lineup of regulated crypto derivatives with the upcoming inclusion of Cardano, Chainlink, and Stellar futures. According to the announcement, the new crypto additions are expected to launch on February 9, 2026, although they are still pending regulatory review. In addition, they will offer both micro-sized and larger-sized contracts for the three cryptocurrencies. For the standard Cardano futures, the contract will cover 100,000 ADA, while the micro-sized ADA futures will consist of 10,000 tokens. In addition, the Chainlink and Stellar’s large-sized futures will be set at 5,000 LINK and 250,000 XLM, respectively, while the small-sized contracts will cover 250 LINK and 12,500 XLM. The upcoming Cardano, Chainlink, and Stellar futures contracts build on the derivatives exchange’s existing crypto suite, which includes four of the largest cryptocurrencies by market capitalization. In 2017, CME first launched Bitcoin (BTC) futures, followed by the introduction of Ethereum (ETH) futures in 2021. In the first half of 2025, the Chicago-based exchange added Solana (SOL) and XRP futures to its lineup, introducing options for both cryptocurrencies later in the year. Giovanni Vicioso, CME Group Global Head of Cryptocurrency Products, highlighted the industry’s expansion and development over the past few years, affirming that “given crypto’s record growth over the last year, clients are looking for trusted, regulated products to manage price risk as well as additional tools to gain exposure to this dynamic market.” “With these new micro- and larger-size Cardano, Chainlink and Stellar futures contracts, market participants will now have greater choice with enhanced flexibility and more capital-efficiencies,” he added. Cardano, Chainlink, Stellar Price Reaction Despite the positive development, the trajectory of ADA, LINK, and XLM remained mostly unchanged, with the three altcoins continuing their intraday correction. Chainlink and Stellar both saw 4% declines from their Thursday highs, falling to the $13.60 and $0.225 levels. LINK has momentarily lost the $13.80 level as support and is attempting to hold the current area to prevent further bleeding. Similarly, XLM was also rejected from the Wednesday highs and bounced from the $0.230 before continuing its descent toward its two-day low. Related Reading: Bitcoin Nears ‘Historic’ Technical Test As Price Eyes $93,500 Barrier – What’s Next? Meanwhile, ADA was attempting to reclaim the $0.41 area ahead of the announcement, briefly bouncing from the recent pullback. Notably, Cardano surged over 10% from the recent lows toward the crucial $0.42-$0.43 area. However, the altcoin was rejected from this zone on Wednesday, retracing nearly 9% from the local highs to retest the $0.40 level. On Thursday morning, the cryptocurrency bounced from this area, but ultimately resumed its correction as the day progressed. As a result, Cardano has retraced most of this week’s gains, currently trading around the $0.391 mark. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|ADA|ADAUSDT|Cardano|Cardano CME futures|Cardano futures|Cardano price|chainlink|Chainlink CME futures|CME futures|Link|Stellar CME Futures|Stellar Lumen|XLM",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 56,
        "NAME": "XLM",
        "CATEGORY": "XLM"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57209996,
    "published": 1768554038000,
    "title": "Altcoin Rallies Are Getting Shorter, And Wintermute Has The Data",
    "body": "According to Wintermute’s 2025 Digital Asset OTC Markets report, altcoin rallies last year were much shorter than traders expected, averaging about 19–20 days. That is a steep drop from the roughly 60-day runs seen in 2024. Market flows tightened, and many smaller tokens saw gains vanish faster than before. The result: capital moved back into the big names — Bitcoin and Ethereum — where liquidity is deeper. Related Reading: Bitcoin’s New Power Buyers: Companies Bought 3 Times What Miners Produced Altcoin Open Interest Drops Based on reports, one key trigger was a sharp deleveraging on October 10, 2025, which pushed retail traders to reduce risk and rotate out of smaller tokens. Open interest in many altcoin futures contracts fell, with some coverage noting about a 55% decline in altcoin futures open interest since October. Trading desks said lower liquidity made it harder for rallies to keep going beyond a few weeks, turning what used to be multi-month moves into short bursts. Major Coins Reclaimed Center Stage Institutional flows and product structures played a role. Reports have disclosed that ETFs and other institutional channels helped funnel funds toward Bitcoin and Ethereum. As a result, the market’s attention narrowed. Where narratives once pushed dozens of tokens into rallies, more capital was now concentrated in the top tier. Traders say they preferred assets where orders could be filled without dramatically moving the price. Short, Intense Moves Replaced Long Trends Wintermute’s analysis points to a change in how momentum forms. Rally drivers became more tactical and less about broad, lasting narratives. In practice, that meant memecoin pumps and exchange-themed rallies burned out quickly. Some traders described these moves as hair-trigger events: quick upswings followed by equally rapid retracements. Liquidity bands tightened and stops were hit sooner than in past cycles. What Traders And Firms Are Watching Market participants say the path to a sustained altcoin season now requires a few things aligning. Reports indicate renewed retail interest, clearer institutional support for smaller tokens, and calmer macro markets could help. Otherwise, rallies are likely to remain short. Execution desks reported that when big buyers reappeared for a token, it could run fast, but keeping that momentum proved difficult without deeper market participation. Related Reading: Futures Frenzy Pushed Crypto Exchange Volume To Nearly $80 Trillion In 2025 Outlook For 2026 Based on the report and market commentary, a broader crypto rebound in 2026 depends on several moving parts: interest from institutions, shifts in macro rates, and retail returning to risk-on strategies. If those elements arrive, rallies might last longer than the 19–20 day average seen in 2025. If not, traders say the pattern of quick, sharp moves into the majors will continue. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|altcoin|bitcoin|crypto|DeFi|ethereum|Stablecoins|Wintermute",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57210281,
    "published": 1768554606000,
    "title": "KBC Bank to launch Bitcoin and Ether trading in Belgium under MiCA",
    "body": "Belgian bank KBC will launch bitcoin and ether trading for retail investors via its Bolero platform as Belgium’s MiCA regime comes into force.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]