[
  {
    "id": 56483564,
    "published": 1766905091000,
    "title": "Uniswap executes 100M UNI burn after governance approval",
    "body": "Uniswap has removed 100 million UNI from circulation after its fee-burning proposal passed with near-unanimous support.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 53,
        "NAME": "UNI",
        "CATEGORY": "UNI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56485551,
    "published": 1766898001000,
    "title": "Bitcoin Sees Unusual Short-Term Supply Spike, Raising Bearish Flags",
    "body": "Since the short squeeze in mid-December, Bitcoin has yet to make any significant price gain, facing multiple rejections at the $90,000 price zone. The maiden cryptocurrency is presently consolidating within the $87,000, while investors patiently anticipate a clear market direction. According to pseudonymous analyst Sunny Mom, recent on-chain analysis suggests that bearish sentiment will remain dominant in the coming months following the initial extended correction in October and November. Related Reading: Bitcoin 4-Year Cycle Is Dead: Crypto Trader Explains What Happens Next Why Rising Short-Term Bitcoin Supply Is Flashing A Rare Bearish Signal In a QuickTake post on December 27, Sunny Mom draws attention to the BTC HODL waves, which show the rising share of short-term holders coinciding with falling prices, flipping a metric that typically supports bullish narratives. Historically, an increase in short-term holder (STH) supply, coins held for less than 155 days, suggests fresh capital is entering the market ahead of sustained rallies. However, the analyst described the current move as “passive bag-holding” rather than signaling “new blood.” This is because investors who bought during the $120,000 rally in October, driven by FOMO, alongside dip buyers in November, now sit on unrealized losses, thereby creating a price setup that alters market behavior. Sunny Mom explains that each relief rally is met with selling pressure as these holders attempt to exit at breakeven, effectively turning the expanding STH cohort into a ceiling rather than a floor. Therefore, price rebounds struggle to gain traction. The renowned analyst explains that the market is witnessing an emotional toll that is growing visibly on-chain. Notably, there have been repeated spikes in Net Realized Loss (NRL) since October liquidations, suggesting that capitulation is underway, with investors locking in losses after months of endurance. Sunny Mom describes the process as a “dull knife” finally cutting deep, an indication that weaker hands are being forced out, not through a single crash, but through prolonged exhaustion. Related Reading: Bitcoin Short-Term Holders Face Prolonged Pain As Key Metric Stays Red Bitcoin In Demand Vacuum As Likely Fall Below $80,000 Remains Active In further analysis, Mom attributes the current bearish setup to a demand vacuum. The market expert explains that exchange reserves are sitting near multi-year lows, signaling limited immediate sell-side liquidity. At the same time, long-term holders (LTHs) show little interest in distributing coins, reinforcing the view that conviction capital remains intact. Therefore, the problem lies on the demand side. With macro uncertainty still elevated, new buyers appear hesitant to step in, creating a demand vacuum. This also creates thin order books, meaning even modest sell pressure can push prices sharply lower. While some market watchers target a potential recovery in Q1 2026, citing expectations of rate cuts and improved global liquidity. Mom predicts Bitcoin may need a “final shakeout” to resolve the imbalance and reset the market for a bullish breakout. The analyst points to a potential move below $80,000 as a liquidity hunt that could flush remaining weak hands and allow larger holders to reaccumulate. Featured image from Pngtree, chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|Bearish Signal|bitcoin|btcusd|BTCUSDT|Demand Vacuum|QuickTake post|resistance|Short-term Bitcoin supply|Sunny Mom",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56486760,
    "published": 1766912406000,
    "title": "Here’s When Bitcoin Super Cycle Will Kick In  — Analyst",
    "body": "Popular market analyst KillaXBT has shared a bold prediction of a Bitcoin super cycle. After multiple failed “super cycle” calls by other market enthusiasts, the anonymous market expert argues that Bitcoin’s defining breakout has yet to begin, highlighting a key market condition. Related Reading: Bitcoin Short-Term Holders Face Prolonged Pain As Key Metric Stays Red Metal Market Downtrend, Bitcoin Supertrend According to KillaXBT in an X post on December 27, the real super cycle will only emerge when capital decisively rotates away from precious metals and into Bitcoin, marking a generational shift rather than a typical crypto rally. Unlike past “premature” super-cycle narratives, driven more by optimism, the analyst references a budding price structure similarity that indicates a massive Bitcoin price rally ahead. Notably, interest in precious metals is soaring after gold and silver recently reached new ATH prices of $4,500 and $77, respectively. Similar to most analysts, KillaXBT anticipates these precious metals will eventually slip into a multi-year downtrend that will force investors to explore other havens against inflation. In particular, the analyst expects older generations to remain anchored in gold, while a new cohort of capital increasingly chooses Bitcoin as its preferred store of value. As metals underperform, a scarce Bitcoin is tipped to record an unprecedented demand. The analyst draws a historical parallel between gold in early 1972 and Bitcoin’s current position heading into 2027. In this period, Gold entered a powerful multi-year run as capital sought protection from inflation and currency debasement. KillaXBT argues Bitcoin is approaching a similar inflection point and is set to outperform every major asset class in the next cycle. Interestingly, gold, long considered the ultimate store of value, is currently valued at an estimated $31.7 trillion in market cap value. Bitcoin, by contrast, sits near $1.83 trillion. KillaXBT explains that even at a Bitcoin price of $200,000, the network’s market cap would rise to roughly $5 trillion, still about six times smaller than gold, highlighting how early Bitcoin remains in the global asset hierarchy. Related Reading: Ethereum Investors Slide Deeper Into Losses – What The Drop Below $3,000 Means This Is The Last Sub $100,000 Bear Market – Analyst In concluding notes, KillaXBT states that skepticism has accompanied every major Bitcoin rally, consistently peaking just before large upside moves. In past cycles, critics pointed to regulation, environmental concerns, and volatility risks. Today, the fear narrative has shifted to emerging technologies such as artificial intelligence and quantum computing. The analyst suggests that these concerns may once again pressure investors out of the market prematurely. However, KillaXBT is taking a bullish stance as they believe the current phase could represent the final prolonged bear market in which Bitcoin trades below $100,000. However, they warn that investors should expect the supercycle boom in 2027, as 2026 is likely to be a bearish period. Featured image from Shutterstock, chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|Bitcoin Supercycle|btcusd|BTCUSDT|capital rotation|gold|KillaXBT|multi-year downtrend|silver",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56490717,
    "published": 1766905215000,
    "title": "XRP Supply Dwindles While ETFs Go On A Buying Spree Before 2026",
    "body": "XRP is slowly entering one of the most important structural phases in its history. Price action has been mostly bearish and sentiment across the broader crypto market has been cautious, but on-chain data tells a very different story. Data from Glassnode shows XRP balances on centralized exchanges falling to around 1.5 billion XRP, their lowest in over a year. This trend is unfolding alongside accumulation from newly launched XRP ETFs, creating conditions that could change the altcoin’s price dynamics heading into 2026. Related Reading: Bitcoin Forecasts For 2026 Range From $65K To $250K As Sentiment Hits ‘Extreme Fear’ XRP Exchange Balances Fall To Multi-Year Lows Data from Glassnode’s XRP balance on exchanges metric points to a clear and persistent downtrend in balances held on crypto exchanges throughout 2025. Earlier in the year, about 4 billion XRP sat on centralized platforms. Since then, balances have steadily declined, with a particularly sharp drop visible in the fourth quarter of the year. As it stands, exchange-held XRP has compressed toward the 1.5 billion mark, one of the lowest levels recorded in recent years. This decline has occurred despite the current downtrend in XRP’s price action, meaning that some holders are increasingly opting to move tokens into longer-term custody, even as some others are selling off their holdings. This trend is important for bullish momentum, as falling exchange balances reduce near-term sell pressure and make cryptocurrencies more sensitive to incoming demand. At the center of this supply contraction are US-based Spot XRP ETFs, which have risen as a powerful new source of demand. Market estimates indicate that about 750 million XRP have been absorbed by the six Spot ETF products since the first one launched in November. As ETFs continue pulling XRP off exchanges, the pool of liquid supply available to the spot market keeps shrinking. This dynamic does not force an immediate price response, but it changes the balance between supply and demand, and we could start to see the effects on the crypto in 2026. Related Reading: Big Bet On Ethereum: CEO Sees 10X TVL Growth In 2026 Weekly Chart Points To Exhaustion As XRP Sits On Support While on-chain data highlights tightening supply, technical conditions are beginning to reflect a similar theme. Crypto analyst Steph Is Crypto recently pointed out that XRP is now sitting on an important horizontal support zone on the weekly timeframe. The chart shows XRP’s price action is now compressing into the $1.90 to $2.00 range after an extended decline from mid-2025 highs near $3.50, placing XRP back at a level that previously acted as a launch point earlier in the cycle. Furthermore, the weekly Stochastic RSI is now in extreme oversold territory and this means that selling pressure has already done much of its work. Steph’s analysis noted that turning points tend to form when downside momentum is exhausted and there is little energy left for sellers to continue pushing price lower. Based on this, traders can expect XRP to transition into bullish momentum in early 2026. Featured image from Gemini, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoin|bitcoin|crypto|etf|xrp",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56491210,
    "published": 1766920556000,
    "title": "Bitcoin risks first post-halving year red candle with price stuck at $88K",
    "body": "Bitcoin analysis said that while a retest of $93,500 could still occur by the yearly close, a red 2025 candle would threaten the four-year cycle theory.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56492069,
    "published": 1766922088000,
    "title": "BTC, ETH, SOL, XRP and DOGE trade higher as precious metals rally keeps macro focus",
    "body": "Altcoins posted broader gains in quiet Sunday trading as bitcoin held a tight range near $88K and analysts weighed crypto against the surge in precious metals.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Crypto News|Altcoins|precious metals|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56497221,
    "published": 1766930463000,
    "title": "The Year in Crypto ETFs 2025: Bitcoin, Ethereum Thrive as XRP and More Join the Party",
    "body": "This year, ETFs opened several new doors to crypto on Wall Street, as the SEC forged a fresh approach to the products.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Long Reads",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56503157,
    "published": 1766941247000,
    "title": "Analyst Says XRP Price On The Verge Of Bearish Breakdown",
    "body": "The XRP price has been bearish all through December, with key support zones failing to hold through the growing sell pressure. While the altcoin hovers around the $1.80 price level, recent on-chain evaluation shows that the XRP price could be in a precarious situation. Bearish Divergence Materializes Between RSI And XRP Price In a Quicktake post on the CryptoQuant platform, market analyst CryptoOnchain highlighted that there is a convergence of both technical and on-chain events, which reveal an imminent bearish phase for the XRP price. Related Reading: Cardano Founder Addresses ADA Dump Rumors, Is He Behind The 80% Price Crash? The analyst first pointed out that the XRP price is painting an unsettling picture on its weekly chart, basing this hypothesis on the technical context. While the XRP price hovers near recent highs, indicating intentions to recover previous levels, its momentum tells a contrasting story. CryptoOnchain explained that a bearish divergence has formed between the Relative Strength Index (RSI) and the XRP price. So, as the XRP price appears to target recent highs, the RSI has taken on a clear downturn, creating lower highs progressively. Usually, this type of divergence indicates weakening buying strength and dwindling momentum. Interestingly, historical data reveal that this pattern has often preceded significant price corrections. At the same time, the XRP price happens to be retesting the psychological and technical key level at $1.80. The market quant explained that in the event that $1.80 fails to hold, the altcoin could quickly see the beginning of an unbridled dump. Looking at the broader technical context, it becomes apparent that any significant upside attempt depends on improving momentum. Open Interest On Binance Cascades To New Low CryptoOnchain also cites a shocking development underneath the surface. The relevant indicator here is the Open Interest, which tracks the total value of all outstanding XRP derivatives contracts (on Binance) that have yet to be closed, settled, or liquidated at a given time. XRP’s open interest recently fell to as low as $450 million, a point marking the lowest level since November 2024. A sharp decrease in Open Interest typically points out that there’s been a significant efflux of leveraged capital from the futures market. Related Reading: XRP Stochastic RSI Just Touched 0.0 For The Second Time In History This kind of unchecked contraction suggests that XRP traders are either forcefully exiting the market or abandoning their positions out of fear. Moreover, the decline in Open Interest alongside weakening price momentum paints a narrative on investor interest; it shows that market participants are stepping back due to a lack of conviction, rather than positioning for upward continuation. With these signals converging to expose a strong bearish scenario for XRP, market participants are advised to act with caution, as the $1.80 key level’s defeat could mean serious trouble for the token’s price. As of this writing, XRP is valued at approximately $1.87, with a 1.5% price jump in the past 24 hours. Featured image from iStock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP News|xrp|xrp news|XRP Open Interest RSI|XRP Price|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56516412,
    "published": 1766967391000,
    "title": "Most crypto treasuries ‘will disappear’ amid bleak 2026 outlook: Execs",
    "body": "Many crypto and Bitcoin treasury companies may go under in 2026 as the model comes under pressure, industry executives tell Cointelegraph.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56516890,
    "published": 1766968417000,
    "title": "Flow validators urged to halt work after divisive blockchain rollback",
    "body": "The Flow Foundation has been slammed for rolling the layer 1 Flow chain back to patch up a $3.9 million exploit, with one partner advising validators to stop processing transactions until further notice.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 56519650,
    "published": 1766973648000,
    "title": "Ubisoft halts Rainbow Six Seige after hackers give each player $13.3M credits",
    "body": "A server-wide hack flooded Rainbow Six Siege with billions in credits, forcing an emergency shutdown and a major rollback operation.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 56521043,
    "published": 1766976090000,
    "title": "Bitcoin Price Advances Cautiously, Bulls Probe for Upside Control",
    "body": "Bitcoin price found support and started a recovery wave above $88,000. BTC is now rising and might attempt to surpass the $89,000 resistance. Bitcoin started a recovery wave above the $88,000 zone. The price is trading above $88,000 and the 100 hourly Simple moving average. There is a bearish trend line forming with resistance at $88,750 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move up if it trades above the $89,500 zone. Bitcoin Price Faces Resistance Bitcoin price managed to stay in a positive zone above $85,500 and started a recovery wave. BTC gained pace for a move above the $87,000 and $87,200 levels. The price climbed above the 50% Fib retracement level of the downward move from the $89,484 swing high to the $86,611 low. The bulls even pushed the price above $88,000. Bitcoin is now trading above $88,000 and the 100 hourly Simple moving average . If the price remains stable above $88,000, it could attempt a fresh recovery wave. Immediate resistance is near the $88,750 level and the 76.4% Fib retracement level of the downward move from the $89,484 swing high to the $86,611 low. Besides, there is a bearish trend line forming with resistance at $88,750 on the hourly chart of the BTC/USD pair. The first key resistance is near the $89,500 level. The next resistance could be $89,800. A close above the $89,800 resistance might send the price further higher. In the stated case, the price could rise and test the $90,200 resistance. Any more gains might send the price toward the $90,500 level. The next barrier for the bulls could be $91,500 and $92,000. Another Decline In BTC? If Bitcoin fails to rise above the $89,500 resistance zone, it could start another decline. Immediate support is near the $88,000 level. The first major support is near the $87,250 level. The next support is now near the $86,500 zone. Any more losses might send the price toward the $85,500 support in the near term. The main support sits at $84,500, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $88,000, followed by $87,250. Major Resistance Levels – $88,750 and $89,500.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56521534,
    "published": 1766976535000,
    "title": "Crypto heavyweights slam proposed 5% wealth tax in California",
    "body": "Crypto executives, including Bitwise CEO Hunter Horsley and Castle Island Ventures founding partner Nic Carter, have pushed back against a proposed 5% billionaire tax in California.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 56522013,
    "published": 1766977701000,
    "title": "Ethereum Price Targets Break Above $3K, Bulls Smell Opportunity",
    "body": "Ethereum price started a decent upward move above $2,900. ETH is now showing positive signs and might eye more gains above $3,000. Ethereum started a recovery wave above the $2,920 zone. The price is trading above $2,950 and the 100-hourly Simple Moving Average. There is a bullish trend line forming with support at $2,930 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move up if it settles above the $3,000 zone. Ethereum Price Eyes More Gains Ethereum price managed to stay above the $2,880 pivot level and started a recovery wave, like Bitcoin . ETH price climbed above the $2,920 resistance to enter a positive zone. The bulls were able to push the price above the 50% Fib retracement level of the downward move from the $3,075 swing high to the $2,888 low. Besides, there is a bullish trend line forming with support at $2,930 on the hourly chart of ETH/USD. Ethereum price is now trading above $2,950 and the 100-hourly Simple Moving Average . If the bulls are able to protect more losses below $2,950, the price could continue to move up. Immediate resistance is seen near the $3,000 level and the 61.8% Fib retracement level of the downward move from the $3,075 swing high to the $2,888 low. The first key resistance is near the $3,030 level. The next major resistance is near the $3,050 level. A clear move above the $3,050 resistance might send the price toward the $3,120 resistance. An upside break above the $3,120 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $3,200 resistance zone or even $3,220 in the near term. Another Decline In ETH? If Ethereum fails to clear the $3,000 resistance, it could start a fresh decline. Initial support on the downside is near the $2,950 level. The first major support sits near the $2,920 zone. A clear move below the $2,920 support might push the price toward the $2,880 support. Any more losses might send the price toward the $2,800 region. The next key support sits at $2,720. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI – The RSI for ETH/USD is now above the 50 zone. Major Support Level – $2,950 Major Resistance Level – $3,000",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56523656,
    "published": 1766980102000,
    "title": "Bitcoin helps USD's reserve status ‘in a strange way’: Coinbase CEO",
    "body": "Bitcoin is helping reinforce the US dollar’s reserve currency status by acting as a market check on excessive inflation and deficit spending, Coinbase CEO Brian Armstrong said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]