[
  {
    "id": 56690078,
    "published": 1767274244000,
    "title": "Bitcoin Could Be Setting Up A Comeback Vs. Gold, Analyst Suggests",
    "body": "A veteran market analyst has flagged a technical pattern that could signal a turning point for Bitcoin after months of underperformance versus gold. The move comes as traders weigh whether the long run of gains for the yellow metal has exposed limits in Bitcoin’s safe-haven story. Related Reading: Gold And Stocks Ran Ahead, But Bitcoin May Close The Gap In 2026 Bitcoin Versus Gold Ratio Down The Bitcoin-to-gold ratio has plunged. It fell from 32 on Oct. 5 to about 20 today, a drop of more than 37%. According to the data, that means one Bitcoin bought roughly 32 ounces of gold in early October but now buys about 20. The ratio’s slide has accelerated since gold’s rally took hold and Bitcoin’s price slipped below key levels. Daily readings point to a possible change in momentum. On Nov. 21 the BTC/GOLD pair hit a low of 20 and the RSI stood at 21.30. A lower low near Dec. 1 came with a higher RSI low of 26.83. Then another trough at 19 on Dec. 26 coincided with a higher RSI low of 32.21. That’s a valid bullish divergence on the daily timeframe for BTCUSD vs. Gold. Interested to see where that leads us into 2026. pic.twitter.com/D6ei8HsIDy — Michaël van de Poppe (@CryptoMichNL) December 31, 2025 Based on reports, Michaël van de Poppe called this pattern a “strong” bullish divergence on the daily chart, a setup traders watch because it can show selling pressure easing even as prices make new lows. Technical Signals Show Cooling Selling Pressure On the weekly chart the picture adds weight to the signal. The weekly RSI for the BTC/GOLD pair has sunk to about 31.85 at press time. That level was last seen during the November 2022 sell-off tied to the FTX collapse, a point that marked a bottom in that cycle. Reports also link similar RSI lows to the bottoms seen in 2015 and 2018. Taken together, the daily divergence and the low weekly RSI make a stronger case that the downtrend may be losing steam, though nothing is guaranteed. Market Sentiment Splits Investors Gold’s rally has been dramatic. Reports show gold surged by over 70% in 2025 while Bitcoin fell by 7% over the year in some measures. At press time Bitcoin trades at $87,750, down 4.8% year-to-date. The breakdown in the Bitcoin-to-gold ratio and Bitcoin’s continued weakness below $100,000 have prompted fresh questions about the “digital gold” story as bullion posts historic gains. Short-term money appears to favor gold for capital protection. Many traders are treating the metal as a shelter while it climbs to new highs. Long-term holders, however, still point to Bitcoin’s potential for big upside once risk appetite returns. Related Reading: Crypto Headed For A $10 Trillion Future? Hoskinson Says RWA Is The Key According to market watchers, the near-term outlook hinges on whether the BTC/GOLD ratio and price action deliver follow-through above key levels. Until that happens, signals will remain tentative. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|gold|yellow metal",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56690190,
    "published": 1767274174000,
    "title": "SOL accumulation tops crypto trends on New Year’s Day: Santiment",
    "body": "Whale accumulation across Solana tokens is headlining crypto-related social buzz as 2026 begins, according to data from Santiment.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56691155,
    "published": 1767276379000,
    "title": "Base’s creator coin experiment meets resistance after Nick Shirley launch",
    "body": "Base’s push into creator coins is facing mounting criticism from traders and builders after Nick Shirley’s token on Zora spiked to about a $9 million valuation and then promptly slumped.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 56690991,
    "published": 1767276000000,
    "title": "The Federal Reserve Is The Christmas Gift That Keeps On Taking",
    "body": "On its 112th anniversary, the Federal Reserve's track record speaks clearly: 97% purchasing power lost, M2 up 140,000%. Bitcoin offers a fundamentally different path.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56691482,
    "published": 1767276900000,
    "title": "The XRP Army got everything except $5 price: Will 2026 deliver?",
    "body": "XRP scored every major win in 2025 with the SEC case resolved and spot ETFs launched, yet the price crashed 50%, with the $5 target remaining elusive.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56692869,
    "published": 1767279647000,
    "title": "Dogecoin Mirrors AMD’s Setup From Last Year, Analyst Claims",
    "body": "Dogecoin’s pullback is starting to look like a setup, not a breakdown, at least according to crypto analyst Cantonese Cat (@cantonmeow), who says the meme coin is behaving the way AMD did before its turn higher last year. Can Dogecoin Replicate The AMD Rally? In a X post on Dec. 31, the analyst argued that slipping prices on weakening volume and growing public reluctance to be bullish is exactly what improves the trade’s risk/reward. “I said that about AMD last year. I’m saying that about DOGE right now,” Cantonese Cat wrote. “The lower price goes down on low volume. The more worried influencers are to publicly be bullish on it. The less people care about this. The better risk-reward ratio there is.” The Dec. 31 chart is built around Fibonacci retracement levels mapped from DOGE’s prior move, with key bands marked at roughly $0.373 (0.886), $0.297 (0.786), $0.202 (0.618), $0.154 (0.5), $0.118 (0.382), $0.084 (0.236) and a lower reference near $0.049 (0). In that view, DOGE is shown sliding into the 0.382 region (around $0.118), a level many technicians watch as a make-or-break area for whether a pullback remains corrective or risks turning into a deeper unwind. Related Reading: Dogecoin Near $0.11–$0.12 Offers ‘Incredible Risk/Reward,’ Says Analyst Below price, Cantonese Cat’s volume bars are annotated with downward arrows, reinforcing the point made in the accompanying commentary: as DOGE moved lower, participation appeared to fade. For the analyst, that combination: declining price paired with softer volume and a more reluctant public tape fits a pattern where marginal sellers can exhaust without attracting aggressive new supply. Long-Term Dogecoin Price Targets Cantonese Cat’s earlier Dec. 20 post sets the broader roadmap, describing the preceding stretch as a prolonged downcycle and positioning the current phase as a corrective structure rather than a fresh trend. “We’ve already had a 13 month bear market for DOGE, with my working hypothesis of this being likely a wave 2 correction prior to wave 3 explosion,” the analyst wrote. “The entire reason why this may play out is that it doesn’t feel likely right now, and you want me to stop posting.” Related Reading: Dogecoin Chart Mirrors Silver’s Breakout, Analyst Flags $9+ Scenario That Dec. 20 chart also projects upside targets using Fibonacci extensions, with levels plotted well above the prior range. The marked extension ladder includes roughly $0.90 (1.272), $1.25 (1.414), and $1.99 (1.618), with more aggressive levels further out near $4.78 (2.0) and $8.91 (2.272). The thesis is not that those levels are imminent, but that the convexity of a potential “wave 3” is what makes the current pullback, if it holds the corrective framing, attractive from a risk/reward standpoint. Notably, the AMD comparison is not the only cross-market framing Cantonese Cat has used recently. The analyst has also drawn parallels between Dogecoin and silver, according to our recent coverage, extending the same core idea across different assets: periods that feel uninteresting or unpopular can be precisely when the setup becomes more asymmetric. At press time, DOGE traded at $0.12. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|AMD|doge|DOGE news|Doge price|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56695847,
    "published": 1767285045000,
    "title": "$1.6 Trillion Asset Manager Goes Deep Into XRP, Shares Reason Behind The Move",
    "body": "A major institutional player in global finance has made its position on XRP clear, placing the cryptocurrency at the center of its digital asset strategy. Franklin Templeton, an asset management firm handling over $1.6 trillion worth of assets, used a recent post on the social media platform X to explain why it is going deep into XRP as an asset, while also drawing attention to its Spot exchange-traded product, XRPZ. This interesting comment is part of a growing institutional confidence in XRP and the XRP Ledger. Franklin Templeton’s Strategic Entry With A Spot XRP ETF Franklin Templeton’s arrival in the XRP ETF space is one of the most significant endorsements of the token from a legacy financial institution. The firm launched the Franklin XRP Trust, trading under ticker XRPZ on the NYSE Arca in late November, offering investors regulated exposure to the digital asset without the operational complexity of holding the token directly. Related Reading: Can Dogecoin Price Reach $1 In 2026? Analysts Reveal What To Expect The fund is structured as a grantor trust that holds XRP and calculates its net asset value daily based on established reference rates, with custody provided by Coinbase Custody Trust Company and administration by BNY Mellon. Recent comments from leading voices at the fund manager reveal that the decision to launch a Spot XRP ETF is due to their strong belief in XRP and the XRP Ledger. Roger Bayston, Head of Digital Assets at Franklin Templeton, highlighted the XRP Ledger’s designed capability for real-time, low-cost settlement and efficient cross-border payments. Furthermore, he noted that the altcoin’s market capitalization and role in global value transfer make it an important component worth regulated exposure for investors with a broad portfolio. The firm’s broader digital asset suite already includes Bitcoin and Ethereum ETFs, and XRP was the latest to join this year. Franklin Templeton traces its roots back to 1947 and has built a reputation of trillions in equity, fixed income, and multi-asset investments in markets all around the world. Its move into crypto ETFs, now encompassing Bitcoin, Ethereum, and XRP exposure, is part of many established asset managers now actively engaging in the crypto industry. Performance And Market Reception Of XRPZ Since Launch Several issuers received clearance for Spot XRP ETFs in 2025, making it possible for institutions and everyday investors to gain exposure to the cryptocurrencies through regulated means. Since their debut in November, the Spot ETFs, including XRPZ, have attracted meaningful capital flows. Related Reading: What Happens If The Bitcoin Price Closes 2025 In The Red? Analyst Answers Collectively, these products have drawn more than $1.16 billion in net inflows, maintaining consecutive days of inflows that stand in contrast to recent days of outflows in Bitcoin and Ethereum ETFs. Franklin Templeton’s XRPZ itself has grown its holdings past 100 million XRP, with a cumulative inflow of about $242 million at the time of writing. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Ripple|ripple news|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56696892,
    "published": 1767286863000,
    "title": "Crypto Crystal Ball 2026: Are We Headed for Bitcoin and Crypto Winter?",
    "body": "Bitcoin at $200,000? Massive volatility? Experts predict where the markets are headed—and it's probably not another winter.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56697626,
    "published": 1767288094000,
    "title": "Happy New Year, Mark Cuban: Judge dismisses lawsuit over Voyager Digital",
    "body": "The class-action suit, filed against Cuban and others in August 2022 shortly after Voyager filed for bankruptcy, alleged “false representations and other deceptive conduct.“",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 56698762,
    "published": 1767290447000,
    "title": "Crypto Exchange Korbit Fined $1.90 Million By South Korean Regulators",
    "body": "South Korea’s top money-laundering watchdog has slapped crypto exchange Korbit with a fine worth about ₩2.73 billion, or roughly $1.90 million, after finding widespread lapses in its compliance controls. Related Reading: Crypto Headed For A $10 Trillion Future? Hoskinson Says RWA Is The Key According to regulator statements and multiple news reports, the move follows an on-site inspection that uncovered thousands of rule breaches and several risky transfers abroad. Regulatory Findings And Scope Of The Inspection The Financial Intelligence Unit said inspectors found nearly 22,000 breaches related to AML and KYC rules. The FIU said the inspection, carried out from October 16 to 29, 2024, exposed serious gaps in how Korbit verified customer identities and handled transactions. Reports have disclosed that the exchange allowed some customers to trade before full verification was completed and accepted unclear or incomplete identity documents in many cases. The regulator also flagged 19 overseas transfers involving three unregistered foreign virtual asset service providers, a practice that is restricted under Korean law. The FIU highlighted the failure to carry out required risk checks for certain services, including some nonfungible token activities. In total, 655 cases were cited where mandatory risk assessments were not completed, according to the findings. Corporate responsibility measures were taken as well: the CEO received a formal caution and the compliance officer was reprimanded. An institutional warning was issued alongside the monetary penalty. Transaction Failures And Enforcement Details The inspection report described multiple instances where trading or withdrawals proceeded despite incomplete KYC steps. Such lapses raise the chance that illicit funds could move through the platform without timely detection. The FIU’s action is part of a broader push by South Korean authorities to tighten oversight of exchanges and bring them into closer alignment with international anti-money-laundering standards. Market sources indicate Korbit has been in discussions with Mirae Asset Group about a potential deal, with the exchange’s valuation reported at around ₩140 billion — roughly $97–$98 million. That interest comes even as regulators step up scrutiny, showing that traditional finance remains curious about crypto assets despite compliance headaches. Related Reading: Crypto ETFs Defy The Pullback With $32 Billion In Fresh Investor Cash What The Penalty Means For The Industry Other exchanges have also faced tougher checks in recent years as authorities press platforms to shore up controls. The Korbit case is likely to prompt more internal reviews across the sector and could speed up changes in procedures, staffing and technology meant to prevent repeat failures. Some measures will be public, while others may be handled behind closed doors. Korbit declined to comment directly to some outlets, while the FIU confirmed the sanction on December 31, 2025. The exchange will now need to demonstrate fixes or face possible further action. Featured image from Pexels, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|aml|crypto|korbit|South Korea",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56701455,
    "published": 1767295856000,
    "title": "Analyst Reveals Why The Bitcoin Price Is Extremely Bearish Right Now",
    "body": "Bitcoin’s short-term price action is still without bullish momentum, and according to macroeconomist Henrik Zeberg, the longer-term outlook may be deteriorating as well. Henrik Zeberg shared a strongly bearish assessment of the market’s current structure in a post on the social media platform X with the conclusion that Bitcoin is no longer behaving like an asset in a healthy expansion phase. Instead, he described Bitcoin as approaching an important peak, warning that the current structure carries an elevated risk of a sharp downside move once that peak is in place. Bitcoin’s Expanding Diagonal Points To Price Top Zeberg’s Bitcoin outlook is based on the expanding diagonal structure on Bitcoin’s monthly candlestick timeframe chart. This long-term pattern, which has been playing out since Bitcoin’s creation, shows increasing volatility, with the Bitcoin price making higher highs and lower lows with a widening range. Related Reading: People Are Not Ready For Bitcoin; Analyst Reveals What’s Coming Next According to the chart he shared, Bitcoin appears to be completing the final stages of this structure, and this is expected to be characterized by exhaustion. Zeberg labels the current zone as a topping area, where upside progress becomes increasingly unstable even if the price continues to increase. Interestingly, the chart projected a final surge as a blow-off top that could carry Bitcoin to the mid-$150,000 range. However, in this framework, that final push is not a sign of strength but a hallmark of late-cycle overconfidence. Expanding diagonals tend to resolve violently once the structure breaks, and Zeberg views the current setup as looking like where optimism peaked just before a reversal. From Euphoria To A Deep Crash Scenario Zeberg’s most controversial claims are in his projected downside targets. According to him, once the final euphoric rally plays out and Bitcoin reaches above $150,000, it could enter into a collapse on a scale that most Bitcoin investors currently consider unthinkable. Related Reading: Analyst Predicts When The Bitcoin Supercycle Will Actually Begin He compared the setup to the dot-com era, when the Nasdaq fell by more than 80%, and noted that Bitcoin has historically amplified both upside and downside moves. Based on that logic, he predicted a scenario where a broader AI and crypto bubble unwinds, leading to a Bitcoin price crash of about 97% or 98% from the eventual peak. This translates into a technical minimum target between $3,000 and $4,000, with the possibility of even deeper declines. Although the final rally may be dramatic, holding through the subsequent crash could be devastating for unprepared investors. Zeberg also highlighted momentum indicators that he believes support the bearish outlook. Bitcoin is showing what he describes as massive bearish divergence on the monthly timeframe. This is a situation where price continues to grind higher but momentum indicators such as the RSI fail to confirm those highs. Another indicator is the monthly MACD, which is also approaching, or already printing, a bearish crossover on the long-term chart. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|Henrik Zeberg|MACD|NASDAQ|RSI",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56708991,
    "published": 1767312035000,
    "title": "Bitcoin Cycle Defined by Demand, Not Price: CryptoQuant Head Says",
    "body": "Head of research at on-chain analytics firm CryptoQuant has explained how demand makes the basis of a Bitcoin cycle, rather than price performance. Bitcoin Apparent Demand Has Been Declining Recently In a new post on X, CryptoQuant head of research Julio Moreno has talked about Bitcoin cycles from a different lens. “Most are focusing on price performance to define a cycle, when it is demand what they should be looking to,” noted Moreno. Related Reading: XRP At Risk Of A Drop To $0.80? Analyst Makes The Case The analyst has gauged the “demand” for the cryptocurrency using the Apparent Demand indicator, which compares the daily miner issuance against the changes in the 1-year dormant supply. The first of these, the miner issuance, is the amount that miners are “minting” on the network every day by receiving block rewards. This metric essentially reflects the “production” of the asset. The 1-year inactive supply, on the other hand, can be thought of as the cryptocurrency’s “inventory.” Thus, the Apparent Demand basically compares the production of Bitcoin against changes taking place in its inventory. Below is the chart shared by Moreno that shows the trends in the 30-day and 1-year versions of the Apparent Demand over the past decade. As is visible in the graph, the last few Bitcoin cycles have all transitioned into a bear market when the Apparent Demand has plunged into the negative region on both the monthly and yearly timeframes. In the current cycle, the 30-day Apparent Demand has plunged into the red zone recently, suggesting that the monthly demand for the asset has been negative. On the annual scale, the metric is still at a positive level, but its value has been following a downtrend. If this decline keeps up, it won’t be long before the indicator has dipped into the negative territory. Considering the pattern from the previous cycles, the current structure in the Apparent Demand is certainly looking bearish. It only remains to be seen, though, whether the yearly version of the metric will cross into the red zone or if it will rebound, signaling the return of demand. Spot demand isn’t the only way to measure Bitcoin demand these days. With the advent of exchange-traded funds (ETFs), there has been some fresh off-chain demand coming into the cryptocurrency this cycle. Related Reading: Bitcoin Coinbase Premium At Rare Discount As US Demand Weakens As on-chain analytics firm Glassnode has talked about in an X post, the 30-day netflow related to the US BTC spot ETFs has remained in the negative zone recently, indicating demand has been muted in this side of the market as well. BTC Price Bitcoin has taken to consolidation recently as its price is still floating around the $88,000 level. Featured image from Dall-E, Glassnode.com, CryptoQuant.com, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin Cycle|Bitcoin demand|bitcoin price|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56708989,
    "published": 1767312020000,
    "title": "Dogecoin Long-Term Bullish Structure Still In Play And Will Cross $10",
    "body": "Dogecoin (DOGE) is back in focus as long-term chart structures continue to signal sustained bullish potential. While recent monthly price action has remained muted, a crypto analyst maintains that the meme coin’s broader technical trend has not been compromised. The analyst has projected that DOGE could eventually rally toward a long-term move beyond the $10 level. Dogecoin Bullish Structure Points Toward $10 On December 31, crypto market expert Olivier D Maximus posted on X that Dogecoin remains structurally bullish and could eventually cross $10. He noted that although price action has been slow and unimpressive, DOGE’s bullish framework continues to favor higher valuations in the long term. Related Reading: 7-Period Fractal Trend Says Dogecoin Price Is Headed To $10 He shared a new detailed chart analysis, indicating that DOGE’s monthly close generated little short-term excitement. However, he emphasized that the broader bullish framework remains intact, with attention now turning to what January may bring as the next decisive phase. Maximus pointed out that long-term structures often move quietly before big gains, and Dogecoin appears to be following this pattern. He stressed that patience is required when analyzing higher time frames, as monthly charts tend to capture macro trends rather than immediate volatility. In his view, the current consolidation does not invalidate Dogecoin’s upside thesis. The analyst’s chart showed Dogecoin trading within a clearly defined Ascending Channel that has held for several years. The meme coin’s price remains above the long-term rising support zone, reflecting higher lows over time. Additionally, multiple diagonal trend lines show that DOGE’s price has repeatedly corrected toward mid-channel support before resuming upward movement. These pullbacks appear controlled, reinforcing the possibility of a healthy long-term uptrend. Maximus has also spotlighted several ATH levels he expects Dogecoin to reach over time. The ascending channel seen on the chart points toward potential targets above $12, extending as high as $25. Moreover, the analyst has suggested that if Dogecoin maintains its structural integrity, future trends could push the meme coin into double-digit territory, making a surge from under $1 to $10 technically plausible. DOGE Enters Make Or Break Zone In 2026 In a separate X post, crypto analyst Trader Tardigrade revealed that the Dogecoin price is currently trading within a Descending Triangle, with the price sitting at the tip of the pattern around $0.122. This level has been highlighted as a potential make-or-break point where a pullback or surge could determine Dogecoin’s next big move. Related Reading: What The Rise In Open Interest Means For The Dogecoin Price If price breaks above the upper boundary of the Descending Triangle, Trader Tardigrade predicts that Dogecoin could experience a breakout to the upside. He has set a target of around $0.132, representing a surge of approximately 8.2% from the current price level. On the other hand, if DOGE breaks below the lower boundary of the triangle, the meme coin could tumble further toward $0.116, representing a roughly 4.9% crash. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|Ascending Channel|Descending Triangle Pattern|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt|meme coin|Olivier D Maximus|Trader Tardigrade",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56710130,
    "published": 1767314278000,
    "title": "Turkmenistan rings in new year with crypto exchanges, miners",
    "body": "Turkmenistan has started the year with a bang, with new laws legalizing the operation of crypto exchanges and crypto miners kicking in on Jan 1.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56714590,
    "published": 1767324110000,
    "title": "Dogecoin surges 7% as a double-bottom break sparks DOGE rally",
    "body": "The breakout was supported by spot activity, indicating a healthier market move.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56715192,
    "published": 1767324976000,
    "title": "Tether adds nearly $800 million in bitcoin, bringing holdings above 96,000 BTC",
    "body": "The purchase is part of Tether's strategy to use up to 15% of its quarterly profits for bitcoin acquisitions.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|btc|USDT|Tether|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56717078,
    "published": 1767329344000,
    "title": "Solana enters 2026 with last-minute boost in RWA momentum",
    "body": "Solana finished the year with record tokenized RWA activity and strong inflows into Solana ETFs, which could push SOL toward new highs in 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56720371,
    "published": 1767336492000,
    "title": "DeFi pioneer coughs up $50K after making a pretty bad bet on Ether",
    "body": "Ethereum OG Kain Warwick, the founder of Infinex and Synthetix, missed the mark by about $20,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56721930,
    "published": 1767339937000,
    "title": "Bitcoin ETFs lose record $4.57 billion in two months",
    "body": "Spot BTC ETFs registered their sharpest outflows on record through November and December as prices dropped 20%.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|ETFs|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56723554,
    "published": 1767343506000,
    "title": "Austin Arnold Unveils His Top 6 Crypto Altcoin Picks For 2026",
    "body": "Altcoin Daily host Austin Arnold used a Jan. 1 video titled “Top 6 Crypto Altcoins To Invest In For 2026” to lay out what he framed as three “first-time” catalysts for crypto in 2026 and a corresponding list of six altcoins he says he’d “buy and hold” into that backdrop, spanning smart-contract platforms, AI infrastructure, and tokenization-focused plays. Arnold opened with the claim that crypto sits at the center of “two mega trends”: digital assets and the tokenization of financial assets and argued the combination of macro policy, US legislation, and SEC posture could drive “trillions of dollars” of new inflows. The 3 Bullisch Crypto Catalysts First, Arnold pointed to what he described as a monetary-policy regime shift, including the resumption of “reserve management purchases,” and framed it as supportive for risk assets broadly. “We’re starting to see significant stimulus,” he said, adding that markets were already seeing “quantitative easing light” as “the Fed is starting to buy its own bonds,” while suggesting demand for government debt could fall alongside lower rates. Related Reading: Scaramucci Picks His Top 3 Crypto Altcoins As Rate-Cut Tailwinds Build Second, he argued crypto-specific regulation could function like a green light for institutional capital. He singled out the market structure focused Clarity Act, saying its passage would be “like a starter gun for ETH and SOL to run into trillions of dollars of value,” and noted discussion of a US Senate markup date of Jan. 15 with hopes of movement by late January or February. Third, Arnold highlighted what he called a tokenization push led by SEC chair Paul Atkins, describing “Project Crypto” as an effort to “bring all of traditional finance on the blockchain.” He paired that theme with a distribution angle around spot crypto ETFs, leaning on a quote he cited about how unusual the early ETF growth was: “These were the single best-selling product in the world and no one was allowed to make a phone call to sell it or advertise it,” he said. Top 6 Crypto Altcoins To Invest In For 2026 Arnold’s first pick is Ethereum. He frames it as the primary beneficiary of stablecoin growth and added that stablecoins are “mostly on the Ethereum blockchain,” and tied the thesis to regulation via the Genius Act, citing a view that Treasury Secretary Scott Bessent expects the sector to grow “10x in the next few years.” Arnold also said Ethereum’s stablecoin share rose to 53% from the high-40s “just a few months” earlier, and argued the link to ETH value accrual runs through fees: “30% of all fees on Ethereum are actually stablecoin revenue,” he said. “So as this is 10x’es the amount of fees, the amount of Ethereum being burned should be 10x to match.” Arnold’s second pick was Solana, which he portrayed as a usage leader relative to its market value versus Ethereum. He argued Solana is “already one of or if not the most used chain in crypto,” and claimed that through 2025 it was “more used than the entire rest of the industry combined times 2 to three.” He also cited a real-world asset milestone, saying Solana “RWA holders…have surpassed 125,000 holders.” Cardano is next, which Arnold said had a weak 2025 but could benefit from founder Charles Hoskinson’s push around Midnight. Arnold played a longer excerpt in which Hoskinson argued privacy could be the wedge that changes user behavior: “They can go through Midnight to Cardano and they get privacy. They do something new and different,” Hoskinson said. “Midnight my view will be through hybrid applications… private prediction markets, private DEXes, private stable coins… maybe… those Bitcoin people are going to want to trade on a private DEX instead of a public DEX.” Related Reading: Crypto ETFs Defy The Pullback With $32 Billion In Fresh Investor Cash Arnold then shifted to AI infrastructure with Bittensor (TAO), calling it “decentralized AI” plumbing and noting it had a recent “halving” and a fixed supply model he compared to Bitcoin’s. He also pointed to early-2026 ETF momentum, saying Grayscale filed an S-1 for a TAO product and Bitwise followed with a Bittensor ETF filing. For tokenization exposure, Arnold highlighted Ondo Finance (ONDO) ahead of what he described as an Ondo Summit on Feb. 3, where “world leaders, investors, policy makers” would reconvene, and closed his list with Propy, a real-estate-focused project he said is “US licensed” for title and escrow closing and “backed by Coinbase,” positioning it as a bet on bringing home buying and selling “on-chain.” Arnold closed his list with Propy, explicitly flagging it as the most speculative end of the spectrum and pairing it with a warning that lower-cap exposure can mean “these altcoins go to zero.” The Altcoin Daily host described it as “essentially real estate on-chain.” He emphasized operational and regulatory positioning as part of the pitch, saying Propy is “US licensed title and escrow closing,” and also highlighted its backers: “They’re backed again by Coinbase.” The investment thesis, as Arnold presented it, is straightforward tokenization logic applied to housing: bringing parts of the buying and selling process onto rails that can be settled and recorded on-chain, with Propy positioned as a project already operating within the US compliance perimeter he expects to matter more in 2026. At press time, the total crypto market cap stood at $2.98 trillion. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|Best Altcoins 2026|crypto|Crypto Altcoins 2026|crypto news|Top Altcoins 2026",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56725782,
    "published": 1767348292000,
    "title": "Internet Computer climbs back to $3 as short-term momentum improves",
    "body": "ICP pushed above the $3 level on rising activity, holding recent gains as traders reassess near-term direction.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Technical Analysis|ICP|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 82,
        "NAME": "ICP",
        "CATEGORY": "ICP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56727316,
    "published": 1767351649000,
    "title": "Bitcoin Price Crash To $25,000: Why The Bottom Is Much Lower",
    "body": "Crypto analyst Crypto Whale has explained why the Bitcoin price could still crash to as low as $25,000. The analyst also stated this would form the macro bottom for the leading crypto, as it recovers from this bear market. Why The Bitcoin Price Could Drop To As Low As $25,000 In an X post, Crypto Whale stated that the monthly chart suggested that the Bitcoin price could form a macro bottom near $25,000 sometime in 2026. The analyst further remarked that if history rhymes, these deep retracements tend to mark long-term accumulation zones. He added that this doesn’t signify the end of the cycle but the reset before the next expansion. However, in another X post, Crypto Whale suggested that the Bitcoin price isn’t yet in a bear market, highlighting how the 2026 bull run is likely to unfold. He stated that this month, the crypto market will see a Bitcoin-led rally, while there will be a broad altcoin expansion in February. The analyst expects the bull trap to set in in March, which he predicts would lead to volatility and panic selling. Related Reading: Analyst Reveals Why The Bitcoin Price Is Extremely Bearish Right Now Once that happens, Crypto Whale predicts that May will usher in the capitulation phase, while a full bear market confirmation will happen in June. This outlook for the Bitcoin price comes as research firm XWIN Research noted that BTC has not clearly entered a new bullish trend. The firm further stated that the crypto market remains in a high-volatility range environment, which is neither decisively bullish nor bearish. Meanwhile, XWIN Research raised the possibility that the Bitcoin price could drop to as low as $50,000. They stated that this could happen if recession risks intensify, with deleveraging and ETF outflows pushing the leading crypto below $80,000 and making $50,000 a possibility. BTC Death Cross Signals Drop To $38,000 In an X post, crypto analyst Ali Martinez drew attention to a death cross, which has been recurring on the BTC weekly chart. The analyst noted that if history repeats itself, the Bitcoin price could record a similar 50% to 60% correction, dropping to as low as $38,000 in the process. Related Reading: Bitcoin Enters Decision Phase, But What Does It Mean For The Crypto Market? This death cross between the 10-week and 50-week simple moving averages is said to have occurred in September 2014, leading to a Bitcoin price correction of 67%. It also occurred in June 2018, March 2020, and January 2022, resulting in price corrections of 54%, 53%, and 64%, respectively. Martinez opined that the zone between $50,000 and $38,000 is starting to become interesting from a long-term spot accumulation standpoint. He added that the market will confirm the next move for the Bitcoin price in its own time. At the time of writing, the Bitcoin price is trading at around $88,700, up in the last 24 hours, according to data from CoinMarketCap. Featured image from Pngtree, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|Ali Martinez|altcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|CoinMarketCap|crypto whale|etf|Simple Moving Averages|SMA|XWIN Research",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56728211,
    "published": 1767353400000,
    "title": "5 Trends Crypto Investors Can’t Ignore In 2026",
    "body": "After a year of regulatory thaw and institutional buy-in, crypto is settling into the financial system’s core.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|Money|/money|Daily Cover|daily-cover|Editors' Pick|editors-pick|premium",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56728908,
    "published": 1767355044000,
    "title": "Turkmenistan legalizes crypto mining and exchanges to boost the economy",
    "body": "The legislation aims to boost economic development and foreign investment while treating virtual assets strictly as property.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Virtual Assets Bill|Cryptocurrency Regulations|Crypto Mining|Crypto Exchanges|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56729259,
    "published": 1767355780000,
    "title": "Iran accepts cryptocurrency as payment for advanced weapons",
    "body": "Prospective customers could purchase weapons such as missiles, tanks and drones using crypto, according to a government website.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Iran|Sanctions|cryptocurrency payments|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]