[
  {
    "id": 57213997,
    "published": 1768566631000,
    "title": "Dogecoin Flirts With An Inverse Head And Shoulders: $0.15 Break Is The Trigger",
    "body": "Dogecoin (DOGE) is trying to base on higher timeframes as Cantonese Cat points to a potential inverse head-and-shoulders on the daily, with price compressing just beneath a defined resistance shelf while holding a nearby demand zone. Dogecoin Breakout Could Target $0.19 In a daily chart (DOGE/USD, Binance) shared via X on Jan. 16, Cantonese Cat overlays an inverse head-and-shoulders schematic: a left shoulder in early December, a deeper “head” into late December near the mid-$0.11s, and a developing right shoulder as price rotates lower after the early-January spike. The key feature on that daily view is a highlighted “Buy order block” spanning roughly $0.1250 to $0.1350. Price is shown pulling back toward the top of that block after failing to hold the most recent push higher, which places the current trade location in a classic “right shoulder” area if the pattern is going to remain constructive. Above the current spot price, the chart marks a horizontal grey resistance (“the shoulder”) band at roughly $0.149–$0.152. This is the area DOGE needs to reclaim for the inverse H&S thesis to transition from “forming” to “triggering,” because it has acted as supply on recent tests. Related Reading: Dogecoin Price Is Following This Bullish Signal With A Major Target Using Cantonese Cat’s daily inverse head-and-shoulders chart, the measured move is the neckline minus the head low, projected upward from the neckline: the neckline is the grey supply band centered near $0.151 (label on the axis), while the head prints at roughly $0.116. That gives a height of about $0.035, implying a pattern target near $0.186. Notably, that objective runs directly into the chart’s overhead red supply zone, which begins around $0.175 and extends up toward $0.19, making that area the first obvious region where a confirmed breakout would be expected to meet meaningful resistance. DOGE 2-Day Bollinger Bands Signal Momentum Notably, the Bollinger Bands on the 2-day chart support the mid-term bullish thesis. On Tuesday, Cantonese Cat highlighted that DOGE is trading above the Bollinger basis around $0.1343, while the upper band is near $0.1526 and the lower band near $0.1160. Cantonese Cat summarized the idea succinctly: “Price wanting to hang out at the top part of the Bollinger band? We have a chance here?” In practice, the “top part” framing matters because it’s a momentum tell. After an extended decline, sustained closes above the basis and into the upper half of the bands can signal that sellers are no longer controlling the volatility profile, even before price clears the obvious horizontal resistance. Related Reading: Dogecoin Bulls Don’t Celebrate Too Early: This Level Still Must Fall That said, the 2D view also makes the immediate problem clear: the upper band sits close to the same zone highlighted on the daily as resistance. In other words, the bullish thesis is not just “hold support,” but “prove it” with acceptance above the $0.15–$0.152 region. If DOGE continues to defend the $0.1250–$0.1350 buy-side block and reclaims the $0.149–$0.152 supply band, the inverse head-and-shoulders thesis gains credibility. The next areas the chart itself flags are the higher supply zones around $0.175 and the upper-$0.18s region, where prior selling pressure was visible. If price loses the buy order block, the pattern read weakens materially. In that case, the Bollinger structure on the 2D chart points attention back toward the lower band region near $0.1160 and the late-December lows. At press time, DOGE traded at $0.139. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|doge|DOGE news|Doge price|Dogecoin|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57214173,
    "published": 1768566903000,
    "title": "Jefferies’ ‘Greed & Fear’ strategist cuts Bitcoin allocation to zero on quantum risk",
    "body": "Jefferies’ Greed & Fear strategist Christopher Wood has slashed a 10% Bitcoin allocation from his portfolio and moved into gold, citing the quantum risk to BTC, Bloomberg reports.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57214632,
    "published": 1768568400000,
    "title": "Trump moves on the Fed, Italy warns ‘fin-fluencers’: Global Express",
    "body": "US President Donald Trump is bringing criminal charges against the head of the Fed in what many see as a political move motivated by a desire for lower interest rates.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 57214473,
    "published": 1768568039000,
    "title": "Jefferies strategist Christopher Wood swaps bitcoin for gold on quantum computing concern",
    "body": "Christopher Wood, Jefferies' global head of equity strategy, swapped a 10% bitcoin allocation with gold on concern quantum computing could weaken bitcoin’s security case.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|quantum computing|Investing|Jefferies|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57215754,
    "published": 1768572057000,
    "title": "Crypto Chill: Sentiment Drops As US Lawmakers Stir Market Fears",
    "body": "The market mood in crypto cooled sharply after a quick spike in optimism. According to the Crypto Fear & Greed Index, the reading fell by 12 points on Friday, dropping from 61 to 49. Related Reading: Altcoin Rallies Are Getting Shorter, And Wintermute Has The Data That swing moved the gauge from “greed” into a “neutral” zone in a single session. Bitcoin had jumped about 4.5% earlier in the week to roughly $97,700, which helped push sentiment higher, but the focus shifted toward politics and lawmaking in Washington. Regulatory Concerns Shake Markets Based on reports, the main trigger was debate over a Senate version of a long-awaited crypto market structure bill. The measure would set out how US regulators oversee digital assets and includes language that would tighten rules around stablecoin yields. Several lobbyists and executives raised alarms about those provisions. Brian Armstrong, the CEO of Coinbase, withdrew his backing, saying the proposal would be worse than the current setup and that a bad law would be harmful. After the backlash, the Senate Banking Committee cancelled its planned markup and the Senate Agriculture Committee moved its session to late January while lawmakers seek more support. Social Media Sentiment Shifts As Traders React According to crypto analytics firm Santiment, the market activity had two different trends at once: larger holders were building positions while smaller, retail traders were selling. Social chatter began to reflect worry after the regulatory news, even as on-chain data showed accumulation by more experienced wallets. The index’s peak earlier in the week was the highest since it reached 64 on October 10, the same day a market crash triggered over $19 billion in liquidations. Those past losses still hang in investors’ memories. Smart Money Buys While Retail Sells Reports have disclosed that smart money accumulation can support prices, but headlines shape short-term moods. Bitcoin was trading at about $95,642 at the time of publication, down around 0.02% over the past 24 hours, according to CoinGecko. That small move shows market resilience, yet the sentiment measure’s drop demonstrates how fragile confidence can be when policy doubts emerge. Many traders watch Washington closely, sometimes even more closely than charts. Related Reading: Bitcoin’s New Power Buyers: Companies Bought 3 Times What Miners Produced Delay Seen As Chance By Some Industry Players A segment of the industry read the postponements as constructive. David Sacks, who advises on crypto matters at the White House, said the pause could help close gaps between stakeholders and bring the bill closer to something workable. Brad Garlinghouse, CEO of Ripple, kept engaging with lawmakers and described the delay as an opening to improve the text. Those views contrast with more alarmed voices and help explain the mixed market reaction. Featured image from The Drive, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|btcusd|coinbase|crypto|fear and greed|stablecoin",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57215737,
    "published": 1768571895000,
    "title": "Ethereum ETF buying outpaces new supply: Will it push ETH price to $4.5K?",
    "body": "Renewed spot Ethereum ETF inflows topped $474 million this week while network metrics smashed records, positioning ETH for a rally to $4,500 in the coming weeks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57215505,
    "published": 1768571194000,
    "title": "Huione-linked Tudou Guarantee winds down amid $130M USDT refunds: Bitrace",
    "body": "The apparent shutdown follows years of scrutiny of one of crypto’s largest fraud marketplaces.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57216970,
    "published": 1768575600000,
    "title": "Who gets the yield? CLARITY Act becomes fight over onchain dollars",
    "body": "The CLARITY Act is becoming a fight over who controls yield as rules split DeFi companies and incumbents and risk pushing onchain US dollar yield offshore.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57216739,
    "published": 1768573120000,
    "title": "Early 2026 tailwinds for bitcoin miners as hashrate falls, profitability improves: JPMorgan",
    "body": "U.S.-listed bitcoin miners entered 2026 with rising revenues, improving margins and recovering valuations, setting a more constructive near-term backdrop.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin Mining|Bitcoin News|Hashrate|Iren|JPMorgan|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57216737,
    "published": 1768572935000,
    "title": "CoinDesk 20 Performance Update: Bitcoin Cash (BCH) Gains 3.1%, Leading Index Higher",
    "body": "Aave (AAVE) was also a top performer, rising 1.4% from Thursday.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "CoinDesk Indices|CoinDesk Indices|CoinDesk 20|charts|Prices|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 2,
        "NAME": "AAVE",
        "CATEGORY": "AAVE"
      },
      {
        "TYPE": "122",
        "ID": 12,
        "NAME": "BCH",
        "CATEGORY": "BCH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57216735,
    "published": 1768570775000,
    "title": "BitMine’s $200 million MrBeast investment seen as strategic diversification: B. Riley",
    "body": "The investment gives BitMine exposure to consumer media and potential DeFi revenue streams, strengthening its treasury strategy beyond ether accumulation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitmine|Ethereum Treasury|B. Riley|Analysts|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 57217498,
    "published": 1768577414000,
    "title": "Iranians Turn to Crypto as Economic Crisis and Sanctions Deepen",
    "body": "As Iran’s economy continues to strain under heavy sanctions, high inflation, and a weakening currency, many citizens are turning to crypto as an alternative financial lifeline. Related Reading: Bitcoin Tailwind: Cathie Wood Sees ‘Reaganomics On Steroids’ Ahead Recent blockchain data shows a sharp rise in Bitcoin withdrawals and transfers to personal wallets, particularly during periods of unrest and internet restrictions. For many Iranians, digital assets now serve both as a hedge against currency collapse and a way to move funds beyond government-controlled systems. The Iranian rial has lost around 90% of its value against the U.S. dollar since 2018, while inflation has hovered between 40% and 50%. In response, crypto usage has grown steadily, with Iran’s total cryptocurrency activity reaching an estimated $7.78 billion in 2025, according to Chainalysis. BTC's price trends sideways on the daily chart. Source: BTCUSD on Tradingview Bitcoin Use Rises During Protests and Internet Blackouts Crypto activity surged during mass protests that began in late December 2025, triggered by rising living costs and currency devaluation. As demonstrations spread, authorities imposed internet shutdowns and tightened financial controls. During this period, blockchain data showed higher average daily transaction values and a notable increase in transfers from Iranian exchanges to self-custodied Bitcoin wallets. Smaller withdrawals, often associated with individual users, recorded some of the strongest growth. Medium and large transfers also increased, suggesting that both households and businesses were seeking to move funds out of local platforms. Bitcoin’s appeal lies in its ability to be stored and transferred without relying on domestic banks or state oversight. For Iranians facing restrictions on access to cash, foreign currency, or international transfers, crypto offers a way to preserve value and maintain some financial mobility. Crypto’s Dual Role: Citizens and State Actors While ordinary Iranians are using cryptocurrencies to protect savings, state-linked actors are also active in the digital asset space. Wallets associated with Iran’s Islamic Revolutionary Guard Corps (IRGC) accounted for more than half of the country’s crypto transaction value in the final quarter of 2025. These wallets received over $3 billion during the year, up from around $2 billion in 2024. Western authorities believe the IRGC uses cryptocurrencies to bypass sanctions, move funds across borders, and support regional operations. Chainalysis notes that these figures likely underestimate the true scale, as many affiliated wallets and networks remain unidentified. At the same time, spikes in Iranian crypto activity have closely followed major political and security events, including the Kerman bombings in 2024, missile strikes in October 2024, and a 12-day conflict in June 2025 that disrupted Iran’s largest crypto exchange and a major state bank. A Growing Dependence on Digital Assets For many Iranians, cryptos have become more than a speculative asset. They are increasingly used as a tool for financial survival in an economy marked by inflation, sanctions, and limited access to global markets. Bitcoin’s censorship resistance and portability make it especially attractive during periods of unrest or capital controls. Related Reading: XRP In A ‘Super Cycle’? SuperTrend Suggests Another Story As economic pressures persist and geopolitical tensions remain high, blockchain analysts expect crypto usage in Iran to continue rising. Whether as a means of preserving personal wealth or navigating sanctions, digital assets are now a central part of Iran’s financial landscape. Cover image from ChatGPT, BTCUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|btc|btcusd|crypto|ETH|ethereum|ethusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57217389,
    "published": 1768577013000,
    "title": "Wikipedia Reveals Multiple Deals with AI Giants to Use Its Content",
    "body": "The Wikimedia Foundation said it has inked agreements with Microsoft, Google, Amazon and Meta to use its content for training LLMs.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57217631,
    "published": 1768576695000,
    "title": "Crypto card spending hits $18 billion annualized as stablecoin use shifts to everyday payments",
    "body": "Artemis research shows crypto credit and debit card spending is now rivaling peer-to-peer stablecoin transfers, with Visa capturing most on-chain volume through early infrastructure partnerships.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Visa|Crypto card|Stablecoins|cryptocurrency payments|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57217629,
    "published": 1768576343000,
    "title": "Riot Platforms surges 11%  as lease deal with AMD marks major AI infrastructure pivot",
    "body": "The company sold nearly $100 million of bitcoin to fund the purchase of its 200-acre Rockdale site and signed a leasing agreement with Advanced Micro Devices that could deliver $1 billion in revenue.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin Mining|Riot platforms|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57218277,
    "published": 1768579784000,
    "title": "South Korea Tightens Crypto Access as Google Play Blocks Unregistered Exchanges",
    "body": "A new app store crackdown has landed in South Korea as lawmakers formalize a framework for tokenized securities.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 57218189,
    "published": 1768579636000,
    "title": "Bitcoin pulls back to $94,300 as U.S. stocks sink, precious metals tumble",
    "body": "A selloff in precious metals and lower U.S. stocks appeared to be denting crypto sentiment.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57218768,
    "published": 1768579819000,
    "title": "HR services provider Gusto taps Zerohash to speed up global payouts with stablecoins",
    "body": "Payroll and HR platform Gusto is piloting stablecoin payouts powered by Zerohash, aiming to cut cross-border payment times.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Zero Hash|Stablecoins|Exclusive|Cross-Border Payments|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57219136,
    "published": 1768582821000,
    "title": "XRP Whale Inflows To Binance Hit Their Lowest Level Since 2021: Accumulation Behavior?",
    "body": "XRP is consolidating above the $2 mark after a volatile stretch, as the market begins to wake up and traders watch for the next directional move. While price action remains relatively stable, on-chain data suggests that selling pressure from large holders may be easing, creating a more constructive short-term backdrop for bulls. Related Reading: Bitcoin Bull Score Hits Level Seen Only 7 Times In 6 Years – A Rare Historical Signal A report from Arab Chain on CryptoQuant highlights a sharp decline in whale transfers to Binance over the past few days. Data from the XRP Ledger shows that the Whale Transfer Flow (30DMA) dropped to 48 million XRP before rebounding slightly to 56.1 million XRP, marking the lowest levels recorded since 2021. This metric tracks the average volume of large wallet transfers moving into exchanges, and it is often used as a proxy for whale distribution and sell-side intent. Historically, when whale inflows surge, it tends to signal that large investors are positioning to offload holdings, adding supply to the market and increasing downside risk. However, when these flows compress to unusually low levels, it typically reflects reduced urgency to sell, which can help stabilize price during consolidation phases. With XRP holding above $2, this shift in exchange-bound whale activity suggests the market may be entering a quieter accumulation window, where any breakout will likely depend on fresh demand rather than panic-driven liquidity. Whale Inflows Cool Off as XRP Holds Key Support What makes this reading especially notable is that it comes while XRP remains relatively stable on the price chart. Averaging around $2.15 during the same period. Instead of seeing whales rush to exchanges into strength, the data suggests large holders are choosing to stay positioned. Investors may prefer to hold XRP rather than actively distribute it into the market. This type of behavior is often associated with “quiet” market phases. Where price compresses and liquidity thins out, setting the stage for a larger move once demand returns. When exchange-bound whale transfers fade, it typically means fewer coins are immediately available for sale. This can reduce resistance on small upside pushes and keep downside moves more contained. Historical context adds weight to the signal. In 2021, the last time whale inflows to exchanges reached similarly low levels, XRP was entering periods that later developed into stronger upward trends. Back then, supply on exchanges stayed constrained while demand gradually built, allowing price to respond more efficiently once momentum shifted. For now, the current decline in whale inflows is easing short-term sell pressure and improving the supply setup. If buyers step in with stronger volume, XRP may be better positioned to break out of consolidation without facing heavy distribution from large wallets. Related Reading: Bitcoin Reclaims $97K As Long-Term Holders Supply Stays Locked XRP Momentum Stalls Under Key Averages XRP is trading near $2.06 on the daily chart after weeks of choppy consolidation. Showing a market that is stabilizing but still lacks strong trend conviction. Price has held above the psychological $2 level, which has served as a short-term floor following the late-2025 selloff that dragged XRP toward the $1.80–$1.90 zone. However, the rebound remains technically fragile, as XRP is still trading below key moving averages that continue to slope downward. The blue and green trend lines, which represent medium-term resistance, sit above the price and highlight how sellers have defended rallies since November. XRP’s recent push higher was met with rejection near the $2.30–$2.35 area. Reinforcing that demand has not yet been strong enough to reclaim higher levels and shift the market structure bullish. Related Reading: Bitcoin Bulls Take Control: Futures Positioning Turns Bullish for First Time Since October Volume has also remained relatively muted outside of isolated spikes, suggesting the market is not seeing aggressive expansion in participation. For bulls, the immediate objective is building acceptance above $2.20 and flipping the descending averages into support. If XRP loses $2, downside pressure could quickly return toward the $1.90 area. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|Binance XRP|xrp|XRP Accumulation|xrp news|XRP Whale|XRP Whale Activity|XRP Whale Binance Inflow|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57219321,
    "published": 1768583268000,
    "title": "Bitcoin is now most undervalued versus gold: Will BTC price rebound?",
    "body": "BTC price surged nearly 150% after a similar BTC–gold undervaluation signal in late 2022, highlighting how extreme discounts have preceded major rallies.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57219718,
    "published": 1768584680000,
    "title": "Nasdaq Warns Bitcoin Hardware Maker Canaan About Delisting",
    "body": "Bitcoin miner Canaan faces Nasdaq delisting deadline as shares languish below $1 despite major hardware order and brief October rally.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57220396,
    "published": 1768586955000,
    "title": "Despite the Dip, Bitcoin Just Flashed Its Most Reliable Bullish Signal: Analysis",
    "body": "The price of Bitcoin is down today, but BTC also just flashed its most-watched bullish signal. Is a recovery rally on the way?",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57220559,
    "published": 1768587307000,
    "title": "Riot Platforms shares jump 11% after Bitcoin sale funds Texas deal",
    "body": "The deal followed Riot announcing last week that it sold more than $160 million of its Bitcoin holdings as part of a strategy shift, to broaden use of its data centers.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57221052,
    "published": 1768589250000,
    "title": "Tom Lee's BitMine pushes Ethereum staking network into $8 billion backlog",
    "body": "New validators now need to wait more than 44 days to start earning staking rewards, the biggest backlog since late July 2023.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Tech|Ethereum News|Ethereum staking|Staking|Bitmine|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57221593,
    "published": 1768590967000,
    "title": "State Street, a $36 billion bank, is aiming to change legacy finance using blockchain tech",
    "body": "CEO Ronald O’Hanley says the transformation isn’t about bitcoin, but about reengineering traditional assets for faster, modern rails.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|State Street|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57221367,
    "published": 1768590000000,
    "title": "Bitcoin rallies, ETF flows rebound as US crypto policy stalls: Finance Redefined",
    "body": "Bitcoin breached the $95,000 mark this week amid a wider market recovery, as investors digested regulatory delays to the much-awaited CLARITY Act in the US.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57222431,
    "published": 1768593648000,
    "title": "Bitcoin Price Will Still Rally Above $99,000 Despite Bearish Sentiment, Here’s Why",
    "body": "Crypto analyst TARA has predicted that the Bitcoin price will still rally despite bearish signals that have surfaced. She highlighted why the flagship crypto could reach this level and what could happen once it touches the price target. Analyst Predicts Bitcoin Price Surge To $99,000 In an X post, TARA opined that the Bitcoin price will reach $99,300, even though the flagship crypto is printing a bearish candlestick. She stated that BTC wants to touch this price target before it retraces deeper so that the correction does not break the critical support at $90,000. The analyst added that retracement levels for BTC will continue to be adjusted, with the new 2026 high above $97,000, while revealing subwaves on the way to the full target at $103,000. Related Reading: Analyst Outlines The Bulllish And Bearish Scenarios For Bitcoin – Here’s What To Know Notably, crypto traders are currently betting on the Bitcoin price rallying past the $99,000 level and reaching the psychological $100,000 level. Polymarket data shows a 48% chance that BTC will rally to $100,000 this month. This follows the flagship crypto’s recent rally from around $92,000 to above $97,000 following the release of the soft CPI inflation data earlier this week. The spot Bitcoin ETFs have also contributed to the Bitcoin price surge to start the year. In an X post, Bloomberg analyst Eric Balchunas highlighted that ETFs recorded net inflows of $843 million on January 14 and now boast 1-week net inflows of $1 billion and $1.5 billion year-to-date (YTD). With BTC rallying to $97,000 after trading sideways towards the end of last year, Balchunas opined that the buyers may have exhausted the sellers. Arthur Hayes Predicts Bitcoin Rally On Rising Liquidity In his latest blog post, BitMEX co-founder Arthur Hayes predicted that the Bitcoin price could sustain this rally as dollar liquidity rapidly increases. Hayes expects dollar liquidity to increase as U.S. President Donald Trump finds more ways to inject liquidity into the economy. The BitMEX co-founder highlighted how Trump plans to lower mortgage rates, which could cause Americans to borrow more. Related Reading: What’s Going On With Bitcoin And The Stock Market? Analyst Breaks It Down Hayes also mentioned that the liquidity in 2025 didn’t support crypto portfolios, which is why the Bitcoin price underperformed. He urged market participants not to draw wrong conclusions from the 2025 underperformance, as it was always a liquidity story rather than a cyclical bear market, as some analysts suggested. More liquidity could also flow into the market as Trump nominates a rate-cut advocate to replace Fed Chair Jerome Powell. This could lead to larger rate cuts, which would be bullish for the Bitcoin price and the broader crypto market. At the time of writing, the Bitcoin price is trading at around $95,300, down in the last 24 hours, according to data from CoinMarketCap. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|Arthur Hayes|bitcoin|Bitcoin news|bitcoin price|BitMEX|bloomberg|btc|BTC news|btc price|btcusd|BTCUSDT|CoinMarketCap|CPI|Donald Trump|Eric Balchunas|fed|Jerome Powell|Polymarket|spot Bitcoin ETFs|TARA|Year-To-Date|YTD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57222287,
    "published": 1768592945000,
    "title": "US lender Newrez to accept crypto holdings in mortgage approval",
    "body": "The new policy will allow borrowers to use Bitcoin, Ether, crypto ETFs and US dollar-backed stablecoins for asset verification and income estimates without liquidation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57222198,
    "published": 1768589773000,
    "title": "Hacker steals $282 million crypto in hardware wallet social-engineering attack",
    "body": "A sophisticated social-engineering attack led to the theft of more than $282 million in BTC and LTC, with the funds rapidly laundered through monero.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Hack|scam|Monero|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 33,
        "NAME": "LTC",
        "CATEGORY": "LTC"
      },
      {
        "TYPE": "122",
        "ID": 57,
        "NAME": "XMR",
        "CATEGORY": "XMR"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 57223573,
    "published": 1768597219000,
    "title": "SUI Reclaims Smart Money Zone, While Weekly Structure Signals Big Move Ahead",
    "body": "SUI is showing early signs of a meaningful shift in momentum after reclaiming a key smart money accumulation zone on the weekly chart. Following a deep corrective phase, the price structure is beginning to stabilize, suggesting that patient buyers may be positioning for the next major move. With higher-timeframe support holding and a bullish structure gradually rebuilding, the setup hints that a larger expansion could be brewing. Defending Weekly Accumulation After Deep 2024 Correction Crypto analyst Crypto Patel, in a post shared on X, highlighted that SUI continues to hold a high-timeframe accumulation zone on the weekly chart following a deep correction from its 2024 highs. According to the analysis, the broader market structure now points toward a re-accumulation phase with smart money participation. Related Reading: SUI Reclaims Key Support With Strength — Is $2.35 The Next Target? From a technical standpoint, several constructive signals stand out. The liquidity sweep at the lows has already been completed, while a strong weekly bullish order block between $1.50 and $1.30 has been fully filled. Also, the fair value gap overlaps with a demand zone. Since reacting from this region, SUI has already delivered a bounce of roughly 45%, indicating growing bullish responsiveness. The structure remains technically healthy, with price action respecting a rising channel and the high-timeframe bias gradually shifting back toward the upside. These developments suggest that the corrective phase may be maturing, allowing for a more sustained recovery if current conditions persist. Looking ahead, Crypto Patel outlined ambitious upside targets at $5, $10, and $20, contingent on the broader bullish structure remaining intact. As long as SUI/USDT holds above the $1.20 level, the macro bullish thesis remains valid. The analyst also noted that the optimal entry zone, previously shared around $1.50–$1.30, had already played out, delivering close to 50% gains on a short-term swing. Overall, this remains a patience-driven weekly setup with attractive risk-to-reward for both spot and swing traders, but invalidation could occur on a weekly close below $1.20. SUI Respects Structure After Completing HTF Correction Sui Community outlined that the recent price action is far from random and continues to respect a clear structural framework. Following a complete high-timeframe correction, SUI has transitioned into a re-accumulation phase, with price stabilizing inside a well-defined weekly demand zone. Related Reading: SUI Isn’t Done Yet: Weekly Accumulation Holds As Buyers Reload Below This zone is where smart money participation has become evident, signaling renewed confidence after the corrective move. The community also made reference to the same $1.30 and $1.50 entry zone as Crypto Patel, which has since been filled and validated, delivering gains of roughly 50%. At this stage, the outlook shifts into a patience-based weekly play with an asymmetric risk-to-reward profile. As long as the broader structure holds, the long-term upside targets remain firmly in focus at $5, $10, and $20. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "SUI|Crypto Patel|Sui Community|SUI price|SUIUSD|SUIUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 96,
        "NAME": "SUI",
        "CATEGORY": "SUI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57223570,
    "published": 1768597091000,
    "title": "Crypto developer protections don't belong in market structure bill, senators say",
    "body": "Legislative language which would grant some legal protections to crypto software developers, falls under the Senate Judiciary Committee, its leaders said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Market Structure Legislation|crypto legislation|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57224192,
    "published": 1768599278000,
    "title": "Etherealize co-founders: ETH will hit $15,000 by 2027",
    "body": "Etherealize co-founders Vivek Raman and Danny Ryan believe Ethereum is exiting a regulatory \"purgatory\" to become the premiere destination for Wall Street.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Ether|Ethereum News|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57224498,
    "published": 1768600216000,
    "title": "CES Top 12 Companies Redefining Personalization With Web3, AI, Robots",
    "body": "At CES 2026, 12 companies reveal how AI, robots, and Web3 are redefining personalization through identity, trust, smart products, and human-centered design.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|Business|/business|Innovation Rx: Technologies|/feature/innovation-rx/technologies|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 57225824,
    "published": 1768604451000,
    "title": "The Ethereum MACD Crossover That Could Lead To A Massive Bull Wave",
    "body": "Ethereum is showing bullish technical strength, with momentum indicators beginning to tilt back in favor of buyers. After weeks of uneven price action, the ETH/USD chart on the 3-day timeframe is now printing a MACD bullish crossover, a signal that has preceded some of Ethereum’s rallies in the past. The setup is notable because it proposes a situation where Ethereum is laying the groundwork for another sustained rally that plays throughout the entirety of 2026. Bullish MACD Crossover For Ethereum The latest analysis shared by Javon Marks points to Ethereum climbing steadily following another MACD bullish crossover in December 2025. This bullish crossover is visible on the 3-day chart, where the MACD line crossed above the signal line from below. Related Reading: Ethereum Chart Turns Bullish: New Cycle Energy Points To $5,000 This is a change that shows downside momentum has faded and bullish pressure is starting to rebuild among Ethereum traders. At the time of writing, Ethereum is trading around the $3,300 region, about 33% below its August 2025 peak, but holding above swing lows in November 2025. According to Javon Marks, this recent price action is potentially the early stages of a much larger bull wave. This projection is based on the fact that the current crossover looks like an earlier crossover that occurred before Ethereum transitioned into an extended upside move in early 2025. Back in April 2025, the 3-day MACD also recorded a bullish crossover after an extended period of consolidation and pullbacks that lasted for a few months. That signal was the start of a multi-month rally that steadily pushed Ethereum higher, eventually culminating in a new all-time high in August 2025. Price action following that April crossover did not explode immediately. Ethereum first stabilized for a few days, then began forming higher lows above $1,500. Once resistance at $2,000 gave way, the rally gained much momentum and carried Ethereum from the mid-$2,000 range all the way above $4,800, broke above its old record of $4,878 that had stood since Nov. 2021, before finally peaking at $4,946 in late August. Price Targets To Look Forward To The final message of this technical analysis is that Ethereum is about to embark on a comparable rally and break out to new all-time highs. According to the updated outlook by Javon Marks, the first major level that defines this potential continuation is $4,811.71. This price acted as an important resistance level during the previous rally in 2025. Related Reading: Ethereum Enters Overbought Levels With Weekend Pump, Why A Crash Could Be Coming A decisive break and sustained hold above $4,811.71 would confirm that Ethereum has exited its corrective phase and re-entered into a broader expansion move. If that breakout unfolds as expected, the measured move projected from the chart points to $8,557.68 as a target to look forward to. This target is based on the magnitude of Ethereum’s last MACD-driven advance and would translate to a 160% increase from current price levels. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|ethusd|ETHUSDT|Javon Marks|MACD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57229553,
    "published": 1768615246000,
    "title": "PEPE Price Could Soar 3,000% If The Bottom Is In; Analyst Explains",
    "body": "As meme coins posted sharp rebounds earlier this year, PEPE also rallied, delivering notable gains. Although the meme coin has since slipped back into negative territory, a crypto analyst believes another bullish reversal may be approaching soon. According to the analyst, a key technical pattern has recently emerged on the chart, suggesting that PEPE has formed a bottom and could be on its way to a massive 3,000% price rally. PEPE Price Prepares For Massive 3,000% Rally In a post shared on X this Thursday, market analyst CryptoLinx outlined a bullish outlook for PEPE, pointing to a key shift on the weekly chart that he believes could trigger a 3,000% rally in the meme coin’s price. He stated that PEPE has just printed a bullish Moving Average Convergence Divergence (MACD) cross on the weekly timeframe. Related Reading: Bitcoin Price Crash To $57,000: The Bullish Path That Could End In Tears The analyst’s chart shows the weekly MACD lines crossing upward with momentum shifting from red to green. This move comes after an extended downtrend and coincides with price stabilizing and starting to curl higher, a pattern often associated with a rounded bottom. In his post, CryptoLinx emphasized that most traders and investors do not fully understand just how powerful the weekly MACD can be when it crosses at a true market bottom. Such moments often mark the market’s transition from an accumulation phase to a sustained uptrend. In previous cycles, similar setups have led to substantial price appreciation in PEPE. Moves of 200% to 300% were recorded in the PEPE price as momentum shifted in favor of buyers. CryptoLinx has suggested that if PEPE has indeed found its true bottom, its potential price rally could be significantly more explosive than past cycles. Based on the analyst’s predictions, the bullish MACD cross would not fuel a simple price recovery for PEPE, but an explosive surge that could completely flip its ongoing downtrend and mark a new ATH. The analysis points to a potential upside of 1,500% to 3,000% for PEPE this year. Such a rally could see the meme coin jump from its current levels around $0.00000585 to $0.0000928 and $0.000179, respectively. An Update On PEPE Price Action In 2025, the Pepe price spent several months in a sustained downtrend, closing the year in the red and extending its losses into the first few days of 2026. However, as meme coins saw a sudden market revival at the beginning of the year, PEPE jumped by more than 30%, briefly rallying before shedding some of its gains. Related Reading: Next XRP Wave Shows Where Price Is Headed Next, But There’s A Catch According to CoinMarketCap’s data, the PEPE price remains down over 68% Year-to-Date (YTD). Despite this broader decline, the meme coin has shown signs of recovery, climbing more than 44% over the past month. At the time of writing, PEPE is down nearly 3% in the last 24 hours and about 4.5% in the past week. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "PEPE",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 93,
        "NAME": "PEPE",
        "CATEGORY": "PEPE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57230072,
    "published": 1768616707000,
    "title": "Crypto bank Anchorage Digital eyes $400M raise with IPO in sight: Report",
    "body": "Being the first federally chartered bank, Anchorage is looking to become a leading stablecoin issuer in 2026, with plans to double the size of its stablecoin team this year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 57230775,
    "published": 1768618817000,
    "title": "XRP Breakout Possible Before The Weekend, Expert Says",
    "body": "XRP could be approaching an inflection point as a closely watched chart pattern tightens into its apex and broader “risk-on” signals in equities flash green, according to XRPL developer Bird (@Bird_XRPL). In a series of posts on X, Bird, the developer behind XRPL meme coin DROP, pointed to XRP’s hourly structure as setting up for a decisive move “before the end of the week,” arguing that a technical breakout could accelerate quickly toward a nearby upside objective. “Take a look at XRP on the hourly. A move is about to happen before the end of the week,” Bird wrote alongside a chart showing a contracting triangle with price compressing into the tip. “A measured move if we send upwards could push us straight to that $2.69 mark which finally gets us into ‘bull run’ mode.” Russell 2000 Breakout Puts XRP on Alert Beyond the short-term pattern, Bird anchored his thesis to US small caps, arguing that the Russell 2000’s behavior has historically mattered for XRP and the broader altcoin complex. Related Reading: XRP In A ‘Super Cycle’? SuperTrend Suggests Another Story “The Russell 2000 is about to close its highest weekly close in history. That matters ALOT for XRP,” Bird said. “Historically, XRP and altcoins have always tracked the Russell 2000 extremely closely. It’s the true risk on index for mid caps (not mega caps like the S&P or MAG7 where most capital has been parked).” Bird’s argument is that XRP still trades more like a mid-cap risk asset than a mega-cap “store of value” proxy, making the Russell’s breakout a useful macro tell for when speculative capital rotates back into higher beta exposures. He described the current backdrop as “capital rotating” and “risk … back on,” suggesting that the market may be entering a window where positioning can change quickly if narratives align. In a longer follow-up thread, Bird described XRP’s extended consolidation as increasingly out of sync with what he views as constructive macro conditions across risk assets. “We’re at a genuinely clinical moment for XRP. We’ve gone sideways for over a year, yet the Russell 2000 is now in full price discovery, other stock markets have been at all time highs for a long time, metals are elevated, and Bitcoin dominance is chopping at levels that historically dumps at,” he wrote. Related Reading: Ripple Builds XRP ‘Wall Street Kit’: Developer Claims ‘Billions Incoming’ Bird also pointed to a prior episode as a reference point: “In November ’24, the Russell turned green and XRP went parabolic roughly 10 days later,” he said, arguing that this time the Russell has gone further by reclaiming highs and holding strength across timeframes. In his view, the remaining constraint is rotation, not necessarily a sharp drawdown in metals or other assets, but simply a pause that allows risk appetite to re-price. On XRP and Ripple specific context, Bird said “acquisitions done, partnerships rolling out, NDAs lifting, legal clarity forming,” and argued that the market is nearing a point where “a single narrative, catalyst, or push can ignite XRP fast.” The key near-term test is whether the tightening technical structure resolves upward as Bird expects and whether cross-asset risk appetite continues to support alt beta. If both align, Bird’s framework suggests traders will be watching for a momentum break that could carry XRP toward the $2.69 objective and, in his view, potentially open the door to a faster path toward fresh cycle highs. At press time, XRP traded at $2.06. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|xrp|xrp news|XRP Price|XRP Price Analysis",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57232010,
    "published": 1768622435000,
    "title": "Coinbase CEO Claims Big Banks Are Aiming To ‘Kill Competition’ With Latest Crypto Market Bill Draft",
    "body": "Cryptocurrency exchange Coinbase (COIN) recently retracted its support for the latest iteration of the crypto market structure bill, known as the CLARITY Act, just 24 hours before a crucial markup was scheduled. This signals significant concerns about the bill’s alignment with the interests of cryptocurrency firms compared to traditional banking institutions, not only for the exchange but also for broader market participants. Coinbase CEO’s Concerns Over Fair Competition On Friday, Coinbase CEO Brian Armstrong elaborated on the rationale behind the exchange’s withdrawal in an appearance on FOX Business, expressing his frustration with the notion that banks could use regulatory means to stifle competition in their favor. “It just felt deeply unfair to me that one industry [banks] would come in and get to do regulatory capture to ban their competition,” Armstrong stated. He also underscored the importance of a level playing field, asserting that competition should thrive without undue interference from powerful financial entities. Related Reading: Crypto Market Bill Draft Criticized For Allowing Continued Developer Prosecution Coinbase CEO emphasized that his concerns resonate with “much of the industry,” highlighting his obligation to advocate for customers who he believes are being shortchanged by the provisions of the proposed market legislation. “I declined to opine on the exact—whether the hearing, the markup should happen or not… But I did feel like I had to speak up on behalf of our customers and all Americans here,” he articulated. Debate Heats Over CLARITY Act Central to the ongoing debate surrounding the CLARITY Act is a critical disagreement between banks and crypto firms regarding the fate of stablecoin holders and whether they should be entitled to receive reward payments. Armstrong has previously raised alarms that the bill might prohibit tokenized equities, impose restrictions on decentralized finance (DeFi), and expand governmental access to financial data, thereby compromising individual privacy. Furthermore, he warned that the legislation could shift regulatory authority away from the Commodity Futures Trading Commission (CFTC) and towards the Securities and Exchange Commission (SEC), sidelining competition within the crypto space. Armstrong Critiques Banking Lobbying Tactics Armstrong noted the irony in the current situation, pointing out that while banks are indeed leveraging the advantages of cryptocurrency, their lobbying efforts seem aimed at restricting competing firms. “Many of these banks are actually very smart,” he acknowledged, referencing the commercial side of banking that is increasingly engaging with crypto. “They’re actually doing deals with Coinbase. We’re powering a lot of crypto and stablecoin infrastructure for them on the commercial side.” Related Reading: Bitcoin And Crypto ETFs Set To Attract $130 Billion-Plus Inflows This Year, JPMorgan Predicts Despite his criticisms of the banking sector’s lobbying tactics, Armstrong expressed optimism that legislators could ultimately resolve the outstanding issues within the crypto market structure bill: And then their lobbying arm comes to D.C. and thinks of it as very zero-sum and is trying to kill the competition. So, I suspect, like many things, if we get the principles in the room, we can actually get this figured out and make a good deal. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|brian armstrong|CLARITY Act|coinbase|Coinbase CEO|crypto bill|crypto legislation|Crypto Market Structure Bill|US crypto regulation",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57232819,
    "published": 1768624426000,
    "title": "Sacrificing Ethereum’s values for mainstream adoption must stop now: Buterin",
    "body": "Vitalik Buterin wants improved private payments, easier running of full nodes, decentralized apps that don’t rely on centralized services, and more on-chain privacy.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57233291,
    "published": 1768626046000,
    "title": "Bitcoin Flashes Near-Identical Fractal Before The 2021 Bull Run Started",
    "body": "Bitcoin may be replaying a market structure that historically preceded one of its most powerful rallies. A high-timeframe trader has identified a fractal that closely mirrored Bitcoin’s behavior ahead of the 2021 bull run. He argues that the current cycle is unfolding in line with a well-established structural script observed across multiple market cycles spanning more than a decade. Bitcoin’s Fractal: Rooted In High-Timeframe Structure The fractal highlighted by the trader is based on a direct structural comparison between Bitcoin’s current cycle and the 2021 setup, illustrated in a chart he attached to his analysis. The chart aligns both periods to show how price advanced into a broad distribution range, rolled over into a sharp corrective phase, and then attempted to recover while capped by descending resistance. In both cases, Bitcoin retraced to the 0.382 Fibonacci level before stabilizing, marking a shared technical inflection point rather than a coincidental price overlap. Related Reading: XRP Price Is Approaching A Key Decision Zone, But Structure Is Still Firmly Bullish This structural symmetry extends beyond price levels into timing. According to the trader, the current cycle has tracked the rhythm of prior four-year cycles with notable consistency, allowing historical all-time highs and lows to be mapped objectively. Using that same framework, the data previously supported a high-probability short near the peak candle around $123,000, reinforcing his view that recurring market structure continues to guide directional risk. By comparing the two cycles directly, the trader argues that Bitcoin’s behavior is being evaluated through a recurring structural pattern that has remained intact for more than 12 years, rather than through subjective bias. $100,000 As A Structural And Psychological Ceiling Within the identified fractal, psychological resistance is a key determinant of Bitcoin’s upside potential. Looking back at 2021, Bitcoin failed to decisively reclaim the $50,000 level and instead front-ran it before reversing, establishing a behavioral precedent for how traders respond to significant round-number thresholds. Applying this pattern to the current cycle, $100,000 now functions as the analogous psychological ceiling. As a result, some participants may act preemptively, which could generate selling pressure from underwater holders and distribution by larger players. Related Reading: Pundit Reveals The Biggest Enemy Of XRP Investors As Price Struggles At $2 This potential resistance is reinforced by diagonal trendlines that mirror the caps observed in 2021, creating a structural limit on upside momentum. Within this context, short-term extensions into the $98,000–$99,000 range remain plausible and are fully compatible with the fractal, as price can approach the psychological ceiling. Moreover, positioning data from the past six to eight months indicates that the median short-term buyer cost basis has clustered between $95,000 and $100,000, highlighting zones where profit-taking and defensive selling are likely to intensify. These elements suggest a scenario where price may test resistance, experience temporary stalls, and respect structural limits without invalidating the broader high-timeframe thesis. However, the trader notes that the framework is probabilistic: only a sustained move above $104,000–$105,000 would break the fractal pattern and necessitate a full reassessment of the high-timeframe trend. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57235892,
    "published": 1768633228000,
    "title": "XRP To Repeat Its 2017 Playbook? Analyst Forecasts 1,250% Expansion",
    "body": "While XRP retests a crucial support area, some analysts have suggested that the altcoin is preparing for a massive expansion in the coming months, as a potential trend reversal begins to form and its 2017 formula repeats. Related Reading: CME Group To Launch Cardano, Chainlink, Stellar Futures Amid Crypto Lineup Expansion – Details XRP Gears Up For Massive Expansion On Friday, XRP reached a 12-day low, falling to the $2.02 area before bouncing. Notably, the cryptocurrency has been trading within the $2.05-$2.35 area for nearly two weeks, moving between the mid and lower zones of this price range for most of this period. Amid its recent performance, Sjuul from AltCryptoGems noted that the altcoin “is starting to look better, especially after that bullish market structure break with a fresh higher high.” The analyst highlighted that the cryptocurrency has been consistently trending lower since August, exclusively printing lower lows and lower highs. However, it has broken out of this structure and recorded a higher high for the first time in months after the start-of-the-year rally, setting the stage for a potential reversal. “Now, we have to maintain this bullish structure at any cost and form a higher low on the next dip,” Sjuul warned. Meanwhile, market observer ChartNerd pointed to a striking similarity between XRP’s 2017 playbook and its current performance. In an X post, the analyst affirmed that the altcoin is repeating its 2016-2017 formula, which led to a massive rally toward its previous all-time high (ATH). At the time, XRP saw a textbook multi-year symmetrical triangle formation breakout, followed by a multi-month ABC consolidation before its 1,500% mark-up. This time, the cryptocurrency has repeated a similar symmetrical triangle pattern breakout, and it is currently in Wave C of its ABC consolidation period. To the analyst, a deeper Wave C retracement is possible if the multi-month $1.80 support is lost. Nonetheless, he added that “cycle formula repetition signals XRP is gearing up for expansion towards $8/$13/$27,” which would be a 300%-1,250% increase from the current levels. Q1 Close To Define XRP’s Future Despite his bullish forecast, ChartNerd also shared an important warning for the next two months. According to the analyst, “XRP has just over 2 months to invalidate this 3M bearish Heikin-Ashi candle formation,” or it will risk a massive correction. In a video analysis, he explained that, in the past, whenever the altcoin saw massive rallies followed by a red bearish candle on the three-month timeframe, it would “normally indicate the start of a downtrend or a macro consolidation period.” In 2014, XRP saw a bearish candle print in the three-month timeframe after a remarkable pump, which was followed by a correction and consolidation “for quite a couple of years,” he explained. “The same happened again in 2018. We had this massive rally for XRP, and as soon as we printed a three-month bearish candle in the Heikin-Ashi Candle formation, (…) we entered into the bear market,” ChartNerd continued. Related Reading: Analyst Says It’s Time For Ethereum’s ‘Big Test’ – Is ETH Season Loading? Similarly, the cryptocurrency repeated the same performance in 2021. Now, XRP is starting to form a red candle in this timeframe and has approximately 2 months and 16 days to close the quarter on a positive note. “We have until March before this candle closes. (…) So, what we don’t want to see is this full-bodied three-month Heikin-Ashi Candle, because if we see it, this is where we are likely to see a deeper correction for the next six to nine and even 12 months,” the analyst concluded. As of this writing, XRP is trading at $2.05, a 1.7% decline in the weekly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto analyst|Crypto Market Recovery|Crypto trader|xrp|XRP 2017|XRP analysis|XRP ATH|XRP bullish prediction|XRP Price|XRP Rally|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57235618,
    "published": 1768632244000,
    "title": "White House threatens to pull support for crypto bill after Coinbase standoff: Report",
    "body": "Coinbase withdrew support for the CLARITY Act, warning the draft would restrict DeFi, ban tokenized equities and eliminate stablecoin rewards.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57237132,
    "published": 1768636837000,
    "title": "Surge In XRP Transactions: 1.45 Million Daily Users Could Signal Price Rally Ahead, Says Expert",
    "body": "Recent reports indicate that XRP has reached an almost six-month high in daily transactions, marking a pivotal moment for the cryptocurrency as it exhibits increasing adoption across both payment systems and decentralized finance (DeFi) applications. For January 2026 alone, the XRP Ledger recorded 1.45 million daily transactions, following a steady upward trend in network usage that began in late 2025, coinciding with the introduction of new payment corridors through Ripple’s On-Demand Liquidity platform and the integration of stablecoins such as RLUSD. Gaps Between XRP Demand And Price Market expert Sam Daodu highlighted in a recent report for 24/7 Wall St. that historical trends suggest that gaps between rising demand and stagnant prices often precede sharp rallies. With exchange reserves at eight-year lows and increasing institutional inflows seen with XRP exchange-traded funds (ETFs), the current situation indicates that the altcoin may be quietly gearing up for its next breakout. Related Reading: XRP Will Skyrocket Beyond $18: Analyst Suggests 800% Growth Potential In 2026 Despite a slight rebound to $2.42 on January 6, which represented a nearly two-month high for the token, its price has since retraced to approximately $2.048 at the time of writing. This decline occurred despite the transaction surge, suggesting that XRP has yet to capitalize on its increased usage. Daodu noted that the discrepancy between XRP’s price and its on-chain activity isn’t unusual. He asserts that such gaps between usage and price have often been precursors to significant price movements, while also pointing out several factors contributing to the current delay in price reaction. Market-wide consolidation is one of the key reasons, as Bitcoin (BTC) and Ethereum (ETH) traded sideways in early 2026, dampening momentum for altcoins like XRP. In addition, profit-taking pressure has emerged following XRP’s July 2025 rally up to $3.65. Many short-term holders have cashed out, creating strong resistance levels in the $2.20 to $2.50 range. Until new catalysts arise, Daodu claims XRP may remain confined to this range without breaking out. Is A Major Price Breakout Ahead? Looking forward, Daodu posits that XRP has a historical tendency to lag behind its on-chain progress before initiating explosive price moves. In both 2017 and 2020, spikes in transaction volume and wallet activity preceded significant rallies for the token’s price by several weeks. Related Reading: Bitcoin And Crypto ETFs Set To Attract $130 Billion-Plus Inflows This Year, JPMorgan Predicts For instance, in the third quarter of 2020, XRP’s daily transactions grew by over 40% in just two months, while the price remained flat at around $0.25, only to surge to over $0.70 within weeks in November. A similar scenario unfolded in late 2017, where heightened usage metrics preceded a jump in XRP’s price from $0.30 to $3.30 by early January 2018. This suggests that the current surge in on-chain transactions could be a leading indicator of a delayed price breakout for XRP. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|crypto|crypto market|crypto news|cryptocurrency|xrp|XRP daily transactions|XRP Ledger|XRP Ledger News|xrp news|XRP Price|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57239615,
    "published": 1768643664000,
    "title": "User loses $282M in one of the largest social engineering crypto heists",
    "body": "The crypto user was reportedly deceived by an attacker impersonating Trezor support, tricked into revealing their hardware wallet seed phrase.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57241676,
    "published": 1768649276000,
    "title": "Spot Bitcoin ETFs attract $1.42B in strongest week since early October",
    "body": "Spot Bitcoin ETFs posted their strongest week since October as institutional investors returned via regulated products, helped by reduced whale selling and tightening effective supply.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57242314,
    "published": 1768651242000,
    "title": "Dogecoin RSI Just Entered Historical Oversold Levels Again, Will It Repeat 2021?",
    "body": "The Dogecoin Relative Strength Index (RSI) is said to have entered historical oversold levels. This has raised the possibility that the foremost meme coin could repeat its parabolic rally in the 2021 bull cycle. Dogecoin Eyes Parabolic Rally As RSI Enters Oversold Levels Crypto analyst Cryptollica has indicated that the Dogecoin price could record another parabolic rally as the RSI enters oversold levels. In an X post, the analyst noted that this is the fourth time in 12 years that the DOGE RSI has been this oversold, and that every time this has happened, it has been life-changing. Related Reading: Dogecoin Price Is Following This Bullish Signal With A Major Target Cryptollica further remarked that the drop in Dogecoin’s RSI to this low has always been an “epic buying opportunity” and that those who loaded up made insane gains. In line with this, the analyst remarked that this is another massive opportunity. Meanwhile, Cryptollica alluded to previous times when the RSI dropped this low, including during the last cycle bottom, when DOGE dropped to $0.5. Dogecoin rallied to a new all-time high (ATH) of $0.74 after bottoming at $0.05, recording massive gains in the process. Cryptollica noted that these setups don’t come often and urged market participants not to miss this one. His accompanying chart suggested that DOGE could rally to the psychological $1 level this time around, marking a new ATH for the foremost meme coin. DOGE Mirroring Past Accumulation Pattern In another X post, Cryptollica highlighted a similar DOGE/BTC pattern between the 2014-2017 and 2021-2026 accumulations. The analyst stated that the structure is identical and assured that the bleed against Bitcoin is not “death” but the necessary energy compression before the rotation. Cryptollica added that when the green line breaks, risk appetite changes instantly. Related Reading: Dogecoin Price On The Brink Of A 9,000% Rally To $10? What Historical Performance Shows Meanwhile, Cryptollica declared that the fractal was loading, with Dogecoin set to be the heartbeat of the altcoin cycle. The analyst claimed that this is the final stage of a multi-year compression against Bitcoin. This historically leads to a specific volatility squeeze that precedes a massive capital rotation from BTC to altcoins. Crypto analyst Bitcoinsensus raised the possibility of a Dogecoin rally to $0.70, which could be near. This came as the analyst noted that DOGE has been moving in a nice way up throughout this entire bull cycle. This is said to be evident in the mini cycles, with the foremost meme coin tapping the dotted line, followed by a slow retrace. Based on this pattern, Bitcoinensus noted that DOGE could soon target the $0.70 range if the strong momentum in the crypto market returns. At the time of writing, the Dogecoin price is trading at around $0.137, down in the last 24 hours, according to data from CoinMarketCap. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|altcoin|bitcoin|Bitcoinsensus|CoinMarketCap|Cryptollica|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt|Relative Strength Index|RSI",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]