[
  {
    "id": 57429392,
    "published": 1769238034000,
    "title": "Dogecoin Wedge Breakout Could Be “Powerful,” Analyst Says",
    "body": "Dogecoin is potentially following a Falling Wedge right now, and this cryptocurrency analyst thinks a breakout from it may be a “powerful” one. Dogecoin Could Be Trading Inside A Falling Wedge Pattern In a new post on X, analyst Ali Martinez has shared a Falling Wedge that Dogecoin is potentially trading inside on the weekly timeframe. A “Wedge” is a pattern from technical analysis (TA) that forms whenever the asset’s price trades between two converging trendlines. A “Triangle” consolidation channel also involves converging trendlines, but the difference from a Wedge is that it either involves one trendline that’s horizontally flat or trendlines that converge with an opposite slope. On the other hand, a Wedge involves trendlines sloped in the same direction. Related Reading: Bitcoin Supply Overhang Likely To Cap Rallies Above $98,400, Glassnode Says When these lines point in the up direction, the pattern formed is known as a Rising Wedge. Similarly, their being sloped downward creates a Falling Wedge. The latter is the Wedge of interest in the current discussion. Like other consolidation patterns in TA, the upper line of a Falling Wedge is also likely to be a source of resistance, while the lower one is that of support. A breakout of either of these bounds can signal a sustained move in that direction. Wedges are generally considered to be either continuation or reversal patterns, depending on the prevailing price trend. When a Falling Wedge is preceded by an upward price trajectory, the pattern is assumed to be one pertaining to a bullish continuation. Similarly, it acts as a reversal pattern during a downtrend. Now, here is the chart shared by Martinez that shows the Falling Wedge that Dogecoin has been stuck inside for the past year: As displayed in the above graph, Dogecoin’s weekly price has retraced to the lower level of the Falling Wedge recently, suggesting the pattern’s support is being retested. In the same chart, the analyst has highlighted some Falling Wedges that Dogecoin traveled through in the past. It would appear that each of these ended up holding as bullish continuation patterns and led to upward breakouts. In terms of the width, the latest Wedge has been the largest among these. Related Reading: Bitcoin Sentiment Whiplash: Mood Sours From Greed To Extreme Fear In Days “Dogecoin $DOGE tends to respect wedge structures, and a breakout from this one could be powerful,” noted Martinez. It now remains to be seen whether the support line of the channel will hold for the memecoin this time and if a breakout will follow. DOGE Price At the time of writing, Dogecoin is floating around $0.125, down more than 9% over the last seven days. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|Dogecoin breakout|Dogecoin Falling Wedge|Dogecoin Wedge|dogeusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57430313,
    "published": 1769241608000,
    "title": "XRP At ‘Critical Inflection Point’: Analyst Signals Major Expansion If This Level Holds",
    "body": "As XRP attempts to climb to higher levels, an analyst affirmed that the altcoin is “doing what it needs to do” to continue its bullish rally, highlighting multiple key structures in key timeframes. Related Reading: Dogecoin Foundation-Backed ETF Launches On Nasdaq As Analysts Call For Massive DOGE Rally XRP Enters Inflection Point After retesting the $1.90 area on Friday morning, XRP saw a 4.6% intraday bounce toward the mid-zone of its local range. Over the past five days, the cryptocurrency has been hovering in the $1.85-$2.00 price range, failing to hold the upper zone of this range. Market watcher ChartNerd pointed out a key reversal pattern that could signal a massive price expansion may be around the corner, noting that the altcoin is at a “critical inflection point” as it retests a macro support zone. He explained that a running flat ABC correction formation is “a sophisticated structure where the failure of the ‘C’ wave to breach previous lows signals underlying bullish strength.” XRP has been mirroring the same structure over the past 400 days, which would point “toward a structural breakout, marking the transition from a yearly long base into a new primary uptrend” if it resolves. As the chart shows, “the wave counts repeating toward the structure are evident in XRP’s price action,” and as long as the macro support holds, around the $1.80 area, the C wave “could be working in the bulls’ defense.” We could be just building a base above $1.80, marking the C wave in this running flat correction before the major breakout. ChartNerd added that there could be a scenario in which XRP deviates below its major support before a V-shape recovery. However, he warned that losing this area would not be healthy, detailing that the only way to invalidate the pattern would be for the price to close below the structure’s support, retest it as resistance, and drop to lower levels. XRP’s Price Defends Macro Support The analyst emphasized the importance of the $1.80 level, noting that XRP has been defending this territory for over a year and could lead to a new all-time high (ATH) rally. “This is a macro accumulation zone, and we evidently also have two major levels of descending resistance for XRP,” he detailed, highlighting that when the first multi-month descending resistance broke, the altcoin rallied to a new all-time high. It’s pretty simple: we have descending resistance on our heads at the moment, and we once had a point of contact on this resistance at the $2.40 high (…) So, at this moment in time, the simplicity tells us: break the descending resistance, and this is where XRP really starts gearing up for further expansion. Based on this, ChartNerd asserted that if the altcoin defends the $1.80 macro support, then a similar rally is likely. Similarly, he pointed to a bullish reversal structure building below the key $2.70 resistance on XRP’s chart. Related Reading: Bitcoin To $80,000? Analyst Warns Of Potential Free Fall As BTC Erases 2026 Gains Per the post, the cryptocurrency formed a three-month falling wedge pattern that was broken out of during the early January rally. Now, the price is retesting the pattern’s breakout level as support and could be preparing to climb toward the level it started forming. “So XRP just needs to defend the guard at $1.80, and this is where we could be looking for that sort of major expansion and looking to press back up to the target of $2.70,” before potentially challenging its pre-Q4 range, he concluded. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto analyst|crypto market correction|Crypto Market Recovery|Crypto trader|xrp|XRP ATH|XRP Breakout|XRP Price Analysis|XRP Technical Analysis|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57430129,
    "published": 1769240771000,
    "title": "Ethereum prepares for quantum era with new security team and funding",
    "body": "Ethereum developers to launch biweekly sessions on quantum-resistant transactions as Foundation commits $2 million in new funding to harden core cryptography.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57432265,
    "published": 1769248809000,
    "title": "Crypto Meets Private Banking: UBS Weighs New Offering",
    "body": "Reports say Swiss banking giant UBS is planning to let a small group of its private bank clients buy and sell major cryptocurrencies. The step would open access to Bitcoin and Ethereum for people who have worked with the bank for years, not for every customer. Related Reading: Bitcoin’s Sharp Reversal Leaves Over $800 Million Liquidated In 1 Day Private Clients First According to a Bloomberg report, the service would start in Switzerland and be offered only to select private banking clients, with any wider rollout dependent on rules and demand. The move is careful and measured. It is being tested with a narrow set of clients before any wider push is considered. How It Would Work Reports note that UBS has been talking with outside firms about providing the trading, custody and compliance pieces needed to make crypto trading run smoothly. Partners would likely handle technical tasks while UBS keeps the client relationship front and center. Those talks have been going on for months, and no final deals are said to be done yet. Why Now Wealthy clients have been asking for ways to own digital assets safely. UBS has run pilots on tokenized funds and has worked on blockchain payments before. The bank’s size and reputation mean it can offer a more cautious path into crypto than many smaller players. At the same time, changes in regulation and the broader market have made the plan more realistic than it might have seemed a few years ago. Based on reports, the initial offering would focus on Bitcoin and Ethereum. More coins could be added later, but that would depend on which assets meet the bank’s risk and compliance checks. UBS will reportedly decide what custody model to use and whether it needs third parties for trade execution. No launch date has been set. A Broader Trend Banks from different countries are slowly giving rich clients more ways to touch crypto, but each does it in its own style. Some offer ETFs and funds. Some go further and let clients trade coins directly. UBS’s cautious design fits a pattern where big banks move slowly, testing the systems before widening access. A handful of recent moves by other institutions show the same pattern. Related Reading: Bitcoin Influencers Get Spotlight In X’s New ‘Starterpacks’ What Comes Next Reports note that regulators and client interest will help decide how fast this goes. If rules in the US and other places stay friendly and clients respond, the offering could broaden beyond Switzerland. If not, the bank could keep the plan tightly limited. For now, the idea remains a plan under discussion rather than a product on the market. UBS’s steps reflect growing demand from wealthy investors for safer ways to hold crypto through trusted firms. The bank’s careful progress shows how traditional finance is testing the waters without rushing in. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|banking|bitcoin|crypto|digital currency|ethereu|ubs",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57432152,
    "published": 1769248194000,
    "title": "Netherlands risks capital flight with unrealized gains tax on stocks, crypto",
    "body": "Investors and crypto users warn the proposed unrealized gains tax could drive an exodus of capital and talent.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57433692,
    "published": 1769254203000,
    "title": "Bitcoin Price Still Has Room To Fall Below $60K — Crypto CEO",
    "body": "The Bitcoin price had a relatively rough trading period over the past week, as it hovered around the psychological $90,000 mark. The flagship cryptocurrency, which looked set for a return to six-figure valuation barely over a week ago, now seems to have lost all its bullish momentum. Broadly speaking, these recent struggles put to rest questions around the “relief rallies” to the upside, and correlate more with the current bear market structure. However, the latest on-chain evaluation shows that the Bitcoin price woes could worsen from here on out. Expert Explains Why $60,000 Is Possible For BTC Price In a recent post on the X platform, Alphractal CEO and founder Joao Wedson said that the Bitcoin price could still have room to fall below the $60,000 level. This not-so-optimistic prediction is based on the number of days Bitcoin has traded at prices higher than today. Related Reading: Bitcoin Supply In Profit Stalls At 71%: Still Not Enough For A Sustainable Recovery According to Wedson, there have been 355 days when the Bitcoin price has traded at levels higher than today. This figure was derived from the “Days Spent at a Profit” metric, which tracks the number of days in Bitcoin’s history where the market price was higher than the current price. This indicator measures how much price action — in the past — has occurred above the current price level. From a historical standpoint, an increase in the number of “Days Spent at a Profit” tends to occur during bear cycles or extended periods of sideways movement, implying that different investor groups are holding BTC at a price higher than their cost bases. As Wedson highlighted, the “Days Spent at a Profit” metric reached around 775 days as the Bitcoin price approached a bottom. Going by this historical context, the current level of this indicator (355 days) suggests that the flagship cryptocurrency is still a distance away from extreme levels often associated with bearish market bottoms. Ultimately, this deduction means that the price of Bitcoin could still be at risk of an extended decline over the next 300 days. According to the Alphractal, this extended period of price decline could see BTC revisit $60,000, potentially triggering significant liquidations among retail investors and institutional players who entered the market post-ETF. Bitcoin Price At A Glance As of this writing, the price of BTC stands at around $89,900, reflecting no significant change in the past 24 hours. However, the market leader is currently down by over 5% on the weekly timeframe, while nearly 30% adrift its all-time high of $126,080. Related Reading: Can Bitcoin Revisit $97,600? Glassnode Says Watch This Featured image from iStock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57434077,
    "published": 1769256000000,
    "title": "R3 bets on Solana to bring institutional yield onchain",
    "body": "As DeFi investors seek stable, uncorrelated returns, R3 is building Solana-native structures to bring private credit and trade finance into crypto markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|R3|Tokenization|Solana News|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57434408,
    "published": 1769257253000,
    "title": "Stablecoin yield bans could push capital offshore into ‘unregulated instruments’",
    "body": "Proposed restrictions under the US CLARITY Act could drive demand for offshore and synthetic dollar products as investors seek yield outside regulated markets, experts warn.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57436265,
    "published": 1769265044000,
    "title": "Bitcoin Metric Suggests Miners Are In Recovery Mode — Price To Follow?",
    "body": "Over the past week, the price of Bitcoin faced a significant setback in its goal of reclaiming the six-figure threshold. The flagship cryptocurrency has been hovering around the $90,000 mark, as the market can’t seem to make a decision concerning the next price direction. As Bitcoin faced a mild sell-off, which, in turn, drove its price to fall from its recent highs, specific market participants were under severe pressure, including the miners. Interestingly, a recent on-chain evaluation has raised the possibility that miners’ stress might be ending soon. Miner Financial Health Flashes Classic Reversal Sign In a January 23 post on the social media platform X, market expert Axel Adler Jr highlighted that the Bitcoin miners might have started their post-capitulation recovery journey. The relevant indicator here is the Miner Financial Health Index (7D-SMA). Related Reading: Bitcoin Stuck In Bear Mode For 83 Days: Trend Pulse Confirms Structural Weakness For context, this metric tracks the balance between miner revenue and miner selling pressure. Hence, it reflects whether miners are net BTC distributors or accumulators. Simply put, the metric shows if Bitcoin miners are under pressure, stable, or even profitable. Capitulation events often reflect on the Miner Health Index as a negative value, as the amount of BTC spent surpasses the amount of BTC earned. On the other hand, miners are typically said to be in the recovery phase when the balance between revenue and spending starts to lean away from the negative. From the chart shared by the analyst, it is apparent that the index has taken on an uptrend, targeting neutral levels on the metric’s charts. History shows that the index does not merely target the neutral mark when it trends upward. Hence, if history were to repeat itself, the Bitcoin miners could be in for a rewarding ride, having survived the most recent capitulation event. Interestingly, the price of Bitcoin appears to have a directly proportional relationship with the Miner Health Index. Bitcoin Price Gathers Momentum As Market Condition Shifts In a separate post on X, Bitcoin Vector highlighted that Bitcoin might be garnering strength for a significant move in the near term. According to the analytics platform, this development coincides with the market exiting what was previously a “high-risk environment.” Bitcoin Vector explained that this exit from a risky market environment was last seen in April 2025, just before the bull run resumed. The on-chain analytics firm explained that we could be witnessing the late stages of a classic momentum bottoming pattern, which historically leads to large rallies. Essentially, there has to be one last push lower in price and, at the same time, a momentum boost to the upside, for the bullish signal to be completely formed. As of this writing, Bitcoin is valued at around $89,830 with no significant movement in the past 24 hours. Related Reading: Ethereum Bulls Must Conquer $3,050 Or Momentum Quickly Fades Featured image from iStock, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|bitcoin miners|Bitcoin news|bitcoin price|btc price|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57437178,
    "published": 1769269209000,
    "title": "Ukraine banned Polymarket and there’s no legal way for it to come back",
    "body": "Polymarket and similar platforms are considered unlicensed gambling operators, leading to blocked access.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Ukraine|Polymarket|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 57437412,
    "published": 1769270405000,
    "title": "Aave Price Structure Hinges On Crucial $145 Level — Here’s How",
    "body": "As the crypto market suffered a widespread decline, Aave (AAVE) prices dipped by nearly 10%, reaching a local bottom around $153. Presently, the altcoin is trading within a range of $155-$160, but an emerging chart pattern indicates an impending price breakout. Related Reading: XRP Price Recovery Is Possible If It Reclaims This Ichimoku Base AAVE Falling Wedge Nears Explosion Point, $145 As Key Price Floor In an X post on January 23, popular market expert Ali Martinez shares an insightful analysis of the AAVEUSD 4-hour chart, showing the altcoin is approaching a critical market juncture. Notably, a key support zone of $144 sits at the base of a broader descending structure that has defined AAVE’s price action since last year. Martinez’s analysis shows that AAVE is trading within a falling wedge formation, characterized by a series of lower highs capped by a descending trendline and relatively stable support near the $145 region. This price formation often represents a period of consolidation following sustained downside pressure, as sellers gradually lose momentum while buyers defend a key floor. For context, since topping out above the $350 level earlier in the cycle, AAVE has experienced a steady corrective move, with price stepping down through multiple horizontal levels near $240, $200, and $162. The loss of these zones shifted short-term momentum firmly in favor of sellers, making the current support range even more important. At present, AAVE is trading in the mid $150s, leaving limited room before a direct retest of the $144.93 support. However, this level has already acted as a demand zone multiple times during the current downtrend, reinforcing its significance. According to Martinez’s analysis, a clean break below $145 could force an accelerated downside move, with the next major support area set around $125. In that scenario, price acceptance below the wedge structure would likely confirm a continuation of the broader bearish trend. Conversely, holding the $145 support may provide the conditions for a technical rebound. A successful defense of this level, combined with a break above the descending trendline, could allow AAVE to reclaim higher resistance zones around $162 and potentially $200 over time. While such a move would not immediately invalidate the larger corrective structure, it would suggest improving market balance and decreased selling pressure. Related Reading: Ethereum Emerges As Likely Candidate In BlackRock Tokenization Vision – Here’s Why AAVE Price Overview At press time, Aave trades at $156.99, reflecting a decline of 0.76% in the past 24 hours. Meanwhile, the daily trading volume is up by 6.07% and valued at $362.59 million. With price compressing toward the apex of the falling wedge, traders should expect increased volatility in the coming AAVE trading sessions. For now, the price moves at $144.93 as a pivotal inflection point for determining the next directional move. Featured image from Rootsttrap, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Aave|aave|Aave Support|AAVEUSD|aaveusdt|Ali Martinez|falling wedge",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 2,
        "NAME": "AAVE",
        "CATEGORY": "AAVE"
      },
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57437457,
    "published": 1769270565000,
    "title": "One of the oldest NFT trading platform which facilitated over $300 million in sales at its peak shuts down",
    "body": "The platform, Nifty Gateway, which once facilitated over $300 million in sales, had shifted its focus to building onchain creative projects in 2024, but will now close.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|NFTs|Gemini Exchange|Nft marketplace|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 57437826,
    "published": 1769272005000,
    "title": "Here's what bitcoin bulls are saying as price remains stuck during global rally",
    "body": "It's about a lot more than \"zooming out.\" Supply overhangs and investor \"muscle memory\" regarding gold help explain bitcoin's poor absolute and relative performance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Exclusive|Top Stories|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57438128,
    "published": 1769273259000,
    "title": "Spacecoin launches SPACE token just days after partnering with Trump family-linked DeFi project",
    "body": "The project aims to create a decentralized satellite internet network, with the initial satellites, CTC-0 and CTC-1, already demonstrating blockchain-based communication from space.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Space|Satellite|DePIN|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57438768,
    "published": 1769275840000,
    "title": "Gold Becomes The Whale Safe Haven As Bitcoin Takes A Back Seat",
    "body": "A large investor shifted funds into tokenized gold this week, and Bitcoin felt the impact. Prices dipped while a whale quietly bought millions in XAUT, a gold-backed token, signaling a short-term move toward traditional hedges. Related Reading: Bitcoin Influencers Get Spotlight In X’s New ‘Starterpacks’ Whales Move Into Tokenized Gold According to on-chain trackers, one address moved $1.53 million in USDC into Hyperliquid to buy XAUT. Reports note that the same wallet had earlier bought about 481 XAUT, a purchase worth roughly $2.38 million. The address still holds close to $1.44 million in USDC, which suggests more purchases could follow. These moves were picked up on public blockchains and then flagged by analysts watching large transfers. This kind of action can matter. When big players shuffle cash, smaller traders often take notice and hedge their bets. The shift is not proof of a long-term trend, but it shows that, at least for now, some large holders prefer gold exposure over extra crypto risk. Whales are buying gold, not crypto. ~30 mins ago, whale 0x6B99 deposited 1.53M $USDC into Hyperliquid to buy $XAUT again. He has already bought 481.6 $XAUT($2.38M) and still holds 1.44M $USDC, which may be used to buy more $XAUT.https://t.co/0uV2kNEiD0 pic.twitter.com/rYA09b1OEn — Lookonchain (@lookonchain) January 23, 2026 Gold And Silver Hit Fresh Highs Reports say gold has been moving sharply higher, with spot prices climbing close to $5,000 per ounce in global trading this week. Silver also rose above $100 per ounce, with intraday gold prints near $4,988 before settling. Traders tie the surge to geopolitical tensions and the idea that interest rates may ease, which encourages money into metal-based stores of value. A weaker dollar has also helped. Market chatter points to increased demand as investors seek steadier places to park capital while global politics and policy choices create more worry. Bitcoin’s Price Action And Market Mood Bitcoin traded around $88,653 at one stage, slipping about 1% on the day and nearly 30% below its prior cycle top. That gap is large. It has market participants questioning whether BTC will stay the go-to hedge during times of high stress. Some long-term holders remain confident. Others are watching liquidity and macro signals more closely. Reports have disclosed renewed criticism from economist Peter Schiff, who argued that Bitcoin has underperformed versus gold since 2021. He highlighted the opportunity cost for investors holding BTC while metals climb to record prices. Schiff wrote on social platforms that precious metals are outperforming and that this weak run for Bitcoin weakens its role as a store of value in the eyes of some. Related Reading: XRP Showing Strength, Analyst Points To $4 Potential What This Means For Crypto Investors Short-term rotations like this often reflect risk preferences rather than permanent shifts. Some funds and wealthy individuals seek lower-volatility assets when headlines grow louder and policy paths look uncertain. Others still view Bitcoin as a long-term play tied to scarcity and network effects. The current picture is a mix: metals are strong, tokenized gold is drawing attention, and crypto markets are reacting. Featured image from Pexels, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|gold|Precious Metals",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57438672,
    "published": 1769275467000,
    "title": "Ethereum treasury firm buys jet engines amid tokenization push after selling ETH",
    "body": "ETHZilla is betting on bringing real-world assets on blockchain rails after it sold at least $114.5 million of its ETH stash over the past months.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Ethereum News|Ethereum Treasury|Tokenization|Real World Assets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57440043,
    "published": 1769281209000,
    "title": "XRP To $11, And Then $70: The Next Impulse Wave To Watch Out For",
    "body": "Crypto analyst CryptoBull has highlighted targets that XRP could reach as it eyes double digits. The analyst is confident the altcoin could reach these targets, noting that current price action is mirroring the previous bull run. XRP Eyes Rally To $11 And Then $70 In an X post, Crypto Bull stated that the next impulse will take XRP to $11 and that the last wave will take the altcoin to $70. This came as he noted that the price pattern is mirroring the previous bull run, with the only difference being time, which he claimed makes sense, as the altcoin needs longer accumulation to reach higher prices. Related Reading: XRP Completes ‘Super Guppy Compression’ Against Bitcoin, Next Target Emerges The analyst also indicated that it could take a year of accumulation for XRP to reach the $11 price target, meaning the last wave to $70 could take much longer. This prediction comes despite the current decline in the crypto market, with XRP trading below the psychological $2 price level. Despite the current bearish sentiment, crypto analyst CW has also declared that the XRP rally is about to begin and that the road to $21.5 is just the beginning. He noted that this is the Phase 4 peak while the first goal is for the altcoin to break its current all-time high (ATH). His accompanying chart showed that XRP could reach this $21 target by year-end. Meanwhile, there is the possibility of the altcoin rallying above $100 in the next Phase 1, which could happen next year. Crypto Pundit X Finance Bull recently highlighted the CLARITY Act and Trump’s tariffs as factors that could boost XRP’s demand and lead to higher prices for the altcoin. He expects the CLARITY Act to boost XRP’s demand, especially with Trump’s Crypto Czar predicting that more banks will enter into crypto once the bill passes. X Finance Bull predicts that XRP will be the token of choice for these banks based on his belief that Ripple will provide the rails to onboard them. XRP Breaking Out Of Multi-Year Triangle Crypto analyst XForce revealed in an X post that XRP is breaking out of the largest 6+ year triangle in history, yet people are calling it a fakeout. He added that he is not a permabull or permanbear on the altcoin but that he follows trends and plays macro breakout patterns. His accompanying chart indicated that XRP was on the verge of a move to the upside, with a potential rally above $11.50. Related Reading: XRP Price Recovery Is Possible If It Reclaims This Ichimoku Base On the lower timeframe, crypto analyst Chart Nerd stated that XRP is currently breaking out of a two-week falling wedge structure. He noted that this is a bullish reversal pattern that could send the altcoin back to $2.40 in the short term, as this is where the wedge formed. He highlighted a key resistance between $2.13 and $2.20, which the altcoin will need to break above to confirm a reversal. At the time of writing, the XRP price is trading at around $1.92, up in the last 24 hours, according to data from CoinMarketCap. Featured image from Peakpx, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|altcoin|Chart Nerd|CLARITY Act|CoinMarketCap|Crypto Bull|crypto czar|CW|Donald Trump|Ripple|XForce|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57440352,
    "published": 1769282556000,
    "title": "Coinbase CEO says Big banks now view crypto as an ‘existential’ threat to their business",
    "body": "Brian Armstrong returns from World Economic Forum with message: traditional finance is taking crypto seriously",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Coinbase|Brain armstrong|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57441170,
    "published": 1769286052000,
    "title": "Ethereum Foundation Forms Post-Quantum Team as Security Concerns Mount",
    "body": "Ethereum researcher Justin Drake said the ecosystem is moving from research to execution as the threat from quantum computing draws closer.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57441735,
    "published": 1769288400000,
    "title": "Here’s why bitcoin’s is failing its role as a 'safe haven' versus gold",
    "body": "Bitcoin behaves more like an \"ATM\" during uncertain times, with investors quickly selling it to raise cash.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Gold|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57442567,
    "published": 1769292000000,
    "title": "End Of This Reaccumulation Phase Could Trigger Most Aggressive XRP Rally Ever",
    "body": "XRP has spent most of the past few months trading with lower highs since July 2025, frustrating traders and compressing price action into an increasingly tight range. However, a technical breakdown shared by crypto analyst ChartNerd argued that what looks like stagnation may actually be the final preparation phase before a historic move. The price structure suggests something far bigger that sends XRP on its most aggressive rally in eight years, but the implications only become clear when the full setup is examined. Related Reading: Bitcoin Influencers Get Spotlight In X’s New ‘Starterpacks’ A 400-Day Rectangular Reaccumulation Still Holding Structure According to technical analysis done by ChartNerd, XRP’s price action has been locked inside a rectangular reaccumulation zone for about 400 days, and this has led to the formation of what looks like a rectangular bull flag on a macro timeframe. The technical chart shows a strong impulsive move from July 2024 to December 2024 acting as the flagpole, right when XRP peaked at the $3.4 price zone back then. This impulsive flagpole has been followed by a long period of sideways trading where XRP’s price has repeatedly respected a clearly defined support around $1.8 and resistance boundaries around $3.6. This type of structure is associated with reaccumulation within the support and resistance zones, especially when it is playing out after a sharp expansion move and holding for this length of time. Each dip into reaccumulation support has been absorbed, preventing any sustained breakdown and keeping the broader pattern intact. ChartNerd noted that the rectangular flag will be valid as long as this support level is defended, and this will activate the expansion journey. XRP Price Chart. Source: @ChartNerdTA on X Macro Breakout Projection Puts XRP Price Target At $23 According to ChartNerd, bearish participants are increasingly pressured by the fact that this fractal is still holding despite repeated attempts to invalidate it. The longer XRP’s price action is trapped inside the rectangle without breaking down, the more likely it becomes that the eventual resolution favors the dominant trend that preceded the consolidation. In this case, that trend was bullish, which strengthens the case for an upside breakout once resistance is cleared. If the rectangular bull flag resolves to the upside as projected, the chart outlines a breakout trajectory that would carry XRP into double-digit territory, with a long-term target region near $23. This price target projection is derived from the height of the flagpole extended from the top of the reaccumulation range. Related Reading: Crypto Meets Private Banking: UBS Weighs New Offering ChartNerd labelled this possible move as one of the most aggressive rallies XRP could see in seven to eight years. At the time of writing, XRP is trading around $1.92, meaning a move toward the $23 region would represent a gain of over 1,000% from current levels, which is a type of percentage expansion XRP has played out well in the past. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|crypto|crypto news|cryptocurrency|xrp|xrp news|XRP Price|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57445301,
    "published": 1769302805000,
    "title": "Analyst Says You’re Not Bullish Enough On Ethereum – What Does He Mean?",
    "body": "A growing number of analysts believe Ethereum’s current price action is being misunderstood. Although frustration is growing due to Ethereum’s inability to hold above $3,000, some technical analysts are quick to point out that the structure forming beneath the surface tells a very different story. According to one analyst, the real risk right now is not being bullish on Ethereum and trying to short in anticipation of a downside breakout. Related Reading: Crypto Meets Private Banking: UBS Weighs New Offering Higher Lows And A Structure That Keeps Tightening The analyst’s technical view on Ethereum is focused less on short-term momentum and more on the structure developing on the chart, which he argues is even clearer than what is currently visible on Bitcoin’s chart. Notably, Ethereum’s price action is carving out a series of higher lows on the daily candlestick timeframe chart to form a tightening triangular pattern since December 2025. This kind of behavior shows that each pullback is being absorbed at progressively higher levels, which is how strong trends reset before continuation. Ethereum needs to avoid a breakdown below key support zones in order for this trend continuation setup to still be valid. According to the analyst, a dip under $2,860 would begin to weaken the pattern, while a close below $2,780 would invalidate the higher-low structure. At the time of writing, Ethereum is trading around $2,950, which is dangerously close to the lower boundary of this setup. Therefore, some traders will be tempted to short Ethereum at this level, but the analyst called it the dumbest thing to do here. As long as those levels ($2,860 and $2,780) hold, the analyst sees no technical justification for betting against ETH, especially near the lower boundary of the channel where buyers have repeatedly stepped in. If support holds, the next move would be a gradual return to the upper trendline of the channel, which is just below $3,340. A move into that region would bring price back into direct contact with overhead resistance and set the stage for a breakout if buying pressure continues to increase. Ethereum Price Chart. Source: @Tryrexcrypto on X The Bigger Picture Behind Ethereum’s Price Action Ethereum is entering 2026 without clear bullish momentum, a reality that has dampened sentiment across the spot and derivatives markets. Spot ETF inflows into Ethereum and Bitcoin have slowed down, and issuers have been highlighted with consistent days of outflows. Nonetheless, major asset managers are still holding huge amounts of Ethereum and are working on diversifying their activities on Ethereum. BlackRock, for example, filed with the SEC in December to launch a staked Ethereum exchange-traded fund, a move that will bring in more institutional investors into the Ethereum ecosystem. Related Reading: Bitcoin Influencers Get Spotlight In X’s New ‘Starterpacks’ Speaking of staking, BitMine Technologies recently amped up its ETH staking to over $5.71 billion worth of Ethereum. On-chain data from Arkham Intelligence shows that the firm has staked an additional 171,264, worth $503.2 million, pushing its total stake to over 1.94 million ETH. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|crypto|crypto news|cryptocurrency|ethereum|ethusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57445798,
    "published": 1769304539000,
    "title": "US Bitcoin ETFs bleed $1.72B in five-day outflow streak",
    "body": "The extended outflow streak comes as a widely used crypto sentiment indicator has stayed within the “Extreme Fear” range since Wednesday.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]