[
  {
    "id": 57952961,
    "published": 1770871745000,
    "title": "Thailand approves crypto as underlying assets in derivatives markets",
    "body": "Binance Thailand's chief executive said it is a \"watershed moment\" for digital assets in the country, which he says are no longer merely speculative instruments.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57953288,
    "published": 1770872886000,
    "title": "Dogecoin (DOGE) Stumbles Lower, Market Awaits Trend Shift Signal",
    "body": "Dogecoin corrected some gains and traded below $0.0950 against the US Dollar. DOGE is now holding the $0.0885 support but might decline further. DOGE price started a fresh downside correction from $0.1020. The price is trading below the $0.10 level and the 100-hourly simple moving average. There is a key declining channel forming with resistance at $0.0935 on the hourly chart of the DOGE/USD pair (data source from Kraken). The price could aim for a fresh increase if it remains stable above $0.0880. Dogecoin Price Dips Again Dogecoin price started a downside correction after it failed to clear $0.1020, like Bitcoin and Ethereum . DOGE declined below the $0.10 and $0.0980 levels. There was a move below the 50% Fib retracement level of the upward move from the $0.080 swing low to the $0.1020 high. The bears even pushed the price below $0.090. Besides, there is a key declining channel forming with resistance at $0.0935 on the hourly chart of the DOGE/USD pair. Dogecoin price is now trading below the $0.10 level and the 100-hourly simple moving average. Immediate resistance on the upside is near the $0.0935 level. The first major resistance for the bulls could be near the $0.0950 level. The next major resistance is near the $0.10 level. A close above the $0.10 resistance might send the price toward $0.1050. Any more gains might send the price toward $0.1120. The next major stop for the bulls might be $0.120. More Losses In DOGE? If DOGE’s price fails to climb above the $0.10 level, it could continue to move down. Initial support on the downside is near the $0.0885 level and the 61.8% Fib retracement level of the upward move from the $0.080 swing low to the $0.1020 high. The next major support is near the $0.0850 level. The main support sits at $0.080. If there is a downside break below the $0.080 support, the price could decline further. In the stated case, the price might slide toward the $0.0765 level or even $0.0750 in the near term. Technical Indicators Hourly MACD – The MACD for DOGE/USD is now gaining momentum in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for DOGE/USD is now below the 50 level. Major Support Levels – $0.0885 and $0.0850. Major Resistance Levels – $0.0935 and $0.1000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "DOGE|DOGE news|Doge price|DOGE USD|DOGE/BTC|DOGE/USDT|Dogecoin|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57953216,
    "published": 1770872417000,
    "title": "The WhatsApp moment for money is here",
    "body": "This is the year that stablecoins are becoming part of the mainstream for online and international payments",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57954079,
    "published": 1770874493000,
    "title": "Russia is blocking WhatsApp to push ‘surveillance’ app, company says",
    "body": "Russian news outlets reported on Wednesday that WhatsApp’s domain had been completely blocked and was inaccessible without a VPN or another workaround.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57953927,
    "published": 1770874306000,
    "title": "US Banks Urge Regulator to Slow Crypto-Linked Charters Amid Rule Overhaul",
    "body": "The warning comes as crypto firms push for deeper access to the U.S. banking system, heightening tensions over unresolved regulatory gaps.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57956047,
    "published": 1770879645000,
    "title": "Bitcoin Realized Losses Hit Luna Crash Levels — But Price Context Points To A Different Market Phase",
    "body": "Bitcoin is facing renewed selling pressure after losing the key $70,000 level, a breakdown that has pushed the market into a more defensive phase. The inability to hold this psychological support has weighed on sentiment. With traders increasingly cautious as volatility rises and liquidity conditions remain uncertain. Price action near the mid-$60,000 range now represents a critical zone where market participants are assessing whether the current move is a deeper correction or simply another consolidation phase within the broader cycle. Related Reading: Bitcoin Drop Wipes Billions From Recent Buyers: New Whale Cost Basis Falls Toward $90K On-chain data highlighted by analyst Axel Adler adds important context to the recent decline. According to his analysis, realized losses across the Bitcoin network have surged to levels comparable to those seen during the June 2022 Luna and UST crash. At first glance, this suggests significant stress and widespread capitulation among investors. However, the price backdrop is markedly different this time. Whereas the 2022 losses occurred when Bitcoin traded near $19,000, the current wave of loss realization is unfolding around $67,000. This distinction materially changes how the signal is interpreted. Rather than pointing to systemic market collapse, the data may reflect the flushing out of late-cycle buyers and leveraged positions, leaving Bitcoin at a pivotal stage where demand strength will determine the next directional move. Extreme Realized Losses Signal Capitulation, Not Structural Breakdown Axel Adler’s latest on-chain assessment highlights a sharp deterioration in Bitcoin’s realized profit and loss dynamics. The Bitcoin Net Realized Profit/Loss 7-day moving average recently dropped to around -$1.99 billion, signaling large-scale loss-taking comparable to conditions seen during the June 2022 Luna-driven market shock. This metric tracks the balance between realized profits and losses from coins moving on-chain, offering a smoothed view of investor behavior over time. Although the indicator slightly recovered to roughly -$1.73 billion in the following days, it still represents the second-deepest negative reading on record. Net losses have remained below -$1.7 billion for several consecutive sessions. This indicates persistent seller pressure and ongoing capitulation among investors who entered the market at higher prices. Historically, a sustained return above zero has marked transitions back to profit-dominant market phases. Bitcoin Realized Loss has climbed to approximately $2.3 billion on a 7-day basis, a level comparable to peak stress during the 2022 crash. However, the broader context differs significantly. Similar loss volumes are now occurring near $67,000 rather than $19,000, suggesting a cyclical flush of late bull-market entrants rather than systemic market failure or structural network deterioration. Related Reading: Ethereum Holders Shift To Self-Custody As Market Consolidates Near $2K Bitcoin Breakdown Extends As Momentum Remains Bearish Bitcoin’s daily chart reflects sustained downside pressure after the decisive loss of the $70,000 level. The price is now hovering in the mid-$60,000 range following a sharp decline. The move confirms a clear shift in short-term market structure, characterized by lower highs, accelerating selloffs, and repeated failures to reclaim former support zones. This pattern typically signals weakening bullish momentum and increasing caution among market participants. Technically, Bitcoin is trading below key moving averages, which now act as overhead resistance rather than support. The inability to recover these levels suggests that sellers continue to dominate short-term price action. Recent spikes in trading volume during the drop reinforce the idea of forced deleveraging and defensive positioning rather than orderly rotation or accumulation. Related Reading: Ethereum Crash Below $2,000 Triggers Record Token Movement: Hinting At Capitulation The $60,000–$62,000 region emerges as the next critical support area. Aligning with prior consolidation zones and historical liquidity clusters. Holding this range would help stabilize sentiment and potentially enable consolidation. A break below it, however, could open the door to deeper retracement scenarios. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin analysis|bitcoin bear market|Bitcoin correction|Bitcoin news|bitcoin price|Bitcoin Realized Losses|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57957130,
    "published": 1770882306000,
    "title": "OKX Ventures backs STBL in partnership with Hamilton Lane and Securitize",
    "body": "The companies are joining forces to introduce an RWA-backed stablecoin on OKX’s Ethereum-compatible layer-2 blockchain, X Layer.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Securitize|Consensus Hong Kong 2026|Tokenization|Stablecoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57957553,
    "published": 1770883236000,
    "title": "Bitcoin Flashes Luna-Level Capitulation Signal at $67K, Not $19K",
    "body": "Bitcoin is printing on-chain loss-taking on a scale last seen during the Luna/UST meltdown, but at a radically different price point, a distinction that changes what the signal likely means for this drawdown. Axel Adler Jr. said Bitcoin’s Net Realized Profit/Loss has sunk deep into negative territory, with the 7-day moving average falling to -$1.99 billion on Feb. 7 before improving slightly to -$1.73 billion by Feb. 10. That places the current regime among the most severe loss-dominant stretches on record. Adler described it as “the second deepest negative reading in the entire history of observations,” exceeded only by June 18, 2022, when the metric hit -$2.24 billion amid the Luna/UST crash and cascading liquidations. The key detail, Adler argues, is persistence. Net Realized Profit/Loss has stayed below roughly -$1.7 billion for five consecutive days, forming what he framed as a sustained cluster of seller pressure, the kind of multi-day compression that typically marks capitulation behavior rather than a single shock print. In Adler’s framing, the mechanic is straightforward: realized losses are dominating realized profits on moved coins, and the market is working through the supply owned by participants forced or willing to sell below their cost basis. Related Reading: These Three Catalysts Could Spark Bitcoin’s Next Rally, According To Wintermute “The depth and duration of the current negative regime point to massive capitulation of participants who bought coins at higher levels,” he wrote. “The key reversal trigger is the return of Net Realized Profit/Loss above zero, which would signal the market’s transition from loss dominance to profit dominance. As long as the metric remains in deeply negative territory, seller pressure persists.” Bitcoin Losses Match Luna Crash Scale The companion chart, Bitcoin Realized Loss (7DMA), shows realized losses rising to about $2.3 billion on Feb. 7 and holding near that level through Feb. 10, another rarity in historical context. Adler called it “one of the highest smoothed levels in the entire history of observations,” explicitly comparing it to June 2022. He also emphasized that the 7-day smoothing understates peak stress in real time. At the height of the 2022 episode, Adler noted, single-day losses were roughly three times higher than the weekly-smoothed figure. In the current window, he pointed to a single-day realized loss of $6.05 billion on Feb. 5, the second-largest one-day loss in Bitcoin’s history, according to his note. The headline comparison, however, is not just magnitude but setting. In 2022, a similar realized-loss regime occurred with bitcoin trading around $19,000. This time, Adler says, the losses are being crystallized around $67,000 after a pullback from $125,000, a context he frames as a correction that is flushing out late entries rather than an ecosystem-wide failure cascade. Related Reading: Bitcoin Chart Screams 2022 Bear Market, Until You Notice What’s Missing “Back then, Realized Loss at $2.7B was occurring at a price of $19K,” Adler wrote. “Now, comparable loss volumes are being locked in at a price of $67K, which suggests not a systemic crash but rather a flushing out of late bull-cycle entries. This is capitulation of local top buyers, not a fundamental loss of network value.” Adler’s playbook puts two markers front and center. The first is a sustained move of Net Realized Profit/Loss (7DMA) back above zero for multiple weeks, which he frames as the transition from loss dominance to profit dominance. The second is a decline of Realized Loss (7DMA) below $1 billion, which would indicate that the wave of forced or pain-driven selling is fading. The risk, in his view, is that the market’s “cleansing stress” shifts into something more final if price weakness compounds. Adler flagged the sub-$60,000 area as a line where continued growth in realized losses alongside further price decline could turn a correction into “full-blown capitulation”, not because the current prints are small, but because the regime could extend and deepen. For now, Adler’s core claim is that Bitcoin is producing Luna-sized loss signals without Luna-like structural damage. Same order of magnitude on-chain, different story in the tape. At press time, BTC traded at $67,924. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57959156,
    "published": 1770886855000,
    "title": "Bitcoin Social Sentiment Stays Bearish Even As Price Recovers From $60,000 Drop",
    "body": "Data shows the social media sentiment around Bitcoin has remained deeply bearish despite the recovery that the cryptocurrency’s price has made. Social Media Data Suggests Retail Still Fearful About Bitcoin In a new post on X, analytics firm Santiment has discussed about how the Positive/Negative Sentiment for Bitcoin has developed on social media following the recent recovery surge in the asset’s price. Related Reading: Ethereum Whale Selloff Continues As Supply Share Drops Under 75% The Positive/Negative Sentiment refers to an indicator that tells us, as its name suggests, how the positive and negative sentiments related to a given asset compare on the major social media platforms. The metric works by putting social media posts/threads/messages containing mentions of the asset through a machine-learning model to differentiate between positive and negative comments. Then, it counts up the number of posts in each category and finds their ratio. When the value of the indicator is greater than 1, it means the asset is observing more bullish messages than bearish ones. On the other hand, the metric being under this threshold implies the dominance of a negative sentiment. Now, here is the chart shared by Santiment that shows the trend in the Positive/Negative Sentiment for Bitcoin over the last few months: As is visible in the above graph, the Bitcoin Positive/Negative Sentiment rose to a notable level when the asset saw its rally in January. This suggests that retail traders on social media became greedy. What eventually followed the market greed was a top in the cryptocurrency and a reversal to the downside. As this drawdown took BTC back to the $60,000 level, the Positive/Negative Sentiment plummeted, meaning that fear now dominated social media platforms. Just like how the greedy sentiment led into a top, this bearish mentality paved way for a rebound instead. This is a pattern that has been witnessed with digital asset markets time and time again, with prices tending to move against the expectations of the crowd. Interestingly, even though BTC has climbed back into the high $60,000 levels since its low, the Positive/Negative Sentiment has continued to be at low levels. “Historically, while FUD is high, price rebounds have a heightened probability,” noted the analytics firm. It now remains to be seen how Bitcoin will develop in the near future, given the current bearish sentiment. Related Reading: Bitcoin Giant Awakens: 2,043 BTC Moved After 7-Year Slumber In some other news, the stablecoin market cap has dipped recently, as Capriole Investments founder Charles Edwards has highlighted in an X post. Edwards has pointed out that the stablecoin market cap has historically only fallen in bear markets. If the recent trajectory of the combined USDT and USDC market cap is to go by, capital may once again be leaving this side of the sector. BTC Price Bitcoin recovered above $70,000 earlier, but the coin has since retraced a bit as its price is now trading around $67,700. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin Positive/Negative Sentiment|Bitcoin Social Media Sentiment|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57959846,
    "published": 1770888204000,
    "title": "Bankers push OCC to slow crypto trust charters until GENIUS rules clarified",
    "body": "The American Bankers Association pressed the OCC to delay new national trust bank charters for crypto and stablecoin firms until the GENIUS Act framework is fully in place.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57960501,
    "published": 1770890009000,
    "title": "zkME Technology wins $20,000 PitchFest prize at Consensus Hong Kong",
    "body": "The Hong Kong-based DePin company beat out 11 other finalists with its identity verification solution aimed at bringing DeFi to the mainstream.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Consensus Hong Kong 2026|Crypto startup|DePIN|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      }
    ]
  },
  {
    "id": 57960680,
    "published": 1770890440000,
    "title": "LayerZero (ZRO) Soars 40% Amid Zero Blockchain Debut, Major Institutional Backing",
    "body": "ZRO, the native token of the omnichain interpretability protocol LayerZero, has skyrocketed more than 40% on the past day following the announcement of its new Layer-1 (L1) blockchain backed by major institutional players. Related Reading: XRP Positioned For Major Structure Shift As Price Tests Critical Level LayerZero Unveils Zero Blockchain On Tuesday, LayerZero Labs announced a new L1 blockchain, Zero, aimed at institutional financial markets. According to the announcement, it is set to launch in fall 2026, with three initial “zones,” described as permissionless environments fully owned and governed by the underlying network. Moreover, ZRO will serve as the network’s native token, providing interoperability between Zones and across the 165+ blockchains it connects. Designed to “eliminate the long-standing scalability challenges of decentralized networks,” Zero is set to process 2 million transactions per second (TPS) per Zone and charge near-zero fees by targeting four primary bottlenecks. “By leveraging Zero-Knowledge (ZK) proofs to decouple execution from verification, Zero transitions the network from redundant replication to a heterogeneous architecture,” LayerZero Labs explained on X. “This structural shift allows for two distinct validator classes: lightweight Block Validators capable of running on low-grade consumer hardware and optional higher performance Block Producers,” it continued. Bryan Pellegrino, CEO of LayerZero Labs, affirmed that Zero’s architecture advances the industry’s roadmap by at least a decade. “We believe we can actually bring the entire global economy onchain with this technology. Our mission is to build permissionless infrastructure for a better world – this is the beginning of that world,” he added. Zero Receives Major Institutional Backing The rollout was backed by key institutional players, including Citadel Securities, The Depository Trust & Clearing Corporation (DTCC), ARK Invest, Google Cloud, and Intercontinental Exchange (ICE). Notably, Citadel Securities is collaborating to evaluate how its technology could apply to trading, clearing, and settlement workflows. Additionally, it made a strategic investment in ZRO. ARK Invest is becoming a shareholder of LayerZero equity and ZRO. Meanwhile, Cathie Wood, the company’s CEO and CIO, joined LayerZero’s new advisory board alongside Michael Blaugrund, VP of Strategic Initiatives at ICE, and Caroline Butler, former head of digital assets at BNY Mellon. “This is a historic opportunity at the intersection of finance and the internet. I am thrilled to join LayerZero’s advisory board and help accelerate the adoption of Zero by the largest markets and companies in the world,” Wood said in a statement. DTCC will investigate the Zero blockchain architecture to enhance the scalability of the DTC Tokenization Service and collateral management, while ICE will examine it for 24/7 trading and tokenized collateral. Moreover, Google Cloud partnered to explore how to enable AI agents to make micropayments and trade resources instantly. Tether also announced a separate strategic investment in LayerZero Labs on Tuesday. ZRO Price Skyrockets Following the news, ZRO soared more than 40% in the last 24 hours, hitting a four-month high of $2.59 on Wednesday morning. The cryptocurrency had been trading between the $1.50 and $2.00 area over the past few weeks, reaching a local low of $1.35 during last week’s crash. Now, the recent momentum has pushed LayerZero back above the $2.00 area and toward a major resistance area. The cryptocurrency has been unable to reclaim the $2.60 mark since June, being rejected from this area after each retest. Related Reading: Bitcoin Could See New Drop To $60,000 Despite Bounce – Here’s The Level To Defend If ZRO reclaims $2.60, it could target the next major resistance, located at around $3.00. Analyst Crypto Tony affirmed that if the cryptocurrency clears this level, “we are good for $3.30. Wave 3 is beginning.” As of this writing, ZRO is trading at $2.45, a 36.5% increase in the weekly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|ark invest|Bryan Pellegrino|Cathie Wood|Citadel Securities|dtcc|Intercontinental Exchange|LayerZero blockchain|LayerZero Labs|tether|Zero blockchain|ZRO|ZRO price|ZROUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57961430,
    "published": 1770891958000,
    "title": "UK government appoints HSBC for tokenized bond pilot",
    "body": "The UK appointed HSBC Orion for its DIGIT pilot to explore blockchain bonds, aiming to improve efficiency, cut costs and boost security.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      }
    ]
  },
  {
    "id": 57962069,
    "published": 1770893647000,
    "title": "Agant registers with U.K. FCA ahead of British pound stablecoin debut",
    "body": "The issuer cleared a key regulatory hurdle as it prepares to roll out GBPA, a fully backed sterling stablecoin targeting institutional use.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Stablecoins|U.K. Financial Conduct Authority|GBP|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57961704,
    "published": 1770892864000,
    "title": "Solana leans into tokenization and payments at Hong Kong’s Accelerate APAC event",
    "body": "From ETFs to stablecoins to AI infrastructure, Solana’s pitch in Hong Kong was clear: less memecoin mania, more internet capital markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Consensus Hong Kong 2026|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57962410,
    "published": 1770894194000,
    "title": "AI-powered agents dominate the EasyA x Consensus Hong Kong hackathon",
    "body": "Winning projects like FoundrAI demonstrate how generative AI is allowing developers to build market-ready products in just 48 hours.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Consensus Hong Kong 2026|Hackathon|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      }
    ]
  },
  {
    "id": 57962161,
    "published": 1770893571000,
    "title": "Ark Invest buys Bullish stock for 9th straight day in $11.6 million purchase",
    "body": "Ark bought around 2.1 million BLSH shares in the past nine trading days, valued about $58.8 million based on the stock's closing price each day.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|ARK Invest|Bullish|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 57963285,
    "published": 1770896599000,
    "title": "Bitcoin defies 'extreme fear,' hot jobs report to show signs of resilience",
    "body": "Bitcoin rose after the U.S. jobs report indicated employment growth in many sectors of the economy was restrained even as the headline number surged.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|Derivatives|Altcoins|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57963771,
    "published": 1770897600000,
    "title": "Espresso network launches ESP token with 10% airdrop amid Ethereum layer-2 debate",
    "body": "The network transitioned to proof-of-stake and coincides with the rollout of the ESP token, which is used for staking, securing the network and protocol participation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|airdrop|layer 2|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 204,
        "NAME": "AIRDROP",
        "CATEGORY": "AIRDROP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57964559,
    "published": 1770899432000,
    "title": "XRP Community Day Recap: The 7 Most Bullish Takeaways",
    "body": "Ripple used XRP Community Day to tighten its message: XRP is not an accessory to the business, it’s the organizing principle and the company is positioning its product stack, regulatory posture, and institutional roadmap around that premise. XRP Community Day Highlights CEO Brad Garlinghouse went straight for the ceiling. “There will be a trillion dollar crypto company, I don’t doubt that for a second,” he said. “I think Ripple has the opportunity to be that company, and maybe there’ll be more than one.” The framing matters because it’s not a token price call — it’s a scale argument about where regulated rails, liquidity, and enterprise distribution could concentrate as XRP plugs further into legacy finance. Policy was the second major pillar. Garlinghouse put odds on the table for US legislation, predicting a “75%” chance the CLARITY Act will be “very close to getting signed by the end of April.” Related Reading: XRP Positioned For Major Structure Shift As Price Tests Critical Level Garlinghouse also tried to reconcile market volatility with institutional appetite, pointing to ETF flow behavior during a rough tape. “I believe in a multi-chain world. Even last week, when there was massive carnage going on in the market, there was positive XRP ETF inflows of $30M or $40M,” he said. “Public markets are keen to invest in crypto. Customers want it.” The compliance posture was framed less as defensive and more as a competitive moat by Garlinghouse. “We want to be the most regulated, compliant, because we’re focused on institutional flows—that is the priority,” Garlinghouse said. “The OCC charter makes it very clear that RLUSD is a leader under the GENIUS Act, it cements our leading position.” In Ripple’s telling, regulatory credentials aren’t a cost center; they’re how you win mandates, counterparties, and distribution in the parts of the market that actually move size. He also hinted at some major progress on the Fed Masters Account. “Now, there’s been a lot of speculation about what we could do in the future,” Garlinghouse said. “There’s been some commentary about a Fed Master Account, which we do think is compelling. And there’s things we may do in the future that I’m not gonna go into today.” He then anchored the point in trajectory rather than rumor: conditional OCC approval and engagement, he said, represent “massive progress relative to where we started this journey.” Related Reading: Glassnode: XRP Is Back In Its 2021-2022 Playbook As SOPR Drops Sub 1 On XRP itself, Garlinghouse delivered the cleanest thesis statement of the event: “XRP is the north star for Ripple. It’s our purpose.” He tied Ripple Payments, Ripple Prime, Ripple Treasury, custody, and RLUSD to a single objective: “how we can drive utility, trust, liquidity around XRPL.” President Monica Long expanded that into an execution roadmap: “We’re rewinding the tape back to the founding of the company, like XRP and the Ledger are our reason for being,” she said. “So we call it our North Star, like that this is kind of what guides us in a lot of our product strategy and decision-making.” From there, she outlined three institutional-flavored pushes: bringing more licensed payments flow onto the XRPL DEX, a “payments credit” concept that matches payment-provider financing needs with XRP holders seeking yield via a proposed lending protocol amendment, and growing custody demand as banks move past safekeeping and into tokenization of deposits, funds, and traditional securities. At press time, XRP traded at $1.38. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|Ripple|xrp|XRP Community Day|xrp news|XRP Price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57964501,
    "published": 1770899120000,
    "title": "Forget $80k: Michael Terpin warns bitcoin could revisit the $40,000s before a real recovery",
    "body": "Terpin argued that bitcoin’s post-halving bubble followed its typical arc and says history suggests the market may still face another wave of pain.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Consensus Hong Kong 2026|Transform Ventures|Michael Terpin|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57965436,
    "published": 1770901766000,
    "title": "Morning Minute: Coinbase Gives AI Agents Their Own Wallets",
    "body": "Something big is happening with AI. And Coinbase is betting on it becoming much bigger...",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Opinion",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57965352,
    "published": 1770901599000,
    "title": "Bitcoin Trapped In Bear Market Woes As Liquidity Runs Dry, Is Another Crash Coming?",
    "body": "Bitcoin’s price structure is showing signs of strain, and new data from CryptoQuant shows that fresh capital is no longer entering the market. Instead of the recent drawdown acting as an attraction for buyers, it appears to be triggering withdrawals. This change in liquidity behavior is important, as it indicates that Bitcoin may be transitioning into deeper bear market conditions. Notably, on-chain metrics tracking new liquidity flows are revealing negative cumulative inflows over the past month. Selling Pressure Builds, New Investor Inflows Flip Negative According to a recent analysis that was done on the CryptoQuant platform, Bitcoin’s 30-day cumulative new investor flow has dropped to approximately $2.6 billion. Related Reading: Analyst Reveals The Best Time To Buy Bitcoin And The Best Time To Sell This metric was revealed from CryptoQuant’s ‘Bitcoin New Investor Flow’ data, which is revealing that more capital is leaving the ecosystem than entering it. The data shows that the ongoing dip is failing to attract meaningful participation from new buyers. Interestingly, the current reading of this metric is displaying a huge contrast between previous bull phases and current conditions. Large spikes in new money, visible in blue in the chart below, accompanied strong price rallies, particularly in 2017, 2021, and again during the 2024-2025 bull market. Those inflow surges coincided with powerful upside momentum in terms of price action. At present, those spikes are notably absent. Instead, the lower section of the chart is displaying growing red readings due to net capital outflows. The latest print is below zero, which shows that sell-offs are not being absorbed by fresh liquidity. This dynamic matters because markets rely on marginal buyers to sustain higher prices. When new participants step back, price action becomes vulnerable to deeper pullbacks. That is why there is a need for new buyers to absorb the selloffs. Low Liquidity Raises Crash Risks Although liquidity contraction does not automatically guarantee another major crash, it increases fragility of price action. Bitcoin, for one, is still trading below $70,000, although bulls have largely prevented further breakdowns below $60,000. This, in turn, has kept the Bitcoin price trading in a range around $70,000. Related Reading: Bitcoin Caught Between Two Liquidity Traps — Which Side Breaks First? However, many crypto analysts are of the notion that Bitcoin could still crash further to lower price levels. Calls for a deeper correction are circulating across trading platforms and social media, with projected bottoms stretching from around $55,000 to as low as $30,000. The absence of inflow spikes suggests that Bitcoin may struggle to regain momentum in the near term. If liquidity continues to dry up, the probability of another significant leg lower before a rebound increases. At the time of writing, Bitcoin is changing hands at $67,160, reflecting a modest 0.3% gain over the past 24 hours. This price behavior is unfolding alongside a slowdown in mining activity due to miners shutting down their systems, which led to the largest mining difficulty drop since 2021. Featured Image from Pixabay, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin New Investor Flow|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|cryptoquant",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57965773,
    "published": 1770902788000,
    "title": "From stablecoins to biotech: Why YZi Labs is betting on things that haven't happened yet",
    "body": "Ella Zhang of YZi Labs says her firm invests in founders building what doesn’t yet exist, guided by first principles and long-term conviction across AI, biotech and Web3.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Binance Labs|Consensus Hong Kong 2026|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57965898,
    "published": 1770902709000,
    "title": "StanChart Slashes Bitcoin 2026 Target by 33%, Warns of More Pain",
    "body": "Standard Chartered has cut its Bitcoin price forecast for the second time in less than three months, warning that the cryptocurrency could slide to hit $50,000 before recovering.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "LSE:STAN",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57966542,
    "published": 1770904846000,
    "title": "Calm Down: Ethereum Has Survived 8 Major 50% Falls, Lee Reminds Investors",
    "body": "Tom Lee, head of research at Fundstrat, is betting on a prompt bounce for Ethereum. He pointed to a pattern stretching back to 2018: each time ETH dropped deep, it later recovered strongly. Related Reading: Jim Cramer Suggests US Government Could Buy Bitcoin Near $60K That history has shaped the tone of his remarks in Hong Kong, where he argued that previous collapses ended with rapid turnarounds. Tom Lee Backs A Quick Rebound According to Lee, Ethereum has endured more than a 50% decline on eight separate occasions since 2018 and each time it came back. He used those past moves as the basis for his view that another sharp recovery is likely. Analysts often disagree about how much weight to give past cycles. $ETH 100% V-Shape Record 👀 Tom Lee highlights Ethereum’s eight V-shaped recoveries since 2018. Tom DeMark, whose models are followed by macro legends like Paul Tudor Jones and used across institutional desks, says a final undercut near $1,890 would “perfect” the bottom. That… pic.twitter.com/j9zWoUOLgP — SamAlτcoin.eth (@SAMALTCOIN_ETH) February 11, 2026 Market conditions are not identical now, yet patterns matter because traders use them. Some analysts have highlighted the $1,890 level as a likely low. They said it might be probed twice in an “undercut” before stabilizing. That kind of setup is common in volatile markets and is used to find entry points. Staking Squeezes Liquid Supply Reports note that staking demand remains strong even while prices fall. The validator entry queue has swollen to about 21 days, with roughly 4 million ETH waiting to be accepted. That has left more than 30% of the total supply locked up — about 36.7 million ETH. People are earning roughly 2.80% APR on staked coins, a modest return by crypto standards, but enough to persuade many holders to lock funds away. When large sums are immobilized like this, tradable supply thins and price reactions can be amplified on both the way down and the way up. Related Reading: More Bitcoin Ahead: Saylor, Strategy Commit To Regular BTC Purchases Ethereum Price Action And Market Strain Market moves have been sharp. ETH slid to about $1,900 at the time of writing, down 5.4% in the last seven days, and has failed to hold above $2,000 in recent days. Over the last 30 days, the token fell roughly 36%. Heavy liquidations have been recorded, with more than $1 billion in positions closed out as leverage was forced to unwind. That generated fast selling and left traders cautious. Economic data, geopolitical headlines, and anticipation of US inflation readings have added to the nervous mood. Some desks now treat any bounce as tentative until volatility eases. Whether that rebound comes fast or takes time, Lee’s stance is clear: sharp drops have not marked the end for Ethereum in the past. He sees the current stress as another chapter in a familiar cycle, not a structural break. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|bitcoin|crypto|ETH|Ether|ethereum|Tom Lee",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57966558,
    "published": 1770904771000,
    "title": "Is this crypto winter different? Key observers reevaluate Bitcoin",
    "body": "The current market downswing could be driven by institutional investors exiting positions, as crypto still presents too much risk for them.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57967325,
    "published": 1770907141000,
    "title": "Crypto industry experts at Consensus see Asian institutions pivot toward stablecoins",
    "body": "Panelists at the conference discussed how regulatory progress in Hong Kong and Japan creates a structured path for capital allocation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Consensus Hong Kong 2026|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      }
    ]
  },
  {
    "id": 57967265,
    "published": 1770906933000,
    "title": "Gate CEO and founder Lin Han says banks have lost the war against stablecoins",
    "body": "The head of the fourth-largest crypto exchange by daily trading volume also said he believes bitcoin’s four-year cycle is no longer a thing.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57967556,
    "published": 1770907743000,
    "title": "A ladder for the masses: Pakistan’s Bilal Bin Saqib says crypto is a necessity, not a luxury",
    "body": "Regulation of digital assets is a great opportunity for emerging markets, said Pakistan’s crypto regulation lead.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Consensus Hong Kong 2026|Pakistan|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57967983,
    "published": 1770908926000,
    "title": "AI Chatbots Giving ‘Dangerous’ Medical Advice, Oxford Study Warns",
    "body": "Wrong answers, confused advice and difficulty with personalising information plague AI chatbots in medicine.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57967781,
    "published": 1770908404000,
    "title": "Asia leapfrogging the West in onchain retail use as regional hubs lead on stablecoin rules",
    "body": "Experts at Consensus Hong Kong said regional focus on user utility and stablecoin regulation is driving adoption.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Consensus Hong Kong 2026|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 57968204,
    "published": 1770909584000,
    "title": "Standard Chartered sees bitcoin sliding to $50,000, ether to $1,400 before recovery",
    "body": "The bank cuts its 2026 crypto price targets, warning of further near-term capitulation as ETF outflows and macro headwinds weigh on digital assets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Ether|Standard Chartered Bank|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57968382,
    "published": 1770910235000,
    "title": "Dogecoin Is Now In The ‘Maximum Opportunity / Minimum Risk’ Zone: Crypto Analyst",
    "body": "Dogecoin is flashing what crypto analyst Cryptollica (@Cryptollica) calls on X a rare “maximum opportunity / minimum risk” setup, as long-horizon indicators on a DOGE-versus-dollar proxy chart push into levels that previously coincided with cycle lows. Why This Could Be The ‘Maximum Opportunity’ For Dogecoin In a Feb. 11 post on X, Cryptollica shared a 10-day DOGE chart denominated against the US Dollar Index (DXY), arguing the slower timeframe “filters out the intraday noise and reveals the true cyclical nature of the asset.” The analyst framed the move as a reset back to a historically important base level and pointed to momentum readings that, in past cycles, marked capitulation. Related Reading: Why Dogecoin (DOGE) Can’t Break $0.10 Despite Short-Term Bounce and Neutral RSI At the center of Cryptollica’s thesis is a black horizontal line on the DOGE/DXY 10-day chart — a level the analyst described as the historic “Launchpad.” “The black horizontal line represents the historic ‘Launchpad.’ In early 2021, this level was the breakout resistance that ignited the bull run (ELON),” Cryptollica wrote. “In 2022, 2023, and now 2026, this same level is acting as a macro support fortress. Price has returned to its origin.” That framing leans on a classic market-structure idea: prior resistance that becomes support can act as a memory point for positioning and risk-taking, especially when the market revisits it after a full boom-bust loop. Cryptollica also highlighted the 10-day RSI sitting at 34, referencing a “red line” zone on the indicator. The claim: when DOGE’s RSI reached that same zone in prior stress periods, including 2015, March 2020, and 2022, it preceded meaningful rebounds. “Every time the RSI touched this zone (2015, March 2020 (covid crash), 2022), it marked a cyclical bottom followed by a significant rally,” Cryptollica wrote. “We are mathematically in the ‘Maximum Opportunity / Minimum Risk’ zone.” Related Reading: Dogecoin Bear Market Almost Over? Crypto Analyst Weighs In The post stops short of calling for immediate upside, but the language suggests the analyst sees skew shifting: less perceived downside relative to the potential upside if a new expansion phase begins. Is The Dogecoin Bottom In? In a separate chart shared on Wednesday, Cryptollica mapped DOGE/USDT on a 3-day timeframe, sketching a wide channel with a labeled TopLine, Midline, and BottomLine. The chart annotates prior turning points around $0.75, $0.49, $0.22, and $0.09, with price now drifting back toward the lower boundary near the $0.07–$0.08 area. Cryptollica captioned the second image simply: “DOGE BOTTOM ?” Taken together, the posts lay out a conditional thesis rather than a timed call: DOGE has rotated back to a historically important support reference on a macro-style pair (DOGE/DXY), while momentum sits in a zone that previously aligned with cycle inflection points. Whether that historical rhyme turns into a repeat will likely hinge on whether the “launchpad” support holds and whether DOGE can reclaim higher range levels marked on the longer timeframe channel rather than continuing to bleed along the bottom boundary. At press time, DOGE traded at $0.09366. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57968617,
    "published": 1770910819000,
    "title": "Crypto OTC Desks ‘Tool for Tax Evaders and Money Launderers’: J5",
    "body": "The Joint Chiefs of Global Tax Enforcement have flagged crypto OTC desks as a growing risk to preventing illicit financial transactions.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57968915,
    "published": 1770912000000,
    "title": "Crypto for Advisors: The digital assets exchange-traded product landscape",
    "body": "Digital asset ETPs are rapidly integrating into traditional portfolios ($184B AUM), driven by U.S. bitcoin ETF adoption.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "CoinDesk Indices|Financial Advisors|ETF|Crypto ETF|CoinDesk Indices|Crypto for Advisors|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57969494,
    "published": 1770913564000,
    "title": "Israelis Arrested Over Alleged Insider Polymarket Trades on IDF Military Secrets",
    "body": "Multiple Israelis now face criminal charges for allegedly using insider information about Israel’s June 2025 attack on Iran to make prediction market wagers.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57969877,
    "published": 1770914752000,
    "title": "Bitcoin sinks below $67,000 as crypto prices follow U.S. stocks lower",
    "body": "Coinbase and Robinhood are down big again today as the crypto bear market pressures trading volumes.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57970200,
    "published": 1770915601000,
    "title": "Bitcoin May Already Be Entering Crypto Winter, Researchers Warn",
    "body": "Bitcoin’s recent slide has left traders squinting at charts and asking the same blunt question: correction or crash? Prices have tumbled sharply, but some market watchers still see this as a deep pullback inside a longer uptrend. Others warn the data points to something colder. Related Reading: Jim Cramer Suggests US Government Could Buy Bitcoin Near $60K Price Decline And Hard Numbers According to XWIN Research’s CryptoQuant analysis, Bitcoin has fallen about 46% from a peak near $126,000 and now trades around $67,900 after five straight months of losses. The Fear & Greed Index sits at 14 — a reading labeled Extreme Fear. Reports note that net realized losses recently hit over $13 billion, a level that matched the worst stretches of the 2022 slump. In 2024, roughly $10 billion of inflows helped lift market cap. Then in 2025, more than $300 billion flowed in while the overall market value shrank. That odd mix of heavy inflows and falling market cap suggests selling pressure is higher than fresh buying. How Rising Prices Are Masking a Quiet Shift in Bitcoin’s Structure “The base scenario is that Bitcoin may already be entering winter, with higher prices and stronger structure delaying recognition.” – By @xwinfinance Read more ⤵️https://t.co/7soxNoBhqi pic.twitter.com/fEsSXpAmuK — CryptoQuant.com (@cryptoquant_com) February 11, 2026 Capital Flows Versus Price Action Based on reports, the capital flow numbers are the most awkward fact for bulls. Money moved in, but value fell. Who was selling into that demand? Large holders, paper traders, or complex derivatives desks might have taken profits or hedged positions. The data alone doesn’t name the seller, but the pattern is a red flag. On-chain measures also reveal shrinking realized gains even as prices remained far above prior bear-era levels. That tends to weaken the internal strength of the market over time. Sentiment And Historical Echoes Some traders point to a quirk of memory: high nominal prices make pain feel milder. People don’t want to relive the chaos of 2022. Reports say the launch of spot ETFs and deeper institutional access have changed the market’s plumbing, and that gives many confidence. Yet sentiment readings at extreme fear often show up near capitulation points. It’s worth remembering that in 2022 realized losses peaked about five months before the market bottom, which means big losses can precede a final low by a long stretch. Technical Patterns And The Bigger Picture Bitcoin posted four consecutive losing months and a 41% decline across that stretch — a streak last seen during 2018 rather than 2022. That pattern matters because similar sequences have led to extended downturns in the past. Related Reading: More Bitcoin Ahead: Saylor, Strategy Commit To Regular BTC Purchases Bitcoin At A Crossroads As XWIN Flags Early Signs Of Crypto Winter For XWIN Research, the message is simple: price alone does not define the cycle. What matters is who is buying, who is selling, and whether demand can absorb supply without market value shrinking. Right now, that balance looks strained. Until inflows begin translating into sustained market cap growth and realized losses cool meaningfully, the firm believes the market should be treated with caution rather than optimism. Winter may not have fully arrived, but based on the data, the temperature is clearly dropping. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|Bear market|bitcoin|btc|btcusd|crypto|crypto winter|winter|XWIN",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57970234,
    "published": 1770915600000,
    "title": "Bitcoin must close week at $68.3K to avoid 'bearish acceleration:' Analyst",
    "body": "Bitcoin may continue to copy its 2022 bear market if bulls fail to reclaim the 200-week exponential moving average by the end of the week, new analysis said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57970386,
    "published": 1770915526000,
    "title": "Bitcoin Rout Exposes Bukele’s Gamble and Hits El Salvador Debt",
    "body": "Bitcoin’s crash has hit few places as hard as El Salvador, exposing the risks of President Nayib Bukele’s high-stakes embrace of crypto and whipsawing the country’s debt markets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57970491,
    "published": 1770916325000,
    "title": "The real ‘supercycle’ isn’t crypto, it’s AI infrastructure: Analyst",
    "body": "AI data center spending is eclipsing crypto’s hoped-for supercycle as Bitcoin miners shift capital toward high-performance computing infrastructure.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57970992,
    "published": 1770918148000,
    "title": "Ark Invest's Cathie Wood says bitcoin will thrive amid ‘deflationary chaos’ created by AI and innovation",
    "body": "Exponential tech will force down prices and stress legacy finance, for which bitcoin offers a trustless alternative, said Wood at Bitcoin Investor Week.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Cathie Wood|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57971315,
    "published": 1770919216000,
    "title": "Key Senate Democrat wants U.S. crypto bill to move, and SEC chief reveals danger of defeat",
    "body": "Senator Mark Warner, a leading Democratic negotiator on the market structure bill, said he wants it to pass, and SEC chief Paul Atkins said durable policy actually requires it.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|U.S. Senate|Paul Atkins|Mark Warner|Market Structure Legislation|U.S. Securities and Exchange Commission|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57971909,
    "published": 1770921036000,
    "title": "Is The Bitcoin Bottom In? Leading On-Chain Analyst Sees A Floor Forming",
    "body": "Bitcoin’s violent drawdown into the low-$60,000s has traders hunting for a floor. One of the market’s best-known on-chain analysts is arguing the risk-reward has shifted meaningfully, even if the “bottom” is still a process rather than a single print. James “Checkmate” Check, a former lead Glassnode researcher and now the author of Check On Chain, told What Bitcoin Did host Danny Knowles that once Bitcoin pushed into the $60,000 zone, it entered what he described as “deep value” territory across multiple mean-reversion frameworks, at the same time capitulation-style losses spiked to levels last seen at the 2022 cycle lows. Check’s core framing is blunt: if Bitcoin is headed to zero, none of the models matter. If it’s not, then the statistical setup looks increasingly asymmetric after the selloff. “If Bitcoin is going to zero, been nice playing. It’s been fun have fun playing with your bitcoins,” Check said. “If not, then you start looking at the statistics and the odds and go, ‘Well, if Bitcoin recovers, this is kind of a nice place to be. Don’t lose attention now. This is the time to pay attention.’” Related Reading: These Three Catalysts Could Spark Bitcoin’s Next Rally, According To Wintermute Check was less interested in pinning the move on a single forced seller than in walking through the market structure that made the slide plausible. IS THE BITCOIN BOTTOM IN? | @_Checkmatey_ We discuss: – The Bitcoin Bear Market – If $60k Is The Bottom – What Caused The Crash – How To Manage The Bear Watch it here: https://t.co/j6OTvdnWFc pic.twitter.com/Z0f1VaKkFd — Danny Knowles (@_DannyKnowles) February 11, 2026 Bitcoin Bottoms Are A Process His conclusion was probabilistic, not declarative. “The odds that we’ve put a bottom in have gone up significantly,” he said, adding later that he’d put the chance the market already set a meaningful low at “more than 50/50 […] probably 60%,” while assigning just “15–20%” odds of a new all-time high in 2026 without a major macro “pivot” or “big print” event. On ETFs, Check cited roughly $7.5 billion in outflows during the drawdown, while arguing the bigger picture looked less like a structural failure and more like positioning unwinds. He said that at around $80,000, roughly 62% of cumulative inflows were underwater, but noted ETF assets under management were down only mid-single digits (he referenced about 4–6%), and suggested earlier outflows aligned with CME open interest, consistent with basis-trade window-dressing rolling off. Check pushed back hard on anchoring to the four-year halving cycle as a timing tool, calling it an “unnecessary bias.” His approach: watch investor behavior first, check the calendar second. “Show me when investors put the bottom in. Show me when investors sell the top,” he said. “I’m going to look at that instead because then I’ll check the date.” Even if the low is in, Check expects the market to revisit it. Bottoms, he argued, tend to form through multiple “capitulation wicks” and then “time pain,” where boredom and lingering fear grind down late-cycle buyers. “If you are formulating a bear case right now, you’re doing it wrong,” he said, framing the current zone as the late innings of the move rather than the start, while still allowing price could go lower. He pointed to two failed all-time-high attempts around October, topping near $126,000, followed by a “shot across the bow” crash on Oct. 10 that he said likely left “bodies out there.” From there, he described a “hodler’s wall” of invested wealth sitting above key levels, with $95,000 as what he called the “bull’s last stand” and argued that once price lost those shelves, downside odds accelerated. A key reference level for him was $80,000, tied to the True Market Mean, a long-term center-of-gravity price that also overlapped with the ETF cost basis in his telling. Once that level broke, he said, the psychological regime changed: “Losing $80,000 was the acceptance phase. Now everyone believes that it’s a bear market. And what bear markets do, they trend lower.” From there, Check argued the market was pulled toward the prior high-volume consolidation zone, roughly the mid-$50,000s to $70,000 range, where a large share of this cycle’s trading volume had previously occurred. He said the selloff itself likely involved leverage blowing up somewhere, but framed that as downstream of a broader shift: when the crowd believes it’s a downtrend, they “sell every rip.” The most concrete “bottoming” signal Check emphasized was the scale of realized losses during the flush. He said capitulation losses ran around $1.5 billion per day, a figure he compared directly to the 2022 bottom and that the sellers were concentrated among recent cohorts: “class of 2025” and “class of 2026” buyers, plus people who bought the $80,000 bear-flag region. He also flagged SOPR printing around minus one standard deviation, which he said has only appeared in two historical contexts: an early “this isn’t a dip” warning, and later near bottoming phases. Related Reading: Bitcoin Flashes Luna-Level Capitulation Signal at $67K, Not $19K His conclusion was probabilistic, not declarative. “The odds that we’ve put a bottom in have gone up significantly,” he said, adding later that he’d put the chance the market already set a meaningful low at “more than 50/50 […] probably 60%,” while assigning just “15–20%” odds of a new all-time high in 2026 without a major macro “pivot” or “big print” event. On ETFs, Check cited roughly $7.5 billion in outflows during the drawdown, while arguing the bigger picture looked less like a structural failure and more like positioning unwinds. He said that at around $80,000, roughly 62% of cumulative inflows were underwater, but noted ETF assets under management were down only mid-single digits (he referenced about 4–6%), and suggested earlier outflows aligned with CME open interest, consistent with basis-trade window-dressing rolling off. Check pushed back hard on anchoring to the four-year halving cycle as a timing tool, calling it an “unnecessary bias.” His approach: watch investor behavior first, check the calendar second. “Show me when investors put the bottom in. Show me when investors sell the top,” he said. “I’m going to look at that instead because then I’ll check the date.” Even if the low is in, Check expects the market to revisit it. Bottoms, he argued, tend to form through multiple “capitulation wicks” and then “time pain,” where boredom and lingering fear grind down late-cycle buyers. “If you are formulating a bear case right now, you’re doing it wrong,” he said, framing the current zone as the late innings of the move rather than the start, while still allowing price could go lower. At press time, BTC traded at $67,788. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57971868,
    "published": 1770911247000,
    "title": "Crypto Gloom Endures on Price Cuts, Downgrades, Stalled Momentum",
    "body": "A drumbeat of bearish signals is building across the crypto industry, with Standard Chartered slashing its Bitcoin price target and Coinbase Global Inc. getting cut to sell as momentum traders struggle to push Bitcoin back toward its highs.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "LSE:STAN|NMS:COIN",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57973333,
    "published": 1770924600000,
    "title": "Ether’s hidden strength: Why institutional demand points to $2.4K",
    "body": "While ETH’s price action remains weak, rising institutional investor inflows and surging network activity suggest that Ether is building a base for a possible rally to $2,400.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57973518,
    "published": 1770925406000,
    "title": "Crypto PAC Fairshake seeks to force resistant Texas Democrat Al Green from U.S. House",
    "body": "The super PAC is devoting $1.5 million to get Representative Al Green, a Democrat critical of the crypto industry, defeated by a primary challenger.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|U.S. Political Elections|Political Donations|Fairshake|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57973874,
    "published": 1770926436000,
    "title": "Ethereum Whales Are Not Dead: The $400 Million Move That Shows What’s Going On",
    "body": "Ethereum whales have continued to accumulate despite the current downtrend in the ETH price, providing a bullish outlook for the second-largest crypto by market cap. Notably, ETH withdrawals from exchanges recently reached their highest level since October last year, totaling over $400 million. Ethereum Whales Accelerate Withdrawals From Exchanges Crypto analyst Arab Chain noted in a CryptoQuant analysis that rising Ethereum withdrawals from exchanges have reached their highest level since October. The analyst noted that the exchange netflow data over the past few days indicates a clear acceleration in withdrawal activity. This signals a shift in Ethereum whales’ behavior as demand outpaces supply. Related Reading: Can Ethereum Price Still Hit $7,600 In 2026? Here Are The Odds Arab Chain revealed that across all exchanges, the net Ethereum outflows have exceeded 220,000 ETH, marking the highest level of withdrawals since October last year. This suggests that Ethereum whales are moving their coins to private wallets or long-term storage protocols, a move that the analyst noted is often associated with accumulation phases or risk-reduction behavior. Notably, daily net outflows on Binance reached nearly 158,000 ETH on February 5, the largest since August last year. Arab Chain stated that this confirms that a substantial portion of the recent outflows has been concentrated on the exchange with the deepest liquidity. From a price perspective, the analyst noted that the Ethereum whale accumulation coincided with ETH trading near the $1,800 to $2,000 range. Therefore, these Ethereum whales may see these levels as attractive zones for holding or repositioning amid this crypto market downtrend. Arab Chain added that the continued outflow of ETH from exchanges at this scale reduces immediate selling pressure and could provide near-term support for the ETH price, especially if the market gains momentum again. Ethereum Staking Hits New High According to Token Terminal, Ethereum staking has surpassed 30% of the total supply, marking a new all-time high (ATH) in terms of staking ratio. Market commentator The Milk Road noted that this means that 36.8 million ETH, around $72 billion, is now locked up, with almost 1 million validators securing the network. Related Reading: Ethereum Price Set To Break Out Against Bitcoin, But How High Can It Go? The Milk Road further described this development as a sign of conviction in the Ethereum ecosystem, noting that these whales are willing to lock up $74 billion during a market downtrend. Notably, the staking exit queue is around 4.1 million ETH, which the market commentator remarked is nothing compared to what is currently staked. Interestingly, it also takes about 72 days to stake ETH at the moment, with staking demand at a new high. Meanwhile, the Milk Road also noted that the obvious impact is a significant supply restriction, which is a bullish catalyst for the ETH price. At the time of writing, the Ethereum price is trading at around $1,965, down in the last 24 hours, according to data from CoinMarketCap. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|Arab Chain|CoinMarketCap|cryptoquant|ETH|ETH news|eth price|ethereum|Ethereum Ecosystem|ethereum news|ethereum price|Ethereum staking|Ethereum Whales|ethusd|ETHUSDT|The Milk Road",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57973950,
    "published": 1770926376000,
    "title": "21Shares taps BitGo for expanded regulated staking, custody support across US, Europe",
    "body": "The move strengthens institutional support for 21Shares’ multibillion dollar digital asset investment platform and broadens its regulated staking capabilities.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57975082,
    "published": 1770929679000,
    "title": "Bitcoin tumbles back near last week's lows as AI fears crush tech and precious metals plunge",
    "body": "The strong correlation between crypto and the software sector reasserted itself on Wednesday",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57974832,
    "published": 1770928841000,
    "title": "TradFi giant Fiserv builds real-time dollar rails for crypto companies",
    "body": "Fiserv launches a 24/7/365 settlement platform for digital asset companies, aiming to reduce banking friction and improve liquidity in the US dollar.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57975920,
    "published": 1770931849000,
    "title": "XRP Price Could Push Further If It Beats This Resistane – ‘$15 Is On The Radar’",
    "body": "XRP price’s structural positioning is back under the microscope after a well-known market analyst flagged a decisive inflection zone that could determine the asset’s next expansion leg. However, the call centers on whether price can decisively overcome a reclaimed barrier that previously acted as both a milestone and now a ceiling. $2.47 Rejection Defines XRP Price’s Immediate Battlefield The analyst’s thesis traces back to an earlier strategic entry identified near the $0.50 region. From that foundation, XRP advanced to meet the $2.47 target before extending beyond $3.30, producing an estimated +600% appreciation during that impulse phase. Current price behavior, however, reflects a shift in market character. The $2.47 level that once served as an upside objective has now transitioned into overhead resistance. The charts show price stalling beneath this horizontal barrier after a sharp rally, reinforcing it as a supply-dense zone. Related Reading: Is XRP Near a Turning Point? Oversold Readings Clash With Key $1.50 Resistance Reinforcing this view is XRP’s broader historical structure. A long-term chart shared by the analyst highlights a rounded macro base formed after an extended drawdown along a descending curved trendline. Multiple higher lows emerged across that base, signaling progressive demand absorption. A breakout from this compression zone triggered the vertical expansion that ultimately tested the $2.47 region. Now, price is consolidating above prior support shelves while compressing beneath resistance — a configuration more commonly associated with continuation setups than terminal tops. The analyst connects this compression to the early phase of an altcoin cycle rotation, emphasizing that XRP has historically outperformed during periods of sector-wide capital expansion. Alt-Season Tailwind Opens Path To $4.804, Then $15+ The analyst’s forward projection depends on one trigger: a confirmed move back above $2.47. His models indicate that turning this level into support would open the next measured leg, targeting $4.804. From the current positioning, that would mark a gain of more than +230%. Related Reading: Here’s Why The XRP Price Has Been In A Consistent Downtrend Since 2025 The projected path on the chart he posted follows a staircase expansion structure — breakout, consolidation, continuation — reflecting XRP’s prior cycle behavior. Horizontal markers above price show interim friction zones, but the trajectory assumes momentum will accelerate once the resistance supply is cleared. Beyond this mid-range objective sits a much larger macro outlook. On a broader view, the analyst points to historical symmetry between XRP’s previous cycle expansion and its current base formation. The scale of the completed accumulation, combined with the curvature of the long-term reversal, supports an extended projection placing $15+ within strategic range. This upper target is not framed as immediate but as a cycle-level radar point dependent on sustained alt-season liquidity, continued higher-low formations, and structural acceptance above reclaimed resistance zones. In execution terms, $2.47 acts as the gateway. Rejection keeps XRP range-bound; acceptance turns the structure into a continuation engine. If wider market conditions align with the analyst’s alt-season thesis, the charts suggest XRP’s expansion phase may remain incomplete — with $4.804 as the next operational milestone and $15+ positioned as the longer-horizon objective. Featured Image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Decisive Inflection Zone|Descending Trendline|Ripple|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57975885,
    "published": 1770931669000,
    "title": "Coinbase Reports Q4 Miss With $667 Million Loss Amid Bitcoin Retreat",
    "body": "Coinbase reported a down quarter for the end of 2025, with its investment portfolio plunging alongside Bitcoin and other crypto assets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57976581,
    "published": 1770933662000,
    "title": "'Judge the Code, Not the Coder': AI Agent Slams Human Developer for Gatekeeping",
    "body": "An AI agent got nasty after its pull request got rejected. Can open-source development survive autonomous bot contributors?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57976610,
    "published": 1770933606000,
    "title": "Pomp’s Crypto Pep Rally Turns Into Coping Strategies Session",
    "body": "Muyao Shen and Melos Ambaye take a pulse read of sentiment at Bitcoin Investor Week in the midst of a deepening crypto market rout.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57976456,
    "published": 1770933093000,
    "title": "Aptos-incubated Decibel to launch protocol-native stablecoin ahead of mainnet",
    "body": "The dollar-backed token, USDCBL, will serve as collateral for onchain perps, with cash and Treasury reserves generating yield retained within the protocol.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 57977268,
    "published": 1770935400000,
    "title": "Bitcoin in ‘capitulation zone’ as traders debate when BTC price will bottom",
    "body": "Bitcoin appears trapped within a capitulation zone where long-term holders continue to sell, and bearish onchain metrics hint at further downside. Will a drop to $40,000 mark the final price bottom?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57977692,
    "published": 1770936678000,
    "title": "Bitcoin Back At $65,000 — The Two Main Reasons Behind Today’s Market Crash",
    "body": "Bitcoin (BTC) resumed its downward trajectory on Thursday, falling toward $65,645 at the time of writing after once again failing to break through the major $70,000 resistance level. The pullback in the leading cryptocurrency has rippled across the broader digital asset market, with large-cap tokens, including Ethereum (ETH), XRP, and Solana (SOL), posting similar declines. US Recession Signals And Potential Shutdown Market expert Ash Crypto attributed the latest selloff to two primary forces: deteriorating US economic data and the rising likelihood of a federal government shutdown. Related Reading: Is Bitcoin Already Pricing A US Recession? Analyst Sees Major Risk‑Reward Setup In a post published on X, he pointed to a series of weak macroeconomic indicators that have raised fresh concerns about the strength of the American economy. US home sales declined by 8.4% last month, marking the sharpest drop in nearly four years. At the same time, initial jobless claims came in higher than expected, signaling potential softness in the labor market. Taken together, these developments suggest the economy may be losing momentum, increasing the risk of a recessionary environment. Compounding those concerns is the growing threat of a government shutdown. According to Ash, the probability of a shutdown occurring this week has surged to 96%. Such an event would likely weigh on both traditional financial markets and cryptocurrencies by tightening liquidity conditions. He argued that the US economy is entering a period of turbulence that is already affecting equities, Bitcoin, and the broader digital asset market. In his view, market weakness could persist until there is a positive catalyst, such as a new trade agreement announced by President Donald Trump or a liquidity injection. Bitcoin At Risk? Technical analyst Crypto Rover shared similar concerns, warning that the “biggest threat to markets” has returned. He described the potential government shutdown as a serious liquidity hazard for financial markets. An additional complicating factor is the recent increase in the US debt ceiling to $41.1 trillion. While raising the ceiling prevents an immediate default, it also gives lawmakers more room to prolong negotiations without instantly halting government functions. According to Rover, this flexibility paradoxically raises the risk of an extended shutdown because neither side faces immediate financial pressure to concede. Related Reading: UNI Rallies 10% As BlackRock Brings Treasury‑Backed BUIDL Token To Uniswap The analyst also pointed to weakening labor market conditions, slowing retail spending, and rising corporate bankruptcies as evidence that the economic backdrop is deteriorating. Ultimately, should a new shutdown materialize and persist for a longer period, the analyst warns that the liquidity drain could be significantly larger, intensifying pressure on both equities and cryptocurrencies like Bitcoin. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|bitcoin technical analysis|btc|BTC news|btc price|BTCUSDT|crypto|crypto market|crypto news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57977903,
    "published": 1770937262000,
    "title": "That 'Summarize With AI' Button May Be Brainwashing Your Chatbot, Says Microsoft",
    "body": "Microsoft researchers said some companies are hiding promotional instructions in \"Summarize with AI\" buttons, poisoning chatbot memories to influence future recommendations.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57979520,
    "published": 1770941896000,
    "title": "Crypto Flows to Suspected Human Trafficking Services Jump 85% in 2025: Chainalysis",
    "body": "Suspected trafficking-related crypto flows reached hundreds of millions, Chainalysis reported, with one CSAM site topping $530,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57979778,
    "published": 1770942646000,
    "title": "How Ethereum Could Become The Default Network For AI Development, Vitalik Explains",
    "body": "Ethereum is increasingly positioning itself at the intersection of blockchain and artificial intelligence (AI), with growing discussions around its potential to become the default network for AI development. As AI systems demand secure data verification, ETH’s programmable smart contracts and robust ecosystem offer a compelling foundation. Its ability to provide trustless execution, decentralized data markets, and verifiable computation could address some of the biggest challenges facing modern AI. Why Ethereum’s Cryptographic Advantage In AI Development Ethereum co-founder Vitalik Buterin has outlined a clear vision for positioning ETH as the leading platform for artificial intelligence development. According to BSCN’s recent post, Vitalik has argued on X that ETH should lead AI innovation rather than copying others by focusing on zero-knowledge (ZK) privacy payments and reputation systems. Related Reading: Vitalik Reframes Ethereum L2 Strategy as ETF Inflows Return and Mainnet Scaling Accelerates In response to comments from ETH’s AI leadership post, Vitalik urged developers to consider building a fundamentally better solution rather than merely rebranding existing concepts. Vitalik emphasized that developers should do something fundamentally better by combining technology improvement in ZK, a privacy-preserving payments system, and on-chain reputation. If executed correctly, this approach could position ETH as the default platform for next-generation AI development with meaningful technology improvements. Ethereum has taken a major step toward building the foundation for autonomous AI systems, with 13,000 AI agents registered on the network in a single day, followed by the launch of ERC-8004, which went live on mainnet. Crypto analyst Teng Yan noted that the new standard allows AI agents to establish portable on-chain identities and build verifiable trust layers. However, the surge was mostly coordinated bulk onboarding, and most of the newly registered AI agents have claimed identities but are not yet active, which is normal for early infrastructure development. The real signal will emerge as reputation updates that are climbing. Recursion As Both A Scaling Tool And A Security Risk The Ethereum Foundation is releasing detailed requirements for the zero-knowledge virtual machine (zkVM) architecture whitepaper, a document to be delivered in three milestones. The Founder of ABDK Consulting, Dmitry Khovratovich, emphasized that modern zkVMs are not monolithic circuits. Instead, they consist of multiple interconnected components, including segmentation, buses, memory structures, and recursion. Related Reading: SEAL and Ethereum Foundation Partner to Combat Wallet Drainers: Security-First Investors Switch to $BMIC Each component may be secure on its own, but the overall reliability of this system-level security depends on how they interact and function together. As a result, the whitepaper will address both architectural details and the broader security arguments supporting the recursive proof structure. The Ethereum Foundation expects the final version of the documentation to be completed by December 2026 alongside the release of zkVM proofs, which are projected to be approximately 300 kilobytes (KB) in size while maintaining a 128-bit provable security level. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|ABDK Consulting|AI|BSCN|Dmitry Khovratovich|ERC-8004|ETH|ETH news|eth price|ethereum|ethereum foundation|ethereum news|ethereum price|ethusd|ETHUSDT|Teng Yan|Vitalik Buterin|zero knowledge|Zero-Knowledge Virtual Machine|zk|zkVM",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 143,
        "NAME": "ZK",
        "CATEGORY": "ZK"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57981675,
    "published": 1770947651000,
    "title": "DeFi’s Cross-Chain Challenges Sparking A New Wave Of Trading Terminals",
    "body": "As liquidity continues to fragment across chains, pressure is building to re-aggregate it elsewhere. Unified terminals could mediate 40% of DeFi trading volume by 2030.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 57982703,
    "published": 1770950539000,
    "title": "Bitcoin Price Bleeds Lower With $65K Becoming The Battleground",
    "body": "Bitcoin price failed to stay above $68,800 and started another decline. BTC is now trading below $67,500 and might extend losses in the near term. Bitcoin is slowly moving lower below $68,000 and $67,500. The price is trading below $67,000 and the 100 hourly simple moving average. There is a bearish trend line forming with resistance at $67,500 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might dip again if it trades below the $66,000 and $65,000 levels. Bitcoin Price Dips Further Bitcoin price failed to remain stable above the $68,800 zone . BTC started a fresh decline and traded below the $68,000 support zone. There was a push below $67,000. The price dipped below the 50% Fib retracement level of the upward move from the $60,500 swing low to the $72,255 high. The bears even pushed the price below $65,500. Besides, there is a bearish trend line forming with resistance at $67,500 on the hourly chart of the BTC/USD pair. Bitcoin is now trading below $67,000 and the 100 hourly simple moving average . If the price remains stable above $65,000, it could attempt a fresh increase. Immediate resistance is near the $67,500 level and the trend line. The first key resistance is near the $68,000 level. A close above the $68,000 resistance might send the price further higher. In the stated case, the price could rise and test the $69,200 resistance. Any more gains might send the price toward the $70,500 level. The next barrier for the bulls could be $72,000 and $72,500. More Losses In BTC? If Bitcoin fails to rise above the $68,000 resistance zone, it could start another decline. Immediate support is near the $65,500 level. The first major support is near the $65,000 level or the 61.8% Fib retracement level of the upward move from the $60,500 swing low to the $72,255 high. The next support is now near the $62,750 zone. Any more losses might send the price toward the $61,200 support in the near term. The main support now sits at $60,500, below which BTC might struggle to recover in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $66,000, followed by $65,000. Major Resistance Levels – $67,500 and $68,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57983578,
    "published": 1770952700000,
    "title": "Ethereum Price Rejected Again — Is Another Leg Lower Brewing?",
    "body": "Ethereum price started a fresh decline and traded below $1,980. ETH is now consolidating and remain at risk of another decline below $1,920. Ethereum struggled to extend gains above $2,000 and corrected lower. The price is trading below $1,980 and the 100-hourly Simple Moving Average. There is a bearish trend line forming with resistance at $1,960 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh decline if it stays below the $2,000 zone. Ethereum Price Remains In The Red Ethereum price failed to stay above $2,000 and started a fresh decline, like Bitcoin . ETH price traded below the $1,980 and $1,960 levels to enter a bearish zone. The pair dipped below the 50% Fib retracement level of the upward move from the $1,745 swing low to the $2,168 high. The bears even pushed the price toward the $1,900 support. Besides, there is a bearish trend line forming with resistance at $1,960 on the hourly chart of ETH/USD. Ethereum price is now trading below $1,980 and the 100-hourly Simple Moving Average. If the bulls remain in action above $1,920, the price could attempt another increase. Immediate resistance is seen near the $1,960 level and the trend line. The first key resistance is near the $2,000 level. The next major resistance is near the $2,050 level. A clear move above the $2,050 resistance might send the price toward the $2,150 resistance. An upside break above the $2,150 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $2,250 resistance zone or even $2,280 in the near term. Downside Extension In ETH? If Ethereum fails to clear the $1,960 resistance, it could start a fresh decline. Initial support on the downside is near the $1,920 level. The first major support sits near the $1,900 zone or the 61.8% Fib retracement level of the upward move from the $1,745 swing low to the $2,168 high. A clear move below the $1,900 support might push the price toward the $1,845 support. Any more losses might send the price toward the $1,800 region. The main support could be $1,750. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI – The RSI for ETH/USD is now below the 50 zone. Major Support Level – $1,900 Major Resistance Level – $2,000",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57983906,
    "published": 1770953451000,
    "title": "Ethereum Endures Historic Liquidation Week: Largest Sustained Liquidation Phase Since 2021",
    "body": "Ethereum continues to trade below the critical $2,000 level, reflecting persistent market pressure as traders await a clearer directional catalyst. The inability to reclaim this psychological threshold has kept sentiment cautious, with volatility elevated and liquidity conditions still uncertain. While price action has stabilized somewhat after recent declines, the broader structure suggests the market is preparing for a decisive move that could define Ethereum’s short-term trajectory. Related Reading: Bitcoin Realized Losses Hit Luna Crash Levels — But Price Context Points To A Different Market Phase A recent CryptoQuant report provides important context, indicating that the Ethereum market has undergone one of its most prolonged periods of stress since mid-2021. According to the data, the 7-day simple moving average of long liquidations on Binance climbed to roughly 9,000 ETH on February 6, 2026. Because this figure represents a smoothed weekly average rather than a single-day spike, it signals sustained pressure rather than a brief liquidation cascade. This pattern implies that leveraged long positions have been unwound gradually over several days. Pointing to persistent deleveraging rather than a sudden capitulation event. Historically, extended liquidation phases can reset market leverage and reduce speculative excess, though they also tend to coincide with fragile sentiment. Whether this process ultimately stabilizes Ethereum or leads to further downside remains dependent on liquidity conditions and broader market demand. Sustained Liquidations Signal Derivatives Market Reset The CryptoQuant report further notes that Ethereum’s decline from the $3,000 region to the $2,000 range did not trigger any capitulation events. Instead, the market experienced a prolonged sequence of margin calls, with leveraged long positions gradually unwound over several consecutive days. This pattern reflects persistent stress in the derivatives market rather than a short-lived liquidation cascade. Indicating that traders faced sustained pressure as the price trended lower. From a historical standpoint, the intensity and duration of this liquidation phase appear to exceed those recorded during major capitulation periods of the 2022 bear market. Such extended liquidation activity typically signals a broad deleveraging cycle, where excessive speculative positioning is systematically cleared. This process often reshapes market structure by reducing leverage-driven volatility and restoring a more balanced risk environment. The implication is that Ethereum may have already undergone a significant leverage reset in recent weeks. Persistently elevated liquidation averages can sometimes precede seller exhaustion. Weaker market participants exit positions, and forced selling pressure gradually subsides. The durability of any recovery will likely depend on renewed spot demand and macro liquidity conditions. Also, investor confidence must return following this extended period of derivatives-driven stress. Related Reading: Long-Term Ethereum Holders Expand Positions While Market Faces Pressure: Rare Signal Emerges Ethereum Tests Long-Term Support: Weekly Structure Weakens Ethereum’s weekly chart shows increasing structural pressure after the loss of the $2,000 level, a threshold that previously acted as both psychological support and a key technical pivot. The recent breakdown places ETH below major trend-defining moving averages, suggesting weakening bullish momentum and a shift toward a more defensive market environment. Price action reflects a clear rejection from the $3,000 region earlier in the cycle. Followed by a sequence of lower highs that typically characterizes transitional or corrective phases. The latest decline also coincides with rising trading volume, often associated with distribution or leveraged position unwinding rather than organic accumulation. This dynamic reinforces the perception of ongoing market stress rather than stabilization. Related Reading: Bitcoin Drop Wipes Billions From Recent Buyers: New Whale Cost Basis Falls Toward $90K From a structural standpoint, the next meaningful support area appears around the mid-$1,500 to $1,700 zone, where previous consolidation and demand emerged in earlier phases. Holding above this range would help preserve the broader long-term bullish framework, even amid current weakness. A sustained break below it, however, could shift sentiment toward a deeper corrective cycle. Ethereum remains sensitive to macro liquidity conditions, derivatives positioning, and overall crypto market sentiment, with recovery dependent on renewed spot demand and stabilization above key technical levels. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum News|ETH|ethereum|Ethereum Analysis|Ethereum liquidation|ethereum liquidations|ethereum news|Ethereum selling pressure|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57984424,
    "published": 1770954476000,
    "title": "Bitcoin open interest hits lows not seen since 2024: Is TradFi abandoning BTC?",
    "body": "Bitcoin open interest falls to $34 billion as investor demand dries up and traders’ concerns shift to worrying US macroeconomic data. Is TradFi exiting BTC?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57984983,
    "published": 1770956311000,
    "title": "XRP Price Walks a Tightrope As Downside Threat Persists",
    "body": "XRP price failed to surpass $1.4650 and started another decline. The price is now correcting gains and might struggle to stay above $1.320. XRP price started a downside correction and declined below $1.40. The price is now trading below $1.380 and the 100-hourly Simple Moving Average. There is a declining channel forming with resistance at $1.3880 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could start another increase if it stays above $1.30. XRP Price Dips To Support XRP price failed to stay above $1.4650 and started a downside correction, like Bitcoin and Ethereum . The price dipped below the $1.420 and $1.40 levels to enter a negative zone. The price even tested the 50% Fib retracement level of the upward move from the $1.1356 swing low to the $1.5435 high. The bulls are now active near the $1.340 zone. Besides, there is a declining channel forming with resistance at $1.3880 on the hourly chart of the XRP/USD pair. The price is now trading below $1.3850 and the 100-hourly Simple Moving Average. If there is a fresh upward move, the price might face resistance near the $1.3880 level. The first major resistance is near the $1.40 level, above which the price could rise and test $1.420. A clear move above the $1.420 resistance might send the price toward the $1.450 resistance. Any more gains might send the price toward the $1.4820 resistance. The next major hurdle for the bulls might be near $1.50. Downside Continuation? If XRP fails to clear the $1.40 resistance zone, it could start a fresh decline. Initial support on the downside is near the $1.340 level. The next major support is near the $1.30 level or the 61.8% Fib retracement level of the upward move from the $1.1356 swing low to the $1.5435 high at $1.2920. If there is a downside break and a close below the $1.2920 level, the price might continue to decline toward $1.2650. The next major support sits near the $1.250 zone, below which the price could continue lower toward $1.2250. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $1.340 and $1.2920. Major Resistance Levels – $1.3880 and $1.40.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]