[
  {
    "id": 55724323,
    "published": 1765616425000,
    "title": "Solana’s Long-Awaited Firedancer Launch Sparks 5% Rally",
    "body": "Solana’s network took a notable step this week as Firedancer, a validator client developed by Jump Crypto, began running on the mainnet, and markets reacted quickly. Related Reading: Is Dogecoin Waking Up? Critical On-Chain Metric Explodes Higher According to Solana’s announcement, the client moved out of a controlled testing phase and is now active for real-world validation. Traders pushed SOL up about 5%, with the token trading close to $140 during the initial move. Firedancer Goes Live On Mainnet During more than 100 days of controlled tests, a small set of validators produced more than 50,000 blocks without downtime, according to reports. Built in C and C++, Firedancer was made to handle heavy workloads and to lower the chance of network interruptions. Test environments reportedly showed the client processing over 1 million transactions per second, a figure that far exceeds current mainnet throughput. BREAKING: After 3 years of development, Firedancer is now live on Solana Mainnet, and has been running on a handful of validators for 100 days, successfully producing 50,000 blocks 🔥💃 pic.twitter.com/Y0WxxEj2WL — Solana (@solana) December 12, 2025 That high number comes from lab-style tests, not live traffic, and should be read as experimental performance rather than everyday capability. Solana co-founder Anatoly Yakovenko marked the transition as a step out of a long beta cycle for the network. Early Adoption And Stake Adoption is still small in terms of stake. The first Firedancer nodes hold under one percent of total staked SOL, and that share is expected to grow as operators add it to their setups. Reports have disclosed that a December rollout prompted more than 20% of validators to move from earlier experimental clients, showing a rapid shift among some operators. Running multiple validator clients reduces dependence on a single software implementation. If one client encounters a bug, others can keep block production running. That diversity mirrors how other large proof-of-stake chains operate. Why This Matters For Validators And Apps Validators and developers stand to benefit if Firedancer keeps meeting its goals. Faster or more reliable validation could mean more capacity for apps that need many transactions per second. For node operators, the option to mix clients offers an added safety net. Still, the network’s real-world load will be the true test, and watchers say they will be looking at uptime and performance over the coming weeks. Related Reading: Do Kwon Falls Hard — Terraform Labs Chief Gets 15 Years For Wire Fraud Market Moves And Technical Signals The announcement coincided with a clear market flow into SOL. Reports have disclosed $11 million in inflows to Solana ETFs on the day of the news, while Bitcoin saw outflows of $77.30 million and Ethereum $42.35 million. Featured image from Phantom, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoin|crypto|Firedancer|Sol|Solana|SOLUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 34,
        "NAME": "LUNA",
        "CATEGORY": "LUNA"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55728184,
    "published": 1765623638000,
    "title": "XRP Price To Reach $27: The Technical Formation That Paints 1,300% Surge",
    "body": "Crypto analyst Egrag Crypto has again predicted that the XRP price could reach $27. This time around, he outlined the technical formation that could spark a parabolic surge for the altcoin as it eyes the $27 target. How The XRP Price Could Reach $27 In an X post, Egrag Crypto stated that the Linear Regression targets for the XRP price are $3.4, $10, and $27. He further explained that, as of this month, these three major price levels stand out based on the long-term Logarithmic Linear Regression Channel. The analyst then touched on each price target and how XRP could reach there. Related Reading: XRP Price Needs To Hold This Macro Support For Hope Of Revival Egrag Crypto described the $3.40 target for the XRP price as the mean reversion. He stated that a retest and rejection from $3.40 would be one of the strongest bearish TA signals for the altcoin. The analyst further remarked that this target is based solely on chart structure, not fundamentals. He added that a close above this level means that XRP is officially back in macro bullish territory. Furthermore, the analyst stated that the $10 target for the XRP price is the upper midline. He explained that this is where full bull expansion normally accelerates and that the target rises with time because this channel is logarithmic. Lastly, Egrag Crypto highlighted $27 as the top of the channel. He noted that multiple long-term confluences point to this target for the altcoin. Notably, this XRP price prediction comes amid several bullish fundamentals for the altcoin. Ripple was just granted a conditional approval for its national trust bank charter, which could boost XRP’s adoption. XRP also just expanded to Solana with Hex Trust’s launch of its wrapped XRP token for DeFi purposes. Meanwhile, Swiss bank AMINA Bank has integrated Ripple payments, which utilize XRP. The Major Levels To Watch Haven’t Changed Crypto analyst CasiTrades stated that the major levels for the XRP price haven’t changed. The macro supports are $2.03 and $1.64. On the other hand, the macro resistance is $2.41, which a break above would confirm a bullish scenario for the altcoin. The analyst remarked that if a break above $2.41 happens, the next measured targets stand around $2.75 and $2.90. Related Reading: Analyst Predicts XRP Price Will Rise To $14 By Frontrunning Bitcoin By Over 600% However, if the XRP price breaks below the macro support at $2.03, CasiTrades predicts that the altcoin could fall below $1.97 and decline towards the $1.64 major support. She reiterated that there is no official confirmation yet on the next potential move for XRP. Interestingly, the world’s largest IQ holder, YoungHoon Kim, stated that XRP has a strong possibility of reaching a new ATH by the end of this year. At the time of writing, the XRP price is trading at around $2.01, down in the last 24 hours, according to data from CoinMarketCap. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|altcoin|AMINA Bank|CasiTrades|CoinMarketCap|DeFi|Egrag Crypto|Logarithmic Linear Regression Channel|Ripple|xrp|xrp news|XRP Price|XRPUSD|xrpusdt|YoungHoon Kim",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55730074,
    "published": 1765627228000,
    "title": "Bitcoin Bearish Signals Are ‘Hard To Ignore’: Analyst Warns Of Drop To April Lows",
    "body": "As Bitcoin (BTC) tries to hold the $90,000 barrier, some analysts affirm that the flagship crypto’s bear market signals are becoming clearer, suggesting that a breakdown to new lows could be around the corner. Related Reading: Dogecoin Could Stage A 600% Rally In 2026 If This Multi-Year Support Holds Bitcoin Bear Flag Raises Concerns On Friday, Bitcoin shredded its Thursday gains, dropping 3.2% intraday to retest the $89,500-$90,500 support zone once again. The cryptocurrency has been trading between the $84,500-$94,500 range for the past four weeks, briefly falling to a seven-month low of $80,600 during the late November correction. This week, the flagship crypto’s price has seen more volatility, fueled by the expectations of the Federal Reserve’s interest rate cut and positive regulatory developments in the US. However, BTC has failed to successfully break and hold above its local range’s upper boundary after multiple retests, ultimately falling to the mid-zone of its range. Analyst Ted Pillows highlighted a concerning pattern on Bitcoin’s chart, warning that the cryptocurrency risks a drop to new multi-month lows if the price fails to hold key support levels. Per the post, BTC has been forming a bear flag for nearly a month, which “is too hard to ignore” after the price continues to be rejected from the formation’s upper boundary. The analyst affirmed that this pattern follows a trend that has been developing over the past two months. As he pointed out, bearish flags have been continuously forming on BTC’s chart since the October 10 market pullback, with each pattern resolving in a breakdown to lower levels. To Ted, the new formation signals “that the overall trend is still to the downside.” He suggested that a close above the $96,000 level would invalidate the bearish pattern. On the contrary, a drop to below the $86,000 support, where the formation’s lower boundary is located, could push Bitcoin to the April lows, around the $76,000 mark. Is The 2022 Playbook Repeating? The market observer also noted a resemblance between the last cycle and the current one, which could lead to a drop below the $70,000 level. The chart shows that after losing the 50-Week EMA indications, Bitcoin consolidated within a bear flag before breaking down and descending to the 2022 lows. Now, BTC displays a similar performance after losing the 50-Week EMA and breaking down from its October bear flag. “If this plays out, a pump to $100,000 and then a dump below $70,000” would follow, the analyst added. Meanwhile, Robert Mercer shared a similar perspective in a series of X posts. The analyst affirmed that the classic four-year cycle has not changed despite the significant increase in institutional adoption: Bitcoin is breaking crucial supports one by one and entering a bear market. The same happened back in the end of 2021. At the moment, BTC is forming an ascending channel with the top near $100,000 – $104,000, you can see a clear Right Shoulder of H&S in this move. Something similar happened in the beginning of 2022. He also asserted that Bitcoin shows a similar picture “from the 1W MA50 perspective,” as BTC has traded below this indicator for multiple weeks now for the first time in the bullish cycle. Related Reading: Cathie Wood Says Bitcoin Is ‘Climbing Another Wall Of Worry’– Here’s Why Nonetheless, he concluded that “no such breakdown happens without a retest,” forecasting a relief bounce up to $98,000-$102,000, followed by a dump to the support level of $55,000-$60,000. As of this writing, BTC Trades at $89,990, a 2.75% decline in the daily timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|bitcoin analysys|bitcoin bear market|Bitcoin volatility|btc|btc prediction|BTCUSDT|crypto analyst|Crypto Bull Run 2025|crypto market correction|crypto market volatility|Crypto trader",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55731874,
    "published": 1765630800000,
    "title": "Crypto’s Machine Learning ‘iPhone Moment’ Comes Closer as AI Agents Trade the Market",
    "body": "Recall Labs, a firm that has run 20 or so AI trading arenas, pitted foundational large language models (LLMs) against customized trading agents.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|CoinDesk Wealth|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 55733609,
    "published": 1765634400000,
    "title": "Bank of Japan Set to Hike Rates to 30-Year High, Posing Another Threat to Bitcoin",
    "body": "Rising Japanese rates and a stronger yen threaten carry trades and could pressure crypto markets despite easing U.S. policy.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Bank of Japan|Interest Rates|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55735249,
    "published": 1765638014000,
    "title": "Bitcoin Bullish Structure Weakens As Inter-Exchange Liquidity Touches Red Zone – Details",
    "body": "The Bitcoin market is experiencing a gradual trend reversal following weeks of prolonged price correction between October and November. However, recent on-chain data reveals a concerning trend around BTC’s bullish structure. Related Reading: Here’s Why Bitcoin’s Reaction To Fed Policy Turns Bearish After Each FOMC Update Bitcoin IFP Indicator Suggests Market Has Reached Turning Point Popular analytics page Arab Chain has shared a cautionary insight on the Bitcoin market despite the moderate price recovery in recent weeks. After Bitcoin suffered a 36.5% correction from its all-time high at $126,000, the market leader has lately experienced a significant rebound, rising from $80,000 to as high as $94,000 in the past three weeks. However, data from the Bitcoin Inter-Exchange Flow Pulse (IFP) suggests the upward price momentum might be short-lived. For perspective, the Bitcoin IFP measures the net movement of Bitcoin between exchanges over a given period. Arab Chain explains the IFP indicator continues to trend downward, after breaking below its 90-day moving average (MA), suggesting a weakening market participation amid fewer “bullish” flows between exchanges. Furthermore, the IFP also sits in the red zone, which historically coincides with or precedes a correction period or weak structural momentum that could precede a broader downtrend. Combined, these developments imply the Bitcoin market is at a critical junction, as there is a reduction in exchange flows that has historically supported the price rallies in past market phases. Related Reading: Fed Cut Lights The Fuse: Bitcoin Rebounds And Bulls Predict More Upside Is The Bullish Run Over? Amidst the structural weakness highlighted by the IFP indicator, Arab Chain also noted that the price remains relatively high compared to previous levels in similar situations. The analysts explain that this suggests price and inflows are temporarily moving irrespective of each other. Based on historical data, such detachments usually indicate a prolonged price consolidation or a significant period of extended sideways movement until inter-exchange flows can reestablish market dominance. Therefore, the Bitcoin bullish structure is not collapsing into a bearish state. However, the IFP metric developments suggest there may not be sustained upward movement in the short term due to the structural slowdown in inter-exchange flows. Moreover, price is likely to become sensitive to changes in the market liquidity. Therefore, there is also significant potential for another correction. At press time, Bitcoin trades at $90,338, reflecting a 1.82% decline in the past 24 hours. Meanwhile, daily trading volume is up by 34.64% and valued at $82.68 billion. According to Arab Chain, a continuous price rebound will only occur if the IFP successfully reclaims its 90-day MA, thereby signaling an increase in bullish exchange flows. Featured image from Pexels, chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Aave|Bitcoin|Arab Chain|bitcoin|BTCUSDT|cryptoquant|inter-exchange flow pulse",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55736474,
    "published": 1765640544000,
    "title": "Brazil’s Largest Asset Manager Recommends Investors Put Up to 3% of their Money in Bitcoin to Hedge Against FX, Market Shocks",
    "body": "The recommendation is in line with other global asset managers like BlackRock and Bank of America suggesting small portfolio allocations to the largest cryptocurrency.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Brazil|Asset Management|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55737232,
    "published": 1765642235000,
    "title": "NFT Project Pudgy Penguins Takes Over Las Vegas Sphere in Holiday Campaign",
    "body": "The NFT brand’s animated segments will air on the Sphere across Christmas week, signaling the crypto company's move into real-world consumer markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|NFTs|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55738658,
    "published": 1765645243000,
    "title": "If This Ethereum Bear Flag Pattern Holds, ETH Price Could Be On Its Way To $2,400",
    "body": "Since early October, when the Ethereum price began its dive into bearish territory, it has struggled to regain any of its significant price levels. The Ether token failed to hold at multiple support zones throughout November, as it plunged downwards. While Ethereum appears to be gaining bullish momentum to signal an imminent price reversal, a bearish continuation looks like the more probable scenario after the latest decline to $3,000. A popular analyst has recently put forward a prognosis, which paints a worrying picture for the second-largest cryptocurrency. $2,400 Might Be The Next Price Cushion For ETH In a December 13 post on the social media platform X, market analyst Ali Martinez highlighted that the Ethereum price is showing an interesting sign of a potential bearish continuation over the coming weeks. Martinez’s analysis hinged on the bear flag pattern, a technical analysis pattern that is often used to confirm the continuation of a downtrend. Related Reading: Dogecoin Tightens Up: Symmetrical Triangle Converges With High-Timeframe Wyckoff Setup Typically, the pattern has two components — the flag and the flag pole. Price initially displays a sharp downward move, forming the flagpole. Afterwards, there is usually a brief period where the price displays upward movement or even sideways consolidation; this period of choppy price action makes up ‘the flag.’ What gives the flag its integrity is its upper and lower boundaries, which serve as resistance and support zones. Because breakouts beneath support zones typically indicate that the market could be bearish, a failure of the flag’s support would then be the needed confirmation of the earlier-seen sell signal. In the scenario where this happens, the crypto pundit pointed out that Ethereum’s possible target could be the $2,400 price level. This is likely the case because all preceding regions may present with insufficient liquidity to sponsor any significant price reversal. Ethereum Whales’ Realized Price Of $2,400 Comes In Sight — What To Expect Interestingly, on-chain data adds credence to $2,400’s reputation as a relevant price level. In a Quicktake post on the CryptoQuant platform, a pseudonymous pundit, OnChain, revealed that Ethereum is currently happens to be trading very close to a significant price level. According to the analyst, Ethereum whales — with holdings of at least 100,000 ETH — mostly procured their coins close to $2,400. Interestingly, the Ether token barely ever falls to price levels close to the realized price of this group of investors. Since the last five years, there have only been four instances where the ETH price nearly reached the acquisition price of these whales, before eventually seeing major recoveries. If this historical pattern thus plays out, the second-largest cryptocurrency might have seen the beginning of yet another bullish rally. As of this writing, Ethereum holds a valuation of $3,086, reflecting a 4% price decline in the past day. Related Reading: Solana Gains Institutional Momentum as New On-Chain Bond Deal and XRP Integration Build Hype Featured image from iStock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum|bear flag|ETH|ethereum|ethereum news|ethereum price|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55739245,
    "published": 1765646389000,
    "title": "Vanguard Exec Likens Bitcoin to ‘Digital Labubu’ Even as Firm Opens ETF Trading Access",
    "body": "Executive John Ameriks emphasized Vanguard's core view of the crypto sector hasn't changed, seeing the asset class as highly speculative.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Vanguard|Bitcoin ETF|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55740038,
    "published": 1765647865000,
    "title": "Solana ETFs record 7-day inflow streak despite price slump",
    "body": "The first SOL ETF was launched in July, followed by Bitwise’s SOL ETF in October, which recorded $57 million in first-day trading volume.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55742048,
    "published": 1765652400000,
    "title": "These Three Metrics Show Bitcoin Found Strong Support Near $80,000",
    "body": "Onchain data shows multiple cost basis metrics confirm heavy demand and investor conviction around the $80,000 price level.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Glassnode|support level|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55743673,
    "published": 1765655689000,
    "title": "The Securities and Exchange Commission publishes crypto custody guide",
    "body": "The guide was a good-faith primer on crypto custody basics and best practices, including different forms of wallet storage and common risks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55745412,
    "published": 1765659622000,
    "title": "Dogecoin Triangle Support Test Maps Out Recovery Roadmap And When To Sell",
    "body": "Dogecoin (DOGE) is testing the lower boundary of a long-term triangle pattern, a move that could determine its next major price direction. A new technical analysis highlights a roadmap with key recovery levels and outlines a potential timeframe when selling and profit-taking may become favorable. Dogecoin Triangle Pattern Signals Recovery Path In a recent X post, crypto analyst Jonathan Carter presented a new analysis of Dogecoin’s price action, predicting that a potential recovery may be imminent. Carter explained that Dogecoin is currently testing a critical support area around $0.135 within a long-standing descending triangle chart structure. The setup is unfolding over the 3-day timeframe, with price action remaining above the pattern’s lower boundary. This zone has become a key battlefield between buyers and sellers. Related Reading: Is Dogecoin Waking Up? Critical On-Chain Metric Explodes Higher Carter highlights that the ongoing support area offers a favorable risk-reward profile for market participants. Buyers stepping in at this level are attempting to prevent a breakdown that could invalidate the broader recovery outlook. This means holding above this support zone could keep Dogecoin’s bullish scenario intact. The descending triangle visible on the analyst’s shared chart shows a series of lower highs pressing against the stable support zone at $0.135. This compression often precedes a decisive move once the price reacts strongly at the base. Dogecoin’s current structure also suggests the market is steadily approaching that inflection point. The volume data at the bottom of the chart has yet to show strong expansion near the support area. This indicates that Dogecoin’s trading activity has been relatively muted, suggesting that the market may be waiting for confirmation before committing to a significant upward move. If Dogecoin successfully rebounds from the $0.135 support zone, Carter’s chart maps out several upside levels to watch. Initial recovery targets are seen around $0.155 and $0.190, where previous price reactions occurred. Clearing these levels would signal growing momentum and a possible end to DOGE’s downtrend. Further upside extensions projected on the chart include $0.250 and $0.310, which align with previous consolidation areas. A stronger continuation could open the path toward $0.370 and ultimately the resistance zone near $0.470. Resistance Zone Reveals When To Sell DOGE Carter’s Dogecoin chart clearly shows the $0.47 resistance zone, where sellers are expected to become active again. A rally into the zone would likely face increased selling pressure based on historical price behaviour. As a result, the resistance area serves as a strategic level for profit-taking rather than for new entries in Dogecoin. Related Reading: Binance’s USD1 Stablecoin Push Deepens Relationship With Trump’s Crypto Platform Overall, Carter’s analysis suggests that Dogecoin’s price is sitting at a pivotal technical level that could shape its next major move. The meme coin’s price is currently down, having crashed by over 22% year-to-date, according to CoinMarketCap. Despite this slip, Carter remains optimistic about DOGE’s recovery path. The recovery timeline highlighted in the analysis suggests that by 2026, the meme coin may have emerged from its downturn. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|crypto|crypto market|crypto news|cryptocurrency|digital currency|doge|Dogecoin|dogeusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55746288,
    "published": 1765661263000,
    "title": "The downfall of Do Kwon",
    "body": "FTAV watched on in court as a New York judge eviscerated, then explained, the Terraform Labs co-founder’s dramatic rise and fall",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 34,
        "NAME": "LUNA",
        "CATEGORY": "LUNA"
      }
    ]
  },
  {
    "id": 55747686,
    "published": 1765664094000,
    "title": "BTC OGs selling covered calls is the main culprit suppressing price: Analyst",
    "body": "Despite traditional ETF investors willing to pay premiums to go long, Bitcoin natives selling covered calls have put a damper on a price rally.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55748789,
    "published": 1765666842000,
    "title": "Bitcoin Macro Retracement Meets Mid-Range Battle – Will Bulls Reclaim Momentum?",
    "body": "Bitcoin is facing a critical juncture as its macro retracement converges with a tight mid-range battle between $86,000 and $100,000. With bearish patterns confirmed and short-term support holding, the market now waits to see if bulls can reclaim momentum or if a deeper pullback is on the horizon. Bitcoin Confirms Macro Top: Bearish Phase Underway According to an update from Crypto Patel, Bitcoin appears to have confirmed a market top and is now transitioning into a broader macro retracement phase. The loss of a key bullish support level has shifted the market structure into a bearish phase. Related Reading: Bitcoin’s Market Structure Strengthens Despite Slower Trading Activity — Here’s Why The chart shows that a Head and Shoulders formation has fully played out. Classical technical rules suggest that the 162% downside projection has already been achieved, reinforcing the view that a cycle top is in place and a larger trend reversal is underway. Looking at the macro Fibonacci retracement from the bear-market low to the recent peak, several key levels come into focus. These include the 0.382 retracement, which sits near $56,700, and the 0.5 level around $44,000, representing a zone of potential bear-market acceptance. Additionally, the 0.618 retracement near $35,000 stands out as the strongest long-term support area. On the liquidity side, an unfilled fair value gap between $98,000 and $100,000 acts as a magnet for a short-term relief bounce before the broader downtrend resumes. Overall, the macro outlook for Bitcoin remains bearish. While a bounce toward the $98,000–$100,000 region is possible, the dominant path points toward a deeper move into the $70,000–$60,000 Fibonacci supports. Traders are advised to wait for confirmation and remain flexible, respecting multiple scenarios as the market unfolds. BTC Trapped: $96,000–$100,000 Cap Meets $86,000 Support Bitcoin remains range-bound between two critical zones as noted by CyrilXBT. Price is hovering near the $90,300 area after facing another rejection from the $96,000–$100,000 supply zone and the 50-day EMA. This region has consistently capped upside attempts over the past several weeks. Related Reading: Report Reveals 65% Of Bitcoin Treasury Companies Struggling With Major Unrealized Losses On the downside, buyers continue to show up around the $86,000–$88,000 demand zone, preventing the price from slipping into a broader breakdown and keeping BTC locked within its current range. From a broader market perspective, Bitcoin previously cooled off while tech stocks surged. As momentum in tech begins to slow, BTC is attempting to stabilize, but a decisive reclaim of the $96,000–$100,000 zone is still required to shift momentum. A sustained move above $100,000 would open the door to trend reversal. Conversely, a loss of the $88,000 support could expose Bitcoin to a deeper pullback toward the $72,000–$76,000 region. Until either scenario plays out, price action remains choppy, and patience is warranted. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|Crypto Patel|CyrilXBT|EMA|Fibonacci Retracement Level|Head and Shoulders Formation",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55751872,
    "published": 1765674006000,
    "title": "XRP Mirrors 2016 Trend That Led To 69% Crash Before 110,000% Rally",
    "body": "XRP has struggled to create any upside traction over the past few days, with the price rejecting above $2.15 in the middle of the week and now back to lingering just above the $2 level. A new long-term technical comparison shared by crypto analyst ChartNerd places XRP’s price behavior since its July all-time high of $3.65 into an interesting context, implying that what XRP is doing now resembles a phase from its 2016 market cycle that points to an incoming huge rally. Related Reading: American Bitcoin Makes Big Buy, Adds 416 BTC To Its Stack Repeating 2016 Rejection And ABC Crash Structure According to crypto analyst ChartNerd, XRP’s current structure matches a similar price action that unfolded in late 2016. when price rejected an accumulation supply block and rolled into an ABC corrective move. That correction ultimately produced a 69% flash-wick decline that extended into the first quarter of 2017. The drop was severe and unfolded over several months, eventually pushing XRP to as low as $0.00240, but it eventually represented the end of the correction rather than the end of the bullish cycle. The chart accompanying the analysis, which is shown below, highlights a similar rejection pattern forming now. This pattern is based on how the XRP price rejected at its most recent all-time high in July. Since then, the monthly price chart has been printing consecutive red candles, with monthly closes consistently below opens. At the time of writing, XRP is about a 44% correction from this all-time high. This means a 69% correction is yet to play out in its entirety. Therefore, if history repeats, a full 69% ABC-style move from the all-time high would drag XRP back below $1 and as low as $0.8. This move is expected to play out into the first quarter of 2026. XRP Price Chart. Source: @ChartNerdTA Potential Drop Could Be A Set-Up For A Much Larger Rally XRP is currently trading at $2.04. Therefore, a deeper pullback below $1 will translate to a 51% decrease from the current price action. The idea of a deeper pullback from $2 is tough to imagine, especially given the inflows into Spot XRP ETFs. In fact, a pullback of that magnitude could test conviction across the market and cause many bullish traders to step aside. However, the technical analysis frames it as a structural reset rather than anything else. In 2017, the post-crash consolidation laid the groundwork for one of XRP’s most explosive rallies on record, ultimately delivering gains in excess of 110,000%. Related Reading: Is Dogecoin Waking Up? Critical On-Chain Metric Explodes Higher If this sequence plays out as expected, then the real bullish opportunity would develop later in 2026. From that reset zone, the chart projects a long-term advance to the 1.618 Fibonacci extension, placing a potential upside target around $27. The visual projection in the chart above shows a clean multi-month expansion zone that delivers a 2,300% gain after the corrective phase. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|blockchain|crypto|cryptocurrency|digital currency|Ripple|xrp|xrp news|XRP Price|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55753565,
    "published": 1765677639000,
    "title": "Ethereum Holds Support As Smart Money Steps In – What This Means For Price",
    "body": "Ethereum is holding firm above key support as smart money steps in, hinting at growing confidence beneath the surface. With bullish signals and steady inflows aligning, the market now watches whether this stability can spark a meaningful upside move. ETH Coils Below $3,200 Ahead Of A Decisive Move AltCoin Việt Nam, in a recent post, highlighted that ETH is positioned at an extremely tense moment on its chart, signaling that the asset is preparing for a major directional move. This immediate pressure is being fueled by a significant bullish divergence that has just appeared on the chart, marking the first time the signal has materialized in over a month. Related Reading: Why Ethereum’s Rally Isn’t Overheated – And Where Demand Must Grow Next The analyst reinforced the expectation of high volatility by referencing historical data. Their research shows a consistent history of 9–16% price volatility whenever ETH falls below the $3,200 level. Given that the price is currently fluctuating tightly around the $3,100 mark, this historical context provides a clear signal that a sharp volatility explosion may be imminent. Adding overwhelming conviction to the bullish case is the recent action of market movers. AltCoin Việt Nam reported that a single super large whale just opened a leveraged long position totaling a massive $392 million (equivalent to 120,094 ETH). This colossal bet on the upside demonstrates a firm, high-conviction among institutional players. Furthermore, the institutional framework continues to provide a reliable underlying demand. The Spot Ethereum ETF market is still actively attracting substantial capital inflows, totaling over $250 million this week. BitMine Technologies also purchased an additional 33,504 ETH (valued at $112 million) today, highlighting persistent institutional accumulation. Considering the confluence of technical divergence, historical volatility context, and massive whale and institutional purchasing, the market faces a critical juncture. AltCoin Việt Nam posed the final question: Can ETH break out strongly and immediately confirm the uptrend, or will it need to retest lower support levels before initiating the expected explosive rally? Buyers Step In As Ethereum Defends Key Support According to crypto analyst The Boss, ETH has shown a highly encouraging response from a key technical area. Ethereum has reacted positively with the $3,091 support zone, and is currently holding firmly above this level, which is a strong signal that short-term buying pressure remains resilient and active in the market. Related Reading: Ethereum Inches Toward A Critical Decision Point: Bullish Break Or Deeper Dive? As long as the price stays above the green line, the analyst confirms that the primary focus remains the upside, validating the potential for a move toward the resistance zone marked by the blue line. The Boss emphasized the importance of these structural defense moves, concluding that such strong reactions from established support levels are vital signals for confirming the validity of the current structure and providing clear direction of the prevailing trend. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|AltCoin Việt Nam|BitMine Technologies|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|ethusd|ETHUSDT|Spot Ethereum ETF|The Boss",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55759658,
    "published": 1765690166000,
    "title": "XRP bulls gain ground over bears on social media, ETF inflow streak continues",
    "body": "Spot XRP exchange-traded funds continued a streak of positive flows, with over $20.1 million recorded on Friday, marking 19 consecutive days of net inflows.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55762286,
    "published": 1765695554000,
    "title": "Standard Chartered, Coinbase deepen alliance to build institutional crypto infrastructure",
    "body": "Standard Chartered and Coinbase are expanding their partnership to develop trading, custody and financing services aimed at institutional crypto clients.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]