[
  {
    "id": 55062008,
    "published": 1764360034000,
    "title": "Can Dogecoin Price Still Reach $10 With The 3rd Wave Deadlock?",
    "body": "A long-term structural analysis suggests the Dogecoin price may be approaching a critical point in this market cycle. With price action compressing and volatility fading, a crypto analyst’s wave-based assessment suggests that DOGE is preparing for an explosive surge toward $10 and beyond, driven by a third-wave deadlock. Third Wave Deadlock To Fuel Dogecoin Price Rally Crypto market expert EtherNasyonal has stated that Dogecoin remains trapped within a third-wave deadlock. This means the cryptocurrency has not yet shown the decisive movement that typically follows a strong wave. Instead, it continues to trade in a tight range without confirming a clear breakout as the price remains confined to the lower region of the ascending channel. Related Reading: Dogecoin Falling Wedge Formation Says Expect 80-90% Rally In The Coming Days The analyst shared an Elliott Wave chart highlighting Dogecoin’s long-term trajectory and price targets above $10, based on a multi-year channel model. His analysis highlights three major waves that define the meme coin’s macro structure. The first wave, which started in 2014, saw an early breakout in 2017, while the second wave triggered the explosive 2021 bull rally. The price action that followed transitioned into the current third wave, during which Dogecoin remains locked in a consolidation zone as it awaits the wave’s completion. If historical patterns were to repeat, EtherNasyonal suggests that Dogecoin could see a third-wave breakout. His chart analysis reveals an ascending channel pointing to several upward targets. If the cryptocurrency manages a breakout, the channel points to an initial target around $0.5, followed by higher targets ranging from $1.2 to over $16. The analyst has also stated that the third-wave breakout will define the strength and direction of Dogecoin’s next major trend. Analyst Says Dogecoin Will Reach $1 By 2026 A fresh analysis from crypto market expert Trader Tardigrade focuses on a less ambitious price target for Dogecoin and on a different timeframe. His weekly chart shows that the meme coin has repeatedly bounced off a long-standing ascending support line. Each of these past rebounds has triggered significant rallies in the Dogecoin price. Related Reading: Dogecoin’s 6,500% Surge: The Road That Leads From $0.15 To $10 This Cycle In November 2024, the meme coin skyrocketed by 86.77%. Just four months later, in March 2025, Dogecoin launched another impressive rally, climbing 210.52%. The momentum continued in November of the same year, with the price surging by 442.48%. Trader Tardigrade notes that Dogecoin has returned to this launchpad area once again, testing the same trendlines that previously ignited strong upward movements. If the historical pattern holds, the analyst predicts DOGE could hit $1 by Q1 2026. His chart shows a potential 611.80% from present levels around $0.15. Although the meme coin is currently in a slump, having lost more than 20% over the past month according to CoinMarketCap, Trader Tardigrade remains confident in its long-term outlook. A move toward $1 would signal a decisive bullish reversal, restoring investor sentiment and overturning the prevailing downtrend. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|@EtherNasyonaL|CoinMarketCap|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt|Elliott wave theory|Trader Tardigrade",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55063428,
    "published": 1764362779000,
    "title": "Brazil’s Economic Center São Paulo to Pilot Blockchain-Based Microloans for Farmers",
    "body": "The project utilizes a blockchain infrastructure developed with Tanssi's technology, enabling predictable transaction fees and reliability, rather than relying on public blockchains.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Brazil|Loan|Blockchain|Lending|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      }
    ]
  },
  {
    "id": 55063264,
    "published": 1764362468000,
    "title": "European Asset Manager Amundi Debuts Tokenized Share Class on Ethereum",
    "body": "The tokenized share class provides investors with blockchain-based access to Amundi’s euro cash fund, enabling faster, round-the-clock trading.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Tokenization|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55063040,
    "published": 1764361749000,
    "title": "Polymarket puts December rate-cut odds at 87% as crypto stocks climb",
    "body": "Cleanspark, Riot, Cipher and Circle rose higher as the odds of a US rate-cut in December reached its highest level of the month on the prediction market.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55063878,
    "published": 1764363640000,
    "title": "Bitcoin Maxi Says ATH Back On The Table After 40x Derivatives Surge",
    "body": "Bitcoin may be closing in on a new all-time high after moves in the derivatives market and fresh buying from large holders, according to market watchers and on-chain data. Related Reading: Crypto Wins Big: Thailand Moves To A 0% Tax On Local Exchange Gains Max Keiser, a long-time Bitcoin advocate, pointed to a filing by Nasdaq to increase options limits for BlackRock’s IBIT to 1 million contracts — a jump that represents roughly a 40x expansion from prior levels — as a key development that could remove barriers to bigger institutional flows. Options Market Expands Significantly According to Nasdaq paperwork and public commentary, the previous 25,000 contract cap had been seen by some as too small for rising volume. Market experts argued that earlier limits were “discriminatorily small” and suggested that 400,000 contracts would be a more reasonable baseline given current demand. Some described the change as a move that could place IBIT into a mega-cap derivatives category, unlocking follow-on effects for how banks and funds structure exposure to bitcoin. I first explained this in 2017: Now that BTC derivatives market was just expanded by 40x New ATH’s are in play. **November 2, 2017** Max Keiser first discussed Bitcoin market makers needing to expand their inventory to support higher prices in this X post: “Wall St traders… https://t.co/aBQ5DdSDay — Max Keiser (@maxkeiser) November 27, 2025 Banks And Market Makers React Market makers will be able to hedge larger positions without hitting the old size wall, which can lower spreads and deepen available liquidity. Based on reports, that also means banks can build structured notes that use IBIT as a reference without tripping existing risk caps — and JPMorgan is reportedly preparing Bitcoin-backed structured notes that would track BlackRock IBIT. Those products could channel steady, institutional flows into the market rather than one-off spikes. On-Chain Buyers Step In According to Glassnode’s Accumulation Trend Score by cohort, holders of 10,000 BTC or more have flipped to net accumulation and now show a score of 0.8, signaling strong buying. The 1,000 to 10,000 BTC group has also turned positive for the first time since September, while the 100 to 1,000 BTC cohort has been in active accumulation since October and continued buying through recent declines. Even retail holders with less than 1 BTC are showing their strongest accumulation since July. Price Action And Value Zones Bitcoin’s price behavior supports the buying narrative. The token fell into the low $80,000 area that served as support in May and then climbed back above $90,000 quickly, which many traders took as a sign that the market sees value in the $80,000 zone. Based on reports, the average cost basis for US spot bitcoin ETFs was near $82,000, and that figure has been cited as a reason institutions found the dip attractive. Related Reading: Bitcoin Faces More Downside After Recent Crash, Data Shows Market Risks And Short-Term Noise Keiser had warned previously that when size limits blocked hedging, the market would be prone to pullbacks — and some analysts say that is part of the reason for recent volatility. Expanding the options cap allows volume sellers to enter more smoothly, which could reduce erratic swings but will not erase market risk. Price spikes are still possible and downside moves remain a real threat if flows slow or macro conditions shift. Featured image from Gemini, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|ath|bitcoin|btc|btcusd|crypto|IBIT|NASDAQ",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55064066,
    "published": 1764363874000,
    "title": "OpenAI Confirms Data Breach—Here's Who Is Impacted",
    "body": "OpenAI said a Mixpanel breach exposed API user metadata—and urged customers to watch for phishing attacks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55063993,
    "published": 1764363826000,
    "title": "Bitcoin Price To Recover $100,000: BTIG Cites Key Reasons For Optimism",
    "body": "The Bitcoin price has recently stabilized above the $90,000 mark, sparking renewed optimism among bullish investors. Analysts at BTIG have suggested that this rebound could propel Bitcoin towards its ambitious target of $100,000. Bitcoin Price Positioned For ‘Reflex Rally’ Jonathan Krinsky, an analyst at BTIG, expressed confidence that the Bitcoin price is positioned for a continued “reflex rally,” potentially reaching $100,000 in the short-term. Historical data indicates that Bitcoin typically reaches a bottom around November 26, gaining momentum as the year comes to a close. This seasonal pattern further bolsters the prospects for the cryptocurrency in the coming weeks. Related Reading: Hyperliquid (HYPE) Ready For A Significant Surge To $50: Key Levels Identified Another focal point for BTIG is Strategy (previously MicroStrategy), which the analyst views as a candidate for a mean reversion trade. The firm maintains a buy rating on MicroStrategy with a price target set at $630. The analyst also highlighted that the week of Thanksgiving often aligns with momentum resets for digital assets, reinforcing expectations for a tactical upward movement into December. Reversion Ahead To $50,000 Adding to the optimistic outlook, market analyst Rekt Capital recently mentioned that if the Bitcoin price can reclaim its position above the $94,180 mark, it would flip the 2025 yearly candle into a green one, substantiating theories of a potential rally for the leading cryptocurrency in the waning days of the year. However, Bitcoin must navigate certain hurdles to sustain this momentum. Rekt noted that for Bitcoin to build on its current prospects and approach the Macro downtrend line, it would require a weekly close above approximately $93,500, turning that level into support, similar to patterns observed in previous green cycles. Related Reading: Bitcoin Price Future: The Polarized Predictions Between Bulls And Bears—Who Will Prevail? At the same time, Mike McGlone, an analyst at Bloomberg, has voiced concerns on social media regarding the Bitcoin price trajectory for the coming days. He suggested that a typical reversion to around $50,000 might be in the books now, emphasizing Bitcoin’s close correlation with the S&P 500. McGlone pointed out that the S&P 500’s 120-day volatility was at its lowest year-end level since 2017, indicating potential headwinds for Bitcoin. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|bitcoin|Bitcoin news|bitcoin price|Bitcoin Price Forecast|bitcoin price news|btc|BTC news|btc price|BTCUSDT|crypto|crypto market|crypto news|cryptocurrency",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55065894,
    "published": 1764367206000,
    "title": "Here’s Why Ethereum Emerges As The Global Capital Rails For On-Chain Finance",
    "body": "In the rapidly evolving landscape of digital finance, Ethereum is quickly establishing itself as the primary infrastructure for global on-chain capital markets. From tokenized bonds and money market funds to institutional liquidity rails, the world’s capital is beginning to migrate to an ecosystem where transactions are programmable, auditable, and borderless. Why Is Ethereum Chosen As The Default Choice For Global Rails The global capital markets are moving on-chain to Ethereum because it is credibly neutral. ETH has never experienced downtime, and it possesses the economic security necessary to support the world’s financial system. Investor and founder of GM42NFT, Captain GM, has stated that ETH is not fast enough to support trading because it wasn’t built for it. Related Reading: Ethereum Price Falls 25% But On-Chain Data and Institutional Staking Signal Q4 Recovery Potential However, the attempts to build a genuinely fast on-chain trading environment have consistently led teams to centralize significant parts of the trading system. This move creates security, reliability, and neutrality concerns for a system designed to be global. These compromises are in direct conflict with the very benefits that ETH provides, and make it the chosen blockchain for global finance. This is where Raya Network steps in to solve these issues at the core. Raya is delivering a decentralized exchange (DEX) with institutional-grade execution speed and Ethereum-level security. It’s a platform that is as fast as TradFi and remains simultaneously secure, reliable, and credibly neutral as exactly DeFi should be. “Fast is easy, decentralized is hard, and it’s only Reya that does both,” Captain GM noted. Analyst Alucard mentioned that the Raya network has become one of the few projects that genuinely solves the speed and security problem. The sub-millisecond execution speeds, trades are fully verified on ETH, and there’s no dependence on a single sequencer. This is an engineered combination designed for real progress in the space. However, over 45% of the token supply is allocated to the community. Reya, combined with the ETH buyback mechanism, creates an ecosystem that’s aligned both technically and economically. They’re building something fast and secure, and because of that, Reya sits in a different category. Why Reya’s Design Feels More Like A New Standard Than Another DEX A trader and ambassador of Somnia, Onur, has also explained that his experience with Reya feels like a full redesign of on-chain execution rather than a small improvement. It offers sub-millisecond fills, unified margin, Ethereum security with ZK settlement, and smooth flow through EigenDA. Related Reading: Ethereum Price Attempts Fresh Recovery as Bullish Pressure Builds According to Onur, the peer-to-pool model keeps trades consistent, efficient, and free from bottlenecks or hidden edges. As a result of this approach, Reya isn’t just another venue anymore, and it’s actively becoming the new execution standard for DeFi. Featured image from Peakpx, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|Alucard|Captain GM|decentralized exchange|DeFi|DEX|EigenDA|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|ethusd|ETHUSDT|Onur|Reya|Somnia",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55067202,
    "published": 1764369511000,
    "title": "Tether Shuts Down Uruguay Mining Operations Over Energy Tariffs",
    "body": "The company had planned to invest up to $500 million in Uruguay, but cited high energy prices and regulatory hurdles as reasons for its pullout.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Tether|Mining|Uruguay|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55070118,
    "published": 1764374431000,
    "title": "Newbie Bitcoin Whales Capitulating, But Old Hands Stay Silent",
    "body": "On-chain data shows New Whales on the Bitcoin network have been realizing losses recently, while Old Whales have remained at the sidelines. Bitcoin Has Faced Loss Selling From The Newbie Whales In a new post on X, CryptoQuant community analyst Maartunn has talked about the latest trend in the profit/loss realization behavior of the Bitcoin whales. “Whales” broadly refer to the BTC investors that hold at least 1,000 tokens in their balance. Related Reading: Bitcoin Puell Multiple Plunges, But Not Inside Bottom Zone Yet At the current exchange rate, the cutoff for the cohort is equivalent to $91.6 million, which is quite significant. As such, this group represents the big-money hands of the market, who can carry some degree of influence. Whales can be divided into two subgroups based on holding time. Investors of this size who purchased their coins within the past 155 days are known as the short-term holder (STH) or New Whales. Similarly, whales with a longer holding time are called the long-term holder (LTH) or Old Whales. Now, here is the chart shared by Maartunn that shows the trend in the net amount of profit/loss that these Bitcoin whale groups have been realizing through their selling over the last few months: As displayed in the above graph, the Bitcoin New Whales have shown some loss realization spikes recently. This underwater selling from the cohort has come as the cryptocurrency’s price has gone through a decline. The New Whales include the inexperienced hands of the market who tend to easily panic in the face of volatility. It would appear that this quality of the group has held through the latest crash as well. The Old Whales, on the other hand, are considered to represent the resolute side of the network. From the chart, it’s visible that there has been some loss selling from these large dormant entities recently, but its scale has been small compared to the New Whale capitulation. Related Reading: Bitcoin Could Be At Risk Of A Deeper Bear If This Ratio Compresses, Says Glassnode The fact that the presence of the Old Whales has been relatively muted through the bearish shift, as well as the rebound that has followed, could be a signal worth keeping an eye on. Speaking of the recovery, the Bitcoin rally has meant that its price has climbed back above a major on-chain cost basis level. As analyst Ali Martinez has shared in an X post, the Bitcoin UTXO Realized Price Distribution (URPD) suggests a strong amount of buying last occurred at $84,500. In on-chain analysis, strong demand zones below the spot price are considered points of potential support for Bitcoin. Similarly, levels above are assumed to be sources of resistance instead. One such major level is present at $112,300. BTC Price Bitcoin’s recovery has furthered during the past day as its price has returned to $92,300. Featured image from Dall-E, Glassnode.com, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin New Whales|Bitcoin Old Whales|Bitcoin whales|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55070461,
    "published": 1764374804000,
    "title": "Bitcoin hasn’t seen this much ‘asymmetric risk-reward’ since COVID: Analyst",
    "body": "Bitwise crypto researcher André Dragosch said, “We’re staring at a similar macro setup” for Bitcoin as during the COVID-19 pandemic.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55075532,
    "published": 1764383587000,
    "title": "Ethereum tripling its gas limit is the ‘floor, we can go higher’ — Sassano",
    "body": "Ethereum educator Anthony Sassano said Ethereum’s gas limit could climb beyond three times next year, with some developers pushing for a fivefold increase.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55080645,
    "published": 1764393547000,
    "title": "Crypto sentiment exits ‘extreme fear’ after 18-day stretch",
    "body": "The crypto sentiment indicator has moved up from extreme fear, and other social media indicators suggest sentiment is moving more bullish toward Bitcoin.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55084264,
    "published": 1764399653000,
    "title": "Upbit $30 Million Hack Update: Authorities Link Breach To North Korean Hackers",
    "body": "South Korea’s largest cryptocurrency exchange, Upbit, is currently under scrutiny by regulators following a significant hack that led to the unauthorized withdrawal of approximately $36.9 million in assets on the Solana (SOL) network. The breach impacted over 20 different tokens and has prompted Upbit to freeze assets on its platform while an investigation unfolds. Lazarus Group Tied To Upbit Hack Authorities are now investigating the possibility of North Korean involvement in the cyber attack. Reports suggest that a group affiliated with North Korea’s intelligence agency, the notorious Lazarus Group, may have orchestrated the hack, which Upbit has described as an “abnormal withdrawal.” This group has been consistently linked to several high-profile crypto heists in recent years, and the US Federal Bureau of Investigation (FBI) has identified North Korean cyber operations as one of the most sophisticated and persistent threats. Related Reading: Hyperliquid (HYPE) Ready For A Significant Surge To $50: Key Levels Identified The recent attack coincidentally occurred just days before the sixth anniversary of a previous major breach, in which Upbit lost 342,000 Ethereum (ETH) to North Korean hackers. According to an unnamed government official, this latest hack bears similarities to a 2019 incident in which approximately 58 billion won in cryptocurrencies was stolen, also attributed to the Lazarus Group. In response to the attack, the South Korean National Police Agency has launched an investigation into the matter, although officials have not provided further comments on the case. Upbit’s operator, Dunamu, confirmed that an in-depth investigation into the cause and extent of the asset outflow is currently underway. Crypto Exchange Moves Funds To Cold Storage The cryptocurrency exchange’s CEO Oh Kyung-seok stated that as soon as abnormal withdrawal activity was detected, Upbit promptly suspended all deposit and withdrawal services. “We are conducting a comprehensive inspection, prioritizing the protection of member assets,” he said in a notice to users. Following the discovery of the unauthorized transactions, Upbit has taken steps to freeze the affected funds wherever possible. To prevent any further unauthorized transfers, the exchange has shifted all remaining assets to cold storage, ensuring “a secure environment for funds.” Related Reading: Bitcoin Price To Recover $100,000: BTIG Cites Key Reasons For Optimism Upbit is also said to be working with relevant project teams to freeze assets on-chain, having already blocked a portion of the stolen funds related to the cryptocurrency Solayer (LAYER). The exchange has indicated that deposits and withdrawals will only resume once full security checks are completed. Dunamu has vowed to reimburse customers for any losses with business funds as part of its commitment to its users. It remains to be seen what additional information the country’s authorities will release in the coming days, as well as potential refund deadlines for affected individuals. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|BTCUSDT|crypto|crypto exchange Upbit|crypto market|crypto news|cryptocurrency|Lazarus Group|North Korean Hackers|Upbit|Upbit hack|Upbit news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 55084119,
    "published": 1764399229000,
    "title": "Arthur Hayes warns Monad could crash 99%, calls it high-risk ‘VC coin’",
    "body": "Arthur Hayes says Monad’s token structure makes it vulnerable to a brutal selloff, while predicting money printing will fuel the next major crypto rally.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55085455,
    "published": 1764401400000,
    "title": "Why China’s Bitcoin mining activity is surging again after a 4-year crackdown",
    "body": "Bitcoin mining in China is rising again. From dominance to ban to resurgence, this makes an engaging story.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55089015,
    "published": 1764406837000,
    "title": "Analyst Predicts 10x Rally For XRP Price If THis Trend Repeats",
    "body": "Crypto analyst ChartNerd has predicted that the XRP price could rally 10x if a specific trend repeats. The analyst also revealed what needs to happen for the altcoin to invalidate this potential parabolic rally. XRP Price Could Rally 10x If This 2017 Pattern Plays Out In an X post, ChartNerd predicted that the XRP price could rally 1,000% if a bullish pattern from the 2017 bull cycle plays out. The analyst noted that during the 2017 euphoric run, the altcoin had a 3-month cool-off period where it successfully dropped towards its 3-month 20-EMA for a retest before a 25x move to the upside. Related Reading: Analyst Says Get Ready For XRP Price Above $4 This Cycle ChartNerd revealed that the XRP price has now witnessed the exact same set-up in this 2025 bull cycle. The altcoin recorded a huge breakout last year and is now seeing a 3-month cool-off period towards a 3-month 20-EMA retest. The analyst stated that if history is set to repeat, XRP could see a 10x upside move, signaling a blow-off top. The analyst also alluded to the 2021 lower high, which he noted ties up with both the monthly candle close highs from 2017 and also the SEC lawsuit, which is believed to have suppressed the XRP price during the 2021 cycle. ChartNerd added that to invalidate this potential rally, XRP will need to close below its 3-month 20-EMA at $1.20. Until then, he noted that the bulls remain in control. Meanwhile, ChartNerd outlined $8, $13, and $27 as the potential top-out points for the XRP price. Notably, a rally to any of these price targets will mark a new all-time high (ATH) for the altcoin. Crypto analyst Egrag Crypto had also previously predicted that XRP could reach $27 in this bull run if it mirrors the 2017 price action. XRP Could Be The Next Crypto To Record A Major Run Market commentator Milk Road suggested in an X post that the XRP price could soon record a major run. The platform cited bullish fundamentals for the altcoin, including the fact that RLUSD crossed $1 billion in market cap in record time. The run to this milestone is said to be faster than almost any stablecoin Ripple has ever pushed. Related Reading: Analyst Predicts XRP Price Will Hit $100 Before Bitcoin Hits $1 Million Furthermore, Milk Road noted that Abu Dhabi’s ADGM has opened the door for institutions to use RLUSD as real collateral, which is also bullish for the XRP price. The market commentator stated that global liquidity with regulated on-ramps could mean the kind of flows that crypto hasn’t seen in months. It is also worth noting that XRP is seeing significant flows into its ecosystem through the U.S. spot ETFs. At the time of writing, the XRP price is trading at around $2.18, down in the last 24 hours, according to data from CoinMarketCap. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Abu Dhabi’s ADGM|altcoin|ChartNerd|CoinMarketCap|EMA|Milk Road|Ripple|RLUSD|stablecoin|US SEC|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55092655,
    "published": 1764412125000,
    "title": "Bitcoin forms short-term bottom, $100K relief rally in sight: Analyst",
    "body": "Bitcoin may be forming a local bottom as RSI nears oversold and whales open longs, fueling a possible relief rally toward the $100,000–$110,000 zone.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55097870,
    "published": 1764420314000,
    "title": "‘Just The Beginning’—$6.6 Trillion December Fed Flip Predicted To Trigger Massive Bitcoin Price Shock",
    "body": "Some of the most bullish bitcoin and crypto speculators have said they expect a December Federal Reserve bombshell to power a bitcoin price boom...",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55098281,
    "published": 1764421200000,
    "title": "Why Gold Is Winning Over Bitcoin in 2025: Liquidity, Trade, and Trust",
    "body": "Despite ETF hype, central banks and asset allocators continue to choose gold over crypto for reserve and trade purposes.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Gold|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55098005,
    "published": 1764420415000,
    "title": "Spot Bitcoin ETFs break four-week outflow streak with $70M in weekly inflows",
    "body": "Spot Bitcoin ETFs snap a four-week outflow run with $70 million in weekly inflows as Ether ETFs also turn positive and analysts flag a potential Bitcoin bottom.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55098460,
    "published": 1764421200000,
    "title": "DATs bring crypto’s insider trading problem to TradFi: Shane Molidor",
    "body": "Information asymmetry and front-running behaviors are migrating from token markets to institutional products like DATs, warns Shane Molidor of Forgd.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55100460,
    "published": 1764424800000,
    "title": "‘Privacy Is the Immune System of Freedom’: Crypto Advocacy Sparks Uproar in São Paulo",
    "body": "An executive at a Brazil-based crypto firm argued that increasing regulation and surveillance are a threat to freedom, and that P2P tech remains a vital line of defense.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Brazil|Privacy|financial privacy|Bitget|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55102592,
    "published": 1764428400000,
    "title": "State of Crypto: Kalshi and Prediction Markets Face a Setback",
    "body": "The court cases will continue for the moment.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Newsletters|State of Crypto|Prediction Markets|Kalshi|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55105985,
    "published": 1764434527000,
    "title": "Crypto Payments Firm Truther to Launch Non-Custodial USDT Visa Card in El Salvador",
    "body": "The card doesn't require preloading funds or custodial services, and carries a 2% fee on currency conversions, with no IOF tax for Brazilian users.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Exclusive|El Salvador|payments|USDT|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55107875,
    "published": 1764438476000,
    "title": "Crypto self-custody is a fundamental right, says SEC's Hester Peirce",
    "body": "Self-custody of assets and financial privacy are both fundamental rights consistent with the pro-freedom philosophy on which the US was founded.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 55110114,
    "published": 1764442800000,
    "title": "Meet the Billion-Dollar Crypto Founder Who Started Trading at 9 Years Old",
    "body": "Denis Dariotis, the youthful founder and CEO of cryptocurrency-focused trading software firm GoQuant, talks about building a billion-dollar-a-day trading startup during his formative years.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|CoinDesk Wealth|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  }
]