[
  {
    "id": 54386932,
    "published": 1763118301000,
    "title": "Crypto Markets Today: Bitcoin Breaches $98K as Liquidations Top $1.1B",
    "body": "A sharp liquidity crunch sent bitcoin and altcoins plunging, triggering over a billion dollars in derivatives liquidations as traders brace for a potential trend reversal.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54388188,
    "published": 1763120617000,
    "title": "XRP ETF debut outshines all 2025 launches with $250M inflows, record volume",
    "body": "Canary Capital’s XRP ETF outperformed all 900 ETF launches of 2025, inspiring a bullish rotation among the industry’s most successful traders, who are now betting on XRP’s price increasing.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54389511,
    "published": 1763123437000,
    "title": "What Will Trigger The XRP 1,300% Break To $36 This Bull Cycle?",
    "body": "The weekly chart for XRP has compressed into a decisive structure that now sits on the edge of a major move, and the latest projection from crypto analyst Dark Defender outlines how this structure could push to as high as $36 this bull cycle. His outlook centers on an Elliott Wave pattern that started forming in June, and the chart behind the analysis shows a sequence that is approaching the point where momentum returns with force. Elliott Wave Structure Points To A Wave Three Expansion Technical analysis of the XRP’s weekly candlestick timeframe chart shows that the cryptocurrency has spent the past several months compressing inside a tightening structure, forming a narrowing support and resistance triangle. This analysis attempts to map out where this pressure leads next, particularly as XRP is now trading around the peak of this triangle, where volatility could return in force. Related Reading: Pundit Dunks On XRP Triple-Digit Dreams; Price Isn’t Going To $100 This Year Dark Defender’s projection is built on a five-wave Elliott structure that traces its origin back to mid-June, when XRP delivered its initial impulsive rally that formed Wave One. That first advance carried the price on a rally from the lower ranges into a new all-time high of $3.65 before losing steam. Since then, the second wave, which is naturally corrective based on the theory, has dragged the price action sideways to create lower highs beneath descending resistance and higher lows above the support. The chart below shows that this corrective phase is now entering its final stretch, with candles clustering inside the narrowing triangle. The technical message is straightforward: once the correction exhausts itself, the next phase of the Elliott count would be a Wave Three expansion. This third wave is the strongest and longest of the five waves, and it often receives the largest percentage gains in the entire cycle. The Breakout Zone: $2.22 Support And $2.85 Resistance The analysis marks two levels that now define XRP’s breakout conditions. The support band around $2.22 has held firm throughout the entire consolidation, providing the foundation of the structure. The resistance line is at $2.85, and this has capped every rally attempt since the summer. Related Reading: Chinese And US Governments Fighting Over Bitcoin? Here’s What We Know A weekly close above $2.85 is the trigger that would officially transition XRP out of Wave 2 and into the impulsive third wave. Any break below $2.22 would delay the bullish outlook. The Fibonacci extension levels on the chart indicate the next significant checkpoints after the Wave 3 expansion starts. The first leg of the anticipated impulse, the 261.8% extension, is located close to $5.85. However, the wider Wave 3 target is located at the 361.8% level around $18.22. Following this, the Wave 4 pullback is expected to cool the momentum before the final Wave 5 impulse completes the broader structure. The final wave reaches into the 423.6% extension, which is positioned around $36.76 on the price chart. At the time of writing, XRP is trading at $2.31, down by 8.2% in the past 24 hours. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Ripple|ripple news|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54389556,
    "published": 1763123400000,
    "title": "Proof of reserves is crypto’s key to rebuilding trust and transparency",
    "body": "Transparency through proof of reserves is essential for restoring and maintaining trust in crypto exchanges, ensuring security through independent audits and verifiable reserves.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54389146,
    "published": 1763121600000,
    "title": "Retail Traders Left Exposed in High-Stakes Crypto Treasury Deals",
    "body": "Executives are turning to a novel structure to fund crypto accumulation vehicles as investor appetite thins.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54390961,
    "published": 1763126461000,
    "title": "Morning Minute: Bitcoin Breaks Below $95K",
    "body": "It's a bloody morning for the crypto board and has got people asking—has the bear market officially begun?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Opinion",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54392134,
    "published": 1763128803000,
    "title": "Crypto On Alert: Raoul Pal Hints At Macro Twist Post-US Govt Shutdown",
    "body": "As the latest US government shutdown ends and markets refocus on macro plumbing, Raoul Pal has sketched out a strikingly liquidity-heavy roadmap on X – one that, in his framework, has direct implications for crypto. “So now the US Gov has reopened, what’s next?” Pal asks. He immediately points to the Treasury General Account (TGA): “Expect a few days for TGA spending to begin to significantly add to liquidity and should persist for several months.Obviously, QT ends in Dec and the balance sheet will crawl higher. We should see the dollar begin to weaken again.” Mechanically, TGA drawdowns push cash back into bank reserves and money markets, reversing the reserve drain that built up while the government was partially shut. At the same time, the Federal Reserve has already confirmed that quantitative tightening (QT) will end on December 1, 2025, shifting from active balance-sheet reduction to full reinvestment of maturing Treasuries and a more “maintenance” stance. When Will Crypto Prices Rise Again? Pal’s point is that both channels tilt the system toward more dollars sloshing through funding markets, a backdrop he has long argued is constructive for risk assets, including crypto. The near-term risk, in his view, is a classic year-end funding squeeze. “The next key step is to avoid a Year End funding squeeze. Expect several ‘temporary’ measures to add liquidity. Term Funding and SRF operations are most likely.” Related Reading: SEC Chair Sets Out Plans For Crypto Taxonomy To Define Digital Asset Classification Here he is referring to term repo or funding facilities and the Standing Repo Facility (SRF), which the Fed can scale up to backstop banks’ access to cash if overnight rates spike. That reading aligns with recent Fed communication that elevated SRF usage and tighter money-market conditions were central reasons for ending QT early. Pal then escalates from tactical tools to structural regulation: “That will eventually morph into the desperately needed changes to the SLR to allow banks to absorb more issuance and re-lever their balance sheets. This is a big liquidity bazooka. Expect in Q1. SLR should lower rates as banks buy more bonds.” The Supplementary Leverage Ratio (SLR) caps large banks’ overall balance-sheet size, regardless of asset risk. Loosening it for Treasuries and reserves has been debated for years as a way to let dealers warehouse more government debt without breaching constraints. If regulators move in that direction, it would, as Pal notes, free capacity for banks to buy more bonds and could exert downward pressure on yields—again easing financial conditions. Related Reading: The 2025 Year-End Crypto Outlook: The Catalysts That Will Decide Everything For crypto, that matters indirectly: Pal’s core macro thesis is that improving liquidity and lower real yields are the primary tailwinds for digital assets. Regulation is explicitly on his radar too: “Also expect CLARITY Act for crypto to begin to get finalized.” The Digital Asset Market Clarity Act of 2025 (“CLARITY Act”) has already passed the US House and is now before the Senate. It would define digital asset categories and divide oversight between the CFTC and SEC, replacing much of the current “regulation by enforcement” model. Pal’s remark signals his expectation that the shutdown’s end clears the way for renewed legislative momentum – a key piece of the institutional puzzle for non-bitcoin crypto. He closes by broadening the lens to global and fiscal policy: “There will also be stimulus payments and the Big Beautiful Bill fiscal goosing. China will continue balance sheet expansion. Europe will add fiscal stimulus or extra spending. The debts must be rolled and the Gov wants to super heat the economy into the Mid-Terms. This is the Liquidity Flood…. the spice must flow.” Taken together, Pal is describing a synchronised regime: post-shutdown TGA spending, the end of QT, potential SLR relief, progressing US crypto legislation, and ongoing fiscal and monetary support in China and Europe. For crypto investors who share his liquidity-centric lens, the message is not subtle: the macro “spice,” in his view, is about to flow again. At press time, the total crypto market cap dropped to $3.24 trillion. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto|Crypto market news|crypto news|Crypto Prices|Raoul Pal",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54391855,
    "published": 1763127932000,
    "title": "Uniswap revives ICO-style token launches with new onchain auction system",
    "body": "Uniswap launched Continuous Clearing Auctions, a new onchain token sale mechanism designed to offer transparent price discovery, debuting with Aztec’s sale.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 53,
        "NAME": "UNI",
        "CATEGORY": "UNI"
      },
      {
        "TYPE": "122",
        "ID": 205,
        "NAME": "TOKEN SALE",
        "CATEGORY": "TOKEN SALE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54392573,
    "published": 1763129371000,
    "title": "UK central bank still ‘disproportionately cautious’ about stablecoins",
    "body": "Some crypto industry observers believe that the Bank of England’s new proposed regulations for stablecoins are unnecessarily restrictive.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54392323,
    "published": 1763129143000,
    "title": "Bitcoin Hyper Whale Buy Fuels 1000x Talk As Presale Nears Finish",
    "body": "What to Know: A single $HYPER purchase of $502.6K added credible whale validation to a late-stage presale narrative. Bitcoin Hyper aims to deliver SVM-level throughput while settling to Bitcoin, targeting fast, low-fee $BTC transactions and usable DeFi rails. The $HYPER presale raised over $27.5M so far with a token price of $0.013275 and a staking reward of 42%. Based on $HYPER’s current price, investing now could reward you with an ROI of 572% or 1,805% by 2026 and 2030 respectively. Big money keeps circling fresh Bitcoin infrastructure plays. This week, a single on-chain purchase worth roughly half a million dollars in $HYPER lit up whale trackers, throwing a spotlight on Bitcoin Hyper’s ($HYPER) layer-2 pitch just as its presale enters the final stretch. The buy-in arrived at a moment when Bitcoin scaling narratives are driving capital flows across Layer-2s and sidechains. Faster settlement, cheaper fees, more programmable rails for $BTC – that’s where the puck is going, and that’s the lane Bitcoin Hyper wants to own. Bitcoin Hyper positions itself as a Bitcoin Layer-2 built around a Solana Virtual Machine (SVM) execution layer, bridging $BTC into a high-throughput environment while committing its state back to Bitcoin for security. The promise is simple: near-instant $BTC transactions and a workable home for Bitcoin-centric DeFi and apps without abandoning Bitcoin’s base-layer assurances. That combination – speed from an SVM stack, settlement discipline from Bitcoin – is the core of the project’s pitch. The momentum is already there, even without whales adding more fuel to the fire. Fresh capital validates the story, adds perceived scarcity pressure, and sets a reference point for what deep-pocketed traders are willing to risk ahead of a first listing. ➡️ Read more about this innovative project with 1000x potential in our detailed Bitcoin Hyper review. SVM-Powered Bitcoin Layer-2 Targeting Real Throughput Under the hood, Bitcoin Hyper’s ($HYPER) design will funnel $BTC through a canonical bridge, mint an equivalent value on its Layer-2, process transactions in an SVM environment for high throughput, and then commit proofs back to Bitcoin’s Layer-1. The intent is to preserve Bitcoin-grade security while overcoming Layer-1 bottlenecks. The Hyper roadmap references sequencing research, zero-knowledge proofs, and periodic state commitments – the right ingredients for a Layer-2 that wants to run payments, order books, and staking without grinding to a halt. For developers, the SVM angle taps an ecosystem that already understands performant, parallelized runtime patterns. For users, the value prop is faster finality and lower fees while still settling to Bitcoin. Utility is the point here. If the bridge and execution stack work as described, Bitcoin Hyper can become the place where $BTC actually moves at app speed. That creates room for payments, market venues, and on-chain tools tied directly to the asset people already hold. The upshot for presale buyers is straightforward: useful block space tends to find demand, and demand is what sustains fees and token utility. Presale Success as it Draws to a Close Presales are about price, runway, and conviction. The Bitcoin Hyper presale has already cleared $27.5M+, with a current token price of $0.013275 and staking rewards set at 42% for early participants. Our $0.08925 price prediction for $HYPER suggests a potential ROI of 572% if the hype momentum holds. By 2030, following a successful implementation, $HYPER could get to $0.253, for a return rate of 1,805% based on today’s price. ➡️ Read our guide to buying $HYPER if you’re thinking of buying in. On signals, whale activity is setting the tone. Yesterday’s whale transaction saw 155.62 $ETH routed through the presale contract, with distributions to multiple recipient addresses and an associated $HYPER transfer of 36.86M tokens. 💰 Historical cost accounting at the execution time puts the gross outlay at $502.6K – massive enough to register, spot on the ‘half a million’ mark to move sentiment. In presales, that matters. It tells mid-sized buyers the order book isn’t only retail. On runway, the presale’s $27.5M+ haul and 42% staking rewards set a clear incentive for early participants while the network spins up. If the staking mechanism draws sufficient lock-in ahead of TGE, it softens the initial float and can stabilize early price action if listings open with typical volatility. Couple that with the SVM narrative and the broader hunt for Bitcoin-centric block space, and you get a presale with enough story, enough numbers, and now, enough whale interest to justify a closer look before the window shuts. It’s no wonder that, in terms of numbers and community support, Hyper already qualifies as one of the best crypto presales of 2025. Bitcoin Hyper is eyeing a Q4 2025/Q1 2026 release window, so there’s not much time left to join the presale. Plus the presale price goes up in stages, while the staking APY lowers as more holders join the pool. 🚀 Don’t delay – buy your $HYPER today. Disclaimer: This isn’t financial advice. Always do your own research before making any investment. Authored by Aaron Walker, NewsBTC – https://www.newsbtc.com/news/bitcoin-hyper-whale-buy-1000x-potential-presale-near-finish",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54393974,
    "published": 1763132393000,
    "title": "Ether Tumbles 8% as ETFs Bleed Over $1.4B, Long-Term Holders Sell",
    "body": "ETH plunged below $3,100 on Friday as the crypto selloff accelerated with bitcoin losing the $100,000 level.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Ethereum|AI Market Insights|Ether ETFs|Glassnode|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54394306,
    "published": 1763133016000,
    "title": "Crypto Bulls Get Rekt as Ethereum, XRP Fall Harder Than Bitcoin",
    "body": "Think Bitcoin is having a bad day? Altcoins have been hit much harder, and crypto liquidations are piling up.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54394852,
    "published": 1763134203000,
    "title": "Why Are The Bitcoin, Ethereum, And Dogecoin Prices Down Again?",
    "body": "The cryptocurrency market is experiencing a wave of declines, leaving investors concerned as the Bitcoin, Ethereum, and Dogecoin prices fall sharply. Despite experiencing a period of recovery earlier this week, all three digital assets are now facing renewed downward pressure. The latest price declines are driven by both macroeconomic uncertainty and internal market factors, underscoring how sensitive the crypto market remains to changes in investor sentiment. FED Skepticism Fuel Decline In Bitcoin, Ethereum, And Dogecoin The recent decline in cryptocurrency prices comes amid growing doubts over the Federal Reserve’s (FED) approach to interest rates. Recent remarks from FED officials, including the President of the Federal Reserve Bank of Minneapolis, Neel Kashkari, have cast uncertainty on whether the central bank will deliver a third consecutive easing of policy during the December FOMC meeting. Related Reading: Why The Bitcoin Price Crash Is Important If Wave 5 Corrects To $94,000 According to Bloomberg reports, Kashkari noted that recent economic data suggested more resilience than was initially anticipated, sparking a debate over the necessity of further rate cuts. This cautious stance has unsettled financial markets, causing investors to reconsider earlier positions as former expectations of a rate now appear uncertain. Notably, Bitcoin, Ethereum, and Dogecoin have reacted sharply to the prevailing sentiment caused by the doubts in monetary easing. Their prices have plummeted, accelerating the broader correction that has been dragging on for months. This decline is also being augmented by large-scale whale sell offs and lingering ambiguity surrounding new developments in the previous US government shutdown. How Much BTC, ETH, And DOGE Declined This Week In addition to macroeconomic factors, market dynamics are also contributing to crypto losses. CoinMarketCap’s data shows that the Bitcoin price crashed below $97,000 for the first time since May 2025. It has fallen more than 5% over the week and dropped another 6.4% in a single day. Related Reading: Analysts Share Forecasts As Ethereum Price Struggles Below $4,000, And It’s Very Bearish Amidst this decline, long-term BTC holders are reportedly selling at record levels, fueling the downtrend. Additionally, institutional demand is weakening while investor sentiment has turned negative. Even Spot Bitcoin ETF activity is plummeting, recording over $866.7 million in net outflows yesterday—the second largest in its history. Ethereum has also been hit hard, losing more than 10% in the past 24 hours and over 5% this week. The price has steadily trended downward for weeks and shows no clear signs of recovery. At the time of writing, ETH is trading at $3,200, down more than 35% from the ATH levels above $4,950 set in August this year. Dogecoin, while only slightly affected by the broader bearish trend, is now trading at $0.165. It has fallen by approximately 2.3% during the week and by an additional 8% in one day. Collectively, these widespread declines suggest that the market may be experiencing a period of extreme stress, as all three cryptocurrencies have recorded double-digit monthly losses. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|Bank of Minneapolis|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|CoinMarketCap|ethereum|fed|federal reserve|FOMC Meeting|Neel Kashkari|pot Bitcoin ETF",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54394621,
    "published": 1763133626000,
    "title": "Detroit Man Jailed for 9 Years Over Bitcoin Donations Intended for ISIS",
    "body": "Operating “in the shadows,” the man sent Bitcoin to a federal informant he believed was an ISIS operative.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54395318,
    "published": 1763135046000,
    "title": "This $2.5 Billion BlackRock Fund Is Coming to Binance and BNB Chain",
    "body": "BlackRock’s $2.5 billion USD Institutional Digital Liquidity Fund (BUIDL) is expanding to Binance and BNB Chain, Securitize said Friday.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54395839,
    "published": 1763135978000,
    "title": "CFO Convicted for Losing $35 Million of Company Money in Crypto Side Hustle",
    "body": "Nevin Shetty invested the stolen funds in DeFi lending protocols in 2022, and was starting to turn a handsome profit—until Terra and the broader crypto market collapsed.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|terra-luna-2|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54396201,
    "published": 1763136781000,
    "title": "BlackRock’s $2.5B Tokenized Fund Gets Listed as Collateral on Binance, Expands to BNB Chain",
    "body": "The $2.5 billion BUIDL fund, tokenized by Securitize, deepens its utility for institutional traders and expands to a new blockchain.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Tokenization|Real World Assets|Securitize|Binance|BlackRock|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54396359,
    "published": 1763136907000,
    "title": "How Square’s new Bitcoin payments could change how merchants accept money online",
    "body": "Square’s new Bitcoin payments may redefine how merchants accept money online with faster settlement, lower costs and greater financial control.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54397591,
    "published": 1763139637000,
    "title": "This Analyst Called The Bitcoin Crash Below $20,000 In 2021, He’s Back With A Shocking Prediction For Solana",
    "body": "A crypto analyst who famously forecasted the dramatic Bitcoin (BTC) crash to $20,000 in 2021 has caught the attention of investors and traders with a new warning about Solana (SOL). In a technical analysis, he identifies a critical resistance zone that he believes must be reclaimed soon. Without recovery, he warns that the SOL price could break down toward a much lower level, deepening the cryptocurrency’s already persistent downtrend. Bitcoin Crash Caller Issues New Solana Alert After projecting BTC’s collapse four years ago, crypto market expert DonAlt is highlighting new risks in Solana. In one of his latest analyses, DonAlt shared a detailed look at Solana’s price structure, including a chart that highlights a major red resistance zone between $190 and $215. Related Reading: Ripple Exec Reveals Why The Bitcoin Price Is So High Now According to him, this is the range level Solana must recover to avoid a deeper correction. The analyst explained that his stance on Solana has been bearish for some time, and the recent rejection from this key resistance area has only reinforced that outlook. The SOL price chart shows several failed attempts to close above the red box, suggesting that sellers may still be controlling the trend despite recent accumulation. The upper range line around $250 has acted as an unyielding ceiling for months now, and DonAlt has indicated that as long as Solana trades significantly below it, the market should be considered structurally weak. Currently, the altcoin’s price has slipped toward mid-range levels, and the weekly timeframe is starting to exhibit early signs of a bearish breakdown. In a previous report, DonAlt presented the same chart structure, emphasizing that Solana’s price action remains “awful” unless buyers step in within two days to rescue the weekly close. If they fail to do so, he expects the cryptocurrency’s price to fall back toward the range support at $126. At the time of writing, Solana is trading around $141, meaning a decline to $126 would represent a more than 10% drop in value. Notably, the bearish pressure is visible on the chart candles, which continue to weaken each time Solana approaches the red resistance zone. The trend reflects a diminishing strength and a steady decline in momentum, further augmented by the broader crypto downtrend and rising volatility. SOL HTF Chart Signals Severe Breakdown Risk DonAlt has also displayed a High-Time Frame (HTF) chart that he considers one of the most bearish he has seen in recent months. The chart shows a clean rejection from the upper boundary near $208, underscoring the weakness developing in higher timeframes. Related Reading: XRP Set To Lead The Next Bull Rally: Crypto Research Firm Blows The Lid Open While many traders assume that bearish setups fail when they become too obvious, DonAlt suggests that the current situation with Solana is opposite. He points out that almost no one is panicking or even discussing the potential risks, which is even more unusual, indicating that this silence may be masking real vulnerability. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Solana|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|Sol|SOL news|SOL Price|Solana news|Solana Price|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54397234,
    "published": 1763137394000,
    "title": "Bitcoin below $95k! Majors nosedive 8-12%! JPMorgan bullish on Circle!",
    "body": "Crypto majors fell 7–12% in one of the year’s biggest selloffs, with Bitcoin down 8% to $95,200, Ethereum down 11% to $3,100, BNB down 7% to $895, and Solana down 12% to $137. A few assets bucked the trend, with ZEC up 3% and LEO up 1% among top movers. Bitcoin miners and crypto-related equities were hit as well, including declines in MicroStrategy (-7%), Coinbase (-7%), and Robinhood (-9%). Market sentiment remained deeply negative, with the Crypto Fear & Greed Index holding in Extreme Fear at 16. In more positive news, JPMorgan analysts turned bullish on Circle, upgrading the stock to Overweight and raising their price target on expectations of faster USDC and stablecoin growth; Cathie Wood’s ARK added $30 million in shares. Jack Dorsey’s Cash App announced that stablecoin payments on Solana and other networks are planned for early 2026. Separately, reports surfaced that China state-backed hackers allegedly used Anthropic’s Claude Code to assist in a major cyberattack affecting roughly 30 companies. Additional disclosures revealed Epstein estate emails referencing Bitcoin discussions between Brock Pierce and Larry Summers at Jeffrey Epstein’s Manhattan townhouse. Meanwhile, Emory University doubled its Bitcoin holdings in Grayscale’s BTC Trust, bringing its total to $52 million.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54398455,
    "published": 1763141401000,
    "title": "'Some Bad Shit. Very Bad': Jeffrey Epstein Was Worried About Bitcoin and Crypto Taxes, Emails Reveal",
    "body": "A year prior to his death, the sex offender attempted to influence the Trump administration's crypto policy through Steve Bannon.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54398123,
    "published": 1763140797000,
    "title": "Oklahoma Man Gets Five-Year Sentence for $9.4M Crypto Ponzi Scheme",
    "body": "Travis Ford pleaded guilty to conspiracy to commit wire fraud in January, in a case involving millions in investor losses.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 54398936,
    "published": 1763142409000,
    "title": "U.S. DOJ Pursues North Korea's Illicit Money Machine, Seizes More Crypto",
    "body": "U.S. authorities secured several criminal convictions and gathered another $15 million in proceeds from North Korean crypto heists, the Justice Department said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Federal bureau of investigation|U.S. Department of Justice|Crypto Seizures|North Korea|Bitcoin Strategic Reserve|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54398965,
    "published": 1763142356000,
    "title": "Michael Saylor Denies Bitcoin Sale Rumors, Says Strategy's BTC Buys Are 'Accelerating'",
    "body": "Strategy's co-founder and executive chairman described the company's hunger for Bitcoin as insatiable, while denying rumors of a recent sale.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54399367,
    "published": 1763143203000,
    "title": "Analyst Highlights Interesting Dogecoin Double Top Adam & Eve Pattern",
    "body": "Crypto analyst Tripy has highlighted a double-top Adam and Eve pattern that could send the Dogecoin price as low as $0.16. Meanwhile, crypto XAU has also highlighted a bearish setup that could spark a further decline to $0.15. Dogecoin Price Risks Drop To $0.16 With Double Top Adam And Eve Pattern In a TradingView post, Tripy revealed that a classic Adam and Eve pattern has formed for the Dogecoin price. The analyst warned that market participants may see volatility around the breakdown, but that the pattern rarely fails. His accompanying chart showed that DOGE could suffer a decline to as low as $0.16 due to this double top pattern. Related Reading: Analyst Predicts Dogecoin Price “Historic Mega Run” – Here’s The Target Tripy also revealed that the MACD and volume are falling, indicating that a sell-off is coming for the Dogecoin price. A positive is that the analyst expects DOGE to rebound from the $0.16 range. The sell-off in the foremost meme coin is underway, with DOGE recording a significant decline yesterday as Bitcoin dropped below $100,000 for the second time this month. Crypto analyst XAU drew a bearish setup toward $0.15 for the Dogecoin price. He noted that DOGE remains under strong bearish pressure, following multiple Breaks of Structure (BOS) and Market Structure (MSS) on the 3-hour timeframe. The analyst further stated that after a brief consolidation phase, the price continues to respect the descending trend, indicating a lack of bullish strength. Notably, the Dogecoin price had attempted a minor upward correction toward the psychological $0.2 level but failed to reclaim the zone. As a result, XAU has warned that this may trigger a sharp drop toward the $0.15 level, which will confirm continuation of the broader bearish trend. The analyst added that momentum remains weak and sellers continue to dominate short-term rallies, indicating further downside pressure. DOGE Reenters Broadening Wedge In an X post, crypto analyst Trader Tardigrade revealed that the Dogecoin price has reentered the broadening wedge after a “Spring Action.” He added that this pattern was last seen in 2024, just before a massive surge. His accompanying chart showed that DOGE could still rally to $0.8, despite the current bearish price action. A rally to this level would mark a new all-time high (ATH) for the foremost meme coin. Related Reading: Dogecoin Price Rally Above $0.74 ATHs In The Works As HTF Trend Holds In the short term, Trader Tradigrade indicated that the Dogecoin price could reclaim the $0.2 level. He stated that DOGE has returned to the previous level as the RSI indicates a breakout of a trendline. His accompanying chart showed that DOGE could reach $0.26 after reclaiming the $0.2 level. At the time of writing, the Dogecoin price is trading at around $0.163, down over 5% in the last 24 hours, according to data from CoinMarketCap. Featured image from Peakpx, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Dogecoin|Adam and Eve Pattern|bitcoin|BOS|Breaks of Structure|CoinMarketCap|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt|MACD|Market Structure|meme coin|MSS|RSI|Trader Tardigrade|Tripy|xau",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54399782,
    "published": 1763144040000,
    "title": "Tether eyes €1bn funding deal with AI robotics start-up Neura",
    "body": "Cryptocurrency giant seeks to build on sprawling investment portfolio with bet on German humanoid robotics group",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54400352,
    "published": 1763145000000,
    "title": "ETH long-term holders dump 45K Ether per day: Is a price drop to $2.5K next?",
    "body": "Ether price is at risk of a 23% drop to $2,500 if long-term investors maintain their current pace of selling. Cointelegraph explains what must happen for a bullish reversal to take place.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54399978,
    "published": 1763144180000,
    "title": "‘We are buying’: Michael Saylor denies reports of Strategy dumping BTC",
    "body": "Strategy will add to its 640,000 Bitcoin holdings by continuing to buy amid a flash crash in BTC price, Michael Saylor said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54400692,
    "published": 1763145634000,
    "title": "'Demonic': AI App That Lets Users 'Talk' to Dead Loved Ones Faces Backlash",
    "body": "2Wai’s new “HoloAvatar” tool turns minutes of footage into lifelike replicas of deceased loved ones, igniting ethical alarms over consent, privacy, and the commercialization of grief.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54400423,
    "published": 1763144611000,
    "title": "BlackRock Fund Offered on Binance Marks Shift in Crypto Plumbing",
    "body": "BlackRock Inc.’s tokenized fund will be accepted as collateral on Binance Holdings Ltd., in a step that broadens access of the asset manager’s blockchain-linked products on the largest crypto trading platform and marks Wall Street’s deepening ties with the digital-asset world.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "NYS:BLK",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54401219,
    "published": 1763146800000,
    "title": "Bitcoin falls to 6-month low as ETF demand collapses: Finance Redefined",
    "body": "Bitcoin drops to a six-month low as spot ETF outflows resume despite the US shutdown ending, signaling weak demand and renewed pressure on crypto markets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54403072,
    "published": 1763150411000,
    "title": "Dogecoin Shows Relative Strength: Breakout Signal Sits At This Price",
    "body": "Dogecoin is showing unexpected resilience while the broader crypto market trades in a weak pattern, according to trader Daan Crypto Trades (@DaanCrypto). In a chart posted on X on November 13, he highlighted a potential “range retake” that could set up a move toward the previous range high at roughly $0.218—if DOGE can break and hold above $0.18. Dogecoin Bulls Have A Target “DOGE has been relatively strong the past few days. Overall market is obviously weak and choppy,” he wrote. At the time of his chart, Dogecoin traded around $0.172 on Binance, sitting just below a key green support band marking the range low between $0.17 and $0.18 . The range high—drawn at $0.21817 —remains the upside target if price can reclaim the lower boundary. The distance between the band and the top of the range is 23.1%, a move Daan considers technically clean if momentum aligns. The trader also pointed to a narrative circulating in US markets: proposed 2,000-dollar stimulus or dividend checks by the Trump administration. He noted the psychological connection many retail traders still have to the “stimmy check” era of 2020–2021, when Dogecoin was one of the cycle’s strongest performers. Related Reading: Dogecoin Whales Load Up: 4.72 Billion DOGE Vanish Into Mega Wallets “I think the 2,000 dollar stimulus/dividend checks to US workers might have re-ignited some muscle memory,” he said, adding that younger traders often look for speculative assets rather than Bitcoin or Ethereum when deploying unexpected cash. Technically, the setup he is monitoring is straightforward: DOGE previously broke below its established range, flushed to lower lows, and is now attempting to push back into the band. His chart shows two rounded swing lows, suggesting a potential base forming. A reclaim of the green zone—validated by closing strength above $0.18 —would signal that sellers have lost control and that the upper boundary at $0.218 could come back into focus. Related Reading: Dogecoin Whales Load Up: 4.72 Billion DOGE Vanish Into Mega Wallets “Regardless of all that, I am watching closely here for this range retake,” he wrote. “I think it could make for a clean setup for a move back to the range highs. Need BTC & ETH to hold the floor for that to play out obviously.” That final clause underscores the conditional nature of his view. Dogecoin often behaves as a high-beta expression of market risk, and Daan is explicit that a broader market breakdown would invalidate the scenario, even if DOGE briefly trades above $0.18. Questions about his seemingly long-oriented emphasis prompted clarification. One user asked why he focuses mainly on upside setups, prompting Daan to respond: “I do both sides personally for short term scalps. But the moment you post short setups people get quite angry.” He added that long setups tend to offer better risk-to-reward for most traders and that shorting after recent “big liquidation flushes” like the October 10 event is generally less appealing. His posted chart reflects that preference: a potential bullish reclaim rather than an attempt to fade resistance. For now, the key remains unchanged—confirmation only comes with a sustained break above $0.18. Without that level, Dogecoin stays inside its lower consolidation, with Bitcoin and Ethereum setting the broader context for whether the memecoin can extend its relative strength. At press time, DOGE traded at $0.15943. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54403588,
    "published": 1763151004000,
    "title": "‘Volatility is your friend’: Eric Trump not bothered by Bitcoin, crypto carnage",
    "body": "Eric Trump shrugs off an extended crypto sell-off as American Bitcoin ramps up its holdings and climbs into the top ranks of public BTC treasuries.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54403788,
    "published": 1763151564000,
    "title": "Strategy’s NAV falls under 1, critics raise alarm after $5.7B Bitcoin wallet move",
    "body": "Strategy moves $5.7 billion in Bitcoin as its net asset value to its Bitcoin holdings drops below one for the first time, sparking valuation concerns amid marketwide speculation.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54405162,
    "published": 1763154031000,
    "title": "Why This Pundit Believes XRP Could Become A ‘Joke’ As ETFs Go Live",
    "body": "A recently shared image on X showing the full lineup of pending XRP ETF filings prompted a blunt response from market commentator Robert Ledferd. Instead of offering predictions or excitement, he framed the moment as a straightforward test for the asset, noting that if XRP cannot climb into double-digit territory once this many ETFs are live, the market may end up treating it as a joke. The comment brings into question what price level actually represents meaningful progress once institutional money enters the picture for XRP. Why The Comment Landed Strongly Ledferd reacted to a screenshot listing nearly every major issuer preparing an XRP product, including firms such as Bitwise, Grayscale, Fidelity, VanEck, Invesco, CoinShares, Franklin Templeton, Hashdex, and ARK Invest. The number of issuers alone means that XRP is entering a phase where institutional exposure will no longer be theoretical. Related Reading: Analyst Predicts XRP “Supply Crisis” To Trigger The Next Parabolic Rally The general consensus is that when these ETFs hit the market, XRP will receive massive institutional inflows comparable to that of Bitcoin and Ethereum, which, in turn, would be reflected in its price action. With this in mind, the pundit noted that XRP will be the “joke of the year” if these ETFs do not bring the cryptocurrency’s price to at least double digits.” Where XRP Needs To Trade For ETFs To Matter The numerical reality behind this expectation is straightforward. XRP is currently trading well below the $3 price level. Particularly, XRP is trading at $2.3, which means even a return to its $3.65 all-time high would require a price increase of about 40% from present levels. To reach actual double digits above $10, it means the price of XRP would need to rise more than 320% from its current price. Before XRP can target double digits, however, it must convincingly break and close above the region between $3 and $3.65. This region is a structural pivot because it is where previous rallies have lost momentum If ETF demand is genuine, the first sign of it will be whether XRP can push above the $3 line and hold it as support. Such a move would confirm that new inflows are not being neutralized by selling pressure and that the buying pressure is absorbing tokens at a faster rate than they are being distributed. Related Reading: Analyst Says Don’t Get Left Behind As Massive Liquidity Wave Is Coming For XRP XRP currently has a total circulating supply of 60 billion tokens. Therefore, a move to $4 implies a market cap of $240 billion. On the other hand, a move to $10 implies a valuation above $600 billion. A $600-billion valuation would place XRP behind only Bitcoin in terms of market cap rankings. These numbers matter because ETF impact is not measured by price alone but by how much capital is required to move an asset of this size. If Spot XRP ETFs begin attracting even a small fraction of the inflows seen in early Bitcoin ETF trading, the push to $4 becomes more realistic. At the time of writing, the first US Spot XRP-backed ETF has officially been launched by Canary Capital with ticker XRPC and began trading on the Nasdaq Stock Market on November 13, 2025. Featured image from Peakpx, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP News|ark invest|bitwise|Canary Capital|coinshares|fidelity|Franklin Templeton|grayscale|Hashdex|Invesco|Ripple|Robert Ledferd|Spot XRP ETF|VanEck|xrp|xrp news|XRP Price|XRPC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54405319,
    "published": 1763154238000,
    "title": "Binance adds BlackRock’s BUIDL as off-exchange collateral for institutional traders",
    "body": "The integration marks another step in centralized exchanges adopting tokenized Treasurys, expanding RWA collateral across major trading platforms.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54406266,
    "published": 1763155800000,
    "title": "Bitcoin's 2-year trend is about to collapse: Will bulls defend $90K?",
    "body": "Bitcoin lost multiple critical support areas as data show short-term investors holding on to capitulation-level losses, raising fears of a deeper breakdown in BTC price.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54406436,
    "published": 1763155930000,
    "title": "Bitcoin miners retreat sharply as BTC pulls back from recent highs",
    "body": "Major mining stocks dropped 20%–50% this week, erasing billions in value as the sector continued to lag Bitcoin’s latest pullback.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54407145,
    "published": 1763157635000,
    "title": "Solana Core Evolution: Here’s The Underrated Impact Of The BIT Narrative",
    "body": "Solana is evolving faster than most market participants realize, and it has been celebrated for its blistering speed and low transaction costs. The BIT narrative movement within the SOL ecosystem is quietly driving a core evolution of the platform, cementing the network’s position as a leading blockchain. How BIT Is Reshaping The Solana Infrastructure BIT is quietly becoming one of Solana’s most underrated narratives right now. An analyst known as CryptoDoc has revealed on X that Bitdealernet is building an asset-backed meme launchpad, where every token launch on their platform is tied to real iGaming products with millions of active players. Related Reading: Solana DEX Volume Hits $5B as Best Wallet Token Surpasses $16.9M The project has integrated directly with major Solana Decentralized Finance (DeFi) platforms, including Meteora and Jupiter, which gives the token instant access to SOL’s premier DeFi tools. Additionally, it has established direct connections with popular trading platforms, including Axiom, Bonkbot, Photon, and BullX; an integration that provides liquidity, reach, and utility from day one. This project leverages over 4 million users across its gaming ecosystem this year alone. With the corporation of KOL rev share mechanics, which creates powerful incentives that align with the entire ecosystem to be deflationary by design. These features are why this looks like the next evolution of meme economics. According to cryptoDoc, this is not just another meme, but it’s a meme with a business behind it, and BIT is setting the new standard for sustainable meme tokens. Strategic Deployment Of The Bitdealer App Chain An X analyst, BCBlueSkyVC, has also mentioned that Bitdealer may still be in its early stages, but the vision it is building toward is undeniably massive. While Bitdealernet is currently laying its foundational pieces, the roadmap reveals a bold, structured direction with important steps. Related Reading: Western Union Reveals Plans For USDPT Stablecoin On Solana, Set To Debut In 2026 The rollout of the Bitdealer App Chain is creating its own dedicated infrastructure for the ecosystem and expanding the iGaming catalog to diversify the iGaming experience. This launching of NFT-based Player Profiles innovation transforms user identity into valuable digital assets, increasing transparency in token management and strengthening community trust. If executed with precision, Bitdealer could evolve into a segment-defining platform where meme culture meets iGaming utility and DeFi incentives to create a unified Web3 experience. The project’s vision is bold, and its direction is clear, which will make crypto a fun and transparent space to be in that truly rewards real users, not just speculators. Bitdealer is not simply building another launchpad, but it’s creating a cultural-financial hub on Solana, where digital culture, gaming, and decentralized finance resonate in oneness to reward real users. Featured image from Pxfuel, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Solana|Axiom|BCBlueSkyVC|Bit|Bitdealer|Bitdealer App Chain|Bonkbot|BullX|CryptoDoc|decentralized finance|DeFi|igaming|KOL|NFT|Photon|Sol|SOL news|SOL Price|Solana news|Solana Price|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54408175,
    "published": 1763159400000,
    "title": "SOL drops to 5-month low despite Solana spot ETF success: Is $100 next?",
    "body": "Solana ETFs recorded inflows for 13 consecutive days, but SOL price lost key technical support levels, sparking fears of a drop to $100.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54410234,
    "published": 1763163000000,
    "title": "BItcoin hits 6-month low as AI fears add to risk-off mood: How are pro traders positioned?",
    "body": "The weakness in the AI sector contributed to the crypto market downturn, as spot BTC ETF outflows and isolated selling sent Bitcoin price to a six-month low.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54411084,
    "published": 1763164807000,
    "title": "Solana Air Gap: Analyst Says No Major Support Level Until $24",
    "body": "An analyst has pointed out how a sort of supply “air gap” exists for Solana below $144, with no major on-chain support levels until much lower. Solana URPD Reveals Supply Chasm Below $144 In a new post on X, analyst Ali Martinez has talked about how Solana support is looking from an on-chain lens. In on-chain analysis, the potential of any price level to act as support or resistance lies in the amount of coins that investors last purchased at it. Related Reading: Bitcoin Crashes To $98,000 As HODLer Selling Accelerates The reasoning behind this is that holders look at their cost basis as a special level and are sensitive to retests of it. The more holders that have their cost basis at a particular level, the larger the reaction from a retest could theoretically be. As for what the nature of this reaction is likely to be, it comes down to the direction of the retest, as well as the mood in the market. When the retest occurs from above, holders might decide to accumulate more, thinking that the decline is a temporary dip and they would return in profit again. Retests of major supply levels from above can, for this reason, provide support to the cryptocurrency. Similarly, retests in the opposite direction may be met with resistance, as holders panic exit at their break-even level, fearing going underwater again. To showcase how the supply cost basis distribution on the Solana network is like right now, Martinez has shared the data of the UTXO Realized Price Distribution (URPD) from Glassnode. As is visible in the above graph, the largest Solana supply zones on this indicator are all located above $144. Below this level, the cryptocurrency has relatively thin clusters. “There’s barely any meaningful demand until $24,” noted the analyst. SOL has already started slipping under the last major support level of $144, so it only remains to be seen how the cryptocurrency will develop in the near future, considering the lack of any meaningful on-chain support cushions. Related Reading: Bitcoin Sentiment Most Fearful Since March: Is A Bottom Near? In a separate X post, Martinez has also shared the URPD data for Bitcoin. Unlike Solana, the number one cryptocurrency’s supply distribution is more even, meaning the asset has levels to rely on below the current range. In particular, $82,000 and $67,000 are two levels below $95,000 that hold the cost basis of a significant amount of supply, and thus, could potentially be support barriers on the way down. SOL Price Solana dropped to $135 during its latest plunge, but the coin has since recovered back to $141. Featured image from Dall-E, Glassnode.com, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Solana|Sol|Solana Air Gap|Solana Cost Basis Distribution|Solana Support|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54412122,
    "published": 1763166591000,
    "title": "Crypto oversight by CFTC over SEC is ‘directionally correct’ — Jeff Park",
    "body": "Jeff Park’s pro-CFTC comments come just days after US senators introduced a bill pushing to shift crypto oversight from the SEC to the CFTC.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54413092,
    "published": 1763168435000,
    "title": "Bitcoin Rejection Was No Accident — Now The Battle Shifts To $93,000–$97,000 Survival Zone",
    "body": "Bitcoin’s latest rejection didn’t come out of nowhere; it hit resistance exactly where the charts warned it would. Now, the spotlight shifts to a critical survival zone between $93,000 and $97,000, a range that could determine whether bulls can mount a recovery or if deeper losses are on the horizon. Micro-Resistance Zone Holds Firm, Forcing Another BTC Low More Crypto Online, in a recent update shared on X, pointed out that Bitcoin reacted precisely at the expected level. The micro-resistance zone between $99,386 and $100,972 rejected the price cleanly, a move fully aligned with the current market structure. This rejection led BTC to print yet another lower low, reinforcing the short-term bearish pressure. Related Reading: Bitcoin Supply-Loss Chart Flashes Possible Bottom Signal — Is Reversal Emerging? According to the update, Bitcoin has now reached the next major support zone, an area the analyst has repeatedly emphasized: the 50% retracement of the larger support box near $96,000. This zone is considered a crucial checkpoint, as a reaction here could determine whether BTC stabilizes or continues its descent. More Crypto Online also outlined a smaller internal target zone, derived from the structure of the developing yellow wave 5. To complement this, an extended projection zone between $91,322 and $82,523 was mapped out — an area that aligns perfectly with the broader Elliott Wave structure. While not guaranteed, this projection highlights the potential path BTC may follow if sellers remain in control and no strong bullish reaction emerges from the current support levels. Bulls Must Defend The $93,700–$97,500 Demand Zone According to Crypto Online, Bitcoin is currently sitting inside a crucial decision zone between $93,733 and $97,595. Holding this area is essential, as it represents the last meaningful support before deeper downside targets come into play. A strong reaction within this zone would suggest that buyers are finally attempting to regain control after the recent wave of selling pressure. Related Reading: Bitcoin Price Confronts Major Technical Wall Around $107K, Momentum Starts to Slow If Bitcoin fails to show strength here, Crypto Online warns that the next critical level lies around $91,300. A drop into this area would signal continued weakness and potentially accelerate the bearish momentum. This level becomes even more important because losing it would shift the broader market outlook toward a much more extended corrective phase. Despite the uncertainty, Crypto Online is clear about one thing: a legitimate sign of a local bottom will only emerge once Bitcoin breaks and holds above $100,500 again. Anything below that threshold keeps the overall structure firmly bearish. Even if the price bounces within the current range, it should be considered a short-term move unless buyers manage to reclaim that key resistance and flip market sentiment in their favor. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54423039,
    "published": 1763186438000,
    "title": "Trump’s Sons’ Venture, American Bitcoin, Achieves Profitability In Q3–A Closer Look",
    "body": "In the latest financial report, American Bitcoin (ABTC), co-founded by Eric Trump and Donald Trump Jr., has announced significant profits for the third quarter (Q3) of the year. The company, operating as a miner and buyer of the world’s largest digital asset, experienced a profit boost due to improved margins. American Bitcoin Surpasses Previous Earnings During Q3, American Bitcoin reported a revenue of $64.2 million, showcasing a notable increase compared to the previous quarter. The net income for this quarter reached $3.5 million, slightly exceeding the $3.4 million earned in Q3 of the previous year. Related Reading: By The Numbers: First Spot XRP ETF Achieves Record Launch Amid 900 Competitors Throughout the quarter, the company acquired over 3,000 BTC through a combination of mining operations and strategic purchases, joining companies like Strategy (formerly MicroStrategy) in accumulating Bitcoin and betting on its long-term prospects. As of September 30, American Bitcoin held a total of 3,418 BTC in its reserves. The company significantly boosted its Bitcoin mining capacity by around 2.5 times quarter-over-quarter, adding approximately 14.8 exahash per second (EH/s) to reach a total capacity of approximately 25.0 EH/s by the end of September. In a post-earnings conference call, Eric Trump expressed pride in the company’s growth since its debut on Nasdaq, highlighting the addition of over 3,000 Bitcoin to their reserves and positioning American Bitcoin among the leading public Bitcoin treasuries. Eric Trump also emphasized the success of American Bitcoin’s strategy in the third quarter, underscoring the efficiency of their scalable and asset-light mining operations in generating Bitcoin below market rates. ABTC Stock Surges 5%, Bitcoin Drops Toward $95,000 CEO Mike Ho, in a conference call, highlighted the cost efficiency of American Bitcoin’s mining operations, stating that they mine at a significantly lower cost compared to conventional vehicles that acquire Bitcoin at spot prices. Ho further emphasized the company’s strong performance in the third quarter, showcasing accelerated growth in mining capacity, revenue, and gross margin improvements, he stated: Our third-quarter performance reflects the speed, discipline, and precision with which we are executing against our differentiated Bitcoin accumulation model. We more than doubled our mining capacity, more than doubled revenue, and grew gross margin by seven percentage points quarter-over-quarter. Related Reading: Dogecoin Shows Relative Strength: Breakout Signal Sits At This Price As a majority-owned subsidiary of Hut 8 Corp, American Bitcoin stands as a leading player in the crypto industry, with a strategic focus on efficient Bitcoin accumulation through mining practices. On Friday, the company’s stock, ABTC, surged by 5% toward the $5 mark. Meanwhile, Bitcoin has continued to decline in price since mid-October, reaching $95,328 at the time of this writing — a 24% drop from its all-time high. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|American Bitcoin|American Bitcoin news|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|BTCUSDT|crypto|crypto news|Eric trump",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54427027,
    "published": 1763193626000,
    "title": "Circle Stock Plummets By Almost 70% Post-IPO Debut, Analysts Issue Warnings",
    "body": "Following a notable debut on the Nasdaq earlier this year, Circle (CRCL), the issuer of the USDC stablecoin, has experienced a significant decline in its stock value. After hitting a peak of $298 on June 23, just 18 days post-launch, shares have now dropped by 68%, trading around $82. Circle Faces Challenges As Lockup Period Approaches Despite benefiting from a softer regulatory stance on digital assets in the US with President Trump’s crypto policies, Circle faces challenges that history does not favor, particularly as it approaches the end of its lockup period. Related Reading: Bitcoin Price Tumbles Toward $98,000: What’s Driving The Drop And What Lies Ahead Analysts, including Dan Dolev from Mizuho, highlighted that this lockup period prevents insiders from selling shares, typically for 180 days after an initial public offering. Circle’s initial public offering (IPO) filing indicated that this lockup period is set to expire two days after the company unveils its third-quarter earnings, which is this Friday. Mizuho’s analysis of over 750 IPOs with market capitalizations exceeding $1 billion reveals that 58% of companies that outperform the S&P 500 prior to their lockup period tend to underperform the index in the 180 days following it. These companies see an average decline of approximately 2%. The outlook is even bleaker for firms falling short of revenue expectations in the year after their IPOs, which tend to experience an average negative return of about 10% relative to the S&P 500. Circle may find itself in this latter category according to Mizuho. A significant portion of the company’s revenue comes from the interest on USDC reserves held in short-term US Treasuries, Treasury repurchase agreements, and cash. Consequently, a decline in interest rates or slower-than-anticipated growth of USDC could adversely impact revenue streams. Dolev noted: In our view, CRCL is likely to see downward revisions to consensus estimates over the coming years amid declining rates and less stellar proliferation of its USDC stablecoin, alongside growing distribution costs. Is CRCL A Buy-Low Opportunity? Despite these potential downward adjustments, Circle recently exceeded consensus estimates for both revenue and earnings in its third-quarter report. Related Reading: By The Numbers: First Spot XRP ETF Achieves Record Launch Amid 900 Competitors Following the announcement, JP Morgan issued a double-upgrade for the stock from Underweight to Overweight, raising its price target from $94 to $100. The bank underscored the ongoing acceptance of stablecoins within mainstream financial institutions, with USDC being a leading player in this space. However, the impending lockup expiration has already placed downward pressure on Circle’s stock, according to JP Morgan analyst Kenneth Worthington. He views the current situation as a “buy-low opportunity” for investors, suggesting that the stock’s decline post-lockup may have brought it to levels below its December 2026 price target, indicating potential for future upside. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|circle|Circle CRLC|Circle news|Circle stock|CRCL price|crypto|crypto market|crypto news|cryptocurrency",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54428997,
    "published": 1763197253000,
    "title": "Crypto ‘Pig-Butchering’ Scam Escalating Into A National Security Risk— Study",
    "body": "Chain analysts and law enforcement are sounding the alarm about a type of fraud known as “pig-butchering,” in which criminals groom victims online and push them into fake crypto investments. Related Reading: XRP Earns Academic Praise: University Study Calls It ‘Gold In Your Hands’ According to Chainalysis, crypto scams sent close to $10 billion on-chain in 2024, with pig-butchering revenue growing almost 40% year-over-year and the number of deposits into those scams rising more than 200% — even as the average deposit size fell roughly 55%. These shifts point to a model that now relies on many more victims paying smaller amounts, making the operation both lucrative and hard to trace. Organized Networks Behind The Scams Investigators say these are not lone fraudsters. Reports have disclosed that scam networks operate like organized criminal enterprises, sometimes using trafficked workers in compounds to call, message and manage victims. Victim grooming can span weeks or months, turning emotional manipulation into a steady revenue stream for the gangs. Research and reporting have tied some of these operations to regions in Southeast Asia and to groups that move money through concentrated crypto wallets. AI And Marketplaces Help Scammers Scale Law enforcement and analysts warn that generative AI and service markets are making the pig butchering scams cheaper and faster to run. According to Chainalysis and multiple news outlets, AI tools are being used to create convincing chatbots, voice clones and fake profiles, while online marketplaces sell domain services and hosting that let scammers spin up lifelike investment sites. That combination has helped fraud operators widen their reach and target more people at once. Infrastructure And Sanctions Authorities have started to hit the infrastructure that supports the scams. The US Treasury’s OFAC sanctioned a Philippines-based firm, Funnull Technology Inc., and its alleged administrator for supplying internet infrastructure and tools used by fraud networks. Chainalysis and other researchers tied Funnull’s services to sites used in pig-butchering, and US losses linked to those operations were said to exceed $200 million in some investigations. Sanctions aim to cut off access to the web services scammers use to appear legitimate. Related Reading: Dogecoin Alert! Price Could Explode Over 2,800%, Analyst Says Exchanges And Stablecoin Issuers Help Freeze Illicit Funds Private companies have been part of the response. In a coordinated effort with APAC law enforcement, Chainalysis, exchanges and stablecoin issuers helped trace and block nearly $47 million in USDT that had been consolidated by scammers into a few wallets. Earlier actions involving other cases led to much larger freezes. Those moves show how industry cooperation can stop some cash-outs before criminals convert crypto into fiat. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|btc|chainalysis|crypto|crypto scam|Funnul|pig butchering",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54431670,
    "published": 1763202566000,
    "title": "Robert Kiyosaki says cash crunch driving crash, stays bullish on Bitcoin, gold",
    "body": "Robert Kiyosaki argues a global cash shortage is driving the market crash and says he’s holding Bitcoin and gold, adding he’ll buy more BTC once the downturn ends.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 182,
        "NAME": "BTG",
        "CATEGORY": "BTG"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54431902,
    "published": 1763120617000,
    "title": "XRP ETF debut outshines all 2025 launches with $250M inflows, record volume",
    "body": "Canary Capital’s XRP ETF outperformed all 900 ETF launches of 2025, inspiring a bullish rotation among the industry’s most successful traders, who are now betting on XRP’s price increasing.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54431715,
    "published": 1763120617000,
    "title": "XRP ETF debut outshines all 2025 launches with $250M inflows, record volume",
    "body": "Canary Capital’s XRP ETF outperformed all 900 ETF launches of 2025, inspiring a bullish rotation among the industry’s most successful traders, who are now betting on XRP’s price increasing.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54432432,
    "published": 1763204421000,
    "title": "Bitcoin Price Won’t Crash To $92,000, Here’s Why",
    "body": "The recent Bitcoin price crash below the $100,000 psychological level has fueled a new wave of bearish predictions, yet not everyone is convinced that a deeper decline is imminent. While many traders expect a correction to $92,000, one analyst has rejected the idea of a price breakdown, insisting that Bitcoin still has unfinished upside potential before any significant retracement Why The Bitcoin Price Won’t Decline To $92,000 Crypto analyst @YazanXBT has become one of the loudest voices negating the increasingly popular $92,000 crash target for Bitcoin. The analyst took to X social media on November 13 to inform the crypto community that, rather than a drop to $92,000, BTC is gearing up for a new all-time high of $145,000. Related Reading: Here’s When The Next Bitcoin Parabolic Phase To $297,092 Will Begin The analyst backed up his bullish projection by pointing to a similar moment during BTC’s previous bear market bottom. He stated that at the time, many people were certain that the Bitcoin price would fall to $12,000 or even $10,000. But instead, the cryptocurrency bottomed at $15,800 before staging one of its strongest price recoveries ever. Essentially, @YazanXBT’s message implies that mass bearish consensus is often a signal that the opposite outcome is more likely. In response to his X post, a crypto community member argued that Bitcoin still has an unfilled Chicago Mercantile Exchange (CME) gap at $92,000. They noted that, based on historical behavior, BTC tends to fill CME gaps before making new highs, implying that a crash is imminent. @YazanXBT dismissed the bearish outlook, reiterating that Bitcoin is much more likely to rally to $145,000 before any pullback to fill the $92,000 CME gap. Notably, a surge to $145,000 would require Bitcoin to break out of its current bearish pressures and climb roughly 50% from where it stands. After seeing weeks of capitulation and massive price declines, BTC is now trading slightly above $96,000, showing no apparent signs of a rebound. Analyst Claims BTC Crash Looks Like Manipulation Crypto market expert @CottonXBT shared a detailed price chart, which highlighted Bitcoin’s drop below $97,000 this week. The chart layout, featuring sharp sell-offs and rapid wicks, has led him to call the recent price dip a possible sign of manipulation rather than a genuine trend reversal. The analyst stressed that this type of price action often occurs when large players attempt to shake out retail investors before driving the market higher again. He urges investors to ignore the Fear, Uncertainty, and Doubt (FUD) and buy more BTC. Related Reading: Popular Crypto Trader Reveals Why Bitcoin Price Is Still Crashing Similarly, other market watchers are interpreting Bitcoin’s pullback as a rare opportunity to accumulate below the $100,000 mark. Simon Dixon, the CEO and co-founder of the online investment platform BnkToTheFuture, urged investors to take advantage of current low levels, noting that they will be getting more BTC for their “fiat shitcoin.” Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|@CottonXBT|@YazanXBT|bitcoin|Bitcoin news|bitcoin price|bnktothefuture|btc|BTC news|btc price|btcusd|BTCUSDT|Chicago Mercantile Exchange|CME|fear|Fear Uncertainty And Doubt|FUD|simon dixon|uncertainty",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54432402,
    "published": 1763120617000,
    "title": "XRP ETF debut outshines all 2025 launches with $250M inflows, record volume",
    "body": "Canary Capital’s XRP ETF outperformed all 900 ETF launches of 2025, inspiring a bullish rotation among the industry’s most successful traders, who are now betting on XRP’s price increasing.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54432527,
    "published": 1763120617000,
    "title": "XRP ETF debut outshines all 2025 launches with $250M inflows, record volume",
    "body": "Canary Capital’s XRP ETF outperformed all 900 ETF launches of 2025, inspiring a bullish rotation among the industry’s most successful traders, who are now betting on XRP’s price increasing.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54432128,
    "published": 1763120617000,
    "title": "XRP ETF debut outshines all 2025 launches with $250M inflows, record volume",
    "body": "Canary Capital’s XRP ETF outperformed all 900 ETF launches of 2025, inspiring a bullish rotation among the industry’s most successful traders, who are now betting on XRP’s price increasing.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54432287,
    "published": 1763120617000,
    "title": "XRP ETF debut outshines all 2025 launches with $250M inflows, record volume",
    "body": "Canary Capital’s XRP ETF outperformed all 900 ETF launches of 2025, inspiring a bullish rotation among the industry’s most successful traders, who are now betting on XRP’s price increasing.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]