[
  {
    "id": 56914949,
    "published": 1767750241000,
    "title": "Bitchat dev shrugs off Uganda’s threat to block app: ‘Good luck mate’",
    "body": "Bitchat developer Calle boldly said, “You can’t stop us” as Uganda threatened to block Bitchat ahead of its election next week.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 56915420,
    "published": 1767751239000,
    "title": "XRP Shows “Coiled Spring” Setup As Network Liquidity Hits Record Levels",
    "body": "XRP has regained momentum after reclaiming the $2.20 level and extending its move toward the $2.41 mark, marking one of its strongest advances in recent months. The recovery comes after a prolonged period of selling pressure and uncertainty, and it has reignited bullish expectations among a segment of investors who now believe XRP could challenge or even surpass its all-time high later this year. While skepticism remains across the broader market, price action suggests that XRP is no longer purely defensive. Related Reading: Venezuela, Geopolitical Risk, And Bitcoin: What On-Chain Data Really Shows According to a recent CryptoQuant report, early January brought visible improvement across the crypto sector, with Bitcoin pushing toward $93,000 and XRP moving decisively above $2.30. That synchronized strength helped shift sentiment, as XRP broke out of its prior consolidation range and began showing signs of renewed trend formation. Significantly, the move has not been driven by price alone. On-chain data points to a deeper structural change within the XRP ecosystem. Activity on the XRP Ledger has accelerated sharply, with network growth reaching levels not seen during the previous consolidation phase. This expansion suggests that rising prices are being supported by genuine usage and participation rather than short-term speculation. XRPL Liquidity Surge Signals Structural Shift Behind Breakout The CryptoQuant report indicates a decisive change in XRP’s market structure, driven not only by price appreciation but also by deep shifts in liquidity and participation. One of the most striking developments is the explosion in liquidity on the XRPL decentralized exchange, which has climbed to roughly $173 billion. Rather than thinning out during periods of weakness, liquidity has expanded sharply, suggesting that large players are actively positioning rather than exiting. This behavior is typically associated with preparation for heightened volatility or a more durable trend change. The timing of this expansion is also important. Since mid-December, liquidity spikes have become both more frequent and larger in size, a pattern that aligns with the entry of more sophisticated market makers. This effectively transforms the trading environment, making it easier for whales and institutional participants to deploy size without causing disruptive price swings. In practical terms, XRP is becoming a more efficient market for large-scale capital. Crucially, this liquidity is not idle. Transaction activity on the XRPL DEX has surged, indicating that deeper order books are supporting real usage rather than passive positioning. At the same time, market behavior has shifted toward buyer dominance. Aggressive buying has taken control, while bearish pressure has faded, allowing the price to break out of its prior compression. Forced short covering further reinforced that move and helped propel XRP through key resistance near $2.30. Together, these dynamics suggest that structural improvements, not just speculative momentum, underpin XRP’s recent strength. Related Reading: Memecoin Strength Returns After Historic Market Decline: A Setup For A Comeback? XRP Faces Heavy Overhead Resistance XRP’s daily chart shows a notable shift in short-term momentum after a prolonged period of downside pressure. Price has surged from the December lows near the $1.85–$1.90 zone and is now trading around $2.35, marking a sharp recovery that has caught sellers off guard. Following months of lower highs and lower lows, analysts view this rebound as an early trend reversal attempt instead of a confirmed bullish continuation The breakout above the short-term moving average (blue line) is a constructive development. This level had previously acted as dynamic resistance throughout November and December, consistently rejecting upside attempts. Reclaiming it signals improving momentum and a potential shift in market structure. However, XRP is now approaching a dense resistance cluster between $2.45 and $2.65, where both the 100-day and 200-day moving averages converge. Historically, this zone has attracted strong selling pressure. Related Reading: Bitcoin Data Shows Aggressive Sellers In Control As BTC Consolidates Below $90K While the recent rally shows increased participation compared to late December, it remains well below the levels seen during prior impulsive advances. This suggests that although buyers are regaining control, conviction is still developing. A period of consolidation above $2.20 would help solidify this move. If XRP can hold above the $2.30–$2.35 area, the probability of a broader recovery toward $2.70 increases. Failure to do so would likely result in a pullback, keeping XRP range-bound and vulnerable to renewed selling pressure. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|xrp|XRP analysis|XRP demand|XRP liquidity|XRP network activity|xrp news|XRP Price|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56915353,
    "published": 1767750818000,
    "title": "US community banks join campaign to shut a GENIUS Act ‘loophole’",
    "body": "The Community Bankers Council has asked the Senate for a crypto market structure bill that will ban exchanges and others offering interest on stablecoins.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56915624,
    "published": 1767751663000,
    "title": "Asia Morning Briefing: Bitcoin holds steady above $90K as fresh money returns to crypto",
    "body": "New-year allocations support bitcoin prices as leverage cools and volatility expectations rise.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|btc|Bitcoin News|ETH|Ether|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56917147,
    "published": 1767754807000,
    "title": "Bitcoin Accumulation: Data Shows Institutions Are Net Buyers Again",
    "body": "After a phase of net Bitcoin selling, on-chain data suggests institutional entities have started accumulating the cryptocurrency once more. Bitcoin Rose Over 41% The Last Time Institutions Turned Into Net Buyers As pointed out by Capriole Investments founder Charles Edwards in an X post, institutions have once again turned into net buyers of Bitcoin. Below is the chart shared by Edwards that shows the trend in institutional behavior over the last few years. From the graph, it’s visible that institutional investors switched their behavior to selling back in October as Bitcoin observed a bearish shift following its price top above $126,000. Related Reading: Bitcoin Miner Capitulation Ends: Hash Ribbons Flash Buy Signal The distribution calmed down as the cryptocurrency stabilized into a phase of consolidation in December, with a turn to positive levels starting to appear. The metric has now grown further in the new year, a potential sign that institutional behavior may really be changing to one of net accumulation. In the chart, the analyst has highlighted the price moves that followed shifts to net buying from these humongous traders in the past. It would appear that, on average, Bitcoin rose 109% after this signal appeared. Though the individual outcomes have seen high variance, ranging from a rally of 390% after the 2020 signal to a drop of 13% in 2024. The last time that the signal appeared was in the first half of 2025 and what followed was a price surge of 41%. It now remains to be seen how the cryptocurrency’s price will be affected this time around. A notable pillar of institutional buying in the sector today is represented by the treasury companies. Like the wider institutional behavior, these entities were also net sellers of Bitcoin late last year, as Edwards has highlighted in another X post. The above chart shows the trend in the 30-day rate of change in the Buy-Sell Ratio associated with BTC treasuries, a metric that compares their cumulative USD buying against selling. It would appear that the indicator has just flipped positive in 2026. “Bitcoin treasury companies just flipped to net buying again,” noted the analyst. Related Reading: PEPE Explodes 62%, But Analyst Warns Of Breakdown Retest Strategy, the largest corporate treasury holder of the cryptocurrency in the world, kept accumulating even as the asset observed its bearish shift. But the buying from the firm wasn’t enough, as the rate of change in the Buy-Sell Ratio still plunged into the negative zone In November. BTC Price Bitcoin has shown a move away from stagnation during the last few days as its price has climbed back to the $93,800 level. Featured image from Dall-E, charts from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin accumulation|Bitcoin Institutional Buying|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56917663,
    "published": 1767755932000,
    "title": "Ethereum Price Upside Story Isn’t Finished Yet, Charts Suggest",
    "body": "Ethereum price started a steady upward move above $3,200. ETH is now consolidating gains and might aim for more gains above $3,300. Ethereum started a fresh increase above $3,150 and $3,200. The price is trading above $3,220 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $3,200 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move up if it clears the $3,265 zone. Ethereum Price Holds Gains Ethereum price started a fresh increase after it settled above the $3,120 zone, like Bitcoin . ETH price gained pace for a move above the $3,200 and $3,220 resistance levels. The bulls even pumped the price toward $3,300. A high was formed at $3,299, and the price is now consolidating gains. It declined a few points to test the 50% Fib retracement level of the recent increase from the $3,181 swing low to the $3,299 high. Ethereum price is now trading above $3,220 and the 100-hourly Simple Moving Average. Besides, there is a key bullish trend line forming with support at $3,200 on the hourly chart of ETH/USD. If the bulls are able to protect more losses below $3,200, the price could attempt another increase. Immediate resistance is seen near the $3,265 level. The first key resistance is near the $3,280 level. The next major resistance is near the $3,300 level. A clear move above the $3,300 resistance might send the price toward the $3,350 resistance. An upside break above the $3,350 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $3,450 resistance zone or even $3,500 in the near term. Downside Correction In ETH? If Ethereum fails to clear the $3,265 resistance, it could start a fresh decline. Initial support on the downside is near the $3,220 level or the 61.8% Fib retracement level of the recent increase from the $3,181 swing low to the $3,299 high. The first major support sits near the $3,200 zone and the trend line. A clear move below the $3,200 support might push the price toward the $3,120 support. Any more losses might send the price toward the $3,050 region. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI – The RSI for ETH/USD is now above the 50 zone. Major Support Level – $3,200 Major Resistance Level – $3,265",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56918350,
    "published": 1767757115000,
    "title": "Bitcoin ETFs come into year 'like a lion’: 600% surge at current pace",
    "body": "US spot bitcoin ETFs attracted over $1.2 billion in the first two trading days of 2026, with analysts projecting annual inflows could reach $150 billion.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56918749,
    "published": 1767758083000,
    "title": "Bitcoin Dips to $92K as Liquidations Top $440M",
    "body": "Bitcoin has slipped from highs near $94,000 as selling pressure returned, exposing the rally’s thin leverage despite improving liquidity.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56918048,
    "published": 1767756421000,
    "title": "CLARITY Act headed for markup next week: Senator Tim Scott",
    "body": "The Digital Asset Market Clarity Act aims to establish a comprehensive framework for crypto market structure in the United States.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56920702,
    "published": 1767762040000,
    "title": "Ether Staking Heats Up As Entry Queue Hits 1.3 Million ETH",
    "body": "According to Beaconcha.in data and market reports, the Ethereum validator exit queue has shrunk to just 32 ETH, with a wait time of about one minute. That is a steep drop from its mid-September peak of 2.67 million ETH — a fall of almost a hundred percent. Markets often react when locked assets are freed up for sale. Right now, that specific source of immediate selling seems to have faded. Related Reading: Crypto Users Lose Far Less To Phishing As Losses Drop 83% – Details Validator Exit Queue Near Empty The exit mechanism limits how fast validators can stop validating and pull out their full stake. With the queue near zero, there is no backlog waiting to cash out. That reduces one form of nervous selling. Validators still earn rewards while queued and can face penalties if they act badly, but the bottleneck that once forced slow exits is gone. Reports show the withdrawal process for partial payouts remains separate, and those smaller payouts continue without affecting the full-exit flow. Entry Queue Hits Fresh Highs Based on reports, the entry queue has climbed to about 1.3 million ETH, its largest level since mid-November. Large operators are sending chunks of ETH into staking. BitMine began staking on Dec. 26 and added 82,560 ETH to the queue on Jan. 3. The firm now lists 659,219 ETH staked, worth roughly $2.1 billion at current prices. BitMine’s wider holdings stand at just over 4.1 million ETH, representing about 3.4% of the total supply and valued near $13 billion. Those moves add real, measurable demand for staked Ether and help explain why fewer validators appear eager to leave. Exchange Balances And Liquidity Exchange reserves for ETH sit at multi-year lows. That matters because when fewer coins are parked on trading platforms, automatic or panic selling becomes harder to pull off. Traders and analysts point to this as a reason selling pressure is easing. Some industry figures have been quoted saying the exit queue is “basically empty,” and that selling pressure is drying up as staking outpaces withdrawals. Still, the market can move by other means — derivatives, lending desks, and off-exchange trades can shift exposure without touching the staking queues. BULLISH: $ETH surpasses Netflix to reclaim its position as the 36th-largest asset by market cap. pic.twitter.com/NetdCcdtSa — CoinGecko (@coingecko) January 6, 2026 Market Cap Milestone And What It Means Meanwhile, in another development, market watchers also noted that Ethereum has moved past Netflix to be the 36th-largest asset by market cap. That headline grabs attention. It says something about investor focus on blockchain assets right now. Related Reading: Bitcoin Wealth Isn’t About Hype—It’s About Time And Stacking, Expert Says But crossing a market-cap threshold is not the same as a direct reason to buy. Valuation rankings change often, and they can be driven by price moves that are themselves shaped by flows, news, or macro shifts rather than a change in the underlying business. Featured image from Pexels, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|altcoins|BitMine|crypto|ETH|Ether|ethereum|validator queue",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56920729,
    "published": 1767762007000,
    "title": "Lloyds leads charge in using blockchain to disrupt UK banking",
    "body": "‘Deposit tokenisation’ could overhaul how customers use their accounts, says chief Charlie Nunn",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      }
    ]
  },
  {
    "id": 56921044,
    "published": 1767762560000,
    "title": "Ethereum blob limit bumps up to 21, boosting network scalability",
    "body": "Ethereum developers have raised the blob limit for a second time in recent weeks, a move that will allow more transactions to be batched via rollups, making them cheaper.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56920913,
    "published": 1767762512000,
    "title": "Solana (SOL) Holds Support Post-Gains, Testing Bull Conviction",
    "body": "Solana started a fresh increase above the $135 zone. SOL price is now consolidating above $135 and might aim for more gains above the $140 zone. SOL price started a fresh upward move above the $135 and $138 levels against the US Dollar. The price is now trading above $135 and the 100-hourly simple moving average. There is a contracting triangle forming with support at $138 on the hourly chart of the SOL/USD pair (data source from Kraken). The pair could extend gains if it clears the $140 resistance zone. Solana Price Eyes Another Increase Solana price started a decent increase after it settled above the $130 zone, like Bitcoin and Ethereum . SOL climbed above the $135 level to enter a short-term positive zone. The price even smashed the $140 resistance. The bulls were able to push the price above $142. Recently, there were a couple of swing moves and the price dipped below the 50% Fib retracement level of the recent upward move from the $136 swing low to the $141 high. Solana is now trading above $138 and the 100-hourly simple moving average. Besides, there is a contracting triangle forming with support at $138 on the hourly chart of the SOL/USD pair. On the upside, the price is facing resistance near $140. The next major resistance is near the $142 level. The main resistance could be $145. A successful close above the $145 resistance zone could set the pace for another steady increase. The next key resistance is $150. Any more gains might send the price toward the $155 level. Downside Break In SOL? If SOL fails to rise above the $142 resistance, it could start another decline. Initial support on the downside is near the $138 zone, the trend line, and the 76.4% Fib retracement level of the recent upward move from the $136 swing low to the $141 high. The first major support is near the $136 level. A break below the $136 level might send the price toward the $130 support zone. If there is a close below the $130 support, the price could decline toward the $120 support in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is losing pace in the bullish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is above the 50 level. Major Support Levels – $138 and $136. Major Resistance Levels – $140 and $142.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Technical analysis|Sol|Solana|solbtc|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56922496,
    "published": 1767765658000,
    "title": "Solana Shatters Records: 2025 Annual Review Reveals New All-Time Highs In Key Metrics",
    "body": "Solana (SOL), one of the foremost blockchains in the cryptocurrency sector, recently released its annual review for 2025, showcasing major growth across several key metrics, including daily active wallets and decentralized exchange (DEX) volume. Seven Solana Apps Break $100 Million Revenue Barrier According to the report issued on social media platform X (previously Twitter) applications built on Solana generated $2.39 billion in revenue, reflecting a year-over-year increase of 46% and marking a new all-time high (ATH). Seven standout applications in particular, including Pumpfun, each surpassed the $100 million revenue threshold in 2025. Additionally, the variety of smaller applications—those earning under $100 million—collectively produced over $500 million in revenue. Related Reading: XRP Surges Towards $2.20: Leading Monday Gains And Driving Crypto ETF Inflows The network’s performance indicators are equally impressive. Solana achieved a revenue of $1.4 billion, demonstrating a 48-fold increase over the past two years. Non-vote transactions reached a new ATH of 33 billion, with a year-over-year growth of 28%. Furthermore, the network averaged 1,054 non-vote transactions per second (TPS) while unique active wallets averaged 3.2 million daily, marking a 50% increase year-on-year. In terms of wallet growth, Solana saw 725 million new wallets. Bitcoin Trading Volume Skyrockets To $33 Billion In terms of asset management, Solana’s stablecoin supply ended the year at $14.8 billion, more than doubling year-on-year. The blockchain facilitated a colossal $11.7 trillion in stablecoin transfers, marking a sevenfold increase over two years. Notably, equities made their debut on Solana in 2025, achieving a supply of $1 billion and trading volume of $651 million. Bitcoin trading volume grew fivefold compared to the previous year, reaching $33 billion and solidifying a new ATH. The total Bitcoin supply also doubled to $770 million. Staked SOL also saw an increase, with 421 million tokens staked, representing an 8% growth and another ATH. Additionally, the introduction of Solana ETFs attracted net inflows of $1.02 billion. SOL-Stablecoin Volume Soars To $782 Billion In the realm of decentralized exchanges, the total DEX volume reached $1.5 trillion, reflecting a 57% year-over-year growth and another all-time high for the network’s annual review. The trading volume for SOL-stablecoins set a record at $782 billion, more than doubling year-over-year. Twelve DEX platforms managed to process over $10 billion in volume, with Raydium leading the way at $347 billion. Furthermore, the artificial intelligence (AI) agent volume reached a new all-time high of $31 billion, along with tokenized asset volume rising to $598 million and project token volume increasing to $86 billion. Related Reading: Bitcoin Reaches $93,000 Amid Renewed Optimism: What To Keep An Eye On This Week In the sectors of memecoins and launchpads, memecoin volume totaled $482 billion, although this represented a slight decline of 10% year-on-year. Launchpads had a successful year as well, with six platforms generating over $1 billion in volume and launchpad revenue doubling year-on-year to $762 million. Trading platforms contributed significantly to Solana’s ecosystem, earning $940 million, a 44% increase compared to the prior year. Moreover, the trading volume processed by these platforms reached $108 billion, up 66% year-on-year. https://www.tradingview.com/x/dPrTZvZ9/ At the time of writing, SOL is trading at $138.50, having recovered by 10% over the past seven days. However, it is still trading 50% below its all-time high of $293, which was reached during last year’s rally. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Solana|crypto|crypto market|crypto news|Sol|SOL news|SOL Price|Solana blockchain|Solana Ecosystem|Solana metrics|Solana network|Solana news|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56922321,
    "published": 1767765300000,
    "title": "4 reasons XRP has just been called the ‘hottest crypto trade’ of 2026",
    "body": "XRP is having an explosive start to the year, driven by strong ETF inflows, bullish sentiment, and declining exchange reserves.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56922873,
    "published": 1767766337000,
    "title": "Ethereum Raises Data Capacity in Latest Scaling Tweak",
    "body": "The update raises Ethereum’s data capacity, easing pressure on rollups and clarifying how the network plans to scale.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56923299,
    "published": 1767767192000,
    "title": "Trump says he’ll be impeached if Republicans lose midterms",
    "body": "US President Donald Trump says he will be impeached by the Democrats if the Republicans fail to win the midterms, which could galvanize resistance to his crypto policy agenda.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56926051,
    "published": 1767772856000,
    "title": "Ethereum Staking Queue Grows: What Does This Mean For ETH Prices Moving Forward?",
    "body": "As Ethereum (ETH) recently reclaimed key levels above $3,200, the dynamics within its staking system have shifted significantly. For the first time in nearly six months, the entry queue for staking Ethereum now exceeds the exit queue, a development viewed by many as a bullish indicator for ETH prices. Currently, a substantial 1.32 million ETH is waiting to be staked, with an average wait time of 23 days, while only about 3,000 ETH are queued for withdrawal, which takes merely an hour, indicating a net increase in locked ETH rather than unlocked coins. Bullish Signals For Ethereum Analysts at Bull Theory suggest that historically, significant spikes in entry queues occur when investor confidence in Ethereum’s long-term potential rises. In contrast, increases in exit queues are often associated with market fear or forced sell-offs. Presently, the landscape shows rising entry demand, decreasing exit pressure, and an overall increase in net lock-up, a combination that has frequently been observed before stronger bullish cycles for ETH. Related Reading: XRP Surges Towards $2.20: Leading Monday Gains And Driving Crypto ETF Inflows Compounding this positive sentiment is the current high level of network activity. Daily transactions on the Ethereum network are trending upwards, indicating that market participants are actively engaging with the platform rather than leaving it. Enhanced network usage leads to increased ETH burning, contributing to a supply crunch that further supports the asset’s value. According to the analysts, institutional investment is one of the notable drivers behind the current surge in staking. In just the past two weeks, BitMine – the public company with the largest Ethereum holdings – has staked around $2.58 billion worth of ETH, signaling a long-term commitment to the asset and suggesting growing institutional interest in the digital asset. Key Factors Suggest A Significant Upswing Ahead This development comes ahead of potential catalysts that could further boost staking demand. While the BlackRock Ethereum staking ETF is still awaiting approval, its eventual green light could grant access to a broader pool of traditional capital, thereby enhancing the overall staking demand for ETH. Additionally, ETH has successfully broken out of a three-month downward trend. If it can reclaim levels between $3,500 and $3,600, the analysts predict that a substantial rally could follow. Related Reading: Bitcoin Reaches $93,000 Amid Renewed Optimism: What To Keep An Eye On This Week As of now, ETH has recovered by 11% in the past two weeks according to CoinGecko data, positioning the token just below these key levels at $3,270. This performance has even surpassed that of Bitcoin (BTC), which has recorded gains of just 6% in the same time frame. Taking into account additional factors such as the anticipated approval of the BlackRock ETF and the potential for regulatory clarity through the passing of the Market Structure Bill, also known as the Clarity Act, Ethereum appears to be in a strong position to experience a significant rally in 2026. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|crypto market|crypto news|cryptocurrency|ETH|ethereum|ethereum news|ethereum price|Ethereum staking|ETHUSDT|Latest Ethereum News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56923141,
    "published": 1767766672000,
    "title": "Wealth transfer may boost crypto adoption among younger investors: Galaxy exec",
    "body": "An industry executive argues that generational wealth transfer could influence crypto adoption patterns over time.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56926683,
    "published": 1767773970000,
    "title": "Crypto traders can now take leveraged bets on silver via Binance Futures",
    "body": "Binance Futures will launch silver perpetual contracts on Wednesday, offering up to 50x leverage on silver priced in U.S. dollars per troy ounce.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Silver|Binance|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56929011,
    "published": 1767778536000,
    "title": "UAE’s dirham stablecoin race widens as RAKBank nets in-principle approval",
    "body": "RAKBank's in-principle nod from the Central Bank of the UAE to launch a dirham-backed stablecoin adds a homegrown bank to the UAE’s stablecoin race.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 56929618,
    "published": 1767780081000,
    "title": "Metplanet valued at three-month high relative to bitcoin holdings after MSCI decision",
    "body": "Select bitcoin treasury equities gained after MSCI removed near-term index exclusion risk.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|MetaPlanet|MSCI|MicroStrategy|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56929623,
    "published": 1767780018000,
    "title": "XRP Rally Reopens The $8–$12 Zone Debate, Says Will Taylor",
    "body": "XRP has jumped roughly 25% off its recent lows (at one point), and Cryptoinsightuk co-founder Will Taylor says the move has reopened the debate over whether XRP is starting a larger impulse that could ultimately point toward the $8–$12 zone or whether it’s a short-term squeeze that needs to cool first. Taylor said he’s “up in the air” on the immediate next step, even as he remains long. His hesitation is rooted in a simple conflict: the lower timeframes look stretched, but XRP has a track record of accelerating after momentum spikes rather than immediately mean-reverting. What The XRP Charts Tell Us On the hourly, Taylor noted XRP’s RSI has repeatedly hit overbought territory and “we’ve crossed bearish on the hour,” a short-term warning that often precedes pullbacks or sideways digestion. On the four-hour, he described RSI as “about as high as I’ve pretty much ever seen it,” and tried to contextualize what happened the last few times XRP got similarly overheated. In one prior episode, he said XRP pulled back briefly, then continued higher by “a further like 36%.” In another, he described a rally sequence where price consolidated and then ran again, adding “another 129%” into the next leg. Related Reading: Same XRP Setup That Led To Over 1,000% Increase In 2017 Is Playing Out Again That’s the core of his dilemma: overbought conditions can be a sell signal in many markets, but Taylor argues XRP’s strongest phases often begin with RSI entering overbought, not ending there. “When XRP’s daily RSI gets overbought, XRP rips in price a lot of the time,” he said, pushing back on the reflex to fade strength. On the daily chart, he highlighted what he sees as a constructive technical shift. XRP has closed above a short-term range that previously capped price for multiple days, and printed its “highest daily close in XRP since the 13th of November.” Taylor emphasized how quickly XRP cleared that ceiling this time: after multiple failed attempts in the prior weeks, “we break straight through.” XRP Price Targets From there, Taylor laid out the upside logic using historical RSI analogs. He said three previous daily overbought signals during the current cycle coincided with major extensions, citing moves of roughly 414% in one instance and 36% and 49% in others. He framed this as pattern recognition rather than prediction: “this is complete fact,” he said, referring to the historical relationship between daily RSI overbought and subsequent upside but he still translated those rough percentages into possible zones. A smaller continuation on the order of ~39% would, in his words, take XRP to around $3.13. A larger extension could revisit all-time highs near $3.66. The most aggressive interpretation, aligned with his broader wave thesis, would move XRP “up towards our goals of like $8 to $12 for this wave.” Related Reading: Only 1 Week Left As XRP RSI Breakout Sets Up $10 Path, Analyst Predicts Structurally, Taylor said the market is at a point where multiple Elliott Wave counts can be argued. He sketched competing interpretations: XRP may be working through an ABC-type move off the lows, may be approaching a fifth wave higher, or could still be in an extended third wave within a larger five-wave advance. “My honest answer is right now I don’t know,” he said. Even without committing to a wave count, Taylor said the “impulsive” character of the rally stands out. He pointed to “the length of these candles supported by volume” across exchanges, arguing the move looks different from earlier, more corrective price action. For him, the practical test is near-term continuation: he wants to see “some more really aggressive candles” over the next day or two to support the idea that XRP is leading a broader leg rather than squeezing and stalling. Liquidity is the other piece he’s watching. Taylor said XRP has “on the hourly taken most of our upside liquidity,” while flagging downside liquidity zones around $1.70 down to $1.66. He said in established trends he would “expect a continuation to the upside,” but those downside pools, combined with stretched RSI and nearby resistance on XRP’s relative pairs, keep him from treating the current level as a clean new entry. Taylor said these mixed signals are why he has considered reducing leverage on his XRP long, noting he is “90% spot.” His bottom line was simple: XRP has delivered “a fantastic aggressive move,” but the next few sessions matter. 29 minutes of $XRP TA. pic.twitter.com/aJ4yiC7Sdr — Cryptoinsightuk (@Cryptoinsightuk) January 6, 2026 If XRP keeps printing strong daily candles and the relative pairs start closing above resistance, his $8–$12 zone framing remains a live bull-case roadmap. If not, the same overbought signals and nearby liquidity pockets increase the odds that XRP first resets through consolidation or a retracement before any larger leg can develop. At press time, XRP traded at $2.25. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|xrp|xrp news|XRP Price|XRP Price Analysis|XRP Technical Analysis",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56929768,
    "published": 1767780096000,
    "title": "Barclays makes first stablecoin investment with stake in Ubyx",
    "body": "Barclays has invested in Ubyx, a US stablecoin clearing platform, marking a major move into regulated digital money and tokenized financial services.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 56930413,
    "published": 1767781331000,
    "title": "Barclays invests in stablecoin settlement firm as tokenized infrastructure advances",
    "body": "Ubyx is building a framework to enable tokenized money to move between issuers and institutions, supporting the exchange and redemption of funds.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Barclays|Stablecoins|Settlement|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      }
    ]
  },
  {
    "id": 56930946,
    "published": 1767782739000,
    "title": "Lloyds Bank completes UK’s first gilt purchase using tokenized deposits",
    "body": "Lloyds enlisted the help of Archax and Canton Network to carry out the transaction.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Archax|Lloyds Banking Group|Tokenization|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 56931377,
    "published": 1767783604000,
    "title": "Bitcoin ETFs Bring The Heat: $1.2 Billion Flows In First 48 Hours—Analyst",
    "body": "Spot Bitcoin ETFs in the US opened 2026 with a burst of cash that surprised some market watchers and encouraged others. Related Reading: Bitcoin Wealth Isn’t About Hype—It’s About Time And Stacking, Expert Says According to Bloomberg’s senior ETF analyst Eric Balchunas, more than $1.2 billion flowed into those funds during the first two trading days of the year. He estimated that if that pace held, annualized inflows could reach about $150 billion — roughly 600% higher than the total for 2025. The spot Bitcoin ETFs are “coming into 2026 like a lion,” Balchunas said. ETF Flows Surge Early According to reports, nearly every major spot Bitcoin ETF saw money coming in during those opening sessions. Balchunas calls this inflow as broad-based. The WisdomTree Bitcoin Fund (BTCW) was one of the few exceptions that did not register the same demand. BlackRock’s iShares Bitcoin Trust (IBIT) was reported to have taken a large share of last year’s buying. The spot bitcoin ETFs are coming into 2026 like a lion, +$1.2 in flows in first two days of year w/ everyone eating. That’s a $150b/yr pace. Told ya’ll if they can take in $22b when it’s raining, imagine when the sun is shining. pic.twitter.com/YdRaLN0Op7 — Eric Balchunas (@EricBalchunas) January 6, 2026 Traditional Measures Fell Short Last Year Last year, spot Bitcoin ETFs recorded net inflows of over $21 billion. That was down from $35 billion in 2024. Yet Monday’s single-day net inflow of $697 million was the biggest daily intake in three months, and it came as Bitcoin traded back above the low $90,000s. Trading volume rose and some positions that had bet on a price drop were closed, which added to the move. Institutional Moves And New Filings Reports show Morgan Stanley filed with the SEC to offer both Bitcoin and Solana ETFs, a step that puts a major wealth manager alongside established issuers. Balchunas pointed out Morgan Stanley manages about $8 trillion in advisory assets and has already cleared its advisors to allocate to such products. The firm’s proposed Bitcoin trust, according to the filing, would track the spot price and avoid leverage or derivatives. How The Flows Affect The Market Analysts say ETF demand is likely to soak up circulating Bitcoin supply. If sustained, that dynamic could change how much liquidity is available to traders and might reduce the amount of BTC offered on exchanges. There was an early sign of unevenness: preliminary figures showed a large outflow from one Fidelity fund on Tuesday, which raised the chance of a net outflow for the day once all data were in. Related Reading: Ether Staking Heats Up As Entry Queue Hits 1.3 Million ETH Bitcoin Price Amid Geopolitical Noise Meanwhile, Bitcoin’s price held its ground after geopolitical headlines involving Venezuela and the capture of its leader, Nicolas Maduro, by US special forces. The top crypto asset kept its composure around the low $90,000s and climbed past $93,000 at moments. Traders and analysts pointed to short position liquidations and a rebound in other risk assets as reasons for the lift. Some on-chain observers flagged accumulation by larger holders, while others said markets were treating the news as concluded rather than as a fresh shock. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bicoin|btc|btcusd|crypto|digital currency|etf",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56932099,
    "published": 1767784999000,
    "title": "Morgan Stanley files for ether trust after bitcoin and solana ETF push",
    "body": "The Wall Street giant is widening its crypto push, following bitcoin and solana ETF filings with a potential ether trust.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Morgan Stanley|Ether|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56931938,
    "published": 1767784635000,
    "title": "Bitcoin slides toward $91,000 with two CME pricing gaps coming into focus",
    "body": "Unfilled price gaps in futures and ETFs are emerging as key downside reference levels for bitcoin as weakness emerges.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|CME Futures|Bitcoin ETF|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56932805,
    "published": 1767786140000,
    "title": "Stablecoins become core market plumbing in Moody’s 2026 outlook",
    "body": "Moody’s says stablecoins and tokenized deposits are evolving into institutional “digital cash,” with trillions in onchain settlement volume and billions in infrastructure investment.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 56932492,
    "published": 1767785746000,
    "title": "Crypto Markets Today: Bitcoin slides as Asia-led sell-off hits altcoins",
    "body": "Bitcoin fell during Asian trading hours after failing to break above $94,500, dragging the wider crypto market lower.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|Derivatives|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56933579,
    "published": 1767787687000,
    "title": "Nike sells its NFT and virtual sneakers amid lack of digital art market interest: report",
    "body": "Deal follows NFT shutdown as Nike retreats from digital collectibles amid cooling market demand",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Web3|Nike|RTFKT|NFT|NFTs|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 56934177,
    "published": 1767789018000,
    "title": "Catalysts That Suggests The Dogecoin Price Rally Could Continue",
    "body": "Several catalysts have emerged that point to a sustained upward momentum for the Dogecoin price. This comes amid DOGE’s 26% gain to begin the year, with the meme coin now looking to break above the $0.15 resistance. Factors That Could Contribute To A Sustained Dogecoin Price Rally One factor pointing to a sustained Dogecoin price rally is the recent inflows into DOGE ETFs. SoSoValue data show that Bitwise and Grayscale’s funds have recorded net inflows on two of the three trading days this year. Notably, the Dogecoin ETFs recorded inflows of $2.30 million and $1.60 million on January 2 and 5, respectively. This marked the first consecutive daily net inflows since December 3 last year. Related Reading: Analyst Says the Worst Is Over For Dogecoin, Predicts Rally To $0.8 The daily net inflows into the DOGE ETFs indicate a renewed interest among institutional investors in the meme coin, which is a positive for the Dogecoin price. DOGE could see a sustained rally if the inflows into these funds continue. Notably, Bloomberg analyst Eric Balchunas noted that a 2x Dogecoin ETF has had the best start to the year among all ETFs, up almost 40%. Furthermore, activity in the derivatives market also supports a sustained rally for the Dogecoin price. CoinGlass data shows that traders on top exchanges such as Binance and OKX are currently long. The long/short ratio on Binance is 2.06, well above 1. The long/short ratio for top traders on Binance is at 2.5, which is also a huge positive. Further data from CoinGlass also shows that the derivatives trading volume has surged over 2% to $5.60 billion. However, open interest has dropped by almost 7% to $1.78 billion, likely due to the market volatility as long positions were wiped out. DOGE Eyes Break Above $0.15 Crypto analyst ZiP stated in an X post that on the daily chart, the Dogecoin price is currently reacting to a local resistance at around $0.15. He further remarked that if the $0.15 resistance breaks, the next zone that the DOGE price may aim for is around $0.24. The analyst noted that this is where the first significant Fibonacci level, measured from the entire bearish move, is located. Meanwhile, ZiP mentioned that an additional reference point is the daily pivot at $0.1288, which he noted in the short term defines the market’s equilibrium level. Crypto analyst Trader Tarigrade revealed that the Dogecoin price has broken out of a falling wedge, showing strong upward momentum. Based on this, he predicted that DOGE is ready for a major surge, although he warned that the meme coin might retrace briefly. Related Reading: Dogecoin Price Could Rally To All-Time Highs If It Breaks This Resistance Level At the time of writing, the Dogecoin price is trading at around $0.148, down over 2% in the last 24 hours, according to data from CoinMarketCap. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|Binance|bitwise|bloomberg|Coinglass|CoinMarketCap|doge|DOGE news|Doge price|Dogecoin ETFs|Dogecoin news|dogecoin price|dogeusd|dogeusdt|Eric Balchunas|ETFs|grayscale|OKX|SoSoValue|Trader Tarigrade|ZiP",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56934213,
    "published": 1767788997000,
    "title": "Morgan Stanley adds Ethereum staking ETF filing to growing crypto lineup",
    "body": "The investment banking giant is seeking to capture additional yield from the proposed ETF’s Ether holdings via staking, as institutional investors launch more regulated crypto funds.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56934993,
    "published": 1767790538000,
    "title": "Nike offloads RTFKT months after investor lawsuit: Report",
    "body": "The reported divestment follows Nike’s closure of its digital collectibles unit and comes as market pressures continue to weigh on NFTs.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 56935200,
    "published": 1767790998000,
    "title": "Morgan Stanley Adds Ethereum Trust To Planned Crypto ETF Lineup",
    "body": "The bank has filed a Form S-1 with the U.S. SEC for an Ethereum Trust, on the heels of its applications for Bitcoin and Solana ETFs.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56935321,
    "published": 1767790978000,
    "title": "JPMorgan targets Canton Network for next phase of JPM Coin",
    "body": "JPMorgan’s Kinexys unit is taking JPM Coin beyond its existing rails, planning a native launch of the US dollar deposit token on the Canton Network.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 56936372,
    "published": 1767793389000,
    "title": "Babylon Labs raises $15 million from a16z crypto to develop Bitcoin collateral infrastructure",
    "body": "Funding will be used to build and scale Babylon Trustless BTCVaults, enabling native bitcoin to be used as onchain collateral without custodians or wrapping.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Babylon|A16z crypto|Fundraising|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56936293,
    "published": 1767793175000,
    "title": "Morning Minute: Morgan Stanley Files for Bitcoin, ETH and Solana ETFs",
    "body": "Major banks are beating down the doors to get into the crypto game, and Morgan Stanley just became the first major player to make an ETF move.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|||Opinion",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56936914,
    "published": 1767794403000,
    "title": "Bitcoin, ETH, Dogecoin Rally Faces 3 Key Checkpoints: Bitwise CIO",
    "body": "Crypto entered 2026 with a sharp bid, and Bitwise CIO Matt Hougan says the next leg higher hinges on three checkpoints that have less to do with chart patterns and more to do with market plumbing, Washington, and the broader risk backdrop. In a January 6 memo, Hougan wrote that Bitcoin and Ethereum were each up 7% year-to-date as of Monday, January 5, while higher-beta names had moved faster, Dogecoin was up 29% over the same window. The question, he argued, is whether that early strength can turn into something sustained rather than a fleeting January pop. Three Hurdles To Overcome For Bitcoin, ETH And Dogecoin Hougan’s framework starts with a memory the market would rather bury: October 10, 2025, when crypto saw what he called “the largest liquidation event in its history,” with “$19 billion in futures positions wiped out in a single day.” The mechanical damage mattered, but the psychological overhang may have mattered more. In the weeks that followed, he wrote, investors worried the cascade had “impaired major market makers and/or hedge funds—perhaps fatally,” raising the specter of forced selling as large players unwound. “One of the reasons crypto struggled to rally in Q4 was that investors worried one of these big players might have to wind down operations, a process that typically requires the forced sale of assets,” Hougan wrote. “These potential sales hung over the market like a heavy fog.” Related Reading: Bitcoin Accumulation: Data Shows Institutions Are Net Buyers Again His first hurdle, then, is simply the absence of another blow-up with similar systemic implications. On that front, he struck a notably confident tone. “The good news: If it were going to happen, it probably would have happened by now,” he wrote, adding that while “there’s no guarantee,” a firm shutting down would likely have tried “to wrap up by year’s end.” In his read, part of the early-2026 rally reflects a market that has “put October 10 in the rearview.” He labeled that hurdle a “Green Light.” The second checkpoint is legislative, and far less within the market’s control: passage of the crypto market structure bill known as the CLARITY Act. Hougan wrote the bill is “winding its way through Congress,” with the Senate “targeting January 15 for markup,” the stage where committees align drafts and try to move a final bill toward a vote. He did not present it as a clean glide path. “Hurdles remain,” he wrote, citing “competing visions of how to regulate DeFi, stablecoin rewards, and political conflicts of interest.” Still, he framed markup as a pivotal gate: if CLARITY clears that process, it would be “a huge step toward approval.” Related Reading: Bitcoin At A Crossroads: $93,500 Reclaim Holds The Key For Next Move Hougan’s core argument is about durability. “Passage of the CLARITY Act is key to the long-term future of crypto in the U.S.,” he wrote. “Without legislation, the current pro-crypto regulatory tilt at the SEC, CFTC, and other agencies could reverse under a new administration. Passage of the Act would enshrine core principles into law and provide a strong foundation for future growth.” He pointed to signals from both politics and prediction markets. White House crypto czar David Sacks, Hougan wrote, says “we are closer than ever” to passing the bill. Kalshi, he added, puts the odds at 46% by May and 82% by year’s end. Hougan’s own takeaway: “I’m cautiously optimistic.” He tagged this hurdle “Yellow Light.” The third checkpoint is the one crypto traders often prefer to dismiss, until it matters: equity-market stability. Hougan argued the market doesn’t need a roaring stock rally to support crypto, noting “crypto is not highly correlated with stocks.” But he drew a hard line around drawdowns that force broad deleveraging and risk-off positioning. “A sharp collapse—say, a 20% pullback in the S&P 500—would take the shine off of all risk assets in the short term, crypto included,” he wrote. Here, he was explicit about limits: “I can’t claim any special expertise on the equity markets.” While he noted some investors are worried about an AI bubble, he pointed to prediction markets that “see a relatively low probability of a recession in 2026 and a roughly 80% probability of S&P 500 gains.” Like the CLARITY Act, he labeled the equity backdrop a “Yellow Light.” Hougan closed by arguing the setup is constructive if those remaining yellows turn green. “There is a lot to like in the crypto market right now,” he wrote, pointing to growing institutional adoption, surging real-world use cases “like stablecoins and tokenization,” and the market “starting to feel the benefits of the pro-crypto regulatory push that started in January 2025.” If the three milestones fall into place, he added, “2026’s early momentum will have some serious legs.” At press time, Bitcoin traded at $91,717. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|btc|crypto news|doge|Dogecoin|ETH|ethereum",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56936569,
    "published": 1767793500000,
    "title": "IBM’s crypto partner Dfns integrates Concordium for Web3 compliance",
    "body": "Dfns integrated Concordium’s layer-1 blockchain to add identity-verified wallets to its WaaS platform as institutions seek compliant Web3 adoption.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56937402,
    "published": 1767795272000,
    "title": "Former Brazil central bank official unveils real-pegged stablecoin with yield sharing",
    "body": "The stablecoin will be backed by Brazil's National Treasury bonds and offer exposure to the country's interest rate, currently 15%.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Brazil|Stablecoins|Yield|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 56937268,
    "published": 1767795030000,
    "title": "Barclays Invests in US Stablecoin Start-Up Ubyx",
    "body": "The investment shows UK institutions are taking ‘practical steps’ to bring digital money into regulated frameworks, CryptoUK told Decrypt.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 56937170,
    "published": 1767794857000,
    "title": "SEC now fully Republican, set for pro-crypto rulemaking in 2026",
    "body": "The SEC is set to continue last year’s pro-crypto rulemaking, as the commission and other federal agencies are controlled solely by Republicans.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 56938240,
    "published": 1767796982000,
    "title": "Bitcoin price falls despite 'really bullish' MSCI update: What went wrong?",
    "body": "MSCI’s rule change on newly issued shares reshapes passive demand, raising questions over how Bitcoin-linked treasury firms fund future BTC purchases.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56939648,
    "published": 1767799856000,
    "title": "Here’s Why the Bitcoin Price Was Able To Break $94,000",
    "body": "Bitcoin has kicked off 2026 on a good note, starting with the price breaking through the $94,000 barrier in early January, a threshold it hadn’t traded at for weeks. The surge wasn’t the result of a single cause, but rather a convergence of changing power between buying and selling pressure, improving institutional interest, on-chain signals pointing to a stabilizing market, and unexpected political developments in Venezuela that seem to have contributed to an appetite for risk assets. Geopolitical Risk-On Sentiment And Institutional Flows One of the important forces behind Bitcoin’s push towards $94,000 was the willingness among investors to take on risk across global markets, a mood shift that was shaped in part by dramatic political developments in Venezuela. News that Venezuelan President Nicolás Maduro was captured by US forces caused a chain reaction through equities, commodities and crypto, lifting risk-on sentiment as traders assessed the broader economic and geopolitical implications of the event. Perhaps the most interesting news event is the chatter around a potential Venezuelan shadow $60 billion Bitcoin reserve. This backdrop of rising confidence played into a broader return of institutional capital to Bitcoin. US-based Spot Bitcoin ETFs posted significant net inflows at the start of 2026, with $116.95 million coming in on Friday, January 2 and $123.52 million coming in on Monday, January 5. These inflows helped lift the price of Bitcoin back into the low $90,000s and provided traction as buyers stepped in after the new year holiday lull. On-Chain Metrics Shows A Changing Market Tone According to analytical data from Glassnode, Bitcoin’s market structure is stabilizing in the $80,000 to $95,000 range, sell pressure is beginning to fade, and momentum is beginning to recover. Momentum indicators such as the Relative Strength Index have moved into an upper-neutral zone, which shows a build-up in upside potential. Spot liquidity, though still thin, has expanded modestly without signs of speculative excess. Related Reading: Same XRP Setup That Led To Over 1,000% Increase In 2017 Is Playing Out Again Glassnode noted that open interest is rebuilding cautiously and that options markets point to short-term volatility, which is a sign of both increasing participation and lingering sensitivity to profit-taking. On-chain activity also shows a reduction in sell-side aggression alongside modestly improving spot volumes. However, Glassnode noted that structural demand is still subdued, and this places the recovery above $90,000 as a fragile one. Bitcoin Price Momentum. Source: @glassnode on X Related Reading: Early XRP Investors Sell-Offs Keep Price Low, Here’s How They’re Doing It These on-chain activities, alongside news events, worked together to help Bitcoin clear a technical hurdle at $90,000 which served as resistance throughout December 2025. The question now is whether this move signals the start of a sustained advance back above $100,000 or a temporary peak within a still-uneven market landscape. At the time of writing, Bitcoin is trading at $92,780, down by 0.5% from its intraday high of $94,343. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56940115,
    "published": 1767800808000,
    "title": "Crypto selloff accelerates, sending bitcoin back to $91,000",
    "body": "Strategy is an outperformer following MSCI's decision not to exclude the stock from its indices, but any positive reaction was muted by the decline in BTC.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56940804,
    "published": 1767802345000,
    "title": "Tokenization 'supercycle' set to drive crypto’s next leg higher in 2026: Bernstein",
    "body": "After a choppy end to 2025, Wall Street broker Bernstein said crypto markets have likely bottomed and it sees a broad-based tokenization boom reshaping finance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Tokenization|Stablecoins|Coinbase|Circle|Bernstein|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56941064,
    "published": 1767802838000,
    "title": "The Protocol: Ledger customer data breached from Global-e platform",
    "body": "Also: Starknet goes down, Vitalik Buterin's goals for Ethereum and ETH staking queues cleared.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Tech|The Protocol|Newsletters|Ledger|Ethereum News|starknet|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56941011,
    "published": 1767802760000,
    "title": "Fireblocks expands into crypto financial reporting with $130 million TRES acquisition",
    "body": "TRES helps companies generate compliant financial records from blockchain activity, enabling them to meet audit standards and regulatory requirements.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Fireblocks|Infrastructure|acquisition|mergers and acquisitions|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56941743,
    "published": 1767804333000,
    "title": "BNB falls below $900 even after network upgrade, ecosystem developments as market declines",
    "body": "The BNB Chain's layer-2 network, opBNB, recently completed a major upgrade, the Fourier hard fork, which doubled transaction throughput.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|BNB|Technical Analysis",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 206,
        "NAME": "FORKS",
        "CATEGORY": "FORKS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56941461,
    "published": 1767803687000,
    "title": "Blockchain Barely Gets a Mention as AI Dominates CES 2026 Trend Predictions",
    "body": "AI-driven personalization and new monetization models took centre stage, while blockchain was largely sidelined.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      }
    ]
  },
  {
    "id": 56942222,
    "published": 1767805341000,
    "title": "Aptos' APT falls amid a decline in wider crypto markets",
    "body": "The token retreated in quiet trading conditions as it remained tightly coupled with broader crypto market movements.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Aptos|Technical Analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 70,
        "NAME": "APT",
        "CATEGORY": "APT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56942168,
    "published": 1767805229000,
    "title": "Why XRP Is About To Experience A Legendary Next 3 Months",
    "body": "The XRP price exploded from $0.5 in 2024 to over $3 in 2025. In the span of a few months, the cryptocurrency, which had been suppressed, made history and was only a few percentage points away from revisiting its all-time high. According to a crypto analyst, XRP may soon replicate its legendary 2017 rally, potentially reaching a new all-time high in the next three months. XRP To See Parabolic Rally In Three Months Market expert @Cryptobilbuwoo0 has shared a bullish outlook on XRP, pointing to a familiar price structure that closely mirrors the 2017 market cycle. According to the analyst, XRP began its powerful breakout near $3.60 in 2017, then skyrocketed to its ATH around $3.84 in 2018. Related Reading: Standard Chartered Analysts Predict 330% XRP Price Surge After This Happens He pointed out that in 2017, once the price broke above the dotted support line, which represented a long rising diagonal trend on the chart, XRP reached its $3.6 target within a week. Notably, this move delivered gains of approximately 1,184.86%. Based on the rally’s speed and intensity, the analyst suggests that XRP could be poised for another sharp surge, claiming that investors’ lives could change dramatically over the next 2 to 3 months. Notably, @Cryptobilbuwoo0’s chart analysis shows that XRP is already breaking out from a clearly defined base, having held above the same rising diagonal support line from 2017. At the same time, the breakout occurs as price reclaims the 52-week Exponential Moving Average (EMA), a level that previously marked the beginning of strong upside expansion for XRP. Fibonacci Extensions on the chart further highlight the 1.618 level as a key upside target, in line with the 2017 cycle peak structure. The chart also marks TP1 and TP2 zones, where the price paused briefly in 2017 before continuing higher. These shallow pullbacks were quickly bought, signaling strong trend control in the previous cycle. Current projections suggest a strong and sustained upward momentum following XRP’s breakout above the dotted support line. For its first target, price is expected to rally toward TP1 at $23.2, representing a massive 1,183.38% increase. Beyond this level, XRP is projected to continue its rally toward TP2 around $136.3, signaling a potentially historic upside. Remarkably, @Cryptobilbuwoo0’s chart suggests that all of these parabolic moves could unfold before the end of 2026. Momentum Indicators Support Bullish XRP Forecast XRP is currently trading above $2.2, up more than 21% in the past week. Given the cryptocurrency’s historically slow price movements, @Cryptobilbuwoo0’s forecast of a rise to $23.2 and then $136.3 has been met with skepticism within the crypto community. Related Reading: XRP Sees 80% Spike In Major Metric, Why This Matters For Price Appreciation However, the analyst points to momentum indicators at the bottom of the price chart that support his bullish outlook. He showed that in 2017, XRP’s Relative Strength Index (RSI) hit oversold levels just before the price surged dramatically. A similar pattern is appearing in the current market, reinforcing his belief that the next 2 to 3 months could be parabolic. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|@Cryptobilbuwoo0|EMA|Exponential Moving Average|fibonacci extensions|Relative Strength Index|Ripple|RSI|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56942166,
    "published": 1767805200000,
    "title": "Crypto Long & Short: 2026: The year institutions treat crypto as part of their core stack",
    "body": "In this week’s Crypto Long & Short Newsletter, Adeniyi Abiodun predicts that 2026 is the year Wall Street starts building on blockchain, not around it. Then, Andy Baer’s first Vibe Check of the year, reviewing the crypto’s quarterly mood swings in 2025 and the energetic start to 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "CoinDesk Indices|Crypto Long & Short|CoinDesk Indices|Institutional Investment|Institutional Investors|Institutional Adoption|Spot bitcoin etf|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56942613,
    "published": 1767806100000,
    "title": "Trust Wallet’s $7M hack shows where crypto-friendly SMEs may be vulnerable",
    "body": "The $7-million Trust Wallet hack shows why crypto-friendly SMEs are especially vulnerable, highlighting weaknesses in verification, browser extensions and internal controls.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 56943664,
    "published": 1767808412000,
    "title": "Iran Accepting Crypto Payments for Weapons—But This May Not Help It Evade Sanctions",
    "body": "Iran’s Mindex website offers military equipment for purchase, with its FAQ now saying that buyers can contract to pay in crypto.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56943842,
    "published": 1767806714000,
    "title": "XRP spot trading is now live on Hyperliquid with Flare's FXRP listing",
    "body": "FXRP allows XRP to be traded on Hyperliquid's onchain orderbook and can later be bridged back to the XRP Ledger.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56944646,
    "published": 1767810602000,
    "title": "Bitcoin Emerges As A Hedge Amid Rising Global Geopolitical Tensions",
    "body": "As global geopolitical tensions intensify from trade fragmentation and sanctions to regional conflicts and currency weaponization, Bitcoin is increasingly emerging as a hedge outside the reach of politics. In an environment where traditional financial systems are shaped by state power and cross-border capital controls, BTC’s decentralized design is drawing renewed attention as a form of monetary insurance in an increasingly unstable world. Bitcoin’s Performance During Periods Of Instability The geopolitical tension may boost Bitcoin. Walter Bloomberg has noted on X that BTC’s recent rebound suggests rising geopolitical tensions are increasingly pushing investors toward cryptocurrencies. Walter made reference to 21Shares strategist Matt Mena’s statement, who stated that BTC is gaining recognition as a neutral reserve asset, alongside traditional safe havens such as gold and silver. Related Reading: Bitcoin Supply Is Being Absorbed By Powerful Financial Players — What This Means After falling more than 6% last year, BTC has historically avoided back-to-back annual declines, supporting the case for gains this year. BTC was last down 0.3% at $93,740, after reaching a seven-week high of $94,725 on Monday, underscoring its resilience amid heightened global uncertainty. Considering most of the world is ecstatic with 8% annual returns, an analyst known as Juicy pointed out that the idea of doubling your money in one or two years is already an exceptional outcome for most average people. The hard truth is that most people will never hold their BTC long enough before they cash out 3 to 5 times their money, especially when BTC is down 50% in a bear market, because most people are emotionally attached to their money. Generational wealth with BTC is made by holding through multiple 50% bear market drawdowns across decades. The expert stated that his strategy is never to fully sell BTC, but to sell small portions at basic milestones like $250,000, $500,000, and $1 million, or even $10 million, while the main stack will not be sold. Extreme Supply And The Shift In Spot Momentum A trader known as DD highlighted that BTC traded directly into extreme supply just below Monday’s high and was aggressively rejected from there. This move was followed by a sharp push lower and was driven by heavy spot selling, confirming that this area remains a significant supply zone rather than a breakout point. Related Reading: Bitcoin Risks A Year-Long Bear Market If This Happens: On-Chain Data DD recalled the weak weekly low, a level that has now been cleared. The market is now in a phase where the response matters more than a continuation. If the price begins to form local accumulation inside demand, that would present an opportunity to look for long exposure. On the other hand, if BTC bounces back into supply and shows clear signs of weakness, then the short setup will also remain valid. Structurally, losing the $91,000 level will open the door towards the weak monthly low around $87,800, which stands out as the next downside level. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|21Shares|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|DD|gold|Juicy|Matt Mena|silver|Walter Bloomberg",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56944738,
    "published": 1767810452000,
    "title": "Nike Sells NFT Subsidiary RTFKT One Year After Shuttering Unit",
    "body": "Nike Inc. sold its digital products subsidiary, RTFKT, pronounced “artifact,” marking the world’s largest athletic-wear company’s retreat from blockchain collectibles roughly one year after shuttering the business.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NYS:NKE",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 56944643,
    "published": 1767810086000,
    "title": "JPMorgan to issue its JPM stablecoin directly on privacy-focused Canton Network",
    "body": "The Kinexys-led move aims to bring regulated digital cash to a privacy-enabled blockchain for real-time, interoperable finance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|JPMorgan|Stablecoins|JPMCoin|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      }
    ]
  },
  {
    "id": 56944902,
    "published": 1767811121000,
    "title": "Solana Mobile sets Jan. 21 launch date for SKR token, confirms airdrop",
    "body": "The team said that 20% of the total supply has been set aside for users and developers eligible to receive tokens.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Solana News|airdrop|Airdrops|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 204,
        "NAME": "AIRDROP",
        "CATEGORY": "AIRDROP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56946758,
    "published": 1767814925000,
    "title": "Alleged Crypto Scam Kingpin Arrested in Cambodia After $12 Billion Bitcoin Seizure",
    "body": "The alleged mastermind of a major crypto scam ring that stole billions was arrested in Cambodia this week and extradited to China.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56947237,
    "published": 1767816056000,
    "title": "XRP Mirrors Gold’s Trajectory: What A Similar ATH Rally Would Mean",
    "body": "After enduring weeks of capitulation, sustained price declines, and overall market weakness last year, XRP is showing signs of a recovery. The cryptocurrency has rebounded above the $2.2 level after beginning the new year at a low of above $1.90. According to a crypto expert, XRP’s long-term outlook remains significantly bullish. He compares XRP’s projected trajectory to gold’s price movement, predicting a similar historic all-time high rally. XRP Tracks Gold’s Historic Run Market analyst ‘Steph is Crypto’ has stated that XRP is showing a rare chart setup that closely mirrors gold’s macro move between 2023 and 2025. In his analysis shared on X, the crypto expert explained that after a prolonged corrective phase, XRP has completed a clean Wave 4 structure, formed a Falling Wedge, and is now breaking out in a way that reflects early trend expansion behavior. Related Reading: Bitcoin Price Parabola: What’s Different Between The Last Bull Cycle And This One? The analyst shared a parallel chart that illustrated gold’s price action over the years on one side and XRP’s movement and future trajectory on the other. Over the two-day timeframe, XRP has completed an impulsive Wave 1-3, followed by a downward-sloping corrective channel that slopes into Wave 4, ending with a compression typical of a Falling Wedge. Steph is Crypto directly compares this formation and price movement to gold, which went through an almost identical structure earlier between 2022 and 2023. Following this corrective pattern, gold broke out decisively, entering a strong expansion phase that carried the price to new ATHs over the past months. The breakout also led to a sustained rally with minimal pullbacks and consolidation for almost two years. Based on gold’s explosive historic performance, Steph is Crypto has projected that XRP could replicate a similar trajectory in 2026. The XRP chart shows price stabilizing above the Falling Wedge breakout area near the mid-$2 range. From there, the projected path suggests a rapid expansion phase that mirrors gold’s post-breakout trajectory. If XRP replicates this historic run, it implies a new all-time high cycle, with the price potentially skyrocketing toward $37 before the end of 2026 or the beginning of 2027. The visual projection line on the chart shows that XRP could also experience a similar steady price expansion phase with minimal pullbacks along the way. Analyst Says XRP Could Outperform Bitcoin Soon Crypto analyst Matt Hughes has shared a new analysis of the XRP/BTC chart, pointing to a potential shift in long-term price performance. He believes that XRP is gearing up to outperform Bitcoin this year, based on a rate technical signal that just emerged on the trading pair’s chart. Related Reading: Popular Crypto Founder Dumps Millions In Ethereum, Here’s What He’s Buying According to Hughes, an incredibly bullish setup that has not appeared in years is developing on the XRP/BTC chart. He stated that price is about to break above the monthly Ichimoku Cloud for the first time since 2018, when XRP exploded to its current ATH of $3.84. Notably, a successful move above this cloud would signal a deep structural change in the cryptocurrency’s trend, potentially leading to significant relative gains this year. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Ripple|ripple news|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56947469,
    "published": 1767816407000,
    "title": "Polymarket, Dow Jones deal puts prediction markets data in Wall Street Journal",
    "body": "The companies are partnering to make prediction markets available with “dedicated data modules” on Dow Jones-owned websites and some of its print media.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 56948781,
    "published": 1767818915000,
    "title": "Babylon receives $15M from a16z Crypto to expand Bitcoin-native lending",
    "body": "The investment was made through the purchase of BABY tokens to support the development of Babylon’s trustless Bitcoin collateral infrastructure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56949832,
    "published": 1767821429000,
    "title": "Strategist Reveals What Will Drive XRP Price To $100 Per Coin",
    "body": "XRP has opened the year on a firm footing, reversing the bearish momentum that carried it through the closing weeks of last year. Interestingly, one strategist is already pushing the conversation far beyond near-term targets. In a recent post on the social media platform X, BarriC outlined a psychological roadmap that explains how XRP could eventually trade at $100 per coin. This roadmap is built around how investor attitudes start to change as XRP reaches different price levels, which will gradually turn disbelief into C and urgency. Complacency At $2 To Quiet Regret Above $10 BarriC’s model starts with what he described as a dangerous sense of comfort at the lower end of XRP’s price range. Around $2 per XRP, most people assume they will always have access to cheap tokens, which removes any urgency to act. This attitude is evident in XRP’s current price action, with the cryptocurrency trading around $2.25 and slowly grinding higher. Related Reading: Here’s What Ripple Haters Get Wrong And Why XRP Is Set To Explode BarriC projected that even as the XRP price moves back toward $3, a successful reclaim of that level will still fail to generate excitement, because XRP is still seen as ordinary and easy to obtain. That same mindset, according to the strategist, will carry through to $5, where skepticism will start to take over. At that stage, critics begin questioning why XRP is only at $5 if it is truly expected to play a meaningful role in the future of global finance. However, BarriC believes the psychology will start to change once XRP pushes into double-digit territory, although not yet fully. Even if XRP is trading in the $10 to $20 range, most investors will not suddenly rush in but are still more likely to feel a subtle sense of regret mixed with resignation. This is where many convince themselves that XRP has likely reached its peak and that they have already missed the opportunity. BarriC describes this phase as one where people comfort themselves with the idea that at least it wasn’t a move to $100. Why $100 Becomes The Emotional Breaking Point According to BarriC, the fear of missing out is what will ultimately push the price of XRP into triple-digit territory. In his view, once XRP reaches $100, the disbelief will collapse and will be replaced by frustration and urgency, especially among investors who had long accepted the idea that such prices were impossible. Related Reading: XRP Price At $100 Is A liquidity Event Number, What This Means However, that will force latecomers to chase XRP at prices up to fifty times higher than its current price of $2. He extended this logic further by explaining that above $100, buying pressure would no longer be based on excitement alone. At $1,000 per XRP, the motivation will turn into desperation. His most extreme projection is a $10,000 XRP. This is a point of resignation, where investors fully grasp how severely they underestimated XRP’s long-term importance and the scale of the opportunity they once dismissed. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|BarriC|FOMO|Ripple|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56950220,
    "published": 1767822046000,
    "title": "Gate becomes latest crypto exchange to embed AI market intelligence",
    "body": "The new GateAI feature offers automated market summaries and decision-support tools without enabling automated trading.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56951600,
    "published": 1767824906000,
    "title": "Solana Mobile Gears Up to Airdrop SKR Token to Seeker Phone Users—But Not Saga Owners",
    "body": "Solana Mobile announced it will airdrop its native ecosystem token, SKR, to Seeker device users and app developers on January 20.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 204,
        "NAME": "AIRDROP",
        "CATEGORY": "AIRDROP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56952472,
    "published": 1767826803000,
    "title": "SUI Isn’t Done Yet: Weekly Accumulation Holds As Buyers Reload Below",
    "body": "SUI continues to show resilience on the weekly chart, holding firm within a key accumulation zone even after a sharp correction from its highs. Buyers are once again stepping in at lower levels, suggesting reloading rather than distribution, as market structure hints that smart money may still be positioning for a broader upside move. Weekly Structure Holds After Deep 2024 Reset According to Crypto Patel, SUI continues to hold a high-timeframe accumulation zone on the weekly chart following a deep correction from its 2024 highs. The broader market structure points toward a re-accumulation phase, with signs that smart money participation is gradually returning after a sell-off. Related Reading: Analysts Turn Bullish on SUI as Token Extends Gains Amid Renewed Institutional Interest From a technical perspective, several key conditions are aligning. Liquidity has already been swept at the lows, while a strong weekly bullish order block between $1.50 and $1.30 remains intact. A Fair Value Gap (FVG) overlapping with this demand zone further strengthens the case for sustained buyer interest in SUI at these levels. Price action has already responded positively, delivering an approximately 45% bounce from the highlighted entry region. Furthermore, the rising channel structure remains unbroken, and the High-timeframe bias is now slowly tilting bullish as structure stabilizes. Crypto Patel maintains upside targets at $5, $10, and $20. As long as SUI/USDT stays above the $1.20 level, the macro bullish thesis remains valid, which acts as the key line separating continuation from failure. The setup is described as patience-driven, offering attractive risk-to-reward conditions for spot and swing traders willing to let the weekly structure play out. A weekly close below $1.20 would invalidate the bullish outlook, while continued defense of that level keeps the accumulation narrative firmly in play. SUI Remains Locked Within Its Established Structure In an earlier update, CryptoELlTES highlighted that SUI remains confined within the same broader market structure, with price continuing to respect its established range. This behavior suggests that the market has not yet committed to a new directional move, keeping both continuation and rejection scenarios in play. Related Reading: SUI Climbs Into High-Risk Territory As Wave 4 Nears Its Exhaustion Point The rising base has now been tested and defended multiple times, and once again, buyers stepped in aggressively from the lower trendline. Even so, the upper trendline remains intact, and that resistance is the real hurdle standing in the way of a confirmed bullish expansion. A decisive and clean break above that upper boundary would shift the overall tone, signaling stronger conviction and opening the door for sustained upside. However, if price fails at that level, the move risks being classified as just another relief bounce within the range, leaving the market stuck in consolidation and the larger direction still undecided. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "SUI|Crypto Patel|CryptoELLTES|Fair Value Gap|FVG|SUI price|SUIUSD|SUIUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 96,
        "NAME": "SUI",
        "CATEGORY": "SUI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56955878,
    "published": 1767834069000,
    "title": "Crypto credit is starting to look like cash savings accounts: Asia Morning Briefing",
    "body": "Flowdesk says record demand met even deeper liquidity, suppressing volatility across staking, stablecoin lending, making crypto credit markets look more like traditional cash plumbing.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Crypto|Credit|ETH|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]