[
  {
    "id": 58592729,
    "published": 1772247602000,
    "title": "The Distribution Trap: Why Bitcoin’s Reserve Growth Proves Sellers Still Hold The Tape",
    "body": "Bitcoin has reclaimed the $66,000 level and is now attempting to consolidate above it in order to extend its recovery. The move has improved short-term momentum, but structural signals suggest that upside conviction remains fragile. Holding above $66K is technically important, yet the broader supply backdrop may limit the sustainability of further gains. Related Reading: Engine Stalled: How The $8 Billion ‘October Shock’ Left Bitcoin’s Spot Market In A Liquidity Trap According to analyst Axel Adler, cumulative exchange netflows remain a critical constraint. As long as netflows stay positive — meaning more Bitcoin is moving onto exchanges than leaving them — the probability of sustained price expansion remains limited. Recent data from the Bitcoin Exchange Reserve (All Exchanges, Daily) metric reinforces this caution. Since January 14, total BTC held across major exchanges has increased from 2.723 million to 2.752 million BTC, representing a net addition of roughly 28,489 BTC, or about 1% over 45 days. Although the trajectory has not been linear — with a local peak near 2.794 million BTC in early February followed by a partial pullback — reserves have consistently re-established themselves near the upper bound of the range. This stepwise growth structure signals a persistent return of coins to exchanges. Historically, rising exchange balances imply expanding potential sell-side supply. Until reserves break decisively below January’s 2.723 million BTC baseline, structural selling pressure remains embedded in the market. Netflow Regime Shift Signals Structural Distribution The 30-day moving average of Bitcoin exchange netflows provides critical confirmation that the recent reserve growth is not incidental. The transition from -1,187 BTC on January 14 to +628 BTC by February 27 represents more than a short-term fluctuation — it reflects a structural regime shift from accumulation to distribution. When the SMA(30) netflow remains negative, it indicates coins are being withdrawn from exchanges faster than they are deposited, typically associated with accumulation behavior. The steady climb toward zero throughout January, followed by a decisive cross into positive territory on February 1, marks a clear behavioral pivot. The fact that the indicator has held above zero for nearly four consecutive weeks significantly reduces the probability of a false breakout. The mid-February impulse toward +1,069 BTC highlights the intensity of inflows during peak distribution pressure. Although the metric moderated afterward, it did not revert below zero, suggesting that coins continue to migrate toward exchanges at a sustained pace. At an average structural inflow rate of roughly 628 BTC per day, the supply available for potential sale is expanding. Until the SMA(30) decisively flips back into negative territory, exchange-side pressure remains dominant, limiting the probability of a durable bullish regime reestablishing itself. Related Reading: The $2,000 Fault Line: Why Ethereum’s Record Volatility Signals An Imminent Explosion Bitcoin Tests Macro Support After Rejection From Highs Bitcoin’s weekly structure reflects a clear transition from expansion to correction following rejection near the $120K–$130K region. The chart shows a decisive breakdown below the $90K–$95K zone, which previously acted as structural support. That level has now flipped into resistance, confirming a shift in market control. Price is currently consolidating near $66K after a sharp decline, hovering just above the 200-week moving average. This level historically acts as a macro support during deeper corrective phases. Holding above it is technically significant; sustained closes below would likely signal a more prolonged bear cycle. The 50-week moving average has rolled over and is trending downward, while the 100-week average is flattening. This alignment indicates weakening intermediate momentum and suggests rallies may face overhead pressure unless key trend levels are reclaimed. Related Reading: Digital Gold Is Dead: The Institutional Architecture Binding Bitcoin To The Nasdaq In The 2026 Downturn Volume expanded notably during the breakdown phase, pointing to forced liquidations and distribution rather than orderly consolidation. Since then, participation has moderated, implying that panic selling has eased but conviction remains limited. Structurally, Bitcoin sits at a pivotal inflection point. A reclaim of the mid-$80K region would be required to restore bullish structure. Conversely, failure to defend current support could expose deeper liquidity zones below. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|bitcoin bear market|bitcoin decline|Bitcoin news|bitcoin reserve|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58594248,
    "published": 1772251215000,
    "title": "Bitcoin ETF Investors Show Diamond Hands: Only $6.5B In Outflows Since October 10",
    "body": "Spot Bitcoin (BTC) Exchange-Traded Funds (ETFs) have shown strength amid the crypto market’s correction and the flagship crypto’s latest performance. Some experts have praised investors’ resilience, suggesting that the “real story” is not in the recent outflows. Related Reading: Ethereum’s Fate Hangs On This Multi-Year Support – Recovery Or Deeper Pullback Next? ETFs Investors Hold Strong Despite Market Downturn On Thursday, Nate Geraci, co-founder of the ETF Institute, affirmed that Bitcoin ETF investors have “largely displayed diamond hands” during the recent crypto market downturn. The flagship crypto has seen a 48.2% correction from its October 6, 2025, all-time high (ATH), recording five consecutive months of strong bleeding after the October 10 market crash. Since then, spot BTC ETFs have seen about $6.5 billion in outflows, the expert observed, which he considers a “drop in the bucket” compared to the $55 billion in cumulative total net inflows that the category has seen since launching in January 2024. It’s worth noting that crypto-based investment products have seen five weeks of outflows this year, with Bitcoin having the weakest sentiment among major assets amid the negative market sentiment of the past month. According to SoSoValue data, BTC funds have recorded $3.81 billion in net outflows since January 23, starting the week with $203.82 million in outflows on Monday. However, Geraci highlighted potential renewed demand for the investment products as the category sees a three-day streak of consistent inflows. Notably, Bitcoin ETFs have seen over $1 billion in inflows over the past three days, setting the stage for their potential biggest week since mid-January. The ETF expert emphasized that 50% drawdowns “are a walk in the park for long-time BTC investors,” but observed that newer ETF investors also appear unfazed by the current market conditions. “Not first time btc has experienced 50% decline & likely won’t be the last. ETF investors clearly aren’t panicking, though. Apparently buying the dip,” he wrote on X. Bitcoin ETFs Strength Is The ‘Real Story’ Bloomberg Intelligence Senior ETF Analyst Eric Balchunas backed Geraci’s comment, praising the remarkable performance of spot Bitcoin ETFs over the past two years. “As an ETF watcher, you know just how absurd this strength amid a 50% drawdown,” Balchunas stated. “This is the real story, vs focusing on the $6b that came out, which most stories do.” “Further, the narrative that crypto is ‘paying the price’ for getting financialized is absurd. $55b in net new cash in two years is the opposite of paying the price,” he added on X. In a recent interview, the senior analyst observed that the amount of Bitcoin held by ETFs is only down around 6% despite the market pullback. He noted that these types of corrections happen to every asset, including bonds and stocks, before recovering. Stocks have the same thing. Every time stocks go down, I remind myself and then other people that stocks have a 100% perfect record of coming back to hit all-time highs from a downturn. So, why would I worry that much, right? Related Reading: XRP Rally Incoming? Analyst Forecasts March-April Recovery If This Level Breaks Balchunas affirmed that these assets can have “really horrible streaks, but then when they come back around, the flows come back.” He concluded that the price volatility and the negative market sentiment are “the cost of the holy grail returns that most people have gotten.” Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin Diamond Hands|Bitcoin ETF Inflows|Bitcoin ETF outflows|Bitcoin ETFs|bitcoin funds|btc|btc price|BTCUSDT|Eric Balchunas|ETF Expert|Nate Geraci",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58594892,
    "published": 1772252691000,
    "title": "Bitcoin slides to $65,000 in weekend sell-off, with solana, XRP, dogecoin down 6%",
    "body": "The pullback erased most of Wednesday's push toward $70,000 as hot producer-price data and a post-earnings Nvidia decline dragged risk assets lower heading into the weekend.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58595821,
    "published": 1772254833000,
    "title": "Hyperliquid (HYPE) Eyes Native Token Issuance With Latest Upgrade Plan",
    "body": "Hyperliquid (HYPE), one of the largest decentralized exchanges (DEXs) in the crypto sector, is preparing a significant upgrade that could reshape how new projects launch tokens on its platform. The proposal, known as HIP-6, introduces a framework designed to enable permissionless, on-chain token launches without relying on the off‑chain capital-raising methods that many teams currently use. New Hyperliquid Proposal Details of the proposal were shared on social media by James Evans of Reciprocal Ventures. According to Evans, HIP-6 establishes a permissionless token launch auction for new HIP-1 assets, specifically tailored for teams seeking to issue tokens directly on Hyperliquid. The system adapts Uniswap’s continuous clearing auction model to function within Hyperliquid’s central limit order book (CLOB) environment, allowing token launches to occur natively within the exchange’s infrastructure. Related Reading: Jane Street Faces New Lawsuit: Trump Media Calls For Federal Investigation At present, while HIP-1 and HIP-2 already allow permissionless token deployment and automated liquidity provisioning, gaps remain in capital formation and price discovery. Teams launching tokens on Hyperliquid often need to secure funding off chain, manually provide their own liquidity to seed HIP-2 pools, or release tokens into relatively thin order books. These limitations have meant that, despite its technical strengths, Hyperliquid has not yet reached feature parity with other high-performance ecosystems and exchanges when it comes to initial token offerings. HIP-6 is designed to close that gap, though participation will remain optional for projects. By integrating capital raising and liquidity seeding into a single on-chain flow, the proposal aims to simplify the process for founders. Funds raised during the auction would be split automatically between the token deployer and liquidity provision through HIP-2, reducing operational friction and reliance on external arrangements. Auction Structure And Ecosystem Growth A core component of the proposal is its approach to price discovery. Instead of a one‑time auction vulnerable to timing strategies, HIP-6 uses a continuous clearing auction that unfolds over multiple blocks. This structure is intended to determine a fair market price while minimizing the “sniping” and last‑minute bidding behavior often seen in traditional token launches. The upgrade also seeks to strengthen the broader ecosystem around Hyperliquid. By creating utility for aligned quote assets, HIP-6 could contribute to higher total value locked (TVL) in those assets and generate yield for the platform’s Assistance Fund. Related Reading: Circle Tops Q4 Revenue Forecasts, Shares Surge 30% — Key Numbers Inside While HIP-6 addresses how new tokens raise funds and establish initial liquidity, it does not dictate how those tokens create long-term value or how their governance systems operate. Mechanisms such as revenue sharing, buybacks, staking rewards, treasury oversight, or voting rights would remain up to individual projects. Similarly, tokenholder protections—such as treasury lockups, on-chain transparency requirements, or vesting schedules affecting both buyers and team allocations—would need to be built on top of the HIP-6 framework. The proposal’s stated objective is to make the initial auction process as efficient and equitable as possible, leaving post-launch design choices to the creativity of the Hyperliquid community. At the time of writing, HYPE, the platform’s native token, was trading at $27.430, representing a 3% drop over the previous 24 hours. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto|crypto market|crypto news|Hype|HYPE news|HYPE price|Hyperliquid|Hyperliquid (HYPE)|Hyperliquid HIP-6|Hyperliquid news|Hyperliquid proposal|HYPEUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 205,
        "NAME": "TOKEN SALE",
        "CATEGORY": "TOKEN SALE"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58601356,
    "published": 1772264109000,
    "title": "Bitcoin Slides Below $64,000 After Explosions Reported in Tehran",
    "body": "Bitcoin and other digital assets fell sharply after Israel said it launched a preemptive strike on Iran on Saturday.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58602813,
    "published": 1772265629000,
    "title": "Here’s Why Ethereum Slipped Below $2,000 – Details",
    "body": "Ethereum has perhaps taken the largest hit of all the large-cap altcoins in February, with its value dropping by more than 36% over the past month. The second-largest cryptocurrency deepened its woes over the past week, struggling to keep its price above the $2,000 level. On Friday, February 27th, the price of Ethereum fell by more than 5%, falling to just above the $1,900 mark. Interestingly, a recent on-chain evaluation shows the potential reason behind the altcoin’s latest struggles below $2,000. ETH Taker Volume Sees Steady Rise On Friday In a February 27th post on the social media platform, crypto pundit Maartunn revealed the source of the recent bearish pressure witnessed by the Ethereum price. The relevant on-chain indicator here is the Taker Sell Volume, which saw steady spikes across all exchanges throughout Friday. Related Reading: XRP Emerging As Safe Haven? CEO Points To Steady Inflows As BTC, ETH Struggle For context, the Taker Sell Volume metric measures the total volume of sell orders filled by takers (market participants who match existing orders created by market makers) in Ethereum perpetual swaps. Hence, a rise in the indicator can be interpreted as a bearish signal, implying that the market is being flooded with sell orders. As observed in the chart above, the Ethereum Taker Sell Volume rose as high as 105 million ETH on Friday. Now, this puts some context to the fall in the ETH price seen on the day, as the spike in this metric is a sign of heavy selling pressure in the market earlier. The price of ETH, which started the day above the $2,000 mark, soon dropped to around $1,920 as the weekend approached. Ethereum Price Overview As of this writing, the price of ETH stands at around $1,925, reflecting an over 5% decline in the past 24 hours. However, the past week’s action was relatively mild, with the second-largest cryptocurrency losing nearly 2% of its value in the past seven days. The selling pressure witnessed by the Ethereum price over the past day is not new, as it has been the case over the past few weeks. This trend can be seen in the recent performance of ETH exchange-traded funds (ETFs). According to recent market data, the US-based Ethereum ETFs have seen roughly 563,600 ETH (worth nearly $1.13 billion) withdrawn by investors over the past five weeks. This significant ETF outflow highlights the shift in investor sentiment and demand since the last week of January. Market sentiment and demand need to shift optimistically for the ETH price to witness a bullish reversal soon. Related Reading: The $2,000 Fault Line: Why Ethereum’s Record Volatility Signals An Imminent Explosion Featured image from iStock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ethereum|ethereum news|ethereum price|Ethereum taker sell volume|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58606027,
    "published": 1772274363000,
    "title": "Bitcoin could see further downside risks as Iran attacks U.S. bases across Middle East",
    "body": "Tehran launched waves of missiles and drones targeting Israel, U.S. bases, and Gulf allies, with explosions reported in Dubai, Kuwait, and Bahrain.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58607212,
    "published": 1772276400000,
    "title": "Bitcoin sets up potential short squeeze as funding plunges to -6%",
    "body": "Negative funding rates, rising open interest and liquidations point to crowded positioning and heightened derivatives activity.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Funding rate|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58609420,
    "published": 1772280032000,
    "title": "Bitcoin Price Could Bottom Out At $51,000 Based On These Pricing Bands",
    "body": "As February comes to a close, it would be fair to say that the Bitcoin price has had one of its worst monthly performances in over two years. What’s worrisome is that the premier cryptocurrency doesn’t appear to be done, as the bear market roars on. Below are some of the relevant support levels to watch out for over the next few months. MVRV Bands Put BTC Bear Market Bottom At $51,558 In a recent post on the X platform, popular crypto analyst Ali Martinez identified two levels that could be crucial to the future of the Bitcoin price in the coming months. This evaluation revolves around the MVRV (Market Value to Realized Value) pricing bands. Related Reading: The Distribution Trap: Why Bitcoin’s Reserve Growth Proves Sellers Still Hold The Tape The MVRV pricing bands are an on-chain analytics tool that shows the different profitability levels of the investors of a cryptocurrency (Bitcoin, in this scenario). Typically, these pricing bands represent dynamic support and resistance levels, as they compare the current market price to the average realized value of all investors. Hence, the MVRV pricing bands can be useful in identifying potential market tops (in overheated conditions) and price bottoms (of undervalued assets). According to Glassnode data shared by Martinez, the potential bottom in the current Bitcoin bear market lies between $51,558 and $54,703. The purple line (which shows a -1 standard deviation of the MVRV ratio) represents a deep capitulation phase for the market and has always been a point of reversal for the Bitcoin price in past bear markets. As shown in the chart below, the price of BTC got rejected twice at this level in 2022, during the thick of the crypto winter. At the time of publishing his post, Martinez revealed that the purple MVRV band stood at around $51,558. While this suggests that the $51,000 level could be the potential bottom of the current bear market, it is worth mentioning that the MVRV band could shift slightly downward as the price steadily falls. In the unlikely scenario that the Bitcoin price witnesses a turnaround at its current price point, it would have to contend with a key resistance level around $73,726. According to Glassnode’s MVRV pricing bands, the -0.5 standard deviation line represents an accumulation zone, where investors might look to offload their tokens once they break even. Ultimately, these MVRV pricing bands hint at the potential turning points for the Bitcoin price over the coming months. Bitcoin Price At A Glance As of this writing, the price of BTC stands at around $65,800, reflecting an over 2% dip in the past 24 hours. Related Reading: Ethereum’s Market Order Imbalance Hits Record Negatives: $1,850 Is Now The Line In The Sand Featured image from iStock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|Bitcoin news|bitcoin price|btc|btc price|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58611558,
    "published": 1772283600000,
    "title": "Bitcoin's five-month slide: Why BTC is set for worst losing streak since 2018",
    "body": "With BTC down nearly 50% from its peak, analysts are sparring over whether the slump marks early repricing or signals more pain to come.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|ETF|market analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58611672,
    "published": 1772283600000,
    "title": "Why institutions still prefer Ethereum despite faster blockchains",
    "body": "TPS breakthroughs get engineers excited, but TradFi is looking at Ethereum because that’s where the liquidity is, says Kevin Lepsoe of ETHGas.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Features",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58612623,
    "published": 1772285400000,
    "title": "XRP tumbles 9% as break below $1.36 wipes out relief rally",
    "body": "Traders are watching $1.30 as immediate support after heavy-volume selling confirmed a bearish shift.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58612983,
    "published": 1772285843000,
    "title": "11 US senators request federal probe into Binance’s sanctions compliance",
    "body": "Lawmakers urge US regulators to review Binance’s AML and sanctions controls after reports of Iran-linked transactions and potential evasion risks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58613841,
    "published": 1772287256000,
    "title": "Buying Bitcoin? Hold for at least three years to avoid losses, data says",
    "body": "Traders who bought Bitcoin three to five years ago are still up around 90% on average, even after the latest correction.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Market Analysis",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58613732,
    "published": 1772287252000,
    "title": "Bitcoin Has Officially Entered Bearish Territory, And It’s Headed To $35,000; Chart Shows",
    "body": "Bitcoin’s higher-timeframe structure is in an interesting state, according to crypto analyst Crypto Patel, who is of the notion that the cryptocurrency has officially entered bearish territory after breaking a long-term support level at $107,000. Technical analysis of price action on the weekly candlestick price chart shows Bitcoin is now in this bearish territory, with a projection of a deeper correction to as low as $35,000 in 2026. The outlook is based on Fibonacci retracement levels that could determine Bitcoin’s next price move. Bearish Territory Kicked In After Breakdown Below $107,000 The outlook of this technical analysis is based on the premise that Bitcoin entered into bearish territory after the price broke down below a major higher-timeframe ascending trendline around $107,000. This trendline, which is visible on the weekly chart shared by Crypto Patel, acted as dynamic support throughout much of the 2023 to 2025 rally. It connected a series of higher lows and helped sustain the broader bullish structure that ended with Bitcoin reaching a peak price of $126,080. Related Reading: Is Bitcoin Done Or Is This Just The Beginning? Pundit Shares Points To Consider The chart shows the breakdown zone with a red circle, indicating where the price decisively lost that upward support. After the breach, Bitcoin entered into a changed momentum and began printing lower highs. According to Patel, that trendline was the line in the sand, and losing it was when Bitcoin officially entered bearish territory. The market now needs a healthy correction before the next leg up. Fibonacci Levels Point To $44,000 And $35,000 Bitcoin has been on a downward path since the beginning of the year, and the projection is that this will continue until it bottoms out around $35,000. This outlook is based on how much the Bitcoin price corrected in previous cycles. Related Reading: Are Institutions Killing Bitcoin And Ethereum? Here’s How They’ve Fared Since Companies Got Involved For instance, the 2018 bear market saw an approximately 84% decline from peak to trough. Similarly, the 2022 correction erased roughly 77% from its cycle high. In both instances, these deep retracements came before the next major rally. Based on that historical perspective, a move below $50,000 from the current price level would not be unprecedented. Instead, it would fit within Bitcoin’s established cycle behavior. The projected downside targets are derived from Fibonacci retracement levels drawn from the October 2025 all-time high. Two levels stand out clearly on the chart. The first level is the 0.5 Fibonacci retracement, which is currently around $44,000. The 0.5 Fibonacci retracement is a mid-cycle pullback level and has always attracted strong buying interest in previous corrections, making it a possible stabilization point if selling pressure slows down. Should Bitcoin fail to find support near $44,000, then the next level is the 0.618 Fibonacci retracement around $35,000. The expectation is that Bitcoin will eventually bottom at $35,000 even if it fails to hold above $44,000. At the time of writing, Bitcoin is trading at $63,740, down by 6% in the past 24 hours. Featured image from Pngtree, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|Crypto Patel|Fibonacci retracement levels",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58615002,
    "published": 1772289360000,
    "title": "Suspected insiders make over $1.2 million on Polymarket ahead of U.S. strike on Iran",
    "body": "The strikes caused bitcoin’s price to fall and oil futures on Hyperliquid to rise over the regional conflict’s consequences.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Polymarket|Insider Trading|Iran|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 16,
        "NAME": "COMMODITY",
        "CATEGORY": "COMMODITY"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58615876,
    "published": 1772290800000,
    "title": "Bitcoin In The Line Of Fire: Price Dips To $63k As US, Israel Launch Strikes On Iran",
    "body": "The missiles started flying, and so did the sell orders. Within hours of the US and Israel launching coordinated strikes on Iran, Bitcoin had dropped as much as 3.8% to $63,038, Ethereum had fallen nearly 9%, and more than 152,000 traders had been liquidated across crypto markets. With traditional stock and bond markets closed for the weekend, digital assets absorbed the full force of the panic — alone. Related Reading: Bitcoin Sell-Off Slows Down, But The Road To Recovery Is Long — Analyst US And Israel Hit Iran’s Military And Nuclear Sites US President Donald Trump confirmed on Friday that the US had begun what he described as “major combat operations” against Iran, with strikes aimed at the country’s missile systems, naval assets, and nuclear infrastructure. Reports say Israel’s Defense Minister Israel Katz described the operation as a preemptive move, with both governments coordinating the assault. The scale and speed of the attack caught many off guard, and Iran’s response came quickly. The US is carrying out strikes on Iran, two US officials tell CNN. Follow live updates: https://t.co/pG6pfrPwlm pic.twitter.com/vPGeQ9ILHp — CNN (@CNN) February 28, 2026 According to reports, Iran launched waves of missiles and drones targeting not just Israel but American military installations across the Gulf region. A US base in Bahrain was reportedly struck. Qatar and the UAE said their defense systems intercepted projectiles flying over their territory. Explosions were heard in Dubai. Bahrain shut its airspace entirely. Iran’s semi-official Tasnim news agency declared that all US bases and interests across the region would be considered legitimate targets. The conflict, by Saturday morning, had spread well beyond Iranian and Israeli borders. Crypto Markets Take The Hit Traditional Markets Cannot Yet Feel Stocks, bonds, and commodities markets were closed. Crypto was not. Bitcoin trades around the clock, every day of the week, which made it the only major financial market available to absorb the weekend’s fear. The selling was fast and broad. Reports say roughly $128 billion in total market value was wiped across digital assets in the hours following the strike confirmation. Related Reading: Crypto Mixing Is Back — And Criminals Adapted Faster Than The Rules Did Bitcoin fell from around $66,000 to as low as $63,038 before settling near $64,000. Ethereum dropped below $1,850. XRP slid 8% to trade near $1.29. Solana, Dogecoin, Cardano, and Chainlink each recorded losses of between 8% and 12%. According to CoinGlass data, Bitcoin futures liquidations reached approximately $192 million, with futures trading volume surging to around $68.27 billion — a sign that derivatives markets were amplifying the move rather than spot sellers driving it alone. Total liquidations across all crypto assets hit $515 million within 24 hours. The Fear and Greed Index, a widely watched measure of market sentiment, fell to 14 — deep inside extreme fear territory. Featured image from Getty Images, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|btc|crypto|iran|Israel|Middle East|us",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58615624,
    "published": 1772290289000,
    "title": "Former Mt. Gox CEO proposed a rewrite of bitcoin's code to recover $5 billion in stolen funds. Gets quickly shutdown",
    "body": "Mark Karpelès submitted a pull request to Bitcoin Core that would redirect coins that have remained untouched since 2011 to a recovery address controlled by the MtGox trustee, reigniting the oldest debate in Bitcoin.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Tech|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58618043,
    "published": 1772294407000,
    "title": "Bitcoin Historical Cycle Pattern Points To $31,500 Bottom Target – Details",
    "body": "Bitcoin price struggles persist as the premier cryptocurrency is yet to break above the key $70,000 resistance zone, suggesting the market remains at risk of a deeper correction. Notably, popular market analyst Yonsei_dent has shared an observation that backs these bearish investors’ expectations. Related Reading: Bitcoin ETF Investors Show Diamond Hands: Only $6.5B In Outflows Since October 10 Bitcoin Supply In Profit Metric Shows Potential 75% Drawdown In a Quicktake post on CryptoQuant, Yonsei_dent has identified a potential price bottom of the present market cycle, considering the meltdown in recent months. Since October, the leading cryptocurrency has lost over 45% of its market value, with prices dropping as low as $60,000 from an all-time high of $126,000. Using the Supply In Profit on-chain indicator, Yonsei_dent maps out the possible extent of Bitcoin’s price decline when in the bottom zone, based on historical cycle drawdown periods. For context, the Supply in Profit measures the portion of the total circulating Bitcoin whose current market price is higher than the price at which those coins last moved. It’s an important cycle indicator, as the Supply in Profit approaches extreme highs when near cycle tops, and compresses sharply when near cycle lows. Yonsei_dent explains that the duration of Bitcoin Supply in Profit in the bottom zone in 2022 was six months. During this market cycle, Bitcoin had initially hit an all-time high of $69,000 before crashing by 77% to around $15,500. According to the market analyst, if the same length of the bottom phase was placed on the current price chart, it represents a 70%-75% drawdown price projection for the present market cycle. In this case, Bitcoin is expected to find a price low within a range of $31,500 – $38,000, suggesting a further potential 41%-51% decline from the current market prices. Related Reading: Ethereum’s Market Order Imbalance Hits Record Negatives: $1,850 Is Now The Line In The Sand Bitcoin Price Overview At the time of writing, Bitcoin trades at $63,553 following a 5.84% loss in the last 24 hours. Meanwhile, its daily trading volume is up by a minor 0.54% and valued at $40.04 billion. The premier cryptocurrency also reports a negative performance on its weekly and monthly charts, with respective losses of 6.21% and 27.11%. Unless the market bulls convincingly reclaim the long standing $70k resistance, market sentiment is likely to remain fragile and prices vulnerable to additional downside or prolonged consolidation in the near term. Featured image from Unsplash, chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin Supply In Profit|btcusd|BTCUSDT|cryptoquant|Historical Cycle Drawdown|Premier cryptocurrency",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58622414,
    "published": 1772301657000,
    "title": "Vitalik Buterin Lays Out A Plan To Make Ethereum 1,000 Times More Capable",
    "body": "The number sounds almost too big to take seriously. Ethereum co-founder Vitalik Buterin posted a detailed technical roadmap on February 27 outlining how the network could handle up to 1,000 times its current transaction capacity — without pricing out the smaller node operators who keep the system decentralized. Related Reading: Bitcoin Sell-Off Slows Down, But The Road To Recovery Is Long — Analyst The document, which Buterin informally calls the “Strawmap,” breaks the work into three problem areas: execution, data, and state. Near-Term Upgrades Come First The closest item on the list is an upcoming protocol upgrade called “Glamsterdam.” According to reports, one of its key changes introduces block-level access lists — a technical adjustment that allows different parts of a block to be processed simultaneously rather than one after another. Reports also say the upgrade improves how efficiently each 12-second block slot is used, making it safer to pack more transactions into every block without destabilizing the network. Now, scaling. There are two buckets here: short-term and long-term. Short term scaling I’ve written about elsewhere. Basically: * Block level access lists (coming in Glamsterdam) allow blocks to be verified in parallel. * ePBS (coming in Glamsterdam) has many features, of… — vitalik.eth (@VitalikButerin) February 27, 2026 Buterin acknowledged that these changes, combined with better client software, might be enough to reach a stable state on their own. If real usage stays low, he suggested the full 1,000x push could be shelved in favor of other priorities entirely. Zero-Knowledge Proofs Take Center Stage In Longer Plans The more ambitious part of the roadmap involves zero-knowledge Ethereum Virtual Machines, or ZK-EVMs. Rather than requiring every validator to re-run every transaction to confirm it is legitimate, ZK-EVMs allow validators to check cryptographic proofs instead — a far lighter task. According to reports, Buterin’s timeline calls for a small group of validators to begin using this method as early as 2026, with broader adoption potentially following in 2027. If that plays out, the network’s capacity ceiling could be raised significantly without forcing node operators to invest in more powerful hardware. Related Reading: Aave Crosses $1 Trillion In Loans — No Bank Required State Growth Gets Its Own Fix Reports say Buterin flagged state growth as a separate and underappreciated problem. Deploying a large smart contract adds data that every Ethereum node must store permanently — and that accumulated storage gradually raises the cost of running a node at all. His proposed fix tracks state creation gas independently, so it does not count against the regular transaction gas cap. Large contracts could still be deployed, but their pricing would reflect the real long-term storage cost. The 1,000x figure is a long-term ceiling, not a promise for next year. Each phase of the plan depends on the one before it working as intended. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|altcoins|bitcoin|crypto|ethereum|Staking|Strawmap|Vitalik Buterin",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58624679,
    "published": 1772305200000,
    "title": "Bitcoin is stuck in a rut but JPMorgan says new legislation could be the ultimate spark",
    "body": "JPMorgan said the long-awaited Clarity Act would bring regulatory clarity, boost institutional participation and accelerate tokenization across U.S. crypto markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Market Structure Legislation|crypto regulation|JPMorgan|Tokenization|Stablecoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58624743,
    "published": 1772305237000,
    "title": "Ethereum Breakout Alert: Corrective Channel Flip Sparks Impulsive Wave",
    "body": "Ethereum is showing signs of a major breakout after flipping a corrective price channel. This shift suggests the start of an impulsive wave, signaling potential strong upside momentum. Traders should watch for confirmation above key levels as the path for the next leg up begins to take shape. Wave 3 In Motion: Preparing For A Strong Upside Move Charting an expected path for Ethereum on the 4-hour timeframe, Elliott Waves Academy has revealed a significant opportunity to ride a new bullish wave. The price appears to be preparing for a powerful upward surge following a successful breach of its corrective price channel. Related Reading: From Breakdown To Bottoming? Ethereum Tests Key High-Timeframe Support The technical structure indicates that Ethereum is likely forming Wave 3 of (3), with current projections showing the asset reaching a minimum 161.8% extension. However, the internal momentum suggests the potential for the move to extend further, signaling that a major impulsive rally is now officially underway. From a strategic standpoint, any temporary bearish corrections would be viewed as high-probability opportunities for long re-entries. These minor pullbacks serve to reset local indicators while the primary trend remains firmly higher. Traders are currently eyeing the $2,624.14 level as a primary target, with the possibility of a move toward the 261.8% extension if the positive momentum remains sustained. To validate and maintain this bullish scenario, it is critical to see a confirmed breakout and sustained trading above the previous price channel. Staying above this structural boundary will reinforce the upward outlook and provide the necessary support for the next leg of the rally. Ethereum Sweeps Range High: Buyers Step In According to Lennaert Snyder, Ethereum recently reached its all-time high and liquidity, setting the stage for a notable bounce after testing the extremes of its current range. This move reflects a strong recovery following aggressive price action and shows that buyers are actively defending key levels. Related Reading: Here’s Why Ethereum Slipped Below $2,000 – Details For traders looking at local setups, caution is advised. Given the recent massive displacement, it’s best to wait for clearer directional signals before entering positions, ensuring trades align with confirmed momentum rather than chasing volatility. That said, the liquidity captured during this sweep opens up opportunities for hedge strategies. For example, a short position on the opposite side could help mitigate risk while waiting for the market to stabilize. Specific levels, such as the 50% wick fill around $2,110, may present interesting shorting opportunities after a bearish MSB forms. Additionally, similar to Bitcoin, Ethereum left a significant Fair Value Gap (FVG) during the aggressive leg higher, with the 50% level of this gap near ~$1,970. Should the price retest this FVG, it could provide a favorable setup for long entries following a reversal, highlighting potential areas for strategic accumulation. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|bitcoin|Elliott Waves Academy|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|ethusd|ETHUSDT|Fair Value Gap|FVG|Lennaert Snyder",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58630485,
    "published": 1772314213000,
    "title": "Analyst Says XRP’s $15 Target Has Still Not Changed – Here’s Why",
    "body": "Crypto analyst Javon Marks remains bullish on XRP even after its recent price crash below $1.3. The analyst argued that the cryptocurrency’s long-term technical picture points to a potential surge well into the double-digit territory. According to Marks, XRP’s bullish roadmap toward $15 remains unchanged, underscoring his strong confidence in the altcoin’s ability to push past prevailing bearish trends. Related Reading: Bitcoin Sell-Off Slows Down, But The Road To Recovery Is Long — Analyst XRP Double-Digit Price Target Remains Unchanged Sharing his outlook on X, Marks told followers that XRP’s measured move target about $15 remains firmly intact, dismissing recent price weakness as a temporary setback within a much larger bullish structure. His accompanying chart spans over a decade of XRP’s price history, stretching from roughly 2014 through a projected timeline extending well into 2026. Marks’ analysis highlights a recurring pattern that has played out across multiple market cycles. In each instance, XRP formed a descending triangle or wedge formation and then experienced a downturn below a key support level, which the analyst labeled a “false breakdown.” Following this, XRP launched into a powerful parabolic rally to new all-time highs. This sequence of wedge formation and a subsequent false breakdown occurred notably in 2017 and again heading into 2021, each time producing extraordinary gains in the price of XRP. According to Marks, the breakout that materialized in late 2024, when XRP rose from around $0.55 to over $2.2, mirrors the jump in 2017 that preceded a final bull rally to $3.84 in 2018. He argues that this development hints at another tenfold move in this cycle, representing a more than 900% increase in the XRP price. The chart also projects a peak target somewhere between $15 and $18, with a vertical measurement bar illustrating a potential surge of approximately 2,872.31%. Analysts Stay Bullish On XRP As Whales Go Long Analysts’ confidence in the XRP price remains strong despite broader market volatility and recent price dips. Notably, market expert Steph is Crypto has identified a multi-year Cup and Handle pattern on its chart that could trigger a historic surge in XRP’s price. According to the analyst, the upward trendline above the pattern points to a projected rally to the $4 level. This price zone is highlighted as a key resistance area, and a decisive move above it could push XRP to its next target above $30. Interestingly, Steph’s bullish outlook for XRP comes as whales continue to go long on the cryptocurrency. Recent reports from market expert Xaif Crypto reveal that a whale opened a massive $3.34 million long position on XRP. He noted that the whale held $193,000 equity with a 104% margin, essentially going all in with no safety net. Related Reading: Crypto Mixing Is Back — And Criminals Adapted Faster Than The Rules Did This move underscores the whale’s strong confidence in XRP’s bullish potential. However, Xaif Crypto has cautioned that if XRP drops to $1.37, then the whale could lose everything. It’s important to note that the XRP price has already declined below $1.3 and now sits near $1.28 at the time of writing. Featured image from Vecteezy, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoin|bitcoin|crypto|xrp",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58636310,
    "published": 1772323246000,
    "title": "Bitcoin At Historic RSI Lows — Is The Final Flush Already Behind Us?",
    "body": "Bitcoin is trading at weekly RSI levels historically seen near bear market bottoms, signaling that selling pressure may be easing. While confirmation is needed, the market is in a zone often marking late-stage capitulation. The key question: was the recent drop the final flush, or is one last shakeout still ahead? RSI Compression Signals Downside Exhaustion According to crypto analyst Batman, Bitcoin’s weekly RSI has fallen back into the same territory that historically marked prior bear market bottoms. This momentum zone has repeatedly appeared during late-stage capitulation phases, making it a critical signal that the market could be nearing another major turning point. Related Reading: Bitcoin Nears Major Milestone As 100 BTC Wallets Approach Record Levels However, Batman is clear that this does not confirm the bottom is already in, stressing the importance of waiting for proper confirmation before declaring a reversal. Still, he notes that when RSI compresses to these levels on the weekly timeframe, Bitcoin has typically been much closer to a structural low than to the beginning of a fresh collapse. Reflecting on the 2022 bear cycle, Batman points out that once RSI entered this extreme zone, price managed to print one final lower low. However, that move occurred very close to the ultimate bottom, indicating that most of the downside had already played out by the time momentum reached such depressed readings. The analyst concludes that probabilities matter more than precision. From his perspective, when Bitcoin trades at these weekly RSI levels, it historically represents a zone where strategic accumulation becomes increasingly attractive. Bitcoin’s Six Consecutive Weekly Lower Highs — A Rare Signal In a recent weekly Bitcoin analysis, SuperBro pointed out that BTC has now printed six consecutive weekly lower highs, a rare structural pattern. The last time this occurred was during the COVID crash in 2020, a period marked by extreme volatility and eventual macro reversal. Related Reading: Fidelity Thinks Bitcoin May Be Leaving Its 80% Crashes Behind Price is currently slipping beneath the 200-week EMA and the volume Point of Control (POC), though the weekly candle has not yet closed. A reclaim of the POC before the close could trigger a sharp upside reaction and signal that the breakdown attempt is losing strength. Just below current levels sits the rising 200-week SMA, adding another layer of higher-timeframe support. RSI remains at extreme levels, suggesting that momentum is already deeply stretched. When you combine oversold conditions with six straight lower highs pressing into major support, the case for sustained downside continuation becomes less convincing. Beyond the near-term structure, the broader megaphone formation remains intact. If that macro pattern ultimately plays out, its upper trajectory projects potential targets north of $300,000, keeping the long-term expansion thesis firmly on the table despite current compression. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|BATMAN|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|poc|Point of Control|Relative Stremgth Index|RSI|SMA|SuperBro",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]