[
  {
    "id": 56649811,
    "published": 1767194151000,
    "title": "Price predictions 12/31: BTC, ETH, BNB, XRP, SOL, DOGE, ADA, BCH, LINK, HYPE",
    "body": "Several analysts remain bullish on Bitcoin, expecting it to surge to a new all-time high as early as in the first quarter of 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 12,
        "NAME": "BCH",
        "CATEGORY": "BCH"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56653185,
    "published": 1767200021000,
    "title": "Base’s creator coin push sparks builder backlash over favoritism concerns",
    "body": "Builders on Base are pushing back against the network’s close alignment with Zora, arguing the creator-coin narrative sidelines established projects.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Base|Creator Economy|meme coin|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 56653552,
    "published": 1767200461000,
    "title": "Crypto billionaires are among biggest losers of 2025: Report",
    "body": "While Circle CEO Jeremy Allaire increased his net worth by a reported 149%, others like Changpeng Zhao and the Winklevosses saw declines.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 56656140,
    "published": 1767205005000,
    "title": "How an AI-fueled romance scam drained a Bitcoin retirement fund",
    "body": "A divorced investor’s tragic loss reveals how emotional manipulation, combined with AI technology, has weaponized crypto scams into a billion-dollar crime.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56657378,
    "published": 1767207300000,
    "title": "Why JPMorgan’s onchain fund is a big signal for Ethereum",
    "body": "JPMorgan has launched a tokenized money market fund on Ethereum, highlighting how regulated cash products may integrate into onchain settlement and collateral workflows.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56659297,
    "published": 1767211262000,
    "title": "From Bybit to Coinbase: 2025's Biggest Crypto Hacks and Breaches",
    "body": "Crypto firms faced a record $2.72 billion in theft this year as attackers expanded their reach across major exchanges and DeFi platforms.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56660347,
    "published": 1767213271000,
    "title": "US bank upgrades TeraWulf price target, offers bullish mining prediction",
    "body": "A major investment bank said it was upgrading shares of TeraWulf to “outperform,” based in part on its \"build-out\" strategy.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 56661021,
    "published": 1767214849000,
    "title": "Standard Chartered Analysts Predict 330% XRP Price Surge After This Happens",
    "body": "Standard Chartered analysts have predicted that the XRP price could surge by around 330%. They also outlined catalysts that could spark this price surge, which would lead to a new all-time high (ATH) for the Ripple-linked token. Standard Chartered Predicts XRP Price Surge To $8 Standard Chartered’s global head of digital assets research, Geoff Hendrick, has predicted that the XRP price could surge to $8 by the end of 2026, which represents an increase of around 330%. This would also mark a new all-time high for the token, with its current ATH at around $3.84. The analyst expects the token to record such growth, as it now has legal clarity following the settlement of the Ripple-SEC lawsuit. Related Reading: This Double Bottom Formation Could Send XRP Soaring To $2.5 Kendrick also expects the XRP price to surge to $8 on the back of regulatory clarity for the U.S. crypto industry and institutional adoption of the token through the XRP ETFs. The Standard Chartered analyst noted how the improving regulatory environment has made it easier for institutions to gain exposure to the token. Meanwhile, Ripple has been able to grow its payment system, which involves XRP, thanks to the regulatory-friendly environment. These XRP ETFs are notably seeing significant demand, which is bullish for the XRP price as it eyes a rally to $8 next year. SoSoValue data shows that these ETFs have yet to record a daily net outflow since the first spot fund launched last month. The XRP ETFs currently boast a net asset of $1.27 billion, which reprersents 1.12% of the token’s market cap. Crypto pundit Unknow noted that these ETFs are absorbing the supply fast, which is why he predicts that a supply shock could happen by early 2026, sending the XRP price higher. The pundit also declared that next year is the inflection point where the altcoin shifts from speculation to global liquidity infrastructure. XRP Is Preparing For a Breakout In an X post, crypto analyst TARA stated that the XRP price is approaching the critical $1.88 level and is in a very tight range, signaling a breakout is coming soon. The analyst noted that XRP needs to hold support at $1.87, even as Bitcoin approaches $88,000. She added that if the altcoin bounces from here and tests $1.88 again, it could break above that resistance and then hold it as support, which TARA noted would be a very bullish sign. In another X post, she revealed that XRP’s Relative Strength Index (RSI) was trying to break to the upside. TARA further remarked that if today’s close is bullish, with a close above $1.88, it could fuel the next wave to $2.30 for the XRP price. A positive for XRP is that Glassnode data shows that XRP on exchanges has dropped to a seven-year low of 1.6 billion tokens, down from 3.76 billion in October. Related Reading: XRP Hasn’t Entered A Bear Market Yet; Analyst Shares Why At the time of writing, the XRP price is trading at around $1.86, up in the last 24 hours, according to data from CoinMarketCap. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|altcoin|bitcoin|CoinMarketCap|Crypto pundit Unknow|Geoff Hendrick|glassnode|Relative Strength Index|Ripple|RSI|Spot XRP ETFs|Standard Chartered|TARA|US SEC|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56662730,
    "published": 1767218432000,
    "title": "Bitcoin Miner Distribution Re-Emerges: BTC Enters A Fragile Price Phase",
    "body": "Bitcoin has managed to reclaim the $88,000 level, offering a brief sense of stability after weeks of choppy price action. However, the broader picture remains fragile. Since early December, BTC has repeatedly failed to push above the $90,000 threshold, a level that continues to cap upside attempts and reinforce market hesitation. Related Reading: Bitcoin Supply In Profit Sets The Stage For Bullish Cross In Q1 2026 Adding to the cautious outlook, CryptoZeno, a CryptoQuant analyst, points to miner behavior as a growing short-term risk factor. According to his analysis, Bitcoin miner outflows are signaling rising sell-side pressure, a dynamic that has historically mattered during periods of weak momentum. The data shows a clear relationship between miner activity and short-term price movements. Sharp increases in total miner outflows—especially when large volumes of BTC are sent to exchanges—have frequently coincided with local price pullbacks rather than sustained rallies. Miners are often considered informed market participants, typically operating with relatively low cost bases. When their distribution activity increases, it can introduce additional supply at moments when spot demand is already struggling to absorb selling pressure. While miner outflows alone do not define a broader market top, they can amplify short-term weakness, particularly in range-bound conditions like the one Bitcoin is currently facing. Miner Outflows Reinforce Short-Term Downside Risks The report explains that recent spikes in Bitcoin miner outflows have repeatedly been followed by immediate or near-term price weakness, reinforcing the link between miner behavior and short-term market dynamics. These episodes suggest that miners—often considered informed participants with relatively low production cost bases—are actively distributing supply during periods of strength or heightened uncertainty. While a miner selling on its own does not signal a macro market top, it frequently adds incremental supply at sensitive moments, increasing short-term pressure when liquidity is thin, or spot demand is unable to absorb new inflows. CryptoZeno adds that elevated miner outflows typically reflect a combination of factors. These include profit realization after rallies, the need to cover operational expenses, or a defensive response to weakening price structure. From an on-chain perspective, this behavior is not unusual during corrective or range-bound phases. However, when miner transfers to exchanges cluster within a short time window, their impact becomes more pronounced. Concentrated outflows can materially increase sell-side pressure on exchanges, raising the probability of corrective price moves rather than sustained upside continuation. At the macro level, miner distribution becomes especially influential when paired with broader headwinds. Neutral or declining risk appetite, tighter liquidity conditions, or cooling derivatives sentiment all reduce the market’s capacity to absorb additional supply. In such environments, miner-driven selling is less likely to be smoothly digested and can instead amplify downside volatility, keeping Bitcoin vulnerable in the near term. Related Reading: XRP Slides To $1.80 While Binance Reserves Continue To Decline Bitcoin Struggles Below Key Resistance Bitcoin continues to trade in a tight consolidation range after failing to reclaim the $90,000 level, as shown on the daily chart. Following the sharp breakdown in November, price found support in the $85,000–$87,000 zone, where selling pressure began to ease and volatility compressed. Since then, BTC has been moving sideways, signaling indecision rather than a decisive trend reversal. From a technical perspective, Bitcoin remains capped below its declining short-term moving averages. The 50-day moving average continues to slope downward and acts as dynamic resistance. The 100-day and 200-day moving averages sit well above the current price, reinforcing a broader bearish structure. As long as BTC trades below these levels, upside attempts are likely to be sold into rather than sustained. Related Reading: XRP Selling Pressure Returns: Investors Shift From Holding to Distribution After the heavy sell-off in November, trading volume has gradually declined. This suggests that aggressive sellers have stepped back, but new demand has not yet entered with conviction. This typically characterizes a stabilization phase rather than the start of a new impulsive move. Structurally, Bitcoin is forming a base, but confirmation remains absent. A daily close above $90,000 could signal a meaningful shift in momentum. And would open the door for a recovery toward higher resistance zones. Conversely, a loss of the $85,000 support area could expose BTC to another leg lower. For now, the chart reflects balance, hesitation, and a market waiting for a catalyst. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|Bitcoin distribution|bitcoin miner|Bitcoin Miner Dumping|Bitcoin news|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56664328,
    "published": 1767222044000,
    "title": "Expert Says XRP ‘Haters’ Miss The Bigger Picture: Here’s What It Is",
    "body": "A prominent XRP commentator is pushing back on a familiar critique of Ripple’s business model, arguing that skeptics have the causality backwards when they claim the company sells XRP merely to amass traditional assets. In a post on X on Wednesday, CryptoInsightUK founder Will Taylor said the “haters” are “so close to being right,” but miss what he framed as the single step that changes the entire equation. What ‘Haters’ Get Wrong About XRP Taylor’s central claim is that Ripple’s token sales are not designed to swap out a volatile crypto asset for safer, conventional holdings. Instead, he described the sales as a means of funding infrastructure and integrations that ultimately increase the token’s long-term utility and value. “Haters say Ripple sell XRP so they can buy real-world companies and assets, because that’s how Ripple ‘makes money’,” Taylor wrote. “In my opinion, that completely misunderstands the business model and more importantly, the direction of causality. Yes, Ripple monetises some XRP. But not to replace XRP with traditional assets.” In Taylor’s telling, the misunderstanding starts with treating XRP like operating cash rather than a strategic, asymmetric asset. He argued that a large holder of an asset with outsized upside potential would not logically liquidate it simply to “stack normal companies,” especially if that asset could become worth more than the firm’s balance sheet at scale. Related Reading: XRP Becomes Most Bought Digital Asset, Bitcoin And Ethereum Bleed $500 Million “If you hold roughly 40% of an asset that, at scale, could be worth more than your entire balance sheet, you don’t treat it like operating cash,” he wrote. “You don’t say: ‘Let’s sell the most asymmetric asset we own just to stack normal companies.’ That would be insane.” From there, Taylor reframed Ripple’s acquisitions, integrations, and buildout efforts not as a pivot away from XRP but as “multipliers” that increase the odds XRP becomes a viable global settlement instrument. Traditional assets, he argued, are inputs to expand distribution, compliance, and liquidity: conditions that would make a bridge asset more useful at institutional scale. “When Ripple acquires or integrates with firms like Hidden Road, stablecoin infrastructure, or tokenised treasury rails, those assets are not the end goal,” Taylor wrote. “They are multipliers. Those companies are not replacing XRP. They are building the pipes that require XRP to function efficiently.” Related Reading: XRP Still Has A Path To $28 This Cycle, Analyst Says Taylor positioned this as a flywheel: XRP sits at the “strategic core” on the balance sheet, Ripple builds a full stack around payments and liquidity, institutions adopt because the rails are complete, and the token becomes a neutral settlement layer whose demand compounds over time. Under that framework, he said, short-term monetization is better understood as capital deployment in service of a long-term network effect rather than straightforward dilution. “That’s not dilution. That’s capital deployment,” Taylor wrote, adding that if Ripple simply wanted to be “a profitable TradFi-style company,” it would not “obsess over neutral settlement,” keep XRP “architecturally central,” or push it into “regulated institutional rails.” The distinction matters because it changes how observers interpret Ripple’s incentives. In Taylor’s model, the objective is not to sell the token in order to accumulate off-chain assets; it is to use off-chain assets—licenses, liquidity venues, compliance infrastructure, and institutional integrations—to increase XRP’s necessity as a settlement tool. “The endgame is not: ‘Sell XRP to buy assets,’” he wrote. “The endgame is: ‘Use assets to make XRP unavoidable.’” At press time, XRP traded at $1.8773. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|Ripple|Will Taylor|xrp|xrp news|XRP Price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 205,
        "NAME": "TOKEN SALE",
        "CATEGORY": "TOKEN SALE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56665881,
    "published": 1767225634000,
    "title": "Ethereum Liquidity Rebuilds On Binance: December Inflows Signal Strategic Repositioning",
    "body": "Ethereum remains trapped below the critical $3,000 level as price action compresses into an increasingly narrow range. Despite several recovery attempts, bulls have failed to regain control, leaving ETH vulnerable to renewed downside pressure. Market sentiment reflects this weakness, with a growing number of analysts leaning toward a bearish outlook for 2026 as momentum indicators continue to fade and risk appetite remains subdued across the broader crypto market. Related Reading: Bitcoin Supply In Profit Sets The Stage For Bullish Cross In Q1 2026 Amid this fragile technical backdrop, new on-chain data highlights a notable shift in Ethereum’s liquidity structure. According to a CryptoQuant report by analyst Arab Chain, Ethereum reserves on Binance surged to approximately 4.17 million ETH in December. This increase coincided with massive inflows totaling nearly 8.5 million ETH over the month, marking one of the most significant exchange inflow events since 2023. Such a sharp rise in exchange-held ETH suggests a change in investor behavior. Historically, large inflows to centralized exchanges indicate preparation for increased trading activity, hedging, or potential selling pressure, rather than long-term accumulation. While inflows alone do not guarantee immediate downside, they often precede periods of higher volatility, especially when the price is already struggling to reclaim key resistance levels. Exchange Liquidity Rises as Volatility Risks Build The CryptoQuant report emphasizes that the sharp increase in Ethereum reserves on Binance—the world’s largest exchange by trading volume—indicates a significant increase in tradable supply. When ETH moves from cold storage or long-term wallets onto centralized exchanges, it typically reflects a shift toward active positioning. Historically, this behavior has been a key input for assessing short- to medium-term supply–demand dynamics, as higher exchange balances increase the amount of ETH readily available for trading, hedging, or liquidation. However, the report stresses that rising exchange reserves do not automatically translate into immediate selling pressure. In many cases, large inflows are associated with risk management strategies rather than outright distribution. Institutional participants often move assets to exchanges to deploy them as collateral, rebalance exposure, or hedge downside risk through derivatives markets, particularly during periods of macro uncertainty and compressed price action. Still, the scale of December’s inflows stands out. Nearly 8.5 million ETH flowed into Binance over the month, marking the highest net inflows since 2023, with daily net inflows peaking above 162,000 ETH. Such volumes suggest the involvement of large players and point to a potential transition into a more volatile market phase. With Binance commanding a dominant share of Ethereum derivatives trading, this concentration of ETH on the exchange raises the probability of sharp price moves. Whether driven by spot selling or leveraged positioning, elevated exchange liquidity increases the market’s sensitivity to shifts in sentiment, making the current consolidation phase increasingly fragile. Related Reading: XRP Slides To $1.80 While Binance Reserves Continue To Decline Ethereum Price Compresses As Momentum Fades Ethereum price action on the 4-hour chart reflects a market stuck in compression just below the $3,000 psychological level. After a sharp decline earlier in the month, ETH attempted several rebounds but consistently failed to reclaim higher ground, resulting in a tight range between roughly $2,900 and $3,100. This structure signals indecision rather than accumulation, with both buyers and sellers lacking conviction. Technically, Ethereum remains capped below its short- and medium-term moving averages. The 50-period and 100-period averages are acting as dynamic resistance, repeatedly rejecting upside attempts. Meanwhile, the 200-period moving average continues to slope downward, reinforcing the broader bearish trend. As long as ETH trades below these levels, rallies are likely to remain corrective rather than trend-changing. Related Reading: Chainlink Shows Strong Accumulation Signal: LINK Exchange Liquidity Dries Up Trading activity has steadily declined during the consolidation phase, indicating reduced participation and growing apathy. The absence of strong volume expansion on upside moves suggests that buyers are not aggressively stepping in, even near key support. Structurally, the $2,900–$2,950 zone is acting as short-term support, preventing deeper drawdowns for now. However, the longer ETH remains compressed below $3,000, the greater the risk of a volatility expansion. A decisive break above $3,100 would be required to shift momentum to the bullish side. Until then, Ethereum remains vulnerable to renewed downside pressure if broader market sentiment deteriorates. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum News|ETH|ethereum|Ethereum Analysis|Ethereum Binance|Ethereum Inflows|Ethereum liquidity|ethereum news|ethereum price|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56666940,
    "published": 1767227781000,
    "title": "Digital ID, CBDCs risk turning US into ‘surveillance state': US Rep",
    "body": "US Representative Warren Davidson said the stablecoin-focused GENIUS Act may backfire on Americans by stripping them of their financial freedom and privacy.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 56668974,
    "published": 1767232822000,
    "title": "XRP At Risk Of A Drop To $0.80? Analyst Makes The Case",
    "body": "A cryptocurrency analyst has explained how XRP could be at risk of a drop toward $0.80 based on the data of some on-chain indicators. XRP Has Seen Bearish Developments In On-Chain Data In a new thread on X, analyst Ali Martinez has talked about why XRP may be at risk of seeing a decline to the $0.80 level. “First, network activity has cooled sharply,” noted Martinez. There are many ways to gauge network activity, but the analyst has used the Active Addresses on-chain indicator. Related Reading: Bitcoin Coinbase Premium At Rare Discount As US Demand Weakens This metric keeps track of the total number of addresses that are taking part in some kind of transaction activity on the blockchain every day. A chart shared by the analyst earlier showed a drawdown in this metric for XRP. Generally, a decline in the metric is a sign of a drop in interest around the asset. “Daily active addresses have fallen to roughly 38,500, pointing to fading participation and interest,” said Martinez. Another on-chain indicator has also shown a development recently: the supply held by the whales. Whales refer to the big-money investors of the market who carry significant amounts in their wallets. As the below chart shows, these investors participated in selling of about 40 million tokens recently. Due to the massive size of their holdings, whales are considered to be influential entities on the network, so their behavior could be relevant for the cryptocurrency. As these massive hands have been selling on the XRP blockchain recently, it’s possible that the coin could feel a bearish effect. If nothing else, the trend reflects that the asset’s key investors are showing weaker confidence. Finally, the analyst has shared a chart for the cryptocurrency’s UTXO Realized Price Distribution (URPD). This indicator basically tells us about the amount of supply that investors last purchased at the various price levels that the coin has visited in its history. From the chart, it’s visible that a notable amount of supply has its cost basis at the $1.77 level, which isn’t too far below the current XRP spot price. It’s possible that if the asset retests this level, these investors who purchased there could show some kind of reaction. When the market mood is bullish, this reaction tends to be dominated by buying. Given the current sentiment in the digital asset sector, however, the support may not be sufficient. “If selling pressure continues, XRP risks losing the $1.77 support,” explained Martinez. “A breakdown there opens the door to the next major support zone near $0.80.” Related Reading: Bitcoin Retail Optimism Returns To End 2025—What Usually Follows? This support zone near $0.80 is currently the largest demand zone beyond the $1.77 level. XRP Price At the time of writing, XRP is floating around $1.86, unchanged from one week ago. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP News|xrp|XRP Bearish|XRP Price|XRP Whales|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56668715,
    "published": 1767232143000,
    "title": "CFTC director who made Bitcoin futures possible returns as chief of staff",
    "body": "Amir Zaidi’s return signals a strengthening of crypto oversight as the agency prepares for new digital asset laws.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56669534,
    "published": 1767233810000,
    "title": "Private messaging faces threats from AI, limited user awareness: Session execs",
    "body": "Session’s Chris McCabe and Alex Linton tell Cointelegraph that AI-integrated devices could bypass messaging encryption, creating privacy and security issues.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 56670540,
    "published": 1767236428000,
    "title": "Ethereum Optimism For 2026: Analysts Share Bullish Forecast Despite Disappointing End-Of-Year",
    "body": "As Ethereum (ETH) is set to end the year on a disappointing note, some market observers have shared an optimistic outlook for the altcoin’s start-of-year performance, suggesting that an early 2026 breakout remains possible. Related Reading: Crypto Hacks Swipe Nearly $3 Billion In 2025 Despite Fewer Attacks – Report Ethereum Holds ‘Equilibrium Level’ Ethereum is attempting to end the year above a crucial area following its recent sideways action. Notably, the cryptocurrency has been in a downtrend for the past three months, currently recording a 27.8% decline from its Q4 opening of $4,145. ETH has been trading sideways over the past several weeks, hovering within the $2,800-$3,000 price range. During this period, the King of Altcoins has failed to hold above the upper boundary on the weekly timeframe despite multiple attempts to break out. Amid this performance, market watcher Crypto Batman recently noted Ethereum is trading around the mid-zone of a multi-year bullish channel, which he named “the equilibrium level.” This zone has historically acted as both a strong support and resistance point for Ethereum, he explained, making it the crucial area to hold as we approach the monthly and yearly closes. Despite the recent price action, Crypto Batman suggested that “given how ETH rallied from $1,500 to $4,600, this current move looks like nothing more than a bullish retest to that equilibrium, likely forming the next higher low.” Similarly, analyst Cas Abbé affirmed that the leading altcoin’s structure remains “incredibly bullish” even with the recent volatility, highlighting ETH’s uptrend line on the higher timeframes. According to the post, the cryptocurrency has not only held its ascending trendline over the past eight months but also bounced after each retest, suggesting that a rebound could be possible if this level continues to hold on the higher timeframes. ETH Breakout In Early 2026? Crypto Jelle also shared a bullish outlook for Ethereum, affirming that the altcoin looks strong on the macro chart. “If price can push towards $4k from here, I doubt bears can hold it down again,” the analyst wrote on X, adding that “It might finally be time for ETH to shine again next year.” Market observer Trader Tardigrade underscored a giant Inverse Head and Shoulders pattern on ETH’s weekly chart. Per the post, the cryptocurrency has been forming this bullish pattern for the past two years, with the neckline currently located around the $4,950-$5,000 mark. Notably, the left shoulder and head developed during the Q3-Q4 2024 and Q2-Q3 2025 rallies. Meanwhile, the Q4 2025 correction has started to form the pattern’s right shoulder, which signals that the altcoin could rise to the neckline area in the next few months, and potentially aim for higher levels if the pattern continues to develop. In the shorter timeframe, Man of Bitcoin noted that Ethereum could see a breakout in the first week of 2026. The analyst pointed out a one-month symmetrical triangle formation on ETH’s chart, where the price has been “getting squeezed between both trendlines.” Related Reading: Solana Bearish Formation Hints At Major Correction Until Mid-2026 – Here’s The Target While the altcoin continues to compress between these levels, a break from the pattern becomes more likely, leading the market watcher to suggest a 15%-20% breakout toward the $3,400 resistance. As of this writing, ETH is trading at $2,977, a 1.2% increase in the weekly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto analyst|Crypto Bull Run 2025|crypto market correction|crypto market prediction|Crypto Market Recovery|Crypto trader|ETH|ethereum|Ethereum Analysis|Ethereum Breakout|Ethereum bullish prediction|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56671725,
    "published": 1767238986000,
    "title": "Memorable 2025 Crypto Policy Milestones",
    "body": "Reflecting on pivotal 2025 moments in policy, stand-out milestones include the crypto ball, leadership changes at top trades, and Democratic votes favoring crypto.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56673691,
    "published": 1767243511000,
    "title": "Crypto forces to compound in 2026, accelerating adoption: Coinbase",
    "body": "Coinbase’s head of research said the forces that drove crypto in 2025, such as regulation, ETFs, stablecoins and tokenization, will only get stronger in the coming year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56675497,
    "published": 1767247078000,
    "title": "4 crypto comebacks from 2025 that could help shape the year ahead",
    "body": "From Ross Ulbricht’s pardon to Ripple’s SEC victory, here’s a list of crypto’s most celebrated turnarounds this year and what they mean for the year ahead.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56676437,
    "published": 1767248753000,
    "title": "Investors funnel $32B into US crypto ETFs despite year-end pullback",
    "body": "BlackRock has further separated itself from competitors in the crypto ETF market in 2025, with its Bitcoin and Ether funds, IBIT and ETHA, accounting for the majority of net inflows.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56680384,
    "published": 1767256620000,
    "title": "Trader bags $1M from ‘abnormal’ BROCCOLI714 memecoin activity on Binance",
    "body": "A trader claimed to have made $1 million by timing a long-short trade after spotting abnormal activity by a market maker account on Binance, while the exchange denied any security breach.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 56683800,
    "published": 1767263429000,
    "title": "Crypto ETFs Defy The Pullback With $32 Billion In Fresh Investor Cash",
    "body": "According to Farside Investors data, US investors put close to $32 billion into US crypto exchange-traded funds in 2025 even as markets lost steam late in the year. Related Reading: Crypto Headed For A $10 Trillion Future? Hoskinson Says RWA Is The Key Spot Bitcoin ETFs drew the biggest share, with $21.4 billion in net inflows. That is smaller than the $35 billion that poured into Bitcoin ETFs in 2024. Blackrock Dominates Flows BlackRock’s iShares Bitcoin Trust ETF, IBIT, accounted for most of the activity. Reports show IBIT took in about $24.7 billion. That makes its inflows roughly five times larger than the nearest rival, Fidelity’s FBTC. Market watchers noted IBIT ranked near the top among all ETF flows, placing behind only a few broad index funds and a big treasury bond fund. If IBIT’s number is removed, the wider spot Bitcoin ETF group actually finished the year with about $3 billion in combined outflows. Grayscale’s Bitcoin product lost nearly $4 billion on the year. Bitcoin’s price was lower than at the start of 2025; it began the year around $93,500. Ethereum Interest Strong But Cooling Based on reports, interest in Ethereum ETFs was real, but the momentum looks uneven. BlackRock’s iShares Ethereum Trust, ETHA, sits at nearly $12.6 billion in inflows. Fidelity’s FETH follows at $2.6 billion, while Grayscale’s Ethereum Mini Trust ETF holds about $1.5 billion. Still, public on-chain data showed little renewed demand for spot Bitcoin and Ether ETFs in the last month of the year, suggesting flows may slow into 2026. Ether ETFs benefited from being new and giving investors a regulated way to own ETH, but recent days have seen quieter buying. Spot Ether ETFs, which only became widely tradable after their July 2024 launch, gathered $9.6 billion in their first full year. Spot Solana ETFs, launched in late October, added $765 million through year end. Altcoin ETFs Show Curiosity, Not Frenzy Litecoin and XRP ETFs also began trading in the latter half of the year, giving investors more choices for regulated altcoin exposure. The sums are small compared with Bitcoin and Ether. Solana’s $765 million is an example of early interest that has not yet turned into a large, steady stream of assets. These products are being tested by the market. Related Reading: Gold And Stocks Ran Ahead, But Bitcoin May Close The Gap In 2026 Global Flows Tell A Different Story Industry trackers reported that crypto ETFs listed worldwide experienced $2.95 billion in net outflows in November, and there was about $179 billion invested in crypto ETFs globally at the end of that month. Regulators and exchanges moved faster this year under new SEC leadership that was more open to approvals, which in turn helped institutional adoption in the US. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|bitcoin|btc|btcusd|crypto|etf|Ether|ethereum",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56686884,
    "published": 1767268800000,
    "title": "How crypto's promised year-end fireworks turned into a bloodbath",
    "body": "Digital asset treasuries, altcoin ETFs and bitcoin’s famed year‑end seasonality were meant to supercharge prices. What came instead was the worst drawdown since 2022's crypto winter.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|market analysis|Bitcoin News|Crash|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56690078,
    "published": 1767274244000,
    "title": "Bitcoin Could Be Setting Up A Comeback Vs. Gold, Analyst Suggests",
    "body": "A veteran market analyst has flagged a technical pattern that could signal a turning point for Bitcoin after months of underperformance versus gold. The move comes as traders weigh whether the long run of gains for the yellow metal has exposed limits in Bitcoin’s safe-haven story. Related Reading: Gold And Stocks Ran Ahead, But Bitcoin May Close The Gap In 2026 Bitcoin Versus Gold Ratio Down The Bitcoin-to-gold ratio has plunged. It fell from 32 on Oct. 5 to about 20 today, a drop of more than 37%. According to the data, that means one Bitcoin bought roughly 32 ounces of gold in early October but now buys about 20. The ratio’s slide has accelerated since gold’s rally took hold and Bitcoin’s price slipped below key levels. Daily readings point to a possible change in momentum. On Nov. 21 the BTC/GOLD pair hit a low of 20 and the RSI stood at 21.30. A lower low near Dec. 1 came with a higher RSI low of 26.83. Then another trough at 19 on Dec. 26 coincided with a higher RSI low of 32.21. That’s a valid bullish divergence on the daily timeframe for BTCUSD vs. Gold. Interested to see where that leads us into 2026. pic.twitter.com/D6ei8HsIDy — Michaël van de Poppe (@CryptoMichNL) December 31, 2025 Based on reports, Michaël van de Poppe called this pattern a “strong” bullish divergence on the daily chart, a setup traders watch because it can show selling pressure easing even as prices make new lows. Technical Signals Show Cooling Selling Pressure On the weekly chart the picture adds weight to the signal. The weekly RSI for the BTC/GOLD pair has sunk to about 31.85 at press time. That level was last seen during the November 2022 sell-off tied to the FTX collapse, a point that marked a bottom in that cycle. Reports also link similar RSI lows to the bottoms seen in 2015 and 2018. Taken together, the daily divergence and the low weekly RSI make a stronger case that the downtrend may be losing steam, though nothing is guaranteed. Market Sentiment Splits Investors Gold’s rally has been dramatic. Reports show gold surged by over 70% in 2025 while Bitcoin fell by 7% over the year in some measures. At press time Bitcoin trades at $87,750, down 4.8% year-to-date. The breakdown in the Bitcoin-to-gold ratio and Bitcoin’s continued weakness below $100,000 have prompted fresh questions about the “digital gold” story as bullion posts historic gains. Short-term money appears to favor gold for capital protection. Many traders are treating the metal as a shelter while it climbs to new highs. Long-term holders, however, still point to Bitcoin’s potential for big upside once risk appetite returns. Related Reading: Crypto Headed For A $10 Trillion Future? Hoskinson Says RWA Is The Key According to market watchers, the near-term outlook hinges on whether the BTC/GOLD ratio and price action deliver follow-through above key levels. Until that happens, signals will remain tentative. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|gold|yellow metal",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56690190,
    "published": 1767274174000,
    "title": "SOL accumulation tops crypto trends on New Year’s Day: Santiment",
    "body": "Whale accumulation across Solana tokens is headlining crypto-related social buzz as 2026 begins, according to data from Santiment.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56691155,
    "published": 1767276379000,
    "title": "Base’s creator coin experiment meets resistance after Nick Shirley launch",
    "body": "Base’s push into creator coins is facing mounting criticism from traders and builders after Nick Shirley’s token on Zora spiked to about a $9 million valuation and then promptly slumped.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 56690991,
    "published": 1767276000000,
    "title": "The Federal Reserve Is The Christmas Gift That Keeps On Taking",
    "body": "On its 112th anniversary, the Federal Reserve's track record speaks clearly: 97% purchasing power lost, M2 up 140,000%. Bitcoin offers a fundamentally different path.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56691482,
    "published": 1767276900000,
    "title": "The XRP Army got everything except $5 price: Will 2026 deliver?",
    "body": "XRP scored every major win in 2025 with the SEC case resolved and spot ETFs launched, yet the price crashed 50%, with the $5 target remaining elusive.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56692869,
    "published": 1767279647000,
    "title": "Dogecoin Mirrors AMD’s Setup From Last Year, Analyst Claims",
    "body": "Dogecoin’s pullback is starting to look like a setup, not a breakdown, at least according to crypto analyst Cantonese Cat (@cantonmeow), who says the meme coin is behaving the way AMD did before its turn higher last year. Can Dogecoin Replicate The AMD Rally? In a X post on Dec. 31, the analyst argued that slipping prices on weakening volume and growing public reluctance to be bullish is exactly what improves the trade’s risk/reward. “I said that about AMD last year. I’m saying that about DOGE right now,” Cantonese Cat wrote. “The lower price goes down on low volume. The more worried influencers are to publicly be bullish on it. The less people care about this. The better risk-reward ratio there is.” The Dec. 31 chart is built around Fibonacci retracement levels mapped from DOGE’s prior move, with key bands marked at roughly $0.373 (0.886), $0.297 (0.786), $0.202 (0.618), $0.154 (0.5), $0.118 (0.382), $0.084 (0.236) and a lower reference near $0.049 (0). In that view, DOGE is shown sliding into the 0.382 region (around $0.118), a level many technicians watch as a make-or-break area for whether a pullback remains corrective or risks turning into a deeper unwind. Related Reading: Dogecoin Near $0.11–$0.12 Offers ‘Incredible Risk/Reward,’ Says Analyst Below price, Cantonese Cat’s volume bars are annotated with downward arrows, reinforcing the point made in the accompanying commentary: as DOGE moved lower, participation appeared to fade. For the analyst, that combination: declining price paired with softer volume and a more reluctant public tape fits a pattern where marginal sellers can exhaust without attracting aggressive new supply. Long-Term Dogecoin Price Targets Cantonese Cat’s earlier Dec. 20 post sets the broader roadmap, describing the preceding stretch as a prolonged downcycle and positioning the current phase as a corrective structure rather than a fresh trend. “We’ve already had a 13 month bear market for DOGE, with my working hypothesis of this being likely a wave 2 correction prior to wave 3 explosion,” the analyst wrote. “The entire reason why this may play out is that it doesn’t feel likely right now, and you want me to stop posting.” Related Reading: Dogecoin Chart Mirrors Silver’s Breakout, Analyst Flags $9+ Scenario That Dec. 20 chart also projects upside targets using Fibonacci extensions, with levels plotted well above the prior range. The marked extension ladder includes roughly $0.90 (1.272), $1.25 (1.414), and $1.99 (1.618), with more aggressive levels further out near $4.78 (2.0) and $8.91 (2.272). The thesis is not that those levels are imminent, but that the convexity of a potential “wave 3” is what makes the current pullback, if it holds the corrective framing, attractive from a risk/reward standpoint. Notably, the AMD comparison is not the only cross-market framing Cantonese Cat has used recently. The analyst has also drawn parallels between Dogecoin and silver, according to our recent coverage, extending the same core idea across different assets: periods that feel uninteresting or unpopular can be precisely when the setup becomes more asymmetric. At press time, DOGE traded at $0.12. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|AMD|doge|DOGE news|Doge price|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]