[
  {
    "id": 58070014,
    "published": 1771209934000,
    "title": "Bitcoin Price Faces Another Rejection As Upside Momentum Fades",
    "body": "Bitcoin price failed to stay above $70,000 and started another decline. BTC is now trading below $68,800 and might extend losses in the near term. Bitcoin is slowly moving lower below $69,500 and $69,200. The price is trading near $68,400 and the 100 hourly simple moving average. There was a break below a bullish trend line with support at $69,500 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might dip again if it trades below the $68,400 and $68,000 levels. Bitcoin Price Dips Again Bitcoin price failed to remain stable above the $70,000 zone. BTC started a fresh decline and traded below the $69,200 support zone . There was a push below $69,000. The price dipped below the 38.2% Fib retracement level of the upward move from the $65,072 swing low to the $70,935 high. Besides, there was a break below a bullish trend line with support at $69,500 on the hourly chart of the BTC/USD pair. Bitcoin is now trading near $68,400 and the 100 hourly simple moving average . If the price remains stable above $68,000, it could attempt a fresh increase. Immediate resistance is near the $68,800 level. The first key resistance is near the $69,500 level. A close above the $69,500 resistance might send the price further higher. In the stated case, the price could rise and test the $70,000 resistance. Any more gains might send the price toward the $70,500 level. The next barrier for the bulls could be $72,000 and $72,500. More Losses In BTC? If Bitcoin fails to rise above the $69,500 resistance zone, it could start another decline. Immediate support is near the $68,200 level. The first major support is near the $68,000 level or the 50% Fib retracement level of the upward move from the $65,072 swing low to the $70,935 high. The next support is now near the $67,350 zone. Any more losses might send the price toward the $67,350 support in the near term. The main support now sits at $66,500, below which BTC might struggle to recover in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $68,000, followed by $66,500. Major Resistance Levels – $69,500 and $70,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58070062,
    "published": 1771209866000,
    "title": "Grayscale seeks to convert Aave trust into ETF on NYSE Arca",
    "body": "Grayscale joins Bitwise in filing to launch a standalone Aave product in the US, betting that Wall Street has retained its appetite for altcoins.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58070671,
    "published": 1771211935000,
    "title": "Ethereum Price Reverses Under $2,000, Bulls On The Back Foot",
    "body": "Ethereum price started a fresh decline and traded below $2,000. ETH is now consolidating and remains at risk of another decline below $1,940. Ethereum struggled to extend gains above $2,050 and corrected lower. The price is trading below $2,000 and the 100-hourly Simple Moving Average. There was a break below a bullish trend line with support at $2,035 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh decline if it stays below the $2,000 zone. Ethereum Price Dips Again Ethereum price failed to stay above $2,050 and started a fresh decline, like Bitcoin . ETH price traded below the $2,040 and $2,020 levels to enter a bearish zone. The pair dipped below the 50% Fib retracement level of the upward move from the $1,895 swing low to the $2,106 high. Besides, there was a break below a bullish trend line with support at $2,035 on the hourly chart of ETH/USD. The bears even pushed the price toward the $1,950 support. Ethereum price is now trading below $1,980 and the 100-hourly Simple Moving Average. If the bulls remain in action above $1,920, the price could attempt another increase. Immediate resistance is seen near the $1,980 level. The first key resistance is near the $2,000 level. The next major resistance is near the $2,025 level. A clear move above the $2,025 resistance might send the price toward the $2,045 resistance. An upside break above the $2,045 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $2,120 resistance zone or even $2,150 in the near term. More Losses In ETH? If Ethereum fails to clear the $2,000 resistance, it could start a fresh decline. Initial support on the downside is near the $1,945 level. The first major support sits near the $1,930 zone or the 83.2% Fib retracement level of the upward move from the $1,895 swing low to the $2,106 high. A clear move below the $1,930 support might push the price toward the $1,880 support. Any more losses might send the price toward the $1,820 region. The main support could be $1,780. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI – The RSI for ETH/USD is now below the 50 zone. Major Support Level – $1,930 Major Resistance Level – $2,000",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58071742,
    "published": 1771215525000,
    "title": "XRP Price Trims Gains After Explosive Rally, Momentum Cools",
    "body": "XRP price failed to surpass $1.680 and started another decline. The price is now correcting gains and might struggle to stay above $1.450. XRP price started a downside correction and declined below $1.550. The price is now trading above $1.450 and the 100-hourly Simple Moving Average. There was a break below a key bullish trend line with support at $1.4880 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could start another increase if it stays above $1.440. XRP Price Rally Cools XRP price failed to stay above $1.620 and started a downside correction, like Bitcoin and Ethereum . The price dipped below the $1.60 and $1.550 levels to enter a negative zone. The price even dipped below the 61.8% Fib retracement level of the upward move from the $1.3475 swing low to the $1.6713 high. Besides, there was a break below a key bullish trend line with support at $1.4880 on the hourly chart of the XRP/USD pair. The bulls are now active above the $1.450 zone. The price is now trading above $1.4620 and the 100-hourly Simple Moving Average. If there is a fresh upward move, the price might face resistance near the $1.50 level. The first major resistance is near the $1.510 level, above which the price could rise and test $1.5450. A clear move above the $1.5450 resistance might send the price toward the $1.580 resistance. Any more gains might send the price toward the $1.620 resistance. The next major hurdle for the bulls might be near $1.640. Downside Continuation? If XRP fails to clear the $1.510 resistance zone, it could start a fresh decline. Initial support on the downside is near the $1.440 level. The next major support is near the $1.4240 level or the 76.4% Fib retracement level of the upward move from the $1.3475 swing low to the $1.6713 high. If there is a downside break and a close below the $1.4240 level, the price might continue to decline toward $1.40. The next major support sits near the $1.360 zone, below which the price could continue lower toward $1.340. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $1.440 and $1.4240. Major Resistance Levels – $1.50 and $1.510.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58072584,
    "published": 1771218247000,
    "title": "Aave founder pitches $50T ‘abundance asset’ boom to drive DeFi",
    "body": "Aave Labs CEO Stani Kulechov said onchain lending could help accelerate the development of solar, energy storage, robotics by putting money behind \"future-proof\" assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58074562,
    "published": 1771224514000,
    "title": "Crypto market drowns in red as bitcoin falls to $68,000",
    "body": "Traders are bracing for a heavy week of macroeconomic events, including Fed minutes and the core PCE inflation report.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58075229,
    "published": 1771226534000,
    "title": "Animoca Brands wins Dubai crypto license to expand services in Middle East",
    "body": "Dubai’s regulator approved the license on Feb. 5, allowing Animoca Brands to target institutional and qualified investors under the oversight of Dubai’s VARA.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58075923,
    "published": 1771228800000,
    "title": "OKX snags European payments license for stablecoin and crypto card expansion",
    "body": "The Payments Institution license, gained in Malta, aligns the exchange with European Union regulatory requirements that take effect in March 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|OKX|Malta|Crypto Exchanges|Licensing|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58076857,
    "published": 1771239466000,
    "title": "Animoca Granted Dubai License Amid Stricter Crypto Oversight",
    "body": "Animoca Brands calls Dubai a strategic hub for institutional clients as the emirate builds compliance-driven crypto markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|monero|zcash|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 57,
        "NAME": "XMR",
        "CATEGORY": "XMR"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58076967,
    "published": 1771236016000,
    "title": "Ethereum Staking Reaches Historic Levels, Price Hovers Near $2K",
    "body": "According to CoinMarketCap, Ethereum changed hands around $2,050 at one point, with a single-session move of about 7%. Reports have disclosed that roughly 30% of the total ETH supply is now locked in staking contracts, a level not seen before. Related Reading: Urgent Crypto Reform: Treasury Secretary Says The Clock Is Ticking That is a big shift in where supply sits, and it matters because locked coins are not available for quick trading. Staking Participation Hits A Record On-chain trackers show a steady climb in staking since early 2023. Back then roughly 15% of the supply was staked; today that figure has roughly doubled. People who lock ETH as validators do it to earn rewards and to help keep the network running. Many of those accounts are built to stay long-term. That matters because long-term holders change how supply and demand play out. Ethereum staking rate just hit a new all-time high. Over 30.5% of all ETH is now staked! Meanwhile ETH is trading at ~$1,950. Since early 2023, the staking rate has gone from ~15% to 30.5% in an almost perfect straight line. Bear market, bull market, crashes, rallies. Doesn’t… pic.twitter.com/8dS4xv7bok — Leon Waidmann (@LeonWaidmann) February 13, 2026 Liquid Supply Has Shrunk When a chunk of coins is tied up, it takes some selling pressure off the market. Locked ETH lowers the pool available on exchanges for fast sales. That does not guarantee a price surge, but it does tighten one side of the market. Traders watching supply flows often weigh that factor alongside macro moves and liquidity conditions. Some traders see this as a slow-burning bullish signal. Others remain cautious because other forces can push prices down even when supply is tighter. Ether Shows Volatility Around $1,900–$2,000 Prices have been bouncy. One day sees gains; the next day shows pullbacks. Reports note that ETH slipped below $2,000 at times as broader crypto momentum cooled. Some sessions point to strength, and some to weakness. Over the last week movement has been uneven. This is a market where headlines and flows still swing prices more than network fundamentals sometimes do. Validator Growth May Support Confidence The rising staking rate also points to growing validator infrastructure and investor patience. More validators means the consensus mechanism has more hands on deck. That has implications beyond price: it affects network security and how rewards are distributed. For many long-horizon investors, that steady build of validators is a reason to remain involved. Related Reading: Bitcoin At $8,000? Michael Saylor Says Strategy Still Won’t Break Timing of withdrawal unlocks is on watch lists. So is how quickly new staked ETH can return to exchanges when withdrawals are permitted at scale. Another big item is macro moves—rates, liquidity, and major market shifts. Those will likely control the next big price swings more than staking alone. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|bitcoin|crypto|ETH|Ether|ethereum|Staking",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58076932,
    "published": 1771234970000,
    "title": "Willy Woo warns quantum risk is eroding Bitcoin’s edge over gold",
    "body": "Onchain analyst Willy Woo says markets are starting to price in the quantum threat, putting 4 million “lost” BTC and a 12‑year valuation uptrend versus gold into question.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58076930,
    "published": 1771233178000,
    "title": "OKX secures EU payment license to expand stablecoin services",
    "body": "OKX secured a Malta payment institution license to support EU-compliant stablecoin services, including OKX Pay and the OKX Card.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58076822,
    "published": 1771232628000,
    "title": "Russia's daily crypto turnover is over $650 million, Ministry of Finance says",
    "body": "Government and central bank officials are pushing for legislation to regulate cryptocurrency activities, aiming for passage during the spring session.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Russia|crypto adoption|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58077537,
    "published": 1771241866000,
    "title": "Animoca Brands clears major regulatory hurdle with new Dubai license",
    "body": "Animoca said the license allows it to commence operations in Dubai, offering broker-dealer services and digital asset management and investments.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Animoca Brands|Dubai|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58077862,
    "published": 1771242901000,
    "title": "Metaplanet operating profit to rise 81% in 2026 after soaring 17-fold last year on options writing",
    "body": "The company recorded a non-cash bitcoin valuation loss of 102.2 billion yen ($650 million) due to the cryptocurrency’s price drop.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|MetaPlanet|Bitcoin Options|Bitcoin|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58079050,
    "published": 1771246836000,
    "title": "Bitcoin Should Be Flying—Instead, Quantum Risk Keeps It Grounded: Analyst",
    "body": "According to on-chain analyst Willy Woo, a long-running rise in Bitcoin’s value versus gold has stalled. He points to a break in a trend that ran for more than a decade. Related Reading: Bitcoin At $8,000? Michael Saylor Says Strategy Still Won’t Break The timing, he argues, lines up with when quantum computing showed up on the radar of Bitcoin developers and when the Quantum Bitcoin Summit took place. That change, he says, has altered how the market thinks about Bitcoin’s future. Quantum Fear And Lost Coins Reports have disclosed that roughly 4 million BTC are effectively out of circulation because their keys are lost. That number matters. Since 2020, corporate buyers and spot ETFs have taken close to 3 million BTC off the market. If some of those lost coins were eventually recovered using powerful quantum machines, supply would expand in a way that markets could not ignore. Woo gives the chance of a network hard fork that freezes any recovered coins at 25%. 12 YR TREND BROKEN. BTC should be a valued a LOT HIGHER relative to gold. Should be. IT’S NOT. The valuation trend broke down once QUANTUM came into awareness. Don’t read this post if you want to stay high on hopium instead of seeing things as they are. pic.twitter.com/Qa2YKDlRMp — Willy Woo (@willywoo) February 16, 2026 He also estimates a socalled Q-Day — the point where quantum machines can threaten today’s cryptography — to be about five to 15 years away. Markets, however, do not always wait for an event to actually happen before they price it in. Macro Money Favors Gold Right Now Reports note that broader financial cycles are pushing big pools of capital toward traditional hard assets. Long-term debt cycles are often followed by moves into things seen as safe havens. Sovereign funds and large investors have been piling into gold while Bitcoin stalls. The result: gold rallies while Bitcoin lags, and that gap is what analysts like Woo are trying to explain. Who Says It’s Not Quantum Panic Quantum fears around Bitcoin are not universally accepted. Blockstream CEO Adam Back has said the threat is distant and often overstated, arguing that if quantum computing advances far enough to challenge current encryption, Bitcoin can upgrade its cryptography through network consensus. In his view, the system has time to adjust before any real damage occurs. Prominent Bitcoin educator and author Andreas Antonopoulos has also pushed back, noting that quantum computers would affect banks, governments, and the entire internet—not just Bitcoin. He argues that global security standards would be strengthened long before Bitcoin faced a unique crisis, making the current concern premature. Yet Woo points to unusual flows, including activity by early-era holders. Reports say some Satoshi-era wallets have seen transfers over the last 12 months, and that behavior can change market sentiment fast. Sometimes a few large moves are enough to tilt prices for weeks. Related Reading: Urgent Crypto Reform: Treasury Secretary Says The Clock Is Ticking Bitcoin And Gold: Diverging Paths Amid Market Volatility At the time of writing, Bitcoin (BTC) is trading at $68,700, indicating market volatility due to the inability to sustain last year’s peak at around $126,000. Gold, for its part, is trading at around $4,950 per ounce due to safe-haven pressures driven by market uncertainty. Bitcoin is still a speculative asset, while gold is a traditional store of value, some analysts say. The correlation coefficient between Bitcoin and gold is relatively weak, almost to the point of being nil, suggesting that these two assets are not correlated and tend to move independently. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btcusd|crypto|gold quantum computing",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 206,
        "NAME": "FORKS",
        "CATEGORY": "FORKS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58080199,
    "published": 1771250785000,
    "title": "Bitcoin could fall to $10,000 as U.S. recession risk builds, Mike McGlone Says",
    "body": "McGlone links bitcoin’s downturn to record U.S. market cap-to-GDP levels, low equity volatility and rising gold prices, warning of potential contagion into stocks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|crypto market|Mike McGlone|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58080710,
    "published": 1771252211000,
    "title": "What The Dogecoin Recovery From This Accumulation Zone Means For The Price",
    "body": "Dogecoin (DOGE) has recently seen a major recovery from a critical accumulation zone, which a crypto analyst believes could set the stage for a stronger rally to or above $1. The massive price surge comes after months of consistent declines, during which the dog-themed meme coin has failed to break through resistance amid volatility and persistent market sell-offs. Dogecoin Rebounds 46% From Accumulation Zone Market analyst Crypto Patel has released a fresh evaluation of Dogecoin’s price behavior, pointing to a key accumulation zone that has sparked a notable recovery in the meme coin. The analyst highlighted a significant shift in Dogecoin’s momentum and price direction after it climbed roughly 46.94% from a strong support area and accumulation zone near $0.0375. The jump included a recent 8.57% daily increase, which propelled DOGE toward $0.113. Related Reading: One Month In And 10% Of Dogecoin Millionaires Have Already Disappeared In 2026 – Details Crypto Patel has said that short-term traders can consider taking profits at current high levels. In contrast, long-term traders are encouraged to view any decline from $0.113 to the $0.06 to $0.08 range as a gradual accumulation opportunity, with expectations that the meme coin’s next bullish targets will extend to $1 and $2. The accumulation zone, marked in green on the analyst’s chart, represents a multi-year base that has held since earlier cycles, with the Dogecoin price respecting it as a higher-timeframe support. Crypto Patel noted that DOGE previously recorded two major breakouts before reaching this zone. The first breakout occurred at the lower boundary of a descending channel between points 1 and 2 on the chart, followed by a second breakout from a later consolidation phase that pushed prices higher. After these moves, Dogecoin’s price pulled back and retested key levels before settling into the current accumulation zone. The meme coin is now showing renewed bullish momentum after months of decline, with price action pointing toward a move to higher levels. Fibonacci extensions and measured move projections further indicate the likelihood of a significant upside, with one target on the chart pointing to $0.567, representing a potential 409% rally. Another target suggests an even higher price increase toward $2 and possibly $4 if bullish momentum persists. Related Reading: Dogecoin Crash Sends It To Key Demand Zone, Here’s The Level To Watch Although Dogecoin recovered to $0.11, its price has since declined to $0.10. CoinMarketCap’s daily chart shows that DOGE has declined by more than 11% over the past 24 hours. Analyst Highlights Possible Invalidation Level In his chart, Crypto Patel highlighted a potential invalidation area, warning that if it is crossed, Dogecoin could pull back and resume its previous downtrend. The invalidation level sits near $0.056, just below the accumulation zone. The analyst noted earlier that despite the recent recovery, the DOGE price could still revisit the $0.06 range, suggesting that a weekly close below this area could weaken the meme coin’s broader macro bullish structure. Featured Image from Pixabay, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|CoinMarketCap|Crypto Patel|Descending Channel|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt|fibonacci extensions|meme coin",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58080660,
    "published": 1771251993000,
    "title": "Ray Dalio’s world order warning revives case for Bitcoin as neutral money",
    "body": "Ray Dalio warns that the rules‑based order is now over, putting monetary debasement, dollar risk, and neutral, permissionless financial rails back at the center of the macro conversation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58080998,
    "published": 1771253053000,
    "title": "Binance Founder CZ: Privacy 'Missing Link' for Crypto Payments Adoption",
    "body": "Changpeng Zhao called on the industry to prioritise crypto privacy features, arguing that the gap is holding back mainstream adoption.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "monero|secret|zcash|Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 57,
        "NAME": "XMR",
        "CATEGORY": "XMR"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58081261,
    "published": 1771254000000,
    "title": "From Wall Street to Web3: This is crypto’s year of integration, Silicon Valley Bank says",
    "body": "From bank-led stablecoins to tokenized T-bills and AI-powered wallets, digital assets will move from pilot projects to financial plumbing this year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Silicon Valley Bank|Stablecoins|Tokenization|Institutional Adoption|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58080709,
    "published": 1771252200000,
    "title": "Nexo re-enters the U.S. market three years after exiting due to regulatory issues",
    "body": "The digital assets wealth platform’s rollout includes regulated yield accounts, credit lines and exchange access backed by Bakkt.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Nexo|Bakkt|U.S. Regulation|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58082607,
    "published": 1771257806000,
    "title": "EU Moves to Ban All Crypto Transactions with Russian Entities: Report",
    "body": "Lawmakers want to make it illegal for any party in the EU to transact with Russian counterparties using crypto, to help enforce sanctions.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58082536,
    "published": 1771257617000,
    "title": "Hyperunit Whale Dumps $500M In Ethereum As Massive Crypto Bet Turns Sour",
    "body": "Ethereum continues to struggle to reclaim the $2,000 level as persistent selling pressure and elevated volatility weigh on market sentiment. Repeated attempts to push higher have met resistance, reflecting cautious positioning among traders and broader uncertainty across the crypto market. While fluctuations around key psychological levels are common during corrective phases, the current environment suggests ongoing fragility, with liquidity conditions and derivatives positioning playing a growing role in short-term price dynamics. Related Reading: Liquidity Or Liability? History’s Hard Lessons For The XRP Momentum Play Adding to the pressure, recent on-chain data from Arkham indicates that a major market participant — commonly referred to as the Hyperunit whale — has reportedly sold roughly half a billion dollars worth of ETH. Large transactions of this magnitude tend to attract significant market attention, as they can influence liquidity conditions, sentiment, and short-term volatility, even when not directly triggering sustained price declines. Such movements do not automatically signal a broader market reversal, but they often reflect strategic repositioning by large holders amid uncertain conditions. Historically, similar episodes have coincided with transitional phases, where markets reassess direction following periods of strong trends. Hyperunit Whale Rotation Adds Context To Ethereum Market Pressure Additional data from Arkham provides further context on the large ETH transaction recently observed on-chain. The entity often referred to as the “Hyperunit whale” is believed to be a major Bitcoin holder, likely of Chinese origin, whose wallets accumulated more than 100,000 BTC during early 2018, when those holdings were valued near $650 million. For several years, the strategy appeared straightforward: accumulate Bitcoin and maintain a long-term holding position, with over 90% of those coins reportedly untouched for roughly seven years. At the peak of its on-chain exposure, Arkham estimates the whale controlled approximately $11.14 billion worth of BTC. However, in August 2025, around 39,738 BTC — valued near $4.49 billion at the time — were reportedly transferred in a move interpreted as a rotation into Ethereum. Subsequent accumulation brought total ETH holdings to roughly 886,000 coins, valued at over $4 billion during that period. Since that shift, performance appears to have weakened. Estimates suggest approximately $3.7 billion in losses tied to leveraged ETH exposure and combined BTC/ETH spot holdings, alongside roughly $1.2 billion in unrealized losses on staked ETH. In aggregate, Arkham data indicate a drawdown approaching $5 billion from peak portfolio levels. Related Reading: Bitcoin BCMI Drops Toward Bear Market Territory: How Close Is BTC To A Real Buy Zone? Ethereum Price Holds As Downtrend Pressure Persists Ethereum price action continues to reflect sustained weakness, with the chart showing a clear sequence of lower highs since the late-2025 peak above the $4,000 region. The recent decline toward the $2,000 psychological level highlights persistent selling pressure, while the inability to generate a strong rebound suggests buyers remain cautious despite oversold conditions. Technically, ETH is trading below its key moving averages, which are now trending downward — a configuration typically associated with bearish momentum rather than a temporary correction. The breakdown below the mid-range consolidation seen late last year accelerated downside volatility, accompanied by a noticeable spike in trading volume. Such volume expansions often signal capitulation or forced deleveraging, rather than routine profit-taking. Related Reading: Ethereum Derivatives Reset Raises Questions About Next Price Move: What Happens Next? The current stabilization around the $1,900–$2,000 zone may represent an early attempt to form a short-term base, but confirmation would require sustained closes above nearby resistance levels, particularly the $2,200–$2,400 range, where prior support has turned into resistance. Until that occurs, upside attempts risk being corrective bounces within a broader downtrend. From a structural perspective, maintaining the $2,000 area is important for sentiment, while a decisive break lower could open the door to deeper retracement toward historical support zones. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum News|ETH|ethereum|Ethereum Analysis|ethereum news|ethereum price|Ethereum Whale|Ethereum Whale Activity|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58082951,
    "published": 1771258717000,
    "title": "How South Korea is using AI to detect crypto market manipulation",
    "body": "South Korea’s regulators are deploying AI systems to monitor crypto trading, flag manipulation and strengthen digital asset enforcement.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58083740,
    "published": 1771261262000,
    "title": "Hong Kong regulator approves first crypto company license since June",
    "body": "Hong Kong's Securities and Futures Commission (SFC) granted Victory Fintech a license.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Hong Kong|Hong Kong Securities and Futures Commission|SFC|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58083713,
    "published": 1771261201000,
    "title": "Can XRP Hold Above $1? Token Tumbles 11% as Breakdown Fuels Crash Concerns",
    "body": "XRP is once again under pressure as renewed selling activity and weakening market structure raised fresh concerns about whether the token can maintain support above the critical $1 level. Related Reading: Bitcoin Capitulation Or Buy Zone? What On-Chain Data Shows Right Now After briefly attempting a recovery earlier this month, XRP has slipped back into a corrective phase, reflecting broader weakness across digital asset markets and growing caution among traders. Recent price action shows how quickly sentiment can shift. What appeared to be a potential breakout has instead turned into another test of investor confidence, with technical indicators and macroeconomic trends now shaping the short-term outlook. XRP's price trends to the downside on the daily chart. Source: XRPUSD on Tradingview Heavy XRP Selling Sparks Fresh Downtrend The latest decline followed a large wave of selling on South Korean exchange Upbit, where roughly 50 million XRP were offloaded within a 15-hour window. Market data indicates that nearly all of the activity represented genuine spot selling rather than wash trades, suggesting real liquidation from retail or institutional participants. The sell-off pushed XRP toward the $1.44–$1.5 range, marking a two-day low and extending losses across the broader crypto market. The token has dropped about 11% in 24 hours and nearly 30% over the past month despite a brief rebound attempt earlier in February. Technically, XRP has broken below a multi-month descending trendline, turning former support near $1.51 into resistance. Analysts now view the $1.35–$1.40 zone as a key defense level. Failure to hold the defense zone could expose downside targets at $1.30 and potentially the February lows near $1.15, with some projections pointing toward $1.00 if selling pressure persists. Institutional Developments Offer Mixed Signals While XRP price action remains weak, developments around the ecosystem paint a more complex picture. Trading data shows derivatives activity increasing, with open interest rising and options volume surging, indicating that traders are actively positioning around current volatility. Meanwhile, comments from SBI Holdings CEO Yoshitaka Kitao clarified that the Japanese financial group holds roughly a 9% stake in Ripple Labs rather than billions of dollars worth of XRP, dispelling speculation circulating online. Regulatory momentum also drew attention after Ripple CEO Brad Garlinghouse joined a U.S. Commodity Futures Trading Commission advisory committee, a move viewed as a sign of improving industry relations with regulators. Long-Term Utility vs Short-Term Market Pressure Beyond market turbulence, activity on the XRP Ledger continues to expand, particularly in tokenized real-world assets such as commodities. Data shows rapid growth in the value of tokenized commodities recorded on the network, positioning it among the leading blockchain platforms in this emerging sector. Related Reading: Ethereum Staking Reaches Historic Levels, Price Hovers Near $2K However, analysts caution that network adoption does not immediately drive price appreciation. Broader macro factors, including liquidity rotation toward artificial intelligence investments, geopolitical uncertainty, and cautious monetary policy expectations, continue to weigh on crypto assets. Cover image from ChatGPT, XRPUSD chart on Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|xrp|XRP Price|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58084339,
    "published": 1771263012000,
    "title": "Historic Trend That Led XRP To A Sharp 40% Trend Has Just Reappeared",
    "body": "XRP may be approaching a significant technical moment after returning to an important level on the XRP/BTC chart. A crypto analyst known as Austin recently highlighted that the last time XRP broke above a specific resistance against Bitcoin, the result was a rapid and powerful price expansion. That same level is now being tested again, and it is worth keeping a close watch on how XRP moves from here. XRP/BTC Breakout Level Returns Technical analysis of XRP’s price action against BTC shows that the important signal lies in XRP’s performance against Bitcoin, specifically the 0.00002168 level on the XRP/BTC chart. This level is interesting because the last time the XRP/BTC broke through this zone, the pair surged by roughly 40% within a single week. Related Reading: XRP Price Could Push Further If It Beats This Resistane – ‘$15 Is On The Radar’ However, that move did not happen because Bitcoin’s price was crashing but because XRP was rallying. As XRP gained strength against Bitcoin, XRP/USD followed with an even larger breakout of over 50% within the following week. The chart accompanying Austin’s post shows a highlighted eight-day move where XRP gained approximately 52.9%, rising from around the low $2 range to above $3.60. Trading volume rose massively during that period, and this ultimately pushed XRP to a new all-time high of $3.65. As it stands, the XRP/BTC pair is now trading around this same level, with the most recent daily candlestick printing green, which means that XRP is outperforming Bitcoin. History shows that when XRP begins to outperform Bitcoin decisively, it often leads to a broader price expansion. Austin noted that breaking through this level again could be a significant sign of a big move to come. Current Structure And What Comes Next As shown in the daily candlestick chart above, XRP has been locked in a broader corrective trend against the US dollar with lower highs and lower lows after reaching $3.65 in July 2025. The recent selloff saw XRP drop below $1.15 in early February before rebounding. At the time of writing, XRP is trading at $1.46 and attempting to print daily candlestick closes above $1.50. Related Reading: Analyst Wans XRP Price Could Crash Below $1 If Bitcoin Reaches This Level If XRP/BTC manages to close convincingly above 0.00002168, it could signal a renewed shift in momentum. That would likely draw attention back to higher resistance zones on the USD chart, including $1.90, and then $2.10 as initial upside targets. A stronger continuation could open the path toward retesting deeper overhead supply levels. If the structure were to repeat the prior breakout, where XRP rallied by 52% in a short window, price projections would place the asset near the $2.30 region from current levels. Featured Image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|bitcoin|btc|Ripple|xrp|xrp btc|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58085415,
    "published": 1771266016000,
    "title": "Bitcoin weekly RSI echoes mid-2022 bear market as BTC plays liquidity games",
    "body": "Bitcoin round tripped gains after a spike to $70,000 as liquidity traps began to characterize BTC price action on the US bank holiday.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58086415,
    "published": 1771269417000,
    "title": "XRP Outlook Slashed: Standard Chartered Lowers Forecast From $8 To $2",
    "body": "The British financial giant Standard Chartered sharply reduced its price outlook for XRP, the fourth-largest cryptocurrency. The company trimmed its end-of-2026 target by 65% following the severe downturn in the broader crypto market in the past month. The revision comes even as the altcoin posted a modest 2% rebound over the past week, trading around $1.47 per token at the time of writing. Despite that short-term recovery, the bank’s digital assets team now believes the token is unlikely to reach a new all-time high this year. New XRP Price Prediction The updated forecast was first reported on Monday by DL News, with Geoffrey Kendrick, Standard Chartered’s global head of digital assets research, outlining the changes in a note to investors. Related Reading: Can XRP Hold Above $1? Token Tumbles 11% as Breakdown Fuels Crash Concerns Kendrick, who leads the bank’s crypto research efforts, acknowledged that recent market conditions have forced a broad reassessment of price expectations across the sector. “Recent price action for digital assets has been challenging, to say the least,” Kendrick wrote. “We expect further declines near-term, and we lower our forecasts across the asset class.” Under the revised outlook, Standard Chartered now expects XRP to reach $2.80 by the end of 2026, a substantial cut from its previous $8 projection. The earlier target had been issued in December, when the bank took a far more optimistic stance. At that time, Kendrick pointed to increasing regulatory clarity surrounding XRP’s status as a financial asset, along with progress toward exchange-traded fund (ETF) products, as key catalysts that could drive significant price appreciation. Broad Forecast Cuts Across Major Tokens The $8 forecast was made roughly two and a half months after the sharp market crash on October 10, when sentiment had begun to stabilize. However, as February draws to a close, the broader crypto market has yet to mount a sustained recovery. That prolonged weakness has prompted Standard Chartered to reassess not only XRP but the wider digital asset landscape. Related Reading: Bitcoin Should Be Flying—Instead, Quantum Risk Keeps It Grounded: Analyst Bitcoin’s (BTC) expected price has been reduced from $150,000 to $100,000. Ethereum’s (ETH) forecast has been revised down from $7,000 to $4,000, while Solana’s (SOL) target has been cut from $250 to $135. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|bitcoin|btc|ETH|ethereum|Sol|Solana|Standard Chartered|Standard Chartered news|xrp|XRP Price|XRP Price Forecast|XRP price news|XRP price outlook|XRP price prediction 2026|XRP Price Prediction Standard Chartered|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58086319,
    "published": 1771269017000,
    "title": "Bitcoin on Pace for Longest Losing Streak Since 2018 Bear Market",
    "body": "The selling simply won't stop. If February closes red, Bitcoin will register five consecutive red months, the longest streak in seven years.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58087347,
    "published": 1771272022000,
    "title": "Cardano (ADA) Back in ‘Survival Mode’ Despite Whale Accumulation and DeFi Expansion Plans",
    "body": "This year has been a tough ride for Cardano (ADA) investors, as weakening retail participation collides with renewed development activity and aggressive accumulation by large holders. Related Reading: Bitcoin Capitulation Or Buy Zone? What On-Chain Data Shows Right Now While on-chain data points to growing long-term conviction, market sentiment around ADA remains fragile, leaving the asset caught between technical pressure and ecosystem expansion efforts. Cardano sits at #11 trading near $0.28 after a sharp correction from January highs above $0.44. The price structure reflects broader cooling across the market, with declining derivatives activity and cautious trader positioning reinforcing analysts’ description of a “survival mode” environment for the token. ADA's price trends to the downside on the daily chart. Source: ADAUSD on Tradingview Market Fatigue Weighs on Cardano (ADA) Price Momentum Cardano founder Charles Hoskinson recently warned that the crypto market could face another 90 to 180 days of slow conditions, citing retail exhaustion following years of market shocks, including exchange failures, regulatory uncertainty, and repeated speculative cycles. Derivatives data support this cautious outlook. Open interest in ADA futures has dropped to roughly $447 million, alongside declining trading volumes, signaling reduced conviction among traders. Funding rates have also turned negative, suggesting bearish sentiment is building in leveraged markets. Technically, ADA is testing key support levels. The token continues to defend an ascending trendline formed after February’s lows near $0.22, while resistance remains clustered around the $0.29–$0.30 region. Analysts note that repeated tests of support increase the risk of breakdown, potentially exposing downside targets near $0.25 if selling pressure intensifies. Despite the weakness, higher-low formations and stabilization above short-term moving averages leave room for recovery should broader market sentiment improve. Whales Step In as Retail Interest Declines While retail demand fades, large holders appear to be taking the opposite approach. On-chain data shows wallets holding between 10 million and 100 million ADA accumulated more than 220 million tokens, valued at over $61 million, during the recent price dip. The Mean Coin Age metric has reached a three-month high, indicating long-term holders are largely refraining from selling. Historically, this combination of whale accumulation and reduced token movement can tighten circulating supply and help establish price floors during downturns. Some analysts argue that February’s lows could represent a longer-term entry zone if market conditions stabilize, though they caution that historical rebounds do not guarantee future performance. DeFi Expansion Plans Aim to Shift Narrative Beyond price action, Cardano is advancing with ecosystem upgrades to strengthen its decentralized finance (DeFi) ecosystem. The network plans to launch USDCx, a USDC-backed stablecoin intended to address liquidity shortages that have limited DeFi growth on the chain. In parallel, Cardano is integrating the LayerZero interoperability protocol, enabling connections to more than 140 blockchain networks, including Ethereum and Solana. The move is expected to expand cross-chain liquidity access and attract developers seeking broader user bases. Related Reading: Ethereum Staking Reaches Historic Levels, Price Hovers Near $2K Development activity remains high, with hundreds of repository updates focused on wallet improvements, cross-chain communication, and network infrastructure. However, market reaction has so far remained muted, suggesting investors are waiting for measurable adoption rather than announcements alone. Cover image from ChatGPT, ADAUSD chart on Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cardano|ADA|ADA price|adausd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58087874,
    "published": 1771273200000,
    "title": "Price predictions 2/16: SPX, DXY, BTC, ETH, BNB, XRP, SOL, DOGE, ADA, BCH",
    "body": "The relief rallies in Bitcoin and several major altcoins are stalling near their respective overhead resistance levels, signaling that the bears remain in control.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 12,
        "NAME": "BCH",
        "CATEGORY": "BCH"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58087616,
    "published": 1771272444000,
    "title": "Hong Kong regulator adds Victory Fintech to list of approved trading platforms",
    "body": "The addition is the first crypto company to be licensed by the Securities and Futures Commission since June 2025, when the regulator approved Hong Kong BGE.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58088285,
    "published": 1771274369000,
    "title": "Paradigm reframes Bitcoin mining as grid asset, not energy drain",
    "body": "The cryptocurrency investment firm says Bitcoin mining is being unfairly lumped with AI data centers, arguing miners act as flexible grid demand, not constant energy drains.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58089767,
    "published": 1771278984000,
    "title": "Germany‘s central bank president touts stablecoin and CBDC benefits for EU",
    "body": "Joachim Nagel said euro-pegged stablecoins would offer the bloc more independence from US dollar-pegged coins soon to be allowed under the GENIUS Act.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 58091689,
    "published": 1771284641000,
    "title": "XRP Ledger Positioned At The Heart Of Japan’s Next Financial Transformation",
    "body": "With a strong regulatory environment, proactive institutional participation, and a growing appetite for blockchain-powered financial solutions, Japan is positioning itself at the forefront of next-generation finance, and XRPL is increasingly becoming central to that vision. Japan is placing a huge bet on the XRP Ledger identity and leading protocol. Crypto analyst Stellar Rippler revealed on X that a senior banker from the Bank of Japan (BoJ), Kazuo Ueda, reportedly stated that SBI holdings has invested in XRP, XRP Ledger-native identity protocols, compliance, and lending projects. Meanwhile, that backdrop became even more significant when SBI Holdings CEO Yoshitaka Kitao said the firm holds hidden assets worth more than its officially disclosed 9% stake, which is valued at over $10 billion. Why Japan Is Looking Beyond Payments To XRPL Infrastructure Interestingly, the strategic direction becomes clearer when viewed through the lens of identity. Ripple’s president, Monica Long, has described decentralized identity on XRPL as a way to turn personal information into a secure, portable digital token that users can carry globally and selectively share, replacing reliance on centralized platforms. Related Reading: XRP Ledger DEX Metrics Flash Strong Growth As Activity Touches New Key Levels This vision is already taking shape at the infrastructure level. DNAOnChain’s XDNA applies this model with zero-knowledge proofs to transform identity and compliance data into verifiable zk-credentials. Also, these allow institutions to confirm eligibility and regulatory status without exposing sensitive information. However, the SBI’s hidden asset has extended beyond XRP, and it’s pointing toward the XRPL’s identity and zero-knowledge credential layer, where XDNA fits in as the infrastructure institutions needed. XRP is actively used as a bridge currency for liquidity on the XRP Ledger, alongside stablecoins, which are complementary. An analyst known as Vet on X has noted that recent activity on the XRPL DEX shows that RLUSD is being exchanged for EUROP, a euro-denominated stablecoin, with XRP acting as the bridge asset. By serving as an intermediary layer, XRP increases the liquidity of issued assets across the network. Furthermore, this design results in a proven, robust financial infrastructure that maximizes capital efficiency for everyday users and institutions. At the same time, market makers can make markets between the respective XRP pairs; they can hold the token because it is counterparty-free, which makes it the most efficient way to make markets. The Role Of The XRP In A Tokenized FX Future According to RippleBullWinkle, founder of Lux Lions NFT, the global foreign exchange market is moving roughly $9.6 trillion in daily volume. Related Reading: XRP Price Falls Below $1.6: You Won’t Believe What Institutions Are Doing Amid The Crash In the meantime, industry insiders are projecting an on-chain FX system for local currency stablecoins from countries around the world, in which they can settle directly on-chain against the dollar stablecoins. This is where XRP’s original design becomes relevant, because XRP was literally built to function as a bridge asset between currencies. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|Bank of Japan|BoJ|DNAOnChain|EURØP|FX|Kazuo Ueda|Lux Lions NFT|Monica Long|Ripple|RippleBullWinkle|RLUSD|Stablecoins|Stellar Rippler|VET|XDNA|xrp|XRP Ledger|xrp news|XRP Price|XRPL|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58093475,
    "published": 1771290035000,
    "title": "Analyst Reveals What XRP Price Will Move Toward In Bid For $4",
    "body": "The XRP price is flashing strong signs of a potential breakout, as one analyst points to a growing liquidity imbalance that could send the cryptocurrency racing toward $4. Currently trading near $1.5, which is more than 180% below that target, XRP would require substantial bullish momentum and a notable shift in market sentiment to reach this level. Liquidity Structure Signals XRP Price Rally To $4 In a recent X post, XRP Ledger (XRPL) developer Bird said XRP is shaping up well at current levels, arguing that its broader liquidity structure now favors an aggressive upside move. Bird shared a detailed chart, explaining that most of the liquidity resting below the current price has already been cleared, reducing the likelihood of an immediate move to lower levels. Related Reading: XRP Price Enters ‘Final Shakeout Zone’, What Investors Should Expect On the other hand, deep liquidity, particularly in the dark red zones on the chart, remains stacked above, extending toward $4. Those areas, he noted, are likely packed with short positions, leveraged trades, and stop levels. While emphasizing that the XRP price itself does not have any specific direction or target at this current time, Bird stated that markets naturally gravitate toward liquidity because the largest concentration of orders is often found there. As the XRP price pushes into upper liquidity zones, the analyst noted that short sellers may get forced out of their positions. Since closing a short requires buying back XRP at higher prices, that process can add fresh upward pressure to the market. Bird noted that liquidations typically create buying pressure, which can push prices higher. As prices rise, more short positions are closed, creating a self-reinforcing cycle. Moreover, as momentum grows, retail traders often jump in, further increasing volatility and driving prices up even faster. According to the analyst, XRP has historically shown the ability to produce rapid, aggressive rallies once a liquidation-driven momentum builds. If prices begin to tap into the areas with stacked liquidity, a move toward the $4 region could happen fast, fueled by closed short positions and expanding market participation. XRP Approaches Make Or Break Zone In a separate analysis, market analyst ‘Master of Crypto’ shared new insights into XRP’s recent price behavior and potential outlook. He stated that the cryptocurrency is currently approaching a major decision zone that could determine if it enters a fresh bullish phase or continues its previous downtrend. Related Reading: XRP Price Has Just Reached Most Oversold Level In History And This Analyst Is Predicting A Bounce According to the analyst, after weeks of trading in a clear downtrend channel on the chart, XRP’s price is now testing the upper trendline of the structure. He predicts that if price breaks and holds above this line near $1.8 with strong volume, then a surge toward $2.00 is highly probable. On the flip side, Master of Crypto forecasts that if XRP is rejected in this area, the cryptocurrency could experience a final pullback toward $1.4 before a real breakout. The analyst has said that XRP’s next move depends entirely on how its price reacts to the $1.8 resistance level. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Bird|Downtrend Channel|Master of Crypto|Ripple|Upper Trendline|xrp|XRP Ledger|xrp news|XRP Price|XRPL|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58094769,
    "published": 1771293897000,
    "title": "Logan Paul sells Pokémon card for $16.5M, years after fractional NFT row",
    "body": "Paul once fractionalized ownership of the rare Pokémon card on Liquid Marketplace in 2022 before the website went offline, leading to a lawsuit as investors demanded returns.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  }
]