[
  {
    "id": 54639604,
    "published": 1763613710000,
    "title": "Cloudflare outage shows why crypto needs end-to-end decentralization",
    "body": "Many blockchains are decentralized, but their frontends and storage still rely on Web2 — a weakness exposed when the Cloudflare outage knocked several platforms offline, EthStorage said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54640696,
    "published": 1763615702000,
    "title": "Ether Prices Drop To 4-Month Low As ‘Continued Fear’ Drives Losses",
    "body": "Ether prices reached their lowest since July on November 19 as “continued fears” of sustained losses fueled downward movement, according to analyst Tim Enneking.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54640400,
    "published": 1763615285000,
    "title": "Solana (SOL) Aims Recovery Run, $155 Resistance Now Back in Focus",
    "body": "Solana started a recovery wave above the $132 zone. SOL price is now consolidating and faces hurdles near the $145 zone. SOL price started a decent recovery wave above $135 and $140 against the US Dollar. The price is now trading above $140 and the 100-hourly simple moving average. There was a break above a key bearish trend line with resistance at $140 on the hourly chart of the SOL/USD pair (data source from Kraken). The price could continue to move up if it clears $145 and $150. Solana Price Aims Higher Levels Solana price remained stable and started a decent recovery wave above $130, beating Bitcoin and Ethereum . SOL was able to climb above the $135 level. There was a move above the 23.6% Fib retracement level of the downward move from the $172 swing high to the $129 low. Besides, there was a break above a key bearish trend line with resistance at $140 on the hourly chart of the SOL/USD pair. Solana is now trading above $140 and the 100-hourly simple moving average. On the upside, immediate resistance is near the $145 level. The next major resistance is near the $150 level. The main resistance could be $155 and the 61.8% Fib retracement level of the downward move from the $172 swing high to the $129 low. A successful close above the $155 resistance zone could set the pace for another steady increase. The next key resistance is $165. Any more gains might send the price toward the $172 level. Another Drop In SOL? If SOL fails to rise above the $150 resistance, it could continue to move down. Initial support on the downside is near the $138 zone. The first major support is near the $135 level. A break below the $135 level might send the price toward the $128 support zone. If there is a close below the $128 support, the price could decline toward the $120 zone in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is gaining pace in the bullish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is above the 50 level. Major Support Levels – $138 and $135. Major Resistance Levels – $150 and $155.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Technical analysis|Sol|Solana|solbtc|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54641419,
    "published": 1763616778000,
    "title": "Bitcoin’s drawdown shouldn’t be blamed on US shutdown or AI: Analysts",
    "body": "An onchain analyst said every time Bitcoin has seen a plunge like this, it has “allowed us to move higher.”",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54642333,
    "published": 1763618483000,
    "title": "XRP Slumps as $2.15 Level Collapses, Bearish Structure Deepens",
    "body": "Despite no major catalysts, broader crypto market weakness and Bitcoin's 'Death Cross' contributed to XRP's decline.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|XRP News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54643956,
    "published": 1763621133000,
    "title": "Privacy-Focused Aztec Network's Ignition Chain Lights Up on Ethereum",
    "body": "Aztec Network launched its Ignition Chain, becoming the first fully decentralized Layer 2 protocol on Ethereum's mainnet.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Ethereum News|Privacy|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54644481,
    "published": 1763622059000,
    "title": "This Altcoin Soars 20% In One Day Following Major Saudi Arabia Partnership",
    "body": "The native token of the crypto exchange WhiteBIT (WBT) is leading the mid-week altcoin market after a significant 20% surge over the past 24 hours. This performance follows the announcement of a key partnership with Durrah AlFodah Holding to promote the growth of blockchain technology in Saudi Arabia. Related Reading: Solana Reclaims $140 As Second Wave Of SOL ETFs Debut – Is A Rebound Coming? WhiteBIT Secures Strategic Collab In Saudi Arabia On Tuesday, top crypto exchange WhiteBIT unveiled it had signed a strategic cooperation agreement with Durrah AlFodah Holding, represented by His Royal Highness Prince Naif Bin Abdullah Bin Saud Bin Abdulaziz Al Saud, aiming to drive the Kingdom’s development in blockchain technology, digital finance, and data infrastructure. According to the announcement, the partnership aligns with the strategic pillars of the Kingdom of Saudi Arabia Vision 2030 program, which seeks to foster economic diversification, technological innovation, and digital transformation across the Kingdom’s public and private sectors. Therefore, it will set the foundation for key projects within the Kingdom, including stock market tokenization, Central Bank Digital Currency (CBDC) guidance, and the creation of national data computing and mining centers. Under the agreement, WhiteBIT will provide technological expertise and infrastructure design, while Durrah AlFodah will facilitate the crypto exchange’s market entry, regulatory engagement, and partnership development across Saudi Arabia. The move follows the exchange’s expansion to multiple jurisdictions, including Australia, Croatia, Italy, and Kazakhstan, as well as its recent dual entry into the Argentine and Brazilian markets, after key regulatory advancements in the two largest countries in South America. The collaboration reportedly envisions the creation of a joint venture company between WhiteBIT and Durrah AlFodah to manage and scale its national-scale initiatives. Volodymyr Nosov, Founder and President of W Group, the global fintech ecosystem that includes WhiteBIT, affirmed: It is an honor to work alongside the Holding of His Royal Highness Prince Naif Bin Abdullah Bin Saud to build the foundations of Saudi Arabia’s digital transformation. Together, we aim to establish secure and sovereign blockchain systems that will shape the Kingdom’s technological future. WBT Leads Mid-Week Altcoin Market Following the news, WhiteBIT’s WBT token jumped from the $51 level to a new all-time high (ATH) of $62.96 before stabilizing between the $60-$61 area. This performance builds on the remarkable WBT’s price action during the recent market volatility, which has seen many leading cryptocurrencies reach multi-month lows. Notably, the altcoin rallied to new highs in late June and consolidated within its $40-$47 range during the broader market rally between July and October. However, as the market entered a corrective phase in early November, WBT went against the current and broke out of its local range, hitting a new ATH at the time. Related Reading: Analyst Shares Worst-Case Scenario For Bitcoin (BTC) As Price Shows Concerning Signs Since then, the altcoin traded between the $50-$55 area, retesting the local range lows on Tuesday morning before the latest breakout to its new ATH. According to CoinGecko data, this performance crowns WBT as one of the leading cryptocurrencies in the past 24 hours, alongside Zcash (ZEC) and Starknet (STRK). Moreover, the altcoin, which ranks 13th among all cryptocurrencies by market capitalization, is currently the only token with double-digit gains among the top 20 cryptocurrencies. As of this writing, WBT is trading at $60.62, a 9.8% increase for the altcoin in the weekly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|altcoin market|crypto exchange|Durrah AlFodah Holding|Saudi Arabia|WBT|WBT ATH|WBT price|WBTUSDT|WhiteBIT|WhiteBIT exchange|WhiteBIt partnership|ZCash|ZEC",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54645356,
    "published": 1763623528000,
    "title": "Fed December Rate Cut Odds Collapse to 30%",
    "body": "The probability of the Federal Reserve cutting interest rates has decreased significantly, now standing at 30%.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Federal Reserve|Interest rate|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 54645833,
    "published": 1763624271000,
    "title": "BlackRock Takes First Step Toward a Staked Ether ETF",
    "body": "A new Delaware filing for the iShares Staked Ethereum Trust signals BlackRock’s intent to enter the yield-bearing ether market as issuers wait for SEC clarity on staking.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Ether|ether ETF|Staking|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54646636,
    "published": 1763625605000,
    "title": "BlackRock’s Bitcoin ETF Bleeds Over $500 Million In Its Biggest One-Day Outflow",
    "body": "Nearly two years after the inception of the Bitcoin ETF sector in the United States, these funds are currently grappling with significant challenges, exacerbated by mounting concerns regarding a potential bear market in the coming months. This turmoil is exemplified by the BlackRock iShares Bitcoin Trust ETF (IBIT), which experienced its largest single-day withdrawal since launch, further contributing to the decline in Bitcoin’s price. Profit-Taking And Caution The recent outflows from BlackRock’s Bitcoin ETF highlight the severity of the current selloff within the Bitcoin market, which has experienced a substantial correction below the crucial $100,000 mark following a record high reached in October. Related Reading: Kraken Achieves $20 Billion Valuation With $200 Million Investment From Citadel This downturn emphasizes the widespread pullback affecting various risk assets, while gold has notably remained resilient. Some analysts suggest that these developments indicate a trend of investors shifting their exposure from Bitcoin to gold. “The crypto market entered a hangover in August,” said Thomas Perfumo, Global Economist at Kraken, in a recent interview with Reuters, noting that much of the earlier demand for Bitcoin had been fueled by borrowed funds. He added, “Momentum seemingly peaked during the summer. But the truth is this hangover trend started months ago.” Analysts have also pointed to profit-taking behaviors among long-term holders and increasing caution among Bitcoin ETF funds and digital asset treasury (DAT) firms, which had previously ramped up their acquisitions throughout the year. Brian Vieten, a research analyst at Siebert Financial, stated that Bitcoin treasury companies had collectively purchased nearly $50 billion worth of Bitcoin over the past year. Recently, however, many of these firms have begun trading at a discount to their net asset value, which could dampen market expectations for new Bitcoin purchases in the near term. Bitcoin ETF Inflows Plummet This shift occurs amid rising concerns among heavyweight investors regarding inflated valuations across various asset classes. José Torres, a senior economist at Interactive Brokers, noted that “an ongoing lack of speculative spirits is weighing on Bitcoin.” Related Reading: Bitcoin Dips Below $90,000—Yet Altcoins Remain Unscathed: Here’s Why Despite managing over $73 billion in assets, IBIT has seen a decline of 19% in the current quarter. Data from SoSoValue indicates that spot Bitcoin ETF funds collectively have recorded $2.59 billion in outflows this month alone. Leading the pack is BlackRock’s Bitcoin ETF, which has experienced $1.78 billion in outflows in November alone. The Fidelity Wise Origin Bitcoin Fund (FBTC) ranks second, with nearly $540 million in outflows. The turbulence isn’t limited to Bitcoin; the Ethereum exchange-traded fund sector also faced outflows, totaling approximately $74.2 million yesterday, with BlackRock selling off $165.1 million. On a more positive note, Solana spot ETFs reported net inflows of $30.09 million on Tuesday, primarily driven by Bitwise’s BSOL. This marks a major streak of 15 consecutive days of inflows for Solana. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin ETF|Bitcoin ETF news|Bitcoin news|bitcoin price|BlackRock Bitcoin|BlackRock Bitcoin fund|BlackRock IBIT|BlackRock Spot Bitcoin ETF|BTCUSDT|crypto|crypto news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54649976,
    "published": 1763631120000,
    "title": "Why Bitcoin Hyper’s $28M Presale Has Next 1000x Crypto Potential",
    "body": "What to Know: Bitcoin Hyper aims to turn Bitcoin into a fast, smart-contract-ready Layer 2 using SVM, canonical bridging, and ZK-secured rollups. The $HYPER presale has raised over $28.16M at roughly $0.013305 per token, with strong whale entries and active retail demand. Stakers can lock $HYPER for around 41% APY, with over a billion tokens already committed, aligning early holders with long-term network growth. Price models suggest multi-X potential if the roadmap lands, but competition, delivery risk, and market shocks make $HYPER a high-risk, high-reward bet. Bitcoin is at $92K now, but it doesn’t exactly feel like victory lap season. Price action is choppy, majors are flashing double-digit red, and on-chain data keeps reminding everyone that the original crypto is still slow, expensive, and allergic to smart contracts. Bitcoin processes around seven transactions per second, fees spike whenever activity returns, and most of DeFi, NFTs, and on-chain experimentation still lives on faster networks like Solana. That leaves a strange gap: the most valuable asset in crypto is mostly sidelined from the high-growth side of Web3. That gap is exactly what new Bitcoin Layer-2 projects are trying to close. Among them, Bitcoin Hyper ($HYPER) has quietly pushed its presale past $28M at ~$0.013305/token, just as the market shifts back from panic to cautious dip-buying. Multiple market roundups now place it in the micro-cap, infrastructure-narrative bucket that speculators scan when they hunt the next 1000x crypto. Bitcoin Hyper’s pitch is simple but aggressive: turn Bitcoin into a high-throughput, smart-contract-ready Layer 2 while keeping Bitcoin-grade security. Under the hood, that means a Solana-style virtual machine, a canonical bridge for wrapped $BTC, and a rollup design secured with zero-knowledge proofs. Early investors have already staked over a billion $HYPER for yields around 41% APY, and whale buys in the hundreds of thousands of dollars ($500K just 6 days ago) suggest larger players are at least testing the waters. With the presale now past the $28M mark, the obvious question is whether Bitcoin Hyper is just another cycle narrative… or a serious contender for the next breakout Layer-2 play. Bitcoin Hyper Turns Bitcoin Into A DeFi-Capable Layer 2 At its core, Bitcoin Hyper is a rollup-style Layer-2 built specifically for Bitcoin. Users send $BTC to a monitored address on the main chain; an SVM-based smart contract verifies the deposit and mints an equivalent amount of $BTC on the Hyper network. Once bridged, that wrapped $BTC moves on a high-throughput chain with near-instant finality and sub-cent fees. Instead of forcing Bitcoin itself to run complex logic, Bitcoin Hyper batches transactions off-chain and periodically commits state back to Layer 1 using zero-knowledge proofs. That keeps the heavy security properties where they belong while shifting day-to-day activity to a faster execution layer. In practice, it lets Bitcoin behave like a settlement engine while Bitcoin Hyper handles payments, trading, and app activity. The Solana Virtual Machine is a key part of that design. By leaning on SVM tooling, Bitcoin Hyper lets developers deploy DeFi protocols, NFT marketplaces, games, and order-book DEXs with a familiar stack. Rust devs who already know Solana don’t need to relearn everything just to build on a Bitcoin-settled rollup. That cuts friction and gives the project a realistic path to a working ecosystem instead of a ghost chain. For anyone who wants exposure tied to Bitcoin and access to DeFi yields, NFT rails, and meme coin experiments, a $BTC-anchored Layer-2 like this is a clean narrative. If that thesis plays out and Bitcoin Hyper actually ships at scale, $HYPER stops being just a meme-wrapped token and starts looking like the core asset of a new Bitcoin DeFi stack. 📚 Read more about what Bitcoin Hyper is planning in our guide. Bitcoin Hyper Breaks $28M, Whales Continue Buying Stacks On the numbers side, $HYPER has already raised over $28M, placing $HYPER firmly in the early micro-cap bracket. The current stage price is $0.013305, up roughly 15% from the initial $0.0115, with fresh funding still flowing in despite broader market volatility. Presale buyers can also stake their tokens for 41% APY now, but this will drop as more people stake tokens. On the upside math, our Bitcoin Hyper price prediction outlines a 2026 high around $0.08625, assuming the roadmap is delivered and liquidity lands on major exchanges. From today’s presale price of $0.013305, that implies roughly a 6.5x to the 2026 high if everything clicks. Longer term, $HYPER could push a 2030 high near $0.253, which would be a 20x-plus move versus early presale levels. 🤑 Here’s how to buy $HYPER before it hits $30M. This is exactly type of asymmetric setup presale hunters look for. A Bitcoin-settled rollup with audited contracts, a live staking program, and more than $28M already committed has a very different risk profile from pure meme plays with no tech. Some analysts are already tagging $HYPER as a potential high-beta proxy on Bitcoin’s evolution, and in a market obsessed with the next 1000x crypto narrative, that combination of real infrastructure and early-stage pricing is why it keeps popping up on watchlists. Join the Bitcoin Hyper presale for just $0.013305/token! Disclaimer: This article is informational only, not financial advice. Crypto presales are highly risky; never invest more than you can afford to lose. Authored by Elena Bistreanu, NewsBTC – https://www.newsbtc.com/news/next-1000x-crypto-bitcoin-hyper-hits-28-million-upscales-bitcoin",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54649938,
    "published": 1763630884000,
    "title": "WLFI’s ‘community governed’ image strained as Trump-backed project freezes wallets",
    "body": "Some users viewed the asset reallocation as an alarming sign of the platform’s ability to blacklist user funds without requiring a governance proposal.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54651046,
    "published": 1763632849000,
    "title": "CEO Cuts Cardano Founder’s Bitcoin Price Forecast, Warns Bear Market Just Starting",
    "body": "Cardano (ADA) founder Charles Hoskinson previously projected that the Bitcoin price could reach an impressive price of $250,000 as early as this year. This bold forecast, made in April, came at a time when Bitcoin was trading at $77,000 after achieving a record high of $109,000 in January. Hoskinson’s Optimistic Bitcoin Price Forecast Hoskinson’s optimism was based on his belief that international negotiations, particularly between the US and China, would favor Bitcoin’s growth. The Cardano founder suggested that easing tariffs would lead to a positive market reaction and bolster adoption, particularly with the anticipated passage of the GENIUS Act, which was signed into law by President Trump a few months later. Related Reading: Bitcoin Dips Below $90,000—Yet Altcoins Remain Unscathed: Here’s Why However, the current market realities have raised doubts about Hoskinson’s prediction. Since then, Bitcoin has experienced significant fluctuations, briefly regaining momentum to reach $126,000 mid-October, only to see the broader crypto market subsequently shed over $1 trillion in total market cap. This downturn has largely been attributed to persistent selling pressure by concerned investors, and substantial outflows from the Bitcoin exchange-traded fund (ETF) sector, with nearly $2 billion sold over since October. As it stands, Bitcoin is trading at approximately $89,300, marking a nearly 30% decline from its recently achieved all-time highs. In light of this, Jacob King, CEO of Swandesk, publicly dismissed Hoskinson’s $250,000 price target, characterizing it as unrealistic. Is Bitcoin In A New Bear Market Cycle? In a post on social media platform X (formerly Twitter), King stated that such lofty price predictions are “pulled out of thin air” and reflect a market still grappling with “delusions.” King elaborated on his viewpoint, suggesting that the industry is in the early stages of a new bear market cycle. He is not alone in this assessment. Market expert Lark Davis recently noted that, based on the classic four-year Bitcoin price cycle, the cryptocurrency has officially entered bear market territory. Davis commented that this scenario leaves two possibilities: either the established four-year cycle is no longer relevant, or the market has indeed shifted into a bearish phase. Given the current macroeconomic backdrop, he leans toward the latter interpretation. Related Reading: Kraken Achieves $20 Billion Valuation With $200 Million Investment From Citadel Additionally, others in the market have echoed these bearish sentiments. An analyst known as Mr. Wall Street has recently speculated that the Bitcoin price peaked at $126,000. The analyst believes that this may mark the zenith for this cycle, predicting that the Bitcoin price could next face significant downward pressure, potentially slipping to a range between $74,000 and $82,000. He further forecasts a possible decline to levels between $54,000 and $60,000 by the fourth quarter of 2026. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin bear market|Bitcoin news|bitcoin price|btc|BTC news|btc price|BTCUSDT|crypto|Crypto bear market|crypto market|crypto news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54651071,
    "published": 1763632800000,
    "title": "MEXC taps Hacken for proof-of-reserves audits to boost transparency",
    "body": "The exchange will publish monthly, independently verified reserve reports, giving users third-party confirmation that assets are fully backed.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54651166,
    "published": 1763633020000,
    "title": "Ark Invest Buys the Slide, Adds Almost $40M of Crypto Stocks, as Market Drops",
    "body": "Cathie Wood's investment manager added to its holdings of Bullish (BLSH), Circle Internet (CRCL) and Bitmine (BMNR) as all three companies' stock prices fell.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|ARK Invest|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54652536,
    "published": 1763635171000,
    "title": "Bitcoin Core wins rare praise as independent audit finds no serious flaws",
    "body": "Bitcoin Core’s first independent audit found no serious vulnerabilities, with reviewers praising the project’s security, testing depth and overall code maturity.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54652442,
    "published": 1763635170000,
    "title": "Markets in Late-Cycle Phase, Not Recessionary: QCP",
    "body": "With the broader market “firmly past the early-cycle phase,” analysts see a bottoming process underway for Bitcoin.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54653180,
    "published": 1763636400000,
    "title": "Why Texas Is The New Gravity Center For AI, Crypto, And Capital",
    "body": "AI and crypto leaders are moving to Texas, drawn by cheap energy, pro-innovation rules, and massive investment that is turning the state into a tech powerhouse.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54653104,
    "published": 1763636357000,
    "title": "Abu Dhabi Investment Tripled IBIT Holdings in Q3 as Bitcoin Headed to Record High",
    "body": "The company sees bitcoin as a store of value, similar to gold, a spokesperson told Bloomberg.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Abu Dhabi|BlackRock|Bitcoin ETF|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54654204,
    "published": 1763638219000,
    "title": "Bitcoin To Suffer 40% Crash From All-Time High? Analyst Reveals ‘Final Target’",
    "body": "Sentiment around Bitcoin has suffered a major hit in recent weeks after the price fell below $100,000. This has led to a series of bearish predictions for the cryptocurrency, as many analysts and investors alike believe that the crash is far from over. One analyst, who goes by Mr. Wall Street on the X (formerly Twitter) platform, has predicted a step decline, revealing how low the Bitcoin price will go and when the crash should be expected to be over. Bitcoin Headed below $60,000? In the post, Mr. Wall Street expressed that the Bitcoin price has already hit its cycle top, and as such, there is nowhere else to go but down. The chart points to possible price reversals for the cryptocurrency, but ultimately, all of these are expected to be short-lived and precede further crashes. Related Reading: Wondering Why The XRP Price Is Still Lagging Despite Record ETF Launch? Read This As the Bitcoin price struggles to reclaim $100,000, the crypto analyst warns that it is more likely to crash further, highlighting the $74,000-$82,000 level as the next major point of interest. This would mean that Bitcoin could see a more than 10% drop in price from this level. However, the analyst doesn’t stop there ,as it seems the Bitcoin price is headed into another stretch of bear market. The year is already rapidly coming to an end, and the crypto analyst expects the year 2026 to be even more bearish. By next year, Mr. Wall Street believes that the Bitcoin price could fall below $60,000, reaching as low as $54,000. The timeframe for this is set in the last quarter of 2026, but this would also mark the bottom. Given this, the analyst believes that the $54,000-$60,000 will be the best time to get into the asset to position for the next wave of upward movements. Head And Shoulders Pattern Supports Decline The bearish sentiment is echoed by others such as Leshka.eth, whose recent analysis also points to a possible drop in price. The analyst shows that Bitcoin completed a head and shoulders pattern, with the neckline firmly in place. Given this, the price has entered into a state of reset, and this reset is far from over. Related Reading: Forget XRP, DFDV Exec Predicts Solana Price Is Headed For $10,000 Interestingly, Leshka.eth also posits that the Bitcoin price will crash by over 40% from its all-time high prices. This was highlighted in an earlier post that predicts that BTC is headed for as low as $40,000. The timeline also suggests that this will happen sometime in 2026, before a bottom is established. Featured image from Dall.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54654083,
    "published": 1763638051000,
    "title": "Best Crypto Presales To Watch As Bitwise’s XRP ETF ‘Historic Moment’ Lands Today",
    "body": "What to Know: Bitwise’s XRP ETF has launched on NYSE Arca with a 0.34% fee waived on the first $500M, positioning XRP as an institution-ready asset. XRP dropped more than 9% into the launch before recovering, with higher volumes and futures open interest indicating renewed speculative and hedging activity. Best Wallet Token, Bitcoin Hyper, and Ionix Chain map onto themes supported by ETF flows: self-custody, Bitcoin scalability, and AI-native infrastructure. These projects provide presale access and strong utility narratives but still come with early-stage risks tied to execution, exchange listings, and long-term adoption. Bitwise’s spot XRP ETF is finally live on NYSE Arca under the ticker ‘XRP’, and the issuer is calling it a ‘historic moment’. The $15B asset manager has set a 0.34% management fee and is waiving it for the first month on the first $500M of assets, an aggressive move to capture early institutional flow. The market reaction has already been spicy. XRP dumped more than 9% to around $2 on classic ‘sell the news’ flows, then bounced back to about $2.12 as volumes jumped and futures open interest ticked higher. That’s the ETF era in a nutshell: institutions get a cleaner wrapper, traders get more volatility to play with. This matters beyond XRP. Spot ETFs helped normalize exposure to $BTC and $ETH; now one of the biggest payments tokens is getting the same treatment. As capital moves from blue chips into higher-beta plays, altcoins and the best crypto presales tend to ride the second wave of risk-on sentiment. Three presales line up neatly with this shift: a wallet super-app built for self-custody, a Bitcoin Layer-2 turning ‘digital gold’ into active collateral, and an AI-native Layer-1 chasing the next infrastructure trade. Here’s how Best Wallet Token, Bitcoin Hyper, and Ionix Chain fit into the post-ETF landscape. 1. Best Wallet Token ($BEST): Wallet Super-App For The Post-ETF Onboarding Wave If XRP ETFs succeed, a fresh wave of non-crypto natives will end up holding digital assets for the first time. Those users eventually graduate from brokerage accounts into self-custody, and that’s exactly where Best Wallet Token tries to position itself. Best Wallet is a live, non-custodial, multi-chain wallet with fiat on/off-ramps, portfolio tracking, and cross-chain swaps routed through hundreds of DEXs and bridges. It already counts hundreds of thousands of users, supports major chains like Bitcoin, Ethereum, Solana, and BNB Chain, and is rolling out a debit card, analytics suite, advanced order types, and a staking aggregator. The idea is simple: one app that feels like a trading terminal, not a barebones wallet. Best Wallet Token ($BEST) is the access key to that stack. Holders get reduced swap and on-ramp fees, boosted staking yields, governance rights, and early ‘Stage 0’ access to new token launches inside the wallet’s launchpad. The presale has raised over $17.23M so far, with the current stage pricing $BEST at about $0.025975 and staking yields around 76% APY for early participants. To buy $BEST and start staking, check out our guide. Our $BEST price prediction suggests that, if the roadmap lands and exchange listings arrive in a supportive market, $BEST could potentially reach up to roughly $0.05106175 in 2026. From today’s presale level, that implies a 96% upside scenario. If ETF flows pull more people into crypto, full-stack self-custody tools should be one of the structural winners. Check out Best Wallet Token. 2. Bitcoin Hyper ($HYPER): BTC Layer-2 Turning ‘Digital Gold’ Into DeFi Collateral While XRP steals today’s headlines, Bitcoin is still the main liquidity engine in this market. The problem: as a base layer, it’s slow, expensive, and terrible for DeFi. Bitcoin Hyper ($HYPER) is trying to fix that without touching Bitcoin’s core security model. Bitcoin Hyper builds a high-throughput Layer-2 using the Solana Virtual Machine . Users bridge $BTC into the network via a canonical bridge; wrapped $BTC then moves on a fast chain with near-instant finality and sub-cent fees, while settlement still anchors back to Bitcoin. That opens the door for $BTC-denominated DeFi, NFTs, gaming, and even meme coins, all while remaining ‘Bitcoin-native’. The HYPER presale has already crossed roughly $28M raised at a token price of $0.013305, with staking rewards at 41% APY. There’s no private VC round in front, and on-chain data shows multiple six-figure whale tickets (including a $500K buy and a $379K purchase ), which is why this sale keeps popping up on presale trackers. Learn how to buy $HYPER to get in early. From a valuation angle, our $HYPER price prediction put a potential 2026 high around $0.08625. Measured from the current sale level, that’s roughly 546% upside in the optimistic case. The thesis is clean: if ETFs push more capital into $BTC, a working $BTC Layer-2 that actually lets that capital do something could be in the slipstream. Research Bitcoin Hyper today. 3. Ionix Chain ($IONX) — Quantum AI Layer-1 With Built-In Revenue Sharing Where XRP ETFs reflect TradFi edging into crypto, Ionix Chain ($IONX) represents the opposite direction: crypto infrastructure leaning into AI. Ionix pitches itself as the first AI-native Layer-1 blockchain using a proprietary Quantum AI Consensus to hit up to 500,000 TPS with sub-second finality and gas fees near $0.0005. Under the hood it combines Proof-of-Stake with a DAG-style architecture, plus sharding, to stay scalable as usage grows. The network is designed for AI-heavy workloads: adaptive smart contracts that optimize in real time, on-chain ML computation, and cross-chain bridges into ecosystems like Ethereum and Solana. In other words, it’s built for the part of the market where AI and DeFi start blending, exactly the type of narrative that tends to catch fire when risk appetite returns after big events like the XRP ETF launch. Tokenomics are tailored to keep holders plugged in. $IONX stakers can currently earn around 12% APY in the presale, while the protocol plans to distribute 15% of daily gas fees back to token holders and add up to 5% loyalty airdrops for early participants. The presale has already raised more than $1.57M, with the current stage pricing IONX at about $0.050. If the mainnet lands by 2026, major CEX/DEX listings go ahead around the planned $2 listing band, and the AI-chain narrative actually converts to real usage, Ionix could launch hard and climb fast. The XRP ETF launch marks another step in crypto’s institutionalization, with Bitwise offering fee-waived exposure to XRP just as traders lean back into risk. That backdrop sets the scene for selectively hunting upside further out the curve. Best Wallet Token targets the self-custody and tools layer, Bitcoin Hyper extends Bitcoin into high-speed DeFi, and Ionix Chain bets on AI-driven infrastructure, three very different ways to play the same shift in capital and narrative. This article is informational only and not financial advice. Crypto presales are high-risk; never invest money you cannot afford to lose. Authored by Aaron Walker for NewsBTC – https://www.newsbtc.com/news/best-crypto-presales-bitwise-xrp-etf-launch-best-wallet-hyper-ionix",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54653926,
    "published": 1763637447000,
    "title": "BitMine sits on $3.7B loss as DAT ‘Hotel California’ meets BlackRock’s staked ETH ETF",
    "body": "BitMine’s $3.7 billion paper loss and the falling mNAV valuations are threatening the business model of DATs, according to 10x Research.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54655619,
    "published": 1763640810000,
    "title": "AI and HPC Bitcoin Miners Surge Pre Market Following Stellar NVIDIA Earnings",
    "body": "Strong NVIDIA guidance lifts pre market sentiment across bitcoin miners while NAKA delivers delayed Q3 losses.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Nakamoto|AI|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54656740,
    "published": 1763642893000,
    "title": "US Bitcoin ETFs snap five-day bloodbath as BTC reclaims $92K",
    "body": "US spot Bitcoin ETFs logged $75 million in inflows after five days of redemptions, hinting at early stabilization as Bitcoin recovers above the $92,000 level.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54656738,
    "published": 1763642699000,
    "title": "Samourai sentences cement DOJ’s money transmitter theory for crypto mixers",
    "body": "Samourai Wallet’s co-founders received four- and five-year prison terms in the US for operating an unlicensed money-transmitting business through their non-custodial crypto mixer.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54657138,
    "published": 1763643662000,
    "title": "Sequence Aims to Take the Complexity Out of Crypto Payments With Trails",
    "body": "Infrastructure firm Sequence seeks to solve crypto's fragmentation problem with Trails, a platform to simplify payments across chains.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54657054,
    "published": 1763643556000,
    "title": "Nvidia’s $54B Earnings Test and Fed Minutes Put Best Wallet Token in Play",
    "body": "What to Know: Nvidia’s $54.8B earnings report, Fed Minutes, and a muted 50K jobs print could collectively reset risk sentiment in favor of crypto. Bitcoin’s drop toward seven-month lows looks sentiment-driven, and a dovish macro trifecta may trigger a sharp relief rally in majors. Best Wallet Token powers a multi-chain, security-first wallet that bundles fee discounts, staking, launchpad access, and future card rewards into one token. If roadmap execution and market conditions align, $BEST offers a leveraged play on multi-chain adoption rather than a single-narrative altcoin bet. Markets are walking a tightrope this week. Nvidia is set to report $54B+ in Q3 revenue , a figure big enough to make or break the AI trade that has driven much of 2025’s risk rally. Futures across stocks and crypto have been drifting as traders wait to see whether the world’s top AI chipmaker can justify its massive valuation and keep the AI narrative alive. At the same time, the Federal Reserve’s October Meeting Minutes and the delayed September US jobs report are about to drop. Economists expect roughly 50K new jobs, a clear comedown from earlier in the year. A softer payrolls print combined with divided Fed views on further cuts would reinforce the idea that policy is slowly tilting back toward easier conditions, even if inflation is still above target. Bitcoin has already been slapped down to near seven-month lows, roughly 25–30% below its recent peak, in a pullback analysts describe as sentiment-driven rather than structural. If Nvidia smashes expectations and the macro data lean dovish, that combination could flip the switch back to ‘risk-on’ and give both Bitcoin and altcoins room for a sharp relief rally. When that kind of macro reset hits, fresh liquidity doesn’t just chase the majors. It needs rails, wallets, and launchpads that make it easy for new users to move from fiat into crypto, hop across chains, and discover the next wave of tokens. That’s where infrastructure plays come in, and it’s exactly the lane Best Wallet Token ($BEST) is trying to own with a multi-chain wallet, in-app presale access, and a presale that has already raised more than $17.2M at $0.025975 per token with around 76% staking rewards. Best Wallet Token Aims to Be the Default On-Ramp The current non-custodial wallet landscape is messy. Newcomers juggle multiple apps, seed phrases, and gas settings across chains, while veterans still pay too much in swap fees and miss early-stage deals because everything is fragmented. Best Wallet is designed to stitch that chaos together, and Best Wallet Token is there to help. The app is a true multi-chain wallet, with support for Bitcoin, Ethereum, Solana, BNB Chain, Polygon, Base and more, letting users buy, store, deposit, send, and swap thousands of tokens from one interface. Fiat on-ramps are integrated through partners like Onramper to surface aggressive rates and lower card processing costs, which matters when altcoin rotations kick off and every percentage point of friction eats into upside. Security is handled with MPC tech from Fireblocks and cloud backups instead of exposed seed phrases, plus features like 2FA, biometric login, and advanced anti-fraud tooling. That’s aimed squarely at the next wave of users who want self-custody without feeling like they’re one mistyped word away from losing a portfolio. On top sits the $BEST token . Holding $BEST reduces transaction fees when buying or swapping crypto in-app, cuts swap costs across the 330-DEX, 30-bridge routing stack, and boosts rewards on the upcoming Best Card, which plans up to 8% cashback for heavy users. Learn more about $BEST in our Best Wallet Token guide . Best Wallet’s launchpad feature also gives $BEST holders early access to the best crypto presales at a ‘Phase 0’ price before wider listings, letting them rotate into new narratives faster and cheaper than users stuck on legacy wallets. This lines up neatly with where the market is heading. Tokenized funds, regulated stablecoins, and payments giants experimenting with on-chain rails all point toward a future where compliant wallets with deep DeFi hooks become the main interface for value transfer. Best Wallet is built to sit in that intersection, connecting regulated stablecoin flows with native DeFi and presale access. As capital trickles back into risk assets, a wallet-plus-token combo that makes multi-chain navigation easy could attract both first-timers and battle-hardened degen traders. Watch $BEST as onboarding demand grows. Inside the $BEST Presale, Staking, and Potential Upside The presale is currently priced at $0.025975 per token, with more than $17.2M already raised and a sizeable social footprint across X, Telegram, and Discord. Staking is live during the presale, offering 76% APY powered by an 800M-token (8%) allocation dedicated to staking rewards. That lets early buyers immediately put idle tokens to work while the sale is still ongoing, compounding exposure if the token lists into an improving macro backdrop. Learn how to join and stake in our guide to buying $BEST tokens . Our $BEST price prediction suggest that $BEST could trade around $0.035215 in 2025 and $0.05106 in 2026. From today’s presale price, those levels would roughly equate to 36% and 97% upside respectively, before factoring in any staking yield. None of that is guaranteed, but it sketches out the kind of risk-reward profile some presale buyers are targeting. If Nvidia’s earnings confirm that the AI boom still has legs and the Fed’s tone softens on the back of a weak 50K jobs print, that cocktail could refill the risk-asset punch bowl. In those conditions, a presale-stage wallet token plugged directly into multi-chain liquidity, presales, and stablecoin rails becomes a clear way to get leveraged exposure to the next adoption wave without betting on a single niche sector like meme coins or gaming. Join $BEST before the presale closes. This article is informational only, not investment advice; crypto prices and presale outcomes are highly speculative and capital is at risk. Authored by Aaron Walker, NewsBTC – https://www.newsbtc.com/news/nvidia-54b-earnings-fed-minutes-boost-best-wallet-token-presale",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54656830,
    "published": 1763643010000,
    "title": "Why Maxi Doge Could Run After SPX6900 Rebound – Best Meme Coins Reset",
    "body": "What to Know: SPX6900 has rebounded from support near $0.44 to the $0.56 zone on strengthening volume and positive funding rates. Technical signals point to easing bearish pressure and a potential move toward higher resistance, keeping meme coin risk firmly in play. Maxi Doge ($MAXI) aligns with this revived meme momentum through Ethereum-based tokenomics, staking, contests, and lifestyle branding centered on leverage culture. The $MAXI presale offers high staking APY and low entry pricing, though long-term performance still relies on delivery and community expansion. SPX6900 has quietly flipped the script this week. After tagging key support near $0.44 on Monday, the ‘meme S&P 500’ bounced more than 25%, now trading at around $0.56 with solid green candles on the daily chart. On-chain and derivatives data back up the move. Spot and futures volume climbed above $65M, whale orders are skewed to the buy side, and funding rates have turned positive, showing more traders paying to stay long than to stay short. 📈 The daily RSI has pushed up from oversold while MACD has flipped bullish, hinting that the worst of the pullback may be behind SPX for now. When a flagship meme index like SPX6900 stops bleeding and starts grinding higher again, it usually does two things. It restores risk appetite across the meme coin complex and it reminds everyone that ‘joke’ tokens can move like small caps on caffeine when liquidity comes back. For traders scanning for the best meme coins, that combination matters more than the short-term price target. This is exactly the backdrop where the best meme coins tend to catch a bid. If capital rotates back into meme coin plays, traders often look beyond the already-run majors to cheaper, more narrative-driven tokens that can ride the same wave with more upside. That is where Maxi Doge ($MAXI) is positioning itself: a gym-rat Doge for the leverage era, with staking yield and lifestyle branding designed for traders who live on perpetuals charts rather than blue-chip fundamentals. SPX6900 Momentum Sets the Stage for Maxi Doge SPX6900’s whole pitch is financial satire: a parody of the S&P 500 where ‘6900 > 500’ and the market becomes a meme in itself. It runs on Ethereum with multi-chain extensions and has built a cult community by mocking the seriousness of traditional benchmarks while still delivering real liquidity. The current rebound is driven by real flows, not just vibes. Trading volume has hit its highest level since early November as funding flips positive. Historically, that kind of shift in SPX6900 has preceded sharp upside moves as sidelined traders FOMO back in. 💡 When that happens, attention usually spills over into the broader meme coin basket. Dog coins, high-volatility newcomers and presales with strong narratives tend to see more traffic as traders look for ‘the next $SPX’ at a fraction of the price. Maxi Doge leans directly into that environment. It brands itself as the mascot of max-risk trading culture: a 240-lb Shiba Inu lifting weights between 1000x leverage sessions, built specifically for the degen mood that SPX6900 embodies. If SPX6900 can extend its recovery, meme coin risk could stay elevated into year-end. In that scenario, projects that offer pure meme coin energy plus simple, understandable tokenomics are likely to benefit first. That is the niche Maxi Doge is trying to occupy: not competing with $SPX itself but acting as a smaller-cap satellite play on the same sentiment. Maxi Doge Presale, Staking and Meme Utility Explained Under the memes, Maxi Doge ($MAXI) is a straightforward ERC-20 token on Ethereum’s Proof-of-Stake network, with transactions secured by audited smart contracts. Total supply is capped at roughly 150B tokens, split across marketing, development, liquidity, staking and the project’s ‘Maxi Fund’ treasury. That treasury, plus a 40% marketing bucket, are designed to keep the meme visible with KOL deals, ads and potential exchange campaigns once trading goes live. Where Maxi Doge tries to go beyond pure hype is yield. Current staking rewards sit at 74% APY, paid in $MAXI, with distributions handled by a daily smart-contract pool. 💡 For anyone used to holding $DOGE or $SHIB for vibes alone, the idea of locking tokens and earning protocol yield is a clear upgrade, even if the rate naturally trends lower as more tokens are staked. On the adoption side, the presale has already raised more than $4.1M, with the current token price at $0.000269. Multiple stages nudge the price up over time, which is why early entries focus on locking in the lower bands before the next increment hits. To join now, learn how to buy $MAXI with our step-by-step guide. In the meantime, tens of billions of tokens are already staked, suggesting that a decent chunk of the early base is not planning to insta-dump at TGE. Of course, Maxi Doge still lives and dies by community and execution. The team remains anonymous, the roadmap is deliberately tongue-in-cheek, and real value will depend on whether staking, contests and partner events actually gain traction once the presale ends. Still, in a market where SPX6900 is reminding everyone that memes can move billions, a $4.1M meme coin presale with yield and audits attached will naturally catch attention. 🚀 Join the Maxi Doge presale today. Disclaimer: This article is for educational purposes only; cryptocurrencies are highly volatile and readers should do independent research before investing. Authored by Aaron Walker for NewsBTC – https://www.newsbtc.com/news/best-meme-coins-spx6900-rebound-maxi-doge-presale",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 44,
        "NAME": "SHIB",
        "CATEGORY": "SHIB"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54657532,
    "published": 1763644455000,
    "title": "JPMorgan Warns MSCI Decision Could Force Strategy Out of Top Equity Indices",
    "body": "The bank said billions in passive flows could unwind if MSCI removes Strategy from major equity benchmarks, heightening pressure on the bitcoin-levered firm.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Strategy|MSCI|JPMorgan|Analysts|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54657441,
    "published": 1763644262000,
    "title": "Warner Music Moves From Litigation to Licensing With Udio",
    "body": "The AI music generator will transition to a licensed model where artists control participation and receive compensation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54657508,
    "published": 1763644212000,
    "title": "Bitcoin whale Owen Gunden dumps entire $1.3B stack as institutions tighten grip",
    "body": "Bitcoin OG Owen Gunden sells $1.3 billion in BTC as retail panic grows, while institutional ownership of Bitcoin ETFs climbs to 40% despite market fear.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54657988,
    "published": 1763645391000,
    "title": "B. Riley Cuts Digital Asset Treasury Company Price Targets as Crypto Slump Deepens",
    "body": "The investment bank slashed price targets across so-called Datcos, citing sector-wide pressure and weaker accumulation trends.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Digital Asset Treasury|Bitmine|B. Riley|Analysts|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54658613,
    "published": 1763646362000,
    "title": "Morning Minute: Ethereum Rolls Out 'Interop Layer' for Single Unified Chain Vision",
    "body": "The Ethereum Interoperability Layer will let any Ethereum L2 talk to any other L2, resolving one of its main user experience issues.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Opinion",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54659046,
    "published": 1763647200000,
    "title": "World App Starts Virtual Bank Accounts Pilot for USDC Payroll Deposits",
    "body": "The feature issues unique virtual account numbers, allowing users to receive direct deposits, like payroll payments, straight into the World App.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|World app|World Token|USDC|Sam Altman|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54659130,
    "published": 1763647262000,
    "title": "Record Financial Pushes Real-Time Royalties on Avalanche to Modernize Music Payments",
    "body": "Record Financial’s push for on-chain royalties is gaining traction among labels and artists seeking faster, more transparent payouts.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54659948,
    "published": 1763649008000,
    "title": "Cipher Mining Inks New 10-Year HPC Deal With Fluidstack; Shares Rise 13%",
    "body": "The expansion adds 56 MW at Barber Lake and secures $830 million in contracted revenue, reinforced by increased Google backing.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Cipher Mining|AI|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      }
    ]
  },
  {
    "id": 54659953,
    "published": 1763649002000,
    "title": "Bitcoin Whale Activity Explodes: Analysts Brace For Strongest Surge This Year",
    "body": "Bitcoin fell below $90,000 this week for the first time in seven months, and big transfers have surged. Related Reading: XRP Supply Shock Ahead? ETFs Could Consume It All, Analyst Predicts According to Santiment, more than 102,000 transactions above $100,000 and roughly 29,000 transactions above $1 million were recorded over the recent stretch — a level that could make this the most active whale week of 2025. Whale Counts Climb As Small Holders Fall Back Based on Glassnode figures, the number of addresses holding at least 1,000 BTC rose to 1,384 from 1,354 about three weeks earlier, a 2.2% rise and the highest count in four months. At the same time, wallets with one BTC or less slipped to about 977,420 from 980,577 late in October, showing smaller holders are thinning out. Those two trends together have some market watchers reading a shift from panic selling toward larger buyers taking positions. 📊 Bitcoin’s whales have gotten more and more active as prices have dumped over the past six weeks. So far this week, we have seen: 🐋 Over 102.9K Whale Transactions exceeding $100K 🐳 Over 29K Whale Transactions exceeding $1M 😮 This week has a good chance of ending up as the… pic.twitter.com/oHsnMfEjgP — Santiment (@santimentfeed) November 19, 2025 Traders And Analysts See Two Things At Once Some traders argue the big transfers are plain buying. Others say the pattern looks like forced selling by leveraged accounts, followed by accumulation as the market finds a new base. One on-chain observer flagged repeated, time-bound selling that could be tied to liquidation events, a pattern that might end once available supply dries up or liquidations stop. Market Sentiment Has Turned Very Negative Sentiment gauges show fear is strong. Reports put the Crypto Fear & Greed Index near 11, a reading inside the “extreme fear” zone, and on-chain short-term holder measures have weakened, with the STH Realized Profit-Loss Ratio dipping below levels often seen around local lows. Taken together, those readings suggest many recent buyers are underwater and that capitulation has been intense. If large transfers recorded by Santiment were mostly outbound from exchanges, that would look like accumulation into cold storage or OTC custody and could reduce sell pressure. If those moves were inbound to exchange wallets, the same flows could point to distribution. Right now, the data show a mixture: big holders are increasing their counts while weaker hands exit, which can support a stabilizing bottom, but it also leaves room for short-term swings if another forced seller appears. Related Reading: With 42% Of XRP Holders Underwater, Analysts Say The Altcoin Could Crash Even Further Several market participants described the move as a “washout” that clears short-term froth. Others noted that news events — from major earnings to macro headlines — have amplified twitch trading and sudden swings, which can trigger both big transfers and sudden price drops. A handful of asset managers say they are seeing buying at discounted prices while retail participation cools. Featured image from Gemini, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|whales",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54659979,
    "published": 1763648778000,
    "title": "Aave, Chainlink ETPs among six new 21Shares listings in Europe",
    "body": "21Shares, one of the largest crypto ETF issuers with $8 billion in assets, continues to introduce more investment products in Europe as an influx of new crypto ETFs hits the US.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54659879,
    "published": 1763648754000,
    "title": "Jamaica’s First Native Bitcoin App Is Helping With Hurricane Relief",
    "body": "Flash—a Bitcoin app—is being used for fundraising and to purchase food and supplies for the victims of Hurricane Melissa, which recently ravaged Jamaica.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54659665,
    "published": 1763648400000,
    "title": "CoinDesk 20 Performance Update: Aptos (APT) Gains 10% as All Index Constituents Rise",
    "body": "Polygon (POL) was also a top performer, up 7.9% from Wednesday.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "CoinDesk Indices|CoinDesk Indices|CoinDesk 20|charts|Prices|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 38,
        "NAME": "MATIC",
        "CATEGORY": "MATIC"
      },
      {
        "TYPE": "122",
        "ID": 70,
        "NAME": "APT",
        "CATEGORY": "APT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54660090,
    "published": 1763648778000,
    "title": "21Shares lists six more crypto ETPs in Europe: Aave, Cardano and more",
    "body": "21Shares, one of the largest crypto ETF issuers with $8 billion in assets, continues to introduce more investment products in Europe as an influx of new crypto ETFs hits the US.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54660953,
    "published": 1763650853000,
    "title": "Securitize Leverages Plume to Expand Global Real-World Asset Reach",
    "body": "Securitize partners with Plume to launch institutional-grade assets on Plume's Nest staking protocol, expanding its DeFi footprint.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Tokenization|Markets|Securitize|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54660768,
    "published": 1763650522000,
    "title": "Tether Invests in LatAm Crypto Infrastructure Firm Parfin to Boost USDT Among Institutions",
    "body": "The investment is part of Tether’s broader push to expand stablecoin settlement and tokenization tools among institutions across Latin America, the firm said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Tether|Stablecoin|Latin American|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54660576,
    "published": 1763649993000,
    "title": "Aztec launches decentralized and private Ethereum L2 on mainnet, almost",
    "body": "Aztec launched its Ignition mainnet with no centralized operators, opening community staking ahead of a major token sale and positioning itself as a fully decentralized L2.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 205,
        "NAME": "TOKEN SALE",
        "CATEGORY": "TOKEN SALE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54660934,
    "published": 1763642699000,
    "title": "After Samourai, DOJ’s money-transmitter theory now looms over crypto mixers",
    "body": "Samourai Wallet’s co-founders received four- and five-year prison terms in the US for operating an unlicensed money-transmitting business through their non-custodial crypto mixer.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54661610,
    "published": 1763652016000,
    "title": "BlackRock’s Staked Ethereum ETF Play Could Supercharge Bitcoin Hyper",
    "body": "What to Know: BlackRock’s move toward a staked Ethereum ETF marks the arrival of yield-bearing crypto ETFs that blend price exposure with on-chain staking rewards. The success of ETHA and broader interest in staking products indicate that major asset managers are ready to scale deeper into core crypto infrastructure. Bitcoin Hyper addresses Bitcoin’s scalability limits through a rollup-style Layer-2 using wrapped BTC, aiming to transform Bitcoin into a functional DeFi settlement layer. With more than $28M raised, 41% staking rewards, and utility tied directly to Bitcoin’s expansion, Bitcoin Hyper provides asymmetric upside in an ETF-driven market cycle. BlackRock just spun up a new trust in Delaware for an iShares Staked Ethereum Trust ETF, signaling phase two of institutional crypto: yield on-chain, wrapped in TradFi. Roughly 15 months after launching its flagship Ethereum ETF, $ETHA, the asset management giant is now lining up a product that combines $ETH price exposure with staking rewards. $ETHA, which launched in July 2024, has already pulled in around $13B in inflows and quickly became one of the most successful spot Ethereum ETFs on the market. The key detail: ETHA itself does not stake its $ETH, so investors get pure price exposure alone, and nothing from the roughly 4% average staking yield that validators earn on-chain. The new trust changes that equation. A staked $ETH ETF would transform Ethereum exposure into a total-return product, tacking on staking yield to capital gains. That kind of structure is tailor-made for institutions that want the benefits of blockchain without running their own validator infrastructure or worrying about slashing risks. As more issuers follow with staking products, a larger slice of $ETH will be locked up, tightening supply and deepening liquidity in regulated venues. When big money gets comfortable with yield-bearing crypto ETFs on Bitcoin and Ethereum, the usual pattern is simple: liquidity and attention trickle down the risk curve. First majors, then high-beta infrastructure plays. In this cycle, one of the cleanest ways to express that ‘higher beta on Bitcoin’ thesis is not another meme coin, but a Bitcoin Layer-2 like Bitcoin Hyper ($HYPER) that tracks Bitcoin’s performance while adding real utility. That is where Bitcoin Hyper’s ongoing presale starts to look very interesting. Bitcoin Hyper Turns Bitcoin into A Scalable DeFi Powerhouse Bitcoin Hyper is building a Layer-2 rollup on top of Bitcoin that batches transactions off-chain, executes them at high speed, then settles the final state back to Bitcoin Layer-1. In practice, it aims to turn Bitcoin into something that feels closer to Solana in terms of speed, while still inheriting Bitcoin’s battle-tested security. To do this, the team uses a canonical bridge that wraps native $BTC into a compatible asset for use on the Hyper rollup. A Solana Virtual Machine environment then handles execution, enabling thousands of transactions per second and near-instant finality. On top of that, developers can plug in DeFi protocols, NFT marketplaces, and other dApps that simply are not viable on Bitcoin’s base layer today. This is the pain point Bitcoin Hyper goes after: Bitcoin is the largest, most trusted asset in crypto, yet still awkward to use beyond simple transfers and custody. Fees spike in every hype cycle, throughput caps out around single-digit TPS, and DeFi flows largely bypass the network. By pushing computation to an L2 while anchoring security on Bitcoin, Hyper tries to unlock that trapped value. From a macro angle, the timing lines up with the ETF story. As spot Bitcoin ETFs accumulate coins and BlackRock explores yield products on Ethereum, more institutional capital is parked in base-layer assets. The next logical step is infrastructure that lets those assets actually move and work in DeFi. A Bitcoin-native L2 that can route wrapped BTC into lending, DEXs, and payments is directly aligned with that shift. Add in the project’s public focus on conservative security assumptions, and the narrative becomes straightforward: a scaling solution that respects the base chain, rather than trying to replace it. Bitcoin Hyper Presale, Staking Rewards, And ETF-Driven Upside On the numbers side, the Bitcoin Hyper presale has already raised over $28M, with the current token price sitting at $0.013305. That puts it in the upper tier of the best crypto presales of 2025 and suggests there is real appetite for Bitcoin-aligned infrastructure rather than just memes. Staking is a major part of the pitch. Early buyers can stake $HYPER for reported rewards of around 41%, turning idle presale allocations into a yield-bearing position while the team ships its roadmap. Learn how to buy and stake $HYPER today. For investors who are already eyeing BlackRock’s staked $ETH ETF as a source of passive income, that kind of on-chain yield on a high-beta token adds an extra layer of torque. There is also a clear roadmap-linked upside story. Our price modeling sees potential highs of $0.08625 in 2026 if Bitcoin Hyper hits its milestones around mainnet, early dApps, and DAO launch. Relative to the current presale price of $0.013305, that target implies roughly a 546% increase. For holders who already believe in Bitcoin’s long-term trajectory and see BlackRock-style products as confirmation, $HYPER acts like a leveraged play on that same thesis: more throughput, more DeFi rails, and more ways for $BTC liquidity to earn yield. In other words, while BlackRock stays tightly focused on Bitcoin and Ethereum ETFs, investors who want to front-run where that institutional adoption might push demand next are looking directly at Bitcoin Layer-2s. Right now, Bitcoin Hyper is one of the few presales offering that combination of narrative fit, clear technical design, and significant capital already committed. Check out the Bitcoin Hyper presale. This article is for informational purposes only and is not financial advice. Crypto and presale investments are highly volatile and risky. Authored by Aaron Walker for NewsBTC — https://www.newsbtc.com/news/ blackrock-staked-ethereum-etf-bitcoin-hyper-layer2-presale",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54661582,
    "published": 1763649993000,
    "title": "Aztec launches decentralized and private Ethereum L2 on mainnet, almost",
    "body": "Aztec launched its Ignition mainnet with no centralized operators, opening community staking amid its major token sale and positioning itself as a fully decentralized L2.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 205,
        "NAME": "TOKEN SALE",
        "CATEGORY": "TOKEN SALE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54662085,
    "published": 1763652746000,
    "title": "Solana ETFs Post Second-Biggest November Inflows as Demand Grows During Downturn",
    "body": "Spot SOL exchange-traded funds extended an inflow streak since they began trading on Oct. 28 while bitcoin and ether ETFs bled hundreds of millions of dollars.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|ETFs|Solana News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54662967,
    "published": 1763654433000,
    "title": "Pundit’s Bitcoin 3-Month Scenario Shows Massive Crash, Here’s The Target",
    "body": "Crypto pundit Andrea has shared a 3-month scenario for Bitcoin that shows the flagship crypto could suffer a massive crash. This crash is expected to follow BTC’s rebound and an end-of-year rally to new highs. Pundit Projects Bitcoin Crash To $60,000 After Rebound To New Highs In an X post, Andrea shared an accompanying chart showing that Bitcoin could eventually crash to $60,000, with the crash expected sometime in mid-2026. However, before then, the crypto pundit predicted that BTC could still rally to new highs despite its recent crash below the psychological $100,000 level. Related Reading: Here’s Why The Bitcoin Price Keeps Crashing- Is $80,000 Next? Specifically, he revealed a potential three-month scenario for Bitcoin, stating that he expects an end-of-year rally to at least $115,000-$116,000. The crypto pundit added that if BTC can break that level, then it could push towards $135,000 and $140,000, which will mark new all-time highs (ATHs) for the flagship crypto. However, Andrea stated that the peculiarity of this pump will be with a dropping BTC dominance, with altcoins outperforming the flagship crypto. This analysis comes amid Bitcoin’s most recent crash below $90,000, which marked a seven-month low for BTC. Notably, veteran trader Peter Brandt has predicted that this decline could extend further, with the flagship crypto dropping to as low as $58,000. Brandt questioned whether Bitcoin’s sweeping reversal on November 11, followed by 8 days of lower highs and the completion of a massive broadening top, qualifies as a bear market. He added that the targets implied are $81,000 and $58,000. The veteran trader also remarked that those who claim they will be big buyers at $58,000 will be pukers by the time BTC reaches $60,000. BTC Suffers A Breakdown Of The Megaphone Pattern Crypto analyst Colin revealed that Bitcoin has broken down from the megaphone pattern. He noted that without a quick recovery in the next day or two, this would suggest that BTC is entering a bear market. He opined that this bear market may be less intense due to diminishing returns and diminishing losses each cycle. Related Reading: 4 Bitcoin Indicators That Led To Market Rallies In The Last 2 Years Have Returned The analyst reiterated that if the Bitcoin price can reclaim the 50-week moving average before the week is over, it could signal a bullish outlook for the flagship crypto. However, until then, he remarked that it is better to assume that a bear market or bigger correction is the most likely scenario. Colin also raised the possibility of BTC following the ISM (business cycle) higher in a big move next year, after this corrective period. If that happens, then the bear market may be short-lived. At the time of writing, the Bitcoin price is trading at around $93,000, up almost 2% in the last 24 hours, according to data from CoinMarketCap. Featured image from Pngtree, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|Andrea|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|CoinMarketCap|Colin|ISM|Peter Brandt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54662936,
    "published": 1763654215000,
    "title": "Tether backs Parfin to push institutional USDT adoption across Latin America",
    "body": "The investment will help Parfin expand its onchain settlement tools and strengthen stablecoin infrastructure that is already driving institutional crypto use in LATAM.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54663387,
    "published": 1763655146000,
    "title": "What Next For XRP as Bitcoin Loses $90,000 Level Again",
    "body": "Institutional activity declined significantly, and the market remains pressured by Bitcoin's weak structure and ETF outflows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54663830,
    "published": 1763655897000,
    "title": "Proposed Bitcoin for America Bill Would Enable BTC Tax Payments, Which Go to Reserve",
    "body": "Introduced Thursday, the bill would allow Americans to pay their taxes in Bitcoin, with those funds being used to grow the U.S. stockpile.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54663677,
    "published": 1763655533000,
    "title": "Ethereum’s Fusaka Upgrade Signals New Era for Value Accrual: Fidelity Digital Assets",
    "body": "The upgrade marks a sharper strategic turn for the blockchain, aligning protocol development with economic intent and strengthening the case for ether.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Ethereum News|Fusaka|Fidelity Digital Assets|Analysts|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54664903,
    "published": 1763658047000,
    "title": "Here’s The Resistance Zone Keeping The Dogecoin Price From Rallying",
    "body": "The Dogecoin price has spent the past several days moving through a noticeably weaker phase, falling from the mid-$0.18 region into a prolonged decline that has kept the price tilted downward. The chart shows a major high forming near $0.18311 before sellers forced the price into a tight downtrend, but every attempted bounce has turned into another correction. Technical analysis from BitGuru focuses on why this rebound attempt is still weak and what Dogecoin must break above before any meaningful rally can begin. Dogecoin Price Downtrend And Repeated Corrections The structure of Dogecoin’s price action since reaching $0.183 on November 10 makes the weakness clear. After topping at $0.18311, Dogecoin slipped into a descending channel, with the downtrend highlighted by lower highs across November 11 and 12. Each time the price tried to push upward, the move stalled at a predictable level, creating another corrective swing. The chart shows this clearly during the November 13 and 14 period, where a modest recovery reached $0.16598 before sellers regained control. Related Reading: Analyst Says You’re Looking At XRP The Wrong Way, Here’s What It Actually Does Since then, the price pattern shows that the Dogecoin price has been following a controlled downtrend. The selling pressure is consistent, and every rebound so far has been capped by the same resistance around $0.166. The momentum has been drifting downward for most of the past week, keeping the Dogecoin price suppressed below this price level. the most recent candles on the chart show Dogecoin attempted another rebound after a drop into the $0.153 region. BitGuru noted that this bounce is not enough to confirm a reversal, and a stronger recovery will only be confirmed if it breaks above the nearby resistance zone. The current price action in the past few days shows Dogecoin is holding above short-term support, but it has not yet shown the strength required to break out of the sideways-to-downward structure. Until the candles break above the compression zone formed between November 15 and 16, then Dogecoin might continue trading sideways. Dogecoin / TetherUS. Source: BitGuru On X The Resistance Zone Dogecoin Must Break BitGuru’s main focus is the resistance zone that has repeatedly rejected Dogecoin. From the chart, this resistance stretches across the range between $0.163 and $0.167, coinciding with the point where the last two consolidation phases stalled. Each time Dogecoin reached this area, selling pressure increased, creating another correction. Related Reading: Model Shows How XRP Could Hit $24 After ETFs Go Live The chart shows this clearly in the boxed region leading into the November 16 decline, where Dogecoin hovered below $0.16598 for several hours before slipping again. This zone is acting as the barrier preventing Dogecoin from starting a new rally. According to BitGuru, the market needs a clean breakout above this range before any stronger recovery can be confirmed. Without that breakout, the Dogecoin price will still be vulnerable to further downside movement. At the time of writing, Dogecoin is trading around $0.1566 and is well below this resistance block. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54664889,
    "published": 1763657961000,
    "title": "The 100-Year-Old Wall Street Tool Being Rebuilt For Crypto",
    "body": "RDC is reinventing Depositary Receipts for Bitcoin, Ethereum and Solana—bridging crypto tokens into DTC, prime brokerage, ETFs and ’40 Act funds.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54664658,
    "published": 1763657537000,
    "title": "Bitcoin's Nvidia-Led Gains Prove Short-Lived, With Price Slumping Back to $88K",
    "body": "U.S. stocks are also giving up a major early advance, with the Nasdaq now ahead just 0.3%.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Market Wrap|Breaking News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54665381,
    "published": 1763658869000,
    "title": "21Shares Doubles Dogecoin Bets With 2x Leveraged DOGE ETF",
    "body": "TXXD targets risk-tolerant investors and joins a growing list of altcoin-tracking funds that have recently listed on U.S. exchanges.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "dogecoin||Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54610768,
    "published": 1763658442000,
    "title": "Ethereum Cofounder Issues Stark BlackRock Warning That Could Spell Disaster For Bitcoin Amid Sudden Price Sell-Off",
    "body": "Ethereum cofounder Vitalik Buterin has warned elliptic curve cryptography could break before the next U.S. presidential election in 2028...",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54665016,
    "published": 1763658227000,
    "title": "ICP Breaks Below Key Support as Volume Surges at Resistance Test",
    "body": "Heavy trading activity during a failed rebound attempt pushed ICP into a tighter consolidation zone below $4.95, reinforcing short-term downside risk.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Technical Analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 82,
        "NAME": "ICP",
        "CATEGORY": "ICP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54665922,
    "published": 1763659953000,
    "title": "Bitcoin Dives As Sudden Fed Flip Sparks Price Crash Fears",
    "body": "Bitcoin and the wider crypto market has dropped sharply, reigniting bitcoin crash fears...",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54665764,
    "published": 1763659152000,
    "title": "Crypto Market Extends Slide With Bitcoin Dropping Below $87,000",
    "body": "The cryptocurrency market extended a more than a month-long retreat in Thursday trading, just as stocks surrendered the gains they had logged earlier in the day.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54665534,
    "published": 1763659110000,
    "title": "Core Foundation Secures Injunction Against Maple Finance Over Bitcoin Yield Product",
    "body": "Core Foundation alleged that partner Maple Finance has misused confidential information to create a rival Bitcoin yield product.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54665464,
    "published": 1763659048000,
    "title": "HBAR Faces Fresh Liquidity Alarms After Breakdown to $0.1373",
    "body": "Hedera’s token slipped below key support levels as a late-session trading halt, collapsing volume, and failed recovery attempts point to mounting structural and liquidity stress.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 81,
        "NAME": "HBAR",
        "CATEGORY": "HBAR"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54666243,
    "published": 1763660480000,
    "title": "Bitcoin, Ethereum and XRP Dive as Rate Cut Hopes Fade, Liquidations Near $1 Billion",
    "body": "Bitcoin is being battered again Thursday, falling below the $87,000 mark for the first time in seven months as liquidations top $900 million.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54666772,
    "published": 1763661612000,
    "title": "Ethereum Is Sitting On Its Most Critical On-Chain Support Level — A Rally Emerging?",
    "body": "The cryptocurrency market finds itself at a compelling crossroads, and Ethereum has once again returned to a pivotal on-chain support zone that has historically marked major turning points in its market cycle. With ETH now pressing against this same support, the market is exhibiting a strong reaction that could confirm the integrity of the long-term trend. Why This On-Chain Support Zone Defined Ethereum Recovery Ethereum’s price is sitting right on top of its most important on-chain support, and the behavior around this level is exactly what occurs before a big reversal. A popular crypto news site, CryptosRus, has revealed on X that the ETH price sharply dropped to $2,870 earlier today, only to bounce instantly after Nvidia’s earnings lifted the entire market. CryptoRus highlighted that this bounce isn’t the real story, but the level at which it happened is. Related Reading: Ethereum Big Wallets Are Back: Whales Are Quietly Accumulating ETH – A Rally On The Way? Presently, the $2,800 zone is a strong on-chain floor for ETH. This is because the level lines up perfectly with the realized price of both retail and whales. These are the same zones that have marked the ETH bottoms in every past cycle, and ETH just tapped it perfectly. The classic signature of a bottom-zone behavior is that small wallets are in panic, while big wallets are buying in silence. Meanwhile, the on-chain rotation data has clearly shown that retail holders are selling, while whale investors holding 10,000 ETH and above are steadily loading up. A similar sentiment has been detected in the liquidation data. Long liquidations are barely moving on each new low, which means that the forced sellers are gone and the short sellers have been piling in aggressively. That’s the perfect setup for a squeeze. According to the expert, ETH didn’t just dip; it slammed into a major on-chain support, as large investors bought it up with conviction. Meanwhile, retail dumped it in panic, shorts crowded it, and now even a small bounce can trigger the fireworks. Historical Patterns Suggest A Reset Precedes The Next Expansion Ethereum had just repeated the identical liquidity pattern that occurred at the last two major bottoms, and it happened almost in the same week. An analyst known as Milk Road has stated that every single major ETH reversal started with a full liquidity reset. Related Reading: Ethereum Price Uphill Battle Continues as Sellers Hold the Advantage As that same liquidity reset occurs again, that’s when the ETH price begins its next massive expansion leg, which is exactly the setup ETH is currently in. In the meantime, the next phase will depend entirely on how quickly the market depth can be rebuilt. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|CryptosRus|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|Ethereum Whales|ethusd|ETHUSDT|Milk Road",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54667378,
    "published": 1763662790000,
    "title": "Crypto Exchange Ripio Reveals $100M Crypto Treasury, Second Largest in Latin America",
    "body": "The company's holdings, which include bitcoin and ether, have been managed through trading and hedging strategies since 2017.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Ripio|Bitcoin Treasury Reserve Asset|Digital Asset Treasury|Crypto Exchanges|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 54667461,
    "published": 1763644500000,
    "title": "New OCC Letter Lets Banks Use Crypto To Run Blockchain Systems",
    "body": "The OCC’s new guidance gives banks permission to hold small amounts of crypto for operational use—clearing the way for modernized financial institutions.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Fintech|/fintech|Money|/money|Fintech|/fintech|Forbes Digital Assets|/digital-assets|Editors' Pick|editors-pick|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54668236,
    "published": 1763664140000,
    "title": "Coinbase launches ETH-backed loans as onchain lending tops $1.25B",
    "body": "Users can borrow up to $1 million in USDC against their Ether as Coinbase expands its Base-powered network, which has processed $1.25 billion in loans.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54667958,
    "published": 1763662651000,
    "title": "#1 Mentions Market Trader @0xTyrael shares his Prediction Market strategies!",
    "body": "Against The Odds: Your Weekly insight into Prediction Markets & Sports Betting! - Hosted by @Tyler_Did_It & @Geebz - Today's Guest: @0xTyrael, the #1 Mentions Market Trader will be sharing their strategies and thoughts on prediction/mention market trading with us.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      }
    ]
  },
  {
    "id": 54668845,
    "published": 1763665200000,
    "title": "Bitcoin, stocks crumble after Nvidia earnings and Fed uncertainty over next rate cut",
    "body": "Bitcoin weakness persists as the BTC price drops to $86,000, alongside a US stock market sell-off and diminishing odds of a 50-basis-point Fed interest rate cut at the next FOMC.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54670317,
    "published": 1763667957000,
    "title": "Bitcoin for taxes? Proposed bill would let Americans pay the IRS in BTC",
    "body": "Tax revenue denominated in Bitcoin would be funneled into the US strategic BTC reserve and would not trigger a taxable event for the payer.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54670262,
    "published": 1763667789000,
    "title": "Michael Saylor’s Strategy Risks Losing Billions in Index Flows",
    "body": "Michael Saylor’s Strategy Inc. is among the most exposed to the crypto slump — and now faces the real risk of being dropped from the benchmark indices that have underpinned its presence in mainstream portfolios.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NMS:MSTR",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54670711,
    "published": 1763669082000,
    "title": "Bitcoin Billionaire Dumps Entire $1.3 Billion BTC Stash After 14 Years: Arkham",
    "body": "A Bitcoin whale appears to have sold his entire crypto stash for $1.3 billion—14 years after first buying BTC, says Arkham Intelligence.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 199,
        "NAME": "ARKM",
        "CATEGORY": "ARKM"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54671420,
    "published": 1763670386000,
    "title": "Elon Musk Is the Most Fit, Intelligent and Handsome Person Alive—Says Grok AI",
    "body": "Elon Musk's chatbot went viral for declaring him the most wonderful man on earth—fitter than LeBron, smarter than da Vinci, and definitely not biased at all.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54672835,
    "published": 1763673008000,
    "title": "Kalshi Raises $1B at $11B Valuation as Prediction Market Race Continues: TechCrunch",
    "body": "The CFTC-regulated exchange is gaining ground on crypto-native Polymarket, offering event contracts with fiat access and legal clarity.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Kalshi|Polymarket|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 54672891,
    "published": 1763672975000,
    "title": "AI hedge fund Numerai wins backing from top university endowments, token soars",
    "body": "Numerai's NMR token jumped over 40% after it announced a new funding round led by major university endowments, pushing the hedge fund to a $500M valuation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54673130,
    "published": 1763673300000,
    "title": "ETH DATs have a problem: Ether’s crash below $3K vaporized a year’s worth of gains",
    "body": "Ethereum treasury companies are holding millions of dollars in unrealized losses, and the falling mNAV valuations and ETH’s potential to fall below $2,500 could further complicate matters.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54674161,
    "published": 1763675332000,
    "title": "How Crypto Traders Navigate Volatility And Mental Strain",
    "body": "Crypto markets have entered another period of sharp volatility. For traders behind these positions, the damage extends beyond financial loss.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54674506,
    "published": 1763673300000,
    "title": "ETH DATs have a problem: Ether’s crash below $3K vaporized a year’s worth of gains",
    "body": "Ether treasury companies are holding millions of dollars in unrealized losses, and the falling mNAV valuations and ETH’s potential to fall below $2,500 may further complicate matters.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54676536,
    "published": 1763679657000,
    "title": "Is XRP Entering A Bear Market? Analyst Breaks Down The Truth",
    "body": "Crypto analyst Will Taylor, founder of Cryptoinsightuk, says talk of an XRP bear market is premature, arguing that the token’s higher-time-frame structure and liquidity profile remain bullish despite extreme volatility and record liquidations. Is The XRP Bear Market Here? In a video published on 19 November, Taylor acknowledged the “doom and gloom” dominating crypto sentiment but insisted that, from a technical standpoint, “nothing’s really changed” for XRP. His core claim is that XRP is still trading above a reclaimed multi-year resistance level that now acts as structural support. “We have spent over a year above our 7-year resistance holding it as support,” he said, calling this setup “almost unprecedented for XRP and for any asset.” As long as that zone holds, he rejects the idea that the market has rolled into a confirmed long-term downtrend. “Until that support is lost you can’t convince me that we’re bearish. I just don’t believe that.” Taylor uses Bitcoin as the macro anchor for the XRP thesis. He described the current BTC drawdown as a standard bull-market correction, noting that price is now sitting around a 30% pullback from the highs, similar to prior mid-cycle moves. He pointed out that the daily RSI is oversold and that the three-day RSI is at levels last seen near the $25,000 lows. “If we’re referring back to when momentum has felt this bad, it’s literally cycle lows,” he argued, while stressing that this does not guarantee an immediate reversal. Related Reading: XRP Supply In Profit Falls to 58.5% – Lowest Since 2024 Despite Higher Price Against that backdrop, he characterizes XRP as simply ranging above long-term support. On the daily chart, he said XRP is “holding its range pretty well,” with price near the lower end of that structure. He framed the area around roughly $2 as historically attractive from a risk-reward perspective: “Bottom of the range is where people are scared, where sentiment’s low. These are the areas that are pretty decent.” The liquidity map is central to his view. On lower time frames, Taylor sees some liquidity beneath recent lows, around $2.05–2.03, which could be swept without breaking the broader range. However, he stressed that the overwhelming concentration of resting liquidity lies far above spot. In the daily, he claimed that for XRP “the densest area of liquidity by an absolute long shot is above us […] dense all the way up to $4.20, $4.30 in dollars.” He argued that this distribution matters because market makers and exchanges maximize revenue where positions are opened and closed, not at stagnant prices. “They make money when contracts are opened and closed. They don’t give a [expletive] whether the price goes up or down,” he said. In his view, that means price statistically gravitates toward the most crowded liquidity pockets: “You have to play the four out of five chance that it is going to go into the dense area of liquidity.” Related Reading: Famous Trader Bets $27 Million That The XRP Price Will Crash XRP Vs. The Rest Of Crypto Taylor also pointed to relative-value signals. Against Ethereum, XRP recently closed a weekly candle above the 0.000071 level, which he said “has trapped us down since August.” Versus Bitcoin, he highlighted that XRP has been “holding the range lows” and has finally logged a weekly close above a resistance cluster that capped price since early October. XRP dominance, he added, has broken out of a downtrend and closed back above a recent cluster, although he wants “one or two more weeks” of continuation to confirm a bullish cross. He underscored that this structure has held despite the October 10, “the largest liquidation event in history of crypto.” While the FTX collapse saw about $2 billion in leveraged positions liquidated, the October 10 move liquidated roughly $20 billion and still failed to push XRP into a sustained breakdown.The sharp wick lower was “instantly bought back to the upside,” and the range was reclaimed soon after. “Things like XRP are looking super bullish here,” he concluded. “I think XRP is going to blow the doors off people’s expectations.” For now, Taylor maintains that an XRP bear market would require a decisive loss of the long-term support zone and a very different liquidity and dominance picture. Until those conditions appear, he says, “there isn’t a factual argument” for a confirmed bear market—only predictions. At press time, XRP traded at $2.11. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|xrp|xrp news|XRP Price|XRP Price Analysis|XRP Technical Analysis",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54676336,
    "published": 1763678894000,
    "title": "Tether’s Gold Hoard Surges to 116 Tons, Rivals Small Central Banks",
    "body": "Jefferies said that stablecoin giant Tether has quietly become one of the gold market’s most influential new buyers.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Tether|Gold|USDT|Jefferies|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 164,
        "NAME": "XAUT",
        "CATEGORY": "XAUT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54678656,
    "published": 1763683253000,
    "title": "Bitcoin Mean Reversion Oscillator Prints First Green Oversold Bar in Months – A Classic Bull-Market Bottom Signal",
    "body": "Bitcoin continues to struggle around the $90K level as the market battles intense selling pressure and widespread fear. Short-term sentiment remains fragile, with investors reacting to rapid price swings and mounting downside volatility. Yet, beneath the noise, key on-chain metrics are beginning to show signs that the correction may be nearing exhaustion. Related Reading: Nearly 7M Bitcoin Now Sitting At A Loss: Highest Unrealized Pain Since January 2024 According to analyst On-Chain Mind, Bitcoin’s Mean Reversion Oscillator has just printed its first green oversold bar in months, a signal that has historically aligned with late-stage retracements during bull markets. This oscillator measures how far price has deviated from its cyclical mean, helping identify when Bitcoin becomes overstretched to the downside. Each time this indicator dipped into its green oversold zone in previous cycles, Bitcoin was either forming a macro bottom or preparing for a significant rebound. The fact that this signal has appeared while BTC consolidates above $90K — despite severe profit-taking, forced liquidations, and structural fear — suggests that strong hands may be quietly absorbing supply. Historical Bottom Signals Align as Macro Tailwinds Strengthen On-Chain Mind explains that Bitcoin’s current Mean Reversion Oscillator reading aligns closely with historical patterns seen during bull market retracements. Each time the oscillator dipped into the green oversold zone while the 35 line held, Bitcoin formed a cyclical bottom before resuming its upward trajectory. This line has acted as a structural support level across multiple market cycles, and the fact that it is holding once again reinforces the idea that strong hands are stepping in as weaker participants capitulate. According to On-Chain Mind, when this indicator flashes green during an ongoing bull market, it often marks textbook accumulation territory — the kind of opportunity that appears only a few times per cycle. The current setup resembles previous late-stage pullbacks rather than the beginning of a prolonged bear trend. Adding to this outlook, NVIDIA’s blowout earnings delivered a major confidence boost to U.S. equities. With revenue and guidance far exceeding expectations, the results signal that AI-driven demand remains strong. In broader macro terms, such strength in tech leadership often spills over into higher-risk assets like crypto, improving liquidity and investor sentiment. Related Reading: Bitcoin Capitulation Deepens Around $90K Level: Classic Late-Stage Fear Structure Emerging Testing Support as Momentum Begins to Stabilize Bitcoin’s latest daily chart shows price attempting to stabilize after a sharp multi-week decline, with BTC currently trading near $92,000. This level is acting as a temporary support zone following the breakdown from the $100K area, where sellers aggressively dominated order books. The chart reveals a series of lower highs and lower lows — a classic short-term downtrend structure — but the recent candlesticks hint at reduced selling momentum compared to the peak pressure seen earlier in November. The 50-day and 100-day moving averages have both turned downward, reflecting weakening short-term trend strength, while the 200-day MA remains far below price, highlighting that the broader bullish cycle may not be invalidated yet. Importantly, the current candle structure shows smaller bodies and longer lower wicks, suggesting buyers are beginning to absorb sell-side liquidity around the $90K–$92K region. Related Reading: XRP Supply In Profit Falls to 58.5% – Lowest Since 2024 Despite Higher Price Volume profiles also support this shift. While capitulation-like spikes occurred during the heaviest drop, trading activity has now normalized, indicating panic selling is cooling off. Historically, such deceleration after a steep leg down often precedes a relief bounce, even if volatility persists. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|Bitcoin mean reversion oscillator|Bitcoin news|Bitcoin Oversold|bitcoin price|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54678241,
    "published": 1763682490000,
    "title": "Kalshi’s valuation marked up to $11B after $1B funding round: TechCrunch",
    "body": "Kalshi has joined predictions market rival Polymarket in the $10 billion-plus valuation club after reportedly raising another $1 billion from Sequoia Capital and CapitalG.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54679837,
    "published": 1763683260000,
    "title": "Cash-for-Crypto Laundromat Used to Fund Marsalek’s UK Spy Ring",
    "body": "Russian intelligence services helped fund the former Wirecard executive Jan Marsalek’s spy ring by using a cash-to-cryptocurrency money laundering network, UK police said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54680299,
    "published": 1763685929000,
    "title": "Google Sparks Backlash After Gmail Setting Lets Gemini Peek Inside Inboxes",
    "body": "Google has faced criticism after a buried setting allowed Gemini to scan inboxes and calendars without clear notice to users.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54679984,
    "published": 1763685401000,
    "title": "Bitcoin Giant Strategy Could Shed Billions If Removed From Stock Indices: JPMorgan",
    "body": "Analysts from the investment banking giant wrote in a note Thursday that removal from MSCI indices could lead to $2.8 billion in outflows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54680753,
    "published": 1763686850000,
    "title": "Why is Zcash Surging? Analysts Break Down the ZEC Rally and What Comes Next",
    "body": "Zcash (ZEC) is back in the spotlight after a dramatic rebound. Following Monday’s steep fall to roughly $548, the privacy coin has bounced sharply, gaining 12% in the last 24 hours and reclaiming the $670 level. Related Reading: Bitcoin To Suffer 40% Crash From All-Time High? Analyst Reveals ‘Final Target’ After surging more than 1,500% year-to-date and rallying 175% in the past month, the privacy-focused cryptocurrency is now testing a major bullish breakout pattern, leaving traders wondering what comes next and whether ZEC can truly sustain this momentum. ZEC's price trends to the upside on the daily chart. Source: ZECUSD on Tradingview Institutional Accumulation Fuels a Powerful Upswing A major catalyst behind Zcash’s meteoric rise has been aggressive accumulation from high-profile institutional players. The newly rebranded Cypherpunk Technologies, backed by Tyler and Cameron Winklevoss, has snapped up 233,644 ZEC, worth roughly $150 million. This stash now represents around 1.25% of the circulating supply, with the firm openly declaring plans to raise its holdings to at least 5%. This level of concentration has tightened liquid supply and injected strong confidence across the market. Supporting the trend, long-time privacy advocate Arthur Hayes has openly backed ZEC, predicting a run to $1,000 and even suggesting Zcash could eventually reach 20% of Bitcoin’s value. The upcoming November 2025 halving has added another bullish layer. With block rewards set to fall by 50%, ZEC will enter a sharply reduced-issuance environment, historically a strong driver of scarcity-led rallies across major cryptocurrencies. Technical Indicators Signal a Potential Zcash (ZEC) Breakout On the technical front, Zcash is close to confirming a classic inverse head and shoulders formation on the 4-hour chart. The neckline sits around $690, and a decisive breakout above this level could open a path toward $956, a nearly 40% upside from recent prices. ZEC is also trading above its 50-day EMA at $613, while a green Supertrend signal hints at sustained bullish momentum. Still, analysts caution that ZEC must hold above the EMA to avoid invalidating the formation. Key support remains at $600–$605, where momentum has recently cooled. Coordinated Influence and Growing Privacy Demand Beyond charts and supply mechanics, market observers say a coordinated narrative push is also at play. Crypto media figure Ran Neuner believes influential industry players are rallying behind Zcash to spotlight privacy as a critical next frontier. According to him, this is less a pump-and-dump and more a long-term mission around compliant, user-controlled privacy, a feature that differentiates ZEC from rivals like Monero. Related Reading: XRP Supply Shock Ahead? ETFs Could Consume It All, Analyst Predicts If ZEC can maintain its breakout structure and demand for privacy-focused assets continues to rise, Zcash may be positioning itself not just for a short-term spike, but for a serious challenge to broader market rankings in the months ahead. Cover image from ChatGPT, ZECUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Zcash Zec|ZCash|ZEC|ZEC Price|zecusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54681605,
    "published": 1763688304000,
    "title": "UK Fraud Office Probes $28M Crypto Fund Collapse, Two Arrested",
    "body": "The office has begun probing Basis Markets, a defunct crypto project accused of misappropriating investor funds.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54682688,
    "published": 1763690456000,
    "title": "Bitcoin OG Owen Gunden Deposits Final 2,499 BTC ($228M) to Kraken – Details",
    "body": "Bitcoin is currently trading below $92,000, and the market is showing clear signs of exhaustion as selling pressure intensifies. Fear has pushed sentiment toward the bearish end of the spectrum, with many analysts now arguing that BTC may be entering a new bear market. The loss of key support levels and the rapid acceleration of downside volatility have only fueled these concerns, especially as short-term holders continue to capitulate at scale. Related Reading: Bitcoin Capitulation Deepens Around $90K Level: Classic Late-Stage Fear Structure Emerging However, not all perspectives are bearish. Some analysts believe that Bitcoin may be forming a local bottom, as the current correction resembles previous mid-cycle retracements seen during strong bull markets. They argue that the broader macro environment remains supportive and that long-term holders have not shown signs of structural weakness. As selling pressure concentrates among weak hands, the possibility of a reversal increases — especially once forced sellers exhaust themselves. Adding to the uncertainty, new on-chain data from Lookonchain revealed that Bitcoin OG Owen Gunden just deposited all his remaining 2,499 BTC into Kraken roughly an hour ago. Moves like this often trigger speculation, as exchange deposits from early holders can signal potential selling. Yet historically, similar events have also occurred near cycle bottoms when panic is at its peak. A Massive BTC Transfer Sparks Market Speculation According to fresh data from Lookonchain, Bitcoin OG Owen Gunden has just deposited his remaining 2,499 BTC (worth $228 million) into Kraken roughly an hour ago. This move has immediately raised questions across the market, as large exchange deposits from early whales often signal potential selling pressure. What makes this development even more notable is the context: just two weeks ago, Lookonchain reported that Gunden appeared ready to offload his entire 11,000 BTC stash — a position worth over $1.12 billion at the time. Now, with this final deposit, it appears he has officially completed the move. For many traders, this confirms that one of the oldest and largest long-term holders has fully exited or is preparing to exit the market. Such whale behavior can amplify fear during corrective phases, especially as Bitcoin continues to struggle below $92K. Moves of this scale not only contribute to short-term volatility but also influence sentiment by signaling that even early accumulators may be reducing exposure. However, historically, capitulation events from long-term holders have often coincided with or preceded major turning points. If this massive transfer marks the end of Gunden’s sell-off, the market may soon absorb the pressure — potentially clearing the path for a recovery once the fear subsides. Related Reading: Nearly 7M Bitcoin Now Sitting At A Loss: Highest Unrealized Pain Since January 2024 Short-Term Trend Still Under Pressure Bitcoin’s 4-hour chart reveals a market that remains firmly under short-term selling pressure, despite occasional relief bounces. The price is struggling to reclaim $92,000, a level that previously acted as support but is now working as resistance. The series of lower highs and lower lows highlights a persistent downtrend that has shaped BTC’s trajectory since early October. All major moving averages—the 50 SMA, 100 SMA, and 200 SMA—are positioned above current price action and pointing downward. This alignment confirms a clear short-term bearish structure. Each time BTC attempts to recover, it meets strong resistance at these declining MAs, signaling that sellers remain in control. The most recent bounce barely reached the 50 SMA before being rejected again, reinforcing the weakness of buyer momentum. Related Reading: XRP Supply In Profit Falls to 58.5% – Lowest Since 2024 Despite Higher Price Volume remains elevated on downswings, which indicates that sell-offs continue to be driven by conviction rather than random volatility. Buyers are stepping in around the $89,000–$91,000 zone, but so far, this support has only produced temporary pauses rather than meaningful reversals. For a structural shift, BTC would need to reclaim at least the $95,000 area and break above the 100 SMA. Until then, the trend remains tilted toward further downside or continued consolidation near current levels. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin analysts|Bitcoin news|Bitcoin OG|Bitcoin Whale Activity|btc|BTCUSDT|Owen Gunden",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54685107,
    "published": 1763695045000,
    "title": "Bitcoin Price Crashes Under $90K, Triggering Fresh Fears of Deeper Weakness",
    "body": "Bitcoin price started another decline below $90,000. BTC is now showing bearish signs and might struggle to recover above $88,5000. Bitcoin started a fresh decline below $92,000 and $90,000. The price is trading below $90,000 and the 100 hourly Simple moving average. There is a bearish trend line forming with resistance at $91,000 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move down if it settles below the $90,000 zone. Bitcoin Price Dips Further Bitcoin price failed to stay in a positive zone above the $90,000 level . BTC bears remained active below $88,800 and pushed the price lower. The bears gained strength and were able to push the price below the $87,500 zone. A low was formed at $85,276, and the price is now consolidating losses below the 23.6% Fib retracement level of the recent decline from the $92,872 swing high to the $85,276 low. Bitcoin is now trading below $90,000 and the 100 hourly Simple moving average . Besides, there is a bearish trend line forming with resistance at $91,500 on the hourly chart of the BTC/USD pair. If the bulls attempt another recovery wave, the price could face resistance near the $87,000 level. The first key resistance is near the $89,000 level and the 50% Fib retracement level of the recent decline from the $92,872 swing high to the $85,276 low. The next resistance could be $91,000 and the trend line. A close above the $91,000 resistance might send the price further higher. In the stated case, the price could rise and test the $92,500 resistance. Any more gains might send the price toward the $93,200 level. The next barrier for the bulls could be $94,500 and $95,000. More Losses In BTC? If Bitcoin fails to rise above the $90,000 resistance zone, it could start another decline. Immediate support is near the $85,500 level. The first major support is near the $85,000 level. The next support is now near the $83,200 zone. Any more losses might send the price toward the $82,500 support in the near term. The main support sits at $80,000, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $85,500, followed by $85,000. Major Resistance Levels – $87,000 and $89,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54684706,
    "published": 1763694029000,
    "title": "Bitcoin implodes as volatility from Big Tech, AI bubble fears, spreads to crypto",
    "body": "Bitcoin price corrected alongside major US equities as a tech-led sell-off and investor concerns over AI spending and a Federal Reserve policy shift hit markets hard.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54685557,
    "published": 1763695838000,
    "title": "BTC Falls Toward Mid-$80Ks as Market Structure Weakens Into Year-End",
    "body": "FlowDesk flags sustained sell pressure from old wallets, QCP notes a sudden hawkish Fed repricing, and Deribit data shows downside positioning now dominating.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|btc|btc price|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54686557,
    "published": 1763697659000,
    "title": "Trump’s WLFI Moves To Contain Wallet Breach While Federal Inquiry Looms",
    "body": "World Liberty Financial (WLFI) said it is reallocating funds and confirming user identities after several wallets were compromised ahead of its platform launch. Related Reading: XRP Supply Shock Ahead? ETFs Could Consume It All, Analyst Predicts According to WLFI’s post on X, the company froze the affected addresses in September and has been verifying ownership before moving assets back to users who pass the checks. Wallet Breaches And Response Reports have disclosed that the breaches came from either phishing attacks or exposed seed phrases, not from WLFI’s own platform or smart contracts, the company said. WLFI described the problem as linked to third-party security failures and said only a “small subset” of users were hit — though it did not give exact figures on how many accounts or how much crypto was involved. 1/ Prior to WLFI’s launch, a relatively small subset of user wallets were compromised via phishing attacks or exposed seed phrases. Since then, we’ve tested new smart contract logic to safely reallocate user funds and verified users’ identity via KYC checks. Shortly, users who… — WLFI (@worldlibertyfi) November 19, 2025 On-chain data cited by analyst Emmett Gallic of Arkham shows WLFI executed an emergency action that burned 166.67 million WLFI tokens, a move valued at $22.14 million from a compromised address, and then shifted tokens to a recovery address. That firewall step appears intended to limit further loss while the company sorts ownership questions. World Liberty Fi executed an emergency function burning 166.667M $WLFI ($22.14M) from compromised address, reallocating to a recovery address. Function designed for two scenarios: An investor loses wallet access before vesting OR malicious account acquires WLFI via exploit pic.twitter.com/VSUDWhDPCR — Emmett Gallic (@emmettgallic) November 19, 2025 Regulatory Spotlight Grows The timing of the security disclosure has drawn extra attention. Based on reports, Senators Elizabeth Warren and Jack Reed asked the DOJ and Treasury to review alleged WLFI token sales tied to sanctioned parties. Their letter referenced a watchdog report from Accountable.US that linked transactions to the Lazarus Group — a North Korea-linked actor on sanctions lists — and to an Iranian crypto exchange. It remains unclear whether the wallet compromises are related to the transactions lawmakers flagged. Experts Question On-Chain Findings Security researchers have pushed back on some of the watchdog’s claims. Taylor Moynahan of MetaMask and Nick Bax of Ump.eth said the Accountable.US analysis misread certain on-chain activity. Another day in crypto with wild allegations. Today, it’s that a North Korea-linked address invested in WLFI. I do a some DPRK crypto research myself, so I decided to take a look at their findings. They’re bad and an innocent user is out $100k because of it🧵 pic.twitter.com/yJKEH04nup — Nick Bax.eth (@bax1337) November 18, 2025 Related Reading: With 42% Of XRP Holders Underwater, Analysts Say The Altcoin Could Crash Even Further Bax argued that the report mistakenly connected a wallet tied to an individual known as “Shryder” with DPRK-linked activity, which led to the freezing of roughly $95,000 in WLFI tokens. WLFI has responded by emphasizing user protection and compliance. The company said it prioritized freezing vulnerable wallets and verifying rightful owners before any transfers. It also announced tests of revised smart contract logic meant to reduce the chance of similar breaches in future rollouts. Featured image from Gemini, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|bitcoin|crypto|North Korea|Trump|WLFI",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 205,
        "NAME": "TOKEN SALE",
        "CATEGORY": "TOKEN SALE"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]