[
  {
    "id": 56437462,
    "published": 1766818476000,
    "title": "JPMorgan freezes accounts of two stablecoin startups over sanctions concerns: Report",
    "body": "JPMorgan has reportedly frozen accounts linked to Y Combinator–backed stablecoin startups BlindPay and Kontigo after flagging exposure to sanctioned jurisdictions.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 56450126,
    "published": 1766838654000,
    "title": "Bitcoin To Retest $85,000 As Bearish Technicals And On-Chain Weakness Align",
    "body": "The Bitcoin market stands at a critical juncture, as it currently hovers above its $85,000 psychological level. Aside from its psychological validity, this key support also appears to hold technical importance. Hence, its strength could be tested before the market shows directional momentum. However, a recent analysis has surfaced that paints a grim picture for the flagship cryptocurrency’s future. Related Reading: Bitcoin Supply Overhang: 6.6 Million BTC Bought Above Current Price Descending Triangle Forms Near $85,000 Support In a recent post made on QuickTake, CryptoOnchain reveals that there has been the appearance of a classic technical pattern, indicative of an asset’s bearish continuation intent. This pattern, which is present on the Bitcoin daily timeframe, is characterized by a sequence of lower swing highs, with price compressing against a horizontal support acting as the triangle’s base. Interestingly, a price level, known as the Point Of Control (POC) — wherein lies the highest traded volume — also sits near the $85,000 support. This further reinforces the significance of the price level. If this price level were to be breached decisively, the Bitcoin price could see a rapid downward movement, seeing as liquidation and capitulation events would likely follow. Notably, heightening downward pressure might be seen if very little or no demand comes into play to reassert bullish momentum. Related Reading: Ethereum’s 2026 Overhaul Aims To Cut Costs, Boost Speed, Limit Censorship Exchange Activity Drops To Multi-Year Lows CryptoOnchain supports his bearish hypothesis with another notable on-chain observation. The indicator here is the Bitcoin Exchange Withdrawing Transactions (7-day Moving Average) metric, which keeps tabs on the number of on-chain withdrawal transactions made from cryptocurrency exchanges over a period of seven days. The analyst highlights that the metric’s readings have fallen to levels around 5,000, the lowest seen since 2016, about nine years ago. Interestingly, this current level falls short of the readings put in during previous bear markets (in 2018, 2020, and 2022). Exchange withdrawal activity offers insight into investor conviction and accumulation behavior. Rising withdrawal activity signifies growing accumulation appetite and increasing confidence, as coins sent out of exchanges are usually kept in private wallets. On the flipside, this significant fall in exchange withdrawal activity points to a deep feeling of disinterest among Bitcoin investors, or a lack of conviction that is important for long-term holding. Aside from the evident lack of urgency to acquire coins into private wallets, the low readings from this metric reveal that investors are also not actively accumulating BTC. The analyst concludes that “the data suggests widespread skepticism or exhaustion, with real, non-speculative demand largely absent.” If the $85,000 support fails, the lack of interested buyers could cause Bitcoin’s price to fall rapidly. As of press time, Bitcoin holds a value of $87,410, with no real movement since the past 24 hours. Featured image from Pexels, chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin support|btcusd|BTCUSDT|CryptoOnchain|descending triangle|exchange withdrawal activity",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56450029,
    "published": 1766838270000,
    "title": "Coinbase CEO says reopening GENIUS Act is ‘red line,’ slams bank lobbying",
    "body": "Coinbase CEO Brian Armstrong warned that reopening the GENIUS Act would cross a “red line,” accusing banks of lobbying Congress to block stablecoin rewards and limit competition.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56453275,
    "published": 1766844062000,
    "title": "From Circle to Bullish: Crypto Wraps Up 'Bellwether Year' for IPOs",
    "body": "Crypto companies rushed to Wall Street in 2025, with Circle, Bullish, and eToro going public while Kraken lined up for its market debut.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56456228,
    "published": 1766849441000,
    "title": "Bitcoin Fractal Hints Next Cycle Bottom To Form Around $45K — Here’s When",
    "body": "The price of Bitcoin has continued to struggle under the psychological $90,000 level during the Christmas season, reflecting the sluggish climate of the crypto market. While the premier cryptocurrency and the rest of the crypto market floundered, other asset classes enjoyed significant Christmas season rallies. These recent performances suggest that the Bitcoin price might indeed be at the beginning of a bear market. According to the latest on-chain data, the price of BTC might be heading down to as low as $41,500 in the imminent period of extended downward movement. BTC Price To Reach Next Bottom In October 2026 In a new post on the X platform, Alphractal founder and CEO Joao Wedson has put forward a target and timeline for the Bitcoin price in the coming bear season. According to the on-chain expert, the market leader’s price could form its next cycle bottom around early October 2026. Related Reading: Bitcoin Whales Go Quiet On Binance As Inflows Collapse: Supply Shock Setup? This projection is based on the Repetition Fractal Cycle chart, which portrays how market patterns and price movements repeat themselves on different scales. Using investor behavioral patterns, this chart helps to predict price tops and bottoms across different timeframes. As shown in the chart above, a 4-year cycle is marked by various periods, starting with accumulation, then markup and distribution, before ending with the bear market. Wedson revealed that the most favorable time window for the next accumulation phase would likely be between October 6, 2026, and October 16, 2026, according to historical cycle symmetry. The Alphractal founder added that the price target for Bitcoin by the start of this accumulation phase is between $41,500 and $45,000. In essence, the bear market phase, which the premier cryptocurrency seems to only be at the start of, could see the price of BTC fall as much as 50% from the current price point. Wedson warned in his post: This is not a fixed rule, nor a deterministic price forecast. It represents a fractal rhyme of market cycles — something Bitcoin has historically respected more often than ignored. Markets do not repeat exactly — but they rhyme with an uncomfortable frequency. If the price of Bitcoin goes to around $45,000 from the current point, it would represent a roughly 65% decline from the cycle top. This is significantly lower than the over 75% correction seen in the last bear market in 2022. Bitcoin Price At A Glance As of this writing, the price of BTC stands at around $87,550, reflecting no significant movement in the past 24 hours. Related Reading: XRP Price To Surge: Analyst Shares ‘Interesting Chart’ That Has Previously Led To A Rally Featured image from iStock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|btc price|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56459340,
    "published": 1766854898000,
    "title": "Bitcoin Whales Woke Up in 2025 and Moved Billions in BTC—Here's Why",
    "body": "Bitcoin whales emerged from their slumber in 2025, some after a decade or more, moving billions and cashing in as BTC surged to new highs.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56459321,
    "published": 1766854820000,
    "title": "Big Bet On Ethereum: CEO Sees 10X TVL Growth In 2026",
    "body": "According to Sharplink co-CEO Joseph Chalom, Ethereum could see a major jump in total value locked (TVL) next year if certain onchain trends pick up. Chalom put a bold number on it: 10X TVL in 2026. That claim ties together rising stablecoin use, bigger tokenization of real-world assets, and increased interest from big financial groups. Related Reading: Bitcoin Forecasts For 2026 Range From $65K To $250K As Sentiment Hits ‘Extreme Fear’ Stablecoin Activity On Ethereum Based on reports, the total stablecoin market stands at about $308 billion now and could grow to $500 billion by the end of next year, a rise of roughly 62%. Over half of all stablecoin activity — about 54% — happens on Ethereum. That math matters: more stablecoin flows on Ethereum tends to lift the protocol’s TVL because many of those dollars sit in smart contracts for swaps, lending, and liquidity pools. Sharplink Gaming holds 797,704 Ether, worth roughly $2.30 billion at the time of publication, a signal that some public treasuries are already staking big bets on the network. Tokenized Assets Gain Traction Chalom also expects tokenized real-world assets to expand rapidly, forecasting a $300 billion market for RWAs in 2026 and saying tokenized assets will 10X in AUM next year as funds, stocks, and bonds get wrapped onchain. In 2026, I believe Ethereum’s Total Value Locked (TVL) will increase 10X. Why and how? 🧵 Views ≠ investment advice. — Joseph Chalom (@joechalom) December 26, 2025 He points to rising interest from mainstream firms like JPMorgan, Franklin Templeton, and BlackRock. Reports note that sovereign wealth funds may increase their Ethereum exposure by five- to tenfold, which could bring large, patient capital into tokenization projects and protocol deposits. Ethereum Price Action Ethereum was trading near $2,921 on December 25, 2025, giving the network a market value of about $352 billion, while 24-hour trading volume came in at roughly $11.47 billion. Over the course of 2025, ETH moved through a full market swing. It opened the year around $3,298, climbed to about $4,390 in August, and stayed below its record high of $4,942, before sliding back to the $2,921 area by year-end. Price swings were heavy, with annual volatility close to 140%. Technical readings show mixed momentum. The weekly RSI sits at 41.7, placing Ethereum in a neutral-to-bearish zone, while the daily MACD histogram remains negative at -0.15. Price action has also been boxed into a narrow band between $2,774 and $3,038. Futures data adds to the cautious tone. Total open interest stands near $37 billion, down 0.62% over the past 24 hours, pointing to reduced exposure from traders. Liquidation data shows more than $100 million in potential long liquidations clustered between $2,880 and $2,910, an area now seen as a key pressure point. Related Reading: Could XRP Make Trillionaires? Tech Firm Founder Thinks It’s Possible Market Signals And Risks Not everyone agrees that token flows will translate into quick price gains. According to crypto analyst Benjamin Cowen, Ether is unlikely to hit new highs next year given current Bitcoin conditions. That caution lines up with technicals that point to range-bound trading and with the fact that open interest has eased slightly. The liquidation cluster near $2,880–$2,910 shows where leveraged positions could be forced out, and that kind of stress can push price moves faster than fundamentals. Featured image from Gemini, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|altcoins|bitcoin|crypto|ETH|Ether|ethereum",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56462269,
    "published": 1766860219000,
    "title": "Bitcoin Short-Term Holders Face Prolonged Pain As Key Metric Stays Red",
    "body": "As Bitcoin continues to underperform in the fourth quarter of 2025, its investors have had multiple reasons to offload and shave off their holdings. Among these investors is a certain cohort, its short-term holders (STHs), who have been facing heat over an extended period. STH MVRV In Deep Red For 60 Consecutive Days In a recent post on the X platform, market quant Burak Kesmeci revealed an interesting perspective regarding the current market condition for Bitcoin’s most reactive investors — the short-term holders. Kesmeci’s post revolves around the STH MVRV (Market Value to Realized Value) metric. For context, this metric compares the market value of BTC to its realized value, thus serving as a means to track whether Bitcoin’s short-term investors are, on average, in profit or at a loss. Related Reading: Bitcoin Whales Go Quiet On Binance As Inflows Collapse: Supply Shock Setup? A reading less than the neutral “1” level typically indicates that the STHs are in the red. Depending on the depth of this value, it could also foreshadow capitulation events. On the other hand, values above 1 reveal that short-term investors are in profit. The higher the value, the more probable it is for profit-taking events to follow. In his post on X, the online pundit shared that the STH MVRV has been in deep red territory for a full period of 60 days. Kesmeci explained that the flagship cryptocurrency’s short-term investors are now facing the highest level of “patience test” that they have ever witnessed throughout 2025. Notably, prolonged periods of negative MVRV readings have often correlated with heightened market stress. Seeing as the market’s most-reactive investor cohort is the one concerned, the Bitcoin price could witness the effect of capitulation-driven sell-offs. However, the opposite is also possible. In the scenario where bearish pressure eases off completely, prolonged negative readings could be a sign of imminent market stabilization. Bitcoin Stays Beneath 111-Day SMA — What This Means For Price To lend more weight to his on-chain revelation, Kesmeci also followed up with a key technical observation of Bitcoin’s price action. According to the analyst, Bitcoin has been trading below the 111-day simple moving average (SMA 111) within the same period. This alignment between on-chain and technical analysis thus functions to reinforce a clear narrative; Bitcoin is either currently at a consolidatory or corrective phase. This is contrary to the belief that the premier cryptocurrency might be at the start of a significant upward trend. Related Reading: Bitcoin Funds See Significant Net Outflows Heading Into Year-End – What’s Going On? From a broader perspective, Bitcoin’s future trajectory is not completely clear. Macro events, alongside renewed spot demand, could prove pivotal for the cryptocurrency in the future. This market phenomenon could determine whether BTC plunges deeper to the downside or begins its recovery journey. As of this writing, Bitcoin is valued at around $87,380, with no significant movement in the past day. Featured image from iStock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|btc price|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56465008,
    "published": 1766865620000,
    "title": "Ethereum Investors Slide Deeper Into Losses – What The Drop Below $3,000 Means",
    "body": "Ethereum has spent much of December under pressure, and the recent fall below $3,000 has left a visible mark on investor positioning. On-chain data now shows a notable deterioration in profitability across the network, with the share of ETH supply sitting in profit falling below 60%. At the same time, institutional demand has decreased, with data from Glassnode showing how both retail profitability and institutional participation in Ethereum have weakened simultaneously. Related Reading: Could XRP Make Trillionaires? Tech Firm Founder Thinks It’s Possible Ethereum’s Percent Supply In Profit Falls Below 60% The drop in Ethereum’s percent supply in profit has been one of the clearest signals of stress for Ethereum. Ethereum’s investors have fallen into deeper losses, and this is a reflection of recent price action. Speaking of price action, Ethereum had initially reclaimed the $3,000 price level on December 22. During this time, the percentage of ETH supply in profit pushed back above 60% and reached as high as 63%. However, this break was for only a very brief time, and price action fell back below $3,000 after just a few hours. As ETH broke below $3,000 again, the share of supply held at unrealized gains fell under 60%, down from above 70% earlier in December. This fall shows that the pullback has not been limited to recent buyers but has begun to impact investors who accumulated during the beginning of the month. ETH Percent Supply In Profit. Source: Glassnode ETF Net Outflows Indicate Waning Institutional Participation The weakness in on-chain profitability and price action is also a reflection of trends in the ETF market. Another data metric from Glassnode shows that since early November, the 30-day moving average of net flows into US Spot Ethereum ETFs has turned negative and remained there. This persistence of outflows points to a phase of muted participation and disengagement from institutional traders. The ETF chart below shows that inflows, which supported Ethereum’s push to new all-time highs in August, have faded, replaced by continued outflows through November and December. This matters for price action because ETF demand has been a key source of incremental buying. As that bid has weakened, Ethereum has struggled to absorb sell-side pressure, contributing to its failure to hold above $3,000. ETH: US Spot ETF Net Flows. Source: Glassnode The combination of negative ETF net flows and Ethereum’s recent price behaviorhelps explain rising unrealized losses. Interestingly, various on-chain data sources also reveal different instances of whale addresses reducing their exposure to Ethereum outside of spot ETFs. For instance, Lookonchain recently highlighted activity from a wallet believed to be linked to Erik Voorhees, which swapped 4,619 ETH, valued at about $13.42 million, into Bitcoin Cash (BCH) over the past two weeks after having been inactive for nearly nine years. Voorhees later responded by clarifying that the wallet does not belong to him and that he does not hold any Bitcoin Cash. Related Reading: Ethereum’s 2026 Overhaul Aims To Cut Costs, Boost Speed, Limit Censorship Lookonchain also pointed to selling pressure from Arthur Hayes, co-founder of BitMEX, who has offloaded a total of 1,871 ETH at about $5.53 million in the past week. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|blockchain|cryptocurrency|digital currency|ETH|ethereum|ethusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 12,
        "NAME": "BCH",
        "CATEGORY": "BCH"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56465617,
    "published": 1766866788000,
    "title": "Google search volume for 'crypto' craters as 2025 comes to a close",
    "body": "The low levels of internet search volume signal that retail investors are not interested in the crypto market, a stark contrast from January.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56468832,
    "published": 1766873094000,
    "title": "Fed's 'skinny' accounts end Operation Chokepoint 2.0 — Senator Lummis",
    "body": "Giving crypto companies and fintech startups access to accounts at the Federal Reserve is a hedge against debanking by commercial banks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56470406,
    "published": 1766876430000,
    "title": "Bitcoin 4-Year Cycle Is Dead: Crypto Trader Explains What Happens Next",
    "body": "According to a well-known crypto analyst, Bitcoin’s (BTC) long-standing four-year cycle can no longer dictate the direction of the crypto market. For months, both Bitcoin and major altcoins have struggled to regain their previous highs, while traditional markets have flourished. This difference in performance has sparked discussions about whether the old cycle rule still applies and what could come next for the broader market. Analyst Declares Bitcoin 4-Year Cycle Dead A popular crypto analyst with over 227,000 followers on X, @theunipcs, has announced that the Bitcoin four-year cycle is dead. He stated that this market cycle is now unable to determine the behavior of BTC and many major altcoins. Related Reading: Ethereum’s 2026 Overhaul Aims To Cut Costs, Boost Speed, Limit Censorship Traditionally, crypto’s four-year cycles have relied on the Bitcoin halving to reduce supply and trigger price surges. However, based on Unipcs’ analysis, these mechanisms no longer govern the market, especially as factors such as monetary policy, Spot ETFs, liquidity flows, macroeconomic factors, and dramatic liquidation events have significantly altered it. Unipcs emphasized that the market has been in a long phase of consolidation and accumulation, showing little of the explosive activity historically expected after halving events. He pointed out that the price of Bitcoin and leading altcoins have remained depressed for months, trading roughly 30% or more below their all-time highs. This decline stands in stark contrast to other major asset classes, which continue to climb. The analyst noted that Silver has been hitting record levels almost daily, while Gold continues to climb to new peaks. Additionally, major US stock indexes, such as the S&P 500, are hitting fresh highs, while crypto remains stagnant and underperforming. Notably, this extended period of weakness is highlighted by Bitcoin’s crash below $85,000 earlier this month after peaking above $126,000 during the first week of October. Many altcoins, including Ethereum, Solana, XRP, and others, have followed a similar trajectory, surging explosively before plunging to new lows. Technical indicators, such as the Fear & Greed Index, indicate that investor sentiment remains deeply negative, while analyst insights point to a bearish market structure. Overall, Unipcs’ analysis signals the possible end of the historically repetitive 4-year cycle, though he suggests it could mark the beginning of a new bullish phase for crypto. What’s Next For BTC And The Crypto Market? Despite the prolonged slump, Unipcs believes that the ongoing accumulation trend could end soon, triggering an aggressive rally in the crypto market. He believes that once this happens, Bitcoin and major altcoins could surge explosively to new all-time highs once the dormant market transitions into a new bullish phase. Related Reading: Could XRP Make Trillionaires? Tech Firm Founder Thinks It’s Possible While the timing of his optimistic outlook remains uncertain, the analyst is confident in the market’s potential for a decisive breakout and recovery. Unipcs has stated that the crypto market will eventually catch up and potentially outperform all asset classes soon. Featured image from Pexels, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin Cycle|Bitcoin news|btc|btcusd|crypto|crypto market|crypto news|cryptocurrency",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56475503,
    "published": 1766887247000,
    "title": "What Does XRP Really Do? Expert Explains What It Is Built For",
    "body": "Crypto analyst and XRP advocate Levi Rietveld recently shared a short post on X stating that “$XRP is built for this,” alongside a video clip of US Treasury Secretary Scott Bessent speaking about reviewing regulatory barriers around blockchain, stablecoins, and new payment systems like the crypto industry. Bessent’s comments focused on reforming financial infrastructure so capital markets can function more efficiently for mainstream users. In turn, Rietveld viewed those comments as closely matching the original purpose XRP was created to serve. Related Reading: Ethereum’s 2026 Overhaul Aims To Cut Costs, Boost Speed, Limit Censorship What XRP Was Designed To Do In the video clip that Levi Rietveld shared on X alongside his statement of XRP being built for this, Scott Bessent outlined a policy direction that places emphasis on evaluating regulatory impediments to blockchain technology, stablecoins, and new payment systems. Bessent stated that officials will take a close look at regulatory impediments to blockchain, stablecoins, and new payment systems and consider reforms to unleash the power of American capital markets. Notably, this plan corresponds to a more crypto-positive approach adopted by the current US administration under President Donald Trump. $XRP Is Built For This! pic.twitter.com/WNDUoeFPC4 — Levi | Crypto Crusaders (@LeviRietveld) December 22, 2025 These are a part of efforts by the US government to modernize crypto regulation and define clearer frameworks for digital assets, including proposed acts aimed at bringing clarity to markets and stablecoins. One example of this is the Clarity Act, a legislative proposal that aims to clearly define the regulatory treatment of digital assets, separate payment-focused tokens from securities, and assign clearer oversight roles to agencies such as the SEC and CFTC. Bessent’s comments focused on improving payment systems and removing friction around new financial technology. XRP proponents like Levi Rietveld would quickly point out that the theme aligns closely with how the cryptocurrency and the XRP Ledger were engineered. The XRP Ledger works with transparent settlement, predictable transaction costs, and finality that does not depend on mining or complex smart contract execution. These characteristics are important for institutions that need clarity and reliability. In practice, XRP’s real-world role is most visible through payment solutions developed by Ripple. Banks and other financial institutions do not need to hold large balances of foreign currencies, since XRP can be used as an intermediate asset during settlement. XRP’s Current Regulatory And Institutional Position Progress on regulatory clarity has been helping real institutional infrastructure around XRP. Multiple Spot XRP ETFs have gained approval and launched in 2025 and early numbers are positive, with over $1.14 billion worth of inflows. Bloomberg estimates suggest these funds could draw $5 billion to $7 billion in institutional capital by 2026. Related Reading: Could XRP Make Trillionaires? Tech Firm Founder Thinks It’s Possible This creates new avenues for asset managers, pension funds, and other institutional allocators to hold XRP within traditional investment vehicles. All these cannot be possible without the clear framework for blockchain, stable coins, and new payment systems proposed by Bessent. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|crypto|crypto market|crypto news|cryptocurrency|digital currency|Ripple|xrp|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]