[
  {
    "id": 55808963,
    "published": 1765781881000,
    "title": "Doha Bank Issues $150M Digital Bond Using Euroclear’s DLT Platform",
    "body": "The deal achieved T+0 settlement on a permissioned distributed ledger rather than a public blockchain, reflecting a growing regional shift toward regulated digital bond infrastructure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Qatar|Standard chartered|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      }
    ]
  },
  {
    "id": 55811012,
    "published": 1765784869000,
    "title": "BTC $80K Check-Back Risk Rises as Nasdaq Rebound Stalls",
    "body": "Nasdaq and MOVE index patterns warrant caution for BTC bulls.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Markets|Nasdaq|Treasury|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55815328,
    "published": 1765790174000,
    "title": "Juventus Jumps After Billionaire Agnellis Family Rejects Tether’s Bid",
    "body": "Juventus Football Club SpA shares rose the most this year after the Agnellis family’s investment vehicle Exor NV rejected an unsolicited bid by Tether Holdings to acquire the Italian football club.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "MIL:JUVE",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55818258,
    "published": 1765794619000,
    "title": "Hashdex Unveils Its Top 3 Crypto Predictions For 2026",
    "body": "Hashdex is out with its 2026 crypto investment outlook, and the vibe is pretty clear: stop treating crypto like a weird side-bet and start treating it like… an allocation. The firm’s CIO Samir Kerbage says “most investors” should be thinking in the 5–10% range, framing it as a pragmatic response to a messier macro regime (sticky inflation risk, debt burdens, the 60/40 portfolio looking less like a law of nature and more like a historical artifact). Look, you can debate the exact number, but Hashdex’s point is that the underweight has become the active decision. Crypto is now “well above $3 trillion” in market cap and about 1% of the global investable market by its math—meaning a sub-1% allocation is basically a deliberate fade. They also cite a Charles Schwab survey where 45% of financial advisors said they planned to allocate to crypto ETFs over the next year. And they’re not just waving their hands. Hashdex runs a simple portfolio thought experiment: adding crypto exposure (represented by the Nasdaq Crypto Index US) to a 60/40 improves risk-adjusted returns in their backtest window, with higher allocations juicing total return while, yes, drawdowns get uglier. That trade-off isn’t hidden — it’s the whole point of sizing the position instead of YOLO’ing it. Related Reading: Crypto Tanks After Fed Cut: Santiment Breaks Down The Trap But the meat of the report isn’t “buy crypto because number go up.” It’s three themes, three predictions — basically a roadmap for what they think does the heavy lifting in 2026. Top 3 Crypto Predictions For 2026 First up: the “cryptodollar”. Hashdex argues stablecoins are starting to do something geopolitically weird and financially consequential: while some sovereigns try to de-dollarize, stablecoins re-dollarize at the user and corporate level, with issuers recycling that demand into short-duration Treasuries. Their baseline is stablecoins going from roughly $295 billion to well over $500 billion in 2026. If that accelerates, they suggest it changes the shape of Treasury demand — in one scenario, stablecoin growth could shorten the average duration of US debt by around four months (because the backing skews short). That’s the kind of detail bond people obsess over. Crypto people probably should, too. Related Reading: Will The Crypto Market Benefit From The Trump Fed Takeover? Second: tokenization finally acting like a flywheel instead of a conference slide. Hashdex points to tokenized RWAs at roughly $36 billion as of late 2025 and says the market could grow 10x to about $400 billion by end-2026. They also flag that tokenized Treasury bills have already climbed to over $8 billion, from a little above $700 million two years earlier. They namecheck real-world rollout examples — BlackRock’s liquidity fund, Franklin Templeton’s on-chain government money fund, UBS’s tokenized VCC fund in Singapore, Siemens’ on-chain bond — as proof this isn’t just crypto teams talking to themselves anymore. “We’re not spending enough time talking about how quickly we’re going to tokenize every financial asset.” Third: AI, but not the “add AI to the pitch deck” version. Hashdex says decentralized AI networks pulled nearly $1 billion in venture funding in 2025, largely aimed at problems like verification, coordination, and compute cost. Their call is the “AI Crypto” segment growing from about $3 billion to $10 billion in 2026. The throughline is simple even if the plumbing isn’t: stablecoins deepen on-chain liquidity, tokenization pulls more assets onto rails, and AI pushes demand for crypto-native infrastructure that can verify and coordinate without a single gatekeeper. Hashdex’s punchline is that 2026 is when “exploratory” turns into “strategic.” Not a tidy ending, sure — but markets rarely give you one. At press time, the total crypto market cap stood at $3.03 trillion. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto|Crypto market news|Crypto Market Trends 2026|crypto news|Crypto Predictions 2026",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55819499,
    "published": 1765796432000,
    "title": "Dogecoin Holds Demand Zone Above $0.13, What A Bounce Would Do",
    "body": "As the eventful year of 2025 draws to an end, crypto analysts are looking into what the Dogecoin price could hold for investors going into the end of the year. One of these analysts is BitGuru, who shared an interest in the Dogecoin price chart, highlighting the next possible roadmap that the meme coin could take. With the possibility of a bounce rising, the next targets have become increasingly important to identify in order to maximize gains. Why The Dogecoin Price Could Recover Quickly BitGuru’s analysis focuses on the rising demand surrounding the meme coin after finding support from the recent crash. The Dogecoin price had stopped above $0.13, suggesting that the demand at this level continues to hold strong as buyers return to the market. Related Reading: Reasons Why XRP’s Technical Structure Favors Upside Than Down Over Next 6 Months Pointing out this demand, the crypto analyst explains that the Dogecoin price is actually holding the demand zone after a prolonged downtrend. This is often bullish for the digital asset as it shows rising interest in the cryptocurrency as it establishes new support levels. This base formation, as the analyst calls it, could serve as the starting point for the next rally that could push the Dogecoin price higher. However, for this to happen, the Dogecoin bulls would have to maintain their position above this demand level. If this support level is held, then BitGuru forecasts that the Dogecoin price could start to recover again. This bounce could lead to a 50% increase, with the analyst’s chart outline putting it as high as $0.188. The upper end of the rally shows the price climbing to $0.22 before hitting resistance. End Of Year Could End Red Interestingly, the last quarter of the year has often been reasonably bullish for the Dogecoin price, but the year 2025 has deviated hard. So far, the quarter is already 41.8% deep in the red, according to data from the CryptoRank website, and it doesn’t look like that would change anytime soon. Related Reading: XRP Mirrors 2016 Trend That Led To 69% Crash Before 110,000% Rally The Dogecoin price is already down more than 7.5% in the month of December so far, contributing to the decline that has been felt in the quarter. The months of October and November ended in the red with 20% and 21.3% losses, respectively, and if this trend continues, then the Dogecoin price could follow suit. Featured image from Dall.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55820942,
    "published": 1765798420000,
    "title": "JPMorgan Launches Tokenized Money Market Fund on Ethereum as Wall Street Moves Onchain: Report",
    "body": "The $4 trillion U.S. bank is the latest financial giant in rolling out tokenized MMF onchain, joining BlackRock, Franklin Templeton and Fidelity.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Tokenization|Ethereum News|JPMorgan|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55822307,
    "published": 1765800690000,
    "title": "Bitcoin's Parabolic Arc Snaps: Trader Peter Brandt Eyes $25K Crash Floor",
    "body": "Veteran trader Peter Brandt warns that bitcoin's growth parabola has fractured, potentially leading to a price drop to $25,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Technical Analysis|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55824928,
    "published": 1765802295000,
    "title": "Aave DAO Pushes Back as Interface Fees Shift Away From Treasury",
    "body": "The change was framed as an upgrade offering improved execution, but delegates flagged that swap-related fees were no longer flowing to the Aave DAO treasury.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Tech|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55825687,
    "published": 1765806191000,
    "title": "Morning Minute: The SEC & OCC Usher In Crypto Era",
    "body": "Two major actions from late last week signal that crypto is fully entering the mainstream, with full regulatory buy in.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Opinion",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55826397,
    "published": 1765807200000,
    "title": "Ripple Expands $1.3B RLUSD Stablecoin to Ethereum L2s via Wormhole in Multichain Push",
    "body": "Ripple said it's testing its U.S. dollar stablecoin on Optimism, Base, Ink and Unichain with more blockchains to be added next year pending regulatory review.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Ripple|Stablecoin|Ethereum News|Wormhole|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55826399,
    "published": 1765807200000,
    "title": "Kula Brings $50M of Impact Investing Onchain With Community-Governed RWA Model",
    "body": "The decentralized investment firm is using tokens and DAOs to give local communities direct control over energy and infrastructure projects in emerging markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Real World Assets|Zambia|DAO|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55825957,
    "published": 1765806692000,
    "title": "Real-World Asset DeFi Moves Into Sports Finance With Tokenized Football Club Revenues",
    "body": "A new DeFi model is providing football clubs with faster access to liquidity by converting future media and broadcasting revenues into tokenized, onchain assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Web3|Sports|Soccer|Chiliz|Real World Assets|Tokenization|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55826755,
    "published": 1765807751000,
    "title": "Juventus Fan Token Slides Over 13% After Tether Bid Rebuff, Even as Club Shares Surge",
    "body": "Juventus Football Club shares surged after stablecoin issuer Tether made, and was rebuffed on, a €1.1 billion takeover bid, while the club’s fan token saw a double-digit pullback.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Juventus|Fan Tokens|Tether|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55827631,
    "published": 1765809012000,
    "title": "Strategy Adds Nearly a Billion Dollars in Bitcoin for Second Straight Week",
    "body": "Michael Saylor’s firm is still buying big, adding $980 million worth of Bitcoin—slightly more than last week’s BTC haul.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55828896,
    "published": 1765810800000,
    "title": "Most Influential: Todd Blanche",
    "body": "The crypto industry praised a memo signed by Deputy Attorney General Todd Blanche directing the Department of Justice to end “regulation by prosecution.”",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|DOJ|Tornado Cash|President Trump|CoinDesk Most Influential 2025|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55828898,
    "published": 1765810800000,
    "title": "Most Influential: Roman Storm",
    "body": "The Tornado Cash developer’s trial this summer is evidence that the crypto industry is still severely lacking regulatory clarity.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Roman storm|Tornado Cash|SDNY|Donald Trump|CoinDesk Most Influential 2025|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55828973,
    "published": 1765810800000,
    "title": "Most Influential: Sergey Nazarov",
    "body": "Chainlink’s co-founder spent 2025 turning oracles, cross-chain messaging and CRE into building blocks for tokenized funds and on-chain finance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Sergey Nazarov|DeFi|CoinDesk Most Influential 2025|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55830104,
    "published": 1765812641000,
    "title": "Why Did The Bitcoin, Ethereum, And XRP Prices Crash, And Will It Continue?",
    "body": "Crypto pundit Crypto Wimar has explained why the Bitcoin, Ethereum, and XRP prices crashed, highlighting the continuous selling pressure. The crypto market is also at risk of further downward pressure due to macro factors such as the impending Japan rate hike. Why The Bitcoin, Ethereum, And XRP Prices Crashed In an X post, Crypto Wimar revealed that Wintermute has dumped 40% of its holdings over the last three weeks, which has contributed to the crash in Bitcoin, Ethereum, and XRP prices. The crypto pundit further noted that the market maker is still dumping millions in BTC and ETH on Binance, which puts these coins at risk of further declines. Related Reading: What’s Happening With The Bitcoin, Ethereum, And Dogecoin Prices Recently? The Bitcoin, Ethereum, and XRP prices are also crashing as crypto market investors brace for a Japan interest rate hike by the BOJ at their December 19 meeting. Polymarket data shows that there is currently a 97.4% chance that the BOJ will increase rates by 25 basis points. A Japan rate hike impacts the crypto market as it puts the yen carry trade in focus, with investors moving to sell their assets before the yen strengthens and their debt becomes more expensive. Meanwhile, it is worth mentioning that the Bitcoin, Ethereum, and XRP prices have crashed after every Fed rate cut this year. This similar price action is playing out as the Fed lowered rates by 25 bps last week. These crypto assets had seen a notable rebound prior to the Fed rate decision last week, indicating that the cut was already priced in. Demand for Bitcoin, Ethereum, and XRP also appears to be dwindling, even among institutional investors. Crypto analytics platform CryptoQuant stated that Bitcoin treasury growth is losing momentum, noting that the accumulation pace is slowing despite the fact that 117 new companies added BTC to their treasuries this year. Ethereum treasury company BitMine is also the only company that has continued to accumulate ETH at an impressive pace amid this market downturn. BTC At Risk Of Drop Below $50,000 Crypto analyst Titan of Crypto has indicated that the Bitcoin price could still drop below $50,000, which also puts Ethereum and XRP at risk of crashing. In an X post, the analyst raised the possibility that a BTC bear pennant is forming. Related Reading: Why Is The Bitcoin Price Down Again? Analyst Calls Out Trading Desk For Triggering Crashes He noted that this is not a structure that market investors will typically want to see in a bull market. Titan of Crypto added that the structure is still developing, but it is one that is worth monitoring closely. Meanwhile, the analyst’s accompanying chart showed that the Bitcoin price could drop below $50,000 as soon as February next year. It is worth mentioning that veteran trader Peter Brandt had also earlier predicted that BTC could drop below $50,000 based on his belief that the flagship crypto is already in a bear market. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|Binance|bitcoin|Bitcoin news|bitcoin price|BoJ|btc|BTC news|btc price|btcusd|BTCUSDT|Crypto Wimar|cryptoquant|ethereum|fed|Peter Brandt|Polymarket|Titan Of Crypto|xrp",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55829835,
    "published": 1765812277000,
    "title": "TON Extends Slide, Drops More Than Broader Crypto Market",
    "body": "The token's trading range was volatile with above-average volume indicating trader repositioning and uncertainty.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Technical Analysis|TON",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 98,
        "NAME": "TON",
        "CATEGORY": "TON"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55829833,
    "published": 1765812187000,
    "title": "Bitcoin Miner IREN’s 47% Slide Flagged as a Buying Opportunity by B. Riley",
    "body": "The bank kept its buy rating on the stock and $74 target, citing a Microsoft GPU ramp and ample funding options.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Iren|Bitcoin Mining|B. Riley|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55830677,
    "published": 1765813309000,
    "title": "Tom Lee's BitMine Keeps Buying Ethereum, Adding $320 Million to ETH Treasury",
    "body": "Ethereum treasury firm BitMine Immersion Technologies added to its balance sheet last week, acquiring around $320 million in ETH.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55830560,
    "published": 1765813280000,
    "title": "BONK Slides Toward Lower Range as Volatility Expands",
    "body": "The Solana-based memecoin drifted back toward recent lows after failing to hold higher levels during a high-volume session.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Technical Analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 113,
        "NAME": "BONK",
        "CATEGORY": "BONK"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55830380,
    "published": 1765812998000,
    "title": "Strive Hikes Preferred Share Dividend Rate as Bitcoin Treasury Companies Continue to Plunge",
    "body": "Bitcoin has tumbled below $88,000 on Monday, helping to send Strive (ASST) common stock lower by 7% to $0.79",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55831163,
    "published": 1765814056000,
    "title": "Bitcoin Plunges Below $87K as Crypto Weakness Worsens",
    "body": "The curse of the U.S. trading session — in which bitcoin tends to fall as American stocks trade — has hit yet again.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Markets|Bitcoin News|Ethereum News|Breaking News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55830989,
    "published": 1765813914000,
    "title": "ICP Slips Back Toward Recent Lows as Rally Attempt Fades",
    "body": "Internet Computer drifted lower after failing to hold intraday gains, with elevated volume reflecting continued distribution near resistance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Technical Analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 82,
        "NAME": "ICP",
        "CATEGORY": "ICP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55832062,
    "published": 1765815391000,
    "title": "Anchorage Digital Buys Securitize’s RIA Platform to Expand Wealth Management Business",
    "body": "The bank has bought the Securitize For Advisors unit, bringing the RIA-focused crypto wealth management platform in-house.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Anchorage Digital|Securitize|mergers and acquisitions|Exclusive|CoinDesk Wealth|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55831706,
    "published": 1765814820000,
    "title": "CME Group Expands Crypto Derivatives With Spot-Quoted XRP and Solana Futures",
    "body": "These are CME’s smallest crypto contracts to date, aimed at active participants who prefer to trade in spot market terms without managing contract expiries or rollovers.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|CME Group|Solana News|XRP News|crypto futures|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55831885,
    "published": 1765813781000,
    "title": "Ondo Finance to Offer Tokenized U.S. Stocks, ETFs on Solana Early Next Year",
    "body": "The platform will enable 24/7 trading of U.S. stocks and exchange-traded funds with near-instant settlement, building on Ondo's existing $365 million in tokenized assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Tokenization|Solana News|Tokenized Securities|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 108,
        "NAME": "ONDO",
        "CATEGORY": "ONDO"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55832235,
    "published": 1765815598000,
    "title": "Bank of America says U.S. banks are heading for multi-year onchain future",
    "body": "The Wall Street firm said faster U.S. stablecoin and charter rules are pulling crypto into the regulated banking system and pushing banks toward an on-chain future.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|crypto regulation|Stablecoins|Bank of America|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55832709,
    "published": 1765815043000,
    "title": "Bitcoin is \"Digital Labubu”! Crypto Plummets! SEC & OCC usher in Crypto Era!",
    "body": "Crypto majors were mostly flat over the weekend; btc even at $89,700; eth +1% at $3,150, bnb +1% at $888, sol +1% at $133. Mnt (+10%), merl (+3%) and trx (+3%) led top movers. The sec issued a no-action letter allowing certain tokenized stock offerings, giving firms some regulatory clarity to launch tokenized equities without immediate enforcement risk. The sec also issued an investor bulletin explaining the basics of crypto custody. The occ granted national bank charters to circle, ripple, and other crypto firms. Tether considered tokenizing its stock after pursuing a share sale that could value it around $500b. Vanguard’s quant equity head compared bitcoin to a “digital labubu” even as vanguard opened client access to trading crypto etf products. The uk proposed legislation to bring crypto under its full fca regulatory oversight. Xstocks enabled tokenized equities to move between solana and ethereum using chainlink’s ccip bridge. Netflix greenlit a crypto-themed comedy titled one attempt remaining, starring jennifer garner.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55833123,
    "published": 1765816890000,
    "title": "Ripple to Expand $1.3 Billion RLUSD Stablecoin to Ethereum Layer-2 Networks",
    "body": "To support the growth of its RLUSD stablecoin, Ripple said the token is expanding next year to layer-2 networks on Ethereum.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55833898,
    "published": 1765818023000,
    "title": "Why XRP Isn’t Reacting to Major Institutional and Regional Developments",
    "body": "XRP has spent the past several weeks moving sideways around the $2.00 level, even as headlines around Ripple and the broader XRP ecosystem continue to stack up. Related Reading: Dogecoin Holds Demand Zone Above $0.13, What A Bounce Would Do From a $300 million venture fund expansion into South Korea to nearly $1 billion in spot ETF inflows and fresh regulatory approvals, the backdrop appears supportive on paper. However, price action tells a different story. Instead of responding to institutional traction and regional growth, XRP remains locked in a tight range, reflecting a disconnect between developments and market behavior. XRP's price trends to the downside on the daily chart. Source: XRPUSD on Tradingview Institutional Growth Isn’t Translating Into Token Demand Ripple’s expansion into South Korea through a $300 million venture fund has drawn attention due to the involvement of well-established, Seoul-based asset managers. However, market participants are increasingly viewing this move as tied to Ripple’s corporate strategy and potential IPO positioning, rather than direct demand for XRP. Institutional investors tend to prioritize predictable cash-flow or equity-style exposure, limiting the immediate impact such initiatives have on the token’s market dynamics. A similar pattern is visible in the ETF market. Spot XRP ETFs have recorded roughly $990 million in inflows over 30 consecutive days, making them one of the fastest-growing crypto fund segments. Despite this, XRP has fallen more than 12% over the past month. Analysts note that ETF inflows do not always translate into spot market pressure, especially when liquidity is fragmented or offset by broader risk-off sentiment across crypto assets. Technical Pressure and Broader Market Headwinds From a technical standpoint, XRP remains under pressure. The price has retraced to key Fibonacci levels after falling from its yearly high near $3.65. Chart patterns such as a developing death cross and a double-top formation point to downside risk, with support levels around $1.63 and $1.50 in focus if selling continues. Traders describe the current phase as bearish consolidation, with strong resistance clustered between $2.00 and $2.20. These conditions mirror weakness across the wider crypto market. Bitcoin’s decline from earlier highs and drawdowns in major altcoins have reduced risk appetite, often pulling XRP lower regardless of asset-specific news. Liquidity, Bots, and Muted Price Response Market structure may also be playing a role. Analysts point to low trading volumes and heavy arbitrage activity as factors keeping XRP pinned near psychological levels. In thin markets, automated strategies tend to fade moves quickly, preventing follow-through. While some data suggests tokens are gradually moving off exchanges, signaling longer-term holding, short-term price discovery remains dominated by macro flows and Bitcoin-led volatility. Related Reading: Dogecoin (DOGE) Slides Deeper Into Red—Is a Bottom in Sight? Currently, XRP’s lack of movement reflects market mechanics more than a judgment on progress within its ecosystem. Until volume and liquidity shift decisively, headlines alone may not be enough to move the price. Cover image from ChatGPT, XRPUSD chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ripple|xrp|XRP Price|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55833750,
    "published": 1765817748000,
    "title": "Juventus Owner Rejects Tether's $1.2 Billion Acquisition Offer, Sending Team's Stock Soaring",
    "body": "Shares in Italian soccer club Juventus are up 17% after its majority owner spurned an all-cash offer from stablecoin issuer Tether.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55834583,
    "published": 1765819077000,
    "title": "Bitcoin Hashrate Sees Sharpest Post Halving Drop Since 2024 Amid China Machine Shutdowns",
    "body": "Roughly 400,000 bitcoin mining machines shut down in China, according to former Canaan chairman.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Hashrate|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55836346,
    "published": 1765821807000,
    "title": "BlackRock Expands Crypto Bet With 7 Senior Hires Across U.S. and Asia",
    "body": "The $10 trillion asset manager is staffing up to scale digital asset ETFs, pursue tokenization and identify \"first-mover big bets\" in Asia.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|BlackRock|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55836269,
    "published": 1765821631000,
    "title": "Market Stress Continues As Bitcoin STH SOPR Dips Below 1– When Will The Pain End?",
    "body": "Bitcoin continues to struggle below the $90,000 level, failing to reclaim key resistance as bulls attempt to defend current demand zones. Price action reflects a market under pressure, with momentum fading after a prolonged correction. From its all-time high, Bitcoin has now retraced roughly 30%, placing the asset firmly in a corrective phase where uncertainty and caution dominate trading behavior. Related Reading: Ethereum Trades Near Whales’ Cost Basis For The Fourth Time Since 2021 – Historic Test According to a report from Axel Adler, on-chain data confirms that market stress is no longer limited to price alone. Two key indicators—the Short-Term Holder Spent Output Profit Ratio (STH SOPR) and the P/L Block—are signaling broad loss realization among participants and a deterioration in overall market sentiment. These metrics provide insight into the behavior of short-term holders, who are often the most sensitive to price swings and macro uncertainty. Together, these signals suggest that Bitcoin remains in a fragile state, where confidence has weakened, and recovery attempts face increasing resistance. STH SOPR and P/L Block Confirm Capitulation Pressure Adler explains that the Short-Term Holder Spent Output Profit Ratio (STH SOPR) measures whether coins held for less than 155 days are being sold at a profit or a loss. When the indicator falls below one, it signals that recent buyers are realizing losses. Currently, the 7-day moving average of STH SOPR has slipped into the red zone, with a reading near 0.99. This confirms that short-term holders are, on average, selling Bitcoin below their acquisition price—a behavior typically associated with heightened stress and emotional selling. Historically, similar SOPR conditions have marked local capitulation phases, when selling pressure peaks and weaker hands exit the market. As long as the SOPR 7-day average remains below one, short-term participants stay in “stress mode.” Adler notes that a meaningful improvement would require a sustained move back above one on a daily close, signaling that sellers have exhausted supply and buyers are once again absorbing sell-side pressure. Complementing this signal, the P/L Block indicator tracks the aggregated profit and loss state of market participants. The current red block reflects loss dominance, with a P/L Score of minus three—classified as pronounced stress. With Bitcoin down 30% from its all-time high and 30-day returns negative, both indicators align, reinforcing a clear picture of capitulation among short-term holders. Related Reading: XRP Whale Activity Spikes At The Bottom – A Classic Pre-Rally Signal Bitcoin Price Analysis: Weekly Structure Remains Critical The weekly chart shows Bitcoin trading around the $89,900 level after a sharp rejection from the $120,000–$125,000 region. Price has retraced aggressively but is now attempting to stabilize above the rising 200-week moving average (green), a level that has historically defined long-term trend validity. So far, this area is acting as dynamic support, suggesting that buyers are defending higher-cycle structure despite broader market weakness. However, Bitcoin remains below the 50-week moving average (blue), which is now sloping downward. This configuration reflects a loss of medium-term momentum and confirms that the market is still in a corrective phase rather than a resumed uptrend. The 100-week moving average (red) continues to rise well below price, reinforcing that the broader macro trend remains intact, but also highlighting how much excess was built during the prior rally. Related Reading: Bitcoin Whales Refuse to Sell: Historic Signal Emerges As Binance CDD Drops To 2017 Levels Volume has declined during the recent consolidation, signaling indecision rather than aggressive accumulation. This typically precedes a volatility expansion. From a structural perspective, holding above the $85,000–$88,000 zone is critical. A sustained breakdown below the 200-week MA would increase the probability of a deeper retracement toward the $75,000–$80,000 region. Conversely, reclaiming the 50-week MA near $95,000 would be an early signal that downside pressure is fading. Until then, Bitcoin remains range-bound, with long-term support holding but momentum still fragile. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|Bitcoin correction|Bitcoin news|Bitcoin Selling Pressure|Bitcoin STH|Bitcoin STH SOPR|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55835824,
    "published": 1765820826000,
    "title": "Bitcoin, Ethereum and XRP Fall to Lowest Prices in a Week as Liquidations Top $500 Million",
    "body": "Bitcoin plunged to a price of nearly $85,000 on Monday, hitting its lowest price since early December as hopes of a Santa rally fade.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55836507,
    "published": 1765821677000,
    "title": "Digital asset ETPs post third straight week of net inflows, led by US demand",
    "body": "Bitcoin and Ether accounted for the largest allocations, while short-Bitcoin products posted net outflows, according to CoinShares data.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55837640,
    "published": 1765811566000,
    "title": "XRP sinks below $2 despite $1B in ETF inflows: How low can price go?",
    "body": "XRP ETFs recorded inflows for 20 consecutive days, but its price lost key technical support levels, sparking fears of a drop to $1.40.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55838594,
    "published": 1765825380000,
    "title": "UK Supreme Court refuses BSV appeal, narrowing $13 billion lawsuit against crypto exchanges",
    "body": "Crypto lawyer Irina Heaver said the ruling reinforces limits on exchange liability and rejects claims tied to speculative future gains following BSV’s delisting",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|BSV|Craig Wright|Binance|ShapeShift|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 134,
        "NAME": "BSV",
        "CATEGORY": "BSV"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55838597,
    "published": 1765825243000,
    "title": "Can Bitcoin Price Still Hit $140,000? What The Global M2 Money Supply Says",
    "body": "The Bitcoin price outlook remains under scrutiny as market analysts assess whether the world’s largest cryptocurrency can still reach $140,000. Given BTC’s recent downturn and fluctuating price, it’s understandable that a dramatic surge to $140,000 could be viewed skeptically. However, the analyst points to global M2 Money Supply, highlighting its correlation with Bitcoin and its support for a significant upside move. New discussions have emerged in the crypto space about the relationship between the Bitcoin price action and the global M2 Money Supply. Pseudonymous crypto analyst ‘MoneyLord’ has projected a massive price surge to $140,000 for BTC based on M2 data. The analyst noted that many people are skeptical about the relevance of M2 Money Supply, likely questioning whether it still holds predictive value for Bitcoin’s performance. Global M2 Money Supply To Fuel $140,000 Bitcoin Price Surge According to MoneyLord, the recent disconnect between Bitcoin and M2 data should not be viewed as a failure of the model, but rather as a consequence of aggressive market interference and increased stress across global financial systems. In his technical report released on X, he argued that, without heavy manipulation and the collapse and insolvency of major entities, Bitcoin would have continued to track global liquidity growth. Related Reading: Is It More Profitable To Hold Bitcoin For The Short-Term? 2025 Numbers Are Here MoneyLord believes that those shocks temporarily suppressed BTC’s price expansion, likely contributing to its recent decline and slow momentum. With market conditions somewhat stabilizing, the analyst suggests that Bitcoin is poised to realign with global M2 Money Supply trends, potentially setting the stage for renewed upward momentum. From this perspective, the current phase is viewed as a delayed reaction rather than a failed cycle. MoneyLord predicts that if Bitcoin begins to catch up with M2 data, the cryptocurrency’s price could hit a target above $140,000 sooner than the market expects. The accompanying chart illustrates this bullish outlook, showing global liquidity, represented by the blue line, continuing to rise toward the projected price. With Bitcoin trading near $90,000 after a more than 6% decline this month, a rally to $140,000 would require a gain of at least 55%. Reaching this level would set a new all-time high, exceeding its present peak of over $126,000 by more than 10%. Bitcoin Shows Resilience Amid Market Sell-Offs According to crypto analyst Don, Bitcoin has bounced back after a period of sharp sell-offs that shook out many traders and triggered widespread liquidations. The analyst noted that bulls have stepped in to reclaim critical support and restore confidence in the market as BTC resumes trading within a well-defined ascending triangle pattern. Related Reading: Bitcoin Realized Losses From Entities Surges To 2022 Levels Following Crash Below $90,000 The chart shows that the triangle has an upper boundary near $94,324 and a lower boundary around $89,241. Price action inside the formation suggests that Bitcoin is consolidating and likely building momentum for a potential breakout. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|Ascending Triangle Pattern|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|Don|Global M2 Money Supply|MoneyLord",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55838427,
    "published": 1765821900000,
    "title": "Bitcoin parabola breakdown raises chance for 80% correction: Veteran trader",
    "body": "The Bitcoin parabola broke, leading some analysts to predict an 80% drawdown in BTC price. Will growing demand from traditional finance and strategic crypto reserves nullify all bearish predictions?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55838926,
    "published": 1765825800000,
    "title": "Price predictions 12/15: SPX, DXY, BTC, ETH, BNB, XRP, SOL, DOGE, ADA, BCH",
    "body": "Bitcoin rallies continue to be capped by selling near the intra-day range highs, and the expectation of Bank of Japan interest rate cuts could amplify the downturn in BTC and altcoins.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 12,
        "NAME": "BCH",
        "CATEGORY": "BCH"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55839437,
    "published": 1765826754000,
    "title": "Merriam-Webster Declares 'Slop' the Word of the Year as AI Eats the Web",
    "body": "Merriam-Webster's Word of the Year is \"slop,\" spotlighting AI-generated content that’s fluent, scalable—and increasingly hollow.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55839710,
    "published": 1765827272000,
    "title": "U.S. SEC chief warns watchdogs need to be limited in tapping crypto's power to snoop",
    "body": "",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|U.S. Securities and Exchange Commission|Paul Atkins|Privacy|government surveillance|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55840504,
    "published": 1765828834000,
    "title": "Why Bitcoin’s Quiet Price Action May Be ‘Dangerous’ – IFP Signals Rising Structural Risk",
    "body": "Bitcoin continues to struggle below the $90,000 level, failing to reclaim higher ground as bulls focus on defending current demand zones. After a sharp correction from recent highs, price action has entered a consolidation phase that, on the surface, appears relatively calm. Volatility has compressed, and short-term price movements suggest a market pausing rather than decisively breaking down. However, this apparent stability may be misleading. Related Reading: Ethereum Trades Near Whales’ Cost Basis For The Fourth Time Since 2021 – Historic Test According to a CryptoQuant report from XWIN Research Japan, on-chain data is signaling growing structural risk beneath the surface. The Inter-Exchange Flow Pulse (IFP), a metric that tracks the movement of Bitcoin between exchanges and serves as a proxy for internal market liquidity, has turned red. In such environments, price moves tend to be sharper and less orderly once direction is established. While reduced exchange balances can limit immediate selling pressure, they also amplify the impact of sudden demand or forced liquidations. This shift indicates a clear slowdown in capital circulation across trading venues, suggesting that liquidity conditions are deteriorating. Inter-Exchange Flow Pulse Signals Structural Fragility The report explains that the Inter-Exchange Flow Pulse (IFP) measures how actively Bitcoin moves from one exchange to another, serving as a proxy for internal market liquidity and capital circulation. When IFP is elevated, capital rotates efficiently across venues, arbitrage opportunities are quickly absorbed, and liquidity providers keep order books deep. In those conditions, price discovery is smoother, and volatility tends to remain contained. By contrast, when IFP declines, the market’s internal “blood flow” weakens. Capital becomes static, liquidity fragments, and prices grow increasingly sensitive to relatively small trades. This deterioration in liquidity is unfolding alongside historically low exchange balances. While reduced sellable supply can initially act as price support, it also creates thinner order books. Once price begins to move decisively in either direction, slippage increases and volatility accelerates. With leverage still elevated across derivatives markets, instability becomes driven less by directional conviction and more by the magnitude of forced reactions. Historically, periods when IFP turned red produced abrupt corrections and sharp price swings, not clean trends. The central risk today is therefore not aggressive distribution, but structural fragility. Until inter-exchange liquidity improves, Bitcoin remains vulnerable to sudden, outsized moves, making leveraged positioning particularly risky in the current market structure. Related Reading: XRP Whale Activity Spikes At The Bottom – A Classic Pre-Rally Signal Bitcoin Price Consolidates Below Key Moving Averages The 4-hour Bitcoin chart highlights a market locked in consolidation after a sharp corrective move. Following the aggressive sell-off in late November, BTC found a local bottom near the $82,000–$83,000 zone, where strong demand stepped in and triggered a rebound. However, that recovery quickly lost momentum, and price is now ranging below the descending cluster of moving averages. Bitcoin is currently trading around the $89,000–$90,000 level, repeatedly failing to reclaim the 200-period moving average on the 4-hour timeframe. The 50 and 100 moving averages are also sloping downward, acting as dynamic resistance and reinforcing the short-term bearish structure. Each attempt to push higher has been met with selling pressure, suggesting that bulls lack conviction at current levels. Related Reading: This Whale Isn’t Stopping: $392M Ethereum Long And A Tight Liquidation Price Revealed Volume has noticeably contracted during this consolidation phase, indicating reduced participation and indecision among traders. This typically precedes a volatility expansion, especially when price compresses beneath major resistance. Structurally, BTC remains vulnerable as long as it trades below the $92,000–$94,000 zone, which previously acted as support and now caps upside attempts. On the downside, the $87,000–$88,000 range is emerging as immediate support. A decisive breakdown below this area could reopen the path toward the $84,000 region. Until a clear breakout occurs, Bitcoin remains in a fragile balance between distribution and base-building. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin correction|Bitcoin IFP|Bitcoin news|bitcoin price|Bitcoin Price action|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55841496,
    "published": 1765830600000,
    "title": "Bitcoin drops under $86K as $2.78B in BTC whale selling overwhelms active dip buyers",
    "body": "Data shows traders bought the Bitcoin price dip, but $2.78 billion in selling by larger entities completely overshadowed the bulls. Can BTC hold above $86,000?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55841414,
    "published": 1765830403000,
    "title": "Financial Stability Oversight Council Softens Crypto Stance in 2025 Report",
    "body": "The U.S. FSOC has softened its tone on crypto assets in its latest report, arguing that the GENIUS Act provides regulatory clarity.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55841100,
    "published": 1765829648000,
    "title": "Anchorage Digital deepens RIA market push by acquiring unit of Securitize",
    "body": "The deal folds adviser-facing tools into Anchorage’s platform while allowing Securitize to remain focused on tokenizing real-world assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55842328,
    "published": 1765832419000,
    "title": "XRP Advances As A Recognized Digital Asset In Regulated Markets — Here’s How",
    "body": "The narrative surrounding XRP, the digital asset native to the XRP Ledger, has shifted from a speculative cryptocurrency to a recognized digital asset within the global financial system. This shift reflects growing legal clarity and rising interest from financial institutions seeking compliant blockchain-based solutions for payments, liquidity, and settlement. How Institutional Interest In XRP Continues To Build As XRP gains recognition in regulated financial markets, it’s moving beyond its earlier perception as a speculative digital asset. An analyst known as Skipper_xrp has mentioned on X that this milestone has placed XRP in the conversation alongside traditional assets that institutions already trust. With recent developments from the US Commodity Futures Trading Commission (CFTC) and rising institutional interest, investors are wondering whether XRP’s growing credibility could be the catalyst for the next major price movement. Related Reading: Not Just Crypto: Research Says XRP Is Moving Into Bank-Grade Payment Infrastructure Meanwhile, tokenization is no longer a theoretical concept; it’s now a tangible reality. The ability to unlock trillions of dollars in real-world assets through blockchain is transforming how the markets will operate. On this front, the REAL token on the XRP Ledger isn’t just participating, it’s leading the change, and opening doors to an unprecedented global market. Ripple recently made the single biggest unlock for XRP since the case against the US SEC, and it has nothing to do with a court ruling. X Finance Bull has provided insight into the CLARITY Act, which legally defines digital commodities under CFTC oversight, eliminating guesswork and excuses from institutions. The real barrier to mass XRP adoption wasn’t tech or liquidity, but a legal risk, and that wall just cracked wide open. Currently, banks can use XRP rails, brokers can move in flow, and corporate treasuries can hold XRP on their books without stepping into uncertainty. This isn’t future potential; it’s the regulatory permission that is required before deploying serious capital. Many tokens don’t fit the mold, but XRP already operates on payment-grade, bank-ready infrastructure designed for real-world settlement, and first in line for real volume. “When institutions get the green light, the token with roads already built will lead,” Xfinancebull noted. A New Gateway Between Asian Markets And Ripple Labs Technical analyst, ChartNerd, revealed that VivoPower International PLC has quietly transformed a standard joint venture agreement into a strategic expansion vehicle with asymmetric exposure. Instead of deploying heavy capital, the structure creates a bridge between Seoul’s institutional crypto markets and Ripple Labs’ private equity, which is aligning with access rather than ownership. Related Reading: Fed Turns On The Liquidity Hose, XRP Ready To Ignite, Investor Claims ChartNerd stated that the play is targeting $300 million in Ripple Lab shares. Furthermore, VivoPower has a capital-light model that delivers substantial upside while minimizing corporate risk. Featured image from Peakpx, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|cftc|ChartNerd|CLARITY Act|REAL|Ripple|Ripple Lab|S Commodity Futures Trading Commission|US SEC|VivoPower International PLC|X Finance Bull|xrp|XRP Ledger|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55842387,
    "published": 1765832651000,
    "title": "‘Much more than a backend refresh’: Coinbase’s fintech pivot hits milestone",
    "body": "Wednesday’s update could debut tokenized assets, onchain AI agents and global Base features as crypto exchange Coinbase aims to redefine its business model.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Coinbase|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55843196,
    "published": 1765834158000,
    "title": "UK Supreme Court Shuts Down $13 Billion Bitcoin SV Case Appeal",
    "body": "Bitcoin SV (BSV) investors had their appeal refused by the UK Supreme Court, dismissing a $13 billion claim in the process.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|bitcoin-cash-sv|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 134,
        "NAME": "BSV",
        "CATEGORY": "BSV"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55843292,
    "published": 1765834462000,
    "title": "Bitcoin slides to $86,000 as slower rate cut risk, AI stock woes shake markets",
    "body": "Crypto-related stocks suffered far deeper declines as bitcoin slumped well below its recent trading range.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Markets|market analysis|Breaking News|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55843458,
    "published": 1765834417000,
    "title": "Circle to acquire Interop Labs team and IP as Axelar remains independent",
    "body": "The agreement adds a key interoperability engineering team to Circle, strengthening its crosschain infrastructure and support for multichain applications.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55843290,
    "published": 1765834340000,
    "title": "Senate punts crypto market structure bill to next year",
    "body": "The Senate will not hold a market structure markup hearing this month, pushing any progress toward a new crypto law to next year.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Market Structure Legislation|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55843784,
    "published": 1765835196000,
    "title": "SEC commissioner says Crypto is ‘helping to nudge reassessment’ on privacy",
    "body": "The SEC's crypto task force held its sixth roundtable event, hosting representatives from digital asset advocacy groups and other organizations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55847556,
    "published": 1765843257000,
    "title": "PayPal, issuer of PYUSD, applies for Utah industrial bank license",
    "body": "The company behind the PYUSD stablecoin said it wants to offer business lending and interest-bearing savings accounts.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|PayPal|banks|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 191,
        "NAME": "PYUSD",
        "CATEGORY": "PYUSD"
      }
    ]
  },
  {
    "id": 55848113,
    "published": 1765844255000,
    "title": "Bitcoin, altcoins sell-off as Fed chair switch-up, AI bubble fears spook markets",
    "body": "The crypto market corrected as a shake-up in the Trump administration’s Fed chair pick spooked traders, and growing US macroeconomic challenges led investors to risk-off.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55849260,
    "published": 1765846817000,
    "title": "Bitcoin Could Drop To $70K As Bank Of Japan Rate Move Approaches—Analysts",
    "body": "Bitcoin risks a further drop toward the $70,000 area if the Bank of Japan follows through with an expected interest-rate rise on Dec. 19, analysts focused on macro forces warned. Related Reading: Analyst: Bitcoin’s Cycle Is Intact, Yet No Longer Purely Market-Driven According to multiple macro-focused voices, the move could sap global liquidity and put fresh downward pressure on risk assets, with some traders already bracing for a sharp pullback. Japan’s policy shift matters because higher rates tend to strengthen the yen and raise the cost of borrowing. When that happens, traders who previously borrowed cheaply in yen to invest elsewhere are often forced to unwind those positions. That process can pull money out of global markets in a short period of time, and Bitcoin has often felt that impact as investors cut exposure during risk-off stretches. BOJ Tightening Drains Global Liquidity According to AndrewBTC, every BOJ hike since 2024 has coincided with Bitcoin drawdowns of more than 20%. Based on reports, the analyst pointed to declines of roughly 23% in March 2024, 26% in July 2024, and 31% in January 2025. 🚨 BREAKING: JAPAN WILL CRASH $BTC Bank of Japan is set to hike rates +25 bps on Dec 19. Japan = largest holder of US government debt 🇯🇵 📉 Look at the $BTC chart: Every BoJ rate hike → Bitcoin dumps over 20%+👇 • March 2024 → -23% • July 2024 → -26% • January 2025 →… pic.twitter.com/grN3QRNUg4 — AndrewBTC (@cryptoctlt) December 13, 2025 Traders are not only watching central bank calendars. Bitcoin’s daily chart also flashed a classic bear flag formation after a steep fall from the $105,000–$110,000 area in November. Market Positioning Widens Ahead Of Key Data Bitcoin slipped below $90,000 in thin trading on Sunday, a move that traders took as a cautionary sign rather than a definitive trigger. Based on reports, Ether held up better than many altcoins, suggesting selective risk taking in the market. Traders are positioning before a busy slate of US data and central bank events that could sway flows. Analyst EX bluntly warned BTC will collapse “below $70,000” under the stated macro conditions, a stark forecast that highlights how crowded bets can amplify moves when liquidity is pulled. EVERY TIME JAPAN HIKES RATES, BITCOIN DUMPS 20–25% NEXT WEEK, THEY WILL HIKE RATES TO 75 BPS AGAIN. IF THE PATTERN HOLDS, $BTC WILL DUMP BELOW $70,000 ON DECEMBER 19. POSITION ACCORDINGLY. pic.twitter.com/IWU8JbXjn3 — ΞX (@rektbyEX) December 13, 2025 Related Reading: Bitcoin Pulls Back Under $89K, Michael Saylor Smells Opportunity What This Means For Investors The story tying BOJ policy to Bitcoin’s swings is simple in outline: when funding costs in Japan rise, global borrowing becomes pricier, and risk assets can be sold as positions are reduced. That dynamic helps explain why past BOJ moves lined up with 20-30% declines in Bitcoin. Still, markets often try to price events ahead of time; a hike that’s already built into prices may have a smaller effect than one that comes as a surprise. Featured image from Nikkei Asia, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|Bank of Japan|bitcoin|BoJ|btc|btcusd|crypto|fed|rate hike",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55849254,
    "published": 1765846800000,
    "title": "SBI, Startale to launch regulated yen stablecoin for global settlement",
    "body": "The digital yen stablecoin aims to plug Japan into onchain finance and cross-border tokenized asset flows under the country's new FSA regime.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|SBI|Stablecoins|yen|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      }
    ]
  },
  {
    "id": 55850188,
    "published": 1765848405000,
    "title": "PayPal Moves to Set Up Utah-Chartered Bank to Bolster Payments and Lending",
    "body": "PayPal is seeking a state-chartered bank license as it deepens lending, deposits, and crypto-linked settlement services in the U.S.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 55851118,
    "published": 1765850436000,
    "title": "Cardano SuperTrend Turns Bearish—Last Signal Preceded 80% ADA Drop",
    "body": "A cryptocurrency analyst has pointed out how Cardano has formed a technical analysis (TA) signal on its weekly chart that last led into a major price drawdown. Cardano SuperTrend Has Flipped Bearish In a new post on X, analyst Ali Martinez has talked about a signal that has appeared in the SuperTrend of Cardano. The “SuperTrend” refers to a TA indicator that’s generally used for determining whether a given asset is following a bearish or bullish trend. It’s built using the Average True Range (ATR), another TA indicator that measures the degree of volatility being experienced by the price. Related Reading: XRP Mildly Undervalued On MVRV: What About Bitcoin, Ethereum? The SuperTrend is represented by a single trendline that acts as both support and resistance, depending on which side the asset is trading. When the price is above this line, the indicator signals that the asset is in a bullish trend. On the other hand, being under the line implies the dominance of a bearish trajectory. Now, here is the chart shared by Martinez that shows the trend in the SuperTrend of Cardano over the last few years: As displayed in the above graph, the weekly Cardano price broke above the SuperTrend line during 2023 and stayed over it throughout 2024 and much of 2025. Recently, however, the price has finally seen a reversal of trend, with the indicator now giving a bearish signal instead. In the chart, Martinez has highlighted what happened the last time that this pattern developed in ADA’s 1-week price. It would appear that the flip to a bearish trend led to a decline of more than 80% for the cryptocurrency in 2022. It now remains to be seen whether the SuperTrend giving a sell signal is foreshadowing something similar this time, or if Cardano will see the renewal of bullish momentum despite the pattern. Related Reading: Stellar (XLM) Forms Signal That Last Led To 95% Price Rally Cardano isn’t the only coin in the sector that has seen a flip in the SuperTrend recently. As the analyst has highlighted in another X post, the number one cryptocurrency, Bitcoin, has also seen a change in its SuperTrend. From the above chart, it’s apparent that the weekly price of Bitcoin is now trading under the SuperTrend line, a sign that a bearish trend is taking over. Like for Cardano, the last time this flip happened was in the last bear market. Back then, BTC dropped by over 60%. ADA Price Cardano saw brief recovery above $0.48 last week, but the cryptocurrency has since witnessed a retrace as its price is now back at $0.40. Featured image from Dall-E, charts from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cardano|ADA|ADAUSDT|Cardano Bearish|Cardano SuperTrend",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55852612,
    "published": 1765853062000,
    "title": "Bitcoin Price Drops 5%—Is the Downtrend Back in Control?",
    "body": "Bitcoin price corrected gains and traded below the $88,000 support zone. BTC is now consolidating and might struggle to clear the $88,500 zone. Bitcoin started a fresh decline from the $90,500 zone. The price is trading below $88,000 and the 100 hourly Simple moving average. There is a bearish trend line forming with resistance at $89,000 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move up if it settles above the $85,000 zone. Bitcoin Price Dips Further Bitcoin price failed to gain strength for a move above the $90,000 and $90,500 levels. BTC started a fresh decline and traded below the $88,500 support. The price even spiked below the $87,000 support. However, the bulls were active near the $85,000 zone. A low was formed at $85,151 and the price is consolidating gains below the 23.6% Fib retracement level of the downward move from the $93,560 swing high to the $85,151 low. Bitcoin is now trading below $88,000 and the 100 hourly Simple moving average . If the bulls remain in action, the price could attempt another increase. Immediate resistance is near the $87,150 level. The first key resistance is near the $87,500 level. The next resistance could be $88,000. A close above the $88,000 resistance might send the price further higher. In the stated case, the price could rise and test the $89,000 resistance. There is also a bearish trend line forming with resistance at $89,000 on the hourly chart of the BTC/USD pair. Any more gains might send the price toward the $90,000 level. The next barrier for the bulls could be $91,000 and $91,500. Another Decline In BTC? If Bitcoin fails to rise above the $87,000 resistance zone, it could start another decline. Immediate support is near the $85,500 level. The first major support is near the $85,000 level. The next support is now near the $83,500 zone. Any more losses might send the price toward the $82,500 support in the near term. The main support sits at $80,000, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $85,500, followed by $85,000. Major Resistance Levels – $88,000 and $89,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55853155,
    "published": 1765854001000,
    "title": "Shiba Inu Remains A Familiar Crypto Name As Losses Pile Up",
    "body": "Shiba Inu has kept a spot in crypto talk even as its price has slid sharply. According to reports, the network had a market cap of $5 billion as of Dec. 6, and it still draws attention because people know the name. That visibility, however, does not settle the debate over whether the token belongs in a long-term portfolio. Related Reading: Bitcoin Headed For $200 Trillion? CEO Makes Bold Prediction Shiba Inu’s Price And Market Size Based on reports, Shiba Inu has seen massive moves over several years. Roughly five years ago it traded near $0.0000000001684; at the time of writing, it is quoted at about $0.000008439. SHIB’s all-time high stands at $0.00008845, which means the token trades roughly 85% below that peak. Reports have disclosed that SHIB has tanked about 55% so far this year, and some data points show almost a 60% decline over a recent 12-month span. Those drops have pushed many investors to ask whether the story that once lifted SHIB has faded. On-Chain Signals And Holder Counts There are mixed signals on the chain. Data from CryptoQuant is reported to show memecoin dominance falling to its lowest level since early 2024, a sign that speculative interest across similar tokens has ebbed. At the same time, the number of wallets holding SHIB moved from about 1.45 million at the start of the year to around 1.52 million more recently. That jump in holders was noted alongside the price slide. It suggests distribution rather than complete abandonment; small increases in holders do not always mean increased trading activity, but they can show steady retail interest. Memecoin markets are dead. pic.twitter.com/6kymLWH4JX — Ki Young Ju (@ki_young_ju) December 11, 2025 Pundit Views And The Utility Question Meanwhile, crypto pundit Neil Patel has listed reasons he would not treat Shiba Inu as a proper investment. He argues the memecoin doesn’t solve a clear, large-scale problem and points out that developer activity for SHIB is limited compared with many other networks. The claim is that much of SHIB’s value has been driven by hype cycles and not by broad real-world use. Those views were presented in firm terms, and they have been repeated across a range of commentaries that warn about hype-driven tokens. Related Reading: Analyst: Bitcoin’s Cycle Is Intact, Yet No Longer Purely Market-Driven Investor Takeaways And Risks Investors who want exposure to crypto are often told to look at major networks such as Bitcoin for scarcity-driven arguments; that point was brought up in several reports. At the same time, SHIB’s supporting projects — a layer-two chain, a decentralized exchange, a metaverse concept — are real but appear to have small adoption so far. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|crypto|memecoin|SHIB|Shiba Inu",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 44,
        "NAME": "SHIB",
        "CATEGORY": "SHIB"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55853222,
    "published": 1765853869000,
    "title": "Bitcoin to hit new all-time high within 6 months: Grayscale",
    "body": "Grayscale’s 2026 outlook cites institutional demand and clearer US regulation as key catalysts for Bitcoin’s surge in the first half of 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55853973,
    "published": 1765855410000,
    "title": "Bitcoin, AI stock slide sees over $500 million in bullish bets wiped out",
    "body": "Data shows 181,893 traders were liquidated, with long positions accounting for over 87% of total losses.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55853838,
    "published": 1765855134000,
    "title": "Ethereum Price Sinks Under $3K—Is Volatility About to Explode?",
    "body": "Ethereum price started a fresh decline below $3,00 0. ETH is now consolidating and might soon aim to start a recovery wave above $2,980. Ethereum started a fresh decline from the $3,175 zone. The price is trading below $3,000 and the 100-hourly Simple Moving Average. There is a connecting bearish trend line forming with resistance at $3,120 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move down if it settles below the $2,920 zone. Ethereum Price Dips 5% Ethereum price failed to stay above $3,150 and started a fresh decline, like Bitcoin . ETH price dipped below $3,120 and $3,050 to enter a bearish zone. The bears even pushed the price below $3,000. A low was formed at $2,916 and the price is now consolidating losses below the 23.6% Fib retracement level of the downward move from the $3,175 swing high to the $2,916 low. Ethereum price is now trading below $3,000 and the 100-hourly Simple Moving Average . Besides, there is a connecting bearish trend line forming with resistance at $3,120 on the hourly chart of ETH/USD. If there is another upward move, the price could face resistance near the $2,980 level. The next key resistance is near the $3,050 level and the 50% Fib retracement level of the downward move from the $3,175 swing high to the $2,916 low. The first major resistance is near the $3,080 level. A clear move above the $3,080 resistance might send the price toward the $3,120 resistance. An upside break above the $3,120 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $3,175 resistance zone or even $3,200 in the near term. More Losses In ETH? If Ethereum fails to clear the $2,980 resistance, it could start a fresh decline. Initial support on the downside is near the $2,950 level. The first major support sits near the $2,920 zone. A clear move below the $2,920 support might push the price toward the $2,880 support. Any more losses might send the price toward the $2,840 region. The next key support sits at $2,800. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI – The RSI for ETH/USD is now below the 50 zone. Major Support Level – $2,920 Major Resistance Level – $3,080",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55854391,
    "published": 1765856077000,
    "title": "XRP price weakens at critical level, raising risk of deeper pullback",
    "body": "",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|XRP News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55855323,
    "published": 1765857619000,
    "title": "Cardano Targets $10.40 As ‘2020 Blastoff’ Pattern Returns, Analyst Says",
    "body": "Cardano (ADA) is getting the “2020 blastoff” treatment again — at least if you ask Quantum Ascend, a technical analyst on X who says the chart is starting to rhyme with the setup that preceded ADA’s last major run. In a Dec. 13 video shared on X, Quantum Ascend (@quantum_ascend) told followers he’s been working through a longer-term weekly count and thinks the market may be grinding toward the end of a drawn-out corrective structure. The punchline: a “conservative” target zone around $4.88–$5.50, and a “primary” bull-run target of $10.40. “Cardano Mirroring 2020 Blastoff Moment,” his post read, before laying out the two tiers: “Conservative: $4.88-$5.50” and “Primary: $10.40.” The Framework Behind The Cardano Price Prediction The framework he’s leaning on isn’t a clean five-wave impulse, he said. Instead, he framed it as something slower and messier — “more of like a large time-based macro correction here on the D-wave,” he said, describing what he believes is a triangle structure developing on the weekly chart. “We’re creating a triangle structure,” he said. “So I am going to be looking for the E-wave. That’s what ends up coming next.” Related Reading: Cardano’s December Slide Intensifies: What’s Driving the Decline and What Comes Next? A big part of the argument is confluence. Quantum Ascend walked through multiple measurements and trendlines, pointing to price zones where different tools cluster. One reference point was a prior A-to-B drawdown range that, in his view, still hasn’t been fully “closed out,” with a key level “up there at the $5.50 mark.” Then he zoomed out to the bigger structure, highlighting how an upper trendline from a C-to-D drawdown “converges with the 3.618 [Fibonacci extension] up here,” which he suggested adds weight to the $10 area. “So some confluence for that $10 area,” he said, pointing at the chart level he called out around $10.62. He also reached for a relative-performance comparison — not to Ethereum itself, but to Ethereum Classic. “I have another video from the past that compares Ethereum Classic to ADA,” he said. “And if it ends up doing a similar move to Ethereum Classic, that also puts us up into the $10 range.” Still, the near-term “safe” target he kept circling back to was the $5 region. After walking through a more recent drawdown “going back to the top of the Trump pump to where we’re at now,” he said a “full extension gets us pretty close… around $4.88,” adding that the $5 zone shows “a lot of different signs of confluence.” “For me, I’m going to say my conservative estimate for ADA is going to be that $5 range,” he said. Then he went straight to the headline number: “I think ADA gets up there around 10 bucks during this bull run.” To make the comparison feel less abstract, Quantum Ascend argued the current chop looks structurally similar to a prior period before ADA’s last breakout — a fractal-style read. “You guys notice the similarities here?” he asked, describing how both moves get “stopped out a little bit above the 0.5,” roll over, then revisit the lower trendline before pushing back to the top of the range. Related Reading: Cardano’s Recovery Stalls, but TVL Growth Signals Could Spark Year-End Upside And then he widened the lens beyond Cardano, tossing in a fairly aggressive macro view that sits underneath the bullish alt targets. “I honestly, guys, across the board right now, I believe that these corrections are coming to an end,” he said. “I think we have a blow off top in stock markets, in crypto and all of that coming.” But he also stressed he’s not married to a long-duration “supercycle” narrative. “I am not a long-term bull,” he said. “I am not [predicting a] Bitcoin super cycle to $400K.” His current bitcoin top, he added, is $155,000 — and he expects alts to “severely outperform” in the final leg before “it’s all over.” On the math side, Quantum Ascend framed $10.40 as big, but not absurd in a market that has already produced outsized multiples. “If we were to get that 1040, 25X, right?” he said, comparing it to prior cycles where ADA saw moves he pegged at “168X” and “75X.” “So we’re just talking about a 25er,” he added. “Not that crazy when you put it into perspective.” At press time, ADA traded at $0.4022. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cardano|ADA|ADA news|ADA price|Cardano news|Cardano price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 23,
        "NAME": "ETC",
        "CATEGORY": "ETC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55856986,
    "published": 1765860232000,
    "title": "Over 1 in 20 emails are malicious, warns internet giant Cloudflare",
    "body": "Cloudflare found over 5% of global emails were malicious in 2025, peaking at nearly 10% in November, with more than half of them containing deceptive links.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55857502,
    "published": 1765861204000,
    "title": "Solana Leads As Most Popular Blockchain Ecosystem For Second Consecutive Year – Report",
    "body": "Solana (SOL) has emerged as the most popular blockchain ecosystem of 2025, securing its crown for the second consecutive year despite a significant decrease in chain-specific global interest compared to the previous year. Related Reading: Bitcoin Bearish Signals Are ‘Hard To Ignore’: Analyst Warns Of Drop To April Lows Solana Takes The Popularity Crown On Monday, Solana was named the leading blockchain ecosystem by popularity in 2025 by crypto data aggregator CoinGecko. The study examined interest in blockchain ecosystems based on CoinGecko’s non-botted global web traffic from January 1 to December 14, 2025, only including ecosystems with actively listed coins and a non-zero percentage share of traffic. As a result, a total of 62 blockchain ecosystems were included in the study. Out of the 62 blockchain ecosystems studied, the 20 most popular represented a majority of 95.60% of global interest in chain-specific narratives. According to the report, the Solana ecosystem captured 26.79% of the global interest in chain-specific narratives this year, retaining its title as the most popular blockchain ecosystem for a second consecutive year. The Base ecosystem followed in second place, accounting for 13.94% of global investor interest in chain-specific narratives this year, led by constructive developments and partnerships. However, its mindshare experienced a 2.9% decrease from the 16.81% recorded in 2024. Similar to Solana and Base, the Ethereum ecosystem also retained its position from the 2024 list, ranking as the third most popular ecosystem with 13.43% of global interest. Meanwhile, Sui and BNB Chain moved up in the list, ranking 4th and 5th after more than doubling their mindshare in 2025. Per the study, the Sui ecosystem recorded the largest mindshare growth, with a 6.9% year-over-year (YoY) increase to reach 11.77% of the total global interest in chain-specific narratives. The BNB Chain ecosystem saw a 4.9% surge YoY to capture 9.05% in mindshare, fueled by the launch of Binance Alpha in May, which increased BNB Chain’s on-chain trading volumes, the report noted. Notably, XRP Ledger, Bittensor & Hyperliquid lead new entrants into the top rankings, securing a spot in the top 10 this year. SOL Memecoins Out Of Leading Narratives Despite leading the popularity rankings, CoinGecko highlighted that the Solana ecosystem’s mindshare had significantly decreased from the 38.79% it had dominated in 2024. According to the study, the ecosystem dropped by 12% this year, reflecting the blockchain’s “struggles to expand beyond its close association with meme coin speculation, as well as Solana’s range-bound price despite wider institutional adoption marked by the US ETFs launch.” This resulted in the Solana ecosystem dropping out of the top leading narratives list this year. In a Friday analysis, CoinGecko reported that memecoin emerged as the most popular crypto narrative in 2025 with a combined 25.02% of global investor interest across the main meme coin category and 35 meme coin trends. This represented a 5.65% decline from the 30.67% market share that the memecoin narrative held in 2024, suggesting that “the mania for purely speculative crypto may be subsiding.” Related Reading: Dogecoin Could Stage A 600% Rally In 2026 If This Multi-Year Support Holds The Solana ecosystem lost its spot in the top five most popular crypto narratives, where it had ranked for the previous two years, after being overtaken by AI agents and the Made in USA narratives. Meanwhile, the Solana memecoin sector also dropped out of the top five narratives after a 3.08% decline in global investor interest from 2024. Nonetheless, “it remains to be seen whether the Solana narrative will be able to ride on new catalysts next year, as momentum from its comeback story runs out,” CoinGecko added. As of this writing, SOL is trading at $126, a 2.61% decline in the daily timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|AI Agent tokens|Base blockchain|bnb chain|crypto narratives|ethereum|Made In USA tokens|memecoins|Sol|Solana|Solana Ecosystem|Solana memecoins|SOLUSDT|SUI Network",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55857282,
    "published": 1765860534000,
    "title": "XRP Price Suffers Sharp 5% Drop—Is More Pain Ahead?",
    "body": "XRP price started a fresh decline below $1.950. The price is now struggling and faces resistance near the $1.920 resistance level. XRP price started a fresh decline below the $1.950 zone. The price is now trading below $1.90 and the 100-hourly Simple Moving Average. There is a bearish trend line forming with resistance at $1.980 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move down if it settles below $1.850. XRP Price Dips Again XRP price attempted a recovery wave above $2.020 but failed to continue higher, like Bitcoin and Ethereum. The price started a fresh decline below $2.00 and $1.950. There was a move below the $1.920 support level. A low was formed at $1.8550, and the price is now showing bearish signs below the 23.6% Fib retracement level of the downward move from the $2.047 swing high to the $1.8550 low. The price is now trading below $1.90 and the 100-hourly Simple Moving Average . There is also a bearish trend line forming with resistance at $1.980 on the hourly chart of the XRP/USD pair. If there is a fresh upward move, the price might face resistance near the $1.90 level. The first major resistance is near the $1.920 level. A close above $1.920 could send the price to $1.950 or the 50% Fib retracement level of the downward move from the $2.047 swing high to the $1.8550 low. The next hurdle sits at $1.980 and the trend line. A clear move above the $1.980 resistance might send the price toward the $2.050 resistance. Any more gains might send the price toward the $2.120 resistance. The next major hurdle for the bulls might be near $2.150. More Losses? If XRP fails to clear the $1.90 resistance zone, it could start a fresh decline. Initial support on the downside is near the $1.8550 level. The next major support is near the $1.820 level. If there is a downside break and a close below the $1.820 level, the price might continue to decline toward $1.7650. The next major support sits near the $1.7320 zone, below which the price could continue lower toward $1.7050. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $1.850 and $1.820. Major Resistance Levels – $1.950 and $1.980.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55857134,
    "published": 1765860438000,
    "title": "MetaMask adds Bitcoin support after teasing it 10 months ago",
    "body": "Users can now buy, swap, send, and receive Bitcoin directly within the popular Ethereum-focused wallet, expanding its multichain reach.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]