[
  {
    "id": 54579888,
    "published": 1763504839000,
    "title": "Crypto Exchange Kraken Raises $800 Million at a $20 Billion Valuation",
    "body": "Kraken just raised $800 million, including $200 million from Ken Griffin’s Citadel Securities, ahead of a potential IPO.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54581060,
    "published": 1763506804000,
    "title": "Cardano on the Edge: Whale Loss Sparks Sell-Off as ADA Risks Drop to $0.43–$0.30 Range",
    "body": "Cardano (ADA) is once again under heavy market pressure after a series of whale-driven shocks and broken support levels sent the asset spiraling toward multi-month lows. Related Reading: Why Is Bitcoin Price Crashing? Arthur Hayes Isn’t Surprised Trading around $0.46–$0.49, ADA has slipped beneath several key zones that protected the price structure throughout 2024 and early 2025. Analysts now warn that the sell-off could deepen toward the $0.43 – $0.30 range if downward momentum continues. ADA's price trends to the downside on the daily chart. Source: ADAUSD on Tradingview ADA Slides as Whale Loss and Support Break Intensify Selling Pressure Much of the latest volatility stems from a dramatic whale incident. A dormant wallet holding 14.45 million ADA, inactive for five years, executed a swap into USDA, a pool so thin that the wallet absorbed devastating slippage. The whale walked away with only $847,000, realizing a staggering $6.2 million loss. The market’s response was immediate, confidence cracked, liquidity thinned, and sellers accelerated their exit. On-chain data shows broader whale activity amplifying the impact. More than 440 million ADA has been offloaded by large holders over the last month, further weakening the structure. ADA’s breakdown below $0.52, a level untouched since 2024, confirmed a bearish market regime dominated by lower highs, lower lows, and widening volatility bands. Technical Outlook Points Toward $0.43… or Even $0.30 Traders monitoring ADA’s trajectory highlight a crucial zone at $0.43, a technical target that aligns with the expanding bearish momentum reflected in indicators such as the MACD, RSI, and Bollinger Bands. The MACD’s deepening bearish crossover signals intensifying sell pressure, while the RSI hovering near oversold territory around 37 suggests weakness without confirming a recovery. Market analysts like Ali Martinez and Mr. Brownstone warn that failure to reclaim broken levels could expose ADA to a broader decline. Martinez identifies $0.30 as a long-term structural support, a cycle reset area that historically attracts accumulation during deep corrections. Analysts note that while capitulation metrics such as MVRV point to undervaluation, they do not eliminate the risk of further downside before any recovery materializes. Midnight’s NIGHT Token Launch Could Shift Sentiment, but Uncertainty Remains Even as ADA struggles, Cardano’s broader ecosystem is gearing up for a major milestone: the launch of Midnight’s NIGHT token on December 8, 2025. Midnight introduces privacy-focused smart contracts with selective disclosure, aiming to balance confidentiality with regulatory compliance. Analysts believe the NIGHT rollout could eventually inject positive momentum if adoption accelerates. Still, traders caution that ADA’s immediate outlook remains tied to technical fragility, liquidity challenges, and overall market sentiment. Related Reading: Dogecoin Cup And Handle Pattern Is Returning, What Happens To Price If It’s Completed? For now, ADA sits on a razor’s edge, stabilizing near support, but vulnerable to a deeper drop toward $0.43 and potentially $0.30 if sellers keep control. Cover image from ChatGPT, ADAUSD chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cardano|ADA|ADA price|adausd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54580991,
    "published": 1763506705000,
    "title": "Kraken Scores $800M Raise Backed by $200M Citadel Investment",
    "body": "The funding, which values Kraken at $20B, accelerates plans to integrate traditional markets with crypto infrastructure across multiple regions.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Kraken|Citadel Securities|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54581218,
    "published": 1763506800000,
    "title": "Bitcoin recovery expected as liquidity conditions change, but US macro remains a threat",
    "body": "Bitcoin’s recent weakness reflects broader economic stress, but improving liquidity and investors’ positive outlook for 2026 could set the stage for a strong rebound.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54584309,
    "published": 1763512093000,
    "title": "Trump Congressional Ally Discloses Latest Six-Figure Bitcoin Purchase",
    "body": "Brandon Gill has purchased up to $2.6 million in Bitcoin this year, according to House transaction reports.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54584144,
    "published": 1763511584000,
    "title": "Bitfury pivots to launch $1B tech fund after 14 years of mining Bitcoin",
    "body": "Bitcoin miner Bitfury started up in 2011, but has now pivoted to tech investing and will pour $1 billion into ethical AI and crypto startups.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54587469,
    "published": 1763517633000,
    "title": "XRP, Bitcoin Now In “Good Buy Zone,” Says Analytics Firm",
    "body": "On-chain analytics firm Santiment has revealed how Bitcoin, XRP, and other cryptocurrencies have dropped into a “buy zone” on a popular metric. MVRV Ratio Shows High Degree Of Short-Term Pain In Bitcoin & Altcoins In a new post on X, Santiment has discussed how the various assets in the cryptocurrency sector are looking based on the 30-day MVRV Ratio. The Market Value to Realized Value (MVRV) Ratio is an on-chain indicator that measures the ratio between the market cap and Realized Cap for a given coin. Related Reading: Bitcoin SSR Flashes Buy Signal: Rebound Incoming? The Realized Cap here refers to a capitalization model that calculates the asset’s total value by assuming the value of each individual token is equal to the price at which it was last transacted on the blockchain. In short, what this model captures is an estimation for the amount of capital that BTC investors as a whole have invested into the cryptocurrency. The usual market cap, on the other hand, represents the amount holders are carrying today. When the value of the MVRV Ratio is greater than 1, it means the market cap is greater than the Realized Cap. In other words, the overall network is in a state of profit. On the other hand, an indicator below this threshold implies the dominance of losses among investors. In the context of the current topic, the version of the MVRV Ratio that’s of interest is the 30-day one, tracking the profit-loss balance of the traders who purchased their coins within the past month. Below is the chart for the metric shared by Santiment that shows the trend in its value for five major cryptocurrencies: Bitcoin, XRP, Ethereum, Chainlink, and Cardano: As is visible in the graph, the 30-day MVRV Ratio has witnessed a plunge recently as the sector has gone through a bearish shift. Recent Bitcoin buyers are now about 11.5% underwater, while XRP ones are around 10.2%. Both of these are beyond the threshold that the analytics firm classifies as the boundary for a “good buy zone.” The 30-day investors have suffered even worse losses in the case of Ethereum, Cardano, and Chainlink, being down 15.4%, 19.7%, and 16.8%, respectively. All of these fall inside Santiment’s “extreme buy zone.” “In a zero sum game, buy assets when average trade returns of your peers are in extreme negatives,” noted the analytics firm. “The lower MVRV’s go, the higher the probability is of a rapid recovery.” Related Reading: Bitcoin Social Dominance Hits 4-Month High: What It Means It now remains to be seen whether market pain has been enough for XRP and others to cause a market rebound, or if more drawdown is coming. XRP Price At the time of writing, XRP is floating around $2.18, down more than 11% over the last week. Featured image from Dall-E, Santiment.net, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|bitcoin|Bitcoin MVRV|btc|xrp|XRP MVRV|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54588301,
    "published": 1763518983000,
    "title": "Canaan stock surges as Q3 revenue doubles on Bitcoin miner demand",
    "body": "Shares in Canaan jumped 20% on Tuesday as the Bitcoin mining hardware maker reported its third-quarter revenues doubled from last year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54588983,
    "published": 1763520094000,
    "title": "Kraken bags $800M for expansion plans at $20B valuation",
    "body": "Crypto exchange Kraken has raised $800 million across two funding rounds, which boosted its valuation to $20 billion.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54591589,
    "published": 1763524823000,
    "title": "Ethereum Price Will Bottom This Week, Predicts Tom Lee",
    "body": "Fundstrat co-founder Tom Lee says Ethereum is nearing a cyclical low, arguing that on-chain fundamentals and relative valuation versus Bitcoin indicate that ETH is “pretty close to bottoming this week.” “Personally, I think that we’re pretty close to bottoming this week,” Lee told CNBC, linking the current drawdown to a broader crypto correction that began after a sharp liquidation event on October 10. Despite that shock, he insisted that Ethereum’s core investment story remains intact. Will Ethereum Bottom This Week? For Lee, that story centers on Ethereum as neutral infrastructure for tokenization and stablecoins, increasingly relevant as Wall Street intensifies its on-chain ambitions. “There are stablecoin creations. Larry Fink and BlackRock and Wall Street want to tokenize assets, bring stocks, bonds, real estate onto the blockchain. And they have to find a neutral 100% uptime blockchain. That’s Ethereum. And that’s the fundamental story,” he said. Related Reading: Ethereum Approaches Historical Accumulation Level – Just 8% Away From LTH Cost Basis Lee framed crypto’s extreme volatility as structurally tied to how the market values long-term innovation rather than as a sign of fundamental weakness. “The price, of course, for Ethereum will fluctuate because crypto is hyper volatile. In fact, it’s kind of a… it’s sort of a feature of the blockchain itself,” he noted. “Crypto suffered from that liquidation event on October 10th, but because the fundamental story is intact and crypto discounts the future, that’s why it’s volatile, but it still looks pretty attractive here.” He placed the current move in the context of a broader risk-off environment and a continuing correction across digital assets. According to Lee, macro data remains a crucial driver of crypto cycles, particularly for Bitcoin. “The most correlated factor to Bitcoin prices when you see it… at a peak actually is the ISM,” he said, referring to US activity surveys. “So I think we’re still in a correction phase of crypto.” Asked specifically what underpins his bullish view on Ethereum now, Lee pointed to two structural “floor” mechanisms. First, he cited the value of assets locked on the Ethereum blockchain. “Ethereum kind of has several ways that it establishes a floor. One is the value of all the assets locked onto the blockchain, and that number is growing,” he said. “Historically, Ethereum bottoms when that ratio is about 50%. So I’d say we’re pretty close to that level. That’s why I think Ethereum is probably bottoming this week.” Related Reading: Ethereum Flashes Rare Oversold Signal As Price Hits Demand Zone — Major Rebound Loading? Second, he highlighted Ethereum’s valuation relative to Bitcoin, using both price and network value. “The other way to look at Ethereum is really its price ratio or even its network value ratio to Bitcoin. It currently sits at 0.032,” Lee said. “The long-term average, like the eight-year average, if we were just to trade to that eight-year average, would put Ethereum at around $12,000.” On that basis, Lee characterized Ethereum as undervalued versus its historical relationship with Bitcoin. “So I think Ethereum is undervalued because number one, the story is gaining relative to Bitcoin this year. But two, we’re getting this sort of intrinsic floor because of the value that the assets locked onto the Ethereum blockchain,” he argued. Summarizing Lee’s stance, the CNBC host concluded: “Tom Lee saying that Ethereum is bottoming this week.” Lee did not offer a specific price target or an exact day, but his message was clear: in his view, Ethereum is close to completing its correction as on-chain value and relative valuation metrics converge toward levels that have historically marked major bottoms. At press time, ETH traded at $3,018. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|BitMine|ETH|ETH news|eth price|Ether|ethereum|ethereum news|ethereum price|Tom Lee",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54593832,
    "published": 1763528427000,
    "title": "Global crypto rules for banks need reworking, says Basel chair",
    "body": "US and UK refuse to implement requirements for a risk weighting of 1,250 per cent for stablecoins",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54594882,
    "published": 1763529866000,
    "title": "Senator Tim Scott pushes for December vote on crypto market bill",
    "body": "Senate Banking Chair Tim Scott says the committee could mark up a crypto market structure bill in December, sending it to President Donald Trump for early 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54595976,
    "published": 1763532053000,
    "title": "Bitcoin Short-Term Holders Panic: 65,200 BTC Sent To Exchanges At Loss",
    "body": "On-chain data shows Bitcoin short-term holders have transferred a large amount of BTC at a loss to exchanges, a sign of another capitulation wave on the network. Bitcoin Short-Term Holders Are Depositing To Exchanges At Loss As explained by CryptoQuant community analyst Maartunn in a new post on X, short-term holders (STHs) have just made another wave of underwater exchange deposits. Related Reading: XRP, Bitcoin Now In “Good Buy Zone,” Says Analytics Firm The STHs refer to the investors who purchased their Bitcoin during the past 155 days. This cohort is generally considered to include the weak hands of the market, who easily sell at the sight of market volatility. Recently, the market has been witnessing a bearish shift, which is exactly the type of event that STHs would be expected to react to. There are several ways to track the moves being made by these investors, with one such being the data of their exchange inflow transactions. Usually, the STHs transfer their coins to centralized exchanges when they are looking to sell, so a spike in exchange deposits from the group can be a sign of a selloff. During downtrends, loss selling is the most common type of distribution from the STHs due to the fact that their cost basis is at recent prices, which tend to be higher in bearish phases. Now, here is the chart shared by Maartunn that shows the trend in the 24-hour loss exchange inflows made by the STHs over the past month: As displayed in the above graph, the Bitcoin STHs made a large amount of loss deposits to exchanges when the cryptocurrency’s price crashed to $94,000 last week. The same appears to have followed during the latest downward move in the asset. In total, STHs have sent 65,200 underwater tokens to the exchanges over the last 24 hours. At the current exchange rate, this amount is worth a whopping $6.08 billion. This new wave of capitulation wave in the STHs came as BTC dropped toward $89,000. Interestingly, what has followed this FUD from the STHs has so far been a rebound for the asset. On-chain analytics firm Glassnode has also shared data related to the STH capitulation in a new X post. Glassnode’s chart is for the amount of loss that the STHs as a whole are realizing through their transactions across the network. The 7-day exponential moving average (EMA) value of this metric is currently sitting at $427 million, which is the highest that it has been since November 2022, when the last bear market bottomed out. Related Reading: Bitcoin SSR Flashes Buy Signal: Rebound Incoming? “Panic selling is elevated & clearly rising, now exceeding the loss levels seen at the last two major lows of this cycle,” noted the analytics firm. BTC Price Bitcoin witnessed a bounce back to $92,800 during the past day. Featured image from Dall-E, Glassnode.com, CryptoQuant.com, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin capitulation|Bitcoin Loss Selling|Bitcoin short-term holders|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54598028,
    "published": 1763535657000,
    "title": "Kraken Achieves $20 Billion Valuation With $200 Million Investment From Citadel",
    "body": "The US-based cryptocurrency exchange Kraken recently secured a substantial $200 million investment from Citadel Securities, a global market maker. This investment values the exchange at an impressive $20 billion. Kraken’s Growth Backed By Citadel Securities Citadel Securities has expressed enthusiasm about supporting Kraken’s growth, emphasizing the firm’s role in shaping the future landscape of digital innovation within markets. Related Reading: Bitcoin Price Alert: This Indicator Signals SELL, Could History Repeat With A 67% Drop? Jim Esposito, president of Citadel Securities, highlighted their commitment to collaborating with Kraken on risk management and market structure analysis, among other strategic initiatives. This capital infusion comes on the heels of a previous financing round back in September of this year, during which the digital asset platform successfully raised $600 million at a $15 billion valuation. Investors in this earlier round included Wall Street entities such as Jane Street, DRW, HSG (formerly known as Sequoia Capital China), Oppenheimer, Tribe Capital, and the family office of Arjun Sethi, who serves as the exchange’s co-CEO. IPO Plans Unhurried Despite Strong Figures Kraken’s fundraising efforts, totaling $800 million across its two recent financing rounds, have significantly strengthened the company’s financial position ahead of its planned initial public offering (IPO) in the upcoming year. Related Reading: Crypto Market Wipes Out $1 Trillion Since October: Analyzing The Forces Behind The Crash However, last week, Bitcoinist reported that Kraken has no plans to speed up its initial public offering, backed by robust financial figures. In a Yahoo Finance interview, Sethi stated, “We have enough capital on our balance sheet as a private company. We don’t race to the door as quickly as possible.” Arjun Sethi previously emphasized the importance of maintaining a prudent approach, ensuring that the company’s financial foundation remains robust and poised for sustainable growth. In the wake of the recent funding, Sethi stated: This investment represents long-term conviction in Kraken’s mission to build trusted, regulated infrastructure for the open financial system. Our focus has always been straightforward: to create a platform where anyone can trade any asset, anytime, anywhere. The exchange also disclosed substantial revenue growth in the third quarter of the year, reaching $648 million. Yet, its closest competitor, Coinbase—the largest exchange in the country—reported revenue growth of $1.9 billion. Kraken’s recent acquisitions, including its $1.5 billion purchase of the futures trading platform NinjaTrader, are further examples of the exchange’s strategic expansion efforts this year. Looking ahead, the exchange revealed in a blog post: We plan to enter new markets across Latin America, Asia Pacific and EMEA, while broadening our offerings beyond crypto to include additional asset classes, advanced trading tools and staking solutions, expanded payment services and enhanced institutional capabilities. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto|crypto market|crypto news|cryptocurrency|kraken|Kraken co-CEO|Kraken crypto exchange|Kraken IPO|Kraken IPO plans|Kraken news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54598026,
    "published": 1763535654000,
    "title": "Solana Reclaims $140 As Second Wave Of SOL ETFs Debut – Is A Rebound Coming?",
    "body": "Amid the second wave of crypto-based Exchange-Traded Funds (ETFs), Solana (SOL)-based investment products have been leading the charge, fueled by strong demand despite the recent market volatility. As a new group of investment products based on the altcoin hits the market and SOL’s price starts to recover, some suggest that a rebound could be underway. Related Reading: Analyst Shares Worst-Case Scenario For Bitcoin (BTC) As Price Shows Concerning Signs Solana ETFs Take Over The second wave of Solana ETFs has arrived in the market after the successful launch of SOL-based investment products. On Monday, VanEck debuted its Solana ETF (VSOL) on Nasdaq, becoming the third investment product based on the altcoin to launch over the past month. According to the announcement, the firm is waiving its 0.30% fee on the first $1 billion in assets under management (AUM) or until February 17, 2026. Meanwhile, its third-party staking provider will also waive its fee for staking services under the same conditions. Adding to the momentum, Fidelity and Canary Capital launched their FSOL and SOLC ETFs on Tuesday, after recently filing 8-A forms with the Securities and Exchange Commission (SEC). Senior Bloomberg analyst Eric Balchunas noted that Fidelity is “easily the biggest asset manager in this category with BlackRock sitting out,” adding that it is “Game on” with the other launches. Meanwhile, Nate Geraci also highlighted the new launch, but expressed surprise that BlackRock is “sitting this one out” as many anticipate a successful performance. Notably, Bitwise and Grayscale debuted their BSOL and GSOL ETFs at the end of October, registering a record-breaking performance since their launch. Farside Invest data shows that SOL-based investment products have recorded over $390 million in inflows, with 15 consecutive trading days of positive net flows, signaling strong institutional demand for the products. In a Tuesday X post, Bitwise’s CEO, Hunter Horsley, noted BSOL’s positive performance despite the market correction, affirming that “prices are in the eye of the beholder.” “ETF investors continue to buy the dip. Grateful for the trust in Bitwise to steward investor assets,” he added. Institutional Demand To Fuel SOL’s Rebound? Amid the Tuesday launches, SOL’s price bounced 8.4% from its five-month low of $128, recorded on Monday. The cryptocurrency has declined 12% over the past month, losing crucial levels during the market correction. However, Bybit recently suggested that the newly launched investment products could reshape “its price trajectory and market structure for years to come.” In a recent report, the crypto exchange’s analysts noted that the altcoin joined Bitcoin (BTC) and Ethereum (ETH) as one of the few digital assets with regulated brokerage access in the US. This “represents a structural shift in how SOL is accessed, traded and perceived,” significantly expanding SOL’s investor base and confidence. “If historical patterns hold, Solana could be on the cusp of a multi-quarter rally that redefines its position in the crypto hierarchy,” the exchange affirmed. Analyst Ted Pillows pointed out SOL’s price action, calling it “one of the worst-performing large caps recently.” However, he argued that, because of this, most of its downside liquidity has already been taken out, with “decent liquidity clusters around the $170-$200 level.” Related Reading: Crypto Market Wipes Out $1 Trillion Since October: Analyzing The Forces Behind The Crash To analysts, if the market starts to recover and stabilizes, Solana could rally 20%-40% to retest this area. Meanwhile, Daan Crypto Trades affirmed that SOL is “putting in quite the reversal relative to its BTC pair,” as the cryptocurrency has broken out of a three-week downtrend against Bitcoin after some failed attempts. As of this writing, Solana is trading at $141, a 25.3% decline in the monthly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitwise|BSOL|Canary Capital SOLC|crpyot market correction|crypto analyst|Fidelity FSOL|grayscale|Sol|SOL/BTC|Solana|Solana ETFs|Solana Price|SOLUSDT|VanEck VSOL",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54600955,
    "published": 1763541008000,
    "title": "Bitcoin Is 80% Into The Bear Market, Analyst Reveals What Will Confirm It 100%",
    "body": "With the Bitcoin price struggling recently, the expectations are that the crypto market is headed into another bear run. This is characterized by Bitcoin losing $100,000 after over four months, and has not been able to reclaim this major level. Meanwhile, sell-offs among whales have continued, putting billions of dollars worth of selling pressure on the cryptocurrency. As such, the probability that Bitcoin is going into a bear market has shot up considerably during this time. Analyst Warns Of Imminent Bitcoin Bear Market Crypto analyst Titan of Crypto has taken to the X (formerly Twitter) platform to share a warning with the broader crypto community. This warning was that the digital asset was more likely in a bear market compared to a bull market, giving an 80% score in favor of a bear market and only 20% in favor of a bull market. Related Reading: The ‘Insanely Bullish’ Dogecoin Setup That Will Trigger A 600% Rally To $1 This comes as there seems to be an erosion of the 4-year cycle that has characterized Bitcoin and the crypto market since its inception. The cycle expectations have deviated completely, especially as there has been no significant run for altcoins. Speaking on this cycle theory, the crypto analyst urges investors to look at the market with more nuance. This includes not following the market with blind optimism, but rather actually looking at the market for what it is and where it could be headed. The post shows the Bitcoin RSI and how it has looked before Bitcoin went into previous bear markets. Currently, there seems to be some similarity, but the crypto analyst believes that the direction will be determined next week. Titan of Crypto says that if the next week closes by November 24 looks the same, then it means that the bear market is here. Bear Market Indicators Triggered? In contrast to Titan’s stance, the Bull Market Peak Indicators tracked by the Coinglass website continue to show that the Bitcoin top is not in. This tracker consists of 30 indicators in total, showing if the Bitcoin top has been cracked in relation to historical performance, and none of them have been triggered. Related Reading: Ripple Exec Addresses Tax Issue On XRP Ledger, Where Does It Go? At the time of writing, the process bar sits just above 46% out of 100%, suggesting that it is not even halfway there to hitting the top. Thus, the indicators point toward a time to hold rather than sell, as the Bitcoin top has not been reached. The Crypto Fear & Greed Index has also fallen to an Extreme Fear score of 10, which is the lowest the index has been since March 2025. Interestingly, when the index is in the red is usually when the market sees a possible reversal. However, it remains to be seen how buyers will respond to the market from here. Featured image from Dall.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54601647,
    "published": 1763542254000,
    "title": "Next Crypto To Explode? Solana’s $130 Bottom Puts New Alts In Play",
    "body": "What to Know: Solana’s strong defense of $130, plus a V-shaped recovery pattern, keeps a move back toward the $180–$250 range firmly on the table. Spot SOL ETFs have now attracted around $420M in cumulative inflows, signalling sustained institutional interest even after the recent correction. SUBBD Token, PEPENODE, and Aster tap AI creators, GameFi mining, and perp DEX liquidity respectively, aligning with narratives favored in risk-on phases. Solana just printed the kind of setup traders love. After a sharp 25% drawdown from $173, $SOL bounced perfectly from weekly support around $130 and is now forming a V-shaped recovery pattern, with technicians eyeing a move back into the $180–$250 range if momentum holds. On the derivatives side, futures open interest has climbed back above $7B while funding has flipped positive, showing that both spot and leveraged buyers are stepping back in. At the same time, Solana’s spot ETFs have quietly stacked 15 straight days of inflows , with US products now sitting on $420M in cumulative net inflows and more issuers lining up launches. That is textbook ‘institutional dip-buying.’ Onchain, daily active addresses on Solana are up 18% in the last 30 days , reinforcing the idea that this isn’t just a speculative dead-cat bounce but a network with real usage. If the $130 level continues to act as a base, a proper rotation back into high-beta altcoins becomes much easier to justify. In that kind of environment, the hunt for the next crypto to explode usually shifts toward narratives that rhyme with what institutions are already buying: scalable infra, real revenue, and high-conviction niches like AI, creator platforms, and DeFi perps. That’s where SUBBD Token , PEPENODE , and Aster slot into the conversation as traders look beyond SOL itself. 1. SUBBD Token ($SUBBD) – AI Creator Rails For ETF-Age Liquidity If Solana’s ETF flows prove anything, it’s that institutions will pay for clean, narrative-driven exposure. SUBBD Token ($SUBBD) leans directly into that with an AI-powered subscription platform for creators, backed by over 2K top earners and 250M+ followers already plugged into its ecosystem. The token sits in presale at $0.056975, with more than $1.3M raised so far and staking yields set at 20% APY.The idea is simple but powerful: unify creator payments, AI content tools, exclusive access, and XP-style loyalty mechanics under one token. In a world where ad revenue is choppy, and platform fees can chew through 70% of creator income, an AI agent that automates management while keeping more upside on-chain is an easy sell. Price-wise, our SUBBD Token price prediction forecasts put potential 2026 highs for $SUBBD around $0.66 if the roadmap and onboarding of big-ticket influencers land as planned. From today’s presale level, that implies over 10x on a 2026 scenario, assuming broader market conditions don’t rug the sector. Those numbers obviously aren’t guaranteed, but they show how quickly an AI-plus-creator narrative can re-rate if ETF-era liquidity starts hunting for higher beta. For traders looking to position ahead of a potential SOL-led alt season rather than chasing it, SUBBD Token is one to watch. Front-run the tokenized content revolution. Check out the SUBBD presale now. 2. PEPENODE ($PEPENODE) – Mine-To-Earn Meme Energy With Fat Staking While Solana is attracting the suits, PEPENODE ($PEPENODE) is busy courting degen gamers.It wraps the ever-present Pepe meme around a ‘mine-to-earn’ browser game where players build virtual mining rigs, upgrade nodes and facilities, and earn not just $PEPENODE but also other meme coins like $PEPE as rewards. The presale has already crossed $2.1M raised, with the current token price around $0.0011546 and staking APYs at a chunky 595%. That combo of high yield plus GameFi upside is exactly the sort of risk-on profile that tends to catch a bid once majors like $SOL firmly reclaim trend. Our PEPENODE price prediction for 2026 forecasts highs around $0.0077 by the end of the year if the mine-to-earn economy, token burns from in-game spending, and CEX/DEX listings all come together. From today’s presale price, that translates to 567% gains. Again, that’s a modeled path, not a promise, but it shows how quickly things can move if the game actually hits and meme liquidity rotates back. For anyone betting that Solana’s bottom will drag meme beta back from the dead, PEPENODE is a high-octane candidate. Explore the PEPENODE presale today. 3. Aster ($ASTER) – Perp DEX Liquidity Play As $SOL Volatility Returns If $SOL really is grinding back toward the $180–$250 band, perp DEXs are obvious beneficiaries. Volatility plus leverage is their bread and butter. Aster ($ASTER) fits that bill as a next-gen, multi-chain perp and spot DEX, offering high leverage, hidden orders, and cross-chain trading without the usual bridging headaches.The token, $ASTER, currently trades around $1.31 with a market cap above $3.1B and deep daily volume of $1.2B, placing it firmly in large-cap DeFi territory rather than niche micro-cap land. It’s already listed on major centralized venues, with Binance handling a large chunk of liquidity via the ASTER/USDT pair, which makes it far easier for bigger players to size into positions compared with most perp-DEX tokens. On the infrastructure side, Aster has processed hundreds of billions in cumulative volume, with TVL and open interest both sizable enough to matter if leveraged trading really picks up again into a Solana-led recovery. For traders wanting a liquid, exchange-listed way to express a view on higher perp activity if $SOL volatility persists, Aster is a strong candidate. Consider adding Aster via Binance. Recap : Solana’s bounce from $130, backed by rising ETF inflows, growing open interest, and healthier onchain activity, has reopened the door to an altcoin rebound. In that context, SUBBD Token targets AI creator rails, PEPENODE leans into mine-to-earn meme gaming, and Aster offers leveraged DeFi exposure, giving different ways to position for a potential next crypto to explode rotation if $SOL’s recovery holds. This article is informational only; always do independent research and never invest money you can’t afford to lose. Authored by Aaron Walker, NewsBTC, www.newsbtc.com/news/next-crypto-to-explode-as-solana-finds-130-bottom/",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54602441,
    "published": 1763543658000,
    "title": "BlackRock's Bitcoin ETF, IBIT, Posts Record One-Day Outflow of $523.2 Million",
    "body": "The average spot bitcoin ETF buyer sits near a $90,000 cost basis, leaving most investors roughly flat.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|BlackRock|Bitcoin ETF|ETFs|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54604041,
    "published": 1763546432000,
    "title": "Crypto Traders See Bullish Tailwind: Hassett Jumps In Fed Chair Odds",
    "body": "Donald Trump has pushed the Federal Reserve back into the center of the crypto macro narrative, telling reporters he “already” knows who should succeed Jerome Powell and triggering a sharp repricing in real-money prediction markets in favor of Kevin Hassett. In remarks in the Oval Office, Trump said: “I think I already know my choice,” when asked about the next Fed chair. He added that he would “love to get the guy currently in there out right now, but people are holding me back,” a clear swipe at Powell without naming him. Trump also hinted at the shape of his shortlist, saying, “We have some surprising names and we have some standard names that everybody’s talking about. And we may go the standard way. It’s nice to every once in a while go politically correct.” That was enough to move markets. On Polymarket and Kalshi, contracts on “Who will Trump nominate as Fed Chair?” quickly converged around Hassett, with odds in the mid-40s to high-40s percent range. Jim Bianco summarized the shift by writing: “He wants Bessent but will take Hassett. The rest get to take selfies in the Oval Office.” In a follow-up, he noted that “Hassett (blue) is separating himself from the pack and is on the verge of being the first person to trade over 50%,” as prediction markets pushed his contract well clear of rivals. Kalshi’s own social media account underscored the move: “BREAKING: Trump thinks he ‘already knows’ who will be next Fed Chair. 47% chance it’s Kevin Hassett.” The pseudonymous trader Byzantine General zoomed out to the timeline, pointing out that “Powell’s term ends May next year,” and sketching out a Q2 scenario with “a FED chair that listens to Trump” and “tariff dividends for plebs,” before cautioning that “you never know with Trump of course, but man, there could be something cooking.” Related Reading: Crypto Market Wipes Out $1 Trillion Since October: Analyzing The Forces Behind The Crash What Hassett Could Mean For The Crypto Market For macro-oriented crypto traders, the key is the policy signal embedded in those probabilities. Hassett is widely perceived as more dovish than Powell and more aligned with Trump’s preference for easier financial conditions. That is why trader CRG (@MacroCRG), framed the moment as the arrival of a “New hand picked super dove as Fed chair coming soon.” Macro and crypto analyst Alex Krüger went further, arguing that the Fed-chair race is the real medium-term driver for risk assets once the current FOMC noise fades. “Here’s the next macro catalyst after the FOMC. A bullish catalyst the market is paying no heed to atm. It’s hard to peer into the horizon when stressed to the marrow about the present,” he wrote, adding that “the most bullish choices would be Hassett (likely), Rieder (possibly) and Zervos (unlikely).” Related Reading: Crypto Carnage Continues — Tom Lee Exposes What’s Really Going On The reason crypto traders care is straightforward: crypto assets trade as high-beta, liquidity-sensitive risk assets. A chair seen as more willing to cut rates faster, tolerate easier financial conditions or respond aggressively to equity and growth weakness is, in market logic, a structural tailwind for the long-run liquidity environment that underpins speculative flows into bitcoin and other cryptocurrencies. At the same time, Trump’s open pressure on Powell and his readiness to talk about replacing the Fed chair in overtly political terms reinforce another strand of the crypto thesis. The more investors worry about the politicization of US monetary policy and the erosion of central-bank independence, the more compelling the “Bitcoin as hedge against political and institutional risk” narrative becomes for a subset of allocators. For now, nothing has changed at the Fed. Powell remains in office, and all that has moved is a set of probability distributions on prediction markets. But as those distributions shift toward Kevin Hassett, crypto traders are already treating the prospective hand-off as a latent, potentially significant bullish tailwind building in the background. At press time, the total crypto market cap was at $3.11 trillion. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|Bitcoin news|crypto|Crypto market news|crypto news|fed|Kevin Hassett|Next Fed Chair",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54603995,
    "published": 1763546070000,
    "title": "Senators warn Trump-linked crypto firm may pose national security threat",
    "body": "Democratic senators are urging a probe into WLFI over alleged token sales to North Korea- and Russia-linked wallets, while researchers say some claims stem from false positives.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 205,
        "NAME": "TOKEN SALE",
        "CATEGORY": "TOKEN SALE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54604471,
    "published": 1763546811000,
    "title": "Ondo wins Liechtenstein approval to offer tokenized stocks in Europe",
    "body": "US tokenization platform Ondo is preparing to offer tokenized stocks and ETFs in 30 European countries after receiving approval in Liechtenstein.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54604742,
    "published": 1763547374000,
    "title": "US and UK revolt forces Basel to rethink brutal crypto capital rules for banks",
    "body": "Basel’s toughest crypto rules are under review as the US, UK, and the EU diverge, with booming stablecoin adoption forcing a rethink of 1,250% capital charges, the group’s chair told the FT.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54605619,
    "published": 1763548763000,
    "title": "BlackRock leads near $3B Bitcoin November ETF exodus with record $523M outflows",
    "body": "US Bitcoin ETFs are nearing $3 billion in November outflows as a fresh death cross, fading Fed rate cut odds, and smart money shorts weigh on sentiment.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54606465,
    "published": 1763550416000,
    "title": "New Hampshire’s Bitcoin Bond Bet Puts $140T In Play – Bitcoin Hyper Steps Up",
    "body": "What to Know: New Hampshire’s $100M Bitcoin-backed municipal bond gives $BTC a compliant route into a roughly $140T global debt market. The state’s strategic Bitcoin reserve law, allowing up to 5% of funds in Bitcoin, shows treasuries are treating crypto as long-term collateral. Bitcoin Hyper aims to provide a fast, SVM-powered Bitcoin Layer 2 so that this new collateral can move efficiently across DeFi and institutional rails. With $28M raised, audited contracts, and staking at 41%, $HYPER targets utility in Bitcoin’s evolving bond and reserve landscape. New Hampshire just did what crypto Twitter has been memeing about for years: it put Bitcoin in a suit and marched it into the bond market. The state’s Business Finance Authority has approved a first of its kind $100M municipal conduit bond backed by over-collateralized Bitcoin. The borrower posts around 160% of the bond value in $BTC as collateral, with liquidation only if coverage drops below roughly 130%. This mechanism effectively opens a path for digital assets into a global debt market worth about $140T. If more states, cities, and agencies copy the playbook, Bitcoin stops being just a macro hedge and starts behaving like high-grade collateral in traditional fixed income. New Hampshire is not acting in a vacuum either. Earlier this year, it became the first state to pass a strategic Bitcoin reserve law , letting the treasurer allocate up to 5% of public funds into Bitcoin and other mega-cap digital assets, held in tightly regulated custody. Taken together, a sovereign-style reserve plus a Bitcoin-backed bond framework is a clear signal: state-level actors are preparing to use Bitcoin as both reserve asset and working collateral. Once Bitcoin is locked into bonds, reserves, and tokenized debt rails, slow base layer transactions and high fees become a real problem. You cannot plug institutional-grade collateral into a creaky payment pipe. That is exactly where the Bitcoin Hyper ($HYPER) presale slides into the conversation. Bitcoin Hyper Builds Rails For Bitcoin’s New Collateral Era If Bitcoin is going to sit behind municipal bonds and state reserves, the market will need fast, programmable infrastructure that still respects Bitcoin’s security guarantees. Bitcoin Hyper ($HYPER) is aiming to be that middle layer. The project is building a Bitcoin Layer 2 that uses a canonical bridge and Solana Virtual Machine tech to move wrapped Bitcoin on a high-throughput chain. Users deposit $BTC to a monitored L1 address, an SVM smart contract verifies the transaction, and the equivalent amount is minted on the Hyper network. Transactions are then cleared on the L2 with near instant finality and are periodically settled back to Bitcoin. On top of that settlement layer, Bitcoin Hyper plans to support dApps, DeFi, NFTs, and gaming via SVM, so the same infrastructure that moves Bitcoin collateral can also host more complex products. $HYPER: The Potential ROI of $BTC’s New Infrastructure The alignment between what New Hampshire has just kicked off and what Bitcoin Hyper is building is hard to ignore. A Bitcoin that backs bonds and sits in strategic reserves needs more than cold storage vaults; it needs a performant, audited, programmable environment so value can actually move. Bitcoin Hyper is trying to occupy that lane while $HYPER is still under a cent and a half. The presale just surpassed $28M with $HYPER priced at $0.013295, which already makes this one of the best crypto presales of 2025. Considering the project’s long-term utility, investor support, and current presale numbers, our price prediction for $HYPER puts the token at $0.08625 by the end of 2026. A solid bull market could push it to $0.253 by 2030, likely higher once the implementation process kicks off. In terms of profit, think ROIs of 548% by 2026 and 1,802% or higher by 2030. If the thesis is that Bitcoin becomes pristine collateral for a chunk of that $140T debt pile, then high-speed, secure rails that keep that collateral moving are the picks and shovels. Bitcoin Hyper is positioning itself as one of those rails, so read our guide on how to buy $HYPER before the presale ends; Q4 2025-Q1 2026 is the projected window for the official launch. Go to the presale page and buy your $HYPER today. This isn’t financial advice. DYOR before investing. Authored by Aaron Walker, NewsBTC: https://www.newsbtc.com/news/new-hampshire-bitcoin-backed-bond-helps-bitcoin-hyper",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54607106,
    "published": 1763551458000,
    "title": "How Dubai Became The Epicentre Of RWA Tokenization",
    "body": "Discover how Dubai became the epicentre of RWA tokenization, as Fasset and regulators like VARA unlock inclusive, cross-border access to global real-world assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54608210,
    "published": 1763553359000,
    "title": "New Hampshire approves first-of-its-kind $100M Bitcoin-backed municipal bond",
    "body": "New Hampshire has approved a $100 million Bitcoin-backed municipal conduit bond, letting borrowers raise capital against overcollateralized BTC.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54609650,
    "published": 1763556177000,
    "title": "Kenya’s new crypto law faces stress test as Bitcoin ATMs appear in malls",
    "body": "Kenyan regulators say no crypto firms are licensed under the new VASP Act and warn that providers claiming approval are doing so illegally.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54609367,
    "published": 1763555393000,
    "title": "Apex Group Said to Buy Broker Dealer Globacap for U.S. Tokenization Push",
    "body": "London-based Globacap’s U.S. broker-dealer and alternative trading system (ATS) is regulated by FINRA and the SEC.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Tokeny|mergers and acquisitions|Financial Services|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54609312,
    "published": 1763553992000,
    "title": "Abu Dhabi Fund Tripled Bitcoin Bet in Months Before Crypto Crash",
    "body": "The Abu Dhabi Investment Council more than tripled the size of its position in a Bitcoin exchange-traded fund during the third quarter, shortly before the bull market in cryptocurrencies gave way to a brutal selloff.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54610072,
    "published": 1763557212000,
    "title": "Famous Trader Bets $27 Million That The XRP Price Will Crash",
    "body": "A famous trader is betting on a significant XRP price crash amid this recent market downtrend. The altcoin continues to struggle despite the recent launch of Canary’s XRP ETF, with popular analyst Ali Martinez suggesting it could soon drop below the psychological $2 level. Famous Trader Opens $27 Million Short Position On XRP In an X post, the on-chain analytics platform Lookonchain revealed that a famous trader is shorting the market again, opening a 20x short on XRP worth $27.4 million. The trader has also opened short positions of 40x and 10x on Bitcoin and ZEC, respectively, worth $148.5 million and $20.4 million. Related Reading: Abundance of Catalysts Suggests XRP Price Could Take Off This Week This comes as the XRP price continues to struggle, putting it at risk of a further decline, especially with concerns that Bitcoin may already be in a bear market. Crypto analyst Ali Martinez also predicted that XRP could drop to as low as $1.73 if it loses the $2.15 support level. Meanwhile, XRP continues to face significant selling pressure despite increased institutional adoption through the launch of Canary’s XRP fund, with more XRP ETFs also set to launch. Santiment data shows that whales holding between 1 million and 10 million coins recently sold almost 200 million coins in the space of 48 hours. This may just be the start of a larger sell-off following Glassnode’s recent revelation. The on-chain analytics platform revealed that the share of XRP supply in profit has fallen to 58.5%, which is the lowest since November 2024, when the price was trading at around $0.53. Glassnode further noted that despite XRP trading 4x higher now, 41.5% of its supply (around 26.5 billion) sits in loss, which it claimed is a “sign of a top-heavy and structurally fragile market”. Macro Structure Points To A Decline To $2.03 Crypto analyst CasiTrades stated that XRP is still likely making its way down to the macro .5 fib support at $2.03. She claimed that the move is playing out perfectly as Wave 2s are corrective and that the choppiness is exactly how the market should behave. The analyst further revealed that the only invalidation of the drop to the $2.03 support is a decisive break above the macro .382 level at $2.41. Related Reading: Analyst Says XRP Has 2 Options Right Now, Reveals Why Investors Win Either Way CasiTrades explained that this $2.41 level remains the line in the sand and that, as long as XRP stays below it, the structure points to a final sweep of $2.03. She also raised the possibility of a drop to the “still-valid” macro target at $1.65, which is the .618 fib level. The analyst noted that Wave 2 corrections commonly reach the .618 and that the longer XRP ranges without breaking resistance, the more probable a drop to that level becomes. CasiTrades stated that a move to $1.65 would not be bearish, as it would build the kind of momentum needed for a powerful macro Wave 3 to new all-time highs (ATHs). She has predicted that XRP could rally to a new ATH of as high as $10. At the time of writing, the XRP price is trading at around $2.15, down in the last 24 hours, according to data from CoinMarketCap. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ali Martinez|Canary’s XRP ETF|CasiTrades|CoinMarketCap|glassnode|Lookonchain|Ripple|Santiment|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54610015,
    "published": 1763557028000,
    "title": "Incumbents Win Big: What’s Inside Brazil’s New VASP Regulations",
    "body": "Brazil's Central Bank released long awaited regulations for digital asset businesses, formalizing the sector and integrating stablecoins into its foreign exchange regime",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|Investing|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54610768,
    "published": 1763558647000,
    "title": "Ethereum Cofounder Issues Stark Crypto Warning That Could Spell Disaster For Bitcoin Amid Sudden Price Sell-Off",
    "body": "Ethereum cofounder Vitalik Buterin has warned elliptic curve cryptography could break before the next U.S. presidential election in 2028...",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54611753,
    "published": 1763560865000,
    "title": "This New Bitcoin, Crypto Wallet Scans Your Blood Vessels—And Needs Zero Passwords",
    "body": "The G-Knot relies on finger vein-scanning technology. Its creators say it's safer, and easier to use, than established hardware wallets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54611674,
    "published": 1763560585000,
    "title": "HSBC to bring tokenized deposits to US and UAE as stablecoin race heats up",
    "body": "HSBC is the latest megabank to double down on tokenized deposits versus stablecoins by preparing for new launches in the US and the UAE next year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54612565,
    "published": 1763562646000,
    "title": "Red Alert: 40% Of Strategy’s Bitcoin Holdings Are Losing Money—Analysts",
    "body": "Bitcoin fell sharply over the past week, sliding almost 15% and moving beneath the $100,000 and $95,000 marks to trade around $90,300, Wednesday. Related Reading: Crypto Carnage Continues — Tom Lee Exposes What’s Really Going On According to company disclosures, Michael Saylor’s Strategy bought an extra 8,178 BTC for $835.6 million at about $102,171 apiece during the downturn. That move has drawn fresh attention because some of those newest coins are already underwater. Strategy’s Holdings And Recent Buys Reports have disclosed that Strategy now holds 649,870 BTC, equal to roughly 3.2% of the circulating supply. The firm says it paid about $48 billion for those coins. At current prices, the holding’s market value sits near $59.38 billion, leaving an overall paper gain of 22% or about $11 billion. Strategy has acquired 8,178 BTC for ~$835.6 million at ~$102,171 per bitcoin and has achieved BTC Yield of 27.8% YTD 2025. As of 11/16/2025, we hodl 649,870 $BTC acquired for ~$48.37 billion at ~$74,433 per bitcoin. $MSTR $STRC $STRD $STRE $STRF $STRK https://t.co/HI1TeYOvQ9 — Michael Saylor (@saylor) November 17, 2025 Yet CryptoQuant’s breakdown finds that roughly 40% of Strategy’s stash is now showing unrealized losses, a result of the company’s recent buying activity pushing newer lots above today’s market price. The newest 8,178 BTC purchase is already down around 10.5%, costing the company roughly $88 million on paper in a matter of days. Reports also show Strategy made three separate buys earlier this month: smaller blocks recorded on the third and the 10th of November, bringing November’s total to 9,062 BTC for $931.1 million. At current market levels those November tokens are worth about $827 million, a drop of just over 11% since the buys. Saylor’s Portfolio Turns Red? He announced the purchase of 8,178 BTC at an average price of $102,171, about 10% above current market levels. This recent bitcoin move puts ~40% of Strategy’s 649,870 BTC holdings in the red, with only 60% still in profit. pic.twitter.com/hii0BmV95P — CryptoQuant.com (@cryptoquant_com) November 18, 2025 Short-Term Losses Amid Long-Term Gains While parts of the position sit in the red, Strategy’s longer-term position remains positive. The company’s overall profit ratio of 22% is well above the deep losses it faced from mid-2022 into early 2023, when as much as 75% of its holdings were showing losses and the portfolio was down about 33%, equal to roughly $1.32 billion in paper losses then. Early last month Strategy had a peak profit ratio near 68% with gains calculated at about $32 billion, showing how swings can be large on both sides. According to filings, Saylor treats dips as chances to add coins, and this latest buying fits that pattern. Not every market participant agrees. A Fraud? Peter Schiff, a well-known gold investor, criticized Strategy’s rising average cost, which he says—at about $74,433 per BTC—has been moving closer to the market value and could limit upside if prices fail to rebound. Schiff said on Sunday that Strategy Inc.’s focus only on Bitcoin is “a fraud.” He also challenged Michael Saylor to a live debate at Binance Blockchain Week in Dubai this December. Schiff argued that the company’s recent gains mainly come from the rising Bitcoin price. He warned that if people lose confidence in Bitcoin, the company’s finances could be in trouble. Related Reading: Bitcoin’s Drop Under $90K Sparks Bold Claims From Crypto Execs: ‘This Is A Generational Opportunity’ What This Means For Investors For outside observers, the takeaway is straightforward: even the biggest holders can have portions of their inventory in loss when markets fall. Strategy’s newer purchases have reduced the firm’s tidy headline returns, but they did not wipe out the overall gain. Reports suggest the company is still sitting on a sizable paper profit. Short-term results for those November buys look poor. Long-term results will depend on future price moves. Featured image from Gemini, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|Michael Saylor|Stategy",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54612456,
    "published": 1763562428000,
    "title": "Traders Rush To Best Wallet Token As Circle Supercharges $USDC Across Chains",
    "body": "What to Know: Circle’s xReserve lets blockchains issue $USDC-backed stablecoins that interoperate natively with $USDC, cutting reliance on external cross-chain bridges. $USDC’s market cap has surged to around $74B in 2025, reinforcing dollar-backed stablecoins as core settlement assets for on-chain finance. Best Wallet Token ($BEST) reached $17.1M in presale with a token price of $0.025965, as the token rewards investors with governance rights, reduced transaction fees, and access to trusted presales. Best Wallet pairs a non-custodial, multi-chain, mobile-first wallet with presale access, an in-app DEX aggregator, and upcoming debit card and analytics tools. Circle just flipped the switch on xReserve, a new interoperability layer that lets blockchains mint their own $USDC-backed stablecoins and plug directly into $USDC’s liquidity. Instead of juggling wrapped assets and sketchy third-party bridges, chains can now treat $USDC as native collateral and move value using Circle’s own attestation and messaging stack. This lands at a time when $USDC is already on a tear. Recent figures show its market cap has climbed to around $74B in 2025, up more than 70% since January , as institutions rotate toward transparent, regulated stablecoins. The catch is that users don’t interact with ‘interoperability infrastructure’. They interact with wallets. Every extra chain supported by $USDC, every $USDC-backed local stablecoin, and every new bridge-free flow of dollars is only as useful as the wallet that can surface it cleanly. That’s why wallet-native tokens are suddenly back in focus. Best Wallet Token ($BEST) sits right in that slipstream. The $17.1M presale powers Best Wallet as a non-custodial, multi-chain wallet built around Fireblocks MPC security, mobile-first UX, and deep presale and DeFi integrations. With Circle making USDC the de facto reserve asset across more blockchains, traders are hunting for wallets that can actually help them navigate that growing web, and Best Wallet hits the sweet spot. Buy your $BEST today while the presale is still up. Best Wallet Turns Multi-Chain Chaos Into A Single App Best Wallet is non-custodial, no-KYC, and designed mobile-first, so you can manage thousands of assets across more than 6 major chains in one interface. Under the hood, Best Wallet uses Fireblocks MPC-CMP to secure keys while still supporting custom multi-wallet portfolios and a smoother presale flow via its ‘Upcoming Tokens’ portal. That’s a direct answer to one of the biggest frictions in the market: onboarding new users into top crypto presales and DeFi without dumping them into a maze of browser extensions, bridges, and smart contract approvals. Utility doesn’t stop at basic storage either. Best DEX, the in-wallet DEX aggregator, pulls liquidity from 330 DEXs across multiple chains, including Ethereum, Solana, and BNB Chain, and up to 30 cross-chain bridges. This gives you the best-rate swaps and cross-chain moves without manually hopping between platforms. Put differently: Circle is solving cross-chain dollars at the protocol layer, while $BEST is trying to solve cross-chain experience at the wallet layer. If xReserve succeeds in turning $USDC into universal collateral, the wallets that surface that liquidity cleanly stand to benefit most. If you like being early to that narrative, digging into Best Wallet Token makes sense. Secure your $BEST today, before the presale ends. $BEST Presale Ends in 9 Days, Raises $17M The market is already voting. The Best Wallet Token ($BEST) presale has raised over $17.19M so far, with the token currently priced at $0.025965. That’s a roughly 15% move up from the initial presale price near $0.0225, but still firmly in ‘under a nickel’ territory for anyone averaging in. Holders can lock $BEST immediately from the presale widget, with headline yields around 76% APY at the time of writing, funded from a dedicated 8% slice of the 10B token supply reserved for staking rewards. Based on the presale’s performance and Best Wallet’s utility, our price prediction for $BEST puts it at $0.05106175 in 2026. By 2030, the token could reach $0.07 or higher, once the ecosystem takes shape. From today’s presale level, that would equate to roughly 96.6% and 169.5% upside, respectively, on paper. Circle’s xReserve, $USDC’s climb to ~$74B circulation, and the tightening regulatory net around opaque stablecoins all point in the same direction: more volume through compliant dollars, routed by smart wallets. If Best Wallet can stay ahead on UX and chain coverage while $BEST keeps powering fee discounts, staking, governance, and early presale access, the token has a clear role in that flow. You can read our guide on how to buy $BEST today if you want to join the presale before it ends. Go to the official presale page and buy your $BEST now. This isn’t financial advice. DYOR and manage risks wisely before investing. Authored by Aaron Walker, NewsBTC: https://www.newsbtc.com/news/circle-usdc-xreserve-expands-access-best-wallet-token-presale",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54613129,
    "published": 1763563788000,
    "title": "Crypto ETFs Enter Maturity Phase as IRS and SEC Actions Drive Rapid Expansion of Products",
    "body": "Staking guidance, broader listing standards and new index tools show how crypto ETFs are becoming core holdings.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|ETFs|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54614013,
    "published": 1763565578000,
    "title": "Morning Minute: The White House and IRS Target Foreign Crypto Holdings",
    "body": "Taxes are going to be more of a headache for those using offshore exchanges if this proposal passes. But does the move make sense?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Opinion",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 54614501,
    "published": 1763566546000,
    "title": "Crypto Exchange Kraken Files for IPO Following $800 Million Raise",
    "body": "Freshly valued at $20 billion, American cryptocurrency exchange Kraken said Wednesday that it has filed to go public.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54614425,
    "published": 1763566450000,
    "title": "Winklevoss-Backed Cypherpunk Buys $18M More Zcash, Bringing Holdings to $150M",
    "body": "The digital-asset treasury firm is sitting on a over 100% paper gains following Zcash's recent rally.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Digital Asset Treasury|Zcash|Winklevoss|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 54614934,
    "published": 1763567384000,
    "title": "Bitcoin, Ethereum and XRP Set for Rebound? Here's What Analysts Think",
    "body": "Analysts see a potential short-term rebound, as retail panic selling of Bitcoin, Ethereum, and XRP signals a historical buying opportunity.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54614899,
    "published": 1763567229000,
    "title": "US government reopening may unleash crypto ETF floodgates: Analyst",
    "body": "2026 will likely be a busy year for crypto exchange-traded funds, which could help renew investor interest in digital asset markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54615681,
    "published": 1763568636000,
    "title": "$90K Bitcoin price is a ‘close your eyes and bid’ opportunity: Analyst",
    "body": "Bitcoin’s current correction is the largest of the bull market, but data indicate that the price is approaching prime capitulation territory.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54616476,
    "published": 1763570356000,
    "title": "ICP Softens as Failed Breakout Above $5.17 Shifts Market Back Into Consolidation",
    "body": "A surge in trading activity at key resistance levels marked the exhaustion of Monday’s rally, sending ICP back toward its short-term support band.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Technical Analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 82,
        "NAME": "ICP",
        "CATEGORY": "ICP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54616474,
    "published": 1763569772000,
    "title": "BONK Extends Slide as Key Support Break Raises Prospect of Further Downside",
    "body": "BONK slipped beneath a key support level amid a sharp rise in trading activity, with intraday charts now pointing toward a fragile short-term structure.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Technical Analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 113,
        "NAME": "BONK",
        "CATEGORY": "BONK"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54617479,
    "published": 1763572361000,
    "title": "Bitcoin Slips Back Below $90K — Crypto Correction Now Ranks Among Worst Since 2017, K33 Says",
    "body": "After a rare spot of outperformance on Tuesday, bitcoin has resumed sliding, with one analyst eyeing $84,000–$86,000 as potential local bottom.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Market Wrap|K33|Breaking News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54617500,
    "published": 1763572320000,
    "title": "The Biggest Challenges Facing Bitcoin Miners Going Into 2026",
    "body": "Analysts warn that pressures around power, software, and hosting could change the economics of Bitcoin mining.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54617477,
    "published": 1763572258000,
    "title": "Stella's XLM Token Breaks Key $0.25 Support as Altcoins Suffer Continued Drawdown",
    "body": "Technical breakdown gains momentum as institutional selling accelerates through overnight session.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 56,
        "NAME": "XLM",
        "CATEGORY": "XLM"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54618006,
    "published": 1763573413000,
    "title": "Here’s Why The Bitcoin Price Keeps Crashing- Is $80,000 Next?",
    "body": "Bitcoin has spent the past several weeks trapped in a persistent decline, wiping hundreds of billions of dollars from its market value and reversing nearly a year’s worth of gains. The pullback has pushed the price far below its October all-time high of $126,000 and has dragged sentiment with it as traders search for answers. A detailed breakdown shared by crypto analyst Tracy Shuchart offers the clearest picture yet of why this downturn has been so aggressive. Her analysis points to a failure not driven by a single factor but by several interconnected forces that broke simultaneously and created the conditions for a cascading crash. This presents the possibility of Bitcoin extending its crash to as low as $80,000. Breakdown Of The Macro Story That Sent Bitcoin To $126,000 According to Tracy Shuchart, Bitcoin’s climb from $40,000 to $126,000 was powered based on one dominant theory: a Federal Reserve easing cycle combined with a wave of institutional participation through spot ETFs. Related Reading: 4 Bitcoin Indicators That Led To Market Rallies In The Last 2 Years Have Returned Traders priced in a supportive macro backdrop where rate cuts were all but guaranteed, liquidity would expand, and institutions would steadily absorb supply. However, once the Federal Reserve reversed course, the foundation of that theory collapsed. Expectations for December rate cuts fell from 90% to 40%. Real yields on short-term Treasuries stayed elevated above 5%, and the strong-dollar environment returned. With the macro assumption gone, Bitcoin’s valuation near all-time highs became difficult to justify. Institutions that had accumulated through Spot ETFs quickly reduced exposure, producing more than $1.1 billion in outflows within days. This wasn’t panic selling but a systematic rebalancing by portfolio managers who no longer believed the macro thesis. This change in macro expectations effectively removed the first layer of support that had been holding Bitcoin above six-figure levels. The second layer of the decline came from the behavior of long-term holders. Wallets that accumulated bitcoin between $40,000 and $80,000 began distributing aggressively once volatility returned. They offloaded roughly 815,000 Bitcoin in thirty days, locking in substantial profits. Is $80,000 Next For Bitcoin? Shuchart’s argument is based on the notion that the ongoing decline persists because the market has now reached a point where natural buyers have vanished. Institutions are rebalancing away from risk, long-term holders are waiting for deeper discounts, and retail traders have retreated. Until there’s new demand, Bitcoin’s price will continue drifting lower. Related Reading: Bitcoin Price Just Flashed A Death Cross, But It’s Not What You Think “Now the market is repricing based on reality: high real yields, no Fed easing, strong dollar environment,” the analyst said. For a bottom to form, three conditions must be met. Leverage must be completely flushed out of the system, long-term holders need to stop selling and begin accumulating again, and real capital must find the price attractive enough. As it stands, Bitcoin is still trading above the $90,000 price level. However, recent price action saw it briefly slip below that threshold on November 18, touching lows near $89,000 before recovering. That move shows that the downtrend is already probing for lower support in the $80,000 zone. At the time of writing, Bitcoin is trading at $91,080. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|federal reserve|Tracy Shuchart",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54618095,
    "published": 1763573400000,
    "title": "10-year Bitcoin model approves buying BTC at $100K since time does ‘the heavy lifting’",
    "body": "A new Bitcoin model shows long-term returns remain in the 300% range regardless of an investors’ entry price. Will shifting global liquidity change the outcome this time?",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54617716,
    "published": 1763571040000,
    "title": "Crypto Majors Chop ahead of NVDA earnings! Kraken raises $800M! Fidelity launch SOL ETF!",
    "body": "Crypto majors were slightly green ahead of tonight’s major NVDA earnings call, with BTC hovering around $91,300, ETH up 2% at $3,090, BNB up 1% at $922, and SOL also up 1% at $139. Among top movers, MYX (+38%), STRK (+30%), and ZEC (+10%) led the pack. Bitcoin’s latest 30% drawdown unfolded far more rapidly—over 42 days—compared with the previous two drawdowns in Summer 2024 (147 days) and April 2025 (77 days). Kraken raised $800M at a $20B valuation in a round led by Jane Street, DRW, Oppenheimer, and a $200M stake from Citadel. The Ethereum Foundation outlined new goals for its upcoming Interop Layer, designed to unify all EVM L2s and make them function as “one chain.” In regulatory news, the OCC said national banks may hold and spend crypto in certain cases, such as paying for gas or testing applications. New Hampshire launched the first Bitcoin-backed municipal bond, while Mt. Gox moved 10,608 BTC—nearly $1B—from a cold wallet to new addresses, renewing expectations of imminent creditor repayments. Meanwhile, Tether made a strategic investment in Ledn to expand bitcoin-backed lending.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54618205,
    "published": 1763567015000,
    "title": "Crypto Exchange Kraken Files Confidentially for IPO Next Year",
    "body": "Kraken has filed confidentially for a US IPO, laying the groundwork for the crypto exchange operator to go public as soon as next year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54618875,
    "published": 1763575200000,
    "title": "AI Agents Need Identity and Zero-Knowledge Proofs Are the Solution",
    "body": "ZKPs could become the backbone of a new era of trusted AI and digital identity, giving individuals and organizations a way to interact safely and transparently across platforms and borders, argues Evin McMullen, CEO and co-founder of Billions Network.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Opinion|Zero-Knowledge Proofs|AI|Data Privacy|Opinion",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54619117,
    "published": 1763575515000,
    "title": "BlackRock Bitcoin ETF Posts Record $532 Million Daily Loss as BTC Price Slump Worsens",
    "body": "BlackRock's iShares Bitcoin Trust (IBIT) shed a daily record $523 million in investments on Tuesday, extending a five-day streak of outflows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54620647,
    "published": 1763578808000,
    "title": "$4M On The Move: Libra Scandal Addresses Make A Surprising Solana Play",
    "body": "Libra-linked wallets quietly pulled roughly $4 million from a failing memecoin and used part of their stash to pile into Solana, according to on-chain tracking and news reports. Related Reading: Crypto Carnage Continues — Tom Lee Exposes What’s Really Going On The move comes amid fraud probes and renewed scrutiny of the token’s launch, which earlier this year saw large withdrawals that rocked investor confidence and drew legal attention. Wallets Rotate Funds Into Solana Based on on-chain data, two addresses tied to the Libra project — labeled “Libra Deployer (Defcy)” and “Libra Wallet (61yKS)” — bought about $61.5 million worth of SOL at an average price near $135. Before these purchases, the same addresses reportedly held roughly $57 million in USDC, enabling a quick rotation from stablecoin holdings into a major Layer-1 token. Blockchain analysts flagged the activity after tracing a string of transfers that drained the last remaining liquidity from the token’s market. The withdrawals of nearly $4 million followed earlier large cash-outs tied to the coin’s creators that investigators say removed as much as $99 million from circulation at the token’s launch. That wave of exits and the token’s sudden collapse prompted several probes in Argentina and the US. What The Purchases Mean For Markets Market watchers said the swap into SOL is notable because it moves money from a controversial, politically linked memecoin into a mainstream crypto asset. Meanwhile, the political angle has not faded. The Libra token’s launch drew attention after Argentine President Javier Milei publicly promoted the coin and then tried to distance himself as losses mounted. The broader pattern of meme tokens tied to politicians has raised fresh worries about transparency and investor protection, with some lawmakers and regulators taking a closer look. Legal And Control Questions Remain Reports have asked who finally controls the wallets now and whether authorities can freeze the new SOL holdings. Fraud investigations are active, but on-chain moves show the addresses retained control long enough to shift assets across chains. Related Reading: From Dotcom To Crypto: Veteran Analyst Says The Bull Run Isn’t Over That gap between probe announcements and actual seizure powers has prompted calls for faster cross-border coordination in crypto enforcement. The episode adds to a string of high-profile memecoin blowups tied to public figures. Analysts say these events underline the danger for everyday investors who pile into tokens after a celebrity mention or viral hype. Featured image from Gemini, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|bitcoin|crypto|Javier Milei|libra|Milei|Sol|Solana",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54621063,
    "published": 1763579708000,
    "title": "Crypto Leverage Hits Record High in Q3 as DeFi Dominance Reshapes Market Structure: Galaxy",
    "body": "Onchain lending drove crypto-collateralized debt to a new peak in last quarter, but the leverage underpinning the market is now better collateralized than during the previous cycle.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Leverage|Derivatives|DeFi|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54620862,
    "published": 1763579130000,
    "title": "New Hampshire Unveils $100 Million Bitcoin Collateralized Municipal Bond",
    "body": "The bond requires overcollateralization by 160%, and will result in liquidation if the value of Bitcoin collateral falls below 130% of the bond’s value.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54621387,
    "published": 1763580405000,
    "title": "New Hampshire Awaits Bitcoin Bond Buyer to Get First State Effort Rolling",
    "body": "The New Hampshire Business Finance Authority took the opening steps toward shepherding a potential $100 million private-sector bitcoin bond.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|New Hampshire|Bitcoin News|Bond|State Government|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54621421,
    "published": 1763580337000,
    "title": "21shares Solana ETF launches amid crash, but flows signal investor interest",
    "body": "The 21shares Solana exchange-traded fund (TSOL) debuted with over $100 million in assets under management, signaling investor interest.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54621599,
    "published": 1763580846000,
    "title": "'Modern-Day Pablo Escobar': Treasury Sanctions Ex-Olympian Over Alleged Crypto-Fueled Crime Empire",
    "body": "A former Olympic snowboarder turned \"drug kingpin\" is now facing U.S. sanctions as the FBI attempts to track him down in Mexico.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 54622395,
    "published": 1763582664000,
    "title": "Fed Rate Cut Odds Plunge Further on Jobs Data Delays",
    "body": "Traders slash chances of a December cut to 33% as the Fed loses a key data point ahead of its final 2025 meeting.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Federal Reserve|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 54625043,
    "published": 1763587375000,
    "title": "Crypto Miners in Malaysia Stole $1 Billion in Power Over Five Years",
    "body": "A new parliamentary tally shows power theft tied to crypto mining accelerating sharply since May’s warnings of rising illicit activity.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54624935,
    "published": 1763587084000,
    "title": "Anchorage–Mezo partnership opens institutional access to BTC-backed loans",
    "body": "Federally chartered Anchorage Digital Bank is integrating Mezo’s BitcoinFi tools into its custody platform, giving institutions a compliant path to borrow against BTC.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54625516,
    "published": 1763588351000,
    "title": "Nvidia Earnings Beat, Strong Outlook Calm Jittery Markets; Bitcoin Re-Takes $90K",
    "body": "\"Blackwell sales are off the charts, and cloud GPUs are sold out,\" said Nvidia CEO Jensen Huang.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Artificial Intelligence|Nvidia|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54625489,
    "published": 1763588227000,
    "title": "Bitcoin Enters Death Cross—And Ethereum Isn’t Far Behind: Analysis",
    "body": "A Bitcoin bounce or more pain to come? The technical picture is turning ugly as BTC forms a classic bearish pattern.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54626283,
    "published": 1763589628000,
    "title": "Dogecoin Price Could Surge Above $1 As It Repeats This Trend From 2023-2024",
    "body": "The Dogecoin price may be poised for a significant rebound, as a familiar long-term pattern has emerged on its chart. According to technical analysis, the structure looks almost identical to a setup that triggered a major breakout in its previous cycle, from 2023 to 2024. With Dogecoin currently at a crucial support level that once marked the start of its last sustained rally, a crypto analyst has projected that the meme coin could enter a new bullish phase, potentially driving it above $1. Past Pattern Foreshadows Dogecoin Price Surge To $1 Crypto analyst Trader Tardigrade has predicted that the Dogecoin price could soon surge to $1.10 from its current $0.15 in this cycle. In a recent X post, he highlighted that Dogecoin’s weekly chart has settled on its support trendline for the third time in the current 2021-2026 cycle. Related Reading: Dogecoin Cup And Handle Pattern Is Returning, What Happens To Price If It’s Completed? The chart shows DOGE’s price reaching this key level after a prolonged pullback, creating a structure similar to the one that formed in late 2023. At the time, this pattern marked the beginning of a slow but consistent uptrend that lasted throughout 2024, ultimately creating the meme coin’s mid-cycle range peak. The historical comparison between the 2023 – 2024 cycle and the current cycle is clear on the analyst’s chart. In the previous cycle, Dogecoin completed three closes at the support zone before sharply reversing upward. The latest weekly pattern mirrors the exact alignment, with price tightening around a rising trendline while forming higher lows. Trader Tardigrade also noted that the previous cycle’s slow bull run began from the same setup. Notably, the chart highlights a large boxed region representing the projected 2024 to 2025 phase, where a widening price structure suggests that Dogecoin could still have room for an upward move. If historical patterns repeat as expected, the meme coin could initiate another powerful leg up above $1 by 2026. Dogecoin’s Bullish Thesis Strengthens After Channel Break Trader Tardigrade has also highlighted an important improvement on Dogecoin’s lower-timeframe chart, indicating a shift from a downtrend. The two-hour chart setup reveals a breakout from a Descending Channel that had previously controlled price movements during the meme coin’s recent decline. The breakout is visible as the white price line pushes above the Descending Channel’s upper boundary, signaling a potential shift in short-term momentum. Related Reading: Dogecoin Price Could Bounce Very Quickly If This Happens At $0.166 According to Trader Tardigrade, technical indicators such as the Relative Strength Index (RSI) and the Moving Average Convergence Divergence (MACD) support this shift. While the RSI has broken above its resistance zone, the MACD histogram shows a buildup in positive momentum, with bars expanding upward. The analyst has explained that Dogecoin often begins its largest bull rallies with early signals on the LTF before spreading to the higher time frames. With momentum rising, Trader Tardigrade believes the DOGE price may already be initiating an uptrend. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|Descending Channel|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt|LTF|MACD|Moving average convergence divergence|Relative Strength Index|RSI|Trader Tardigrade",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54626203,
    "published": 1763589188000,
    "title": "Bearish Bitcoin signal fires, raising chance for a 77% price drop",
    "body": "A bearish signal from Bitcoin’s SuperTrend indicator projected a major decline, which could be reinforced by the Crypto Fear & Greed index registering “extreme fear.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54625978,
    "published": 1763589069000,
    "title": "Odds of December Fed rate cut plunge to 33% as BTC falls below $89K",
    "body": "At the beginning of November, the odds of a December rate cut were 67% among traders, but they have since cratered alongside investor sentiment.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]