[
  {
    "id": 57098276,
    "published": 1768222800000,
    "title": "VelaFi raises $20 million in Series B to expand stablecoin payments infrastructure",
    "body": "The LatAm-based company said the funding will support expansion across the U.S. and Asia.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Fundraising|Stablecoins|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      }
    ]
  },
  {
    "id": 57099284,
    "published": 1768225583000,
    "title": "Bank of Italy models Ethereum risks if ETH value collapses",
    "body": "The Bank of Italy modeled the extreme scenario of Ether going to zero to show how market risk in Ethereum’s native token can turn into infrastructure and financial stability risks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57099079,
    "published": 1768225001000,
    "title": "Standard Chartered said to plan crypto brokerage, trims ETH forecast",
    "body": "Standard Chartered is reportedly developing a crypto prime brokerage platform as traditional banks expand digital asset services.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57099790,
    "published": 1768227163000,
    "title": "CoinDesk 20 Performance Update: Solana (SOL) Gains 3.1% as Index Trades Flat",
    "body": "Ethereum (ETH) joined Solana (SOL) as a top performer, rising 0.9% over the weekend.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "CoinDesk Indices|CoinDesk Indices|CoinDesk 20|charts|Prices|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57099607,
    "published": 1768226383000,
    "title": "Charles Hoskinson doubts CLARITY Act timeline, says Trump crypto czar should quit",
    "body": "Cardano founder Charles Hoskinson said the CLARITY Act may not pass this quarter, and criticized US crypto laws for favoring big banks over innovation.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57100154,
    "published": 1768227807000,
    "title": "Crypto custody company BitGo seeks up to $201 million in US IPO",
    "body": "BitGo is looking to raise up to $201 million in an IPO, targeting a $1.96 billion valuation with over $90 billion in assets under custody and top US banks leading the deal.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57100763,
    "published": 1768230044000,
    "title": "Solana Price Jumps, But Network Adoption Remains Weak",
    "body": "On-chain data shows the Network Growth indicator has continued to fall for Solana recently, a sign that adoption of the asset has remained weak. Solana Network Growth Has Been Declining According to data from on-chain analytics firm Santiment, SOL’s recent price recovery has come despite a drop in the Network Growth. This metric measures the weekly total number of addresses that are coming online on the blockchain for the first time. A wallet comes “online” on the network when it participates in some kind of transfer activity. Thus, the wallets that the Network Growth is counting are the ones that are making their first transaction on the network. Related Reading: Bitcoin Risks Drop To $69,000 If Pennant Support Breaks, Analyst Warns When the value of the Network Growth is high, it means that a large number of addresses are being created on the blockchain. Such a trend can be a sign that an influx of users is occurring. On the other hand, the indicator being low suggests that there isn’t much new address generation taking place on the network, which can be a potential indication that the chain isn’t attracting fresh investors. Now, here is the chart shared by Santiment that shows the trend in the Solana Network Growth over the last couple of years: As displayed in the above graph, the Solana Network Growth has witnessed a drawdown recently, despite the fact that the SOL price has made some recovery since its December low. This suggests that the bullish price action has been unable to bring fresh attention to the cryptocurrency. Historically, rallies have generally needed the incoming of new investors to be sustainable, as it’s the increased trading activity that provides them with the fuel to go on. In the chart, Santiment has highlighted the case of a rally where this requirement wasn’t met. The Network Growth was initially at a significant level, but as this price surge from 2025 played out, the metric’s value plummeted. This could be a potential factor behind the rally eventually running out of momentum. In late 2024, the opposite conditions were present, as the Network Growth shot up alongside the Solana bull run, implying adoption backed the price appreciation. Considering these past cases, it’s possible that the indicator might have to reverse its trajectory if SOL’s recovery has to last. The latest downward move in the Network Growth is also not the only development SOL is dealing with right now. From the graph, it’s visible that the indicator has gone through a long-term downtrend since its high in November 2024. Related Reading: $460M Crypto Longs Squeezed As Bitcoin Slips Below $90,000 Back then, the metric had a value of 30.2 million, but today, the figure has dropped to just 7.3 million. It now remains to be seen whether the long decline in the adoption of Solana will continue or if a turnaround will appear. SOL Price Solana recovered back to $144 on Sunday, but the coin has retraced to open the week as its price is back at $139. Featured image from Dall-E, Santiment.net, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Solana|Sol|Solana adoption|Solana Network Growth|Solana Price|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57100799,
    "published": 1768223743000,
    "title": "Vitalik Buterin lays out 'walkaway test' for a quantum safe Ethereum",
    "body": "Buterin emphasizes the importance of quantum resistance and scalability, aiming for the Ethereum blockchain to handle thousands of transactions per second.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Vitalik Buterin|Ethereum News|quantum computing|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57101014,
    "published": 1768230720000,
    "title": "Standard Chartered predicts Ether will outperform Bitcoin, hit $40,000 by 2030",
    "body": "The bank sees ether benefiting from sector-specific tailwinds even as broader crypto momentum remains uneven.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Ether|Bitcoin News|Standard chartered|crypto regulatioin|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57101395,
    "published": 1768231896000,
    "title": "BitGo aims to raise $201 million in IPO targeting $1.85 billion valuation",
    "body": "The company has reported significant revenue growth and achieved profitability with $35.3 million in net income in the first nine months of 2025.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|BitGo|IPO|Custodians|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 57101352,
    "published": 1768231468000,
    "title": "Ethereum set for 95% copycat rally against Bitcoin",
    "body": "ETH price could rally 95% versus Bitcoin if a decisive breakout above the key 0.042 BTC neckline confirms a bullish reversal.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57101977,
    "published": 1768233350000,
    "title": "Trump-linked World Liberty brings $3.4B stablecoin into crypto lending markets",
    "body": "World Liberty Financial has launched a crypto lending platform built around its USD1 stablecoin, as demand for onchain credit shows signs of recovery.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57102091,
    "published": 1768233960000,
    "title": "Wall Street broker Benchmark says this could be a pivotal week for digital assets",
    "body": "Senate action on market structure legislation could end years of regulatory uncertainty, unlock institutional liquidity and re-rate crypto-linked stocks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Cryptocurrency Regulations|Market Structure Legislation|Institutional Adoption|Benchmark|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57102621,
    "published": 1768235457000,
    "title": "Why XRP Deserves A Place As Long-Term Wealth And Life-Saving Strategy",
    "body": "In a world where financial systems are becoming fragile, XRP stands out as the intersection of a financial infrastructure designed for instant global value transfer, speed, reliability, and global accessibility. XRP’s ability to move value instantly across borders, with minimal cost and without reliance on fragile banking systems, positions it as both a long-term wealth tool and a potential life-saving instrument. XRP should be considered as part of life-saving plans. An analyst known as Bird on X has pointed out that most people keep their money in the bank, earning around 4-6% a year, and feel comfortable with it, but they rarely factor in the impact of inflation. Over time, the purchasing power of currencies like the US dollar and the British pound has been quietly eroded to the point where your money can grow on paper while losing value in the real world. XRP’s Role In The Next Phase Of Global Payments Although savings accounts are safe, many people are actually standing still or falling massively behind without even realizing it, which is why XRP comes in as a long-term life-saving strategy. XRP has spent years held back by legal uncertainty, and during that time, the technology continued to mature. Currently, there’s clarity, and what was being built has become visible. Related Reading: XRP Ledger May Get A Tokenized Gold Upgrade, Web3 Founder Reveals Real-world usage is arriving in cross-border payments, institutions are engaging, stablecoins like RLUSD are being introduced, and real-world assets are being tokenized on the chain. As the utility is increasing, capital is flowing into the ecosystem. More usage creates more demand, and sustained demand is what drives long-term value growth. According to Bird, XRP is to be trusted more than fiat, which is why it is a long-term savings vehicle rather than a short-term trade. XRP can be reserved for self-custody, stored on a cold wallet, removing reliance on banks altogether. Instead of earning a few percentages while fighting inflation, you’re holding a digital asset positioned at the centre of growing global financial infrastructure, which is more likely to increase in value over time. In comparison, it is unclear whether inflation will ever pause to make cash worth more. The analyst views this scenario as a long-term wealth investment and believes that XRP will become one of the most utilised digital assets in the world. Thus, building a savings position now could prove to be one of the smartest financial decisions someone could make over the long run. A Bridge Between Old Money And New Rails ChartNerd noted that Ripple is not built to be a traditional crypto company that aims to destroy the old money. Instead, Ripple acts as the bridge between the old and new financial worlds, and this will be a more successful long-term strategy. Related Reading: XRP Whale Deposits To Binance Ease: Data Points To Lower Distribution Risk A sustainable financial change will emerge gradually, not through a knee-jerk move or total disruption in just one cycle. XRP is clearly the long-game asset, while 2025 was the most productive year for Ripple, nothing is priced in yet. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|Bird|ChartNerd|Ripple|RLUSD|stablecoin|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57102707,
    "published": 1768235544000,
    "title": "Bitcoin loses to gold as debasement trade with BTC at 2-year lows: Analysis",
    "body": "Bitcoin failed to become investors' choice as the debasement trade as BTC price action slumps while gold and silver hit repeat all-time highs, said analysis.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57104631,
    "published": 1768241458000,
    "title": "Crypto infrastructure firm Bakkt jumps 17% on deeper stablecoin payments push with new deal",
    "body": "The firm said it has agreed to acquire Distributed Technologies Research, a blockchain-based payment infrastructure provider.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Bakkt|Stablecoin|acquisition|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      }
    ]
  },
  {
    "id": 57104622,
    "published": 1768241370000,
    "title": "Two UK-Registered Companies Moved $1B in Stablecoins for Iran: Report",
    "body": "The two companies transferred a total of $619.1 million in funds to wallets linked to Iran’s Islamic Revolutionary Guard Corps in 2024.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57104554,
    "published": 1768241064000,
    "title": "Crypto enters round 2 of institutional adoption led by Morgan Stanley: Binance",
    "body": "Binance Research said crypto markets are entering a new phase, as institutional allocation and strategic positioning begin to outweigh retail-driven momentum.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57105037,
    "published": 1768242360000,
    "title": "Stablecoin platform VelaFi secures $20M to scale cross-border settlement rails",
    "body": "The funding will support expansion of enterprise payment and settlement services across Latin America, the United States and Asia.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 57104927,
    "published": 1768242349000,
    "title": "Bitcoin, Ethereum ETFs Shed Nearly All 2026 Gains as Rate Cut Hopes Fade",
    "body": "Bitcoin and Ethereum ETFs are surrendering nearly all 2026 gains as fading Fed rate cut hopes drive sizable crypto fund outflows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57104930,
    "published": 1768241788000,
    "title": "Betterment Customer Data Accessed in Online Crypto Scam Attack",
    "body": "Personal finance platform Betterment fell victim to an online attack that allowed an unauthorized individual to send some customers a “fraudulent, crypto-related message,” the company said in a statement on Monday.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57105201,
    "published": 1768243161000,
    "title": "Apple Taps Google's Gemini to Power AI Models After 'Apple Intelligence' Stumbles",
    "body": "Apple says its next generation of AI models will be based on Google’s Gemini, marking a reset after its in-house effort failed to compete.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57105507,
    "published": 1768244070000,
    "title": "Crypto Firm BitGo Targets Nearly $2 Billion Valuation in US IPO Filing",
    "body": "Private crypto wallet and custody firm BitGo filed for an initial public offering in the U.S. with aims to raise as much as $200 million.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57105418,
    "published": 1768243943000,
    "title": "CFTC to tap Tyler Winklevoss, other crypto CEOs as first members of innovation panel",
    "body": "Mike Selig, chairman of the Commodity Futures Trading Commission, is settling in with the revamping of a new innovation panel with many crypto names.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Tyler Winklevoss|Mike selig|U.S. Commodity Futures Trading Commission|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 16,
        "NAME": "COMMODITY",
        "CATEGORY": "COMMODITY"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57105859,
    "published": 1768245230000,
    "title": "Staking goes mainstream: what 2026 could look like for ether investors",
    "body": "From fully staked ETFs to customizable institutional vaults, staking is evolving from a secondary consideration into a foundational pillar of Ethereum’s market structure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Ethereum News|Ethereum staking|Lido|Exclusive|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57106170,
    "published": 1768246200000,
    "title": "Dogecoin Breaks Its ‘Lower-Band Prison’ As Daily Trend Flips",
    "body": "The Dogecoin price is currently up by approximately 17% since the December 31 low and the rebound is starting to look less like a dead-cat bounce and more like a regime change, according to crypto analyst Cantonese Cat, who points to a clear shift in how DOGE is trading inside its Bollinger Bands on the daily chart. The setup matters now because price has moved from months of lower-band pressure into the upper half of the range, often the earliest tell that trend behavior is rotating. Cantonese Cat’s latest daily view (Binance) frames the move through Bollinger Band positioning rather than pattern-chasing. As the analyst put it: “DOGE daily shows a clear trend change that is easy to see when you see how it was riding on the lower half of the Bollinger band for months but now has a clear change in character.” That “character” is visible in the band mechanics. DOGE closed around $0.1405 on the print shown, now trading above the 20-day basis line near $0.1348 after spending much of the prior stretch leaning into the lower half of the envelope. The upper band is near $0.1564 and the lower band near $0.1132. Related Reading: Here’s How High The Dogecoin Price Would If It Repeats Previous Parabolic Runs In the analyst’s framing, the basis line becomes the near-term “line in the sand” for whether this is a genuine trend flip or simply a volatility expansion that fades. Holding above it keeps price in the upper half of the bands, where trends typically behave differently than they do during lower-band rides. Weekly And Monthly Chart Support The Thesis Zooming out, Cantonese Cat’s weekly chart (Dec. 20) casts the broader structure as an Elliott-style sequence: a completed Wave 1 advance followed by a Wave 2 correction. The analyst wrote: “We’ve already had a 13 month bear market for DOGE, with my working hypothesis of this being likely a wave 2 correction prior to wave 3 explosion. The entire reason why this may play out is that it doesn’t feel likely right now, and you want me to stop posting.” Related Reading: Is The Dogecoin Rally A Dead Cat Bounce? Analysts Weigh In The levels on the chart are explicit. DOGE is sitting between the 0.382 retracement near $0.1177 and the 0.5 level near $0.1542, with higher retracement markers at roughly $0.2021 (0.618), $0.2477 (0.707), $0.2968 (0.786), and $0.3732 (0.886). Above that, the 1.0 level is labeled near $0.4844, with extensions reaching approximately $0.9029 (1.272), $1.2497 (1.414), $1.9934 (1.618), $4.7793 (2.0), and $8.9077 (2.272), the latter aligning with the analyst’s repeatedly cited “$9 region” target for this cycle. On Jan. 9, Cantonese Cat paired DOGE’s monthly chart with the iShares Russell 2000 ETF (IWM), arguing a recurring bull-phase rhythm: “DOGE has always been about 2-4 months behind IWM during the bull phase.” The comparison highlights prior instances where IWM’s breakout behavior preceded DOGE’s major upside phases, implying DOGE’s current improvement could be read as a delayed echo if the template holds. Overall, the near-term question is whether DOGE can keep closing above the daily Bollinger basis (~$0.1348) and avoid slipping back into the lower-half posture that defined the prior months. On the upside, a break above the upper band region (~$0.1564) and the 0.5 Fib ($0.1542) is crucial for further upside. At press time, DOGE traded at $0.13674. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57108014,
    "published": 1768251603000,
    "title": "This Ethereum Triangle Breakout Puts Price Above $24,000, Here’s The Path",
    "body": "Ethereum is nearing a decisive phase that could unlock a major long-term price expansion. A higher-timeframe analysis shared by a TradingView analyst suggests that, despite current short-term weakness, Ethereum remains structurally positioned for a significant upside move. If the ongoing formation resolves as expected, the projected breakout places Ethereum’s price well above $24,000. Ethereum’s Long-Term Structure Remains Intact From a broader perspective, the analyst emphasizes that Ethereum has not broken its established trend since 2020. Over that period, price action has continued to form higher highs, reinforcing the view that the long-term structure remains valid. Rather than signaling failure, the prolonged consolidation seen over recent years is framed as stabilization within a large and defined range. Related Reading: Analyst Predicts Strongest XRP Price Rally In History Is Coming, Here’s Why This range sits between $1,000 and $3,000, with the $1,000 level identified as a critical psychological and structural support. According to the analysis, Ethereum’s ability to hold above this zone is central to the bullish thesis. Remaining above it allows the asset to continue developing a massive ascending triangle, a formation often associated with strong continuation moves once completed. Within this triangle, the analyst outlines a clear progression of internal price phases. Two major legs of the structure have already formed, and Ethereum is now moving through the final phase needed to complete the setup. This phase has brought short-term bearish signals, but they remain part of the broader structure rather than a structural breakdown. As the price approaches the lower boundary of the triangle, several layers of support converge. These include the rising structural trendline and key moving averages that have historically supported Ethereum’s price. The analyst notes that stabilization and a bounce are likely in this area, provided Ethereum does not break below the triangle’s lower limit. Such a break would invalidate the structure, but current conditions suggest that risk remains contained. Why A Breakout Opens The Door To $24,000 The bullish scenario hinges on confirmation. Once the triangle is fully formed and Ethereum breaks above its upper boundary, the analyst expects a continuation move to follow. Based on the size of the formation and prior market behavior, the projected expansion points to a move of roughly 300% from current levels. When applied to Ethereum’s existing range, that expansion places the primary bullish target above $24,000. This projection is not presented as a short-term price call, but as the potential outcome of a multi-year structure finally resolving upward. Related Reading: XRP Mirrors Gold’s Trajectory: What A Similar ATH Rally Would Mean Additional context strengthens this outlook. Ethereum continues to benefit from growing institutional participation, and recent data shows record stablecoin transfer volumes exceeding $8 trillion on the network. These developments suggest increasing reliance on Ethereum’s infrastructure, which could support sustained price expansion following a confirmed breakout. Ultimately, the analyst believes Ethereum’s next major move depends on how this consolidation phase concludes. If the structure holds and the breakout is confirmed, the path toward prices above $24,000 becomes a technical continuation rather than an outlier scenario. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57107797,
    "published": 1768250700000,
    "title": "3 ETH price charts predict a sharp move to $4K is brewing",
    "body": "ETH’s recent rally was driven by spot demand and a healthy use of futures market leverage, potentially setting Ether up for a follow-up move to $4,000.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57108490,
    "published": 1768252959000,
    "title": "Bitmine ETH holdings climb to 4.1M as chairman seeks to expand crypto strategy",
    "body": "The latest purchase lifted the company’s Ether holdings to about 3.4% of the token's circulating supply, as Bitmine's chairman, Tom Lee, aims to accumulate 5% of the total outstanding supply.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57108982,
    "published": 1768254418000,
    "title": "Fitch Ratings flags Bitcoin-backed securities for ‘high market value risk’",
    "body": "Fitch said sharp Bitcoin price swings could quickly erode collateral backing these securities, increasing the risk of losses for lenders and investors.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57109151,
    "published": 1768254897000,
    "title": "Bakkt Stock Jumps 18% Following Stablecoin Firm Acquisition",
    "body": "Bakkt Holdings will acquire stablecoin firm Distributed Technologies Research in an equity deal, sending shares up 18%.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      }
    ]
  },
  {
    "id": 57109843,
    "published": 1768257017000,
    "title": "Analyst Highlights Fibonacci Level That Could Put Dogecoin Price Top Above $10",
    "body": "Crypto analyst DOGECAPITAL has drawn attention to a Fibonacci level that indicates that the Dogecoin price top is above $10. The analyst also highlighted the meme coin’s performance during past bull cycles to explain why it could rally to double digits. Dogecoin Price Eyes Rally Above $10 Based on These Fibonacci Extensions In an X post, DOGECAPITAL predicted that the Dogecoin price could rally above $10, which would mark the top for the foremost meme coin. This came as he noted that the monthly DOGE chart highlights where major cycle peaks have historically formed using Fibonacci extensions and that this pattern is “remarkably consistent.” Related Reading: Dogecoin Rapid Accumulation Suggests Sharp Upward Sweep Is Coming The crypto analyst mentioned that in the first cycle, the Dogecoin price topped exactly at the 4.236 Fibonacci level. In the second cycle, DOGE is said to have peaked again at the 4.236 Fibonacci level. DOGECAPITAL remarked that this pattern isn’t random but rather a structural behavior. He then stated that if this pattern continues into the next cycle, the data strongly suggests that the Dogecoin price’s upcoming cycle top could again align with the 4.236 Fibonacci level, which currently sits at $33.25. DOGECAPITAL added history doesn’t repeat perfectly, but it often rhymes. In this case, DOGE has followed its long-term Fibonacci structure with “near-perfect accuracy,” which is why he is confident that the meme coin could reach this price target. Meanwhile, it is worth mentioning that DOGECAPITAL’s accompanying chart showed that the Dogecoin price could reach this $33.25 target between now and 2028. Interestingly, the chart showed that DOGE could rally to as high as $100 if it reaches the upper boundary of the ascending channel. A rally to these targets would mark new all-time highs (ATHs) for the meme coin, whose current ATH is $0.74. Market Cap Doesn’t Matter For DOGE A potential Dogecoin price rally to $33.25 would give the meme coin a market cap of around $5.6 trillion. However, DOGECAPITAL stated that market cap has never dictated how DOGE moves. He said that if it did, half the insane runs in crypto wouldn’t exist. The analyst noted that Shiba Inu exploded to a massive valuation in 2021 with no “realistic” justification, yet the market still sent it to such highs. Related Reading: Analyst Says the Worst Is Over For Dogecoin, Predicts Rally To $0.8 DOGECAPITAL stated that his focus is on the long-term Fibonacci structure and that the Dogecoin price has topped at the 4.236 Fib level in two separate cycles. He added that this is the entire point of the chart and that it is not tied to any quarter, fundamentals, or market cap logic. The analyst also claimed that short-term volatility doesn’t erase a decade-long pattern and that if the Fib structure breaks, he will adjust accordingly. At the time of writing, the Dogecoin price is trading at around $0.14, up in the last 24 hours, according to data from CoinMarketCap. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|Ascending Channel|CoinMarketCap|doge|DOGE news|Doge price|DOGECAPITAL|Dogecoin news|dogecoin price|dogeusd|dogeusdt|fibonacci extensions|Fibonacci Level|meme coin|Shiba Inu",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 44,
        "NAME": "SHIB",
        "CATEGORY": "SHIB"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57109701,
    "published": 1768256551000,
    "title": "New Hope For Crypto: Senators Introduce Blockchain Regulatory Certainty Act",
    "body": "In a major new development for the crypto industry, Senators Ron Wyden and Cynthia Lummis announced on Monday evening the introduction of a bipartisan, standalone version of the Blockchain Regulatory Certainty Act (BRCA). This legislation aims to provide much-needed clarity for software developers and infrastructure providers in the blockchain space, particularly concerning their classification under federal law. New Crypto Bill To Protect Blockchain Developers According to the detailed press release regarding the matter, the BRCA specifies that developers and providers who do not have control over user funds will not be classified as money transmitters. Senator Lummis highlighted the ongoing challenges faced by blockchain developers, stating: Blockchain developers who have simply written code and maintain open-source infrastructure have lived under threat of being classified as money transmitters for far too long. This designation makes no sense when they never touch, control, or have access to user funds, and unnecessarily limits innovation. Related Reading: Crucial Role Of The CLARITY Act In Avoiding A New October 10 Crypto Crash, Expert Explains Lummis emphasized that the bill provides developers with the clarity needed to advance digital finance without the fear of legal repercussions for activities that do not pose a money laundering risk. Lummis added, “It’s time to stop treating software developers like banks simply because they write code.” Senator Wyden echoed these concerns, arguing that imposing the same regulatory requirements on developers as those applied to exchanges or brokers is fundamentally flawed. Main Highlights Of The BRCA The Blockchain Regulatory Certainty Act aims to set clear federal standards defining when blockchain developers and service providers can be exempt from money transmitter regulations. Under current legislation toward crypto, the Senators assert blockchain developers face regulatory ambiguities that have not only stifled innovation but also driven many projects offshore, as they navigate conflicting regulations across different states. Related Reading: Dogecoin Breaks Its ‘Lower-Band Prison’ As Daily Trend Flips The bill specifically establishes that a “non-controlling developer or provider” refers to any entity that develops or maintains distributed ledger technology but does not possess the unilateral authority to initiate or execute transactions involving users’ digital assets without third-party consent. In addition, the crypto bill clarifies protected activities, including the development or publication of software for distributed ledgers, maintenance services for blockchain networks, offering customer self-custody solutions, and providing necessary infrastructure to support distributed ledger services. Importantly, while the bill allows states to enforce their laws consistent with federal regulations, it also prevents them from imposing money transmitter requirements on developers engaged solely in the specified protected activities. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|Blockchain Regulatory Certainty Act|BRCA bill|crypto|crypto bill|crypto legislation|crypto market|crypto news|cryptocurrency|Senator Cynthia Lummis|Senator Lummis|US crypto regulation",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57110481,
    "published": 1768258911000,
    "title": "Charles Hoskinson slams Trump’s crypto policy as 'extractive,' warns of industry fallout",
    "body": "Cardano founder says Trump’s actions have politicized crypto and alienated half the country.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Charles Hoskinson|Cardano|Donald Trump|Consensus Hong Kong 2026|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57111091,
    "published": 1768260612000,
    "title": "Markup of Senate Crypto Market Structure Bill Pushed to Late January",
    "body": "Senate leaders have delayed a key vote on crypto market structure legislation, citing unresolved policy issues around stablecoin yield.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57110863,
    "published": 1768259999000,
    "title": "Warren Presses SEC Over Crypto Risk as Trump Pushes Crypto Into Retirement Plans",
    "body": "Warren says the Trump administration's move could expose retirement savers to higher fees, sharp losses, and weaker oversight.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 57111657,
    "published": 1768262448000,
    "title": "Trump-Powell Conflict Fuels Volatility While Retail Sells Bitcoin At A Loss – Details",
    "body": "Bitcoin has entered a fresh bout of volatility after a rare and highly charged response from Jerome Powell, following reports that federal prosecutors have opened a criminal investigation related to his conduct as Federal Reserve Chair. In a direct and unusually pointed statement, Powell said: “The threat of criminal charges is a consequence of the Fed setting rates based on our best assessment of what will serve the public, rather than following the preferences of the President.” Related Reading: CVDD Model Signals Bitcoin Is Not Yet Deeply Undervalued: Drawdown Lags Historical Cycles The market reaction was immediate. Bitcoin dropped from the $92,500 area to nearly $90,500, reflecting heightened uncertainty as traders reassessed political and macro risks. The move interrupted an otherwise stable consolidation phase and reintroduced volatility at a moment when BTC was attempting to build support above the $90,000 level. What makes this episode particularly notable is the shift in Powell’s public stance. Over the past 12 months, despite repeated criticism from President Trump, Powell consistently declined to engage, often responding with variations of “I have no response or comment.” That long-standing silence broke yesterday. As markets digest the implications, Bitcoin now finds itself at the intersection of macro policy, political pressure, and investor psychology. The next reaction—both from policymakers and from risk assets—could prove decisive for short-term price direction. Retail Fear Persists as Short-Term Holders Capitulate Within the Uptrend A recent CryptoQuant analysis adds another layer to the current political and macro-driven volatility, revealing that retail investors remain fearful of short-term price swings even as Bitcoin maintains a broader upward structure. The Short-Term Holder SOPR (STH SOPR) highlights a recurring behavioral pattern that tends to appear during corrective phases within a larger bull trend. Despite Bitcoin printing higher highs and higher lows throughout 2024 and 2025, short-term investors have been consistently realizing losses. Toward the end of last year, retail sentiment deteriorated sharply, with the STH SOPR dropping to around 0.98. Levels last seen in November 2022, when Bitcoin was trading near $16,000. While the indicator has not fully entered extreme capitulation territory below 0.98, it has remained under the neutral 1.00 level for more than 70 days, signaling sustained selling at a loss. This divergence is critical when STH SOPR remains below 1.00, coinciding with extended consolidations or corrective phases, driven by heightened pressure since Bitcoin broke above its previous all-time high. Historically, periods where STH SOPR stays below 1.00 coincide with extended consolidation or corrective phases, driven by elevated fear and realized losses. However, during the current uptrend, these episodes have repeatedly marked favorable accumulation zones. The mismatch between rising prices and capitulating retail behavior often reflects opportunity rather than weakness. This highlights Bitcoin’s underlying structural strength despite short-term volatility. Related Reading: Ethereum Long-Term Cost Basis Holds Firm: Structural Floor Forms Near $2.8K Bitcoin Consolidates Below Key Resistance as Volatility Compresses Bitcoin’s weekly chart shows the market in a consolidation phase following a sharp correction from the October highs near $120,000. After losing the $100,000 psychological level, BTC found demand in the low-$80,000s before rebounding toward the $90,000–$94,000 range, where price is currently stalling. This zone has clearly become a short-term equilibrium. With buyers defending higher lows but struggling to generate enough momentum for a decisive breakout. From a trend perspective, Bitcoin remains below the 50-week moving average, which is now acting as dynamic resistance around the mid-$90,000 area. In contrast, the 100-week moving average continues to slope upward well below the price. Reinforcing the idea that the broader macro trend remains intact despite recent weakness. The 200-week moving average, far lower, continues to define the long-term bull market structure. Related Reading: Bitcoin Remains In A High-Risk Zone As Short-Term Holders Stay Underwater Volume has compressed significantly during this consolidation, suggesting reduced participation and indecision. This typically precedes a volatility expansion rather than a continuation of slow, sideways trading. As long as BTC holds above the rising 100-week moving average, downside appears structurally limited. Failure to reclaim the $94,000 resistance zone would keep the market vulnerable to another leg of consolidation before a sustainable trend resumes. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|Bitcoin news|btc|BTCUSDT|Federal Reserve Chair Jerome Powell|Powell|Trump|Trump vs Powell",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57111877,
    "published": 1768262974000,
    "title": "CFTC forms innovation committee to help shape rules for crypto, AI",
    "body": "The CFTC is looking to invite Tyler Winklevoss, Shayne Coplan, Kris Marszalek, and other crypto leaders to assist its approach to regulating the blockchain industry.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57112847,
    "published": 1768266002000,
    "title": "Get Ready For An XRP Price Explosion Once This Happens; Analyst",
    "body": "Analysts are calling for an XRP price explosion, as the cryptocurrency’s market structure and the reappearance of historically reliable technical patterns support this bullish outlook. Although XRP experienced a brief rebound at the beginning of 2026, its price has since given back some of those gains and is now trading slightly above $2.0. Nevertheless, analysts remain optimistic about XRP’s near-term growth and have identified a key setup that could trigger the anticipated surge. XRP Price Prepares For Major Explosion Market expert CRYPTOWZRD has shared a fresh technical analysis of XRP, pointing to a familiar setup that previously led to an explosive price surge. He stated that XRP has spent more than a year trading sideways, forming a base that closely resembles an early pre-rally phase. Related Reading: Wall Street Analyst Is Still Bullish On Bitcoin, Predicts Price Recovery This sideways behavior had preceded a sharp vertical breakout during the 2024 bull cycle. CRYPTOWZRD noted that the current market structure mirrors this setup, suggesting that history may repeat itself if conditions align. His chart supports this view by showing XRP locked in a broad horizontal range for an extended period. In the past, XRP’s price repeatedly bounced between a clearly defined yellow support zone and red resistance bands, confirming range-bound behavior and accumulation. On the chart, the historical breakout is visible as a strong, impulsive upward move that followed XRP’s retest of support and the invalidation of the previous downtrend. Following its initial price rally in July 2024, XRP entered a topping phase near the upper red resistance area. After failing to hold those highs, the cryptocurrency saw a sharp pullback described as a “quick dump,” which drove prices back toward a key support region in the next month. Interestingly, XRP began to trade within a descending channel after the pullback. Once the price broke the channel’s upper boundary, it triggered a powerful rally, propelling XRP from approximately $0.5 to over $2. A similar descending channel is now visible in XRP’s current market structure, reinforcing the analyst’s view that another parabolic move may be unfolding. In this setup, XRP has already broken above the upper boundary of the channel, and now its price is expected to push through the red resistance bands positioned between $3.4 and $3.7 Analyst Warns That XRP Must Clear $2.26 Or Risk Another Drop Speaking on current price action, crypto analyst ChartNerd warns that XRP could see another price correction if it fails to break and hold above the $2.26 support level. According to the expert, both the weekly 20 Exponential Moving Average (EMA) and the middle regression band of the Gaussian Channel are acting as resistance. Related Reading: Here’s Why the Bitcoin Price Was Able To Break $94,000 The chart also shows these indicators converging at the $2.26 support level, strengthening the barrier XRP must overcome. A failure to break above this level could cause the price to retrace back toward multi-month support near $1.9, where a higher low could form if buyers step in. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Ripple|ripple news|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57113835,
    "published": 1768268896000,
    "title": "Bitcoin shows strength as US DOJ mulls Fed chair investigation: Will BTC price hold?",
    "body": "Bitcoin rallied to $92,000 as Federal Reserve chair Jerome Powell spoke about a potential DOJ investigation into the Fed. Will BTC's strength hold?",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57114471,
    "published": 1768271045000,
    "title": "Bitcoin Price Stays Pinned Above Support, Setting Up a Bigger Move",
    "body": "Bitcoin price started a consolidation phase below $92,000. BTC is holding the $89,500 support and might attempt to start a fresh increase. Bitcoin started a recovery wave above $90,000 and $90,500. The price is trading above $91,000 and the 100 hourly Simple moving average. There is a bullish trend line forming with support at $90,650 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move up if it stays above the $90,000 zone. Bitcoin Price Stays In A Range Bitcoin price managed to stay above the $89,500 support and started a minor recovery wave . BTC was able to settle above $90,000 and $90,500. The bulls were able to push the price above $91,500, and the 23.6% Fib retracement level of the downward move from the $93,770 swing high to the $89,225 low. However, the price seems to be facing a major hurdle near the $92,000 level. The 50% Fib retracement level of the downward move from the $93,770 swing high to the $89,225 low is acting as a resistance. Besides, there is a bullish trend line forming with support at $90,650 on the hourly chart of the BTC/USD pair. Bitcoin is now trading above $91,000 and the 100 hourly Simple moving average . If the price remains stable above $90,500, it could attempt a fresh increase. Immediate resistance is near the $92,000 level. The first key resistance is near the $92,800 level. The next resistance could be $93,450. A close above the $93,450 resistance might send the price further higher. In the stated case, the price could rise and test the $94,000 resistance. Any more gains might send the price toward the $94,500 level. The next barrier for the bulls could be $95,000 and $95,500. Another Drop In BTC? If Bitcoin fails to rise above the $92,000 resistance zone, it could start another decline. Immediate support is near the $91,000 level. The first major support is near the $90,650 level and the trend line. The next support is now near the $90,000 zone. Any more losses might send the price toward the $89,500 support in the near term. The main support sits at $89,250, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now near the 50 level. Major Support Levels – $91,000, followed by $90,650. Major Resistance Levels – $92,000 and $92,800.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57114919,
    "published": 1768272288000,
    "title": "Senators pitch bill to lock in protections for crypto developers",
    "body": "The Blockchain Regulatory Certainty Act aims to clarify that writing software and maintaining networks don’t trigger federal or state money-transfer requirements.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57115253,
    "published": 1768273307000,
    "title": "Meta to cut 10% of metaverse arm this week amid AI push: Report",
    "body": "Meta's Reality Labs is set for cuts as the firm’s metaverse budget continues to decline amid push toward artificial intelligence development.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57115182,
    "published": 1768273214000,
    "title": "Crypto Products Post $454M Weekly Outflows On Fed Jitters",
    "body": "Markets pulled $454 million from crypto exchange-traded products last week as investors stepped back amid rising bets that the US Federal Reserve may not cut rates soon. Related Reading: CZ Fuels Optimism As Binance Coin’s $1,000 Target Trends According to CoinShares data and market reports, the move erased much of the early-week gains that had pushed roughly $1.5 billion into the sector during the first two trading days. The shift was sharp and broad, though a few assets saw money flow in. Smart Money Flees Bitcoin While Some Altcoins Attract Cash Bitcoin-linked products bore the brunt of withdrawals, with about $405 million leaving Bitcoin ETPs. Ethereum funds were also hit, posting roughly $116 million in outflows. Multi-asset crypto products reported net redemptions near $21 million. Based on reports, these outflows came as recent inflation and jobs data made investors lower the odds of a March Fed rate cut, weakening appetite for risk assets that had been boosted by earlier optimism. Selective Inflows Show Pockets Of Interest But not all tokens were abandoned. XRP funds drew around $46 million in fresh money, while Solana products attracted about $33 million. Smaller tokens, including some newer layer-one projects, picked up modest flows as investors hunted for opportunities beyond the main leaders. Total assets under management across global crypto ETPs remained near $182 billion, a figure that shows scale despite the weekly redemptions. Regional Patterns Reveal US Outflows And Overseas Inflows According to regional flow data, US-linked crypto investment products saw roughly $569 million exit last week. That outflow contrasted with inflows in some European and North American markets: Germany attracted about $59 million, Canada added $25 million, and Switzerland drew roughly $21 million. The pattern suggests capital moved away from US vehicles and into other jurisdictions where investor appetite held up better. What Traders And Analysts Are Saying Based on reports from market analysts, the reversal came as traders reassessed the timing of monetary easing. With inflation readings remaining firmer than expected and the labor market showing resilience, market pricing shifted and risk assets were repriced. Some analysts warned that volatility could persist while others noted that pockets of demand for specific altcoins might support short-term rallies. Related Reading: Bitcoin’s Next Peak Might Ignite ADA’s Rally, Says Cardano Creator According to observers, the outflows highlight how sensitive crypto fund flows are to macroeconomic signals. While $454 million is a meaningful weekly move, the sector’s overall AUM near $182 billion means a single week does not rewrite the market picture. Investors will likely watch upcoming economic releases and Fed communications closely; fund flows are expected to respond quickly to any sign that rate-cut hopes are returning or fading further. Featured image from Gemini, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|crypto|etf|ethereum|ETP|fed|Rate Cut|Solana",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57116653,
    "published": 1768277541000,
    "title": "Democrats Test Crypto Fundraising Reset With BlueVault Launch",
    "body": "The new platform aims to help Democratic campaigns win over crypto donors ahead of the 2026 mid-term elections.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57116538,
    "published": 1768277336000,
    "title": "XRP Price Weakness Deepens, Opening the Door to a Sharper Drop",
    "body": "XRP price extended losses and traded below $2.080. The price is now attempting to start a fresh increase and faces hurdles near the $2.120 level. XRP price started a fresh decline below the $2.10 zone. The price is now trading below $2.10 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance at $2.080 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move down if it stays below $2.10. XRP Price Turns Red XRP price failed to stay above $2.150 and started a fresh decline, like Bitcoin and Ethereum . The price declined below $2.120 and $2.10 to enter a short-term bearish zone. The price even spiked below $2.050. A low was formed at $2.034, and the price is now consolidating losses. There was an attempt to clear $2.10, but the bears remained active. There is also a key bearish trend line forming with resistance at $2.080 on the hourly chart of the XRP/USD pair. The price is now trading below $2.10 and the 100-hourly Simple Moving Average. If there is a fresh upward move, the price might face resistance near the $2.080 level and the trend line. The first major resistance is near the $2.120 level. It is close to the 23.6% Fib retracement level of the downward move from the $2.415 swing high to the $2.034 low. A close above $2.120 could send the price to $2.20. The next hurdle sits at $2.220 or the 50% Fib retracement level of the downward move from the $2.415 swing high to the $2.034 low. A clear move above the $2.220 resistance might send the price toward the $2.280 resistance. Any more gains might send the price toward the $2.320 resistance. The next major hurdle for the bulls might be near $2.350. More Losses? If XRP fails to clear the $2.10 resistance zone, it could start a fresh decline. Initial support on the downside is near the $2.020 level. The next major support is near the $2.00 level. If there is a downside break and a close below the $2.00 level, the price might continue to decline toward $1.950. The next major support sits near the $1.920 zone, below which the price could continue lower toward $1.880. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $2.020 and $2.00. Major Resistance Levels – $2.10 and $2.120.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57117087,
    "published": 1768278838000,
    "title": "Eric Adams' NYC Token Crashes Amid Liquidity Extraction Allegations",
    "body": "On-chain data shows unexplained liquidity withdrawals as Eric Adam’s NYC token’s market cap continues to bleed.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57117582,
    "published": 1768280411000,
    "title": "Coinbase Mulls Exiting Support For Crypto Market Structure Bill Ahead Of January 15 Deadline",
    "body": "As the January 15 markup of the crypto market structure bill—known as the CLARITY Act—draws closer, reports indicate that Coinbase (COIN) is reconsidering its support for the legislation. A Monday report from Bloomberg suggests this shift in position is contingent on whether the anticipated bill includes provisions beyond enhanced disclosure requirements tied to stablecoin rewards. High Stakes For Coinbase The CLARITY Act is expected to be marked up in at least one Senate committee this Thursday, and Coinbase’s potential withdrawal could have significant implications for the bill. A source familiar with Coinbase’s stance told Bloomberg that the exchange would re-evaluate its support if the legislation veers too far from its interests, particularly regarding stablecoin incentives. Some insiders suggest the bill might restrict the ability to provide rewards to regulated financial institutions, a move that aligns with the banking sector’s concerns about losing deposits to crypto platforms. Related Reading: Dogecoin Breaks Its ‘Lower-Band Prison’ As Daily Trend Flips Coinbase currently holds applications for a national trust charter that could permit it to offer those kinds of rewards under regulatory rules. However, many crypto-native firms are pushing back against potential restrictions, arguing that such measures could disrupt competition in the market. The stakes for Coinbase are high, as rewards programs play a crucial role in its business model. The exchange allows users to earn 3.5% rewards on Circle’s USDC holdings. Should the market-structure bill include bans on these incentives, fewer users might choose to hold stablecoins on the platform. This could jeopardize an anticipated revenue stream projected at $1.3 billion in 2025, according to Bloomberg. Banking Vs. Crypto The GENIUS Act, passed into law in July of last year, prohibits stablecoin issuers from offering interest on token holdings, and does not prevent third-party partners like Coinbase from providing rewards tied to customer balances. The banking industry, however, argues that allowing exchanges to pay such rewards could negatively impact bank deposits and, consequently, community lending. As reported by Bitcoinist over the past month, the American Bankers Association (ABA) has voiced concerns that this situation could displace “billions” from local lending, allegedly harming small businesses and households. In contrast, Faryar Shirzad, Coinbase’s chief policy officer, has argued that maintaining rewards tied to stablecoins is crucial for preserving the dollar’s dominance, especially in light of China’s announcement to start offering interest on its digital yuan. Banking Lobby Fights Back A potential compromise being discussed would permit only licensed banking entities or financial institutions to provide rewards on stablecoin balances. Related Reading: Why The $2.9 Billion Bitcoin Whale Buy Could Spell Doom For The Market Recently, five crypto firms, including Ripple, Circle, and Paxos, received conditional approvals from the US Office of the Comptroller of the Currency (OCC) to become national trust banks, a move met with opposition from the banking lobby. If restrictions are indeed imposed, the report suggests that this could lead to creative workarounds as crypto firms seek alternative ways to reward customers. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Coinbase|CLARITY Act|coin|coinbase|Coinbase (COIN)|coinbase news|crypto bill|crypto legislation|crypto market|Crypto Market Structure Bill|crypto news|cryptocurrency|US crypto regulation",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57117754,
    "published": 1768280926000,
    "title": "Dogecoin (DOGE) Edges Into a Decisive Zone, Traders on High Alert",
    "body": "Dogecoin started a fresh decline below the $0.1450 zone against the US Dollar. DOGE is now consolidating losses and might face hurdles near $0.140. DOGE price started a fresh decline below the $0.1420 level. The price is trading below the $0.140 level and the 100-hourly simple moving average. There is a key declining channel forming with resistance at $0.1395 on the hourly chart of the DOGE/USD pair (data source from Kraken). The price could extend losses if it stays below $0.1400 and $0.1420. Dogecoin Price Dips Again Dogecoin price started a fresh decline after it closed below $0.1500, like Bitcoin and Ethereum . DOGE declined below the $0.1450 and $0.1420 support levels. The price even traded below $0.140. A low was formed near $0.1348, and the price is now showing bearish signs. It is consolidating below the 23.6% Fib retracement level of the downward move from the $0.1539 swing high to the $0.1348 low. Dogecoin price is now trading below the $0.140 level and the 100-hourly simple moving average. If there is a recovery wave, immediate resistance on the upside is near the $0.1390 level. The first major resistance for the bulls could be near the $0.140 level. There is also a key declining channel forming with resistance at $0.1395 on the hourly chart of the DOGE/USD pair. The next major resistance is near the $0.1420 level. A close above the $0.1420 resistance might send the price toward the $0.1445 resistance or the 50% Fib retracement level of the downward move from the $0.1539 swing high to the $0.1348 low. Any more gains might send the price toward the $0.150 level. The next major stop for the bulls might be $0.1540. More Losses In DOGE? If DOGE’s price fails to climb above the $0.1400 level, it could continue to move down. Initial support on the downside is near the $0.1350 level. The next major support is near the $0.1320 level. The main support sits at $0.1280. If there is a downside break below the $0.1280 support, the price could decline further. In the stated case, the price might slide toward the $0.120 level or even $0.1180 in the near term. Technical Indicators Hourly MACD – The MACD for DOGE/USD is now gaining momentum in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for DOGE/USD is now above the 50 level. Major Support Levels – $0.1350 and $0.1320. Major Resistance Levels – $0.1400 and $0.1420.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "DOGE|DOGE news|Doge price|DOGE USD|DOGE/BTC|DOGE/USDT|Dogecoin|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57117971,
    "published": 1768281438000,
    "title": "Banks’ stablecoin concerns are ‘unsubstantiated myths‘: Professor",
    "body": "A Columbia Business School professor debunked five banking industry misunderstandings about stablecoin yields as the market structure bill heads for markups this month.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57118481,
    "published": 1768282622000,
    "title": "Senate Panel Releases Crypto Bill Allowing Stablecoin Rewards",
    "body": "Many digital-asset companies would continue to be able to offer rewards to customers who hold stablecoins under a new proposal tied to hotly-anticipated crypto market structure legislation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57118278,
    "published": 1768282502000,
    "title": "Court temporarily stops Tennessee from taking action against Kalshi",
    "body": "Kalshi is free to continue operating in Tennessee for now, as a federal judge blocked state regulators from taking action after the prediction market sued.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57118238,
    "published": 1768282346000,
    "title": "SEC boss bullish Trump will sign market structure bill this year",
    "body": "Securities and Exchange Commission chair Paul Atkins voiced strong support for the bipartisan legislation aimed at moving crypto markets out of a regulatory gray zone.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57118249,
    "published": 1768282048000,
    "title": "Former 'bitcoin mayor' Eric Adams faces $3 million rugpull allegation after issuing NYC Token",
    "body": "On-chain data revealed that a wallet linked to the token's deployer removed $2.5 million in liquidity, prompting accusations of a possible rug pull.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 57118737,
    "published": 1768284012000,
    "title": "Monero (XMR) Hits New $610 All-Time High – Veteran Trader Shares Silver-Like Setup",
    "body": "Monero (XMR) is leading the crypto market bounce by breaking out of a macro resistance level and breaching above the $600 barrier for the first time. A legendary trader has suggested that the cryptocurrency is mirroring silver’s historical breakout and could see a massive price discovery rally. Related Reading: Bitcoin Tops $92,000 As DOJ Subpoenas Escalate Trump-Powell Fight Monero Soars To New Highs On Monday, Monero outperformed the rest of the market, surging nearly 21% toward its new all-time high of $611.01. The privacy-focused cryptocurrency has been leading the start-of-year market rally, experiencing a 43% increase over the past seven days. XMR’s rally has been fueled by renewed interest in privacy tokens and redirected liquidity toward the project, which has driven its market capitalization to $10 billion for the first time. Amid this performance, veteran trader Peter Brandt drew a parallel between Monero and Silver’s long-term charts, suggesting that the cryptocurrency could be near a massive breakout. In an X post, Brandt compared Monero’s current rally to silver’s historical breakout, which led to a massive run toward new highs. Silver saw a multi-decade price setup in which its price accumulated below and retested a macro ascending resistance trendline. According to the chart, its price formed its long-term resistance during its 2011 peak, when it reached a slightly higher ATH of $49.83 before correcting. During its Q4 2025 rally, silver finally broke above this key level, nearly doubling its price toward its latest ATH of $86.23. Similarly, Monero has been forming its multi-year ascending trendline in the monthly timeframe since its 2017 high. In 2021, the cryptocurrency retested this area, also hitting a slightly higher ATH before retracing. Now, XMR has broken out of its ascending resistance and could see a similar path to silver’s recent breakout into price discovery, the post suggested. XMR to See 50% Breakout Or Breakdown Next? Market observer TraderSZ recently shared an optimistic outlook for Monero once it broke through its crucial resistance area and turned this level into support. To the trader, the cryptocurrency could reach three main price targets if momentum continues. Per the post, the initial breakout level could reach the $685 area, a more than 30% rally from the resistance level. Moreover, it could surge between 50% and 80% toward the $790 and $900 levels, like silver’s recent price discovery progression in the monthly chart. Analyst 0xMarioNawfal also highlighted XMR’s performance as “price continues to trend aggressively higher, breaking through previous resistance levels with strong momentum and minimal pullback.” To him, the structure remains bullish, with buyers stepping in and “no clear signs of distribution yet.” As a result, he forecasted potential volatility but added that as long as the price holds above recent breakout levels, the trend will remain intact. Related Reading: Solana Price Jumps, But Network Adoption Remains Weak Nonetheless, Ali Martinez posted a more concerning forecast for the cryptocurrency, suggesting that a significant correction may be around the corner. According to the chart, Monero has been forming a multi-year rising wedge pattern since 2017, with the price bouncing between the upper and lower boundaries. Based on this, XMR could likely fail to turn the macro resistance into support and begin a long-term 50% decline toward the $300 area, where the pattern’s lower boundary is currently located. As of this writing, Monero is trading at $597, a 47.5% increase in the monthly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto analyst|Crypto trader|monero|Monero ATH|Peter Brandt|privacy tokens|silver|XMR|XMR ATH|XMR breakout|xmrusdt|ZCash",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 57,
        "NAME": "XMR",
        "CATEGORY": "XMR"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57116371,
    "published": 1768276759000,
    "title": "Stablecoin-rewards compromise, DeFi protections lead new Senate market structure bill",
    "body": "A new draft of the Senate's legislation shows the bill has a compromise on stablecoin rewards and some protections for decentralized finance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Market Structure Legislation|Breaking News|Senate Banking Committee|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57120009,
    "published": 1768287627000,
    "title": "Bitcoin HODLer Selloff Ending? LTH Outflows Decline",
    "body": "On-chain data shows the Bitcoin long-term holder outflows have been declining recently, a potential sign that selling pressure may be fading. Bitcoin Long-Term Holder Netflow Is Getting Less Negative In a new post on X, on-chain analytics firm Glassnode has talked about the latest trend in the netflow associated with the Bitcoin long-term holders (LTHs). The LTHs refer to BTC investors who have been holding onto their coins for a period longer than 155 days. Related Reading: Solana Price Jumps, But Network Adoption Remains Weak Statistically, the longer an investor holds onto their coins, the less likely they become to sell them at any point. As such, the LTHs with their long holding time are considered to include the resolute hands of the market. Though, while these HODLers tend to be patient, they have shown several phases of distribution during the last couple of years. Below is the chart shared by Glassnode that shows the trend in the monthly netflow of the Bitcoin LTHs. As is visible in the graph, the Bitcoin LTHs observed streaks of net outflows during both the bull rallies of 2024, suggesting that the diamond hands of the market participated in profit-taking. A short phase of distribution also appeared in mid-2025, indicating that the LTHs were doing yet another wave of profit realization. This selling was followed by a brief period of net inflows for the cohort, which was then followed by another wave of distribution in late 2025. This last phase of distribution is still ongoing, as the monthly netflow associated with the LTHs remains negative. The latest selloff has been a bit different from the last three, however, as it has occurred alongside bearish momentum in the cryptocurrency, not a price jump. While the distribution has continued, its intensity has been dropping lately as the netflow of the Bitcoin LTHs has been becoming less negative. As the analytics firm explains: Net outflows have rolled over from extreme levels, indicating that the market is progressively absorbing long-held supply and that a large portion of overhead supply may now be largely worked through. The decline in net outflows has come alongside a drop in the Realized Profit of the group, as Glassnode has pointed out in another X post. The Realized Profit here is an indicator that measures the total amount of profit that LTHs are realizing through their transactions. From the chart, it’s apparent that the profit-taking from the cohort was elevated earlier, but recently, the Realized Profit has dropped to a low level. Related Reading: Bitcoin Risks Drop To $69,000 If Pennant Support Breaks, Analyst Warns The analytics firm noted: Such conditions are often associated with heightened uncertainty and tend to emerge during mid-bull market pauses or the early stages of deeper bear markets. BTC Price At the time of writing, Bitcoin is floating around $91,800, down almost 3% in the last seven days. Featured image from Dall-E, Glassnode.com, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin hodlers|Bitcoin long-term holders|Bitcoin LTHs|bitcoin selloff|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57121279,
    "published": 1768291200000,
    "title": "21Shares' bitcoin and gold exchange-traded product debuts on London Stock Exchange",
    "body": "The ETP offers physically backed exposure to bitcoin and gold in a single investment vehicle.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Gold|Bitcoin Gold|21 shares|ETFs|UK|London Stock Exchange|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57121874,
    "published": 1768293055000,
    "title": "Standard Chartered Sees Ethereum At $40,000 By 2030, Cuts 2026 Target",
    "body": "Standard Chartered has set a new long-range target of $40,000 for Ethereum (ETH) by end-2030, while cutting its end-2026 forecast sharply, arguing that Ethereum’s relative setup is improving even as Bitcoin-led weakness has weighed on absolute crypto price targets. In a research note, the bank’s digital assets analyst Geoff Kendrick framed 2026 as a potential inflection point for Ethereum versus bitcoin, despite revising down its medium-term ETH-USD path. “We think ETH’s prospects have improved. We therefore expect the cross to gradually return to its 2021 highs,” Kendrick wrote, pointing to a rebound in the ETH/BTC relationship as the core expression of his thesis. Standard Chartered Recasts Ethereum Outlook Standard Chartered now expects ether to end 2026 at $7,500, down from its prior $12,000 estimate, before rising to $15,000 in 2027 (cut from $18,000) and $22,000 in 2028 (cut from $25,000), with $30,000 penciled in for 2029 (raised from $25,000) and $40,000 by end-2030. Related Reading: This Ethereum Triangle Breakout Puts Price Above $24,000, Here’s The Path “I think 2026 will be the year of Ethereum, much like 2021 was,” Kendrick writes. The bank attributes the near-term markdown to Bitcoin’s drag on dollar-denominated crypto performance, with Kendrick noting that weaker BTC action has “weighed on the outlook for digital assets priced in dollars,” forcing lower absolute targets through 2028 even as Ethereum’s relative fundamentals strengthen. Kendrick highlighted a set of Ethereum-specific supports that, in his view, are more likely to show up in relative performance than in immediate spot-price upside. He pointed to continued accumulation by Bitmine Immersion Technologies, which the note described as the largest Ethereum-focused digital asset treasury company, at a time when ETF inflows have “temporarily stalled” and broader corporate treasury buying has cooled. Related Reading: Ethereum Long-Term Cost Basis Holds Firm: Structural Floor Forms Near $2.8K He also cited Ethereum’s centrality to stablecoins, tokenized real-world assets, and DeFi as structural demand drivers, and emphasized execution on plans to increase Ethereum layer-1 throughput by roughly 10x over the next two to three years. “Analysis shows that higher throughput translates into higher market cap,” Kendrick wrote. Regulation was flagged as a further potential tailwind. Kendrick pointed to the US CLARITY Act as a development that could be supportive for the sector and “particularly ETH” if it helps unlock another phase of DeFi activity. The US Senate is due to review the bill on Jan. 15 with possible passage in Q1. For traders, the framework implies that Standard Chartered’s highest-conviction expression is less about pinning an exact ETH-USD level in the next 12 months and more about whether Ethereum can reclaim relative ground versus bitcoin as throughput, stablecoin-heavy activity, and policy clarity compound into 2026 and beyond. At press time, ETH traded at $3,126. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57121755,
    "published": 1768292435000,
    "title": "New Senate CLARITY Act draft allows activity-based stablecoin rewards",
    "body": "A revised Senate CLARITY Act draft would allow activity-based stablecoin rewards tied to payments, wallets, and staking, while barring interest paid solely for holding tokens.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 57123151,
    "published": 1768296564000,
    "title": "Kraken-linked SPAC files for $250M IPO targeting crypto infrastructure",
    "body": "The Kraken-backed SPAC aims to raise $250 million in an IPO, targeting companies building infrastructure and services for the digital asset ecosystem.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57122914,
    "published": 1768295910000,
    "title": "Solana Policy Institute urges SEC to exempt DeFi developers from exchange rules",
    "body": "The Solana Policy Institute urged the SEC to distinguish non-custodial DeFi code from exchanges, warning that current rules could chill innovation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57123185,
    "published": 1768296716000,
    "title": "Another Day, Another Crypto Wrench Attack in France",
    "body": "Armed robberies targeting crypto investors have surged, with criminals using kidnapping and home invasions to steal digital assets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57123166,
    "published": 1768296611000,
    "title": "Crypto Market Structure Bill Poised For A Trump Signature, SEC Chief Says",
    "body": "US Securities and Exchange Commission Chair Paul Atkins is confident that a long-awaited crypto market structure bill could find its way into US President Donald Trump’s office for signature before the end of the year. The SEC chief highlighted ongoing efforts during an interview with Fox Business to clarify rules around digital asset trading and said the bill could provide much-needed guidance to investors and trading platforms. Related Reading: Crypto Products Post $454M Weekly Outflows On Fed Jitters Atkins Expresses Confidence Atkins, who was confirmed by the Senate in April 2025 in a 52-44 vote, said tokenization and faster settlement systems are part of the next phase for US markets. He argued that a market structure law would give firms and investors clearer signals about which rules apply to trading in digital assets. Reports have disclosed that the chair sees the bill as fitting the administration’s push to make the US more competitive in crypto. This is a big week for crypto – Congress is on the cusp of upgrading our financial markets for the 21st century. I am wholly supportive of Congress providing clarity on the jurisdictional split between the SEC and the @CFTC. pic.twitter.com/NtDWRW85kL — Paul Atkins (@SECPaulSAtkins) January 12, 2026 Atkins discussed the regulatory forecast for crypto this year during an interview with Fox Business. Source: Paul Atkins Lawmakers’ Calendar And Odds Based on reports from financial analysts, the path to passage is not guaranteed. One market note put the chance of the bill clearing Congress in 2026 at roughly 50-60%, and warned that delays could push final action into 2027. Other analysts have suggested a longer road, saying implementation of final market structure rules might not be settled for years if political dynamics change. What Is Being Negotiated The draft measures under discussion aim to define which federal agency supervises different types of digital instruments, establish standards for trading venues that list tokens, and create clearer reporting rules for market participants. Reports have disclosed that committee markups are expected before any Senate floor vote, and those sessions will shape the bill’s final text. Industry Reaction, Market Talk The optimism expressed by Atkins has been welcomed by industry associations, as they see that clear guidance could lead to more institutional capital flowing into the onshore crypto trading space. On the other hand, the sentiment from many companies is that there is still a level of caution surrounding future regulations. Although regulators continue to show a level of agreement regarding overall regulation, the details of custody, custody provider(s), and oversight split between various regulatory agencies must be agreed upon by Congress before any definitive progress can be made. This back-and-forth between Congress and regulatory agencies has caused the markets to react in a pattern of quick positive movements followed by corresponding negative movements due to legislative inaction. Related Reading: CZ Fuels Optimism As Binance Coin’s $1,000 Target Trends Political Timing Could Matter The midterm and committee calendars are being watched closely. If the Senate delays key votes, support that exists now could wane or be reshaped by other priorities. Some commentators argue that fast action would lock in regulatory clarity; others say a rushed law could leave gaps that require later fixes. The debate over speed versus detail is active in Washington. Featured image from Gemini, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto|digital currency|Paul Atkins|sec|Stablecoins",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57124039,
    "published": 1768299183000,
    "title": "Banks Win Key Battle as Crypto Bill Bars Stablecoin Interest Payments",
    "body": "An updated Senate draft of the market structure bill prohibits yield \"solely in connection with the holding of a payment stablecoin.\"",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 57124158,
    "published": 1768299316000,
    "title": "Ukraine blocks Polymarket in wider online gambling crackdown",
    "body": "Polymarket is already restricted in 33 countries.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Ukraine|Polymarket|Gambling|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57124976,
    "published": 1768302011000,
    "title": "Bitcoin Could Be Entering A Supercycle, Fidelity Warns",
    "body": "Fidelity Labs managing partner Parth Gargava says bitcoin may be transitioning away from its familiar, halving-linked four-year rhythm and into something closer to a “supercycle”, a regime that could keep prices elevated for longer and make drawdowns less severe, if structural demand continues to build. Speaking in Fidelity’s Jan. 9 crypto outlook for 2026 video, Gargava anchored the discussion in the cycle framework many market participants have used for years: peaks arriving roughly a year and a half after each halving. “Traditionally, what we have seen is Bitcoin has had this four-year cycle,” he said, adding that the pattern has been “highly correlated to Bitcoin’s halving events.” He pointed to the 2016 halving followed by a peak in December 2017 near $20,000, and the 2020 halving followed by another peak in 2021 about 18 months later. That history matters because it frames the debate around the most recent halving in April 2024. Gargava acknowledged the straightforward inference some investors make from prior cycles: “So maybe we are past that peak price.” But he positioned that view as only one side of the argument, highlighting a competing thesis that the market’s structure is evolving. Related Reading: Bitcoin HODLer Selloff Ending? LTH Outflows Decline “On the other side, you’re also seeing a lot of arguments around how we might have entered into a supercycle as opposed to what we have seen in the past four years,” Gargava said. “And what a super cycle really means is you might have more prolonged highs, longer highs, and shallower dips.” Gargava credited Fidelity Digital Assets’ research team for outlining what he called the “super cycle mechanism,” and suggested an analogy to the commodities market in the 2000s. The key point was not that bitcoin would mechanically copy commodities, but that a sustained, multi-year bid can alter how markets behave, extending expansions and compressing the depth of selloffs. JUST IN: $5 trillion Fidelity talks about how #Bitcoin might have entered a “supercycle” Bullish 🚀 pic.twitter.com/IUv3GVHwEW — Bitcoin Magazine (@BitcoinMagazine) January 12, 2026 Three Forces That Could Push Bitcoin Into A Supercycle He outlined three drivers he believes could underpin that kind of regime shift. First is “steady buy-in by institutions focused on ETFs,” which Gargava framed as persistent demand rather than episodic speculative bursts. In his telling, ETFs can function as a channel that keeps incremental capital flowing even when sentiment softens, potentially changing the market’s typical post-peak unwind. Related Reading: Bitcoin Tops $92,000 As DOJ Subpoenas Escalate Trump-Powell Fight Second is policy. Gargava pointed to “pro-crypto policies” in the US as a supportive backdrop, implying that a friendlier regulatory stance could reduce headline risk and encourage broader participation from investors and intermediaries that previously stayed on the sidelines. Third is market maturation and changing correlations. “We’re also seeing how the crypto market as a whole is maturing and deviating from the S&P 500 and precious metals,” he said. The implication is that bitcoin’s trading behavior may be becoming less captive to traditional risk-asset moves and the simple “digital gold” narrative, an evolution that could matter for positioning, hedging, and macro sensitivity. Notably, Gargava did not claim the four-year cycle is definitively broken. Instead, he presented a live question for 2026: whether bitcoin continues to follow a post-halving path that culminates in a familiar, sharp boom-and-bust pattern, or whether structural forces: ETF-driven institutional demand, a more supportive US policy tone, and a maturing market profile support a longer, steadier expansion with “shallower dips.” At press time, Bitcoin traded at $92,182. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|Bitcoin Supercycle|btc|BTC news|btc price|fidelity",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57125875,
    "published": 1768304306000,
    "title": "Truebit exploit exposes smart contract flaw behind $26M token mint",
    "body": "Truebit lost $26 million after a smart contract overflow bug let an attacker mint tokens at near-zero cost, sending the TRU price down 99%.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 57125766,
    "published": 1768304023000,
    "title": "Ukraine blocks Polymarket, classifies prediction markets as gambling",
    "body": "The move adds Ukraine to a growing list of countries, including France, Germany, the UK, Italy, Poland, Thailand and Australia, where Polymarket is already restricted.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57126291,
    "published": 1768305659000,
    "title": "Top Bullish Predictions That Put XRP Price At New All-Time Highs Above $3.8",
    "body": "XRP is trading at around $2.06 on January 13, 2026, leaving its price action a full step below the zone that capped its last rally that ended with a high of $3.65 in July 2025. However, predictions that point to XRP reclaiming that peak and then pushing into new highs above $3.8, have been on the front page of bank research notes and trader-led chart projections. Notably, various technical analyses have suggested that XRP is programmed to return back into the upper-$3s and into new price territories this year. Standard Chartered’s XRP Target Clears $3.8 XRP’s all-time high price now looks out of reach, especially considering the cryptocurrency is now struggling to leave $2 behind. At the time of writing, XRP has dropped by about 44% from its July 2025 peak of $3.65, but institutional buys from Spot XRP ETFs are still giving glimmers of hope. Related Reading: XRP Back At The Edge: Will Breaking $2 Barrier Rewrite Its History? One of the most recently notable institutional-style projections from XRP comes from Standard Chartered’s digital assets research, which lays out a multi-year path that sees XRP breaking well above the $3.8 threshold. According to analysts at the bank, XRP is slated to reach as high as $8 by the end of 2026, a level that comfortably eclipses the previous peak and implies roughly 300% upside from current levels if certain conditions hold. Interestingly, this outlook came from Geoffrey Kendrick, Standard Chartered’s Global Head of Digital Assets Research. The prediction was made based on an outlook of continued institutional adoption and strong inflows into XRP-based spot ETFs. Technical Outlooks As Ripple Heads Into A Consequential 2026 Recent technical commentary from multiple analysts has converged on a bullish bias for XRP. For instance, XRP analyst EGRAG CRYPTO pointed out a developing breakout retest structure on the monthly candlestick timeframe. According to the analyst, historical probabilities favor upside as long as XRP holds above the $1.60 to $1.40 range on higher timeframes, with long-term channel projections placing the XRP price as high as $22. For a shorter-term perspective, Crypto Feras described XRP’s recent break above $2 as a bullish reversal signal. His analysis points to $2.67 and $3.01 as the next resistance levels, areas that could open the path toward a full retest of the prior peak near $3.8 if cleared. Adding to this, ChartNerd noted that XRP’s long-term upside fractal structure is still valid despite the recent XRP price correction. Related Reading: Analyst Updates XRP Price Prediction: Why $16 Is Still On The Table These price projections are being viewed more favorably against the backdrop of Ripple’s momentum heading into the year. Ripple CEO Brad Garlinghouse recently pointed to strong progress in 2025 with examples of major acquisitions of Ripple Prime and GTreasury and a growing global licensing footprint. Now that Ripple is positioning itself for what its leadership has described as a consequential 2026, the combination of technical outlooks and company fundamentals has strengthened the narrative that XRP could be approaching a move to new all-time highs. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|Brad Garlinghouse|ChartNerd|Egrag Crypto|Feras|Geoffrey Kendrick|GTreasury|Ripple|Ripple Prime|Spot XRP ETFs|Standard Chartered|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57126910,
    "published": 1768307400000,
    "title": "ClearBank taps crypto custody firm Taurus to power stablecoin services",
    "body": "The U.K. clearing bank has selected Taurus' wallet infrastructure as it expands into digital assets and stablecoin-based payments.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|ClearBank|Taurus|Crypto Custody|Stablecoins|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57126786,
    "published": 1768306755000,
    "title": "BNB Chain targets ‘around one second’ finality with Fermi hard fork",
    "body": "BNB Chain’s Fermi hard fork goes live on Wednesday, cutting BSC block times from 0.75 seconds to 0.45 seconds and tightening fast-finality rules.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 206,
        "NAME": "FORKS",
        "CATEGORY": "FORKS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]