[
  {
    "id": 54882369,
    "published": 1764080398000,
    "title": "South Korea stablecoin framework stalls as regulators split over banks’ role",
    "body": "Regulators and the Bank of Korea remain at odds over bank dominance in issuing won-backed stablecoins, stalling a long-awaited framework expected this year.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 54882541,
    "published": 1764087484000,
    "title": "Why Bitcoin Is Underperforming Equities Despite Bullish Catalysts",
    "body": "Gains in AI-fueled stocks and heavy crypto leverage have widened the gap between bitcoin and equities.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54882537,
    "published": 1764087264000,
    "title": "Polymarket Secures CFTC Approval for Regulated U.S. Return",
    "body": "Polymarket’s amended CFTC designation paves the way for the prediction-market platform to formally reopen in the U.S. with a fully regulated exchange structure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Polymarket|Prediction Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      }
    ]
  },
  {
    "id": 54882644,
    "published": 1764086773000,
    "title": "MoonPay secures New York trust charter, expands regulated services",
    "body": "The regulatory approval followed the payments company obtaining a BitLicense from the NYDFS in June, making it one of a handful of crypto companies to have both.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54882564,
    "published": 1764086417000,
    "title": "XRP Has Just Flashed ‘The Real Signal’, Analyst Reveals Where Price Is Headed",
    "body": "The XRP price is showing signs of recovery after crashing under $2 earlier last week due to broader market volatility and decline. With its renewed momentum, analysts are now sharing optimistic projections about its future trajectory. New reports from market expert, Egrag Crypto, highlight the reappearance of a crucial technical signal that could trigger a major trend reversal for XRP. Based on the formation of this signal, XRP may be positioning for an explosive price surge that contradicts the previous bearish developments. XRP Price Chart Forms Bullish EMA Cross Signal Egrag Crypto has described the cross between two key Exponential Moving Averages (EMA) as “the real signal.” In his X post shared on Monday, he presented an in-depth review of XRP’s 3-day chart, focusing on the interaction between the 50-day and 200-day EMA and predicting how this technical signal could impact the cryptocurrency’s future price action. Related Reading: Attack On Cardano Founder Leads To Network Halt, What Really Happened? Egrag Crypto emphasized that many traders have interpreted the narrowing distance between these two key EMAs as the early stages of a bear market. However, his analysis shows that this interpretation does not match the XRP’s technical structure. For a genuine bearish cross to confirm a downward trend, XRP’s price would need to fall decisively below both EMAs as overall momentum begins to weaken. Currently, XRP sits above the 200 EMA, with the long-term trend line still rising, indicating underlying strength rather than a classic bear market setup. This suggests the cryptocurrency may be gradually building momentum to break out of its ongoing downtrend and move to higher levels. Egrag Crypto’s chart shows that XRP’s present structure contrasts sharply with its 2018 setup. During that cycle, XRP’s price had collapsed long before the two EMAs crossed, implying that the bearish crossover signal was more of a confirmation than the cause of the weakness. Based on the chart analysis, XRP’s present market structure lacks the characteristics of this historical event, suggesting that the cryptocurrency may be holding firm at levels that could yield more bullish outcomes than before. Where The XRP Price Is Headed Continuing his analysis, Egrag Crypto explained that the latest XRP chart setup looks more like the structures seen before its historic bull rallies in 2017 and early 2021. During those bullish cycles, the 500/200 EMAs had tightened, and XRP had remained above the 200 EMA. Related Reading: Will The Low XRP Price Force Ripple To Dump Its Holdings? Exec Answers Community Egrag Crypto noted that the market also entered a compression phase in both years, leading to sharp increases in volatility and explosive price surges. According to the analyst, each time XRP emerged from these conditions, it produced some of its most aggressive vertical moves. Notably, XRP’s current price chart reflects similar patterns. Egrag Crypto has said the cryptocurrency may be experiencing “late-cycle consolidation” rather than the beginning of a prolonged downtrend. Compression phases of this type often indicate that momentum is building beneath the surface. Based on its structure, the analyst has predicted that the XRP price is likely to head toward its final upside leg rather than a completed top. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|analyst|crypto|crypto analyst|crypto news|Ripple|ripple news|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54882534,
    "published": 1764085983000,
    "title": "MoonPay Secures New York Trust Charter, Expands Institutional Crypto Services",
    "body": "The crypto payments firm joins an elite group with both a BitLicense and Trust Charter, gaining legal authority to custody assets and offer OTC trading under NYDFS oversight.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|MoonPay|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54882532,
    "published": 1764084179000,
    "title": "Paxos Acquires Crypto Wallet Startup Fordefi to Expand Custody Services",
    "body": "The move aims to position Paxos to serve growing institutional demand for on-chain asset issuance and stablecoin payments.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Paxos|Crypto Wallets|Custody|acquisition|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54882529,
    "published": 1764083286000,
    "title": "Polkadot Slides 4% as Technical Resistance Triggers Selloff",
    "body": "The altcoin carved out a $0.21 trading range, marking 9% intraday volatility as bearish forces gained control.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Polkadot|Technical Analysis",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 21,
        "NAME": "DOT",
        "CATEGORY": "DOT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54882559,
    "published": 1764082806000,
    "title": "Why Has The Solana Price Been Crashing Since October? This Major SOL Player Is Selling",
    "body": "On-chain analytics platform Lookonchain has provided insights into what may have contributed to the Solana price crash since October. The platform revealed that meme coin launchpad Pump.fun has sold a significant amount of SOL, cashing out almost $500 million since the start of October. Pump.fun Allegedly Dumps SOL Amid Solana Price Crash In an X post, Lookonchain suggested that Pump.fun has been selling SOL, as it appears that the meme coin launchpad has cashed out at least 436.5 million USDC since October 15. The on-chain analytics platform also stated that since October 15, the meme coin launchpad has deposited 436.5 million USDC into Kraken. Related Reading: Forget XRP, DFDV Exec Predicts Solana Price Is Headed For $10,000 Furthermore, Lookonchain revealed that between May 19, 2024, and August 12, 2025, Pump.fun sold a total of 4.19 million SOL ($757 million) at an average price of $181. Of that amount, 264,373 SOL was sold on-chain for $41.64 million, while 3.93 million SOL ($715.5 million) was deposited into Kraken. Pump.fun’s SOL sales are known to put significant selling pressure on the Solana price, thereby contributing to its crash. Notably, the Solana price has recorded one of the largest losses during this recent crypto market downtrend. SOL crashed from a high of around $220 in October to a low of $120 this month. This has occurred despite the launch of six spot Solana ETFs during this period. Bitwise, Grayscale, Fidelity, 21Shares, VanEck, and Canary have all launched their SOL funds and have recorded notable flows since launch. SoSo Value data shows that these funds have recorded cumulative net inflows of $568.24 million since their respective listings. Despite this, the Solana price has been in a downtrend amid significant selling pressure from SOL whales. Thanks to the crash, SOL is now down over 28% year-to-date (YTD). The altcoin is also down over 28% in the last 30 days. Pump.fun Denies Recent SOL Sales A Pump.fun spokesperson, Sapijiju, has indicated that they haven’t sold any SOL recently and haven’t contributed to the Solana price crash. In an X post, he described Lookonchain’s post as complete misinformation, as they haven’t cashed any sum. He claimed they were not involved in the transactions between Kraken and Circle that the on-chain analytics platform referenced. Related Reading: Institutions Have Been Buying Solana Every Day For 2 Weeks, Is $300 Possible? Lookonchain had claimed that during the same period, Pump.fun allegedly cashed out 436.5 million USDC, 537.6 million USDC was sent from Kraken to Circle. Meanwhile, regarding the 436.5 million USDC, Sapijiju stated that what is happening is part of their treasury management, with the USDC part of funds from the PUMP ICO, and with plans to reinvest the sum into the business. At the time of writing, the Solana price is trading at around $138, up almost 4% in the last 24 hours, according to data from CoinMarketCap. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Solana|21Shares|bitwise|Canary|circle|CoinMarketCap|fidelity|grayscale|kraken|Lookonchain|meme coin|PUMP ICO|Pump.Fun|Sapijiju|Sol|SOL news|SOL Price|Solana news|Solana Price|SOLUSD|SOLUSDT|SoSoValue|USDC|VanEck|Year-To-Date|YTD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54883193,
    "published": 1764089205000,
    "title": "BONK Breaks Through Overhead Resistance as Volume Jumps 85% Above Average",
    "body": "Increased trading volume carried BONK through a major resistance threshold before late pullbacks shaped a new support band.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Technical Analysis|Bonk|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 113,
        "NAME": "BONK",
        "CATEGORY": "BONK"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54883710,
    "published": 1764090031000,
    "title": "How High Can XRP Still Go This Cycle? Chartist Says $8 Possible",
    "body": "XRP traders are once again arguing about upside targets after popular chartist Charting Guy reposted a bullish long-term setup and doubled down on his call that XRP can still reach $8 this cycle. “XRP still going to $8, idc,” he wrote on X in the early hours of Nov. 25, alongside a weekly XRP/USD chart from Bitstamp. XRP Price Still Has Room To Run At the time of the screenshot, XRP was trading around $2.25, up roughly 9.8% on the week, with the chart plotting an Elliott Wave structure from early 2023 into a projected peak in 2026. The analysis is built on a dense Fibonacci framework spanning from about $0.25 to a 1.272 extension at $8.29661, which anchors his upside target. The green wave count shows a classic five-wave impulse. Wave 1 launches from the post-bear-market base into the 0.618 Fibonacci level near $0.915, where the first leg tops out. Wave 2 then retraces for 51 weekly bars (357 days), bottoming just above the 0.382 retracement at $0.41315. Related Reading: XRP Real Purpose: Documentation Shows Payment Utility Contrary To Viral Claims — Details Wave 3 is drawn as a steep rally off that base, blasting through all mid-range Fibonacci bands and extending beyond the 1.0 level at $3.31700. In the replies, one user suggested the spike to around $3.65 had already completed the fifth wave; Charting Guy rejected that outright: “it wasn’t… was very clearly a B wave.” From that high, the chart records a year-long consolidation labelled as Wave 4, annotated as 50 weekly bars (350 days). Price fluctuates between roughly the mid-$2 area and above $3. The Wave-4 low holds above the 0.786 Fibonacci support at $1.61246, never revisiting the $1 region. From this consolidation, the projected Wave 5 shoots higher from around the $2–$2.30 zone—where XRP is currently trading—toward the 1.272 extension at $8.29661. The “5” marker sits at this level, and the projection shows only a modest pullback after touching the band, implying that this area is treated as the probable cycle cap. Related Reading: XRP Hits Exact Bull Target as Top Traders Celebrate Perfect Market Call The Fibonacci grid also frames the current battle zone. XRP’s price is oscillating around the 0.888 level at $2.27404, which lines up almost exactly with the latest weekly close, while the prior wave-3 region around $3.317 remains the next major resistance band on the chart. Not everyone is convinced. “Could still go under 1.50. Still,” wrote another user. Charting Guy’s response was curt: “no.” That stance matches the technical layout: in his count, the $1.61 area has already printed the Wave-4 low, and the structure does not include another trip below that support. Others pushed for higher numbers. “Was hoping for $20+,” one follower admitted. “could happen,” the analyst replied—before clarifying to another user that “$20 is not on track but still entirely possible.” His published chart, however, draws no path beyond the $8.29 extension, underlining that mid-single-digit territory remains his primary target for this cycle. At press time, XRP traded at $2.20. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|xrp|xrp news|XRP Price|XRP Price Analysis|XRP Technical Analysis",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54883326,
    "published": 1764089484000,
    "title": "ICP Clears Key Technical Barrier as Breakout Volume Confirms Upward Momentum",
    "body": "Internet Computer climbed through the crucial $4.20 resistance level on elevated volume before late-session consolidation narrowed gains.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Technical Analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 82,
        "NAME": "ICP",
        "CATEGORY": "ICP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54883285,
    "published": 1764088099000,
    "title": "Crypto is GREEN! MON launches at $3.9Billion FDV!",
    "body": "Crypto majors rallied alongside a broad market surge, with BTC up 2% to $87,400, ETH up 4% to $2,920, BNB up 1% to $850, and SOL up 5% to $136, while KAS (+22%), ENA (+13%), and SUI (+11%) led the day’s top movers. The NASDAQ jumped 2.7% as stocks such as GOOG (+6%) and TSLA (+7%) posted strong gains. In policy and industry developments, the White House launched the “Genesis Mission,” described as a Manhattan Project–style initiative for AI, and Binance along with CZ faced new accusations of enabling crypto transactions for Hamas. Kraken hinted at a debit card debut expected today, and Tether purchased another 1 million Rumble shares, pushing the YouTube rival’s stock sharply higher. Meanwhile, the European Central Bank reiterated its warnings that the rapid growth of stablecoins could introduce stability risks to the wider financial system.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54884197,
    "published": 1764090833000,
    "title": "High percentage of Bitcoin, ETH, SOL held at a loss: Is it a bear market sign?",
    "body": "One analyst found that 40% of Bitcoin is held at a loss, while ETH and SOL data currently stand at 40% and 75% respectively. Should investors be worried?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54885351,
    "published": 1764092627000,
    "title": "Klarna enters crypto with new USD stablecoin built on Stripe’s Tempo chain",
    "body": "The EU-licensed digital bank becomes the first financial institution to issue a token on Stripe and Paradigm’s layer-1 blockchain Tempo.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54885820,
    "published": 1764093605000,
    "title": "Financial Strategist Debunks Prediction That Bitcoin Price Will Reach $220,000 In 45 Days",
    "body": "A recent claim that the Bitcoin price could surge to $220,000 in just 45 days has drawn sharp criticism from a financial strategist. The analyst frames such ambitious forecasts as unrealistic and highly speculative. Considering the recent decline in the BTC market, if the projection is taken at face value without supporting data, it overlooks ongoing market trends, macroeconomic conditions, and potential investor risks. Strategist Labels $220,000 Bitcoin Price Forecast “Nonsense” South Korean scientist YoungHoon Kim, who holds the world’s highest reported IQ of 276, recently predicted that Bitcoin could more than double its current price and reach $220,000 within 45 days. Based on this forecast, the BTC price is expected to surge by over 151% from current levels below $87,500, potentially reaching a new all-time high by mid-January 2026. Related Reading: Analyst Who Predicted Bitcoin Price Action With Chinese Astrology Shares When Prices Will Surge With Bitcoin down more than 31% from its ATH above $126,000, the bold forecast came as a surprise to many crypto members. The founder of Black Swan Capitalist, Versan Aljarrah, in particular, criticized the projection, calling it “nonsense.” He described it as an example of the speculative behavior that has long characterized the crypto space. Aljarrah argued that predictions like Kim’s, which lack the visible support of a technical analysis, are what transform the crypto space into a “circus.” He highlighted that Bitcoin maxis will often go to extreme lengths to sustain the hype, promoting narratives that keep the speculative bubble alive even when market fundamentals raise caution. The Black Swan Capitalist founder also disclosed that Bitcoin has historically functioned more as a tool for predators and bad actors. His statements suggest that Kim’s forecast oversimplifies the complexities of the crypto market and distracts investors and traders from the fundamental structural factors driving Bitcoin’s price. Bitcoin Price Continues To Falter Amidst Bullish Forecasts The Bitcoin market remains at a crossroads, with analysts forecasting sharp upward moves despite choppy price action. Despite predictions of a potential rally, BTC’s recent performance paints a more cautious picture, as its price has fallen by more than 20% over the past month, according to CoinMarketCap. Related Reading: Why Bitwise Thinks Bitcoin Still Hits $200,000 In 2026 Crypto analyst Pepesso recently issued a bullish forecast, suggesting that Bitcoin may have hit its bottom and could potentially start a recovery toward levels between $126,000 and $160,000. However, broader market indicators, such as the Fear and Greed Index, point to extreme fear, suggesting investors remain highly uncertain about BTC’s near-term outlook. Other analysts, like Gen Detector, have presented a more conservative outlook, predicting that Bitcoin could first stabilize around the $100,000 psychological level before its next bear wave begins. However, he has not ruled out the likelihood of further price corrections, highlighting the potential for BTC to revisit the $70,000 to $50,000 range before the next major bull run. Featured image from Pngtree, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|Black Swan Capitalist|btc|BTC news|btc price|btcusd|BTCUSDT|CoinMarketCap|Gen Detector|Pepesso|Versan Aljarrah|YoungHoon Kim",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54885688,
    "published": 1764093366000,
    "title": "TON Pulls Back After Ecosystem-Driven Rally as Traders Eye Key Support Near $1.50",
    "body": "The token's price action points to fading buyer interest, with initial strong trading activity giving way to a sharp decline in participation.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|TON|Technical Analysis",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 98,
        "NAME": "TON",
        "CATEGORY": "TON"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54885653,
    "published": 1764093253000,
    "title": "Why the SEC’s new guidelines could speed up the approval process for new crypto ETFs",
    "body": "New SEC rules could reshape the crypto ETF landscape by speeding up approvals, reducing the shutdown backlog and giving issuers a clearer and faster path to market.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54886903,
    "published": 1764095393000,
    "title": "U.S Bank Tests Custom Stablecoin Issuance on Stellar Network",
    "body": "The nation's fifth-largest commercial bank explores how a bank can issue stablecoins on a public blockchain.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Stablecoin|Stellar|US Bank|PwC|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 56,
        "NAME": "XLM",
        "CATEGORY": "XLM"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54886836,
    "published": 1764091452000,
    "title": "Oct. 7 Hamas Attack Victims Sue Binance for Damages",
    "body": "Binance allegedly facilitated the transfer of over $1 billion to sanctioned entities including Hamas and Iran's Revolutionary Guard Corps, a lawsuit said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Binance|Hamas|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54887252,
    "published": 1764094630000,
    "title": "Is the Bull Market over? The AI Manhattan Project! Monad Launch Reaction!",
    "body": "Crypto majors rallied alongside a broad market surge, with BTC up 2% to $87,400, ETH up 4% to $2,920, BNB up 1% to $850, and SOL up 5% to $136, while KAS (+22%), ENA (+13%), and SUI (+11%) led the day’s top movers. The NASDAQ jumped 2.7% as stocks such as GOOG (+6%) and TSLA (+7%) posted strong gains. In policy and industry developments, the White House launched the “Genesis Mission,” described as a Manhattan Project–style initiative for AI, and Binance along with CZ faced new accusations of enabling crypto transactions for Hamas. Kraken hinted at a debit card debut expected today, and Tether purchased another 1 million Rumble shares, pushing the YouTube rival’s stock sharply higher. Meanwhile, the European Central Bank reiterated its warnings that the rapid growth of stablecoins could introduce stability risks to the wider financial system.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54887984,
    "published": 1764097255000,
    "title": "Hamas Victims Sue Binance And CZ — Accusations Of Terror Financing Rock Crypto World",
    "body": "Based on reports, victims of the October 7 attacks in Israel have filed a federal lawsuit against Binance and its founder, Changpeng “CZ” Zhao, claiming the exchange allowed large crypto flows to militant groups. Related Reading: Bitcoin Creator Somehow Becomes ‘Poor’ By Losing $41 Billion Without Saying A Word The complaint lists 306 American plaintiffs who say they were killed, injured, or taken hostage and are demanding damages. Dormant Accounts Draw Scrutiny According to the filing, the plaintiffs allege Binance helped move more than $1 billion for Hamas and other US-designated groups over several years. They claim that more than $50 million passed through the platform after the October 7, 2023 assault. These figures sit at the center of the case and could shape the request for compensatory and treble damages. The complaint also highlights unusual account activity that lawyers say should have triggered alarms. One example involves an account tied to a Venezuelan woman linked to a Brazilian livestock business. Binance Holdings faces a lawsuit claiming the cryptocurrency platform “knowingly facilitated” crypto transactions by Hamas before the group attacked Israel on Oct. 7, 2023, killing 1,200 people and taking 250 hostages. https://t.co/B3rO7bAjN6 — The Japan Times (@japantimes) November 25, 2025 Reports say the account received over $177 million in deposits after opening in 2022 and later sent out more than $130 million in withdrawals. Attorneys argue that movements of this size should have been examined more closely. Large Sums And Strange Flows Based on reports, the plaintiffs argue that Binance’s controls were weak or ignored, allowing questionable transfers to move across borders. The lawsuit lists alleged links to Hamas, Hezbollah, Palestinian Islamic Jihad, and Iran’s Revolutionary Guard. Lawyers claim the platform became a tool for shifting money while avoiding standard financial checks. Binance has said it complies with international sanctions laws and has denied having any special ties to terrorist groups. Its legal history forms part of the background: in late 2023, the company pleaded guilty in a major federal case and paid a $4.32 billion penalty tied to anti-money-laundering and sanctions violations. That earlier case, along with Zhao’s four-month prison sentence, is referenced in the new complaint. Related Reading: Bitcoin’s Sudden Volatility Jump Signals Options Could Be Calling The Shots—Analyst Legal Stakes And Future Impact The new lawsuit seeks damages under a US anti-terrorism law that can triple any award. If the plaintiffs succeed, the financial and reputational impact on Binance could be severe. The complaint was filed in federal court in North Dakota and is separate from another case in Manhattan that is already moving through the court system. The filing also recalls that Zhao’s prison sentence was later followed by a pardon from US President Donald Trump, something the plaintiffs point to as part of the exchange’s complicated legal path. They argue this new lawsuit is necessary to push for accountability after years of what they see as weak controls. Featured image from alliance / Zumapress.com, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Binance|bitcoin|changpeng zhao|CZ|Gaza|Hamas|terror funding",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54887827,
    "published": 1764096892000,
    "title": "Polymarket wins regulatory approval to operate US trading platform",
    "body": "The approval came as the US Senate is expected to soon vote on prospective CFTC Chair Michael Selig as a replacement for acting chair Caroline Pham.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54887666,
    "published": 1764096666000,
    "title": "U.S. Crypto Regulator, CFTC, Seeking Names for New 'CEO Innovation Council'",
    "body": "Acting Chairman Caroline Pham said the group will help usher in a new era of market structure, including a focus on digital assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|U.S. Commodity Futures Trading Commission|Caroline D. Pham|Regulation|CEO|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54889563,
    "published": 1764099794000,
    "title": "Paxos acquires Fordefi to power stablecoin, tokenization infrastructure",
    "body": "The addition of Fordefi’s MPC wallet infrastructure broadens Paxos’ regulated capabilities for custody, tokenization and institutional onchain operations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54889528,
    "published": 1764099768000,
    "title": "Bitcoin’s Bear Market?",
    "body": "A sharp pullback, heavy liquidations and cooling demand are forcing crypto into its most uncertain stretch of the year.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|Editors' Pick|editors-pick|premium",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54889181,
    "published": 1764099247000,
    "title": "Polymarket Set for US Return Following Approval From CFTC",
    "body": "The popular prediction market says it now has permission to directly onboard U.S. customers, brokerages, and market intermediaries.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54890093,
    "published": 1764100843000,
    "title": "XRP OI Collapses to Lowest Level Since Nov 2024: Binance Data Shows Liquidity Is Fading",
    "body": "XRP is under heavy selling pressure as the broader crypto market struggles with uncertainty, risk aversion, and fading bullish momentum. Fear continues to spread across investors, and liquidity conditions are tightening, putting additional weight on assets that previously demonstrated strength. Related Reading: Bitmine Scoops Up Another 28,625 Ethereum ($82.1M) as Market Bleeds – Details One of the clearest signs of stress now comes from Binance data — the largest trading platform by volume — showing that XRP Open Interest has dropped to its lowest level since November 2024. This decline highlights a significant shift in trader positioning, signaling that speculative appetite is drying up and leverage is being unwound across the market. According to the latest derivatives metrics, XRP is entering a critical phase marked by weakening sentiment and a steady loss of momentum. The sharp contraction in Open Interest reflects reduced participation from both long and short traders, suggesting that the market currently lacks conviction to support a sustained directional move. This shift comes at a time when XRP had previously been attempting to stabilize above key psychological levels, but continued selling pressure has prevented a clean rebound. XRP Derivatives Show Liquidity Drain and Bearish Control A CryptoQuant report from Arab Chain reveals a sharp deterioration in XRP derivatives conditions, highlighting growing stress across the market. Open Interest on Binance has fallen dramatically from record highs above $1.7 billion to nearly $504 million, and briefly down to $473 million. This steep contraction reflects a major outflow of liquidity from both long and short positions, signaling that traders no longer have the conviction needed to sustain a clear directional trend. The decline in OI aligns closely with XRP’s price drop to $2, after trading above the $2.5–$3 range in recent weeks. This correlation suggests that traders are not reopening positions after being flushed out, leaving the market driven by short-term flows rather than sustained accumulation. Funding rates reinforce this weakness. Over the past two months, funding has frequently turned negative, showing that short sellers are willing to pay to maintain their positions. Negative funding typically indicates that selling pressure outweighs buying demand, increasing the probability of continued downside unless fresh liquidity enters the market. Taken together — collapsing Open Interest, persistent negative funding, and declining price action — the data paints a picture of deep fragility. There are no visible signs of meaningful accumulation from whales or institutions, and without a reversal in derivatives behavior, XRP remains firmly under seller control. Related Reading: 63K Bitcoin Exits Long-Term Wallets: A Surge of Speculative Short-Term Buying XRP Price Shows Weak Rebound After Breakdown XRP continues to struggle under heavy market pressure, and the chart reflects a clear loss of bullish structure. After failing to hold above the $2.50–$2.70 range, price broke down sharply and recently tagged lows near $1.90 before attempting a modest rebound. The rejection from the 50-day and 100-day moving averages shows that sellers remain firmly in control, with both moving averages now sloping downward — a sign of sustained bearish momentum. Additionally, XRP remains below the 200-day moving average, reinforcing the broader downside bias and signaling that the market has not yet regained long-term support. Related Reading: Anti-CZ Whale Loses Big: $61M in Profit Wiped Out As Ethereum and XRP Longs Collapse Volume spikes during selloffs highlight capitulation-driven moves rather than accumulation, while the weaker volume on recent green candles suggests limited conviction behind the bounce. Each recovery attempt has been met with resistance, forming lower highs and lower lows — a classic bearish continuation pattern. To shift sentiment, XRP would need to reclaim the $2.40 level and consolidate above it; otherwise, the risk of retesting $1.90 or even falling toward $1.70 remains elevated. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP News|xrp|XRP analysis|XRP Correction|xrp news|XRP open interest|XRP Price|XRP selling pressure|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54891041,
    "published": 1764102368000,
    "title": "MoonPay Granted New York Trust Charter, Joining Coinbase and Ripple",
    "body": "Crypto payments firm MoonPay has gained regulatory approval in New York to safeguard customers’ digital assets and facilitate OTC trades.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54890738,
    "published": 1764101774000,
    "title": "Kraken Launches Bitcoin Rewards Debit Mastercard Ahead of Planned IPO",
    "body": "Kraken unveiled a Bitcoin rewards Mastercard debit card that links to its peer-to-peer payments app, Krak.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54890764,
    "published": 1764101700000,
    "title": "South Africa’s central bank flags crypto, stablecoins as financial risk",
    "body": "The bank cited increasing trading volume and the number of users among large exchanges, as well as gaps in South Africa’s regulatory framework on crypto.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54892167,
    "published": 1764104435000,
    "title": "XRP Price Will Climb Above $10 When This Happens: Analyst",
    "body": "Bitcoin dominance is currently sitting around the mid-50% range, and although it has not shown any dramatic breakdown yet, some traders are beginning to watch for signs of rotation. Data from platforms that track market share show Bitcoin dominance slowly pushing to the mid-fifties, but projections suggesting a future decline are forming the basis of new discussions in the XRP community. One such projection comes from an XRP enthusiast known as DROP, who shared a chart illustrating a steep fall in Bitcoin dominance that he believes will unlock XRP’s next major rally to double digits. Bitcoin Dominance Projection Shows A Breakdown Zone The chart shared by DROP outlines a scenario where Bitcoin dominance trends sideways for a while before sliding into the low-40% region. This projected decline is highlighted by a wide purple zone extending into 2026. The expectation is that a major rotation into altcoins, most especially XRP, would begin once dominance loses its current structure. Related Reading: Here’s How High The XRP Price Needs To Be To Flip Bitcoin Although Bitcoin’s dominance has fallen quite a bit from its 60% range where it was circulating in October, it has fairly held up even when it fell to as low as $81,000 on November 21. The last time Bitcoin’s dominance was as low as 40% was in early 2023. The idea behind the projection is not that another fall in dominance has already begun, but that the dominance is in a region where it could crash if market conditions change. According to DROP, this is the moment that will cement the beginning of XRP’s strongest move of the cycle. It is from here that the XRP price runs to double digits. Double-Digit XRP Dependent On A Crypto Market Transition XRP has often been one of the few assets that have shown the ability to outperform Bitcoin, especially when traders rotate into large-cap tokens that have lagged behind Bitcoin during the early part of a cycle. Related Reading: XRP Price Has Surged 15% Anytime This Metric Appeared In The Past This pattern was visible in both January and July 2025. The January 2025 move pushed XRP above $3 for the first time since 2018, and the July 2025 move saw the XRP price register a new all-time high. The projection by DROP positions XRP as one of the likely gainers once market share begins to redistribute away from Bitcoin. This has not happened yet, and current dominance readings reflect stability rather than collapse. The projection centers on what could occur when the market enters the next altcoin rotation phase. If dominance eventually drops toward the low-40% range, then the conditions might just be right for XRP to break out above $10. These conditions include retail and institutional participation, deeper liquidity from large investors, and meaningful inflows into XRP ETFs to sustain such an advance to double digits. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|altcoins|bitcoin|Bitcoin's Dominance|drop|Ripple|Spot XRP ETFs|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54891835,
    "published": 1764103791000,
    "title": "US Bank Is Testing a Stablecoin on Stellar Network",
    "body": "U.S. Bank joins the growing list of traditional banking institutions working on stablecoins, testing its own on the Stellar blockchain.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 56,
        "NAME": "XLM",
        "CATEGORY": "XLM"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54892361,
    "published": 1764104759000,
    "title": "Texas Buys $5M in BTC ETF as States Edge Toward First Government Crypto Reserves",
    "body": "The effort is starting small, but Texas made an opening foray into a state-based crypto reserve — getting closer to the first government stockpile in the U.S.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|BTC Treasuries Theme Month|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54893260,
    "published": 1764106165000,
    "title": "Bitwise Dogecoin ETF Debut Imminent After Quiet Start for Grayscale DOGE Fund",
    "body": "Bitwise's Dogecoin ETF, BWOW, was certified by NYSE Arca, signaling investors will soon be able to start trading the meme coin fund.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "dogecoin|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54893224,
    "published": 1764105820000,
    "title": "Acting CFTC chair seeks CEOs for ‘innovation council,’ citing crypto",
    "body": "The US CFTC opened nominations for a CEO-led advisory group that will help shape policy on crypto, prediction markets and other emerging products.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54894323,
    "published": 1764108001000,
    "title": "Solana Rebounds Strong as Massive ETF Inflows Reinforce $128 Support Zone",
    "body": "Solana (SOL) is staging an impressive comeback as renewed institutional demand supports the network’s key support levels. Related Reading: Bitcoin Faces Less Than 50% Chance Of Hitting $100,000 By December 31, Says AI Model The latest surge in investor interest, led by a record-breaking inflow into Bitwise’s Solana ETF, has helped the asset stabilize after weeks of market turbulence, offering fresh optimism for a potential trend reversal. SOL's price trends to the downside on the daily chart. Source: SOLUSD on Tradingview Record Solana ETF Inflows Signal Renewed Institutional Confidence Bitwise Asset Management recorded a historic $39.5 million single-day inflow into its Solana ETF, the largest since the product launched. The milestone reflects a clear shift in institutional portfolios toward high-utility blockchain assets, with Solana increasingly emerging as a preferred choice beyond Bitcoin and Ethereum. The network’s reputation for speed, scalability, and active ecosystem continues to anchor demand, with institutional investors prioritizing blockchains that demonstrate real-world functionality. This surge in ETF interest comes despite broader market volatility. Recent weeks saw nearly $1.94 billion in total outflows across crypto investment products, one of the largest downturns since 2018. Yet, Solana ETF performance shows institutions are not withdrawing from the market entirely, they are reallocating capital toward networks with measurable usage and long-term growth potential. Solana Price Rebounds as Key Supports Hold Firm After dropping to $121.50 on Friday, Solana rebounded sharply to reclaim the $135–$140 range, marking a 14% recovery. Despite a 30% decline over the last month, SOL has shown notable resilience. The asset continues to hold above the crucial $125–$130 support band, a zone analysts describe as the foundation of Solana’s current market structure. Derivatives markets, however, still reflect caution. Negative funding rates and declining open interest indicate traders remain defensive, with sentiment yet to fully align with the positive ETF inflows. Even so, on-chain activity paints a more optimistic picture. Solana leads all major networks in active addresses and daily transactions, with user activity increasing 13% over the past month, even as Ethereum’s activity declined 15%. ETF Strength and On-Chain Utility Shape Solana’s Next Move The junction of strong ETF demand and robust network fundamentals suggests Solana could be positioned for a broader recovery, provided it maintains the $125 support level. Analysts point to $163, $170, and eventually $195–$243 as potential upside targets if buyers continue to absorb selling pressure. Related Reading: Bitcoin To $40,000? Signal Behind Past 60% Crashes Is Back While macro uncertainty and recent market outflows still pose risks, Solana’s ability to withstand significant volatility, while attracting record institutional capital, signals enduring confidence in its long-term value. If current momentum holds, Solana may soon challenge higher resistance zones, backing its position as one of the most resilient high-utility blockchains in 2025. Cover image from ChatGPT, SOLUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Solana|Sol|SOLUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54894411,
    "published": 1764107946000,
    "title": "Monad Rises After Airdrop While Bitcoin and Ethereum Droop",
    "body": "The price of Monad’s native cryptocurrency rose on Tuesday, following an anticipated airdrop that initially underwhelmed some speculators.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 204,
        "NAME": "AIRDROP",
        "CATEGORY": "AIRDROP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54895461,
    "published": 1764109530000,
    "title": "MegaETH scraps $1B plan after technical failures derail sale",
    "body": "Multiple technical failures during MegaETH’s pre-deposit phase pushed the raise beyond its limit and forced the team to halt the sale.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54896669,
    "published": 1764111645000,
    "title": "Bitcoin Short Squeeze Flushes Out Late Longers as Funding Turns Negative: Classic Capitulation Signal",
    "body": "Bitcoin is struggling to reclaim the $90,000 level as selling pressure continues to dominate across the crypto market. The sharp decline from the all-time high has fueled growing speculation that the current cycle may have already peaked, with many analysts now calling for the beginning of a bear market. Sentiment has shifted rapidly, and fear is spreading as traders question whether the bullish structure has been permanently broken. Related Reading: Bitmine Scoops Up Another 28,625 Ethereum ($82.1M) as Market Bleeds – Details However, not everyone agrees with the bearish outlook. A segment of market participants still expects a rebound, arguing that the correction is part of a broader continuation pattern rather than the end of the cycle. These optimistic observers believe that higher prices could still unfold once selling exhaustion sets in. According to top analyst Darkfost, the recent price action reflects a notable behavioral shift in traders. He explains that investors who attempted to long the market throughout the correction have finally been squeezed out. Funding rates, which had remained elevated during the decline, have now cooled and even turned negative — a strong signal that sentiment has flipped. Darkfost notes that traders waited for Bitcoin to correct more than 30% before shifting aggressively into short positions, highlighting a delayed reaction that often appears near market inflection points. Funding Rates Flip Negative as Short Dominance Takes Over Darkfost explains that the latest shift in funding rates is more meaningful than it appears on the surface. He notes that traders often assume the neutral funding level is 0%, but that is not the case. Most exchanges — including Binance — embed an interest component of roughly 0.01% into the funding calculation. This means that when funding drops below 0.01%, it already reflects short-side dominance. Therefore, when funding turns negative, it signals an even stronger tilt toward aggressive short positioning. According to Darkfost, this marks a clear behavioral change among derivatives traders, suggesting that the market has transitioned from forced long unwinds to conviction-based short exposure. Historically, these shifts tend to occur only once a correction is already deep into its progression. Darkfost highlights that such funding transitions often reflect trader capitulation — where participants who fought the downtrend finally flip and attempt to follow momentum, but only after most of the move has already unfolded. This phenomenon has appeared in previous cycle retracements and has frequently coincided with late-stage bottoms. He adds that Bitcoin may now be entering a disbelief phase, where price begins climbing while shorts continue to pile in. If this dynamic persists, it could act as fuel for an upside reversal, especially if spot demand wakes up and liquidations pressure the short side instead. Related Reading: 63K Bitcoin Exits Long-Term Wallets: A Surge of Speculative Short-Term Buying BTC Price Testing Short-Term Supply Bitcoin is attempting to stabilize after a sharp decline, with the chart showing price currently trading around $87,000 following a rebound from the recent plunge near $80,000. The downtrend remains clearly defined, as BTC continues to trade below the 50-day, 100-day, and 200-day moving averages, signaling persistent bearish momentum. The slope of these moving averages has turned downward, reinforcing the shift in trend structure. Despite the bounce, the recovery lacks strong volume support, which suggests that buyers have not yet returned with conviction. Related Reading: STH Panic Emerges as Bitcoin Crashes To $81K: Realized P/L Turns Negative For The First Time This Cycle The chart shows that previous support levels around $95,000 and $100,000 have now become resistance areas, making them key levels to watch for any attempted recovery. A failure to reclaim these zones could trigger renewed selling pressure and a retest of the recent lows. However, the wick below $80,000 indicates aggressive buying at the lows, which could signal that a short-term bottom is forming if buyers continue to defend higher lows in the coming days. Market sentiment remains fragile, yet the stabilization above $85,000 hints at a potential consolidation phase rather than immediate continuation of the decline. A sustained move above the 100-day moving average would be the first meaningful signal of regained bullish momentum. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin Capitulation Signal|Bitcoin Funding Rate|Bitcoin Liquidity|Bitcoin news|Bitcoin Short Squeeze|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54898911,
    "published": 1764115233000,
    "title": "DOGE Turns Bullish: Fresh ETF Listing and Rising On-Chain Activity Triggers Dogecoin Breakout",
    "body": "Dogecoin (DOGE) is back in the spotlight after a week of explosive developments that have shifted market sentiment firmly into bullish territory. Related Reading: Bitcoin’s November Crash To Continue If This Level Isn’t Reclaimed, Analyst Warns The launch of Grayscale’s Dogecoin ETF, along with rising on-chain activity and renewed retail enthusiasm, has combined to push DOGE into a breakout zone that analysts say could define its next major trend. As the broader crypto market remains volatile, Dogecoin is proving once again that its unique blend of cultural appeal and market structure can create outsized momentum. DOGE's price trends to the downside on the daily chart. Source: DOGEUSD on Tradingview Grayscale’s GDOG ETF Ignites Fresh Institutional Demand The biggest catalyst of the week is the debut of Grayscale’s GDOG, the first U.S. spot Dogecoin ETF, an unprecedented milestone for any memecoin. Listed on NYSE Arca with a temporary 0% fee for the first $1 billion in assets, GDOG offers regulated exposure to DOGE without the need for wallets or direct custody. Early inflows have already surpassed expectations, signaling significant institutional interest ahead of fierce competition from Bitwise, which is launching its own Dogecoin ETF, BWOW, later in the week. The ETF arrival comes as Dogecoin maintains its position among the top 10 cryptos, boasting billions in daily trading volume and a market capitalization rivaling that of established traditional companies. Analysts note that ETF access could unlock new capital from retirement accounts, advisory firms, and institutions that have been previously restricted from buying the asset directly, potentially reshaping DOGE’s liquidity profile. Dogecoin Price Momentum Builds as On-Chain Activity Surges DOGE’s price climbed over 2% to trade around $0.15, breaking short-term resistance as volumes exceeded $1.5 billion. On-chain data shows more than 1.5 million daily transactions, reflecting heightened network usage driven by low fees and rapid confirmation speeds. Technical indicators also reinforce the bullish turn, as the RSI has rebounded from oversold territory, while support at the $0.13 zone remains intact. Market watchers say a move toward $0.18 is possible if ETF inflows remain strong. The long-monitored $0.17–$0.16 support cluster remains the key downside zone that bulls must defend to maintain control. Memecoin Era Strengthens as DOGE Enters Regulated Finance Dogecoin’s ETF debut is more than a market event. It’s a cultural benchmark that cements the evolution of memecoins from online jokes to regulated financial instruments. With Grayscale securing first-mover advantage and Bitwise close behind, Wall Street has formally opened the door to a new class of assets powered by community identity rather than traditional fundamentals. Related Reading: Is Bitcoin Yet To Top In This Cycle? What aSOPR Suggests As ecosystem upgrades continue, ranging from payment integrations to emerging DeFi utilities, Dogecoin’s breakout moment suggests that the memecoin market is entering a new chapter. With on-chain strength rising and institutional access expanding, DOGE may be preparing for a major run once again. Cover image from ChatGPT, DOGEUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|Doge price|dogecoin price|dogeusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54901195,
    "published": 1764118827000,
    "title": "Fear Surges, But Real XRP Holders Aren’t Shaken—Analyst",
    "body": "According to Versan Aljarrah, founder of Black Swan Capitalist, fear has crept back into the XRP market as the token trades under pressure. Prices slipped below the $2 mark and recently hit about $1.83 before a small rebound. Volatility has been sharp, and many traders are being pushed into quick exits. Related Reading: Bitcoin Creator Somehow Becomes ‘Poor’ By Losing $41 Billion Without Saying A Word Volatility Tests Investors Based on reports, XRP’s slide accelerated after a broad market crash in early October tied to tariff tensions between the US and China. That turmoil forced billions of dollars of liquidations across exchanges. Different platforms briefly showed very different lows — Kraken recorded $1.40 while Binance charts on TradingView showed a flash low at $0.76. Fear is back, and it always hits those who don’t understand what it means to hold XRP. Most won’t survive the engineered volatility ahead. The system shakes out the weak long before real valuation even begins. — Black Swan Capitalist (@VersanAljarrah) November 23, 2025 Those swings left behind gaps in liquidity, including a zone around $1.98 to $1.99 that traders are watching closely. Price action has been messy but not one-directional. XRP was trading around $2.22, up about 1.8% in the last 24 hours, and in another snapshot it was reported changing hands close to $2.24 amid a rebound. Over the most recent 72 hours, the token posted a rally of more than 18%, showing how fast sentiment can flip. According to Aljarrah, fear has returned, and “it always hits those who don’t understand what it means to hold XRP.” The analyst pointed out that a good number of people will fall before they could even make it and “survive the engineered volatility ahead.” The system, he said, “shakes out the weak” long before actual market valuation takes its course. History And Psychology At Work Analysts and market observers point to XRP’s stop-and-go history as part of the problem. In 2017, the coin lingered for months before surging roughly 70,000% and then dropping by as much as 95% at certain stretches. In 2024, it traded quietly for much of the year before jumping over 600% near year end. That pattern makes holding the token psychologically hard for many. People sell too soon, often right before big moves. Support levels are being watched closely. Reports list key buffers at $1.95, $1.75, and $1.60. On the upside, some analysts are projecting a rebound to $4 by 2026, with longer-range targets of $13 and $27. Those are forecasts, not promises, and they assume steady market conditions and continued interest. While $XRP jumped 17% in the last 72 hours, whales used the move to lock in profits, selling more than 180 million tokens. pic.twitter.com/t9aKQqTwQN — Ali (@ali_charts) November 25, 2025 Whales Take Profit Amid Rally And ETF Flows Meanwhile, analyst Ali Martinez said larger holders have been taking profits during the rebound. Whales holding between 1 million and 10 million XRP reportedly sold over 180 million tokens, trimming their balances to about 4.74 billion XRP. That kind of selling can add pressure even while the price is trying to recover. Related Reading: Bitcoin’s Sudden Volatility Jump Signals Options Could Be Calling The Shots—Analyst Institutional flows appear to be a counterweight. Based on reports, the Franklin Templeton and Grayscale XRP ETFs launched in the US yesterday and drew combined positive flows of $130 million on their first day. Net inflows into US XRP ETFs on Monday were placed at $164 million, a figure that helped absorb some of the selling and supported a more than 7% gain over 24 hours in some trading windows. Featured image from Pexels, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|altcoins|bitcoin|crypto|whales|xrp|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54903410,
    "published": 1764122439000,
    "title": "Here’s Why Bitcoin Still Dominates As The Premier Store Of Value In Digital Assets",
    "body": "In the dynamic and often volatile landscape of digital assets, Bitcoin’s position as the premier store of value in the digital asset space remains firmly intact, even as the broader crypto ecosystem evolves. Its unmatched network strength, fixed supply, and resilient global infrastructure continue to make it the benchmark against all digital assets. Unmatched Network Security Keeps Bitcoin In The Lead Bitcoin remains the largest and most secure store of value in the crypto ecosystem, with a market capitalization surpassing $1.7 trillion and increasingly unmatched institutional adoption. However, analyst Ted has noted on X that the BTC base layer was never built for decentralized finance (DeFi). Related Reading: Historic Downturn: Bitcoin Nears Worst Weekly Performance In Over A Year Most of BTC’s capital sits idle and is unable to support the complex financial applications. This is where the BTCFi emerges, and it’s rising because it activates this dormant capital without forcing users or liquidity away from BTC’s security. Ted highlighted that Arch Network is a utility layer that enables the development of expressive rush in smart contracts directly to BTC for high performance. It offers real-time state management, true interoperability, and fast parallel execution, while remaining fully aligned with the BTC UTXO model. This ensures that all settlements and final state changes remain anchored directly to BTC for maximum security. The applications on ArchVM generate Zero-Knowledge (ZK) proofs for each batch of transactions, and BTC nodes verify those proofs on-chain; a design that enables fast trading, money lending, credit markets, and real-world asset (RWA) applications with the L1-level trust. Furthermore, Ted describes the Arch Network as aiming to become a core piece of the infrastructure pillar for the emerging BTCFi ecosystem. Bitcoin Stabilizes As Market Volatility Cools Off The cryptocurrency market is now showing signs of stabilization, positioning Bitcoin for a potential resurgence. According to CryptosRus, last Friday, BTC appeared to have firmly bottomed just above the $82,000 level, a crucial development that analysts are pointing to as a potential renewed market strength. While the selling pressure is fading, these key developments could trigger a near-term bounce for BTC. Related Reading: Bitcoin Price Recovery Loses Strength, Traders Watch $90K as Last Line of Defense Swissblock outlines a sharp risk-off signal, suggesting that the worst phase of capitulation may be over. The market might still experience a second weaker wave of selling pressure, which would mark the exhaustion of any remaining sellers, and shift the market towards the bulls. Fed rate cuts are surging, as the December cut probability is climbing back to 70%, fueling optimism for liquidity support. Furthermore, liquidity injection is possible, and market analysts are highlighting that the actions from the Fed could expand reserves, which have historically proven to be bullish for the crypto market. With selling pressure easing and policy tailwinds building, BTC’s climb may continue signaling a potential recovery. Featured image from Pngtree, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|Arch Network|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|BTCfi|btcusd|BTCUSDT|CryptosRus|decentralized finance|DeFi|Real World Asset|RWA|Swissblock|Ted Pillows|zero knowledge|zk",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54903625,
    "published": 1764122726000,
    "title": "JPMorgan's Bitcoin Structured Notes Offer Potentially Massive Returns—If BTC Surges by 2028",
    "body": "The bank has an idea for a product that would allow investors to make big gains if the leading cryptocurrency soars.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54904448,
    "published": 1764124164000,
    "title": "Bitcoin Price Rebound Picks Up Pace With $90K Break in Focus",
    "body": "Bitcoin price started a recovery wave above $88,000. BTC is now consolidating and might soon aim for a move above the $90,000 zone. Bitcoin started a recovery wave and climbed toward $89,000. The price is trading above $87,000 and the 100 hourly Simple moving average. There is a bearish trend line forming with resistance at $88,200 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move up if it settles above the $90,000 zone. Bitcoin Price Eyes Upside Break Bitcoin price managed to stay above the $83,500 level. BTC formed a base and recently started a recovery wave above the $85,500 resistance zone. There was a move above the $86,000 resistance zone. The bulls pushed the price above the 50% Fib retracement level of the downward move from the $92,872 swing high to the $80,595 low. However, the bears are currently preventing an upside break above the $90,000 zone. Besides, there is a bearish trend line forming with resistance at $88,200 on the hourly chart of the BTC/USD pair. Bitcoin is now trading above $87,000 and the 100 hourly Simple moving average. If the bulls attempt another recovery wave, the price could face resistance near the $88,200 level. The first key resistance is near the $89,000 level. The next resistance could be $90,000 or the 76.4% Fib retracement level of the downward move from the $92,872 swing high to the $80,595 low. A close above the $90,000 resistance might send the price further higher. In the stated case, the price could rise and test the $91,750 resistance. Any more gains might send the price toward the $92,500 level. The next barrier for the bulls could be $93,500 and $94,000. Another Drop In BTC? If Bitcoin fails to rise above the $90,000 resistance zone, it could start another decline. Immediate support is near the $86,700 level. The first major support is near the $86,200 level. The next support is now near the $85,000 zone. Any more losses might send the price toward the $83,500 support in the near term. The main support sits at $82,000, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $86,200, followed by $85,000. Major Resistance Levels – $89,000 and $90,000.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54905306,
    "published": 1764125551000,
    "title": "Monad Hit With Spoofed Token Transfers Days After Mainnet Launch",
    "body": "Fake ERC-20 transfers appeared within 48 hours of MON’s debut as attackers targeted users during the network’s first wave of activity.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54906117,
    "published": 1764126821000,
    "title": "Texas buys the Bitcoin dip, acquiring $5M of BlackRock's IBIT",
    "body": "Texas has also allocated an additional $5 million for direct, self-custodied Bitcoin, signaling growing state-level adoption in the US.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54906038,
    "published": 1764126644000,
    "title": "‘Institutions have arrived’ — US Bancorp launches stablecoin pilot on Stellar network",
    "body": "The ability to freeze assets and unwind transactions was a key consideration when selecting the blockchain for the pilot, according to Mike Villano from US Bank.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 56,
        "NAME": "XLM",
        "CATEGORY": "XLM"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54905763,
    "published": 1764126489000,
    "title": "Ethereum Price Attempts Fresh Recovery as Bullish Pressure Builds",
    "body": "Ethereum price started a recovery wave above $2,880. ETH might gain bullish momentum if it manages to settle above the $3,000 resistance. Ethereum started a recovery wave above $2,850 and $2,880. The price is trading above $2,900 and the 100-hourly Simple Moving Average. There was a break above a key bearish trend line with resistance at $2,950 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move up if it settles above the $3,000 zone. Ethereum Price Eyes Upside Break Ethereum price managed to stay above $2,750 and started a recovery wave, like Bitcoin . ETH price was able to climb above the $2,800 and $2,850 levels. The bulls were able to push the price above the 61.8% Fib retracement level of the downward move from the $3,058 swing high to the $2,620 low. Besides, there was a break above a key bearish trend line with resistance at $2,950 on the hourly chart of ETH/USD. Ethereum price is now trading above $2,840 and the 100-hourly Simple Moving Average . It is also above the 76.4% Fib retracement level of the downward move from the $3,058 swing high to the $2,620 low. If there is another recovery wave, the price could face resistance near the $2,980 level. The next key resistance is near the $3,000 level. The first major resistance is near the $3,060 level. A clear move above the $3,060 resistance might send the price toward the $3,150 resistance. An upside break above the $3,150 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $3,220 resistance zone or even $3,250 in the near term. Another Decline In ETH? If Ethereum fails to clear the $3,000 resistance, it could start a fresh decline. Initial support on the downside is near the $2,920 level. The first major support sits near the $2,880 zone. A clear move below the $2,880 support might push the price toward the $2,800 support. Any more losses might send the price toward the $2,740 region in the near term. The next key support sits at $2,650 and $2,620. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI – The RSI for ETH/USD is now above the 50 zone. Major Support Level – $2,880 Major Resistance Level – $3,000",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54905786,
    "published": 1764126379000,
    "title": "Grayscale spot Dogecoin ETF falls under volume expectations on debut",
    "body": "Trading volume on the debut of Grayscale's first US spot Dogecoin ETF came in under an analyst’s expectation, with Bitwise soon to launch its own fund.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54907652,
    "published": 1764129639000,
    "title": "Crypto Has Entered Late-Cycle Territory, Says Global Liquidity Veteran",
    "body": "Global liquidity specialist Michael Howell used an appearance on the Bankless podcast to deliver a clear, if uncomfortable, message for risk assets: the post-GFC “everything bubble” is ending as the global refinancing machine rolls over, and crypto is late in that cycle rather than at the start of a fresh one. Howell’s starting point is his own definition of liquidity, which diverges sharply from textbook aggregates like M2. “This is the flow of money through global financial markets,” he said. It is not bank deposits in the real economy, but “money that is in the financial markets… it looks at the repo markets, it considers shadow banking,” and “pretty much begins where conventional M2 definitions end.” On his Global Liquidity Index, weekly global liquidity was under $100 trillion in 2010 and now sits “just under $200 trillion” – a doubling in a decade and a half. Howell Flags Liquidity Peak What matters most to him, however, is not the level but the momentum of that liquidity. Howell has identified a remarkably stable 65-month global liquidity cycle that he interprets as a debt-refinancing rhythm. Capital markets, he argues, are no longer primarily about funding new investment: “Something like 70 to 80% of transactions… are debt refinancing transactions. They’re not about raising new capital.” Related Reading: Crypto Crash Is A Forced Crypto Seller Unwind, Glassnode Co-Founders In that world, “debt needs liquidity for rollovers but actually liquidity needs debt,” because roughly three-quarters of global lending is now collateral-backed. The result, as he puts it bluntly, is that “ironically it’s old debt that finances new liquidity.” To capture the systemic tension, Howell tracks a debt-to-liquidity ratio for advanced economies: the total public and private debt stock divided by the pool of refinancing liquidity. The ratio averages about two times and tends to mean-revert. When it drops well below that level, liquidity is abundant and “you get asset bubbles.” When it rises significantly above, “you start to see a stretched debt-liquidity ratio and you get financing tensions or refinancing tensions and you can see those basically morph into financial crisis.” Right now, he says, “we’re transitioning, unfortunately, out of a period that I’ve labeled the everything bubble,” a phase where liquidity was abundant relative to debt after repeated rounds of QE and emergency support. The COVID era deepened that imbalance by encouraging borrowers to “term out” debt at near-zero rates. “A lot of the debt that then existed was refinanced back into the late 2020s at low interest rates,” he noted. That created a visible “debt maturity wall” later this decade: heavy refinancing needs now coming due into a much tighter funding environment. Shorter-term, Howell is focused on the interaction between Federal Reserve liquidity operations, the rebuilding of the US Treasury General Account and growing stress in repo markets. SOFR, which “you’d actually expect to trade below Fed funds” because it is collateralized, has repeatedly traded above its normal range. “We’ve started to see these repo spreads blow out,” he warned, adding that “it’s not really the extent of these spikes… it’s really the frequency that’s the most important factor.” If trade fails and leveraged positions begin to unwind, “it’s going to turn quite ugly and that could be the start of the end of the cycle.” Related Reading: Crypto Markets Underestimate A Trump-Style Flood Of Rate Cuts: Expert Inside his four liquidity regimes – rebound, calm, speculation and turbulence – Howell places the US firmly in “speculation,” with Europe and parts of Asia in “late calm.” Historically, early and mid-upswings favor equities and credit, peaks favor commodities and real assets, downswings favor cash and then long-duration government bonds. LIVE NOW – The Real Crypto Cycle: What Happens When Global Liquidity Peaks Global liquidity veteran Michael Howell (@crossbordercap) joins to map out the “master variable” driving asset price: A 65-month global liquidity and debt refinancing cycle that underpins booms, busts,… pic.twitter.com/Ryl3fqHoYR — Bankless (@Bankless) November 24, 2025 The Impact On The Crypto Market Crypto, in his work, straddles categories. “Crypto generally behaves a little bit like a tech stock and a little bit like a commodity,” he said. For Bitcoin specifically, “about 40–45% of the drivers… are global liquidity factors,” with most of the rest split between gold-like behavior and pure risk appetite. On the popular notion of a hardwired four-year Bitcoin halving cycle, Howell is unconvinced. “I don’t really see any evidence of that four-year cycle,” he said, arguing that the 65-month global liquidity/debt-refinancing cycle is the more robust driver. With that cycle projected to peak around now, crypto looks “late stage in the crypto cycle. So it could be over but it might not be.” The structural backdrop, in his view, is unambiguous: “The trend towards monetary inflation… is slated to continue for another two or three decades at least.” Against that, he argues, investors “have to have” monetary-inflation hedges: “It’s not Bitcoin or gold. [It’s] Bitcoin and gold.” Tactically, though, he is cautious. “We’ve not turned bearish risk-off yet, but we are not bullish short-term,” he said – and suggested that upcoming weakness in risk assets might be “a good time to pick up some more” of those long-term hedges. At press time, the total crypto market cap was at $2.96 trillion. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|crypto|Crypto bear market|crypto bull run|Crypto cycle|crypto news|Is The Crypto Bull Run Over",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54907502,
    "published": 1764129073000,
    "title": "DeFi is already 30% of the way to mass adoption: Chainlink founder",
    "body": "Chainlink’s Sergey Nazarov has shared a potential roadmap for how DeFi could reach 100% adoption in four years, noting that a big part of this hinges on regulation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54907970,
    "published": 1764130087000,
    "title": "XRP Price Eyes Lift-Off as Price Holds Strong — What’s Next?",
    "body": "XRP price started a steady increase above $2.150. The price is now consolidating gains and might aim for another increase if it clears $2.250. XRP price started a fresh increase above the $2.20 zone. The price is now trading above $2.180 and the 100-hourly Simple Moving Average. There is a bullish trend line forming with support at $2.170 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move up if it clears $2.250. XRP Price Eyes More Gains XRP price started a decent upward move above $2.050 and $2.080, beating Bitcoin and Ethereum . The price gained pace for a clear move above the $2.150 resistance. The bulls even pumped the price above the $2.20 barrier. A high was formed at $2.286 and the price started a short-term downside correction. There was a move toward the 23.6% Fib retracement level of the upward move from the $1.817 swing low to the $2.286 high. The price is now trading above $2.180 and the 100-hourly Simple Moving Average. Besides, there is a bullish trend line forming with support at $2.170 on the hourly chart of the XRP/USD pair. If there is a fresh upward move, the price might face resistance near the $2.250 level. The first major resistance is near the $2.280 level, above which the price could rise and test $2.320. A clear move above the $2.320 resistance might send the price toward the $2.420 resistance. Any more gains might send the price toward the $2.450 resistance. The next major hurdle for the bulls might be near $2.50. Another Drop? If XRP fails to clear the $2.250 resistance zone, it could start a fresh decline. Initial support on the downside is near the $2.170 level and the trend line. The next major support is near the $2.120 level. If there is a downside break and a close below the $2.120 level, the price might continue to decline toward $2.050 and the 50% Fib retracement level of the upward move from the $1.817 swing low to the $2.286 high. The next major support sits near the $2.00 zone, below which the price could continue lower toward $1.9250. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $2.170 and $2.120. Major Resistance Levels – $2.250 and $2.320.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54908843,
    "published": 1764131355000,
    "title": "Bitcoin final leverage flush below $80K is possible, warns analyst",
    "body": "An analyst has warned that Bitcoin’s recent liquidation event may not be finished, with remaining leverage potentially pushing prices somewhere between the $70,000 to $80,000 zone.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54909103,
    "published": 1764126821000,
    "title": "Texas buys the Bitcoin dip, acquiring $5M of BlackRock’s IBIT",
    "body": "Texas has also allocated an additional $5 million for direct, self-custodied Bitcoin, signaling growing state-level adoption in the US.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54909866,
    "published": 1764133240000,
    "title": "XRP Edges Toward A Macro Shift As Expanding Diagonal Meets Breakout Momentum",
    "body": "XRP is inching closer to a major turning point as fresh upward momentum collides with a developing, expanding diagonal structure. The recent impulse off support is starting to hint at a potential macro shift, raising expectations for a breakout-driven continuation if buyers can maintain control. Building Toward A Truncated Low: Market Structure Turns Complicated Hov recently highlighted a key shift in XRP’s structure, revisiting the outlook from the previous analysis where a potential push lower was expected to complete a truncated low. Since that discussion, XRP has dipped further, printing a new low on the line chart compared to the wick from the liquidity sweep. However, the movement into that low hasn’t been straightforward, carrying a structure that appears more complex than initially projected. Related Reading: XRP Price Continues Lower as Sellers Tighten Grip on Intraday Structure At first glance, the drop appeared to be a simple three-wave corrective pattern. But on closer inspection, Hov noted that a valid expanding diagonal count is also emerging. Despite the unusual structure, the price action off the most recent low is showing signs of strength. XRP is now developing a clearer impulsive move upward, which could be the early stages of the momentum needed to set up the high-probability C/3 wave trade that has been anticipated. This early impulse doesn’t yet confirm a full trend reversal, but it does reflect a notable shift in market aggressiveness. For now, Hov maintains a bullish leaning toward this support zone holding. As long as buyers continue defending this area, the probability of the reversal scenario increases. XRP Breaks Key Retracement Level As RSI Signals Growing Strength According to the latest update from TARA, XRP has successfully tapped the 0.5 retracement level while showing impressive strength on the RSI. That reaction alone hints at growing momentum beneath the surface. A break above this zone would shift the focus toward the next major target at $2.30, aligning with the crucial 0.382 level. Reclaiming that area would serve as a strong signal that XRP may finally be carving out a true bottom. Related Reading: XRP Price Pulls Back Slightly — Market Still Poised for Fresh Advance Despite this promising setup, confirmation of a new trend is still missing. Momentum is building, and price action is becoming increasingly impulsive, exactly the type of behavior typically seen at the early stage of a macro Wave 3. Another key factor lies outside XRP’s chart entirely. BTC has just reached its resistance zone around $88,300 and has not yet gained the strength needed to break through. This moment of hesitation is important because Bitcoin’s next decision will heavily influence XRP’s short-term direction. The market is extremely close to confirming its next major leg, and all eyes remain on how these critical levels react in the coming sessions. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|bitcoin|btc|Hov|Ripple|RSI|TARA|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54910678,
    "published": 1764109530000,
    "title": "MegaETH scraps $1B plan after technical failures derail sale",
    "body": "Multiple technical failures during MegaETH’s pre-deposit phase pushed the raise beyond its limitations and forced the team to halt the sale.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54910849,
    "published": 1764105820000,
    "title": "Acting CFTC chair seeks CEOs for ‘innovation council,’ citing crypto policy",
    "body": "The US CFTC opened nominations for a CEO-led advisory group to help shape policy on crypto, prediction markets and other emerging products.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54911715,
    "published": 1764135830000,
    "title": "Coinbase reveals 9 crypto ideas it wants to bankroll in 2026",
    "body": "Coinbase Ventures outlined nine investment priorities for 2026, spanning RWA perpetuals, specialized exchanges, DeFi composability, and AI-powered development tools.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54911539,
    "published": 1764101700000,
    "title": "South Africa’s central bank flags crypto, stablecoins as financial risk",
    "body": "The bank cited increasing trading volume and the number of users at large exchanges, as well as gaps in South Africa’s regulatory framework on crypto.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54912220,
    "published": 1764136762000,
    "title": "Grayscale’s GDOG Debuts Quietly While DOGE Builds Higher Lows",
    "body": "DOGE is in a bullish consolidation phase, with technical indicators suggesting potential for upward movement if resistance at $0.154 is surpassed.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54911867,
    "published": 1764135830000,
    "title": "Coinbase reveals 9 crypto ideas it wants to bankroll in 2026",
    "body": "Coinbase Ventures outlined nine investment priorities for 2026, spanning RWA perpetuals, specialized exchanges, DeFi composability and AI-powered development tools.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54912187,
    "published": 1764133200000,
    "title": "Google closes in on Nvidia in the AI race",
    "body": "Nvidia shares wobble as Google gains upper hand in artificial intelligence",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54912752,
    "published": 1764137294000,
    "title": "Crypto-friendly Trump adviser Hassett top pick for Fed chair: Report",
    "body": "Kevin Hassett, who was central to the president’s crypto working group, has sprung up as a frontrunner to take over the Federal Reserve, Bloomberg reports.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54912587,
    "published": 1764096892000,
    "title": "Polymarket wins regulatory approval to operate US trading platform",
    "body": "The approval came as the US Senate is expected to vote soon on prospective CFTC chair Michael Selig as a replacement for acting Chair Caroline Pham.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54912809,
    "published": 1764080398000,
    "title": "South Korea stablecoin framework stalls as regulators split over banks’ role",
    "body": "Regulators and the Bank of Korea remain at odds over bank dominance in issuing won-backed stablecoins, stalling a long-awaited framework expected this year.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 54913057,
    "published": 1764080398000,
    "title": "South Korea stablecoin framework stalls as regulators split over banks’ role",
    "body": "Regulators and the Bank of Korea remain at odds over bank dominance in issuing won-backed stablecoins, stalling a long-awaited framework expected this year.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 54912906,
    "published": 1764080398000,
    "title": "South Korea stablecoin framework stalls as regulators split over banks’ role",
    "body": "Regulators and the Bank of Korea remain at odds over bank dominance in issuing won-backed stablecoins, stalling a long-awaited framework expected this year.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 54913380,
    "published": 1764080398000,
    "title": "South Korea stablecoin framework stalls as regulators split over banks’ role",
    "body": "Regulators and the Bank of Korea remain at odds over bank dominance in issuing won-backed stablecoins, stalling a long-awaited framework expected this year.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 54913218,
    "published": 1764080398000,
    "title": "South Korea stablecoin framework stalls as regulators split over banks’ role",
    "body": "Regulators and the Bank of Korea remain at odds over bank dominance in issuing won-backed stablecoins, stalling a long-awaited framework expected this year.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 54914879,
    "published": 1764140443000,
    "title": "Capriole Founder Not Bearish On Bitcoin Despite Headwinds—Here’s Why",
    "body": "The founder of Capriole Investments says he “cannot be bearish” on Bitcoin, pointing to key indicators that remain inside green territories. Bitcoin Heater & NVT Are Both Inside Bullish Zones In a new post on X, Capriole Investments founder Charles Edwards has shared a couple of indicators related to Bitcoin that could paint a picture different than what the crowd is thinking right now. Related Reading: XRP Jumps 7%, But Watch Out For Speculative Froth The first indicator is Capriole’s “Heater,” gauging the situation related to the derivatives market. The metric tracks the data associated with the entire sector, including perpetual swaps, futures, and options markets. When this indicator has a high value, it’s a sign that investors are using high leverage and have an extreme level of bullish positioning across the various derivatives markets. Now, here is the chart for the metric shared by Edwards that shows the trend in its value over the last few years: As is visible in the above graph, the Heater has witnessed a plunge recently as the Bitcoin price has crashed, indicating a cooldown in sentiment on the different derivatives markets. The metric is now inside the green zone, which has historically facilitated at least local bottom formations for the cryptocurrency. The same signal also emerged alongside the bear market bottom back in November 2022. The other indicator that’s bullish on Bitcoin right now is the Dynamic Range NVT. The Network Value to Transactions (NVT) Ratio is a popular BTC metric that’s used for measuring whether the asset’s value (that is, the market cap) is fair compared to the network’s ability to transact coins (the transaction volume). When this metric has a high value, it means that the market cap is high relative to the transaction volume. Such a trend could be a sign that a correction may be due for the coin. On the other hand, a low value on the metric can suggest the cryptocurrency’s value may not be inflated relative to its volume, and thus, could potentially have room to grow. Capriole’s Dynamic Range NVT defines lower and upper bands for the metric, beyond which the asset may be considered underbought and overbought, respectively. As the metric’s name suggests, these bands are dynamic, meaning that they change with time and reflect the recent Bitcoin environment. From the above chart, it’s apparent that the Bitcoin NVT Ratio has declined below its lower band recently, implying the coin may be undervalued. The last time this signal appeared was during the bearish period earlier in the year. Related Reading: Bitcoin To $40,000? Signal Behind Past 60% Crashes Is Back “We have some big headwinds to resolve (like institutional selling), but I cannot be bearish with Heater in the deep green zone today + fundamental value across the board,” said Edwards. The analyst suspects BTC might climb higher for at least the coming week. BTC Price At the time of writing, Bitcoin is floating around $87,000, down over 7% in the last seven days. Featured image from Dall-E, Capriole.com, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin Heater|bitcoin NVT|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54916077,
    "published": 1764142068000,
    "title": "Bitcoin Depot Contests $18.5M Award as Subsidiary Faces Dual Legal Battles",
    "body": "Cash Cloud’s bankruptcy case in Nevada cites similar claims mentioned in the Canada arbitral proceedings, according to Bitcoin Depot.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54917383,
    "published": 1764144055000,
    "title": "XRP ETFs Outshine BTC, ETH, And SOL Funds With $164M Single-Day Inflows",
    "body": "Spot XRP Exchange-Traded Funds (ETFs) started the week surpassing most crypto-based investment products after the record debut performance of Grayscale and Franklin Templeton’s funds. Related Reading: Bitcoin’s November Crash To Continue If This Level Isn’t Reclaimed, Analyst Warns GXRP, XRPZ See Record Debut This week, the second batch of spot XRP ETFs went live, debuting with a record-breaking performance. Notably, Grayscale and Franklin Templeton launched their XRP-based investment products, recording over $60 million in net inflows each during their first day. On Monday, Franklin Templeton debuted the new XRPZ ETF on NYSE Arca, highlighting that “its established utility in facilitating cross-currency settlement has made XRP a central component of the growing digital payments ecosystem.” Moreover, Grayscale followed the same path as with its other existing crypto-based private trusts, converting its XRP fund into the publicly traded GXRP ETF. In a significant achievement, both funds broke Canary Capital’s XRPC record as the biggest ETF debut of 2025. As reported by NewsBTC, Canary Capital launched the first single-token XRP spot ETF on November 13, smashing the initial expectations of multiple experts. After clearing the last regulatory hurdles, XRPC debuted on Nasdaq with a total volume of $58 million. Ahead of its launch, senior ETF analysts predicted that the fund could surpass Bitwise’s BSOL, which previously held this achievement. After the first 30 minutes, XRPC surprised market observers with $26 million in volume, suggesting strong initial demand. Meanwhile, BSOL recorded an impressive volume of $10 million in the first 30 minutes of trading, surging to $33 million by the half-day mark. The investment product closed its debut with $57 million in volume, beating all 900 other launches of the year. According to SoSoValue data, Franklin’s XRPZ and Grayscale’s GXRP saw an impressive $62.6 million and $67.4 million on their launch day, surpassing Canary’s XRPC record and becoming the best debuts of any ETFs in 2025 so far. XRP ETFs Steal The Spotlight Besides the remarkable launch of Grayscale and Franklin Templeton’s investment funds, the XRP ETF category’s performance surpassed that of other leading ETFs on Monday, including those based on the largest cryptocurrencies by market capitalization, Bitcoin (BTC), Ether (ETH), and Solana (SOL). Canary Capital’s XRPC and Bitwise’s XRP ETF brought in $16.4 million and $16.4 million, respectively, amounting to a total of $164 million in net inflows for the whole category on November 24. This performance was followed by ETH ETFs, which recorded $96.6 million in inflows, led by BlackRock’s ETHA. Solana-based funds came third with $58 million in positive net flows, extending their 20-day streak with a total of $568 million in inflows, according to Farside Invest data. Related Reading: Financial Strategist Debunks Prediction That Bitcoin Price Will Reach $220,000 In 45 Days Notably, spot XRP ETFs have seen cumulative net inflows of $586.8 million, registering an eight-day positive streak and surpassing the total inflows of SOL ETFs. On the contrary, Bitcoin ETFs registered the worst performance among the leading cryptocurrency funds. The investment products continued their choppy November performance, starting the week with $151 million in outflows, led by BlackRock’s IBIT. As of this writing, XRP is trading at $2.18, a 1.6% decline in the daily timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|Altcoin ETF|BSOL|Crypto ETFs|crypto ETFs Inflows|crypto market correcion|Franklin Templeton|grayscale|GXRP|xrp|XRP ETF|xrpusdt|XRPZ",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54919760,
    "published": 1764147603000,
    "title": "Monad (MON) Price Skyrockets 80%, Emerges As Best Performer Among Top 100 Cryptos",
    "body": "The Layer 1 blockchain Monad (MON) successfully went live on Monday, igniting a significant surge in its native token. Within 24 hours of its launch, MON emerged as the best-performing asset among the top 100 cryptocurrencies by market capitalization. MON Token Hits $0.045 All-Time High Last week, Monad’s token sale kicked off on Coinbase’s new token presale platform, gaining robust momentum by raising approximately $50 million. However, just 12 hours into the sale, that initial enthusiasm began to wane. The fundraising effort only accumulated $95 million of the ambitious $187 million target for Circle’s USDC stablecoin. Yet, once the Monad blockchain launched, investor interest reignited, leading to an impressive over 80% rise in the MON token’s value. Related Reading: Bitcoin Faces Less Than 50% Chance Of Hitting $100,000 By December 31, Says AI Model According to CoinGecko data, this price surge elevated the token to a diluted valuation of about $4 billion. By consolidating its gains, MON has managed to stay above the $0.040 mark, reaching a market capitalization nearing $440 million. Notably, the token also hit an all-time high (ATH) of $0.045 earlier on Tuesday, showcasing the heightened demand for MON in the past day. This rally comes despite a broader challenging environment for the cryptocurrency market, where Bitcoin (BTC) has retraced more than 30% from its ATH of $126,000 set back in October, and Ethereum (ETH) has struggled above the critical $3,000 level. The mainnet launch was accompanied by the listing of the MON token on several cryptocurrency exchanges, including Coinbase, Kraken, and Gemini (GEMI). Monad Trading Performance Surpasses Hyperliquid According to data from DeFillama, excitement around the MON token goes beyond its price. The Monad blockchain has already processed over three million transactions from around 140,000 addresses, with developers deploying more than 18,000 smart contracts. Investors who participated in the token sale had the opportunity to sell their holdings immediately after the launch. However, Coinbase has issued a warning to discourage early selling, stating that those who choose to sell their tokens within the first 30 days may face reduced allocations in future token sales. This aims to prioritize genuine enthusiasts of the project over traders looking for quick profits. Related Reading: Solana Rebounds Strong as Massive ETF Inflows Reinforce $128 Support Zone Furthermore, trading volume for MON on the Solana (SOL) blockchain exceeded $87 million in just 24 hours, surpassing the trading volume on Monad itself. This performance outstripped that of Hyperliquid (HYPE) by 149% and positioned MON ahead of platforms such as KuCoin, Gate, Kraken, and Bitget, making Solana the fifth-largest venue by total trading volume across exchanges. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto|crypto market|crypto news|cryptocurrency|MON|MON price|MON price news|MON token|Monad|Monad Airdrop|Monad blockchain|Monad news|MONUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 205,
        "NAME": "TOKEN SALE",
        "CATEGORY": "TOKEN SALE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54920556,
    "published": 1764086773000,
    "title": "MoonPay secures New York trust charter, expands regulated services",
    "body": "The regulatory approval followed the payments company obtaining a BitLicense from the NYDFS in June, making it one of a handful of crypto companies to have both.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54921063,
    "published": 1764149361000,
    "title": "Spain’s left-wing party proposes 47% crypto tax in ‘attack against Bitcoin’",
    "body": "Spain’s Sumar party wants to raise crypto taxes to 47%, classify all digital assets as seizable and introduce a “risk traffic light” system.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54920767,
    "published": 1764090833000,
    "title": "High percentage of Bitcoin, ETH, SOL held at a loss: Is it a bear market sign?",
    "body": "One analyst found that 40% of Bitcoin is held at a loss, while ETH and SOL data currently stand at 40% and 75% respectively. Should investors be worried?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54920919,
    "published": 1764090833000,
    "title": "High percentage of Bitcoin, ETH, SOL held at a loss: Is it a bear market sign?",
    "body": "One analyst found that 40% of Bitcoin is held at a loss, while ETH and SOL data currently stand at 40% and 75% respectively. Should investors be worried?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54920849,
    "published": 1764090833000,
    "title": "High percentage of Bitcoin, ETH, SOL held at a loss: Is it a bear market sign?",
    "body": "One analyst found that 40% of Bitcoin is held at a loss, while ETH and SOL data currently stand at 40% and 75% respectively. Should investors be worried?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54921001,
    "published": 1764090833000,
    "title": "High percentage of Bitcoin, ETH, SOL held at a loss: Is it a bear market sign?",
    "body": "One analyst found that 40% of Bitcoin is held at a loss, while ETH and SOL data currently stand at 40% and 75% respectively. Should investors be worried?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54921000,
    "published": 1764086773000,
    "title": "MoonPay secures New York trust charter, expands regulated services",
    "body": "The regulatory approval followed the payments company obtaining a BitLicense from the NYDFS in June, making it one of a handful of crypto companies to have both.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54921212,
    "published": 1764092627000,
    "title": "Klarna enters crypto with new USD stablecoin built on Stripe’s Tempo chain",
    "body": "The EU-licensed digital bank became the first financial institution to issue a token on Stripe and Paradigm’s layer-1 blockchain Tempo.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54921210,
    "published": 1764090833000,
    "title": "High percentage of Bitcoin, ETH, SOL held at a loss: Is it a bear market sign?",
    "body": "One analyst found that 40% of Bitcoin is held at a loss, while ETH and SOL data currently stand at 40% and 75% respectively. Should investors be worried?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54922336,
    "published": 1764151262000,
    "title": "AIOZ Network to ‘Empower’ Decentralized AI Devs with Open Models and Challenges",
    "body": "The platform’s open approach is designed around efficiency, security and accessibility—and to catalyze AI's development.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 177,
        "NAME": "AIOZ",
        "CATEGORY": "AIOZ"
      }
    ]
  },
  {
    "id": 54922977,
    "published": 1764151977000,
    "title": "BIS taps IMF digital money chief and CBDC hawk as new head of Innovation Hub",
    "body": "The Bank for International Settlements is advancing major digital currency pilots, testing cross-border CBDCs, tokenized deposits and real-time payment rails.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 54922592,
    "published": 1764093253000,
    "title": "Why the SEC’s new guidelines could speed up the approval process for new crypto ETFs",
    "body": "New SEC rules could reshape the crypto ETF landscape by speeding up approvals, reducing the shutdown backlog and giving issuers a clearer and faster path to market.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54922439,
    "published": 1764093253000,
    "title": "Why the SEC’s new guidelines could speed up the approval process for new crypto ETFs",
    "body": "New SEC rules could reshape the crypto ETF landscape by speeding up approvals, reducing the shutdown backlog and giving issuers a clearer and faster path to market.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54922907,
    "published": 1764093253000,
    "title": "Why the SEC’s new guidelines could speed up the approval process for new crypto ETFs",
    "body": "New SEC rules could reshape the crypto ETF landscape by speeding up approvals, reducing the shutdown backlog and giving issuers a clearer and faster path to market.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54922438,
    "published": 1764092627000,
    "title": "Klarna enters crypto with new USD stablecoin built on Stripe’s Tempo chain",
    "body": "The EU-licensed digital bank became the first financial institution to issue a token on Stripe and Paradigm’s layer-1 blockchain Tempo.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54922591,
    "published": 1764092627000,
    "title": "Klarna enters crypto with new USD stablecoin built on Stripe’s Tempo chain",
    "body": "The EU-licensed digital bank became the first financial institution to issue a token on Stripe and Paradigm’s layer-1 blockchain Tempo.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54922905,
    "published": 1764092627000,
    "title": "Klarna enters crypto with new USD stablecoin built on Stripe’s Tempo chain",
    "body": "The EU-licensed digital bank became the first financial institution to issue a token on Stripe and Paradigm’s layer-1 blockchain Tempo.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54923845,
    "published": 1764093253000,
    "title": "Why the SEC’s new guidelines could speed up the approval process for new crypto ETFs",
    "body": "New SEC rules could reshape the crypto ETF landscape by speeding up approvals, reducing the shutdown backlog and giving issuers a clearer and faster path to market.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54923770,
    "published": 1764093253000,
    "title": "Why the SEC’s new guidelines could speed up the approval process for new crypto ETFs",
    "body": "New SEC rules could reshape the crypto ETF landscape by speeding up approvals, reducing the shutdown backlog and giving issuers a clearer and faster path to market.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54924799,
    "published": 1764096892000,
    "title": "Polymarket wins regulatory approval to operate US trading platform",
    "body": "The approval came as the US Senate is expected to vote soon on prospective CFTC chair Michael Selig as a replacement for acting Chair Caroline Pham.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54924884,
    "published": 1764096892000,
    "title": "Polymarket wins regulatory approval to operate US trading platform",
    "body": "The approval came as the US Senate is expected to vote soon on prospective CFTC chair Michael Selig as a replacement for acting Chair Caroline Pham.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54925052,
    "published": 1764099794000,
    "title": "Paxos acquires Fordefi to power stablecoin, tokenization infrastructure",
    "body": "The addition of Fordefi’s MPC wallet infrastructure broadens Paxos’ regulated capabilities for custody, tokenization and institutional onchain operations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54924973,
    "published": 1764099794000,
    "title": "Paxos acquires Fordefi to power stablecoin, tokenization infrastructure",
    "body": "The addition of Fordefi’s MPC wallet infrastructure broadens Paxos’ regulated capabilities for custody, tokenization and institutional onchain operations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54925132,
    "published": 1764099794000,
    "title": "Paxos acquires Fordefi to power stablecoin, tokenization infrastructure",
    "body": "The addition of Fordefi’s MPC wallet infrastructure broadens Paxos’ regulated capabilities for custody, tokenization and institutional onchain operations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54925130,
    "published": 1764096892000,
    "title": "Polymarket wins regulatory approval to operate US trading platform",
    "body": "The approval came as the US Senate is expected to vote soon on prospective CFTC chair Michael Selig as a replacement for acting Chair Caroline Pham.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54925050,
    "published": 1764096892000,
    "title": "Polymarket wins regulatory approval to operate US trading platform",
    "body": "The approval came as the US Senate is expected to vote soon on prospective CFTC chair Michael Selig as a replacement for acting Chair Caroline Pham.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54926148,
    "published": 1764149361000,
    "title": "Spain’s junior ruling party proposes 47% crypto tax in ‘attack against Bitcoin’",
    "body": "Spain’s Sumar party wants to raise crypto taxes to 47%, classify all digital assets as seizable and introduce a “risk traffic light” system.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54925872,
    "published": 1764099794000,
    "title": "Paxos acquires Fordefi to power stablecoin, tokenization infrastructure",
    "body": "The addition of Fordefi’s MPC wallet infrastructure broadens Paxos’ regulated capabilities for custody, tokenization and institutional onchain operations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54926147,
    "published": 1764099794000,
    "title": "Paxos acquires Fordefi to power stablecoin, tokenization infrastructure",
    "body": "The addition of Fordefi’s MPC wallet infrastructure broadens Paxos’ regulated capabilities for custody, tokenization and institutional onchain operations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54925714,
    "published": 1764099794000,
    "title": "Paxos acquires Fordefi to power stablecoin, tokenization infrastructure",
    "body": "The addition of Fordefi’s MPC wallet infrastructure broadens Paxos’ regulated capabilities for custody, tokenization and institutional onchain operations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54925649,
    "published": 1764099794000,
    "title": "Paxos acquires Fordefi to power stablecoin, tokenization infrastructure",
    "body": "The addition of Fordefi’s MPC wallet infrastructure broadens Paxos’ regulated capabilities for custody, tokenization and institutional onchain operations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54925647,
    "published": 1764096892000,
    "title": "Polymarket wins regulatory approval to operate US trading platform",
    "body": "The approval came as the US Senate is expected to vote soon on prospective CFTC chair Michael Selig as a replacement for acting Chair Caroline Pham.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54926442,
    "published": 1764157133000,
    "title": "KakaoBank Pushes Forward With Korean Won-Backed Stablecoin Plans",
    "body": "The bank is ramping up technical work on a Korean won stablecoin after trademarks were filed ahead of forthcoming digital asset rules.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54926324,
    "published": 1764099794000,
    "title": "Paxos acquires Fordefi to power stablecoin, tokenization infrastructure",
    "body": "The addition of Fordefi’s MPC wallet infrastructure broadens Paxos’ regulated capabilities for custody, tokenization and institutional onchain operations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54926665,
    "published": 1764099794000,
    "title": "Paxos acquires Fordefi to power stablecoin, tokenization infrastructure",
    "body": "The addition of Fordefi’s MPC wallet infrastructure broadens Paxos’ regulated capabilities for custody, tokenization and institutional onchain operations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54927437,
    "published": 1764158414000,
    "title": "Bitcoin Faces More Downside After Recent Crash, Data Shows",
    "body": "Bitcoin suffered a sudden and deep drop in November, losing nearly a quarter of its value and wiping out over $1 trillion across the crypto market. Related Reading: Bitcoin’s Sudden Volatility Jump Signals Options Could Be Calling The Shots—Analyst Whales Trim Positions Before Crash According to on-chain data from CryptoQuant, large holders played a central role. Wallets holding between 1,000–10,000 BTC pared back their stakes in the weeks leading up to the fall. Those big sellers took profits after the October rally, and in many cases selling was steady rather than panicked. When large players step back like that, market depth can vanish quickly. A quick overview of Bitcoin’s price decline shows prices slid from record highs above $126,000 in October to roughly $81,000 at the lowest point, before a partial bounce to $87k was recorded. Traders and funds were caught off guard by the speed of the move. At the time of writing, Bitcoin was trading at $87,086, up 1.5% in the last 24 hours. Retail Selling Added To Pressure Based on reports, small wallets also leaned toward safety. Holders under 10 BTC and groups up to 1,000 BTC reduced positions, removing another layer of potential buyers. Has Bitcoin Found Its Bottom? Cohorts Tell the Whole Story “BTC may have formed a local bottom, supported by a strong rebound and accumulation from: 100–1k BTC holders. >10k BTC holders. However, the crucial 1k–10k BTC cohort is still distributing, preventing a full… pic.twitter.com/dGU4CBD1Bw — CryptoQuant.com (@cryptoquant_com) November 25, 2025 Buying interest from casual investors was weaker than expected. Mid-sized holders — those with 10–100 and 100–1,000 BTC — did buy during the correction, and their activity helped slow the slide. Still, their buying power was not enough to match the large outflows. Futures Liquidations Intensified The Drop Reports show that futures market dynamics turned a correction into a crash. Over a 13-day stretch, long positions were forcefully closed out. That cascade removed bids and created a chain reaction of selling that pushed Bitcoin from around $105K down to $81K. Liquidations were heavy, and the selling pressure was compounded as each forced sale fed into the next. A Tentative Rebound Shows Life After the lows were hit, Bitcoin climbed back to about $87,500. This rebound has been taken by some as a sign that a local bottom might be forming. According to CryptoQuant, however, the recovery cannot be considered secure while the 1,000–10,000 BTC group keeps reducing holdings. The market’s health was being tested by who chose to sell and who chose to buy. Bottom Status Hinges On Whale Activity Market watchers say a true reversal needs selling from large wallets to stop. If those whales pause, mid-sized buyers might build a firmer floor and confidence could return. If selling continues, lower levels may be explored once again. The coming sessions will be watched closely by traders who want to see whether large holders change course or keep cashing out. Related Reading: Bitcoin Creator Somehow Becomes ‘Poor’ By Losing $41 Billion Without Saying A Word For now, the situation is simple and tense at the same time: prices have recovered slightly, but the structural weakness that allowed a 25% fall was exposed. Bitcoin could face further losses after its recent crash, if CryptoQuant’s data is anything to go by. Large holders have been taking profits, while retail investors have also been selling, leaving fewer buyers to support the market. Analysts say the next move will depend on whether these big holders continue selling or if mid-sized buyers step in to stabilize prices. Featured image from Vecteezy, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|cryptoquant|whales",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54927176,
    "published": 1764158153000,
    "title": "Best Crypto Presales to Buy as Metaplanet Ignores Losses, Takes $130M Loan for Bitcoin Dip",
    "body": "What to Know: Best Wallet Presale marries Fireblocks MPC-CMP security with a mobile-first UX, Upcoming Tokens portal, and fee discounts for $BEST holders. With over $17.5 million raised and dynamic staking rewards, Best Wallet positions itself as a serious contender in the multi-chain wallet race. Maxi Doge blends meme culture with structured trading competitions, a dynamic APY model, and a funded treasury to support long-term community growth. Remittix targets real-world remittances, combining CertiK-audited smart contracts, CEX listings, and broad fiat coverage to streamline cross-border payments. Bitcoin just printed one of its sharpest retracements of the year, shedding around 30% since notching fresh highs in early October. Instead of de‑risking, Tokyo-listed Metaplanet is doubling down, taking a $130M loan to buy even more $BTC and effectively leveraging its existing holdings. That kind of aggressive treasury strategy is bullish for Bitcoin’s long-term narrative but brutal for balance sheets tied too tightly to spot prices. A number of digital asset treasuries are now sitting on sizeable drawdowns and seeing the impact in equity volatility and governance pressure across the sector. For many investors, the message is simple: holding only $BTC on the corporate or personal balance sheet is a concentration risk. In corrections like this, capital often rotates toward high-conviction presales that can outrun Bitcoin on a percentage basis if the next leg higher plays out as expected. That’s where this current cycle looks interesting. Some of the best crypto presales in the market are not just meme-driven liquidity grabs; they’re building actual infrastructure in wallets, trading communities, and cross-border payments. Below are three presales and early-stage tokens that are catching this rotation, led by Best Wallet Presale ($BEST) , which is a direct play on the wallet layer of Web3. 1. Best Wallet Presale ($BEST) — The Next Gen Crypto Wallet If Metaplanet is the poster child for balance-sheet Bitcoin, Best Wallet Presale ($BEST) is a bet on the rails that everyday users actually touch. The project wants to capture 40% of the crypto wallet market by the end of 2026 by becoming the easiest, safest, most feature‑dense wallet on mobile. Instead of choosing between custodial convenience and clunky non-custodial UX, Best Wallet integrates Fireblocks’ MPC-CMP infrastructure for institutional-grade key management into a consumer-friendly, mobile-first app. Users can build custom multi-wallet portfolios across multiple chains, with a Rubic-powered DEX aggregator for best execution. Where it really differentiates itself in a risk-on presale cycle is discovery. The Upcoming Tokens portal curates early-stage launches and streamlines the presale participation flow, allowing you to access vetted early token opportunities directly from your wallet. That matters when investors are hunting the ‘next one’ without wanting to chase every Telegram link and sketchy landing page. You can dive deeper into the token’s fundamentals in this recent analysis. On the token side, $BEST holders get reduced transaction fees across the ecosystem and access to higher-yield options via a built-in staking aggregator. There’s an 8% allocation (800M tokens) reserved for staking rewards, with a dynamic APY based on a user’s share of the pool, and immediate staking is already live for presale buyers. Learn how to buy $BEST to start staking today. That mix is clearly resonating. The presale has already raised $17.5M with tokens at $0.026005, positioning Best Wallet among the cycle’s largest wallet-focused raises. For a longer-term view on where the token could trade post-launch, see this Best Wallet price prediction . If you’re comparing wallet plays in this drawdown, it’s worth digging deeper into how Best Wallet’s Fireblocks MPC-CMP stack and presale access machine could reprice the category. Learn more about Best Wallet Token. 2. Maxi Doge ($MAXI) — High-Octane Meme Trading Community If Bitcoin leverage is moving off-chain into corporate treasuries, meme culture is still where retail tests its risk tolerance. Maxi Doge ($MAXI) leans directly into that with a ‘never skip leg-day, never skip a pump’ brand that wraps 1000x energy into a community-first meme ecosystem. Rather than just vibing on memes, Maxi Doge emphasizes trader identity. The project bills itself as a 240‑lb canine juggernaut representing the leveraged degen mindset, then backs it with holder-only trading competitions, leaderboards, and rewards designed to gamify high-conviction trading behavior without needing actual 1000x perpetuals. The tokenomics are tuned for engagement and runway. A Maxi Fund treasury supports liquidity and partnership deals, while a dynamic APY staking mode (currently sitting at 73%) rewards longer-term conviction in the community. That gives $MAXI more structural depth than the average meme coin that dominated earlier cycles. Money is noticeable here, too. The presale has raised $4.2M with tokens priced at $0.00027, a level that still leaves psychological room for the ‘many zeros’ meme crowd while funding real ecosystem development. To learn more, check out our guide on how to buy $MAXI. If you think culture remains the leading indicator for liquidity, Maxi Doge is an obvious candidate on the meme side of this rotation. For traders who want meme exposure that is explicitly built around trading competitions and treasury-backed expansion, Maxi Doge offers a differentiated angle versus yet another dog with no roadmap. Check out the Maxi Doge presale. 3. Remittix (RTX) — DeFi Rails for Global Crypto Remittances While Metaplanet borrows against BTC to stack more, another big use case for crypto remains unsolved at scale: making cross-border money transfers cheaper and faster without forcing users to care about gas fees or bridges. Remittix ($RTX) is an Ethereum-based DeFi project built specifically for crypto‑to‑fiat remittances. The protocol focuses on crypto-to-bank transfers with real-time FX conversion, allowing users to send from supported cryptocurrencies and have receivers receive fiat in their local bank accounts. Its mobile wallet reportedly supports 40+ cryptocurrencies and 30+ fiat currencies across more than 30 countries, positioning Remittix as a specialist remittance rail rather than a general-purpose DeFi wallet. Security and listings are already part of the story. CertiK has audited Remittix smart contracts , and the token has confirmed listings on BitMart and LBank, which can help with post-presale liquidity. The team has also lined up a $250K giveaway campaign around its Q3 2025 wallet beta launch, using incentives to bootstrap user adoption. In terms of capital raised, Remittix is one of 2025’s standout presales, reportedly pulling in over $24.5M and ranking as a top pre-launch token by volume. For investors looking beyond price action into real-world payment rails, Remittix offers a complementary thesis to wallet and meme plays: turning volatile crypto into local fiat with minimal friction. Learn more on the official Remittix site. Recap : As Metaplanet levers up on Bitcoin after a 30% drawdown, capital is rotating into high-conviction presales with clear narratives. Best Wallet Token , Maxi Doge , and Remittix each target different parts of the stack, with Best Wallet’s Fireblocks-powered, presale-focused app standing out as the most infrastructure-driven bet. This article is for informational purposes only and does not constitute financial, investment, or trading advice of any kind. Authored by Aaron Walker for NewsBTC – https://www.newsbtc.com/news/best-crypto-presales-metaplanet-bitcoin-loan-best-wallet",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54927515,
    "published": 1764099794000,
    "title": "Paxos acquires Fordefi to power stablecoin, tokenization infrastructure",
    "body": "The addition of Fordefi’s MPC wallet infrastructure broadens Paxos’ regulated capabilities for custody, tokenization and institutional onchain operations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54927684,
    "published": 1764158592000,
    "title": "Trump-backed WLFI ramps up buybacks as token stays nearly 50% below launch price",
    "body": "The Trump family-backed WLFI purchased nearly $8 million worth of tokens, aiming to mitigate the downtrend of the token by artificially reducing the outstanding supply.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54928021,
    "published": 1764099794000,
    "title": "Paxos acquires Fordefi to power stablecoin, tokenization infrastructure",
    "body": "The addition of Fordefi’s MPC wallet infrastructure broadens Paxos’ regulated capabilities for custody, tokenization and institutional onchain operations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54928811,
    "published": 1764160262000,
    "title": "U.S. Investigated Bitcoin Miner Manufacturer Bitmain as National Security Risk: Report",
    "body": "The DHS has reportedly investigated whether Bitmain can remotely control Bitcoin miners—though experts say it would be hard to do undetected.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54929221,
    "published": 1764160893000,
    "title": "Best Crypto to Buy After Bitcoin Whale Bets $2 Billion on Market Rebound",
    "body": "What to Know: Bitcoin Hyper uses a modular Bitcoin L1 + SVM L2 design to deliver high-speed, low-fee smart contracts secured by Bitcoin settlement. Presale-stage projects like Bitcoin Hyper and PEPENODE offer high-beta upside if whale-led Bitcoin accumulation evolves into a full risk-on altcoin cycle. PEPENODE’s mine-to-earn concept and tiered virtual node rewards add a game layer to the memecoin thesis ahead of the next meme rotation. Shiba Inu’s Shibarium, ecosystem tokens, and ETF inclusion show how meme-origin assets can evolve into institutional-facing Web3 platforms. Bitcoin whales just injected more than $2B into fresh BTC exposure, a bold move at a time when retail traders are still de-risking after months of chop, liquidations, and sideways boredom. For deep-pocketed players, this combination of capitulation and discounted pricing is exactly when the risk-reward flips back toward accumulation. We’re witnessing a notable divergence: smaller wallets are continuing to step back from spot and derivatives markets, while large addresses are quietly scaling in, and ETF flows are showing early signs of stabilizing. Historically, that rotation has preceded some of Bitcoin’s sharpest recovery phases, driven by a tightening of supply and a resumption of liquidity-hunting momentum once it returns. If that script repeats, it won’t just be BTC moving higher. When Bitcoin finds a base and pivots, it tends to pull high-conviction altcoins, early-stage infrastructure projects, and high-beta meme ecosystems up with it. The window before sentiment officially flips is usually when asymmetric bets hit hardest. Against that backdrop, three very different plays are emerging as early beneficiaries of a potential rebound, a mix that fits neatly into the current search for the best crypto to buy now : Bitcoin Hyper (HYPER) with its high-speed Bitcoin Layer-2 narrative, PEPENODE as a mine-to-earn meme-infrastructure hybrid gaining traction, and Shiba Inu, which continues evolving into a more mature ecosystem with growing institutional recognition. 1. Bitcoin Hyper ($HYPER) — First Bitcoin Layer 2 With SVM Speed Bitcoin Hyper is pitching itself as the first true Bitcoin Layer 2, engineered to tackle three of Bitcoin’s biggest structural limitations in one shot: slow confirmations, high L1 fees during congestion, and the lack of native smart contracts. The solution is a modular architecture that keeps Bitcoin L1 for settlement while shifting execution to a high-speed SVM-powered Layer 2. Rather than forcing Bitcoin to behave like an all-purpose chain, $HYPER bolts Solana-grade performance onto Bitcoin’s security base. By integrating the Solana Virtual Machine , developers can deploy fast, parallelized smart contracts that rival, and in some cases surpass, Solana on raw execution throughput, while still anchoring finality to Bitcoin. SPL-compatible tokens port natively to the L2, lowering the friction for projects migrating from the Solana ecosystem. For users, this opens the door to instant, low-fee payments in wrapped BTC, plus a full DeFi stack, swaps, lending markets, and staking protocols that Bitcoin has never supported natively. NFT platforms, gaming projects, and high-throughput dApps can be built using a Rust-based SDK designed for teams already familiar with Solana tooling but who want Bitcoin’s monetary premium and credibility. On the market side, demand has been unmistakable. The Bitcoin Hyper presale has crossed $28.5M raised, with tokens priced around $0.013335, putting it firmly on the radar of early infrastructure investors, especially those now searching for how to buy $HYPER before the next stage unlocks. Two high-net-worth wallets accumulated roughly $396K in recent weeks, including a single $53K buy , the kind of early whale activity that typically signals conviction, not speculation. Staking activates from TGE with high-APY rewards (41% currently), instant access for presale participants, and a short 7-day vesting window. And for anyone still asking what Bitcoin Hyper is , the reward model is designed to scale with both capital staked and ecosystem participation, nudging holders toward long-term alignment rather than short-term flipping. You can join the $HYPER presale here. 2. PEPENODE ($PEPENODE) — A Mine-to-Earn Memecoin Built on Node Economics For investors who want meme exposure without relying purely on virality, PEPENODE takes a different route. It blends meme culture with mine-to-earn mechanics, giving holders an actual system to participate in rather than a passive buy-and-pray model. Users operate virtual nodes, level them up, and earn tiered rewards based on engagement, creating a structure that feels closer to early Bitcoin mining culture, just gamified for the modern meme cycle. The setup is simple but effective: a dashboard tracks your virtual mining activity, while a tiered node system determines how much of the emissions or rewards you capture. Higher-tier nodes earn more, meaning early entry and consistent participation can potentially unlock larger upside. It’s a memecoin, but with a built-in engine that rewards activity instead of pure hype. On the fundraising front, the presale has already pulled in over $2.2M, with tokens priced at $0.0011638, modest compared with major infrastructure plays but strong for a narrative-driven meme project still in distribution. Our $PEPENODE price prediction suggests it could reach $0.0077 by the end of 2026 if the mine-to-earn narrative gains traction. And with whales positioning for a broader market rebound, even small capital inflows into meme-adjacent experiments can trigger big percentage moves. There’s no formal staking program yet, which makes PEPENODE a pure speculation and gamified-yield play rather than a yield-maximization platform. But that’s also the appeal: if mine-to-earn catches fire with retail during the next meme rotation, token prices don’t need to move far to generate outsized returns. Explore the PEPENODE presale here. 3. Shiba Inu (SHIB) — A Meme Brand Turning Into a Full Web3 Stack Shiba Inu (SHIB) may have launched as a pure meme, but it has steadily transformed into a broad Web3 ecosystem spanning DeFi, payments, and infrastructure. The backbone of that evolution is Shibarium, the project’s EVM-compatible Layer 2 designed for low-cost, high-throughput transactions. By offloading activity from the Ethereum mainnet, Shibarium gives the Shiba ecosystem room to scale while preserving its connection to the wider EVM universe. The ecosystem now stretches well beyond SHIB. Tokens like BONE, LEASH, and TREAT support governance, liquidity incentives, and additional utility layers, while ShibaSwap provides the DeFi foundation for swapping, liquidity pools, and yield tools. A pipeline of privacy-enhanced smart contracts and broader Web3 modules adds to the long-term ambition: converting one of crypto’s largest communities into a functioning, self-sustaining platform. Institutional validation has also started to crystallize. On October 22, 2025, Shiba Inu appeared in T. Rowe Price’s proposed US SEC–filed Active Crypto ETF, marking one of the clearest signals yet that major asset managers view SHIB as more than a meme; they see it as a liquid, brand-strong asset suitable for traditional investment products. For investors, that combination, a sticky global community, a working Layer 2, a growing dApp stack, and early ETF exposure, positions SHIB as a more conservative meme-side allocation compared with presale-stage tokens. It may not move like a microcap, but it can serve as a solid satellite position if a broader altcoin rotation follows the whales’ $2B Bitcoin bet. Learn more on the official Shiba Inu site. Recap: Bitcoin whales are leaning into a rebound with more than $2B in fresh exposure, and that kind of conviction has historically spilled into high-upside altcoins. In this setup, Bitcoin Hyper , PEPENODE , and Shiba Inu each tap a different angle of the opportunity, Bitcoin Hyper as the pure infrastructure play bringing Solana-level speed to Bitcoin, PEPENODE as a high-beta mine-to-earn meme experiment, and SHIB as the established ecosystem now earning institutional attention. For those positioning early, the $HYPER and PEPENODE presales offer the most asymmetric setups while SHIB serves as the steadier ecosystem anchor. This article is for informational purposes only and does not constitute financial, investment, or trading advice; always do your own research. Authored by Aaron Walker, NewsBTC – https://www.newsbtc.com/news/best-crypto-to-buy-after-bitcoin-whale-2b-bet/",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 44,
        "NAME": "SHIB",
        "CATEGORY": "SHIB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54929211,
    "published": 1764158592000,
    "title": "Trump-backed WLFI ramps up buybacks as token lingers 50% below launch price",
    "body": "The Trump family-backed WLFI purchased nearly $8 million worth of tokens, aiming to mitigate the downtrend of the token by artificially reducing the outstanding supply.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54929554,
    "published": 1764105820000,
    "title": "Acting CFTC chair seeks CEOs for ‘innovation council,’ citing crypto policy",
    "body": "The US CFTC opened nominations for a CEO-led advisory group to help shape policy on crypto, prediction markets and other emerging products.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54929250,
    "published": 1764101700000,
    "title": "South Africa’s central bank flags crypto, stablecoins as financial risk",
    "body": "The bank cited increasing trading volume and the number of users at large exchanges, as well as gaps in South Africa’s regulatory framework on crypto.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54929386,
    "published": 1764101700000,
    "title": "South Africa’s central bank flags crypto, stablecoins as financial risk",
    "body": "The bank cited increasing trading volume and the number of users at large exchanges, as well as gaps in South Africa’s regulatory framework on crypto.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54929044,
    "published": 1764101700000,
    "title": "South Africa’s central bank flags crypto, stablecoins as financial risk",
    "body": "The bank cited increasing trading volume and the number of users at large exchanges, as well as gaps in South Africa’s regulatory framework on crypto.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54929553,
    "published": 1764101700000,
    "title": "South Africa’s central bank flags crypto, stablecoins as financial risk",
    "body": "The bank cited increasing trading volume and the number of users at large exchanges, as well as gaps in South Africa’s regulatory framework on crypto.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54929210,
    "published": 1764101700000,
    "title": "South Africa’s central bank flags crypto, stablecoins as financial risk",
    "body": "The bank cited increasing trading volume and the number of users at large exchanges, as well as gaps in South Africa’s regulatory framework on crypto.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54929592,
    "published": 1764105820000,
    "title": "Acting CFTC chair seeks CEOs for ‘innovation council,’ citing crypto policy",
    "body": "The US CFTC opened nominations for a CEO-led advisory group to help shape policy on crypto, prediction markets and other emerging products.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54930085,
    "published": 1764105820000,
    "title": "Acting CFTC chair seeks CEOs for ‘innovation council,’ citing crypto policy",
    "body": "The US CFTC opened nominations for a CEO-led advisory group to help shape policy on crypto, prediction markets and other emerging products.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54929727,
    "published": 1764105820000,
    "title": "Acting CFTC chair seeks CEOs for ‘innovation council,’ citing crypto policy",
    "body": "The US CFTC opened nominations for a CEO-led advisory group to help shape policy on crypto, prediction markets and other emerging products.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54929590,
    "published": 1764101700000,
    "title": "South Africa’s central bank flags crypto, stablecoins as financial risk",
    "body": "The bank cited increasing trading volume and the number of users at large exchanges, as well as gaps in South Africa’s regulatory framework on crypto.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54930084,
    "published": 1764101700000,
    "title": "South Africa’s central bank flags crypto, stablecoins as financial risk",
    "body": "The bank cited increasing trading volume and the number of users at large exchanges, as well as gaps in South Africa’s regulatory framework on crypto.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54930707,
    "published": 1764162250000,
    "title": "Blockrise wins Dutch MiCA license, brings Bitcoin-backed loans to EU businesses",
    "body": "Blockrise secures a MiCA license in the Netherlands, unlocking regulated Bitcoin custody and trading while paving the way for BTC-backed business loans across Europe.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54930396,
    "published": 1764162250000,
    "title": "Blockrise wins Dutch MiCA license, brings Bitcoin-backed loans to EU businesses",
    "body": "Blockrise secures a MiCA licence in the Netherlands, unlocking regulated Bitcoin custody and trading while paving the way for BTC-backed business loans across Europe.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54930706,
    "published": 1764105820000,
    "title": "Acting CFTC chair seeks CEOs for ‘innovation council,’ citing crypto policy",
    "body": "The US CFTC opened nominations for a CEO-led advisory group to help shape policy on crypto, prediction markets and other emerging products.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54930877,
    "published": 1764105820000,
    "title": "Acting CFTC chair seeks CEOs for ‘innovation council,’ citing crypto policy",
    "body": "The US CFTC opened nominations for a CEO-led advisory group to help shape policy on crypto, prediction markets and other emerging products.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54930727,
    "published": 1764105820000,
    "title": "Acting CFTC chair seeks CEOs for ‘innovation council,’ citing crypto policy",
    "body": "The US CFTC opened nominations for a CEO-led advisory group to help shape policy on crypto, prediction markets and other emerging products.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54930394,
    "published": 1764105820000,
    "title": "Acting CFTC chair seeks CEOs for ‘innovation council,’ citing crypto policy",
    "body": "The US CFTC opened nominations for a CEO-led advisory group to help shape policy on crypto, prediction markets and other emerging products.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54930219,
    "published": 1764105820000,
    "title": "Acting CFTC chair seeks CEOs for ‘innovation council,’ citing crypto policy",
    "body": "The US CFTC opened nominations for a CEO-led advisory group to help shape policy on crypto, prediction markets and other emerging products.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54931207,
    "published": 1764105820000,
    "title": "Acting CFTC chair seeks CEOs for ‘innovation council,’ citing crypto policy",
    "body": "The US CFTC opened nominations for a CEO-led advisory group to help shape policy on crypto, prediction markets and other emerging products.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54931895,
    "published": 1764164472000,
    "title": "Kevin Hasset Takes Pole Position for Future Fed Chair, Best Wallet to Benefit?",
    "body": "What to Know: A Hassett-led Fed under a Trump administration could mean earlier rate cuts and a more tolerant crypto stance, boosting risk-asset demand globally. Wallets sit at the front line of any new adoption wave, but many incumbents remain either highly centralized or overly complex for retail users. Best Wallet targets these gaps with MPC-secured, mobile-first UX plus tokenized perks, aiming for 40% global crypto wallet market share by end-2026. If US policy genuinely softens, infrastructure tokens tied to wallets, on-ramps and aggregators may see renewed interest alongside large-cap Layer-1 assets. Kevin Hassett stepping into pole position as President Donald Trump’s preferred candidate for the next Fed Chair is more than a personnel story; it’s a regime shift signal. That’s because Kevin Hassett isn’t a neutral party. He’s strongly pro-crypto, a stakeholder in Coinbase, and has gone on record as wanting to cut rates now. Analysts are excited, and markets are already gaming out a tilt toward earlier rate cuts, looser dollar liquidity, and a friendlier stance toward digital assets and financial innovation. For crypto, that combination typically acts as rocket fuel. Lower real yields reduce the opportunity cost of holding volatile assets like Bitcoin and Ether, while a less hostile regulatory tone lowers headline risk for exchanges, stablecoins and token issuers. If you’re already positioned in crypto, you’re effectively front‑running a potential pivot in US monetary and regulatory policy. But cheaper liquidity alone doesn’t onboard the next 100M users. What actually determines whether new capital sticks is infrastructure: wallets, ramps and applications that feel safe, intuitive and rewarding for everyday users, not just DeFi natives. That’s where the next competitive cycle is likely to play out if a Hassett-led Fed normalizes the macro backdrop. In that context, Best Wallet Token ($BEST) is positioned as a bet on the wallet layer rather than just another speculative token. The Best Wallet app aims to pair institutional‑grade security with mobile‑first UX and presale access, pitching itself as a gateway product for the next wave of mainstream adoption if regulatory clouds clear. As the macro narrative evolves, you’re likely to see more attention on which wallet ecosystems can actually capture and retain this inflow. That shift from trading coins to owning rails puts projects like Best Wallet in a very different category than short‑cycle meme coins or one‑off DeFi farms. How A Hassett Fed Could Reshape Crypto Wallet Demand If Hassett does take the chair, markets would likely price in a faster path to policy easing and a softer line on digital assets. That combination historically correlates with higher trading volumes, exchange sign‑ups, and first‑time wallet downloads as retail traders re‑enter the market looking for beta. Most of those newcomers won’t start on hardcore DeFi. They’ll land in retail‑friendly wallets like MetaMask, Trust Wallet or Coinbase Wallet, which act as default gateways. Yet these incumbents either lean heavily centralized, with KYC and recovery tied to a single provider, or remain clunky for mobile‑first users who expect a Web2‑grade experience. This is the opening innovative wallet ecosystems like Best Wallet are chasing. The Best Wallet Token presale enters this crowded field trying to solve for security, UX and upside participation in one stack, rather than forcing you to choose. Why Best Wallet Token Is Leaning into the Next Cycle Where many wallets simply custody assets and route swaps, Best Wallet Token is trying to build an integrated environment for what a more permissive US policy regime might unleash. The project’s core claim is ambitious: capture up to 40% of global crypto wallet market share by the end of 2026 by offering the easiest, safest and most feature‑rich mobile experience. On the security side, Best Wallet plans to be the first fully integrated Fireblocks MPC‑CMP wallet in the retail segment, bringing institutional‑grade multi‑party computation to everyday users. In practice, that means key material is split across multiple parties and devices, removing the single private‑key failure point that has plagued traditional non‑custodial wallets for a decade. Beyond security, the wallet leans into discovery and execution. A built‑in Upcoming Tokens portal is designed to simplify presale participation by curating and vetting early‑stage opportunities, while a Best DEX aggregator – powered by Rubic – routes trades across 200+ DEXs and 20 cross‑chain bridges. That’s aimed squarely at the cross‑chain fragmentation you probably feel every time you move between ecosystems. The $BEST token underpins this ecosystem with real utility: reduced fees inside the Best Wallet stack, boosted yields via a staking aggregator, governance rights, and preferential access to curated presales. The presale has already raised $17.5M, with tokens currently priced at $0.026005 and staking at 75%, suggesting growing demand for exposure to the wallet layer of the stack. To join in, discover how to buy $BEST. On‑chain data shows significant whale transactions (as verified on-chain), including one of $70.2K. This hints at the fact that some smart money is positioning early around the thesis that wallets, not just Layer-1s and Layer-2s, could be prime beneficiaries of a friendlier US policy environment. If you share that view, this cycle may be less about chasing every new token and more about choosing the right rails. That cycle could benefit $BEST incredibly – our $BEST price prediction sees the token potentially reaching $0.05106175 by the end of 2026. Research, then decide whether $BEST fits your risk profile. But hurry – the Best Wallet Token presale closes in less than two days. 🚀 Join the $BEST presale while you still can. Disclaimer: This article is for informational purposes only and does not constitute financial, investment or trading advice; always do your own research. Authored by Aaron Walker for NewsBTC – https://www.newsbtc.com/news/kevin-hasset-takes-pole-position-for-future-fed-chair-best-wallet-to-benefit",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54931910,
    "published": 1764109530000,
    "title": "MegaETH scraps $1B plan after technical failures derail sale",
    "body": "Multiple technical failures during MegaETH’s pre-deposit phase pushed the raise beyond its limitations and forced the team to halt the sale.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54931733,
    "published": 1764109530000,
    "title": "MegaETH scraps $1B plan after technical failures derail sale",
    "body": "Multiple technical failures during MegaETH’s pre-deposit phase pushed the raise beyond its limitations and forced the team to halt the sale.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54932716,
    "published": 1764165600000,
    "title": "A New Crypto Project Vowed to Transform Stablecoins. Then Its Token Crashed 90%",
    "body": "The stablecoin infrastructure hopeful is trading nearly 90% below its early peak, with thin usage, supply pressure and sparse communication fueling uncertainty about whether the sell-off has truly run its course.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Plasma|Stablecoins|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54932752,
    "published": 1764109530000,
    "title": "MegaETH scraps $1B plan after technical failures derail sale",
    "body": "Multiple technical failures during MegaETH’s pre-deposit phase pushed the raise beyond its limitations and forced the team to halt the sale.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54932371,
    "published": 1764109530000,
    "title": "MegaETH scraps $1B plan after technical failures derail sale",
    "body": "Multiple technical failures during MegaETH’s pre-deposit phase pushed the raise beyond its limitations and forced the team to halt the sale.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54932414,
    "published": 1764109530000,
    "title": "MegaETH scraps $1B plan after technical failures derail sale",
    "body": "Multiple technical failures during MegaETH’s pre-deposit phase pushed the raise beyond its limitations and forced the team to halt the sale.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54932706,
    "published": 1764109530000,
    "title": "MegaETH scraps $1B plan after technical failures derail sale",
    "body": "Multiple technical failures during MegaETH’s pre-deposit phase pushed the raise beyond its limitations and forced the team to halt the sale.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54933402,
    "published": 1764166181000,
    "title": "Thailand asks Sam Altman’s World to delete 1.2M iris scans over data risks",
    "body": "Sam Altman-backed digital ID project World halts Thai operations after authorities cite violations of the WLD token exchange and the Personal Data Protection Act.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 145,
        "NAME": "WLD",
        "CATEGORY": "WLD"
      }
    ]
  },
  {
    "id": 54933428,
    "published": 1764126379000,
    "title": "Grayscale spot Dogecoin ETF falls under volume expectations on debut",
    "body": "Trading volume on the debut of Grayscale's first US spot Dogecoin ETF came in under an analyst’s expectation, with Bitwise soon to launch its own fund.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54933424,
    "published": 1764109530000,
    "title": "MegaETH scraps $1B plan after technical failures derail sale",
    "body": "Multiple technical failures during MegaETH’s pre-deposit phase pushed the raise beyond its limitations and forced the team to halt the sale.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54932932,
    "published": 1764109530000,
    "title": "MegaETH scraps $1B plan after technical failures derail sale",
    "body": "Multiple technical failures during MegaETH’s pre-deposit phase pushed the raise beyond its limitations and forced the team to halt the sale.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54932896,
    "published": 1764109530000,
    "title": "MegaETH scraps $1B plan after technical failures derail sale",
    "body": "Multiple technical failures during MegaETH’s pre-deposit phase pushed the raise beyond its limitations and forced the team to halt the sale.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  }
]