[
  {
    "id": 55198191,
    "published": 1764581454000,
    "title": "$300 Million Crypto Bet: Kazakhstan’s Central Bank Gears Up",
    "body": "Kazakhstan’s central bank has signaled plans to place up to $300 million into crypto and crypto-linked assets, a move that would mark one of the clearest examples yet of a sovereign institution putting reserve money into this market. Based on reports, the funds would come from the country’s gold and foreign-exchange reserves rather than its social or oil wealth funds. Related Reading: Bitcoin Miners Face A Harsh December: Rising BTC Difficulty, Falling Hashprice Central Bank Moves Cautiously According to central bank briefings and market reporting, the investment will not be made all at once. Initial tranches could be modest — figures discussed publicly include amounts like $50 million and $100 million as possible early steps, with larger allocations of $250 million also on the table if conditions allow. The plan appears to be phased, with the bank watching price swings and market signals before committing major sums. The assets under consideration may include direct holdings of crypto tokens or instruments linked to the crypto sector, such as exchange-traded products and equity stakes in companies that serve the industry. Based on reports, the central bank’s alternative investments arm, which already holds high-tech and financial assets, would manage the placement. Investment Targets And Broader Plans Reports have disclosed that this move sits alongside a wider push to create a national digital-asset reserve fund. Officials and informed sources have mentioned target sizes in the range of $500 million to $1 billion for that reserve. That proposed fund would focus more on ETFs and corporate equity than on simply holding tokens in wallets. An existing state initiative, the Alem Crypto Fund, has already taken public steps into the market. In September 2025 the fund made an investment in the cryptocurrency BNB, signaling that parts of the state apparatus are experimenting with exposure to digital assets. That action is being watched closely by both domestic policymakers and foreign observers. Related Reading: Bitcoin Sentiment Sparks CZ Comment: Sell Greed, Buy Fear Risks And Safeguards The central bank has stressed caution. Large price swings in major tokens have been noted as a reason to phase investments slowly. The proposed $300 million allocation, according to briefings, would be drawn from non-essential reserves — explicitly kept separate from Kazakhstan’s National Fund that pays for public programs — which is meant to protect social spending from market losses. Some of the purchases, reports suggest, could be executed through regulated financial products rather than raw token buys, lowering custody and liquidity risks. The decision to structure the program in stages is intended to reduce the chance of a sudden, large loss if markets move against the holdings. Featured image from kursiv.media, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|bank|bitcoin|crypto|crypto market|crypto news|cryptocurrency|digital currency|kazakhstan",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55198271,
    "published": 1764581267000,
    "title": "HashKey edges toward Hong Kong listing while China chills stablecoin plans",
    "body": "HKEX has published a post-hearing information pack for HashKey Holdings, pushing Hong Kong’s top crypto exchange closer to a high-profile IPO.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55197771,
    "published": 1764580869000,
    "title": "Japan to Cut Crypto Tax Burden to 20% Uniform Rate in Boost for Local Bitcoin Traders",
    "body": "The proposed tax change, supported by the government, will categorize crypto profits under a separate-taxation framework.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55199235,
    "published": 1764582811000,
    "title": "Bitcoin, Ethereum, and XRP Crash Triggering $637M in Liquidations",
    "body": "A weekend crypto crash triggered $524M in liquidations, with fears over Tether's stability and DAT selling pressure acting as key catalysts.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55200119,
    "published": 1764584076000,
    "title": "$XRP Eyes $10–$20 As Traders Shift Toward Maxi Doge",
    "body": "What to Know: An $XRP breakout toward $10–$20 could trigger a classic top-down rotation, pushing traders from majors into smaller, higher-beta meme coins and community tokens. In risk-on phases, performance-based trading communities and leaderboard-driven contests often attract capital faster than passive ‘hold and hope’ meme coin projects. Maxi Doge targets retail traders without whale capital, combining 1,000x leverage culture, trading competitions, and staking rewards into a meme coin-driven trading hub. Preparing a rotation strategy before any confirmed $XRP breakout can help traders capture outsized upside instead of chasing extended large-cap moves late in the cycle. $XRP has crept back into the conversation as one of the few majors with truly asymmetric upside narratives still on the table. With some analysts floating $10 and even $20 targets if the macro and legal backdrop line up, traders are again gaming out what a confirmed breakout could do to wider risk appetite. If $XRP even starts closing weekly candles above prior cycle resistance, you’re likely looking at a market that flips aggressively risk-on. Historically, that’s when flows tend to cascade down the curve: from Bitcoin into large-cap alts, then into higher-beta sectors like meme coins and micro-cap narratives. For traders, the question isn’t just ‘will $XRP hit $10?’ but ‘how do you position if it tries?’. In a regime shift like that, majors can double or triple, but small caps and meme coins often move 10x–50x faster – both ways. Rotation strategy, not passive bag-holding, usually decides who captures the real upside. 💡 That’s the backdrop where Maxi Doge ($MAXI) starts to make sense as a narrative vehicle. It’s built explicitly around 1,000x leverage culture, trading competitions and meme coin-first branding. It’s a combination aimed at retail traders who want to surf the wave of a risk-on market, not just watch whales dictate the trend. $XRP Breakout Hype and the Shift to High-Beta Risk When majors like $XRP or $SOL enter sustained uptrends, you typically see volatility-per-dollar drop on the large caps and spike further out on the risk curve. That dynamic pushes more aggressive traders into the meme coin and altcoin sectors, where liquidity is thinner but each marginal dollar has more impact on price. The meme coin and trading-community space is already crowded with brands like $DOGE, $SHIB, and $PEPE defining the baseline for what ‘beta’ looks like in crypto. New entrants now need more than a dog logo – they need a clear culture, a trading hook, and a product loop that rewards consistent engagement during both chops and breakouts. In a potential $XRP-driven melt-up, high-beta meme coin plays with clear identities and mechanisms for competition will likely be the ones that capture rotational flows. 💡 Maxi Doge ($MAXI) positions itself as one of several options here, leaning heavily into gym-bro leverage memes and performance-based contests, rather than just passive holding culture. Why Maxi Doge Fits A Risk-On Rotation Playbook Where most meme coins stop at vibes, Maxi Doge leans into a full ‘Leverage King Culture, branding itself as a 240-lb canine juggernaut embodying 1,000x trading mentality. 💡 The core idea is simple: retail traders lack whale-level capital, so you compensate with conviction, discipline, and structured competitions that reward outsized ROI, not just raw size. That ethos is wired into the product loop. Holder-only trading contests and public leaderboards turn $MAXI into more than a static meme coin. Partner tournaments with futures platforms are also included in the $MAXI roadmap. $MAXI is set to become a scoreboard for who trades the best in a bull market. For a risk-on crowd, bragging rights plus rewards is a strong engagement flywheel. That in itself sets Maxi Doge up to be one of the best meme coins to watch. Under the hood, the presale has already raised $4.2M+ signaling early demand for the narrative rather than just thin hype. At the moment, $MAXI tokens are priced at $0.000271. Dynamic staking – currently at 73% – adds another layer for traders who want exposure without full-time screen-watching. ➡️ Check out our guide to buying Maxi Doge if you plan to join the presale. At the end of the day, if $XRP does ignite a full-blown risk-on phase, traders who already mapped out their high-beta rotation – including a meme coin-trading hub like $MAXI – will be better placed than those scrambling after the move. Consider $MAXI while the rotation thesis is still forming. 🚀 Join the Maxi Doge presale before the next price hike. Disclaimer: This article is for informational purposes only and does not constitute financial, investment, or trading advice; always do your own research. Authored by Aaron Walker, NewsBTC – https://www.newsbtc.com/news/xrp-price-prediction-as-traders-rotate-to-maxi-doge",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55200791,
    "published": 1764585107000,
    "title": "Crypto ETPs snap 4-week slide with $1B inflows as XRP posts its best week",
    "body": "Crypto ETPs rebound with $1.07 billion inflows after four weeks of losses, while XRP hits record weekly gains amid US ETF launches.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55201700,
    "published": 1764586415000,
    "title": "Prediction markets bet on Coinbase-linked Hassett as top Fed pick",
    "body": "Prediction markets Polymarket and Kalshi surge for the pro-crypto candidate as Trump’s likely Fed chair pick, just as internal Fed reforms spark pushback from veterans.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55201564,
    "published": 1764586272000,
    "title": "Best Altcoins to Buy as Crypto Derivatives Shift to Full-On FOMO",
    "body": "What to Know: With derivatives markets finally chilling out and funding rates normalizing, traders are quietly swapping fear for early accumulation. This low-volatility window offers a perfect chance to rotate into solid tech plays before leverage-fueled FOMO kicks back in. Bitcoin Hyper is turning heads by raising over $28M to bring Solana-speed smart contracts directly to Bitcoin’s network. Traders are also eyeing SUBBD Token’s AI tools for creators and Monero’s new security upgrades as top picks for this cycle. Derivatives desks are finally taking a breath. Funding rates that were deep underwater are grinding back toward neutral, and implied volatility is dropping across the board, according to a recent report from Black Scholes and ByBit Analytics . This shift matters because it usually signals the move from pure fear to early FOMO. When funding normalizes and volatility drops, leverage hasn’t fully returned yet, but spot and high-conviction altcoins start catching a bid. You’re seeing this right now in specific Bitcoin plays, AI narratives, and legacy privacy tech. In this phase, the market usually rewards projects solving real bottlenecks: Bitcoin’s speed, creator money, and on-chain privacy. Before funding rates get overly excited, there’s a window where rotating into these themes can really boost your risk-reward profile. Here are three best altcoins sitting in that sweet spot: Bitcoin Hyper ($HYPER) , SUBBD Token ($SUBBD) , and Monero ($XMR) . They’re at the intersection of demand and new narratives that traders are jumping on as markets stabilize. 1. Bitcoin Hyper ($HYPER) – The Bitcoin Layer-2 Making $BTC a Powerhouse Everyone knows Bitcoin is the pristine collateral of crypto, but actually using it is still slow and expensive. Bitcoin Hyper ($HYPER) changes the math by plugging the Solana Virtual Machine (SVM) directly into Bitcoin’s network. Think of it as giving Bitcoin a nitrous boost: this Layer-2 gives you the rock-solid settlement of $BTC, but the transaction is instant and cheap, just like Solana. This isn’t just a technical upgrade; it’s about unlocking DeFi on Bitcoin. At the heart of this is the Canonical Bridge, a mechanism that lets you lock native $BTC to mint wrapped assets on the high-speed layer. This allows developers to finally build fast apps – trading, lending, gaming – using tools they already know, without clogging up the main chain. Want to know more? Check out our ‘ What is Bitcoin Hyper ’ guide for more information. The smart money is clearly paying attention. The presale has already swept up over $28.8M with tokens priced at $0.013355. Our experts are already projecting a massive run, seeing $HYPER reach $0.08625 by the end of 2026 , a staggering 546% ROI if you invested at today’s price. On top of that capital appreciation, $HYPER is offering 40% staking rewards, giving you a way to compound your position while the network scales. Get your $HYPER today. 2. SUBBD Token ($SUBBD) – The Creator Economy’s AI Upgrade While Hyper fixes plumbing, SUBBD Token is tackling the creator economy. The problem is simple: creators do the work, but platforms keep the control (and the fees). SUBBD Token ($SUBBD) flips this by mixing AI with crypto payments. It gives creators tools to automate the grind – imagine an AI assistant that handles fan chats or voice cloning tech that lets you create content without being glued to a microphone 24/7. It’s essentially ‘Scale as a Service’ for influencers, backed by a token that handles access and payments. Holding $SUBBD isn’t just a speculative bet; it’s an access pass. You get voting rights on platform governance, exclusive access to premium token-gated content, and significant discounts on platform subscriptions. Plus, buying in now secures priority access to beta AI tools before the public rollout. The presale is gaining traction with over $1.3M raised, and the 20% staking APY is a solid incentive for getting in early. The upside potential here is catching eyes too; our experts predict the token could hit $0.668 by the end of 2026 . If you invest at today’s price of $0.057075, that represents a massive 1,070% ROI. If you’re looking for a narrative that blends AI utility with real-world adoption, this is the one to watch. Check out our ‘ How to Buy SUBBD Token ’ guide for more details. Buy your SUBBD Token ($SUBBD) today. 3. Monero ($XMR) – The Silent Insurance Policy Monero doesn’t need much introduction – it’s the gold standard for privacy. But right now, it’s becoming more relevant than ever. As surveillance increases and ‘clean’ crypto becomes a regulatory obsession, the demand for truly private, censorship-resistant money quietly grows. $XMR isn’t trying to be the fastest or the wildest; it’s trying to be the most resilient. The upcoming FCMP++ upgrade is doubling down on this, making transactions even harder to trace and strengthening the network’s anonymity set. Traders hold Monero not for the hype, but as a hedge. It’s the portfolio insurance you buy when you realize a fully transparent blockchain future might be a little too transparent. Crucially, the ‘delisting’ fears that used to plague the coin have mostly been solved by the rise of atomic swaps and decentralized exchanges like Haveno. You can now swap $BTC for $XMR peer-to-peer without a centralized middleman or ID check, meaning liquidity is becoming unbannable code rather than a corporate compliance decision. Real usage is also ramping up, with a growing ‘circular economy’ where vendors accept XMR directly for goods and services like VPNs and hosting. Unlike speculative assets that just sit in wallets waiting for a pump, Monero is being used as actual digital cash, giving it a fundamental demand floor that’s hard to shake. Buy Monero ($XMR) on top exchanges like Margex. Recap: As derivatives markets move from fear to early FOMO, structural themes tend to outrun the beta. Bitcoin Hyper , SUBBD Token , and Monero each target real frictions, Bitcoin execution, creator monetization, and on‑chain privacy, making them the best altcoins to buy now. Remember, this isn’t intended as financial advice, and you should always do your own research before investing. Authored by Aaron Walker, NewsBTC — https://www.newsbtc.com/news/best-altcoins-derivatives-stabilize-bitcoin-hyper-subbd-monero/",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 57,
        "NAME": "XMR",
        "CATEGORY": "XMR"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55203186,
    "published": 1764588628000,
    "title": "Israel’s Central Bank Signals Improved Stablecoin Oversight as Digital Shekel Plans Advance",
    "body": "Bank of Israel Governor Amir Yaron said stablecoins can no longer be viewed as marginal, citing their trillion-dollar trading volumes and growing systemic risks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Israel|Central Bank|CBDC|Stablecoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 55204330,
    "published": 1764590449000,
    "title": "Strategy’s Green Dots Suggest Flexibility, Fueling Interest in $HYPER Presale",
    "body": "What to Know: Strategy’s willingness to keep Bitcoin sales ‘on the table’ reflects a broader shift toward tactical, actively managed $BTC exposure without abandoning long-term conviction. As Bitcoin’s base layer remains constrained by low throughput and high, cyclical fees, traders increasingly look to Layer 2 infrastructure as leveraged expressions of $BTC upside. Bitcoin Hyper targets Bitcoin’s speed and programmability gap with an SVM-powered Layer 2 that aims for Solana-level performance while settling to Bitcoin. When you see a long-term Bitcoin accumulator suddenly flashing ‘green dots’ instead of just quietly stacking sats, you aren’t just watching a trade, you’re watching a shift in conviction. Many saw the green dots as a sign for more Bitcoin purchases, while others saw it as buybacks or a restructuring of assets. The willingness of major players like Strategy to keep potential $BTC sales on the table signals a massive evolution in the market. Even the loudest ‘HODL forever’ thesis is now being wrapped in active risk management. For you as a trader or allocator, that nuance changes everything. If the most visible corporate-style HODLers are comfortable dialing risk up and down around a core $BTC position, it legitimizes a more tactical approach for the rest of us. It’s no longer a binary choice between ‘all spot, all the time’ or exiting to fiat. Instead, we are seeing sophisticated traders keeping their ‘hard money’ core while rotating a slice of their stack into high-beta ecosystem plays. Why? Because everyone agrees on one thing: Bitcoin’s base layer is incredible for settlement, but it is too slow (~7 TPS) and too rigid for modern apps. The market is realizing that infrastructure, scaling, and programmability layers could outgrow $BTC itself on a percentage basis in a bull cycle. Just as we saw with Ethereum’s modular stack, the real leverage often lies in the layers built on top of the base asset. This is why tactical Bitcoin exposure is drifting toward Layer-2s. Traders are looking for leveraged expressions of Bitcoin’s strength without leaving the ecosystem, hunting for the infrastructure that finally unlocks $BTC for DeFi and gaming. And this is where Bitcoin Hyper ($HYPER) enters the fold. Bitcoin Hyper: The ‘Best of Both Worlds’ Engine If you believe Bitcoin will remain the king of settlement but acknowledge it can’t host high-speed gaming or complex DeFi, then you need a high-performance execution layer. Bitcoin Hyper ($HYPER) is designed to be exactly that. It creates a fusion that combines Bitcoin’s massive liquidity and security with a real-time Solana Virtual Machine (SVM) Layer-2 for execution. By integrating the SVM, Bitcoin Hyper isn’t just trying to be faster; it’s aiming for sub-second confirmations and throughput in the thousands of transactions per second. It leans into Solana-style performance while settling back to Bitcoin. This directly solves the biggest headaches we all face with $BTC: agonizingly slow block times and fees that spike when the mempool gets clogged. Crucially, this system relies on a Canonical Bridge . This decentralized bridge is the vital link that handles $BTC transfers into the ecosystem, ensuring that assets move securely between the mainnet and the Layer 2. It positions the network not as a competitor trying to kill Bitcoin, but as a modular extension that finally makes your $BTC usable for high-speed swaps, lending, and staking. For full details, check out our ‘ What is Bitcoin Hyper ’ guide. The Financial Upside: Whales and ROI Potential For traders who are reading the market’s ‘green dots’ as a sign to be nimble, the financial setup for $HYPER is looking increasingly attractive. Smart money is already making significant moves to secure its position before the public catches on. We aren’t talking about small change here; we are seeing massive whale conviction. In the last months, we tracked buy-ins of $500K and $379.9K . When wallets of this size start accumulating a presale token, it’s usually a signal that they see something the retail market hasn’t fully priced in yet. Currently, the token is priced at $0.013355. However, our experts see $HYPER hitting $0.08625 by the end of 2026. If you choose to invest at today’s price, hitting that target would give you an ROI of around 545%. The presale has already raised over $28.8M, and with staking rewards at 40% the incentives are aligned for early adopters. If you want $HYPER, get it soon, as a price increase is coming. Don’t miss your chance to be part of the $HYPER revolution. Remember, this isn’t intended as financial advice, and you should always do your own research before investing. Authored by Aaron Walker, NewsBTC — https://www.newsbtc.com/news/strategy-green-bitcoin-dots-fuel-interest-bitcoin-hyper",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55204242,
    "published": 1764590307000,
    "title": "Sony Bank Could Issue USD Stablecoin in U.S. Next Year: Nikkei",
    "body": "The online banking arm of Sony Financial Group envisages the stablecoin being used to pay for games and anime.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Sony|Stablecoin|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 55204772,
    "published": 1764590393000,
    "title": "Bitcoin’s BOJ Stumble Shows Dovish Fed Isn’t Enough for Crypto",
    "body": "Bitcoin’s sudden drop on Monday was a fresh reminder of how cryptocurrency prices are influenced by an ever-widening array of macroeconomic factors, making it trickier for traders to gauge the market’s direction after the recent selloff.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55205574,
    "published": 1764592359000,
    "title": "Crypto Markets Today: Hawkish BOJ Comments Spur Sharp BTC Downturn",
    "body": "A sharp sell-off following the CME bitcoin futures open, compounded by hawkish signals from the Bank of Japan, dragged the CoinDesk 20 down nearly 6% on Monday.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|Markets|Derivatives|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55206690,
    "published": 1764594000000,
    "title": "Gleec Buys Komodo’s Cross-Chain DeFi Stack in $23.5M Deal",
    "body": "The acquisition brings Komodo’s atomic-swap technology, token ecosystem and core developers under the Gleec umbrella.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Komodo Platform|Crypto Trading|mergers and acquisitions|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      }
    ]
  },
  {
    "id": 55207234,
    "published": 1764594938000,
    "title": "Gold Closes in On All-Time High as Crypto, Stocks Tumble",
    "body": "Gold is approaching a record high as Bitcoin and stocks fall, driven by “growing caution among investors” amid dovish Fed expectations.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55207170,
    "published": 1764594843000,
    "title": "Sudden $3 Trillion Crypto Market Collapse Sparks Serious Bitcoin Price Crash Warning",
    "body": "Traders are bracing for further bitcoin price declines that could spiral into a full-blown crash...",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55207440,
    "published": 1764601200000,
    "title": "Eclipse brings Solana's parallel runtime to Ethereum",
    "body": "Eclipse combines high-throughput execution with Ethereum settlement in a way no other L2 has attempted. Cointelegraph Research breaks down the architecture and the milestones that will define its trajectory.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55207340,
    "published": 1764599455000,
    "title": "Dogecoin Whale Activity Drops To Deepest Level In Two Months",
    "body": "Large Dogecoin holders have sharply reduced their on-chain activity, with whale transactions falling to their lowest level in more than two months, according to fresh network data shared by on-chain analyst Ali Martinez. Posting a Santiment chart on X, Martinez stated that “whale activity on the Dogecoin network has dropped to the lowest level in the past two months.” The chart tracks DOGE’s price against the number of transactions larger than $1 million. It shows frequent, tall spikes in high-value transfers in early October 2025, when price was oscillating near the upper end near $0.27. Dogecoin Whales Plummets Sharply On the day of the October 10 crash, the largest peak occurred when more than 280 Dogecoin whales made a transaction. This was followed by a progressive decline through late October and November. By November 29, the whale-transaction bar fell to 3 even as price trades around $0.15. The drop has sparked debate about what it signals for market structure and liquidity. Responding to Martinez, analyst account CryptoGames3D argued that “whale activity dropping on Dogecoin could mean one of two things: either whales are holding tight and waiting, or they’re stepping out of the game; both cases bring risk. With low liquidity from big holders, even modest selling could hit prices hard.” The comment underlines concerns that thinner participation from large entities can make order books more fragile if conditions turn. Related Reading: Can Dogecoin Price Still Reach $10 With The 3rd Wave Deadlock? In a separate post on November 29, Martinez outlined what he called “key levels for Dogecoin DOGE,” citing “support at $0.08” and “resistance at $0.20.” Those levels are mirrored in a Glassnode cost-basis distribution heatmap he shared, which maps DOGE’s price since early 2024 against realized price bands where supply last moved. Related Reading: Dogecoin Coils For A Monster 90% Breakout, Analyst Predicts The heatmap reveals a dense cluster of supply around $0.08. A highlighted range between roughly $0.07999 and $0.08145 contains about 27.37 billion DOGE, marking it as a major realized-price support zone. Higher up, a second but thinner band between approximately $0.20103 and $0.20470 holds around 12.22 billion DOGE, forming a significant resistance cohort. The color scale, running from about 5 million to 31 billion DOGE, emphasizes how pronounced the lower cluster is relative to other price areas. Taken together, the datasets present a tightly framed picture. DOGE is currently trading between a heavy long-term holder cost basis near $0.08 and a resistance pocket around $0.20, while the count of $1 million-plus transfers has compressed to a multi-month low. At press time, DOGE traded at $0.137. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55207307,
    "published": 1764598985000,
    "title": "Tom Lee's BitMine Acquires 97K ETH, Eyeing Fusaka Upgrade, Fed Policy as Positive Catalysts",
    "body": "The firm increased the pace of purchases from the previous week despite sitting on large unrealized losses on its ether bet.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Ethereum News|Ethereum Treasury|Digital Asset Treasury|Bitmine|Thomas Lee|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55207343,
    "published": 1764598381000,
    "title": "Morning Minute: Over $650M Liquidated as BTC Erases Last Week's Gains",
    "body": "It was a Thanksgiving week of crypto price action to be grateful for—until it wasn't.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Opinion",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55207302,
    "published": 1764597775000,
    "title": "Strategy Still the Premier Bitcoin Proxy, Benchmark Says, Rejecting ‘Doom’ Narrative",
    "body": "The broker said fears over Strategy’s solvency are misplaced and the stock remains the strongest asymmetric bet on bitcoin.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Strategy|Bitcoin Treasury Reserve Asset|Benchmark|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55207438,
    "published": 1764596700000,
    "title": "BTC price analysis: Bitcoin could crash another 50%",
    "body": "Bitcoin’s first monthly MACD rollover this cycle, alongside onchain data, raised the odds of a deeper pullback, as BTC price forecasts now include the mid-$60,000s.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55207436,
    "published": 1764596476000,
    "title": "Strategy sets up $1.4B cash reserve, lifts Bitcoin stash to 650,000 BTC",
    "body": "Strategy funded a new reserve from stock sales to cover at least 12 months of dividends as it boosts its Bitcoin stash to 650,000 coins amid market volatility.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55207297,
    "published": 1764596228000,
    "title": "Polkadot Plunges 11% Breaking Below $2.05 Support Level Amid Broader Selloff",
    "body": "DOT collapsed to $2.02 as technical breakdown accelerated on massive volume, exposing the psychological $2.00 level.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Polkadot|Technical Analysis",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 21,
        "NAME": "DOT",
        "CATEGORY": "DOT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55207335,
    "published": 1764595842000,
    "title": "Yearn Finance Suffers $9M Breach As Attacker Creates Endless yETH Tokens",
    "body": "Yearn Finance reported that a legacy yETH product was hit by an exploit that allowed an attacker to mint a massive amount of fake tokens and swap them for real assets. Related Reading: Bitcoin Miners Face A Harsh December: Rising BTC Difficulty, Falling Hashprice According to on-chain alerts and protocol statements, the attacker created a near-infinite supply of yETH in a single transaction, then used those tokens to pull ETH and liquid-staking derivatives from liquidity pools. The incident was first flagged on November 30, 2025, and the total impact has been reported at roughly $9 million. #PeckShieldAlert Yearn Finance @yearnfi suffered an attack resulting in a total loss of ~$9M. The exploit involved minting a near-infinite number of yETH tokens, depleting the pool in a single transaction. ~1K $ETH (worth ~$3M) was sent to #TornadoCash, while the exploiter’s… pic.twitter.com/IXNygpwoWa — PeckShieldAlert (@PeckShieldAlert) December 1, 2025 How The Exploit Worked Based on reports, the attacker took advantage of a flaw in the yETH minting logic and produced tokens on the order of 235 trillion in one go. Those worthless tokens were then swapped for real assets from Balancer and Curve pools tied to the product, emptying liquidity in minutes. Chain monitors and security researchers showed the mint and subsequent swaps unfolding very quickly on the blockchain. At 21:11 UTC on Nov 30, an incident occurred involving the yETH stableswap pool that resulted in the minting of a large amount of yETH. The contract impacted is a custom version of popular stableswap code, unrelated to other Yearn products. Yearn V2/V3 vaults are not at risk. — yearn (@yearnfi) December 1, 2025 What Assets Were Taken Reports have disclosed that roughly $8 million was pulled from the main yETH stable-swap pool, while about $0.9 million was taken from a yETH–WETH pool. In addition, roughly 1,000 ETH—valued at about $3 million at the time of movement—was sent to Tornado Cash in attempts to obscure the trail. The attacker converted fake yETH into a mix of ETH and liquid staking tokens before attempting to launder funds. Impact On Yearn’s Core Products According to Yearn officials and follow-up coverage, the breach was limited to an older, legacy implementation of the yETH product and did not affect Yearn’s main V2 and V3 vaults. Deposits into the affected pool were isolated while the team and outside experts began an investigation. This isolation is said to have kept the bulk of user funds in active vaults from being touched. Market Reaction And Wider Concerns Crypto markets saw selling pressure as the news spread, with traders weighing the risk that comes from combining liquid staking tokens with custom swap code. Related Reading: Bitcoin Sentiment Sparks CZ Comment: Sell Greed, Buy Fear Yearn Finance said it is working with outside security teams to run a post-mortem and to patch the vulnerability. Based on reports, teams named in coverage include external auditors and blockchain investigators who are tracking the stolen funds and advising on recovery options. The protocol’s notice warned users about the affected legacy product and urged caution while the review continues. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|bitcoin|crypto|crypto hack|yearn finance|yETH",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 60,
        "NAME": "YFI",
        "CATEGORY": "YFI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55207295,
    "published": 1764582038000,
    "title": "Ripple Can Now Offer Wider XRP, RLUSD Services After Singapore Regulator Approval",
    "body": "The permissions give Ripple more bandwidth to offer token-based settlement and related payment services to banks, fintechs and crypto firms operating in the city-state.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Ripple|Singapore|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55208098,
    "published": 1764603449000,
    "title": "European Authorities Seize $1.51B Bitcoin-Mixing Service Cryptomixer",
    "body": "Europol dismantled a crypto-mixing platform it said is used by ransomware groups and darknet markets to launder bitcoin, seizing servers, data and $29 million in BTC.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Crypto Mixer|Europol|Crime|mixing services|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55208751,
    "published": 1764604847000,
    "title": "Here’s Why The Bitcoin Price Is Crashing Today",
    "body": "Crypto analysts Nik and Doctor Profit have provided insights into why the Bitcoin price is crashing today. The flagship crypto has again dropped below the psychological $90,000 level, sparking bearish sentiments among market participants. Why The Bitcoin Price Is Crashing Today In an X post, Nik remarked that the Bitcoin price didn’t dump because of bad news but because the “clock flipped.” He noted that a large number of algos sold off at the same time with the daily close, and also considering that it is a new week and a new month. The analyst added that it is not traders making decisions but portfolios rebalancing in real time. Related Reading: Finance Expert Says Bitcoin Price Growth Is In ‘Google 2017’ Phase, What This Means Nik explained that with this Bitcoin price crash, inventories have adjusted, hedges have reset, and risk has been flushed from the market. He noted that the candles may look emotional, but that the behavior is mechanical. The analyst also indicated that retail investors may have also dumped their coins out of panic. Nik stated that time-based algos usually ignite the sell-off, and then everyone is forced to react to their flow. He added that the effect was strong enough today to shake the Bitcoin price, with the crash dragging the broader crypto market along. BTC dropped below $90,000 today, after recovering to $92,000 last week. Meanwhile, Nik stated that most people usually miss the signs of a potential Bitcoin price crash because they focus on patterns drawn by humans rather than flows controlled by machines. He added that the market doesn’t only react to price but also to time. Not Yet Enough Liquidity For A Major Crash In an X post, crypto analyst Doctor Profit said that there isn’t enough downside liquidity yet to trigger a major Bitcoin price crash. This is why he expects a sideways range between the current price and the EMA50, around $100,000, in the coming days or weeks. The analyst noted that the two largest liquidity clusters in the short term are at the $97,000 and $107,000 regions. Related Reading: Analyst Who Predicted Bitcoin Price Action With Chinese Astrology Shares When Prices Will Surge However, Doctor Profit remains bearish in the long term. He declared that a major move down is planned, but that the script must be followed and that the required liquidity is not yet in place. The analyst told market participants to expect a boring sideways phase with confirmed targets of between $70,000 and $75,000 by the start of 2026. Doctor Profit reiterated that such moves to the downside for the Bitcoin price take time. He explained that the crash could unfold as a strong drop, followed by a long sideways consolidation, then a fake relief rally, and then the continuation of lower lows. At the time of writing, the Bitcoin price is trading at around $85,800, down over 5% in the last 24 hours, according to data from CoinMarketCap. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|algo|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|CoinMarketCap|Doctor Profit|EMA|Nik",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55208644,
    "published": 1764604606000,
    "title": "China Eyes Fresh Crackdown on Crypto Amid Resurgence in Speculative Trading",
    "body": "Authorities warn that crypto activity remains illegal and poses renewed risks despite years of enforcement.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55209245,
    "published": 1764605779000,
    "title": "Strategy launches $1.4bn dollar reserve to fund dividends as bitcoin sinks",
    "body": "Shares tumble more than 11% as group warns of net loss of up to $5.5bn if price of cryptocurrency does not rebound",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55209738,
    "published": 1764606544000,
    "title": "ICP Slides as Breakdown Below $4.00 Triggers Elevated Volatility",
    "body": "Sharp 24-hour decline sends Internet Computer into fresh multi-day lows, with a high-volume support breach defining the session",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Technical Analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 82,
        "NAME": "ICP",
        "CATEGORY": "ICP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55209803,
    "published": 1764606398000,
    "title": "BONK Slides 9% as Technical Breakdown Overshadows Swiss ETP Debut",
    "body": "A new ETP listing in Switzerland failed to lift BONK as the memecoin fell to fresh cycle lows amid a sharp technical breach of key support.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Technical Analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 113,
        "NAME": "BONK",
        "CATEGORY": "BONK"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55210247,
    "published": 1764607517000,
    "title": "Bitcoin Mining Profitability Fell for Fourth Consecutive Month in November: JPMorgan",
    "body": "The average network hashrate fell 1% last month after hitting record highs in October.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin Mining|Cipher Mining|JPMorgan|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55210723,
    "published": 1764608379000,
    "title": "Chainlink's LINK Slides 11% as Technical Breakdown Overshadows ETF Launch News",
    "body": "The token broke below $12, breaching key support levels with heavy trading volume, confirming the downtrend.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Chainlink|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55210690,
    "published": 1764606717000,
    "title": "Over $650M Liquidated! China confirms Crypto Illegal! Infinex Interview!",
    "body": "Crypto majors slid sharply, reversing all of last week’s gains, with BTC down 6% to $85,800, ETH down 6% to $2,820, BNB falling 7% to $822, and SOL dropping 7% to $127. Among top movers, MYX (+15%) and JST (+4%) led the market. More than $650 million in positions were liquidated over the past day, including $580 million in longs after BTC dipped below $86,000. ZEC suffered the steepest decline among major tokens, falling 20% to $355 and 35% on the week. Meanwhile, Tether founder Paolo Ardoino again addressed the latest wave of Tether FUD, reiterating that the company is not at risk of insolvency. In regulatory developments, China’s central bank reaffirmed that crypto remains illegal and signaled a coming crackdown. Robinhood announced a partnership with Susquehanna to launch a new CFTC-licensed exchange, paving the way for a major expansion into prediction markets. Pavel Durov revealed Cocoon, a new decentralized confidential compute network where GPU operators earn TON rewards. JPMorgan also entered the spotlight with a new structured BTC-linked product that offers investors a minimum 16% yield—up to 50% depending on BTC’s performance—with downside protection of up to 30%.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55211760,
    "published": 1764610208000,
    "title": "Is Strategy Buying Bitcoin Again? Saylor’s ‘Green Dots’ Suggest Yes",
    "body": "Michael Saylor’s recent post has stirred fresh buy speculation around Strategy’s Bitcoin holdings. He shared a portfolio chart and wrote, “What if we start adding green dots?” — a line that many investors read as a nudge toward new purchases. According to the chart, Strategy’s Bitcoin stash is valued at close to $60 billion, reflecting a total of 649,870 Bitcoins acquired across 87 distinct buys. Related Reading: Bitcoin Miners Face A Harsh December: Rising BTC Difficulty, Falling Hashprice Saylor’s Comment Spurs Market Talk The company’s tracker shows each past purchase as an orange dot. The idea of green dots implies new markers — new buys — could appear if Strategy chooses to add more Bitcoin. That signal comes at a time when volatility has returned to crypto markets, making any hint of institutional accumulation a headline-worthy event. CEO Lays Out When Sales Might Happen According to Strategy’s CEO Phong Le, selling would be a last resort. Le told listeners on a podcast that the firm will only sell its Bitcoin in extreme conditions — chiefly if market values drop below net asset value (NAV) and fresh capital cannot be raised. What if we start adding green dots? pic.twitter.com/a19bD33KzD — Michael Saylor (@saylor) November 30, 2025 Reports indicate the company expects to meet yearly preferred-share dividend obligations of about $750 million to $800 million by raising capital when its stock trades above NAV. Le said this approach lets the firm keep building its holdings while meeting payouts. Debt And Dividend Plans Remain Front And Center Based on company materials, the firm says it can maintain dividends even in stress. Strategy recently rolled out a BTC Credit dashboard aimed at giving investors clearer visibility into how the company can service its liabilities over the long term. Company figures show the average purchase price sits near $74,000. The dashboard suggests that, according to the firm’s math, dividend payments could be sustained for decades even if Bitcoin traded around the firm’s average cost. Market Slide Tests Confidence After touching highs above $126,000 in October, Bitcoin fell sharply and dropped below $86,000 in early Asian trading on December 1, sliding as much as 6% in a single session. BREAKING: Bitcoin falls -$4,000 in 2 hours as mass liquidations return. $400 million worth of levered longs have been liquidated over the last 60 minutes. pic.twitter.com/qKB7MYJapu — The Kobeissi Letter (@KobeissiLetter) December 1, 2025 Other tokens moved lower too — Ethereum slipped more than 7% to about $2,800 during the same period. Analysts link the sell-off to a broader “risk-off” mood, with jitters around inflation and central bank policy weighing on risky assets. Related Reading: $300 Million Crypto Bet: Kazakhstan’s Central Bank Gears Up Strategy’s Positioning Amid The Pullback Strategy said it had faced pressure earlier when Bitcoin traded near $90,000, a stretch that briefly put its Nasdaq-100 membership at risk. Even so, company leaders continue to stress a long-term approach to holding Bitcoin. The recent public hint from Saylor and Le’s comments on selling policies together signal that Strategy is keeping the door open to buy on dips, while also setting clear lines about when selling would be considered. The coming weeks will test whether those green dots appear on the company’s tracker and whether market conditions give large holders the chance to add to their positions. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|green dots|Michael Saylor|selloff",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55211576,
    "published": 1764609853000,
    "title": "JPMorgan and Strike CEO Jack Mallers Go Silent, Leave 'Debanking' Questions Unanswered",
    "body": "For now, Jack Mallers decided to not comment any further and JPMorgan declined to explain why it debanked the CEO of a company very similar to newly launched JPM Coin.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Jack Mallers|JPMorgan Chase|Operation Chokepoint|Donald Trump|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55213276,
    "published": 1764613066000,
    "title": "Bitnomial Prepares to Debut First CFTC-Regulated Spot Crypto Market",
    "body": "The move marks the first time spot crypto assets can trade on a federally regulated commodities venue, signaling the CFTC’s accelerating push to oversee retail digital-asset markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|CFTC|Spot market|Bitnomial|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55214618,
    "published": 1764615648000,
    "title": "Here’s The Bullish Trend Developing To Trigger A 174% Move For The Dogecoin Price",
    "body": "A fresh analysis points to a developing bullish pattern that may set the stage for a massive surge in the Dogecoin price. The crypto analyst who shared this analysis argues that the current structure in DOGE’s trend suggests the early formation of a recovery move strong enough to trigger a 174% price rally. With momentum building and technical indicators aligning, this new setup could be the catalyst that pushes Dogecoin out of its downtrend. Dogecoin Price Trend Signals 174% Rally Dogecoin is entering a phase that analysts say could be the beginning of a powerful bullish structure forming on the charts. According to crypto market expert Javon Marks, the popular meme coin is maintaining a series of signals pointing toward a major upside continuation phase. If confirmed, these developments could open the door to an explosive 174% rally in the weeks ahead. Related Reading: Can Dogecoin Price Still Reach $10 With The 3rd Wave Deadlock? Marks explained that Dogecoin’s price behavior is beginning to reflect a bullish trend that could accelerate rapidly. The chart shows that momentum indicators are displaying early signs of strength and recovery while key support levels have remained firmly intact. This combination is laying the foundation for a much bigger breakout, one that the analyst predicts could spark a rally well above 174%. The analysis shows that the projected 174% rally is part of a broader recovery wave, with Dogecoin expected to reach $0.374 as its first target. Beyond that stage, a more ambitious goal sits near $0.6533, a level that lies more than 315% above DOGE’s current price of $0.136. Even more impressively, Marks has forecasted an explosive surge to $1.25, representing a staggering 820% increase in the meme coin’s price. The accompanying chart shows Dogecoin forming a series of higher supports following a prolonged corrective period. According to Marks, this developing trend shows that the meme coin is maintaining strong bullish signals despite its volatile price action over the recent months. The chart also displays a clear break from its extended downtrend, followed by a sequence of impulsive waves that continue to hold above previous lows. Dogecoin Eyes Breakout Above Key Resistance Zone Sharing similar bullish sentiments, crypto analyst Sudelytic notes that Dogecoin is showing signs of a resurgence after a prolonged period of quiet activity. According to the expert, the meme coin is approaching a key resistance zone between $0.30 and $0.35, a price range that could determine its next move. Related Reading: What Happens If Dogecoin Moves Out Of This Massive Wyckoff Accumulation? If Dogecoin breaks above this zone with strength, Sudelytic predicts it could target new levels above $1.5. Despite its strong breakout potential, the analyst cautions that this resistance area is challenging to overcome. A failure to move past it could result in additional sideways action before any significant upward momentum returns. Given the significance of this resistance, Sudelytic notes that Dogecoin’s price action is being closely monitored. He points out that the meme coin’s history of unexpected rallies is the key reason why he remains optimistic about its outlook. Featured image from Pngtree chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt|Javon Marks|Sudelytic",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55214660,
    "published": 1764615426000,
    "title": "Goldman Sachs buys Innovator for $2B, adding a Bitcoin-linked ETF to lineup",
    "body": "The acquisition expands Goldman’s defined-outcome ETF business and brings the bank deeper into crypto-linked investment products.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 55216441,
    "published": 1764619212000,
    "title": "Massive Ethereum Distribution Continues: Whale Sends Another 5,000 ETH To Binance",
    "body": "Ethereum lost the critical $3,000 level on Sunday, sliding toward $2,800 and triggering a new wave of fear across the market. The drop highlights a deepening corrective phase that has pushed short-term investors into heavy unrealized losses, prompting many to reassess their risk exposure. Related Reading: Bitcoin Must Break Key Supply Clusters To Regain ATH Momentum – Watch These Levels Adding to the uncertainty, fresh on-chain data has revealed renewed distribution from major holders. According to data from Arkham, shared by Lookonchain, the well-known whale 0xdECF deposited another 5,000 ETH—roughly $15.05 million—into Binance. This move expands a pattern of consistent selling pressure from large wallets, often seen during heightened market stress. While one whale does not define the broader trend, these deposits usually reinforce bearish sentiment among traders who monitor exchange inflows as a proxy for potential sell-side liquidity. Whale Distribution Deepens Amid Broader Market Anxiety Since October 28, the same whale wallet has accelerated its selling activity, unloading 25,603 ETH—approximately $85.44 million—across Binance and Galaxy Digital. Despite this aggressive distribution, the wallet still holds 10,000 ETH valued at roughly $30.34 million, leaving open the possibility of continued sell pressure if market conditions weaken further. Large-scale movements like these often signal a shift in sentiment from sophisticated holders who tend to anticipate volatility earlier than the broader market. This selling spree comes at a moment when confidence is already fragile. The recent Tether FUD, fueled by speculation around reserve transparency and potential regulatory scrutiny, has added stress to liquidity conditions. Meanwhile, renewed headlines about a supposed China Bitcoin ban have resurfaced on social media, amplifying fear across both retail traders and short-term investors. Although neither narrative reflects new fundamental risks, emotional markets often react sharply to sensational news during corrective phases. Related Reading: Bitcoin STH Loss Transfers Fall 80% From Peak – What Comes Next? Together, these factors create a backdrop where whale distributions gain outsized influence. If the remaining 10,000 ETH enters exchanges, it could deepen short-term downside pressure. Conversely, a pause in selling may suggest that the whale views current levels as near-capitulation territory, offering a potential floor for stabilization. Ethereum Price Tests Support as Downtrend Remains Intact Ethereum’s 4-hour chart shows a market still struggling to regain momentum after losing the $3,000 handle. The broader structure remains decisively bearish, with price trading below the 50 SMA, 100 SMA, and 200 SMA—a clear indication that sellers continue to control the trend. Each attempt to recover above the moving averages has been rejected, reinforcing the downtrend that began in late October and has continued through November. The recent bounce from the $2,750–$2,800 support zone shows that buyers are defending this level, but the reaction lacks conviction. Volume remains muted, and the latest attempt to reclaim $3,000 quickly failed, forming another lower high. This signals hesitation and suggests that bulls are not yet strong enough to shift market structure. Related Reading: XRP Reserves On Binance Collapse To Record Lows: Investors Move Toward Long-Term Holding The compression seen toward the end of the chart formed a small symmetrical triangle, but the breakdown that followed confirms that sellers still dominate short-term momentum. As long as ETH remains below the 200 EMA—now near $3,350—the macro trend favors continuation to the downside. If $2,800 breaks cleanly, the next liquidity pockets sit around $2,600 and $2,450, levels that could attract stronger buyer interest. For now, Ethereum must reclaim $3,000 with sustained volume to neutralize bearish pressure. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ethereum|Ethereum Analysis|Ethereum Distribution|ethereum news|ethereum price|Ethereum Whale|Ethereum Whale Activity|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55216568,
    "published": 1764619426000,
    "title": "Coinbase C-Suite, Marc Andreessen Sued for Billions Over Alleged Insider Trading Scheme",
    "body": "A lawsuit filed by Coinbase shareholders accuses the company’s leadership of withholding key information for years while making billions selling inflated stock.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55217202,
    "published": 1764620750000,
    "title": "Kalshi Launches Tokenized Event Bets on Solana Blockchain: CNBC",
    "body": "The prediction market is rolling out tokenized contracts on Solana to meet crypto traders where they already are, Kalshi told CNBC.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Kalshi|Prediction Markets|Tokenization|CNBC|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55219160,
    "published": 1764624756000,
    "title": "Airwallex Faces China Backdoor Allegations From Prominent VC",
    "body": "Prominent investor Keith Rabois alleges the fintech unicorn's structure enables Chinese government access to sensitive US financial data.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 55219476,
    "published": 1764625167000,
    "title": "Kalshi taps Solana to tokenize betting contracts: Report",
    "body": "The move could challenge other prediction platforms by providing Kalshi users with greater anonymity through tokenized buys and sales on the Solana blockchain.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55219526,
    "published": 1764624720000,
    "title": "Crypto’s Retail Traders Hit Hard as Strategy ETFs Plunge 80%",
    "body": "Retail investors who piled into Michael Saylor’s grand Bitcoin experiment are paying a heavy price.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NMS:MSTR",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55219580,
    "published": 1764625772000,
    "title": "Seller Exhaustion or a Bottom? Strategy Gains 11% From Session's Worst Levels",
    "body": "Peter Schiff took a victory lap after the company Monday morning announced it had raised $1.44 billion via common stock sales as a reserve to pay preferred dividends for nearly two years.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Strategy|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55220076,
    "published": 1764626924000,
    "title": "Vanguard Opens Platform to Crypto ETFs in Major Shift: Bloomberg",
    "body": "The move will give access to the firm's 50 million clients to invest in regulated digital asset ETFs, a reversal from Vanguard's long-standing anti-crypto stance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Vanguard|Crypto ETF|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55220600,
    "published": 1764628073000,
    "title": "Kalshi Pushes Further Into Crypto With On-Chain Prediction Markets on Solana",
    "body": "Kalshi's prediction market contracts are now tokenized on Solana, unlocking access to the crypto economy, the firm announced on Monday.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55221144,
    "published": 1764629428000,
    "title": "Vanguard to Allow Bitcoin, Ethereum and XRP ETF Trading in Major Crypto Pivot",
    "body": "Vanguard will allow trading of crypto-focused ETFs and mutual funds on its brokerage platform, ending years of resistance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55221782,
    "published": 1764630900000,
    "title": "'Mad Cow Disease': Grand Theft Auto Dev Warns That Generative AI Could Harm Games",
    "body": "Famed GTA developer Dan Houser said models trained on synthetic data could degrade game quality as creators rapidly adopt AI tools.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Gaming",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55221518,
    "published": 1764630000000,
    "title": "Bitcoin’s lack of price strength due to sheepish spot buyers: What happens next?",
    "body": "Bitcoin fudged the breakout to $93,000 as global TradFi markets stumbled and BTC spot investors failed to provide the necessary volume.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55223040,
    "published": 1764633633000,
    "title": "Market Downturn Hits Dogecoin Hard: Is a Larger Correction on the Horizon?",
    "body": "Similar to major assets in the cryptosphere, Dogecoin (DOGE) is facing renewed selling pressure as broader crypto market weakness intensifies, pushing the memecoin below several key technical levels. Related Reading: $300 Million Crypto Bet: Kazakhstan’s Central Bank Gears Up The decline occurs amid outflows, a weakening market structure, and fading speculative interest, raising questions about whether a deeper correction may be underway. DOGE's price trends to the downside on the daily chart. Source: DOGEUSD on Tradingview Dogecoin Breaks Key Supports as Selling Pressure Mounts Dogecoin slipped below important support areas after breaking a bullish trend line on the hourly chart, continuing a multi-day downtrend. The price now trades below the 100-hour simple moving average, near $0.13, with MACD momentum strengthening in the bearish zone and the RSI remaining below 50. The coin declined more than 8% in 24 hours, falling through multiple Fibonacci retracement zones and failing to regain footing above the 23.6% level of the latest swing move. Analysts note that immediate resistance lies near the 50% retracement of the recent decline. A close above that threshold is needed to ease short-term downside pressure. Failure to break above these resistance areas has kept momentum tilted toward sellers, with a retest of recent lows likely if the market does not stabilize. Weak Flows and Derivatives Contraction Deepen Market Strain Spot market flows show persistent distribution. Recent data revealed a $5.7 million outflow, extending the multi-month trend of reduced accumulation from large holders. Earlier inflows that supported rallies toward $0.30 have given way to steady red prints, reflecting waning confidence among major players. Derivatives markets reinforce the weakening structure. Open interest has dropped more than 9% as traders unwind positions rather than add exposure during declines. Long-short ratios show a mild long bias, but price action has repeatedly invalidated those positions, triggering waves of long-side liquidations whenever DOGE attempts to rise above short-term moving averages. These repeated failed rallies have kept Dogecoin locked beneath declining EMAs between $0.154 and $0.202, a structure analysts say remains firmly bearish. DOGE ETF Disappointment and Market Rotation Add Further Pressure Dogecoin’s recently launched ETFs have not provided support. Combined inflows from major issuers barely surpassed $2 million, far below expectations and significantly weaker than the debut flows seen in Bitcoin or Ethereum funds. The soft demand has signaled limited institutional appetite for the memecoin, contributing to negative sentiment. Related Reading: XRP Hit By Violent 59% Leverage Flush As Speculators Slam The Brakes Meanwhile, market rotation is moving toward utility-focused assets and payment-driven networks. Declining volume and low whale activity suggest traders may be shifting away from meme assets in favor of projects showing faster adoption and real-world use cases. Cover image from ChatGPT, DOGEUSD chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|Doge price|dogeusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55223869,
    "published": 1764635421000,
    "title": "Bitcoin’s November Selloff Was A Stress Test - And DeFi Quietly Passed",
    "body": "Bitcoin’s November selloff offered more than a price reset. It provided a field test for the infrastructure that will support the asset’s next phase of growth.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55224148,
    "published": 1764636061000,
    "title": "Bitcoin Plunges Below $84,000 As Central Bank Speculation Fuels Losses",
    "body": "Bitcoin prices fell below $84,000 on Monday, December 1 as central bank speculation combined with a backdrop of bearish market conditions to drive losses.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55224828,
    "published": 1764637457000,
    "title": "Vanguard’s 50M+ clients will soon have access to crypto ETFs",
    "body": "Vanguard CEO Salim Ramji ruled out crypto ETFs on its platform in August, but consistent demand for crypto has seemingly changed his firm’s tune.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55226461,
    "published": 1764640821000,
    "title": "XRP Is About To Hit A Major Turning Point This Week, Analyst Says",
    "body": "According to market observers, this week could mark a turning point for XRP as five spot ETFs trade at the same time for the first full week. 21Shares’ XRP fund (TOXR) launched today, joining Bitwise, Grayscale, Franklin Templeton and Canary Capital. Reports have disclosed that ETF inflows have already topped Over $660 million in less than a month, with zero outflows across 10 consecutive trading days. Related Reading: Bitcoin Miners Face A Harsh December: Rising BTC Difficulty, Falling Hashprice 5 ETFs Trade Together Bitwise recently increased its XRP holdings to 80 million tokens. ETF managers now hold more than $687 million in assets, which represents just over 300 million XRP on record. 21Shares debuted with a $500,000 seed basket and charges a 0.50% management fee. Based on reports, competition among issuers will reveal how aggressively these funds plan to keep buying over the long term. Demand Model A price-path sensitivity simulation run by Mohamed Bangura was shared by analysts and taken up by commentators. The model used a baseline ETF demand of 74.5 million XRP per day, total exchange supply of 2.7 billion XRP, and an escrow release of 300 million XRP every 30 days. Next week is a big milestone for XRP. We will have the first full week of trading with 5 pure spot ETF’s running in competition. It’s going to tell us ALOT by the end of week what we can expect for these funds acquiring XRP for the long term. https://t.co/S3TENqa4PP pic.twitter.com/LQ48QLKcgh — Chad Steingraber (@ChadSteingraber) November 30, 2025 Elasticity values of 0.2, 0.5 and 1.0 were tested over 180 days. The outcomes showed that low elasticity can rapidly drain exchange-held supply, while higher elasticity can produce sharper price spikes as OTC liquidity absorbs flows. That result has many traders watching liquidity statistics closely. Liquidity Pressure Builds Jake Claver, CEO of Digital Ascension Group, warned that private OTC and dark-pool channels may be running thin. He estimated that about 800 million XRP of private liquidity was absorbed in the first week of ETF accumulation. Because much ETF buying happens off-exchange, price action has not yet matched the tightening supply, and markets may see more abrupt moves when funds are forced to source coins from public exchanges. Whales Reshuffle Balances Meanwhile, reports have disclosed changes among large holders. The top 10,000 wallets now hold 51.39 billion XRP, or about 85% of circulating supply. In one day, 78 new wallets took in 77.324 million XRP. One wallet reportedly collected 35 million XRP, another grabbed 3.63 million, and six wallets added 1.99 million each. 🚀 XRP RICH LIST SHOCKWAVE (11/29/2025) 🐳 Fresh data shows the top 10,000 wallets now control 51.39B+ XRP, and today’s ledger activity screams new whales + stealth accumulation.​ 78 new accounts grabbed 77M+ XRP in one day. 246 existing wallets increased balances by another… pic.twitter.com/wpXZMJUQpI — XRP 🅧 Army | Chacha72kobe4er (@Mullen_Army) November 30, 2025 Up to 44 new wallets were reported to have amassed over 300 million XRP each, while 246 existing wallets increased their combined balance by 17.91 million XRP. Those moves point to quiet accumulation during recent market weakness. Related Reading: $300 Million Crypto Bet: Kazakhstan’s Central Bank Gears Up What Comes Next Analysts say the current setup is a test of liquidity more than a simple demand story. ETF holdings of roughly 300 million XRP are sizable but still small compared with potential daily demand if inflows stay high and additional funds launch. If OTC channels dry up and ETFs must buy on exchanges, volatility could rise quickly. Traders and portfolio managers will be watching order books, OTC reports and ETF filings in the coming days to see how the supply picture changes in practice. Featured image from Trading News, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|bitcoin|crypto|xrp|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55226914,
    "published": 1764641500000,
    "title": "Japan government backs 20% tax on crypto profits, on par with stocks",
    "body": "Japan has taken another step to reform its crypto taxation, replacing its tiered system that can reach as high as 55%.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55227132,
    "published": 1764642087000,
    "title": "China's Z-Image Dethrones Flux as King of AI Art—And Your Potato PC Can Run It",
    "body": "The six-billion-parameter model is beating Flux2 on hardware from 2019, and the open-source community is going wild.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      }
    ]
  },
  {
    "id": 55229911,
    "published": 1764646589000,
    "title": "Cantor Fitzgerald Reveals Solana ETF Holdings in Latest Filing to SEC",
    "body": "Cantor disclosed its first position in a newly listed Solana ETF, adding momentum to TradFi's shift toward regulated crypto exposure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55230379,
    "published": 1764647356000,
    "title": "Attention Bitcoin Bulls: The U.S. 10-Year Yield Isn't Budging Despite Fed Rate Cut Hopes",
    "body": "Bitcoin bulls' hopes for rate cuts to lower bond yields and the dollar are challenged by signals from the Treasury and the FX market.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Federal Reserve|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55231547,
    "published": 1764649152000,
    "title": "Ethereum devs work on ‘Secret Santa’ protocol to power privacy",
    "body": "A Solidity engineer proposed a protocol earlier this year using zero-knowledge proofs and transaction relayers to enable a Secret Santa-like feature on Ethereum.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55232220,
    "published": 1764650313000,
    "title": "XRP Price Hovers at Key Support, Fueling Debate Over Incoming Breakout",
    "body": "XRP price started a fresh decline below $2.10. The price is now struggling and faces resistance near the $2.050 pivot level. XRP price started a fresh decline below the $2.050 zone. The price is now trading below $2.050 and the 100-hourly Simple Moving Average. There is a bearish trend line forming with resistance at $2.120 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move down if it settles below $2.00. XRP Price Dips Again XRP price attempted a recovery wave above $2.150 but failed to continue higher, like Bitcoin and Ethereum . The price started a fresh decline below $2.10 and $2.050. There was a move below the $2.00 support level. A low was formed at $1.984, and the price is now consolidating losses below the 23.6% Fib retracement level of the downward move from the $2.275 swing high to the $1.984 low. The price is now trading below $2.050 and the 100-hourly Simple Moving Average. If there is a fresh upward move, the price might face resistance near the $2.050 level. The first major resistance is near the $2.120 level. There is also a bearish trend line forming with resistance at $2.120 on the hourly chart of the XRP/USD pair. It is near the 50% Fib retracement level of the downward move from the $2.275 swing high to the $1.984 low. A close above $2.120 could send the price to $2.20. The next hurdle sits at $2.250. A clear move above the $2.250 resistance might send the price toward the $2.2850 resistance. Any more gains might send the price toward the $2.350 resistance. The next major hurdle for the bulls might be near $2.40. More Losses? If XRP fails to clear the $2.050 resistance zone, it could start a fresh decline. Initial support on the downside is near the $2.00 level. The next major support is near the $1.9850 level. If there is a downside break and a close below the $1.9850 level, the price might continue to decline toward $1.920. The next major support sits near the $1.880 zone, below which the price could continue lower toward $1.820. Technical Indicators Hourly MACD – The MACD for XRP/USD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $2.00 and $1.9850. Major Resistance Levels – $2.050 and $2.120.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55233109,
    "published": 1764651619000,
    "title": "Will Strategy Liquidate Bitcoin Holdings? CEO Provides Concerning Clues",
    "body": "In a turbulent market marked by falling prices, Bitcoin (BTC) has once again dipped below the $85,000 threshold, driven by growing speculation that Strategy, formerly known as MicroStrategy, may be on the verge of selling some of its Bitcoin holdings. This intensified after a recent interview on the What Bitcoin Did podcast, during which Strategy CEO Phong Le was directly asked whether the company would consider parting with any of its BTC holdings. While the firm’s former CEO, Michael Saylor, has consistently maintained a resolute stance against selling, Le’s comments have raised concerns about potential sales in the future. Is A Bitcoin Sell-Off Imminent? Le indicated that if Strategy’s stock trades below the actual value of its Bitcoin holdings and the company is unable to raise additional capital for preferred dividends, selling some Bitcoin could become a necessity. “If the stock trades below the value of our Bitcoin… then mathematically we would have to sell some Bitcoin. It would be the last resort,” he explained. While this does not confirm an imminent sale, it visibly places the option on the table, leading to increased speculation about a forced sale as preferred dividend payments approach due on December 31. Related Reading: Here’s Why The Bitcoin Price Is Crashing Today Adding to the unease, Strategy disclosed in a recent filing with the US Securities and Exchange Commission (SEC) that it has established a USD Reserve of $1.44 billion to cover these upcoming preferred dividends and mitigate the interest on its substantial debt. This reserve was funded through the proceeds from sales of its class A common stock under the company’s at-the-market offering program. Such moves have diluted current shareholders and contributed to a nearly 11% drop in Strategy’s stock price. Strategy Downgrades BTC Price Forecast This shift contrasts sharply with the company’s previous forecasts, which predicted that Bitcoin would soar to $150,000 by the end of the year. Strategy has now revised its expectations, projecting prices to range between $85,000 and $110,000. The forecast for BTC yields has also been revised down to 24% from a previous estimate of 30%, along with projected Bitcoin gains decreasing significantly from $20 billion to $10.6 billion at the midpoint. Related Reading: $300 Million Crypto Bet: Kazakhstan’s Central Bank Gears Up As Bitcoin’s value continues to plummet, it further unravels Strategy’s financial outlook. Nevertheless, social media experts have pointed to a paradox within the company’s messaging. AlejandroXBT noted that while Saylor has consistently stated he will never sell Bitcoin, he has been conducting private presentations to clients outlining various strategic approaches, suggesting a potential disconnect between public declarations and private planning. When writing, the market’s leading cryptocurrency trades at $84,880, recording major losses of over 7% in the 24-hour time frame. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|btc price|BTCUSDT|crypto news|Michael Saylor|Microstrategy|MicroStrategy news|Strategy CEO|Strategy news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55232708,
    "published": 1764650807000,
    "title": "Ethereum ICO wallet moves $120M after a decade, throws it into staking",
    "body": "Fears tend to mount whenever an OG crypto whale starts shifting funds, but this one used it to double down on the blockchain network.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 205,
        "NAME": "TOKEN SALE",
        "CATEGORY": "TOKEN SALE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55233871,
    "published": 1764652701000,
    "title": "Solana (SOL) Slips Toward Key Support While Markets Brace for Next Big Move",
    "body": "Solana started a fresh decline below the $135 zone. SOL price is now consolidating losses below $130 and might decline further below $125. SOL price started a fresh decline below $135 and $130 against the US Dollar. The price is now trading below $130 and the 100-hourly simple moving average. There is a key bearish trend line forming with resistance at $136 on the hourly chart of the SOL/USD pair (data source from Kraken). The price could start a recovery wave if the bulls defend $125 or $120. Solana Price Dips Further Solana price failed to remain stable above $140 and started a fresh decline, like Bitcoin and Ethereum . SOL declined below the $135 and $132 support levels. The price gained bearish momentum below $130. A low was formed at $123, and the price is now consolidating losses. The price recovered a few points and tested the 23.6% Fib retracement level of the downward move from the $144 swing high to the $123 low. Solana is now trading below $130 and the 100-hourly simple moving average. On the upside, immediate resistance is near the $128 level. The next major resistance is near the $130 level. The main resistance could be $134 or the 50% Fib retracement level of the downward move from the $144 swing high to the $123 low. There is also a key bearish trend line forming with resistance at $136 on the hourly chart of the SOL/USD pair. A successful close above the $136 resistance zone could set the pace for another steady increase. The next key resistance is $140. Any more gains might send the price toward the $145 level. Another Decline In SOL? If SOL fails to rise above the $130 resistance, it could continue to move down. Initial support on the downside is near the $125 zone. The first major support is near the $122 level. A break below the $122 level might send the price toward the $120 support zone. If there is a close below the $120 support, the price could decline toward the $112 support in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is gaining pace in the bearish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is below the 50 level. Major Support Levels – $125 and $122. Major Resistance Levels – $130 and $136.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Technical analysis|Sol|Solana|solbtc|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55234761,
    "published": 1764653892000,
    "title": "Bollinger Bands suggest Bitcoin bottom can’t fall under $55K",
    "body": "A crypto analyst used Bollinger Bands and RSI data to argue Bitcoin’s bear market bottom will not pass under $55,000.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55235543,
    "published": 1764655204000,
    "title": "Avalanche Coils For Impact: This Indicator Signals A Massive Move Ahead",
    "body": "Avalanche (AVAX) is coiling for a massive move. A potent Wolfe Wave pattern is forming alongside a test of a key weekly trendline. This structural confluence signals that the market is reaching a point of maximum compression, indicating that a significant directional breakout is imminent. Wolfe Wave Formation Signals Strong Future Move According to a recent technical analysis by BeLaunch, AVAX is shaping a notable Wolfe Wave pattern, a formation known for sparking strong directional moves once completed. This developing structure reflects tightening price action and growing pressure within the market, hinting that a significant breakout could be on the horizon. Related Reading: AVAX Reclaims Top 20 Spot as Securitize Chooses Avalanche for EU Securities Platform At the same time, Avalanche is pressing against a descending weekly trendline that has consistently acted as a major resistance level. A breakout above it would reinforce the bullish implications of the Wolfe Wave, while a rejection could force the asset back into a prolonged consolidation. For those eyeing long-term accumulation, BeLaunch points to the $11–$8 range as the most compelling buy zone. This region could provide strong support and aligns with key structural levels, making it an attractive opportunity for investors preparing for the next potential upside cycle. Historical Precedent: The September 2023 Rally Setup BeLaunch went on to highlight that the current Avalanche setup closely mirrors the conditions seen in September 2023, just before a major rally unfolded. The resemblance between the two periods offers a valuable historical reference, suggesting that the market may once again be preparing for a significant move. Related Reading: Avalanche (AVAX) Price Holds Key Support, But Analyst Warns Rally Could Be At Risk The analysis emphasizes that the same pattern is taking shape once again, increasing the probability of an upward move if price action aligns with previous behavior. Repeated technical scenarios often carry weight because markets tend to respond consistently under familiar conditions. If AVAX continues to respect this structure, it could set the foundation for a potential bullish breakout. BeLaunch also noted the importance of continued monitoring as the pattern progresses. Tracking price action, market sentiment, and overall momentum will be crucial in determining whether the bullish outlook gains confirmation. Any future decisions or expectations will rely on clear signals from the pattern as well as shifts in broader market dynamics. Avalanche is currently trading around $13.06, reflecting a mild intraday pullback as the market adjusts to recent volatility. With a market capitalization of approximately $6.3 billion, AVAX remains one of the notable assets in the broader crypto landscape. Trading activity has been strong, with its 24-hour volume sitting between $428 million and $445 million, signaling ongoing interest from both short-term traders and long-term participants. Featured image from Shutterstock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "AVAX|Avalanche|AVAX Price|AVAXUSD|AVAXUSDT|belaunch|Descending Weekly Trendline",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 8,
        "NAME": "AVAX",
        "CATEGORY": "AVAX"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55235587,
    "published": 1764653892000,
    "title": "Bollinger Bands suggest Bitcoin bottom won’t fall under $55K",
    "body": "A crypto analyst used Bollinger Bands and RSI data to argue Bitcoin’s bear market bottom will not pass under $55,000.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55237102,
    "published": 1764657651000,
    "title": "BlackRock's Fink and Goldstein Say Tokenization Could Redraw Market Plumbing",
    "body": "BlackRock execs say tokenization, once tangled in the crypto frenzy, is accelerating toward a major rebuild of global market infrastructure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55237352,
    "published": 1764658152000,
    "title": "Sanctioned Cambodian Lender Huione, Linked to Illicit Crypto, Halts Business After Bank Run: Report",
    "body": "The scandal-plagued platform blamed a surge in withdrawals for its shutdown, the latest fallout from U.S. sanctions and money-laundering allegations targeting the wider Huione network.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Cambodia|Huione|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 55238926,
    "published": 1764660572000,
    "title": "Ethereum Devs Push ZK ‘Secret Santa’ System Toward Deployment",
    "body": "The proposed protocol uses zero-knowledge proofs to verify sender–receiver relationships without revealing identities.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 143,
        "NAME": "ZK",
        "CATEGORY": "ZK"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55240093,
    "published": 1764662415000,
    "title": "Revisiting $85,000: Bitcoin Price Drop Linked To Japanese Government Bonds",
    "body": "After a brief period of consolidation and a bullish uptick to around $93,000 at the end of last week, the Bitcoin price has once again dipped toward the $85,000 mark, recording a significant 7% drop on Monday, according to data from CoinGecko. Market expert Shanaka Anslem has pointed to what he refers to as “the weapon” behind this latest crash: Japanese government bonds. Expert Warns Of Unraveling Yen Carry Trade In a post on social media platform X (formerly Twitter), the expert highlighted that the yield on Japan’s 10-year bonds reached 1.877 percent on December 1, 2025—the highest level since June 2008—while the 2-year yield hit 1 percent, a benchmark not seen since before the collapse of Lehman Brothers. He explained that these rising yields have triggered a significant unwinding of what Anslem describes as the largest arbitrage trade in history: the Yen Carry Trade. Related Reading: Dogecoin Whale Activity Drops To Deepest Level In Two Months With estimates placing the total size of this trade at around $3.4 trillion and figures nearing $20 trillion, he noted that this allowed global investors to borrow Japanese yen at minimal costs to buy a variety of assets, including stocks, US Treasuries, and cryptocurrencies like Bitcoin. However, this era appears to have ended last month. The mechanics of this situation are straightforward but impactful, Anslem asserted. As yields rise, the yen strengthens, making leveraged positions increasingly unprofitable. He suggested that this leads to a chain reaction: selling triggers margin calls, which in turn causes further liquidations. On October 10, $19 billion in crypto positions were liquidated, marking the largest single-day wipeout in crypto history. By November, Bitcoin exchange-traded funds (ETFs) saw $3.45 billion exit the market, with BlackRock’s IBIT suffering a $2.34 billion loss. On December 1 alone, an additional $646 million was liquidated before lunchtime. Will The Bitcoin Price Plunge To $75,000? This decline has occurred alongside the Bitcoin price correlations with major stock indices, showing a 46% correlation with the Nasdaq and a 42% correlation with the S&P 500. Anslem noted in his analysis that what was once perceived as an “uncorrelated hedge” has now transformed into a leveraged indicator of global liquidity conditions. Related Reading: Is Strategy Buying Bitcoin Again? Saylor’s ‘Green Dots’ Suggest Yes Interestingly, despite the Bitcoin price collapse, whale investors accumulated 375,000 BTC during this period. Moreover, miners significantly cut back their selling, reducing monthly sales from 23,000 BTC to just 3,672. As the market looks ahead, the expert asserted that a pivotal moment approaches on December 18 with the Bank of Japan’s upcoming policy decision. Anslem concluded that if the bank opts to raise rates and signal further increases, the Bitcoin price could test the $75,000 level, which would represent an additional 11% drop for the market’s leading cryptocurrency from current trading levels. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|bitcoin technical analysis|btc|BTC news|btc price|BTCUSDT|crypto|crypto news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55240090,
    "published": 1764662400000,
    "title": "Unlimit Debuts Stable.com, a Decentralized Clearing House Built for Stablecoins",
    "body": "The new non-custodial platform brings stablecoin swaps and global fiat off-ramps into one place, aiming to make the process more seamless for users.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Stablecoins|DeFi|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 55241829,
    "published": 1764665147000,
    "title": "Ripple, major VCs back RWA platform OpenEden to scale tokenized Treasurys",
    "body": "OpenEden has raised an undisclosed round backed by Ripple and major institutions to expand tokenized US Treasurys.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55242281,
    "published": 1764666019000,
    "title": "Zcash (ZEC) Leads Market Pullback With 24% Drop, Analysts Warn Of Another Crash Ahead",
    "body": "As the whole crypto market bled, Zcash (ZEC) started December with a massive one-day pullback, leading the losses among top cryptocurrencies. While some market observers suggest that the altcoin is positioned for a major move, others have warned that the price risks another major correction in the coming weeks. Related Reading: Is Strategy Buying Bitcoin Again? Saylor’s ‘Green Dots’ Suggest Yes Zcash Loses Key Support Levels Amid Crash Following the late Sunday market correction, Zcash has lost crucial levels and fallen to one-month lows. Over the past three months, the cryptocurrency has seen a parabolic rally, surging over 1,775% to its all-time high (ATH) of $750 in early November. Since its ATH rally, the altcoin has been trading within the $440-$720 levels, bouncing between the range’s upper and lower boundaries amid the recent market volatility. However, the end-of-November pullback saw ZEC’s price unsuccessfully retest its key support area, closing the day below this area for the first time in nearly a month. After losing this zone, Zcash continued to drop below other key support levels, breaking down the $400 barrier and hitting a local low of $328 on Monday morning before bouncing to the $340 area. Amid this performance, some market observers warned that the altcoin could be in trouble and further bleeding may occur in the coming weeks. Sjuul from AltCryptoGems highlighted that ZEC registers the biggest price drops in the weekly and daily timeframes, with declines of 40.2% and 24%, respectively. The analyst previously pointed out that the cryptocurrency lost its uptrend after falling below the EMA200, recording “a perfect bearish retest followed by a strong rejection” last week. As a result, Sjuul suggested that if Zcash did not reclaim the key moving average, the cryptocurrency would be positioned for a breakdown to lower support levels. Similarly, Altcoin Sherpa considers that ZEC could drop another 30%-40% to the $200 area after losing the crucial $440 support. Nonetheless, he added that the price will likely see short-term bounces during its retracement. ZEC’s Correction: Nothing To Worry About? Mert Mumtaz, Helius co-founder and CEO, affirmed that a correction after a 700% rally “is normal,” adding that the privacy token “looks great” on higher timeframes. Notably, the cryptocurrency still shows 700% and 485% increases on the three-month and one-year timeframes. The CEO also highlighted Zcash’s strengths: “privacy is not a narrative, private money is the entire purpose of crypto,” suggesting that the altcoin is positioned to challenge other leading cryptocurrencies like XRP in the future. Meanwhile, another pseudonym market watcher considers that Zcash is preparing for a big move despite the correction. According to X analyst Make Sense, the cryptocurrency is at a make-or-break level after falling to the $320 mark, its first major support area below the November range. If ZEC holds the current range, the price could reclaim its recently lost range and bounce to its $500-$600 mid-range. On the contrary, if it loses its current levels, the cryptocurrency could retest the $280 and even $200 area, he affirmed, before a trend reversal. Related Reading: Will Bitcoin (BTC) End 2025 In Green? November Close May Hold The Key “This is where market makers decide the next trend: bounce early → mid-range rally or deep sweep → full trend reversal. Either way, volatility is about to explode,” he explained. As of this writing, Zcash is trading at $338, a 20% decline in the monthly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto analyst|Crypto Bull Run 2025|crypto market correction|Crypto trader|privacy token|ZCash|Zcash parabolic rally|Zcash Price|ZEC|ZEC ATH|ZECUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55242928,
    "published": 1764666868000,
    "title": "x402 ecosystem expands as Solana becomes number-one network for payments",
    "body": "Solana has quietly become the busiest chain for x402 payments, clocking an all-time high $380,000 in daily volume and a 750% weekly jump.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55242695,
    "published": 1764666712000,
    "title": "Anthropic Research Shows AI Agents Are Closing In on Real DeFi Attack Capability",
    "body": "Models tested by MATS and the Anthropic Fellows program generated turnkey exploit scripts and identified fresh vulnerabilities, suggesting automated exploitation is becoming technically and economically viable.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Tech|Artificial Intelligence|Hack|DeFi|Decentralized Finance|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  }
]