[
  {
    "id": 55362709,
    "published": 1764880165000,
    "title": "Privacy-First 'Alien' Identity System Aims to Prove Users Are Human in the Age of AI",
    "body": "Alien’s privacy-focused decentralized app verifies users without storing biometrics or government IDs. Here's how it works.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55362462,
    "published": 1764879757000,
    "title": "After Faking Death, Zerebro Founder Unveils AI-Penned Manifesto and New Solana Coin",
    "body": "The manifesto argues for a future in which AI and humans will converge biologically, chemically, and surgically in a new form of humanity.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55363722,
    "published": 1764882058000,
    "title": "Dogecoin Price Can Stage A 96% Rally If It Breaks This Falling Wedge Pattern",
    "body": "Dogecoin has spent the majority of the past 30 days drifting lower, falling into a tight and almost predictable rhythm of lower highs and lower lows. The movement has been sluggish, but technical analysis shows that something important may now be forming. A new analysis shared by crypto commentator Clifton Fx suggests that Dogecoin is approaching the end of this decline, and the chart he posted highlights a falling wedge pattern that could become the basis for a 96% rally if buyers finally step in with conviction. A Falling Wedge That Has Started Attracting Attention Technical analysis of Dogecoin’s price action on the 12-hour chart shows two downward-sloping trendlines gradually converging. This pattern is highlighted by coiling price action, with each bounce becoming smaller and the space between the trendlines becoming narrower. Related Reading: Here’s The Bullish Trend Developing To Trigger A 174% Move For The Dogecoin Price This structure is what analysts often describe as a falling wedge. It forms during a downtrend, but the more it tightens, the more it hints that sellers are losing control and buyers are quietly gaining ground. Clifton Fx pointed exactly to this development in his post, noting that Dogecoin is already pushing against the upper boundary of the wedge. The chart he shared shows the price making repeated attempts to break out, something that is typically viewed as early evidence that momentum is shifting. As it stands, recent price action in the past 48 hours or so has led to the creation of multiple green 12-hour candles after Dogecoin rebounded from a $0.135 low. This has caused the Dogecoin price to approach the upper resistance trendline, and the outlook depends on what happens here. In the analyst’s view, a strong breakout candle above the wedge would confirm that the pattern has completed and that Dogecoin is ready for a sustained move upward. The Case For A 96% Rally The appeal of this technical setup is the potential size of the move if the breakout plays out. The wedge spans a wide vertical range, and in technical analysis the height of the pattern is a guide for estimating the rally after a breakout. Related Reading: XRP Price To $10, Solana To $600, And Dogecoin At $0.75? Analyst Reveals When Based on the structure visible on the chart, a successful breakout would open the door for a 96% climb from current levels. However, this doesn’t guarantee that the move will happen immediately. Dogecoin has been under pressure for weeks, and a breakout without proper momentum can easily fail. A clean surge above the trendline, preferably one that arrives with rising trading volume, would help confirm that buyers are taking over. Anything slower or weaker could see the Dogecoin price rejecting at the resistance trendline and falling to approach the lower support trendline, which is now around the mid-$0.13 range. Featured image from Pngtree, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|Clifton Fx|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt|falling wedge pattern",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55364077,
    "published": 1764882742000,
    "title": "Canton Network Creator Snags Strategic Investment from Wall Street Giants",
    "body": "BNY, Nasdaq, iCapital and S&P Global invested in Digital Assets, powering blockchain infrastructure for tokenized real-world assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Digital Asset|Nasdaq|BNY Mellon|S&P|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55363919,
    "published": 1764882238000,
    "title": "Ether outpaces Bitcoin’s trend change: Is ETH on track for a 20% rally?",
    "body": "ETH outperformed Bitcoin in terms of spot ETF flows and short-term returns. Technical charts suggest traders are positioning for a 20% upmove.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55364763,
    "published": 1764883866000,
    "title": "Former Binance.US CEO launches stablecoin platform ahead of L1 network",
    "body": "After securing $20 million in seed funding for the project in January, Brian Shroder announced a step toward 1Money’s planned stablecoin network.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55364585,
    "published": 1764883556000,
    "title": "Solana and Ethereum Network Base Are Now Connected Thanks to Coinbase and Chainlink",
    "body": "Solana and Base are now connected thanks to a new bridge secured by Chainlink's interoperability protocol and crypto exchange Coinbase.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55364846,
    "published": 1764884161000,
    "title": "Myriad Moves: Bitcoin and Ethereum Recovery Odds Rise as Traders Flip Bullish",
    "body": "Top markets on Myriad this week include predictions on where Bitcoin and Ethereum are headed next, plus odds of another major liquidation event.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55364906,
    "published": 1764884108000,
    "title": "Hua Xia state-linked Chinese bank tokenizes $600M in yuan bonds",
    "body": "The bond was auctioned off to holders of the digital yuan, a central bank digital currency (CBDC) developed by the Chinese government.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 55365638,
    "published": 1764885611000,
    "title": "First Sovereign Crypto Super-App May Bear a ‘Made in Korea’ Stamp",
    "body": "Suvashree Ghosh writes on how Naver's acquisition of South Korea's largest crypto exchange may lead to a much talked about \"super application\" on a sovereign level.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55365543,
    "published": 1764885606000,
    "title": "Fusaka Upgrade Reignites Confidence in Ethereum, Analysts Eye $3,500 Target",
    "body": "Ethereum (ETH) is topping talks once again as its Fusaka upgrade goes live and the ETH price returns firmly above the $3,200 mark. After weeks of choppy trading and lingering fear across the broader crypto market, the combination of a major technical overhaul and rising on-chain activity is giving traders a fresh narrative to follow. Related Reading: Eric Trump Says Bitcoin Could Hit $500,000, Stands By ABTC Strategy In the last 24 hours, ETH has climbed around 4–5%, outperforming most large-cap cryptos and reclaiming a key psychological zone near $3,200. Market data shows rising volumes and a noticeable pickup in accumulation from larger holders, even as sentiment indicators still sit in “Fear” territory. ETH's price trends to the downside, but records some gains on the daily chart. Source: ETHUSD on Tradingview Fusaka Upgrade Shifts Focus Back to Ethereum’s Scaling Roadmap The Fusaka upgrade, Ethereum’s second major network update of 2025, activated at block height 18,200,000. At its core is PeerDAS, a data availability sampling system that lets nodes store only slices of blob data instead of entire payloads. This change is estimated to expand blob throughput by roughly eight times, easing congestion and helping layer-2 networks push more transactions through Ethereum’s base layer. Developers describe Fusaka as another step in Ethereum’s long-term scaling roadmap, aligning the main chain with growing layer-2 activity. Beyond PeerDAS, the upgrade bundles a series of Ethereum Improvement Proposals that tweak gas limits, transaction sizes, cryptographic support, and block configuration, aiming to improve efficiency while keeping validator requirements manageable. Whales, ETFs and Technical Signals Cluster Around $3,500 On-chain data shows “shark” wallets holding between 1,000 and 10,000 ETH have ramped up accumulation in recent weeks, buying aggressively on dips around $2,700–$3,000. Institutional interest also appears to be rising. BitMine has reportedly added more than 18,000 ETH to its treasury ahead of Fusaka, while U.S. spot Ethereum ETFs have recorded notable net inflows. Technically, ETH is trading around $3,200 with analysts watching resistance between $3,300 and $3,500. Short-term models project a move toward roughly $3,537 within days, implying upside of about 10% if the current trend holds. However, indicators remain mixed. The broader setup is still labelled “bearish,” and any pullback could see ETH retesting support around $3,100, $3,000, or even the $2,850 zone. Related Reading: XRP Price Is Performing As Expected; Analyst Reveals What Comes Next For now, the Fusaka upgrade has shifted the conversation back to fundamentals, with Ethereum’s price action testing whether renewed confidence is enough to carry it through the $3,500 barrier. Cover image from ChatGPT, ETHUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|eth price|ethereum|ethereum price|ethusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55366330,
    "published": 1764887257000,
    "title": "Vivek Ramaswamy’s Strive Sends Out A Warning Letter To MSCI Over Its Proposal To Shun Bitcoin Treasuries From Indexes",
    "body": "MSCI indexes may soon exclude bitcoin treasury companies like Michael Saylor’s Strategy. That’s setting off alarm bells for the $100 billion industry and its fee-hungry bankers.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|Money|/money|Editors' Pick|editors-pick|premium",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55367007,
    "published": 1764889219000,
    "title": "Ethereum NUPL Holds Steady, Signaling Market Balance Amid Volatility",
    "body": "Ethereum is demonstrating notable relative strength after reclaiming the $3,150 level and attempting to push higher, offering a refreshing shift in sentiment following weeks of intense selling pressure, fear, and market-wide uncertainty. As the broader crypto landscape begins to stabilize, ETH stands out as one of the assets showing early signs of recovery, drawing renewed attention from traders and long-term investors alike. Related Reading: Tron Hits $80.2B Stablecoin Milestone After Tether Mints 1B USDT On The Network A key factor supporting this shift is the Net Unrealized Profit/Loss (NUPL) reading for Ethereum on Binance, which is currently sitting around 0.22 while price trades near $3,100. This level reflects a delicate equilibrium between fear and optimism, indicating that a significant portion of ETH holders remain in moderate profit. Importantly, NUPL has not yet moved into the “greed” zone typically seen in the late stages of a bullish cycle, suggesting that the market is far from overheated. Instead, Ethereum appears to be transitioning into a more neutral, constructive phase where investors are cautiously optimistic but not excessively euphoric. This balance often forms the foundation for a healthier recovery, especially after a deep correction. If momentum continues building and NUPL remains stable or trends higher, ETH could be positioning itself for a stronger upside move in the coming weeks. NUPL Signals a Transitional Market Phase Arab Chain notes that Ethereum’s NUPL index experienced a significant rise between June and August, reaching levels far higher than today and reflecting strong profitability across the network during mid-2025. At that time, investor sentiment leaned toward optimism, supported by rising prices and improving macro conditions. However, as Ethereum’s price began to decline steadily from October onward, unrealized profits started to shrink. This pushed NUPL down toward more neutral territory, signaling a shift in sentiment from elevated optimism to a more grounded, cautious outlook. Crucially, NUPL has not fallen into negative territory, meaning the average ETH holder has not transitioned into unrealized losses. This is an important sign of underlying market strength. When investors remain in profit, they tend to be less motivated to sell aggressively at lower prices, reducing the risk of panic-driven capitulation and helping stabilize price action during corrections. Taken together, these signals indicate that Ethereum is currently in a transitional phase. The market is neither euphoric nor fearful—rather, it is waiting for a decisive catalyst to define the next trend. As long as NUPL stays above 0.20, Ethereum retains a meaningful level of investor confidence, increasing the likelihood of a rebound if liquidity strengthens or positive fundamental developments emerge. Related Reading: Bitmine Buys Another 18,345 Ethereum ($54.94M) In Fresh Accumulation Push – Details ETH Rebounds Strongly on the Weekly Chart Ethereum’s weekly chart shows a powerful rebound as price surges back above the $3,150–$3,200 region, reclaiming a critical support band that had turned into resistance during the November sell-off. The long lower wick from last week’s candle confirms strong buy-side interest around the $2,700–$2,800 zone, an area that has historically acted as a major demand region during multi-month corrections. ETH has now reclaimed the 100-week SMA, a key trend indicator currently positioned near $2,900, signaling renewed structural stability. The 200-week SMA, sitting comfortably lower, continues to reinforce the long-term uptrend. However, the 50-week SMA, which has flattened and now looms around the $3,350–$3,400 level, represents the next significant resistance level. ETH will need a decisive weekly close above this moving average to confirm a true shift back into bullish momentum. Related Reading: Ethereum Open Interest Cut In Half As $6.4B In Positions Vanish: Market Reset Accelerates Volume on the rebound is notably stronger than in previous consolidation phases, suggesting increased participation and growing confidence among market participants. However, ETH is not yet in the clear. The series of lower highs since the September peak forms a descending structure that must be broken for a sustained uptrend to resume. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ethereum|Ethereum Analysis|ethereum news|Ethereum NUPL|ethereum price|Ethereum Price analysis|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55368467,
    "published": 1764892819000,
    "title": "Reversal Loading? Bitcoin, Ethereum, And Solana Build Powerful High-Time-Frame Structures",
    "body": "In the volatile theatre of the cryptocurrency market, Bitcoin, Ethereum, and Solana are showing signs of a potential high-time-frame reversal. After weeks of stress and price compression, each of the top assets is now stabilizing at key structural support levels. The multiple leading cryptocurrencies are flashing similar recovery setups at the same time. The current crypto landscape may be setting up one of the most powerful high-time-frame reversals across Bitcoin, Ethereum, and Solana. An investor and trader known as MacroCRG on X highlighted that yesterday, all three assets printed a bullish engulfing candle, a strong signal that buyers are stepping back in with intent. Market Leaders Hint At A Shift Before Smaller Assets Follow On the weekly chart, each asset is showing the early stages of an inside-week breakout paired with a false breakdown. MacroCRG pointed out that a similar structure on the ES (S&P 500 futures) chart from April, where the breakdown of inside-week structure led to a breakout that never looked back when the bull secured the weekly close. Related Reading: Institutions Exit Bitcoin In Large Tranches, Ethereum, Solana And XRP See Massive Buy-Ins For this setup to take hold, these prices need to close the week above the key highlighted highs on the chart. However, there’s still a long way to go before the weekly close will confirm the breakout, and the bulls need to follow through with conviction and remove any doubt. The founder of the ProMintClub investment community, ProMint, has spotted a high-conviction whale trader aggressively building long positions across the crypto market. Currently, the trader is leading the Lighter leaderboard with over $64 million in profit and loss, while maintaining an 83% long bias. His Lighter account has the highest profit and loss with over $8 million. These are insane numbers compared to everyone else on the leaderboard. Data shows that the trader has made five deposits into his Lighter account, which total around $6 million in capital. His positions are spread across BTC, ETH, SOL, AAVE, along with smaller plays such as PAXG and PUMP, consistently entering at strong timing points and riding momentum higher. Even though funding costs have flipped heavily negative, he is not backing down. Presently, this is the top-performing account on Lighter, and this is serious capital deployed with conviction. How Increased Partners Drive Sustained Volume Demand According to Chainflip Labs, November marked one of the strongest performance months in the protocol’s history, clearing over $583 million in swap volume, which is the second-best month ever for the network. Related Reading: You Won’t Believe How Much Bitcoin Companies Now Hold, What % Of Supply Do They Control? Demand remained sustained across BTC, ETH, and SOL routes, and more partners are routing flow through the network than ever before. The trend clearly shows that Chainflip will continue to scale. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|aave|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|Chainflip Labs|ETH|ethereum|MacroCRG|PAXG|ProMint|pump|S&P 500|Sol|Solana",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55369986,
    "published": 1764896436000,
    "title": "Bitcoin Signals Bear Market: One Thing Could Flip It, Says CryptoQuant CEO",
    "body": "Bitcoin may be sliding into a new bear phase unless fresh macro liquidity – particularly through spot ETFs – returns to the market, according to CryptoQuant CEO Ki Young Ju. Bitcoin Bear Market Incoming? Sharing a composite on-chain dashboard overlaid on the BTC price, Ju wrote on X: “Most Bitcoin on-chain indicators are bearish. Without macro liquidity, we enter a bear cycle.” The chart stacks ten CryptoQuant metrics behind the price in a red-to-green heatmap from 2021 to 2025, highlighting how regime shifts in prior cycles coincided with clusters of bearish readings. Related Reading: US Sen. Lummis Hints At US Bitcoin Buy With ‘Franklin’ Meme The indicators in the panel include the MVRV Z-score, CryptoQuant P&L Index, the Bull-Bear Cycle Indicator, Inter-Exchange Flow Pulse, Network Activity Index, Stablecoin Liquidity, Bitcoin Demand Growth, Trader On-chain Profit Margin, Trader Realized Price and a Technical Signal metric. When the majority are bullish, the backdrop turns light green; when they flip bearish, it shifts to red. In the latest section of the chart, as BTC has pulled back from its highs, red once again dominates – the visual basis for Ju’s warning. For the next major move, Ju argues that on-chain data is now subordinate to macro conditions and ETF flows. Quoting his own post, he wrote: “It is simple. If you think macro gets better next year, you buy. Otherwise, you sell. I’m not a macro expert, so find macro bros. New ETF inflows are the key.” That line pinpoints what he believes can “save” Bitcoin from a deeper drawdown: renewed demand from spot ETFs as a conduit for institutional capital. In earlier stages of the cycle, rising ETF inflows coincided with strong price appreciation; more recently, slowing or negative flows have mirrored the loss of upward momentum. Ju frames the current environment as one that demands flexible scenario management rather than rigid forecasts. “At this stage, it is more about being reactive than predictive. Set your scenarios and trade accordingly,” he told followers. The composite chart is designed for exactly that purpose, showing how past bull tops and bear markets aligned with persistent stretches of red across profit, valuation and liquidity metrics. Related Reading: Bitcoin And The 2026 Fed Shift: Expert Says Markets Aren’t Ready Despite the bearish tilt, Ju does not foresee a repeat of the 2022 collapse, when Bitcoin fell roughly 65% from peak to trough. He cites the behaviour of Michael Saylor led Strategy as a stabilizing factor. “If Strategy holds its 650K BTC this cycle (or sells only a little), we would not see another -65% drawdown like in 2022,” he wrote. In his view, that supply remaining largely off the market reduces the probability of a violent deleveraging event. Ju characterizes the current pullback as substantial but not extreme in historical context. “We are about -25% from ATH now, and even if a bear cycle comes, the downside would likely be smaller and look more like a broad sideways range,” he argued, suggesting that prolonged consolidation is more likely than a single dramatic crash. His message to long-term investors is explicitly calming. “Long-term holders should avoid panic selling,” he advised. While cyclical on-chain indicators flash red, he insists the structural backdrop has improved: “Bitcoin has more liquidity channels now, so the long-term outlook is obviously strong, imo.” Those channels include ETFs and a deeper institutional market structure than in prior cycles. At press time, Bitcoin traded at $92,494. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|cryptoquant|ki young ju",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55369984,
    "published": 1764896416000,
    "title": "Ethereum Back At $3,200 As Sharks Show Strong Accumulation",
    "body": "Ethereum has witnessed a recovery surge recently as on-chain data shows the shark-sized investors have been participating in strong buying. Ethereum Sharks Have Added 450,000 ETH Since Mid-November According to data from on-chain analytics firm Santiment, the supply of the Ethereum sharks has gone up recently. The indicator of relevance here is the “Supply Distribution,” measuring the total amount of tokens that a given wallet group as a whole is holding right now. Related Reading: Next Key XRP Level Could Be $1.2 If Current Support Fails, Says Analyst In the context of the current topic, the cohort of focus is the one corresponding to a coin range of 1,000 to 10,000 ETH. At the current exchange rate, the lower bound of the range roughly converts to $3.2 million and the upper one to $32 million. Investors of this large size are popularly known as the sharks. While not as massive as the whales (addresses with more than 10,000 ETH), the sharks are still considered influential entities. This can make their behavior often worth keeping an eye on. As the chart below, shared by Santiment, suggests, the latest Ethereum shark behavior has been one of accumulation. During the November price decline, the Supply Distribution had been going down for the Ethereum sharks, but around the time of the market bottom, its trend began to reverse. Between November 18th and December 2nd, the sharks added a total of 450,000 ETH (worth about $1.4 billion) to their wallets, a massive amount. Alongside this sharp uptick in the metric, ETH went through its price recovery. The cryptocurrency’s sharp retrace to start December didn’t dissuade these large hands, either, as their supply only continued to rise. This may be one of the factors behind the quick resumption of bullish momentum that the asset has seen. Another bullish factor has been the trend in the Network Growth, another on-chain indicator displayed in the chart. This metric measures the daily number of addresses that are coming online on the Ethereum network for the first time. A wallet is considered “online” when it participates in transaction activity on the blockchain, so the Network Growth essentially tracks the addresses making their very first transfer. From the graph, it’s visible that this Ethereum metric has also surged recently, hitting a peak value of 190,000 addresses. Generally, a surge in network activity is usually a positive sign for any rally’s sustainability, as it implies that the network is able to attract fresh attention. Related Reading: Bitcoin Blasts To $92,000, Liquidating $182 Million In Shorts That said, too much attention too fast can actually end up having a negative effect on the cryptocurrency. It now remains to be seen whether the sharks will continue to buy in the near future and if investor FOMO will remain at healthy levels. ETH Price At the time of writing, Ethereum is floating around $3,185, up more than 5% over the last seven days. Featured image from Dall-E, Santiment.net, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ethereum|Ethereum accumulation|Ethereum rally|Ethereum Sharks|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55370723,
    "published": 1764898176000,
    "title": "Cantor has cut its Strategy price target by 60%, but wants you to know everything is going to be OK",
    "body": "“This Fear is Not Warranted”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 55371481,
    "published": 1764900006000,
    "title": "Fed Turns On The Liquidity Hose, XRP Ready To Ignite, Investor Claims",
    "body": "Reports have disclosed that the US Federal Reserve has ended its Quantitative Tightening program and has put cash back into markets. According to sources, the Fed injected more than $13 billion through overnight repo operations, the largest such move in years. Related Reading: Bitcoin Trail Ends: $29M Seized After European Authorities Shut Down Cryptomixer Crypto investor and author Paul Barron said that coins like XRP could “bring the fire” now that more liquidity is flowing back into the system. He believes that when the Fed starts easing up, assets with clear utility often react faster than the rest of the market. Barron added that stronger liquidity usually pulls traders toward tokens that can move money quickly and cheaply, which is why he thinks XRP may see more attention if this trend continues. Markets reacted quickly. Bitcoin rose about 4% in a 24-hour span to reach $93,800. XRP climbed more than 8%, touching $2.18 as demand picked up. 🔥 THE FED JUST DOUSED THE FLAMES: $13.5B repo injection, 2nd-largest since C@#$D After months of burning through liquidity (QT), they’re flooding the system again. Here’s the pattern: When the Fed brings water, $BTC, $ETH, $XRP brings the FIRE. Risk assets don’t cool down when… — PaulBarron (@paulbarron) December 2, 2025 Liquidity Push Fuels Market Moves According to analysts, this type of liquidity shift often lifts risk assets, including crypto. Tom Lee of BitMine said on TV that Bitcoin gained nearly 20% in the weeks following the last time the Fed shifted away from QT. He noted that the same setup might lead to more upside before the year ends. Many traders are watching how much money returns to markets because it can shape short-term sentiment. ETF Flows And Long-Term Views According to reports, new XRP ETFs have already attracted more than $800 million in inflows. Supporters say these inflows can change how investors view XRP, although they don’t remove all uncertainty. Some hedge fund managers also weighed in, pointing out that over the past 16 years the Fed added close to $9 trillion in liquidity while only removing $3.2 trillion before reversing course. Utility Tokens May Get More Attention Some community voices argue that tokens built for payments or settlement may see stronger demand if liquidity continues to rise. One XRP supporter said XRP was made to move money at scale and claimed the market will focus more on assets with real use cases. Adoption remains mixed. Some companies that previously used Ripple’s tools have stepped back, while others still rely on parts of its payment network. The XRP Ledger is being used, but not always in the same way it was during earlier partnerships. Related Reading: Eric Trump Says Bitcoin Could Hit $500,000, Stands By ABTC Strategy Outlook For The Market With Bitcoin holding steady at the $93,000 level, and XRP at $2.22, the market is clearly reacting to the Fed’s change of direction. Liquidity helps drive rallies, but it also creates quick pullbacks and shaky moments. Barron’s line — that coins like XRP could “bring the fire” — hangs over the market: renewed liquidity may be the spark that helps XRP ignite fresh momentum. But fire can spread fast or fizzle out; traders should stay alert, manage risk, and not get burned if the rally cools as quickly as it heats up. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|bitcoin|btcusd|crypto|fed|xrp",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55371909,
    "published": 1764900848000,
    "title": "SOL price capped at $140 as altcoin ETF rivals reshape crypto demand",
    "body": "SOL struggles to extend its gains as declining activity, falling leverage demand and competition from newly launched spot altcoin ETFs challenge Solana’s price rebound.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55372424,
    "published": 1764901799000,
    "title": "Asia Morning Briefing: Crypto’s Next Breakout Will Come From Infrastructure, Not Narratives, Hashed Says",
    "body": "The Korean venture firm’s 2026 thesis argues that stablecoins, AI agents, and on-chain credit markets are becoming the foundation of a real digital economy, with Asia emerging as the first region where enterprise adoption is taking shape.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Hashed|Korea|Artificial Intelligence|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55372173,
    "published": 1764901526000,
    "title": "Bitcoin Coils Near Highs as Bulls Defend Gains Ahead of Resistance",
    "body": "Bitcoin price started a fresh increase above $92,500. BTC is now consolidating gains and might attempt an upside break above $93,500. Bitcoin started a fresh increase above the $92,500 zone. The price is trading above $92,000 and the 100 hourly Simple moving average. There was a break below a bullish trend line with support at $93,000 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move up if it settles above the $93,000 zone. Bitcoin Price Faces Resistance Bitcoin price managed to stay above the $90,000 zone and started a fresh increase . BTC gained strength for a move above the $90,500 and $91,500 levels. There was a clear move above the $93,000 resistance . A high was formed at $94,050 and the price is now consolidating gains. There was a minor drop to test the 23.6% Fib retracement level of the upward move from the $83,870 swing low to the $94,050 high. There was a break below a bullish trend line with support at $93,000 on the hourly chart of the BTC/USD pair. Bitcoin is now trading above $92,000 and the 100 hourly Simple moving average. If the bulls remain in action, the price could attempt another increase. Immediate resistance is near the $92,800 level. The first key resistance is near the $93,000 level. The next resistance could be $94,000. A close above the $94,000 resistance might send the price further higher. In the stated case, the price could rise and test the $95,000 resistance. Any more gains might send the price toward the $95,500 level. The next barrier for the bulls could be $96,200 and $96,450. Downside Break In BTC? If Bitcoin fails to rise above the $94,000 resistance zone, it could start another decline. Immediate support is near the $91,650 level. The first major support is near the $90,500 level. The next support is now near the $88,950 zone or the 50% Fib retracement level of the upward move from the $83,870 swing low to the $94,050 high. Any more losses might send the price toward the $87,750 support in the near term. The main support sits at $87,200, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $91,650, followed by $90,500. Major Resistance Levels – $93,000 and $94,000.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55373354,
    "published": 1764903619000,
    "title": "Ethereum Coils For A Breakout As IH&S + Heavy Accumulation Emerges",
    "body": "Ethereum is approaching a critical moment as multiple bullish signals begin to align. A clear Inverse Head & Shoulders formation, combined with rising accumulation and weakening trend rejection, suggests that the market may be gearing up for a powerful upside move. With momentum tightening and key levels coming into focus, ETH now stands on the verge of a breakout that could set the stage for its next major rally. Inverse Head And Shoulders Signals Brewing Momentum According to a recent update shared by crypto analyst Donald Dean, Ethereum may be gearing up for a significant move. He highlighted the development of a potential inverse head and shoulders pattern, a classic bullish reversal formation that often precedes strong upward momentum. This emerging structure suggests that ETH could soon shift into a more aggressive bullish phase if confirmed. Related Reading: Ethereum Rockets Higher, Narrowing Distance to a Make-or-Break Resistance Line Dean also pointed out that the weekly chart is showing solid support near the 50% Fibonacci retracement level, positioned around $2,750. Adding to the bullish signals, a hammer candle has appeared on the weekly timeframe, hinting at buying pressure stepping back in after recent downside movement. If the pattern plays out, Dean noted that Ethereum’s first major target lies at $4,109, a level that would allow ETH to challenge previous resistance/support zones. Reclaiming this region would mark a meaningful shift in momentum and strengthen the bullish outlook for the asset. Beyond that, the next upside target sits near $5,766, which aligns closely with the 1.618 Golden Ratio extension calculated at approximately $5,793.51. Dean described this confluence as particularly noteworthy, suggesting that if Ethereum breaks above its nearer targets, a larger rally toward this golden-ratio level becomes a realistic possibility. Growing Accumulation Suggests Bulls Are Preparing For Action In an earlier analysis, LSTRADER reminded followers of the impressive move from $1,600 to $4,800, noting that this surge had been identified in advance through both the ETH chart and the ETH/BTC setup. The analysis captured the momentum shift that preceded the rally, reinforcing the value of tracking key structural signals. Related Reading: Ethereum Open Interest Cut In Half As $6.4B In Positions Vanish: Market Reset Accelerates In the current market structure, LSTRADER noted that the chart clearly shows multiple instances where the trend faced rejection. Despite these rejections, the trend is steadily losing strength while accumulation continues to build, a combination that typically reflects growing bullish interest and the potential for an upward breakout. However, LSTRADER stressed that no major move should be assumed until the trendline itself is broken, and confirmation is still required. For now, patience is key as traders continue monitoring the structure and waiting for a decisive shift in trend direction. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|Donald Dean|ETH|ETH news|eth price|ETH/BTC|ethereum|ethereum news|ethereum price|ethusd|ETHUSDT|Fibonacci Retracement Level|golden ratio|LSTRADER",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55373606,
    "published": 1764904116000,
    "title": "Ethereum Tightens Uptrend Structure as Market Eyes Another Wave of Gains",
    "body": "Ethereum price started a fresh increase above $3,20 0. ETH is now consolidating gains and might aim for more gains above $3,250. Ethereum started a fresh increase above the $3,050 and $3,120 levels. The price is trading above $3,120 and the 100-hourly Simple Moving Average. There is a short-term contracting triangle forming with support at $3,130 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move up if it settles above the $3,240 zone. Ethereum Price Eyes Another Upside Break Ethereum price managed to stay above $2,920 and started a fresh increase, like Bitcoin . ETH price gained strength for a move above the $3,000 and $3,050 resistance levels. The bulls even pumped the price above $3,150. However, the bulls struggled to clear $3,240 and $3,250. A high was formed at $3,239 and the price recently corrected some gains. There was a spike below the 23.6% Fib retracement level of the recent move from the $2,718 swing low to the $3,239 low. Ethereum price is now trading above $3,120 and the 100-hourly Simple Moving Average . There is also a short-term contracting triangle forming with support at $3,130 on the hourly chart of ETH/USD. If there is another upward move, the price could face resistance near the $3,200 level. The next key resistance is near the $3,240 level. The first major resistance is near the $3,250 level. A clear move above the $3,250 resistance might send the price toward the $3,320 resistance. An upside break above the $3,320 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $3,450 resistance zone or even $3,500 in the near term. Downside Correction In ETH? If Ethereum fails to clear the $3,240 resistance, it could start a fresh decline. Initial support on the downside is near the $3,120 level. The first major support sits near the $3,050 zone. A clear move below the $3,050 support might push the price toward the $3,000 support. Any more losses might send the price toward the $2,980 region and the 50% Fib retracement level of the recent move from the $2,718 swing low to the $3,239 low in the near term. The next key support sits at $2,850 and $2,840. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI – The RSI for ETH/USD is now above the 50 zone. Major Support Level – $3,130 Major Resistance Level – $3,240",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55375739,
    "published": 1764907250000,
    "title": "Solana and Coinbase’s Base connect together using Chainlink",
    "body": "Base launched a Chainlink-secured bridge to Solana, enabling crosschain asset transfers between the Ethereum layer-2 and the Solana blockchain.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55375602,
    "published": 1764907215000,
    "title": "Here's How Much Bitcoin, XRP, Ether, Solana May Move on Friday's Inflation Report",
    "body": "A softer inflation report could lower the 10-year Treasury yield and support cryptocurrencies.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Ethereum News|XRP News|Solana News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55375548,
    "published": 1764907068000,
    "title": "OpenAI Ordered to Hand Over 20M ChatGPT Logs in NYT Copyright Case",
    "body": "A federal judge rejected OpenAI’s bid to limit discovery, directing the company to produce de-identified user logs central to the case.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55377315,
    "published": 1764909822000,
    "title": "Precious Metals Soar, Bitcoin Stalls as Investors Hedge Fed 'Policy Error'",
    "body": "Markets are hedging a Fed misstep, driving gold and silver higher while Bitcoin lags as traders reassess risk.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55377250,
    "published": 1764909781000,
    "title": "Ex-Signature Bank execs launch blockchain-powered bank N3XT",
    "body": "Signature Bank founder ​​Scott Shay has created N3XT, a bank aiming to provide instant 24-hour payments on a private blockchain.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 55377937,
    "published": 1764910853000,
    "title": "XRP ETFs Record 13-Day Streak As SOL Funds See Largest Outflows Since Launch",
    "body": "As institutional demand intensifies and the crypto market recovers, US spot XRP Exchange-Traded Funds (ETFs) continue to lead the sector with a 13-day streak and over $200 million in positive net flows this week, outshining Solana (SOL) ETFs, which recorded their third day of outflows in seven days. Related Reading: Bitcoin (BTC) Price In A ‘Vulnerable Technical Environment’ – Key Levels To Watch XRP Funds Lead Crypto ETF Inflows Spot XRP exchange-traded funds have extended their record-breaking streak after registering their thirteenth consecutive day of positive net flows, with $50.27 million in inflows on December 3. The investment products have seen a remarkable performance since the launch of Canary Capital’s XRPC, the first single-token XRP spot ETF, on November 13, positioning the funds as the fastest-growing altcoin-based category. Notably, XRPC surpassed all initial expectations and debuted on Nasdaq with a total volume of $58 million, recording around $357.54 million in positive net flows in 13 days. Last week, the second group of XRP funds went live, becoming the largest US ETF launches of 2025 with over $60 million in net inflows each during their first day. Moreover, the category, led by Grayscale’s GXRP and Franklin Templeton’s XRPZ, surpassed other major ETFs in single-day inflows, including those based on the largest cryptocurrencies by market capitalization, Solana, Bitcoin (BTC), and Ether (ETH). Amid this week’s market recovery, XRP ETFs saw $89.65 million on Monday, $67.7 million the following day, and an additional $50.27 million on Wednesday, for a cumulative net inflow of $207.66 million during the first three days of December. As a result, the leading category surpassed both Bitcoin ETFs’ $52.4 million and Ethereum ETFs’ $51.3 million positive net flows, respectively, during the same three-day period. With a total of $874.28 million in inflows in 13 days, spot XRP ETFs have surpassed the $618.62 million total inflows of SOL ETFs, which held the record among the second wave of altcoin-based investment products. Solana ETFs Demand Loses Steam While XRP ETFs take the spotlight, Solana funds’ momentum has slowed, seeing their largest days of outflows this week. According to SoSovalue data, the investment products recorded $32.9 million in outflows on December 3, marking their third negative net flows day since the category debuted on October 28. Despite pulling out positive net flows, Bitwise’s BSOL, Fidelity’s FSOL, and Grayscale’s GSOL were unable to absorb 21Shares’ TSOL $41.8 million in outflows. This performance also marks the fourth negative day for TSOL over the past week. As reported by NewsBTC, Solana ETFs experienced a record performance in November despite the market correction, with $613 million in inflows during their 22 consecutive day positive streak. Related Reading: Solana Eyes Major Resistance After $140 Reclaim, But Analyst Questions SOL’s Strength However, the remarkable streak ended a week ago when TSOL registered negative net flows for the first time, and the category was unable to absorb them, recording outflows of $8.1 million. SOL-based investment products started December with outflows worth $13.5 million, which were followed by strong inflows worth $45.77 million on Tuesday. On December 3, the funds registered $32.19 million in outflows, amounting to a negative net flow of $700,000 for the first half of the week, despite the altcoin’s recent price recovery. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|21Shares TSOL|bitcoin|BSOL|BTC ETFs|crypto ETFs Inflows|ETH ETFs|ethereum|grayscale|GXRP|SOL ETFs|Spot Solana ETF|Spot XRP ETF|xrp|XRP ETFs|xrpusdt|XRPZ",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55378225,
    "published": 1764911284000,
    "title": "Solana (SOL) Starts to Retreat From Highs as Momentum Shows Early Fatigue",
    "body": "Solana failed to stay above $144 and corrected gains. SOL price is now trading below $140 and might find bids near the $135 zone. SOL price started a downside correction below $140 against the US Dollar. The price is now trading above $135 and the 100-hourly simple moving average. There was a break below a bullish trend line with support at $144 on the hourly chart of the SOL/USD pair (data source from Kraken). The pair could extend losses if it dips below the $135 zone. Solana Price Starts Downside Correction Solana price failed to surpass $148 and started a downside correction, beating Bitcoin and Ethereum . SOL dipped below $145 and $144 to enter a short-term bearish zone. There was a move below the 23.6% Fib retracement level of the upward wave from the $123 swing low to the $147 high. Besides, there was a break below a bullish trend line with support at $144 on the hourly chart of the SOL/USD pair. Solana is now trading above $135 and the 100-hourly simple moving average. On the upside, the price is facing resistance near the $142 level. The next major resistance is near the $145 level. The main resistance could be $148. A successful close above the $148 resistance zone could set the pace for another steady increase. The next key resistance is $155. Any more gains might send the price toward the $165 level. More Losses In SOL? If SOL fails to rise above the $145 resistance, it could start another decline. Initial support on the downside is near the $135 zone and the 50% Fib retracement level of the upward wave from the $123 swing low to the $147 high. The first major support is near the $132 level. A break below the $132 level might send the price toward the $128 support zone. If there is a close below the $128 support, the price could decline toward the $122 support in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is gaining pace in the bearish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is below the 50 level. Major Support Levels – $135 and $132. Major Resistance Levels – $142 and $148.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Technical analysis|Sol|Solana|solbtc|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55378220,
    "published": 1764910032000,
    "title": "DOGE ETF Buzz Meets Bearish Reality as Dogecoin Prints Fresh Lower Lows",
    "body": "Technical analysis shows DOGE failed to hold key support levels, suggesting continued downside unless buyers reclaim critical price points.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Dogecoin|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55380201,
    "published": 1764914453000,
    "title": "Bitcoin Market Structure Echoes 2022 Bear Start, Glassnode Warns",
    "body": "On-chain analytics firm Glassnode has pointed out how the current Bitcoin market is reminiscent to the structure from the first quarter of 2022. Bitcoin Dynamics Are Currently Looking Similar To Early 2022 Bear Market In its latest weekly report, Glassnode has discussed about how the broader Bitcoin market structure is starting to resemble Q1 2022. First, the analytics firm has shared the data of its Supply Quantiles Cost Basis Model, highlighting price levels that correspond to a certain degree of investor profitability. In the chart, three supply quantiles are listed: 0.75, 0.85, and 0.95. If Bitcoin trades at the first of these levels, 75% of the supply will be in profit. Similarly, the latter two correspond to 85% and 95% profitability, respectively. Related Reading: Ethereum Back At $3,200 As Sharks Show Strong Accumulation It’s visible in the graph that Bitcoin has recently fallen below all three of these levels, indicating more than 25% of the cryptocurrency’s supply is now underwater. “This creates a fragile balance between the risk of top-buyer capitulation and the potential for seller exhaustion to form a bottom,” explained Glassnode. BTC similarly broke below the 0.75 quantile back during the sideways market of early 2022. Another indicator that reinforces the resemblance is the Total Supply in Loss, which measures, as its name suggests, the amount of the Bitcoin circulating supply that’s being held at some net unrealized loss. Below is a chart showing the 7-day moving average (MA) trend in the metric. As displayed in the graph, the 7-day MA Bitcoin Total Supply in Loss hit a high of 7.1 million BTC last week, which is the highest that it has been since September 2023, more than two years ago. The analytics firm noted: The current scale of supply in loss, ranging between 5M–7M BTC, is strikingly similar to the early-2022 sideways market, further reinforcing the resemblance noted above. Finally, the Bitcoin long-term holder Spent Output Profit Ratio (SOPR) also implies that the current market structure is mirroring Q1 2022. This metric tells us, in short, whether the Bitcoin investors holding since more than 155 days ago are selling their coins at a profit or loss. The Bitcoin long-term holder SOPR has witnessed a sharp decline recently, but its value is still above 1, indicating the long-term holders are selling at some net profit. With its current value of 1.43, however, there has been a notable shrinkage in the profit margins of the cohort. Related Reading: Next Key XRP Level Could Be $1.2 If Current Support Fails, Says Analyst It now remains to be seen whether the trends in these indicators mean that the cryptocurrency is on the cusp of a bear market transition like in early 2022, or if a rebound will come before long. BTC Price Bitcoin has seen a slight pullback during the past day as its price has dropped to $91,800. Featured image from Dall-E, Glassnode.com, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin bear|bitcoin bear market|Bitcoin Realized Loss|btc|BTCUSDT|glassnode",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55382059,
    "published": 1764917424000,
    "title": "Italy Launches 'In-Depth' Review of Crypto Risks",
    "body": "Regulators launch probe months after Italy's central bank warned that crypto's mainstream integration poses systemic financial dangers.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55383208,
    "published": 1764919521000,
    "title": "Kraken Launches High-Touch VIP Program for Ultra High Net Worth Clients",
    "body": "Kraken VIP members are paired with a specialist relationship manager, backed by 24/7 support and early insight into Kraken’s full product ecosystem.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|CoinDesk Wealth|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55384282,
    "published": 1764921606000,
    "title": "Why Bitcoin Traders Fear A Repeat Of July 2024’s Crash Next Week",
    "body": "Bitcoin is again trading under the shadow of a potential yen carry-trade shock as markets head into the 9–10 December FOMC meeting and a likely hawkish turn from the Bank of Japan at the December 18-19 meeting. The setup echoes last summer’s episode, when a policy shift in Tokyo triggered rapid deleveraging across risk assets, including crypto. Will The Bitcoin Price Crash Next Week? Analyst Benjamin Cowen explicitly links today’s environment to that July shock. He reminded followers that “in July 2024, the Fed cut rates while the BOJ raised rates, leading to the unwind of the carry trade. Bitcoin capitulated into it, and found a low 1 week later.” He added, “Good chance this happens again on December 10th (Fed cuts, BOJ raises rates). So maybe Bitcoin finds a low mid-Dec?” The precise sequencing last year was more nuanced – markets aggressively priced Fed easing while the BoJ surprised with a hike – but the core mechanism Cowen highlights is the same: when US policy is moving toward looser conditions just as Japan tightens, the long-running yen carry trade becomes unstable and high-beta assets sell off hard. Related Reading: Bitcoin Signals Bear Market: One Thing Could Flip It, Says CryptoQuant CEO Truflation’s thread lays out why this matters for Bitcoin and the wider crypto market. Large institutions and commercial banks “borrow money in Yen where interest rates are historically and famously low, and use that money to invest in the US.” They can park the funds in interest-bearing instruments to “earn healthy 3–4%” on the spread, or “more often, they invest in stocks and bonds to get way more.” This is reinforced by a BoJ policy of keeping the yen cheap against the dollar. The danger arises when stocks fall and the yen starts to rise or is expected to rise. Then “institutional and Commercial borrowers may exit, so as not to get stuck with significant losses on their Yen debts.” They “sell whatever assets they purchased in the US and get back into Yen to pay back their loans in Japan, resulting in a cascade of US asset sales and Yen purchases.” After “years of Yen carry trade being a relatively safe way for big banks and institutional investors to make easy money,” even a modest normalization can force broad, mechanical de-risking — and Bitcoin, as a liquid, leveraged risk asset, sits directly in that firing line. Crypto trader Kevin (@Kev_Capital_TA) underscores how tight the current window is. He notes that “we have the Fed’s preferred measure to track inflation via the Core PCE inflation and then the FOMC all in the next six days,” followed by a BoJ press conference on 19 December that will be “massive for Dollar, short end and long end of the yield curve not to mention Yen carry trade fears.” In a separate post, he stresses that “the JP10Y continues to make new highs. Pretty big deal folks,” highlighting that Japanese yields are grinding higher into that meeting and increasing pressure on the BoJ to act. Related Reading: US Sen. Lummis Hints At US Bitcoin Buy With ‘Franklin’ Meme A few days ago, BitMEX founder Arthur Hayes connected that macro repricing directly to Bitcoin’s latest leg down. “BTC dumped cause BOJ put Dec rate hike in play. USDJPY 155–160 makes BOJ hawkish,” he argues, framing the sell-off as a funding shock rather than a crypto-native event. Into December, futures and economist surveys put the probability of a Fed cut at roughly 80–87% for the 9–10 December meeting, even as the committee remains divided. At the same time, the BoJ is openly signalling it will “consider the pros and cons” of a hike at its 18–19 December meeting, with markets now pricing a high likelihood of tightening and 10-year JGB yields near multi-decade highs. That combination — Fed easing expectations plus BoJ tightening risk — is exactly the configuration that threatens the yen carry and makes a repeat of July 2024’s pattern plausible: a sharp flush in Bitcoin and other risk assets, followed by a bottom once forced deleveraging runs its course. At press time, BTC traded at $92,235. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55384964,
    "published": 1764922300000,
    "title": "BlackRock Bitcoin ETF Sheds $2.7 Billion in Record Outflows Run",
    "body": "BlackRock Inc.’s iShares Bitcoin Trust recorded its longest streak of weekly withdrawals since debuting in January 2024, in a sign that institutional appetite for the world’s largest cryptocurrency remains subdued even as prices stabilize.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NYS:BLK",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55386285,
    "published": 1764925240000,
    "title": "A New Era Begins: CFTC Approves Spot Bitcoin On Regulated US Markets",
    "body": "Regulators in Washington on Thursday cleared a major step that lets Americans trade spot Bitcoin and other cryptocurrencies on federally registered exchanges for the first time. Related Reading: Bitcoin Crash Fails To Shake Ripple CEO — He Still Calls For $180K According to the Commodity Futures Trading Commission, listed spot crypto products may now be offered on exchanges registered with the agency, a move announced on December 4, 2025. Regulated Spot Trading Begins The action comes from a CFTC press release labeled Release No. 9145-25 and that the change allows spot crypto contracts to be listed on futures exchanges that are registered with the CFTC. The regulator said its rules now permit such listings to trade under the oversight and surveillance standards those exchanges already follow. .@CFTCpham Announces First-Ever Listed Spot Crypto Trading on U.S. Regulated Exchanges: https://t.co/89Mx6f0ss4 — CFTC (@CFTC) December 4, 2025 Bitnomial Leads The Way Bitnomial, a Chicago-based derivatives exchange, is set to be the first exchange to list such products, with plans to offer both leveraged and non-leveraged spot trading on its platform. Market notices and statements show Bitnomial moved quickly to use the new framework, announcing a launch and filings that position it as the first US venue to trade listed spot crypto under CFTC rules. What This Means For Investors According to market commentators and reporting, the shift brings spot trades under long-standing market protections like clearing, surveillance and execution rules that apply to other listed products. That can make some institutional players and big funds more willing to trade onshore. At the same time, regulators say this is meant to pull activity away from unregulated offshore venues and improve market oversight. Acting Chairman Caroline Pham said the move is meant to strengthen the US position in the crypto market while giving traders access to safer and more transparent trading venues. Risks Remain Reports have disclosed that the change does not remove the underlying risks of crypto: prices can swing widely, and no regulatory move can stop market volatility. Also, only exchanges that seek and obtain the proper CFTC registration will be able to use this route, so most offshore platforms remain outside US oversight for now. Related Reading: Eric Trump Says Bitcoin Could Hit $500,000, Stands By ABTC Strategy Next Steps Observers will be watching whether other US exchanges follow Bitnomial, how many retail investors gain access, and how the SEC responds on parallel issues such as token classification and custody rules. The CFTC had flagged this pathway in August as part of a broader initiative to allow listed spot crypto trading, and agencies have since coordinated on guidance and public engagement. The CFTC’s Acting Chairman said this brings spot crypto trading into a regulated setting Americans can trust, and that exchanges with the right protections can now list these products. This development is part of a months-long policy push by the administration to create clearer rules for digital assets. Featured image from Barron’s, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|cftc|crypto|digital currency|US regulation",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55388245,
    "published": 1764928852000,
    "title": "Dogecoin Bulls Smell $1.30 As On-Chain Data Turns Red-Hot",
    "body": "Dogecoin is hovering near $0.15, but a cluster of technical and on-chain indicators shared on X suggests the market structure is far healthier than during the last bear phase, prompting fresh upside calls from analysts. Dogecoin Could Target $1.30 Trader Cryptollica posted a long-term monthly DOGE chart with the Mayer Multiple and a clear message: “DOGE Target > $1.30.” The Mayer Multiple, using 200- and 50-period moving averages with a 2.4 threshold, sits at 0.66005. Visually, that is far below the spikes above 5 that accompanied the 2017 and 2021 blow-off tops, indicating that Dogecoin is not yet in the overheated conditions historically associated with major market peaks. Cryptollica also highlighted an Alphractal chart titled “Dogecoin: Number of Days Spent at a Loss.” The series overlays DOGE’s price with a multicolour histogram of how long coins have been held in unrealised loss. Related Reading: Dogecoin Price Can Stage A 96% Rally If It Breaks This Falling Wedge Pattern Earlier cycle lows around 2014–2015 and the post-2021 unwind show extended peaks above roughly 1,200–1,500 days at a loss. In the latest segment, that metric has compressed back toward the lower end of the scale, resembling the early reset phases that preceded previous advances, and signalling that the proportion of long-suffering holders has markedly declined. DOGE On-Chain Data Looks Strong On the shorter-term on-chain side, Ali Martinez (@ali_charts) pointed to a sharp rebound in network activity. “Dogecoin just saw 71,589 active addresses. The biggest spike since September,” he wrote, sharing Glassnode data. The chart “DOGE: Number of Active Addresses” plots daily active addresses as yellow bars against the DOGE price in black. From early November, activity ranged around 45,000–47,500 addresses while price drifted lower from about $0.17 to $0.14. On December 3, active addresses jumped to 71,589 as price recovered to $0.15181709, signalling a broadening of participation rather than a purely price-driven move. Ali also drew attention to whale behaviour. Posting a Santiment chart of balances held by addresses with between 1,000,000 and 100,000,000 DOGE, he noted: “480 million Dogecoin bought by whales in 48 hours!” Related Reading: Is The Dogecoin Bottom In? This Price Level Could Be The Tell The grey area representing holdings in this band trends down from around 35.6 billion DOGE in mid-October to below 28 billion by late November while price falls from above $0.18 to about $0.135, indicating sustained distribution. In the final days of the chart, holdings rose again to roughly 28.45 billion as price rebounded from $0.14 to $0.15, confirming a renewed net accumulation phase among large holders. A third chart from Ali, “DOGE: Cost Basis Distribution Heatmap,” defines the next major technical hurdle. “$0.20 is the key resistance for Dogecoin. That’s where 11.72 billion $DOGE were accumulated,” he wrote. The Glassnode heatmap highlights a dense band between $0.20284609 and $0.20442947, with an annotated supply of 11,723,527,138.97 DOGE whose on-chain cost basis lies in that range. This cluster marks a heavy realised-price node where a large volume of coins moves from loss to breakeven as spot revisits $0.20, creating a clearly defined resistance zone. In combination, subdued valuation on the Mayer Multiple, a reset in “days at a loss,” the largest active-address spike since September, recent whale accumulation of 480 million DOGE and a well-defined $0.20 cost-basis wall form a favourable on-chain basis. Whether those higher levels are reached will depend on the market’s ability to absorb the 11.72 billion DOGE supply stacked around $0.20 and sustain the recent improvement in on-chain activity and large-holder demand. At press time, DOGE traded at $0.14451. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55388823,
    "published": 1764930884000,
    "title": "Polymarket Hiring In-House Team to Trade Against Customers — Here's Why It's a Risk",
    "body": "The prediction market’s move toward internal market making could blur the line with sportsbooks and undermine the platform’s neutrality, experts warn.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Polymarket|Prediction Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55388856,
    "published": 1764930802000,
    "title": "Ether vs. Bitcoin teases 170% gains as ETH price breaks 5-month downtrend",
    "body": "Ether price action staged a repeat of its 2021 bull market moves against Bitcoin, leading to predictions of fresh long-term highs against BTC.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55389226,
    "published": 1764932403000,
    "title": "FUD Frenzy: XRP Battles Its Biggest Sentiment Drop In Months—Data",
    "body": "According to an analytics report, XRP traded near $2.06 on Friday as social chatter around the token turned sharply negative after a two-month slide of about 30%. Related Reading: A New Era Begins: CFTC Approves Spot Bitcoin On Regulated US Markets Traders and data firms flagged a sudden rise in bearish messages, a shift from the more mixed views seen earlier this year. The mood has tightened around crypto, and XRP is not immune. Crowd Mood Shifts To Fear Based on reports from Santiment, its chart tracks XRP’s price against positive and negative comments and a combined sentiment line that aims to measure crowd feeling. Recent readings pushed the balance into what Santiment calls the fear zone, where negative talk outweighs optimism. On this same model, Santiment pointed to Nov. 21 as a comparable moment. Back then, XRP rallied more than 20% over the next three days before gains cooled. That past move is being used as a reference point by traders who watch social signals closely. 😨 XRP (-31% in the past 2 months), unlike Bitcoin, is seeing the most fear, uncertainty, & doubt (FUD) since October, according to our social data. 🔴 Circles indicate days where there are abnormally higher BULLISH comments compared to BEARISH comments, about XRP (Greed Zone)… https://t.co/lJNW8zlRwK pic.twitter.com/ZoFmwrtw3h — Santiment (@santimentfeed) December 4, 2025 Short Squeezes And Reflexive Moves Extreme pessimism can become a catalyst. When weaker holders sell and shorts pile in, a quick reversal can squeeze sellers and lift price sharply. This is the scenario many are watching: heavy bearish chatter could clear the way for a reflexive rebound if buying pressure appears. Santiment urged followers to keep an eye on the same dashboard to spot rapid shifts in sentiment, and some traders say the crowd’s mood often leads price in the very short term. Price Moves And Market Backdrop XRP was last reported down about 4% at $2.04, extending a loss of roughly 6% over the past month. The total crypto market value slipped about 1% to $3.22 trillion on the same day, a pullback that has dragged on many altcoins even as liquidity stays concentrated in the largest tokens. Order books on smaller pairs have thinned and leveraged positions were trimmed, leaving less depth to absorb big moves. Traders also cited uncertainty around upcoming US policy decisions as a factor behind cautious positioning. Institutional Push And On-Ledger Activity Analysts watching the token say it still has room to run toward $2.50 to $2.75 if cross-border liquidity flows pick up and stablecoin projects on the XRP Ledger gain momentum. Reports have disclosed that Ripple has been moving to broaden its institutional reach. Buy XRP. Stop focusing on any other Crypto Coins They don’t matter — Cameron Scrubs (@imcameronscrubs) December 2, 2025 Last month, the firm launched digital asset spot prime brokerage services in the US after acquiring Hidden Road and folding it into Ripple Prime, a combined trading and custody setup for professional clients. That push is being watched as a potential longer-term support for demand. Related Reading: Bitcoin Crash Fails To Shake Ripple CEO — He Still Calls For $180K Vocal Bulls And Market Signals Despite the FUD surrounding XRP, Cameron Scrubs, founder of Tradeship University, has again urged followers to “buy XRP,” stating that other crypto assets “don’t matter.” In previous posts, he also called to “sell everything and buy XRP.” Traders are watching these statements closely as sentiment shifts, while on-chain data and social signals are being monitored for indications that the current negative chatter may be starting to ease. Featured image from Gemini, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|altcoins|bitcoin|crypto|FUD|xrp|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55389588,
    "published": 1764931983000,
    "title": "BlackRock’s IBIT Faces Record Outflow Run as Bitcoin Struggles to Reclaim Bull Trend",
    "body": "Another $113 million exited on Thursday, putting the fund on track for a sixth week in the red, its longest streak since debuting in early 2024.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55389969,
    "published": 1764935203000,
    "title": "Crypto Markets Today: Bitcoin Slides to $91K as ETF Outflows Deepen Market Anxiety",
    "body": "Bitcoin’s early week rally unraveled as sharp ETF outflows, aggressive derivatives deleveraging and muted altcoin reactions to catalysts pulled the broader crypto market lower.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55390496,
    "published": 1764937168000,
    "title": "Turkish crypto exchange Paribu buys majority stake in competitor CoinMENA",
    "body": "Paribu has bought a majority stake in Dubai- and Bahrain-licensed CoinMENA in a deal valuing the exchange at up to $240 million.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55390421,
    "published": 1764937146000,
    "title": "Bitcoin ETFs Just Shed $194 Million—Highest in Two Weeks",
    "body": "Analysts argue this could mean institutional investors are continuing to unwind leveraged positions and basis trades.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55390822,
    "published": 1764938847000,
    "title": "Ethereum Options Traders More Bullish Than Bitcoin Counterparts: Analysts",
    "body": "Options data show Ethereum traders are less bearish than Bitcoin’s after recent network upgrades and improving macro uncertainty.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55391039,
    "published": 1764939785000,
    "title": "JPMorgan Retains Gold-Linked $170K Bitcoin Target Despite Recent Plunge",
    "body": "The bank’s volatility-adjusted bitcoin-to-gold model still points to a theoretical price around $170K over the next six to twelve months.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Strategy|Bitcoin Mining|JPMorgan|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55390881,
    "published": 1764939162000,
    "title": "Circle Stock Aims for $100 on Crypto Sentiment Rebound, Traders Rotate to $SUBBD",
    "body": "What to Know: Circle’s climb toward a potential $100 valuation reflects recovering crypto sentiment, renewed USDC activity, and stronger demand for regulated on-chain liquidity exposure. As risk appetite returns, capital often rotates from infrastructure equities and large caps into earlier-stage narratives with more asymmetric upside potential. AI-powered content platforms aim to fix Web2 creator pain points: high fees, opaque moderation, fragmented tools, and limited global payment options. SUBBD Token merges Web3 payments and integrated AI tools so creators can keep more earnings, automate fan engagement, and control content inside a transparent, tokenized ecosystem. Is Circle’s stock an indicator of a market rebound? Circle’s march toward a potential $100 valuation is becoming a barometer for how quickly crypto is healing after a brutal risk-off stretch. As sentiment improves and on-chain activity picks up , equity investors are treating Circle less like a speculative bet and more like an infrastructure proxy for stable, regulated liquidity. $USDC flows tell the same story . After periods of redemptions and market anxiety, on-chain volumes and stablecoin usage have started to normalize. This signals that traders want transparent, compliant rails to move capital across exchanges and DeFi. When that kind of infrastructure trade starts working again, it usually means risk appetite is quietly returning underneath. We’re already seeing that shift at the edges. Flows are rotating from ‘safe beta’ exposure like listed crypto firms and large-cap coins into earlier-stage narratives where the upside is more asymmetric. That’s especially true in sectors where real-world demand already exists. That’s the lane SUBBD Token ($SUBBD) is trying to occupy. As a Web3 and AI-powered content platform built on Ethereum, SUBBD is pitching itself as a higher-upside play on the same structural forces driving Circle. Why On-Chain Liquidity Plays Are Back in Focus Circle’s rise as a de facto equity proxy for on-chain liquidity reflects a simple narrative: if stablecoin volumes and institutional interest keep climbing, the pipes carrying that value should benefit most. That’s why regulated infrastructure names often rally first when the market starts to believe a new crypto cycle is forming. From there, capital tends to move outward along the risk curve. After stablecoin and Layer 1 exposure comes sector plays like AI-augmented creator tools, fan platforms, and tokenized media. Competing projects in this space are racing to combine AI assistants, subscription rails, and NFT access into a single, streamlined experience for creators. The problem they’re all solving is familiar. Web2 creator platforms can charge up to 70% in fees, enforce arbitrary bans, fragment AI tools across multiple subscriptions, and limit payment options based on geography. In that field, SUBBD Token ($SUBBD) is shining as a contender, positioning AI automation and Web3 payments as the upgrade path for creators who want more control and better economics. Already sold? We’ve got you covered in our ‘ How to Buy SUBBD Token ’ guide. How SUBBD Token Turns AI and Web3 Into Creator Infrastructure Where SUBBD Token leans in hardest is its promise to merge Web3 rails with integrated AI in one stack. Instead of creators juggling multiple apps and tools, SUBBD’s Ethereum-based ecosystem aims to bundle AI personal assistants, voice cloning, token-gated content, and NFT sales under a single token-powered model. The platform’s AI personal assistant is designed to automate interactions with fans, handle routine questions, and scale engagement without burning out the creator. On top of that, AI voice cloning and full AI influencer creation give studios and solo creators new revenue lines that are native to digital-first audiences, while token-gated access and NFTs turn exclusivity into programmable assets. Economics are central to the pitch. SUBBD targets platforms that currently take up to 70% in fees, offering crypto-native payments, global access, and on-chain governance instead. The presale has already raised over $1.3M and tokens are priced at $0.0571. See what our experts’ price prediction is for SUBBD Token . Staking rewards of 20% APY are on offer for early adopters of $SUBBD. But that’s not the only benefit for $SUBBD holders. You also get access to exclusive content, platform multipliers, discounts, and a whole heap more. If you believe the next leg of crypto growth will be driven by real products rather than pure speculation, SUBBD is framing itself as an infrastructure bet on tokenized content, AI-driven engagement, and user-owned economics. If you’re rotating out along the risk curve as Circle grinds higher, it’s one of the better plays. Join the $SUBBD presale today. Remember, this isn’t intended as financial advice, and you should always do your own research before investing. Authored by Aaron Walker , NewsBTC — https://www.newsbtc.com/news/circle-stock–eyes-100-as-crypto-sentiment-rebounds-traders-choose-subbd",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 208,
        "NAME": "ADMINISTRATIVE EVENTS",
        "CATEGORY": "ADMINISTRATIVE EVENTS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55390833,
    "published": 1764938716000,
    "title": "Solana WET presale hijacked by Sybil wallets as HumidiFi resets launch",
    "body": "Bubblemaps CEO Nick Vaiman said Sybil attacks are increasing across presales and airdrops, calling on teams to use KYC or algorithmic detection.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55391199,
    "published": 1764940359000,
    "title": "Stablecoins Threaten Central Banks, Warns IMF as Hard-Money Narrative Fuels Bitcoin Hyper",
    "body": "What to Know: IMF concerns about dollar stablecoins eroding local currencies reinforce the appeal of scarce, non-sovereign assets like Bitcoin in a fragmented monetary system. Bitcoin’s base layer remains constrained by slow confirmations, fee volatility, and minimal smart contract support, creating renewed interest in specialized Layer 2 infrastructure. Competing Bitcoin scaling projects, from Lightning to sidechains, are racing to capture BTC liquidity as programmable capital for payments and DeFi. Bitcoin Hyper uses an SVM-based Layer 2 anchored to Bitcoin to deliver extremely low-latency smart contracts, targeting DeFi, gaming, and high-speed BTC payments. Stablecoins are a threat. At least that’s according to the International Monetary Fund (IMF). In a recent report , the IMF shared concerns that dollar-backed stablecoins might hollow out weaker local currencies and dilute central banks’ control over domestic liquidity. If a digital dollar reaches everyone’s smartphone, what happens to the Peruvian sol, Nigerian naira, or Turkish lira? The report also discussed the positives of stablecoins like cheaper and quicker payments, and a simpler UX, so it wasn’t all doom and gloom. However, the warning does not just read as a technocratic worry. It reinforces a deeper macro story that crypto has been circling for a decade: demand for scarce, non-sovereign assets that cannot be printed at will, especially Bitcoin. In a world of increasingly digital dollars, Bitcoin’s hard cap can look less like a curiosity and more like a hedge. That backdrop is why attention keeps shifting from ‘number goes up’ to ‘what actually gets built on top of Bitcoin.’ If you believe Bitcoin will matter more as a neutral reserve asset, then the highest-beta plays sit in the infrastructure that makes $BTC programmable, spendable, and usable in DeFi at scale. In that lane, Bitcoin Hyper ($HYPER) is trying to position itself as a key liquidity rail. It pitches itself as the first Bitcoin Layer 2 using the Solana Virtual Machine (SVM), aiming to merge Bitcoin’s hard-money appeal with Solana-style throughput and developer tooling. Why Bitcoin Layer 2 Infrastructure Is Back In Focus When a body like the IMF flags dollar stablecoins as a systemic risk for smaller economies, it implicitly admits that monetary power is splitting. You are not just choosing between local cash and a bank account anymore; you are choosing between local fiat, dollar tokens, and non-sovereign assets like Bitcoin at the tap of an app. That split has pushed capital toward Bitcoin itself, but it has also exposed how limited the base layer is for real-world usage. On-chain Bitcoin still moves with minutes-long confirmation times, variable fees, a slow 7 TPS rate , and almost no native smart contract support. Competing Bitcoin scaling efforts have rushed to fill that gap. Lightning Network pursues off-chain payment channels for instant $BTC transfers, while projects like Stacks and Rootstock lean on sidechains and alternative virtual machines to bring DeFi into the Bitcoin orbit. In that growing field, Bitcoin Hyper ($HYPER) is standing out to turn dormant $BTC liquidity into programmable capital using Solana Virtual Machine (SVM) tech and a canonical bridge. See how to buy into the action with our ‘ How to Buy Bitcoin Hyper ’ guide. How Bitcoin Hyper Tries To Turn $BTC Into High-Speed Capital For years, the crypto trilemma suggested you couldn’t have speed, security, and decentralization in one place. Bitcoin Hyper ($HYPER) challenges that by changing the geometry of the network. Instead of forcing Bitcoin to be fast, Bitcoin Hyper accepts Bitcoin as the heavy, secure anchor (Settlement Layer). It then attaches a Ferrari engine on top: a modular SVM Layer 2 (Execution Layer). What does this unlock? Rust-based Smart Contracts: Developers can build complex dApps (Gaming, NFT, DEXs) identical to Solana’s ecosystem. Latency: Sub-second finality that beats Solana’s own benchmarks. Security: State is periodically anchored back to $BTC, preserving the ‘hard money’ thesis. The market is voting with its wallet. The presale has breached $29M, with whales accumulating and making purchases as large as $500K . With a price point of $0.013375 and high-APY staking currently at 40%, Bitcoin Hyper is positioning itself as the execution layer for the next bull run. Our experts predict $HYPER possibly reaching $0.08625 by the end of 2026. If you invested today, that means a potential ROI of over 544%. Don’t miss the upgrade. Buy your $HYPER today. Remember, this isn’t intended as financial advice, and you should always do your own research before investing. Authored by Aaron Walker , NewsBTC — https://www.newsbtc.com/news/imf-warns-stablecoins-threaten-banks-boosting-bitcoin-hyper-layer-2",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55391373,
    "published": 1764940862000,
    "title": "India's DRI Says Smugglers Ditching Hawala Networks for Stablecoins",
    "body": "In a new report, the anti-smuggling agency warns stablecoins like USDT are replacing hawala networks in transnational criminal operations.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||monero|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 57,
        "NAME": "XMR",
        "CATEGORY": "XMR"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55391836,
    "published": 1764942363000,
    "title": "Morning Minute: The CFTC Just Approved U.S. Spot Crypto Trading",
    "body": "Spot crypto trading is now cleared to go live with any CFTC-registered exchange, bringing down another barrier to institutional adoption.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Opinion",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55391765,
    "published": 1764942091000,
    "title": "Surprise Fed Warning Reignites Bitcoin Price Crash Fears",
    "body": "Shark Tank star investor Kevin O’Leary has warned he doesn’t expected the Federal Reserve to cut interest rates next month...",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55391771,
    "published": 1764941913000,
    "title": "Buy every dip? How pro hodlers blend surgical DCA with rules-based crypto buys",
    "body": "Pros don’t “ape the dip” on gut feel; they predefine their allocation, let rules-based systems do the buying, and use DCA-style flows as part of a disciplined, data-driven execution plan.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55391926,
    "published": 1764942467000,
    "title": "Bitcoin accumulation trends strengthen as realized losses near $5.8B",
    "body": "Bitcoin whales are accumulating at a record pace amid almost $5.8 billion in capitulation losses, signaling a potential bullish reversal.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55392297,
    "published": 1764943841000,
    "title": "Bitcoin Is Breaking From Stock Rally for First Time in a Decade",
    "body": "The S&P 500 has climbed more than 16% in 2025, while Bitcoin is down 3% — the first time since 2014 that stocks have rallied while the token is down, according to data compiled by Bloomberg.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55392116,
    "published": 1764943210000,
    "title": "From DOGE to Bitcoin: How fiat accidentally ‘orange-pilled’ Elon Musk",
    "body": "Elon Musk’s viral comments on Bitcoin’s intrinsic ties to energy and physics signal a changing attitude toward Bitcoin from Tesla’s founder.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55392387,
    "published": 1764944050000,
    "title": "XRP ETFs near $1 Billion, Sovereign wealth funds buying Bitcoin, CFTC approves U.S spot crypto trading - Daily Crypto Recap",
    "body": "",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55392604,
    "published": 1764945538000,
    "title": "Russian Banking Giant VTB to Become Country's First to Offer Spot Crypto Trading: Report",
    "body": "In 2026, VTB plans to be the first Russian bank to allow clients access to spot crypto trading services.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Russia|Spot Trading|banks|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55392839,
    "published": 1764945004000,
    "title": "Do Kwon Should Get 12 Years for ‘Colossal’ Crypto Fraud, US Says",
    "body": "Terraform Labs Pte. co-founder Do Kwon should be sentenced to 12 years in prison for the fraud that led to the TerraUSD stablecoin’s $40 billion collapse in 2022, US prosecutors said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 34,
        "NAME": "LUNA",
        "CATEGORY": "LUNA"
      }
    ]
  },
  {
    "id": 55393140,
    "published": 1764947432000,
    "title": "Crypto Sector Lit Up Bright Red as Bitcoin Slips Back to $90K",
    "body": "Softer than expected private inflation data did spark some hope that the Friday decline could reverse.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Market Wrap|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55393460,
    "published": 1764948617000,
    "title": "Has the DAT Bubble Already Burst? CoinShares Says In Many Ways, Yes.",
    "body": "Digital-asset treasury plays that once traded at big premiums have fallen back toward net asset value.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Digital Asset Treasury|CoinShares|Strategy|Analysts|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 55393320,
    "published": 1764948164000,
    "title": "European Crypto Scam Network Dismantled After Laundering $815M",
    "body": "Authorities across Europe took down a massive crypto fraud and laundering network tied to fake investment platforms, deepfake ads and call-center operations.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Europe|Europol|Fraud|Crime|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55393318,
    "published": 1764948030000,
    "title": "Strategy Stock Still a Buy at Cantor After Plunge Forces Major Price Target Cut",
    "body": "Lower adjusted net asset value multiple means Strategy can no longer issue equity at a premium, threatening its long-term plan to accumulate more bitcoin, analyst Brett Knoblauch wrote.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Strategy|Mizuho Bank|Analysts|Cantor fitzgerald|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55393665,
    "published": 1764949405000,
    "title": "US prosecutors request 12 years in prison for Terraform’s Do Kwon",
    "body": "A sentencing recommendation said that Do Kwon had caused more losses than Sam Bankman-Fried, Alex Mashinsky and Karl Sebastian Greenwood combined.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55393563,
    "published": 1764949104000,
    "title": "MARA Trades at a Premium Factoring in Its Debt, Not a Discount: VanEck’s Sigel",
    "body": "VanEck’s Matthew Sigel argues MARA’s valuation looks expensive when adjusted for its leverage and capital structure.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Marathon|Bitcoin News|MicroStrategy|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55393780,
    "published": 1764949865000,
    "title": "Turkey's Paribu Buys CoinMENA in $240M Deal, Expanding Into High-Growth Crypto Markets",
    "body": "With the acquisition, Paribu gains regulatory foothold in Bahrain and Dubai and access to the region's fast-growing crypto user base.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Paribu|Turkey|Acquisitions|Crypto Exchanges|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55393977,
    "published": 1764950610000,
    "title": "Maryland Man Sentenced for Helping North Korea Infiltrate U.S. Tech Firms",
    "body": "The scheme enabled overseas DPRK operatives to access sensitive government systems through fraudulent IT jobs.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      }
    ]
  },
  {
    "id": 55394328,
    "published": 1764952091000,
    "title": "Polish lawmakers fail to revive controversial crypto bill after presidential veto",
    "body": "Poland’s parliament upheld a veto on the Crypto-Asset Market Act, delaying EU-aligned regulation and deepening divisions over security and innovation.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55394386,
    "published": 1764952390000,
    "title": "Trump DOJ Wants Terra Founder Do Kwon Behind Bars for 12 Years, Citing SBF Sentence",
    "body": "Federal prosecutors reserved the right to pursue up to 12 years for Terra founder Do Kwon in an August plea deal. Now, they’re seeking that maximum.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "terra-luna-2|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55394706,
    "published": 1764953906000,
    "title": "US Prosecutors Seek 12-Year Sentence for Terraform Founder Do Kwon in Crypto Fraud Case",
    "body": "The collapse of Do Kwon's Terraform project caused losses that surpassed those by Sam Bankman-Fried's FTX, Celsius and OneCoin combined, the prosecutors argued.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Do Kwon|Terraform|Terra luna|Southern district of new york|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55395828,
    "published": 1764956815000,
    "title": "New IMF Report Warns of Stablecoin Risk, Sparking Criticism From Experts",
    "body": "The IMF released a report that campaigns in favor of CBDCs and warns against the risk stablecoins represent, sparking criticism among crypto experts.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|IMF|central banks|Stablecoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55396154,
    "published": 1764957627000,
    "title": "Trend Reversal Puts Dogecoin On A Path To $0.188",
    "body": "Dogecoin has quietly been trying to find its footing again. The price has started to firm up after a period of declines that dragged the meme coin to as low as $0.134 in early December, trading around $0.14 to $0.15 and showing signs that bearish pressure might be easing. In that backdrop, a recent chart analysis shared by crypto analyst BitGuru on X shows that Dogecoin could be forming a bullish base, and it offers a possible setup for a rebound towards $0.2. A Recovery Attempt Begins To Take Shape The daily candlestick price chart shows Dogecoin rebounding from the lower boundary of its demand zone after briefly dipping beneath it on December 1. That bounce is significant because it represents the willingness to defend the area that held price earlier in July and again during the October pullback. This playout means that Dogecoin has now created a higher low relative to the November breakdown, and this detail means that bullish movement might be moving in. Related Reading: The MicroStrategy Of Asia: Japanese Company Announces Plan For Bitcoin And XRP Treasury As it stands, Dogecoin’s price is now pushing back toward the middle of the broader range highlighted in green and teal on the chart below. Recent bullish candle closes on the daily timeframe show that the Dogecoin price is trying to push into that region once again, suggesting that buyers have begun testing the strength of mid-range resistance. The chart reflects this pattern by displaying earlier price expansions in July and September, both of which unfolded after the Dogecoin price created a higher low. Dogecoin Price Chart. Source: @bitgu_ru On X Dogecoin On A Path To $0.188 Dogecoin’s higher-low structure is the signal BitGuru highlights as the earliest sign that momentum may be shifting. Now that the price is now climbing away from the demand zone, the first area to watch is the dotted mid-range line on the chart, which is at $0.188. A clean move above that level would mean that buyers have regained control of the market structure. This could open the door for a broader recovery and see Dogecoin returning above $0.20. Related Reading: XRP Price Is Performing As Expected; Analyst Reveals What Comes Next At its current price of $0.148, the targets at $0.188 and $0.20 represent gains of roughly 27% and 35%. These levels fall within a range of short-term price targets that Dogecoin could realistically reach before the end of the year if there’s even a little bullish momentum. However, Dogecoin’s near-term outlook isn’t just about its own chart. Its fate is linked to the broader crypto market, especially Bitcoin. Therefore, Dogecoin’s price action might remain vulnerable to more declines and consolidations unless the wider crypto market turns bullish again. On the other hand, tentative signs of recovery, including rising trading volume, point to a bullish setup for Dogecoin. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55396077,
    "published": 1764957370000,
    "title": "Bitcoin, Ethereum and XRP Dive as Liquidations Hit $500 Million—While Stocks Rise",
    "body": "Bitcoin is back below the $90,000 mark as Ethereum flirts with another dip below $3,000—all while major stock indices stay green.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55397701,
    "published": 1764961254000,
    "title": "The $13.5 Billion Liquidity Injection That Could Send Bitcoin And Crypto Prices Flying",
    "body": "Bitcoin has been struggling to build momentum in recent weeks, and the return of cash into the system is raising questions about whether this could be the moment that changes the tone of the crypto market. That growing sense of anticipation has already started to show up in prices, with the total crypto market cap climbing more than $250 billion from its $3.016 trillion low on December 2. What Happened: The Liquidity Injection And Why It Matters After officially bringing its multi-year quantitative tightening (QT) program to an end, the central bank followed up with a $13.5 billion overnight repo operation, funneled through the New York Fed. Banks brought $13.5 billion in Treasuries to the Fed, the Fed accepted all of it, and instantly injected $13.5 billion of fresh reserves into the system. Related Reading: A Bitcoin Parabolic Rally Is Coming: Eric Trump Shares Why First Family Is Pro-Crypto The move, which is the second-largest liquidity injection since the COVID-19 crisis, effectively puts an end the steady shrinkage of bank reserves that has persisted for years, easing pressure on short-term funding markets and signaling a more accommodative liquidity environment. The crypto market responded almost instantly. A handful of major assets began turning green within hours of the injection, with Bitcoin leading the charge with an instant break above $92,000. The influx was visible at a macro level as well: the total crypto market cap climbed from a December 2 low of $3.016 trillion to $3.269 trillion by December 4. A gain of more than $250 billion in under 48 hours What Investors Should Watch Next Ending QT leads to better liquidity and often create a bullish environment for equities and other riskier investments like cryptocurrencies. However, although a single liquidity event does not guarantee a sustained multi-month rally, this injection stands out not just for its size but for what it represents. Related Reading: 4 Bitcoin Indicators That Led To Market Rallies In The Last 2 Years Have Returned In a CNBC interview, Fundstrat’s Tom Lee stated that the Fed’s decision to stop QT will be a turning point for the cryptocurrency market. Lee pointed out that the last time the Fed ended QT, the market rose about 17% within three weeks. The previous time the Fed brought quantitative tightening to a stop was in July 2019, roughly a year after it began reducing its balance sheet. In the three weeks that followed, the S&P 500 climbed about 5%. Bitcoin’s also initially rallied in the same period, but its strongest reaction came months after, towards late 2019 and early 2020. Featured image from Pngtree, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|cnbc|COVID-19|Fundstrat|QT|quantitative tightening|Tom Lee",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55397731,
    "published": 1764960402000,
    "title": "Bitcoin Options Show Traders Hunkering Down for Crypto Winter",
    "body": "Bitcoin options are showing that traders are betting that the largest cryptocurrency will remain mired in its current trading range in the wake of the fourth-quarter downturn that has cut more than $1 trillion in value from the digital asset market.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55399523,
    "published": 1764965385000,
    "title": "Bitcoin ‘risk off’ signals fire despite traders’ view that sub-$100K BTC is a discount",
    "body": "Bitcoin’s bounce evaporated as the weekly close approaches and traders say multiple risk-off metrics point to a high correction risk for BTC. Is $100,000 by the end of 2025 possible?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]