[
  {
    "id": 56538413,
    "published": 1767000476000,
    "title": "Trend Research lifts ETH holdings to $1.8B with $35M buy, is ‘bullish’ on 2026",
    "body": "Trend Research founder Jack Yi pledged to continue buying Ether, citing a conviction for more financial and regulatory tailwinds driving crypto valuations in 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56540902,
    "published": 1767004525000,
    "title": "Bitcoin reverses early gains, drops below $88,000 as Nasdaq futures wilt",
    "body": "Bitcoin reversed Asian session gains, dropping below $88,000 and affecting major altcoins.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Ethereum News|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56541908,
    "published": 1767005980000,
    "title": "South Korean financial group Mirae Asset eyes crypto exchange Korbit acquisition: report",
    "body": "The financial group is in talks to acquire a 92% stake in Korbit for a as much as 140 billion won ($97 million).",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|South Korea|Seoul|Korbit|Acquisitions|mergers and acquisitions|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56542756,
    "published": 1767007374000,
    "title": "Real-world assets top DEXs to become 5th-largest category in DeFi by TVL",
    "body": "RWA protocols have overtaken decentralized exchanges by total value locked, as tokenized Treasurys, private credit, and commodities become core onchain building blocks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56543874,
    "published": 1767009300000,
    "title": "Crypto ETPs shed $446M over Christmas as year-end sentiment remains fragile",
    "body": "Weekly fund flows point to lingering caution, with investors favoring newer products and select regions over broad market exposure.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 56543704,
    "published": 1767009114000,
    "title": "Sberbank issues Russia's first crypto-backed loan to bitcoin miner Intelion Data",
    "body": "Sberbank used its in-house crypto custody tool to back a loan for mining firm Intelion Data, signaling broader interest in crypto lending.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Sberbank|Bitcoin News|Bitcoin Mining|Crypto|Loans|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56546196,
    "published": 1767013252000,
    "title": "Could Bitcoin Replay Silver’s Rally… Backward? CEO Issues Warning",
    "body": "Peter Schiff has warned that Bitcoin could suffer the opposite fate of silver after the metal posted a sudden, sharp rise. Based on reports, traders and analysts are debating whether the move in silver marks a broad shift back to real assets or a brief, crowded trade that may unwind quickly. Related Reading: Bitcoin Rules The Decade: Outshines Gold And Silver, Analyst Says Silver’s Rapid Climb According to trading data, silver jumped more than 10% in a single session and rose from about $78 to $79 in roughly ninety minutes. Spot silver climbed 18% last week to close at a record $79.31 on thin post-Christmas volume and its new status as a strategic metal. Reports have disclosed that this rally is being driven by a supply deficit and Washington’s decision to classify silver as a critical mineral, not by geopolitics or hopes for US rate cuts. A TradingView chart showed a near-vertical breakout, and a monthly RSI reading reached its highest level in 45 years, a sign of extreme momentum. What is happening with silver may soon be happening with Bitcoin, only in reverse. But since markets tend to melt down faster than they melt up, the time frame for the move should be condensed. — Peter Schiff (@PeterSchiff) December 27, 2025 Tokenized Commodities And Market Value Tokenized versions of metal assets have also gained ground. Based on reports, these crypto-linked commodity tokens are approaching a $4 billion overall valuation, reflecting growing investor curiosity. CompaniesMarketCap data showed silver’s market value closing the gap with NVIDIA, a comparison that highlights heavy institutional demand for metal exposure. Still, tokenized assets remain small compared with spot markets and big ETFs, which means the shift is visible but not yet broad-based. Silver Vs. Bitcoin Bitcoin traded near $87,000 with little movement over the same period, according to CoinMarketCap snapshots, and some market charts show Bitcoin losing relative ground to silver since 2017. A silver-to-Bitcoin valuation model places Bitcoin’s trend value near $394,000, a figure that prompts debate among traders about where each market could go next. The BlackRock Bitcoin ETF’s strong inflows in 2025 point to steady institutional accumulation in crypto, while other indicators suggest Bitcoin’s gains can stall without fresh catalysts. Spot Silver Surge Spot silver’s strong weekly gain has left technicians and strategists split. Some say the move reflects a true supply-demand mismatch reinforced by the US critical mineral designation, which has encouraged long-term buying. Others point to the thin volume after the holidays as a factor that magnified price moves. A closing price reversal top pattern at record highs has been flagged by chart watchers, signaling that a correction could follow after such rapid ascent. These signs, combined with extreme RSI readings, raise questions about the sustainability of the current breakout. Related Reading: Bitcoin Forecasts For 2026 Range From $65K To $250K As Sentiment Hits ‘Extreme Fear’ Technical Warning Signs Market veterans emphasize that fast rallies can reverse quickly when liquidity dries up. Peter Schiff argued that declines often accelerate under pressure, and that idea matters because crowded positions can be unwound in a short span. At the same time, long-term flows into Bitcoin-related ETFs and institutional products should not be ignored; they can support higher prices over time. What traders watch next will be trade volumes, whether silver holds above current levels, and whether Bitcoin regains momentum in the face of metal strength. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|digital currency|silver",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56545992,
    "published": 1767012621000,
    "title": "China lets banks pay interest on digital yuan wallets from January 2026",
    "body": "China’s central bank will let banks pay interest on digital yuan wallets from Jan. 1, 2026, reshaping e-CNY as deposit-like money as the US bans CBDCs.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 56546677,
    "published": 1767013944000,
    "title": "Trust Wallet hack shifts to verification amid surge in false claims",
    "body": "Trust Wallet said it has identified 2,596 compromised addresses following its Christmas Day exploit as investigators work to separate real victims from false claims.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 56548325,
    "published": 1767016863000,
    "title": "Year in Prediction Markets: From Regulatory 'Sinkhole' to Multi-Billion Dollar Business",
    "body": "Prediction markets hit $2B in weekly volume as regulatory hostility faded and mainstream players from CNN to the NHL jumped on the trend.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 56548228,
    "published": 1767016802000,
    "title": "Here’s Why Bitcoin Advocate Max Keiser Restates Bullish Outlook For 2025",
    "body": "Renowned Bitcoin advocate and El Salvador presidential advisor Max Keiser has once again reiterated his ultra-bullish outlook for BTC in 2025, doubling down on predictions that highlight the cryptocurrency’s role as a hedge against inflation and macroeconomic instability. As the traditional financial systems face increasing pressure, Keiser maintains that BTC’s fixed supply and expanding market infrastructure position it for significant upside in the year ahead. How Macro Debt And Inflation Risks Strengthen Bitcoin’s Case According to a recent post from Crypto Miners on X, Bitcoin advocate Max Keiser has once again reiterated his long-standing BTC thesis from 2025. Keiser points to total US debt surpassing $36 trillion and annual interest expenses approaching $1 trillion, claiming that this environment could push BTC beyond $2 million as capital seeks protection from fiat debasement. Related Reading: Bitcoin Bottom Forecast: Top Expert Predicts $40,000 Target Next Year, Here’s The Analysis The argument remains consistent with Keiser’s long-standing BTC maximalist stance, which links rising sovereign US debt expansion and currency dilution to upward pressure on a fixed supply asset. Replies are split, and supporters point to a 21 million supply against the unlimited debt. Thus, critics remain unconvinced, noting that BTC continues to trade below the $100,000 level despite similar high-conviction predictions made throughout 2025. Market commentator The Penguin updated that Bitcoin’s lower timeframe (LTF) structure is still looking a bit less impulsive, but nothing meaningful has changed in the count. Instead, BTC remains comfortable treating the current formation as a leading diagonal for wave 1, with recent LTF fluctuations resembling short-term noise rather than a decisive shift in trend. The Penguin pointed out that by setting Elliott Wave analysis aside and focusing on standard technical analysis, BTC continues to respect a well-defined range. This behavior is seen as consistent with the fact that Sunday trading and volume are light. From a trading perspective, the analyst’s focus is on longs and monitoring a possible shallow deviation toward the 0.886 retracement level marked on the chart. On the bullish side, the confirmation would be acceptance back above the $90,500 level, which would invalidate the bearish idea. Overall, the directional bias remains the same as the low-vol LTF chop is ahead of the yearly open. The Penguin added that the broader structure still looks solid and should hold up, while also noting signs of relative strength in assets such as XPL. Why Momentum Will Decide The Next Major Move Bitcoin high-timeframe (HTF) price action and momentum are currently navigating a structural pattern that mirrors a historical turning point. Crypto investor and trader known as Titan of Crypto has highlighted that BTC is showing a sequence similar to Q2 2021 and Q1 2025. Related Reading: Bitcoin Recent Dips Reveal Market Structure Issue Not Coming From Selling Pressure While the structure price behavior remains comparable on the HTF charts, momentum indicators are showing signs of weakening. As a result, the next trend will depend on whether momentum can re-accelerate or confirm trend exhaustion. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|Crypto Miners|Elliott wave theory|High-Timeframe|HTF|Lower TimeFrame|LTF|Max Keiser|The Penguin|Titan Of Crypto|XPL",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56548351,
    "published": 1767016800000,
    "title": "These three altcoins came back from the dead in 2025",
    "body": "Altcoins lagged Bitcoin in 2025, but XRP, Zcash and Algorand outperformed on regulatory clarity, privacy demand and tokenization.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 4,
        "NAME": "ALGO",
        "CATEGORY": "ALGO"
      },
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56548761,
    "published": 1767017745000,
    "title": "CoinDesk 20 Performance Update: Polkadot (DOT) Rises 6% Over Weekend",
    "body": "Cardano (ADA) was also a top performer, gaining 4.2% from Friday.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "CoinDesk Indices|CoinDesk Indices|CoinDesk 20|charts|Prices|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 21,
        "NAME": "DOT",
        "CATEGORY": "DOT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56548930,
    "published": 1767017932000,
    "title": "North Korea-linked theft and poor key security dominate Web3 losses: Hacken",
    "body": "Hacken says Web3 losses climbed to nearly $4 billion in 2025, with North Korea behind over half the damage, and regulators under pressure to turn security guidance into hard rules.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      }
    ]
  },
  {
    "id": 56549840,
    "published": 1767019603000,
    "title": "Bitmine's ether stash tops 4.1 million tokens as crypto and cash holdings reach $13.2 billion",
    "body": "Tom Lee's publicly traded miner and treasury firm said it now controls more than 3% of ether’s total supply and is accelerating staking plans.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitmine|Ethereum Treasury|Ether|Staking|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56550301,
    "published": 1767020436000,
    "title": "Investment Firm CEO Drops Utility Bomb On XRP, Is Community Hype A Detriment?",
    "body": "Comments from Galaxy Digital’s leadership have looked into what ultimately sustains value in the crypto market. In a recent YouTube discussion centered on 2026 expectations for Bitcoin, crypto, and artificial intelligence, Galaxy Digital CEO Mike Novogratz and Head of Research Alex Thorn singled out XRP and Cardano, questioning whether even the strongest communities can survive if real usage fails to expand when users have a vast number of alternatives to choose from. Galaxy Digital Leadership Raises Questions About Community Versus Utility During the YouTube discussion, Mike Novogratz presented the utility debate through the lens of capital allocation. He explained that the real question is what an investor chooses when presented with many viable options. If capital can flow into something like SpaceX, then crypto assets must compete on similar grounds. Related Reading: Charles Hoskinson Reveals What XRP And Cardano Are Already Doing 100x Better He acknowledged that XRP and Cardano both have deeply committed communities, but questioned whether that loyalty can be sustained if users do not see any real utility with those ecosystems. “Can Ripple hold it together? Can Cardano hold it together?” Novogratz said. In drawing comparisons, Novogratz referenced Charles Hoskinson, noting his success in maintaining Cardano’s community over time despite it being a “blockchain that people don’t really use a lot.” He made similar observations about XRP’s following, which has a strong community. However, he posed a direct question about sustainability: “Can you keep it together when there are more and more options?” Recent crypto market dynamics have caused capital flows to become more selective. Developers and teams behind blockchain ecosystems all know this, and this is why there has been a race to demonstrate usage, revenue models, or clear value flows tied directly to their tokens. According to Novogratz, that doesn’t happen overnight. It’s probably a year-long process, not a one to three-month process. Cardano And XRP Proving Real-World Relevance The questions raised during the Galaxy Digital discussion arrive at a time when both Cardano and XRP are actively trying to strengthen their utility narratives. Recent events have seen Cardano attempting to reinforce its practical relevance through initiatives like the Midnight sidechain. Midnight is a privacy-focused Cardano sidechain network designed to support confidential smart contracts and selective data disclosure. Related Reading: Flare Launches New Way For XRP Investors To Earn Midnight is intended as a way to attract enterprise and institutional use cases that require compliance-friendly privacy, an area where public blockchains have traditionally struggled. XRP, on the other hand, is taking a different path through Ripple’s hard work to increase the utility of the XRP Ledger. Ripple has been expanding utility around Ripple USD (RLUSD), its US dollar-backed stablecoin, including broader deployment across multiple Layer-2 networks. Ripple has also been on a partnership spree this year in moves to strengthen the utility of the XRP ecosystem, with about $4 billion spent on major acquisitions in 2025. The company also recently partnered with Doppler Finance to explore collaboration in XRP-based yield infrastructure and real-world asset (RWA) tokenization on the XRP Ledger, which is another added utility. Featured image from Pxfuel, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP News|Alex Thorn|Cardano|Charles Hoskinson|Galaxy Digital|Midnight|Mike Novogratz|Real World Asset|Ripple|ripple usd|RLUSD|RWA|stablecoin|xrp|XRP Ecosystem|XRP Ledger|xrp news|XRP Price|XRPL|XRPUSD|xrpusdt|YouTube",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56550982,
    "published": 1767021300000,
    "title": "ETH price to $5K next? Ethereum rallied 120% the last time this happened",
    "body": "The amount of Ethereum waiting to be staked has surpassed that awaiting withdrawal, making a rally to $5,000 possible in 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56552426,
    "published": 1767024063000,
    "title": "Crypto Crystal Ball 2026: Will Crypto Lose the Fight for a Market Structure Bill?",
    "body": "The crypto lobby is becoming convinced their coveted bill can’t pass Congress next year. Just how crucial is it?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56553082,
    "published": 1767024900000,
    "title": "Zcash price has 'first stop' at $1K: Arthur Hayes",
    "body": "Incoming liquidity from the US Fed and bullish technical breakouts are aligning to support a $1,000 price outlook for Zcash.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      }
    ]
  },
  {
    "id": 56553453,
    "published": 1767024619000,
    "title": "The White Whale up 10x in a week! Lighter TGE! Saylor buys $109M BTC!",
    "body": "Btc: 87k (-1%) | btc.D: 59.0% (0%). Eth: 2953 (-3%) | bnb: 853 (-1%) | sol: 124 (-3%). The White Whale goes almost 15x in a week, from $5m to $71m mcap. Lighter TGE rumours stirring. YouTuber Nick Shirley reveals mass fraud in Minnesota daycare system. Gold & Silver prices see huge dump",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56556280,
    "published": 1767031237000,
    "title": "Can XRP Price Reach $10,000? Expert Says It’s Different Math, Different League",
    "body": "A crypto expert has addressed the arguments suggesting that the XRP price could never reach $10,000. He explained that XRP is in a different league from most cryptocurrencies, making traditional valuation methods less effective. The expert also asserts that XRP is designed to handle large-scale institutional flows and, as a result, a $10,000 valuation cannot be ruled out entirely in the long run. Why The XRP Price Could Reach $10,000 Stern Drew, the founder and CEO of Stageyo, the world’s first digital marketplace for stage performers, has weighed in on the long-running debate around the future price potential of XRP. On X, the founder argued that many projections dismissing a $10,000 XRP price are flawed because they apply the wrong framework and mathematical models to the asset. Related Reading: Pundit Shares Why XRP Will Become Expensive And A $1,000 Price Tag Is Possible According to him, XRP should not be evaluated using the same assumptions as retail-driven cryptocurrencies. Drew explained that comparisons with Bitcoin and other digital assets often ignore scale entirely. He pointed out that a single Ripple partner can move more value in one day for XRP than Bitcoin processes in an entire year. This difference in settlement volume is central to how the expert believes that XRP’s future value should be gauged. The Stageyo founder further stressed that XRP was primarily designed for institutional settlement rather than speculative trading. Its core use case is tied to moving large volumes of capital across borders effectively. In that context, Drew has suggested that price expectations that rule out levels like $10,000 based on retail demand or historical crypto cycles are not relevant. He argued that low prices do not make sense when a cryptocurrency is handling massive institutional inflows. If XRP is used for high-value settlements, a higher price per token increases efficiency. This means fewer tokens will be needed to transfer the same amount of value, reducing friction and speeding up transactions. Drew described this concept as a different kind of math that applies to a “different league” of financial activity. Rather than focusing on market capitalization to gauge a cryptocurrency’s future value, the expert emphasizes liquidity and transaction throughput. From this perspective, he links the possibility of XRP reaching $10,000 to its intended role in the global financial system. XRP Positions For Major Role In Global Banking In a separate X post, Drew drew attention to a recent statement made by the Bank of Japan (BOJ). Notably, the BOJ disclosed that both Japan and South Korea are working together on developing blockchain infrastructure, subtly referencing XRP and Ripple in its announcement. Related Reading: XRP Open Interest Crashes To Levels Not Seen Since 2024, Can It Also Rally 600%? Reports reveal that official discussions are currently private, but their impact is expected to be significant. The BOJ highlighted that XRP holders should watch out and brace for future developments, as this collaboration could become a transformative moment for Ripple. Notably, the crypto payments company has already established relationships with some of Japan’s largest financial institutions, including SBI Holdings. Moreover, South Korea has been a major investor in XRP over the years. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Bank of Japan|bitcoin|BoJ|Ripple|SBI Holdings|Stageyo|Stern Drew|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56556552,
    "published": 1767031672000,
    "title": "Price predictions 12/29: SPX, DXY, BTC, ETH, BNB, XRP, SOL, DOGE, ADA, BCH",
    "body": "Bitcoin and several major altcoins are stumbling near their overhead resistance levels, indicating that the bears remain active at higher levels.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 12,
        "NAME": "BCH",
        "CATEGORY": "BCH"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56557152,
    "published": 1767032802000,
    "title": "BlackRock's BUIDL hits $100M in payouts, showing tokenized finance at scale",
    "body": "BlackRock’s tokenized money market fund has distributed $100 million from Treasury yields, offering a real-world test of blockchain-based financial infrastructure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 56558200,
    "published": 1767034847000,
    "title": "XRP Exchange Inflows Spike To End 2025: Will Price Decline Deepen?",
    "body": "On-chain data shows XRP has seen a significant value on the Binance Exchange Inflow during the last couple of weeks, a sign that may be bearish for the asset’s price. XRP Binance Exchange Inflow Has Shot Up To End 2025 As pointed out by Darkfrost in a CryptoQuant Quicktake post, the Exchange Inflow has been elevated for XRP recently. The “Exchange Inflow” is an indicator that measures the total amount of the asset that investors are depositing into wallets connected with a given centralized exchange. Related Reading: XRP Triangle Hints At Potential 10% Move—But In Which Direction? When the value of the metric is high, it means traders are moving large amounts from self-custodial wallets to the exchange. As one of the main reasons why holders deposit to these platforms is for selling-related purposes, this kind of trend can have bearish implications for the token’s price. On the other hand, the indicator being low suggests that demand for transferring coins to the exchange is low among the investors. Depending on whether withdrawals are also occurring, such a trend may be neutral or bullish for the cryptocurrency. Now, here is a chart that shows the trend in the XRP Exchange Inflow for the Binance platform over the last few months: As displayed in the above graph, the XRP Binance Exchange Inflow was at relatively muted levels between October and the first half of December, suggesting exchanges weren’t receiving that many deposit transactions. This trend flipped starting December 15th, however, as the indicator witnessed a surge. Its value has since maintained above 35 million tokens, with a particularly sharp peak of 116 million coins coming on the 19th. The analyst has noted that the shift in investor behavior points to “a move toward profit taking for older positions, as well as capitulation and loss selling from more recent entrants.” The surge in the Exchange Inflow has arrived as the XRP price has plunged under the $2.0 level. The fact that these deposits have been sustained could be a reason why the coin has been unable to make much recovery. Related Reading: Bitcoin Supply Overhang: 6.6 Million BTC Bought Above Current Price “If this selling pressure continues, the current correction could not only extend in time but also deepen further,” noted Darkfrost. It now remains to be seen how the Exchange Inflow will develop as 2026 arrives. The Exchange Inflow provides just one way to gauge selling pressure in the market. Another method is through tracking the supply attached to the whales. As analyst Ali Martinez has highlighted using data from on-chain analytics firm Santiment in an X post, the big-money XRP investors have seen their supply go down recently. From the chart, it’s visible that XRP whales have shed 40 million tokens recently, showcasing that large investors have been in a phase of net distribution. XRP Price At the time of writing, XRP is trading around $1.87, down almost 3% in the last week. Featured image from Dall-E, CryptoQuant.com, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP News|xrp|XRP Exchange Inflows|XRP Price|XRP Selling|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56558326,
    "published": 1767035025000,
    "title": "Flow scraps blockchain 'rollback' plan after community backlash over decentralization",
    "body": "The layer-1 network reversed course after ecosystem partners warned that rewriting chain history would undermine decentralization and create operational risks following a $3.9 million exploit.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Tech|Blockchain Technology|Decentralization|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 56559292,
    "published": 1767036776000,
    "title": "South Korean lawmaker faces scrutiny over family ties to crypto exchange: Report",
    "body": "A key lawmaker overseeing financial institutions reportedly tried to secure a job for one of his sons at a crypto exchange while raising concerns about a competitor.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56560070,
    "published": 1767038411000,
    "title": "Crypto Heat Fizzling Out? US Search Interest Plunges As Retail Shy Away",
    "body": "Search interest for the word “crypto” has fallen to levels not seen in a year, signaling a sharp drop in retail curiosity as 2025 ends. According to recent Google Trends readings, worldwide interest stood at 26 on the 0–100 scale, just above this year’s low of 24. Related Reading: Bitcoin Forecasts For 2026 Range From $65K To $250K As Sentiment Hits ‘Extreme Fear’ Searches Slide As Prices And Headlines Stumble Based on reports, US search activity for “crypto” hit a one-year low of 26, underscoring that casual investors are not hunting for basic information the way they did in earlier cycles. The dip follows a turbulent year that included a severe market sell-off in April and a sharp October flash crash that knocked major coins down from recent highs. Market watchers point to several triggers. Memecoin collapses tied to high-profile figures shook confidence. Policy shocks tied to US President Donald Trump’s tariff moves also coincided with big drops in interest during the spring. Some commentators say retail users moved on after heavy losses and viral token drama. There is close to no retail interest in crypto right now Do we need to start pumping the dino coins again to get retail to come back? After the Trump/Melania memecoin drama it seems that retail lost a lot of faith in the space None of my normie friends or family ask me… pic.twitter.com/ZNnOwT4FKe — 0xMarioNawfal (@RoundtableSpace) December 27, 2025 Retail Pullback Could Mean Quieter Weeks Ahead The practical effect is a quieter retail base. Trading volumes from small accounts have thinned. That does not mean prices must fall; it can mean fewer headline-grabbing rallies driven by newcomers. Institutions, which do not typically show up in Google searches, still play a big role in market flow. Year-end coverage highlights that institutional activity and regulatory moves shaped much of 2025’s action. Analysts Offer Different Takes On What Comes Next Some analysts warn that low retail interest removes a source of quick upside, making long rallies harder to sustain without strong macro catalysts. Others argue this lull is a pause, and that interest can return if prices break out or a major positive regulatory decision lands. Mario Nawfal and other commentators have described the current environment as a near-total absence of retail buzz. Data Points And What They Show The Google Trends scale gives a quick read. A 26 reading is low compared with earlier peaks during boom months. Reports from several industry outlets show the same pattern across regions, with the US particularly muted. Industry trackers note that big headline events still move markets, but everyday search traffic — the kind that often signals mass retail involvement — is down. Related Reading: Bitcoin Rules The Decade: Outshines Gold And Silver, Analyst Says A fall in Google searches is a sentiment indicator, not a trading rule. It shows fewer people are asking basic questions like how to buy or where to trade. That can cut both upside and downside volatility driven by inexperienced traders. Crypto is likely to remain under the radar until new catalysts appear, like significant price changes, regulatory updates, or a compelling story that captures mainstream interest again. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|bitcoin|crypto|digital currency|google trends",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56561196,
    "published": 1767040140000,
    "title": "Crypto Firm Tied to Trumps Axes Auditor in Latest Sign of Strife",
    "body": "A small financial-technology company tied to a Trump family crypto project has fired its auditor, the latest sign of turmoil at the Las Vegas-based firm.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56561823,
    "published": 1767042039000,
    "title": "Here’s Why The ZCash (ZEC) Price Rallied Above $500 Again",
    "body": "The Zcash (ZEC) price has rallied above the psychological $500 level, providing a bullish outlook for the privacy-focused token. This comes amid a notable surge in whale accumulation and derivatives activity among crypto traders. Why Zcash (ZEC) Price Rallied Above $500 Despite Crypto Market Decline CoinMarketCap data show that the Zcash (ZEC) price has rallied above $500 again, up over 20% in the last week. This comes despite the crypto market downtrend, with Bitcoin trading in a tight range just below the psychological $90,000 level. The ZEC surge above $500 comes amid a significant increase in whale accumulation, which has contributed to this price surge. Related Reading: Zcash Explodes 700% Since September – What’s Driving The Rally Amid The Bear Market? Nansen data show a 47% increase in ZEC whale holdings, with the top 100 addresses now holding 66% of the token’s total supply. This has likely created a supply shock, sparking a rise in the Zcash (ZEC) price. Notably, there has been a 55.36% drop in the supply held by exchanges, further highlighting the accumulation trend, with investors likely moving their coins off-exchanges for long-term holding. On-chain analytics platform Lookonchain also highlighted the accumulation trend among these whales. In an X post, Lookchain revealed two newly created wallets that withdrew 26,241 ZEC ($13.5 million) from Binance. In another post, the on-chain analytics platform revealed that another whale withdrew 7,714 ZEC ($4.12 million) from Kraken. Lookonchain had also drawn attention to a whale that withdrew 30,000 ZEC ($13.25 million) from Binance last week. Activity in the derivatives market has also contributed to the Zcash (ZEC) price rally above $500. CoinGlass data show an increase in the altcoin’s open interest, indicating that traders are increasing their positions. Most of these traders are currently long with the long/short ratio above 1. This recovery marks a positive for the privacy token, which had dropped to as low as $310 earlier this month. ZEC is notably the best-performing crypto among the top tokens with a year-to-date (YTD) gain of around 800%. ‘Next Stop Is $1,000’ BitMEX co-founder Arthur Hayes declared in an X post that the next stop for the Zcash (ZEC) price is $1,000 following its recovery above $500. This represents a potential 100% gain from its current price level. The BitMEX co-founder has been bullish on the privacy token for some time now, predicting it could eventually reach $10,000. Related Reading: The Bitcoin Bull And Bear Cases That Crypto Traders Should Know About Meanwhile, Zcash’s co-founder Eli Ben-Sasson suggested that the Zcash (ZEC) price will continue to rally because of its good product, scarcity, and regulatory atmosphere. He noted that privacy is now widely recognized as necessary in crypto. As such, the privacy narrative is expected to keep fueling this price surge. At the time of writing, the Zcash (ZEC) price is trading at around $536, up over 3% in the last 24 hours, according to data from CoinMarketCap. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "ZEC|Arthur Hayes|Binance|BitMEX|Coinglass|CoinMarketCap|Eli Ben-Sasson|Lookonchain|Nansen|Year-To-Date|YTD|ZCash|Zcash Price|ZEC Price|zecusd|ZECUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56562072,
    "published": 1767042306000,
    "title": "Flow scraps rollback plan after pushback over decentralization, security",
    "body": "Although recovery of assets affected in a $3.9 million exploit of the Flow blockchain isn't guaranteed, many users responded positively to a change in the remediation plan.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 125,
        "NAME": "FLOW",
        "CATEGORY": "FLOW"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 56562380,
    "published": 1767043159000,
    "title": "As Democrats gain in odds to take U.S. House, Waters bashes SEC chair on crypto",
    "body": "Maxine Waters, the top Democrat who may lead the House Financial Services Committee again if Democrats prevail, has a crypto bone to pick with SEC's Atkins.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|U.S. House Committee on Financial Services|Maxine Waters|Paul Atkins|U.S. Securities and Exchange Commission|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56562966,
    "published": 1767044189000,
    "title": "Onchain perpetual futures drive surge in crypto derivatives activity",
    "body": "According to Coinbase researcher David Duong, decentralized platforms and shifting trader behavior have pushed perpetual futures into a more central market role.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56563466,
    "published": 1767045604000,
    "title": "Dogecoin Chart Mirrors Silver’s Breakout, Analyst Flags $9+ Scenario",
    "body": "Silver has staged a historic, late-December breakout, surging from roughly $50 an ounce in mid-November to an intraday all-time high above $83, before easing slightly as traders took profits. Will Dogecoin follow its lead? At press time, spot silver was holding near $76 after pulling back from the earlier record high of $83.62, with the metal up roughly 181% year-to-date in 2025, an outsized move for the precious-metal. The rally is attributed to a mix of macro and market-structure drivers including expectations for easier US monetary policy in 2026, strong industrial and investment demand, persistent supply shortfalls, and silver’s recent designation as a US “critical mineral,” which added a policy-sensitive supply narrative to an already tight market. The ‘Silver Fractal’ Pitch For Dogecoin That silver move is now being used as a visual analog in crypto. X analyst Cantonese Cat (@cantonmeow) posted a side-by-side TradingView comparison suggesting Dogecoin’s 6-month chart resembles silver’s 3-day structure from three weeks ago, implying DOGE could be positioned for a similarly persistent advance if the fractal holds. In the shared DOGE 6-month panel, Cantonese Cat shows a large selloff candle and frames it as a potential cyclical low. Based on the silver comparison, the interpretation is not “DOGE pumps next week,” but “DOGE trends for years.” Related Reading: Dogecoin Triangle Formation Breakdown Spells Trouble As 15% Move Nears – Time To Be Cautious? In the proposed fractal path, the current 6-month candle would mark the bottom, followed by eight additional 6-month candles spanning roughly four years where seven are green and only one is red. The lone red candle is mapped as the third in the sequence, implying the first half of 2027 could be a down half-year even within an overarching uptrend. If the pattern were to track silver “exactly,” the projected cycle peak would land in the second half of 2029, with a peak price “above $11” in that window. Related Reading: Dogecoin Is Repeating Its 2020 Accumulation Cycle, Analyst Says How It Fits His Earlier Wave Framework The comparison follows Cantonese Cat’s earlier Dec. 20 post outlining a longer-horizon DOGE roadmap on the weekly chart. “We’ve already had a 13 month bear market for DOGE, with my working hypothesis of this being likely a wave 2 correction prior to wave 3 explosion,” the analyst wrote. The accompanying weekly DOGE chart labels the prior advance as “Wave 1” and the subsequent decline as “Wave 2,” with a descending trendline drawn across the multi-year structure. The Dec. 20 weekly snapshot shows DOGE around $0.13160 with retracement levels including 0.382 at about $0.11771, and 0.236 at about $0.08427, with the base (“0”) around $0.04909. Above the current price, the analysis maps 0.5 at about $0.15422 as the next resistance, followed by 0.618 at about $0.20205, 0.707 at about $0.24770, 0.786 at about $0.29681, and 0.886 at about $0.37315, before the 1.0 level near $0.48442. Above the prior high, the same map plots extension targets often used in Elliott Wave projection frameworks, labeled near 1.272 ($0.90288), 1.414 ($1.24968), 1.618 ($1.99344), 2 ($4.77927), and 2.272 ($8.90771). The implication is conditional: the extensions matter only if DOGE completes the corrective phase and reclaims the prior impulse high. At press time, DOGE traded at $ Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56565146,
    "published": 1767049253000,
    "title": "XRP Selling Pressure Returns: Investors Shift From Holding to Distribution",
    "body": "XRP is trading below critical technical levels after losing the $2 mark, a breakdown that has shifted market sentiment decisively toward fear. Bulls are struggling to find reliable support as price action weakens, and recent attempts at stabilization have failed to attract sustained demand. The loss of this psychological and structural level has left XRP vulnerable, with traders increasingly positioning defensively amid broader uncertainty across the altcoin market. Related Reading: Why $100,000 Is Bitcoin’s Most Important Resistance Level According to analysis shared by Darkfost, selling pressure on XRP has intensified materially over recent weeks. The data shows that the current move is not a minor pullback, but part of a deeper corrective phase. XRP has declined by roughly 50% from its cycle peak near $3.66, falling toward the $1.85 region. This magnitude of decline reflects a clear shift in market behavior, as earlier optimism has given way to risk reduction and capital preservation. Darkfost’s assessment suggests that the increase in selling is driven by a combination of profit-taking from older positions and capitulation from more recent buyers who entered at higher levels. As the price moves further away from prior highs, confidence has deteriorated, reinforcing the downside momentum. Exchange Inflows Highlight Rising Sell-Side Pressure Darkfost further explains that the recent surge in selling pressure becomes especially clear when examining XRP inflows to exchanges, with Binance standing out as the primary focal point. As the exchange that concentrates the largest share of XRP trading volume, Binance often serves as an early indicator of shifting market intent. Rising inflows to exchanges are commonly interpreted as a signal that holders are preparing to sell, particularly when the increase is sudden and sustained. After several weeks of relatively calm conditions, characterized by stable and moderate inflows, this pattern changed sharply around December 15. Since then, XRP transfers to Binance have accelerated, with daily inflows consistently ranging between 35 million XRP and a pronounced spike of roughly 116 million XRP recorded on December 19. This marks a clear break from the prior holding-oriented behavior observed through much of October and November. The shift in inflow dynamics suggests a change in investor psychology. Longer-term holders appear to be taking profits after XRP’s strong run earlier in the cycle, while more recent entrants are increasingly capitulating and selling at a loss as the price continues to slide. This combination amplifies downside pressure and reinforces the current corrective trend. As long as elevated exchange inflows persist, conditions for accumulation remain unfavorable. Without a meaningful slowdown in deposits, XRP is likely to struggle to form a durable base, increasing the risk that the correction extends further in both time and depth. Related Reading: Trust Wallet Exploit Drains $7M: Hundreds Of Users Affected XRP Price Action Details: Testing Demand XRP continues to trade under clear technical pressure, with price hovering near the $1.87–$1.90 zone after a prolonged downtrend on the daily chart. The structure shows a decisive loss of bullish control following the rejection from the $3.00–$3.50 region earlier in the year. Since that peak, XRP has consistently printed lower highs and lower lows, confirming a bearish market structure that remains intact. From a trend perspective, the price is trading below all major moving averages. The short-term moving average has turned sharply lower and now acts as immediate dynamic resistance, while the medium- and long-term averages are also sloping downward, reinforcing the broader bearish bias. Each recent attempt at a relief bounce has failed below these averages, suggesting that sellers continue to dominate rallies. Related Reading: Bitcoin and Ethereum Coinbase Inflows Collapse While Binance Retains Relative Activity – Details The $1.80–$1.85 region is now a critical support area. This zone has absorbed several tests in recent weeks, indicating short-term demand, but the lack of a strong rebound highlights weak buying conviction. A clean break below this level would expose XRP to a deeper retracement toward the $1.50 region, where historical demand previously emerged. Unless XRP can reclaim the $2.10–$2.20 range and hold above it, the path of least resistance remains to the downside, with risks skewed toward further consolidation or continuation of the correction. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP News|xrp|XRP analysis|XRP holders|xrp news|XRP Price|XRP Selling|XRP selling pressure|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56566836,
    "published": 1767052801000,
    "title": "US Strategic Bitcoin Reserve: Key Catalyst For Potential Surge Toward $150,000 Next Year",
    "body": "As Bitcoin (BTC) maintains a consolidated trading range between $86,000 and $90,000 after experiencing a 30% correction from its all-time high in October, market expectations for the cryptocurrency’s future remain optimistic. Market analyst Dominic Basulto from The Motley Fool believes that despite the persistent challenges seen in the fourth quarter of the year, Bitcoin could soar to $150,000 by 2026, fueled by the newly established US Strategic Bitcoin Reserve. Is $150,000 Possible For Bitcoin? Historical context supports Basulto’s prediction; Bitcoin’s performance over the years has shown significant recovery potential, with 2015 marking its worst bull market year at just a 36% gain. Significantly, in seven of its years, Bitcoin has achieved triple-digit percentage returns. The analyst suggests that 2026 may resemble 2019, a year when Bitcoin appreciated by 95% following the dismal performance in 2018, when it plummeted by 74%. Related Reading: XRP Supply Shock Incoming? Expert Reveals The Truth In 2019, several catalysts, such as heightened global economic uncertainty and a surge in institutional interest, propelled Bitcoin upwards—situations that appear similar to current conditions. Institutional investors are increasingly adding BTC to their portfolios, driven by spot Bitcoin exchange-traded funds (ETFs). Meanwhile, concerns over global tariffs and macroeconomic instability in the US continue to resonate among investors, setting the stage for potential bullish movement. However, Basulto emphasizes that Bitcoin can only reach the $150,000 milestone if it is perceived as a long-term store of value. If investors view it merely as another high-risk asset, they may choose to favor physical gold over digital gold, which has seen a record-breaking year. The crux of his argument centers on one pivotal factor that could significantly impact Bitcoin’s price: a notable increase in purchases by the US Strategic Bitcoin Reserve. What Happens If Nations Stockpile BTC? Basulto claims that if the US government were to start buying substantial quantities of Bitcoin, it could trigger a global arms race among other countries keen to create their own strategic BTC reserves. According to the analyst, such purchases from national reserves could dramatically inflate Bitcoin’s price, likely surpassing the impact of corporate treasury companies that have already amassed close to 5% of the world’s circulating BTC supply. Related Reading: Investment Firm CEO Drops Utility Bomb On XRP, Is Community Hype A Detriment? Although reaching the $150,000 mark may seem ambitious given Bitcoin’s recent performance, more aggressive predictions exist for 2026. For instance, JPMorgan Chase has forecasted a potential price of $170,000, while Wall Street strategist Tom Lee from Fundstrat has suggested that BTC might even hit $250,000 next year. While a variety of factors must align for BTC to reclaim its status as digital gold, the possibility of elevated prices hinges on strategic actions by both the US government and institutional investors. Basulto concluded that if the leading cryptocurrency can consolidate its position and the Strategic Bitcoin Reserve gains traction, the predicted price of $150,000 could be achieved by next year. At the time of writing, BTC’s price retraced towards $87,330 following an early Monday move above $90,500. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|BTCUSDT|crypto|crypto market|crypto news|US Bitcoin reserve|US Strategic Bitcoin Reserve",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56570205,
    "published": 1767059191000,
    "title": "Fake Coinbase support scammer allegedly stole $2M from users",
    "body": "An Investigation from ZachXBT traced the suspect through posts gloating on social media and Telegram activity.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56572360,
    "published": 1767063305000,
    "title": "Bitcoin Price Erases Recent Gains, Raising Fresh Downside Risks",
    "body": "Bitcoin price failed to clear $90,000 and trimmed all gains. BTC is now consolidating losses and might struggle to stay above $86,500. Bitcoin started a recovery wave but failed to surpass $90,000. The price is trading below $88,000 and the 100 hourly Simple moving average. There is a declining channel forming with resistance at $87,500 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move down if it trades below the $86,500 zone. Bitcoin Price Dips Sharply Bitcoin price attempted a fresh increase above $88,500 and started a recovery wave. BTC even climbed above the $89,000 barrier but struggled near $90,000. A high was formed at $90,298 before the bears appeared. There was a sharp downside reaction below $89,000. BTC trimmed all gains and even dived below $88,000. A low was formed at $86,700, and the price is now consolidating losses below the 23.6% Fib retracement level of the downward move from the $90,298 swing high to the $86,700 low. Bitcoin is now trading below $88,000 and the 100 hourly Simple moving average . If the price remains stable above $86,500, it could attempt a fresh recovery wave. Immediate resistance is near the $87,500 level. Besides, there is a declining channel forming with resistance at $87,500 on the hourly chart of the BTC/USD pair. The first key resistance is near the $88,000 level. The next resistance could be $88,500 and the 50% Fib retracement level of the downward move from the $90,298 swing high to the $86,700 low. A close above the $88,500 resistance might send the price further higher. In the stated case, the price could rise and test the $89,200 resistance. Any more gains might send the price toward the $90,000 level. The next barrier for the bulls could be $90,500 and $91,200. Another Decline In BTC? If Bitcoin fails to rise above the $88,500 resistance zone, it could start another decline. Immediate support is near the $86,500 level. The first major support is near the $86,000 level. The next support is now near the $85,500 zone. Any more losses might send the price toward the $85,000 support in the near term. The main support sits at $83,500, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $87,500, followed by $88,000. Major Resistance Levels – $86,500 and $86,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56574891,
    "published": 1767067259000,
    "title": "Solana Bearish Formation Hints At Major Correction Until Mid-2026 – Here’s The Target",
    "body": "Solana (SOL) is retesting a make-or-break area that could set the stage for a major move at the start of next year. Some analysts have suggested that altcoin’s chart signals a bearish performance for the coming months. Related Reading: Here’s Why Bitcoin Advocate Max Keiser Restates Bullish Outlook For 2025 Solana Faces Another Rejection From Key Resistance After hitting a three-week high of $130 on Sunday, Solana started the week with a 6.1% correction to the $122 area. The cryptocurrency recently breached below its macro support around the $120 zone, hitting an eight-month low of $116 in mid-December. Since then, the altcoin has been trading between the $120-$126 mark, attempting to break out of the local resistance multiple times but ultimately being rejected after each retest. SOL’s price surged around 5.6% toward during Sunday’s broader market bounce, trying to build a base below the crucial resistance level before plunging after the early Monday correction. Amid this performance, market observer Crypto Jobs pointed out that Solana had broken out of a six-week falling wedge, which could target the $144-$146 area if momentum holds and price confirms a retest of the breakout. However, the star-of-week pullback has momentarily sent SOL below the pattern’s upper boundary. Analyst Man of Bitcoin also highlighted that the cryptocurrency had broken above a one-month downtrend line, which suggested an initial move toward the $129-$130 area. The analyst explained that “holding above the broken trendline is key to maintaining upside momentum,” but noted that as long as the price remains below $146, a scenario where price is headed for one more low, around the $100-105 horizontal support, remains likely. Following the Monday rejection, he affirmed that “it could be that wave-4 is already complete. A decisive break below the trendline would confirm this further.” SOL’s Higher Timeframe Chart Shows Troubling Signs Market watcher Elite Crypto affirmed that Solana “doesn’t look very strong” on the higher timeframe, pointing to a multi-year bearish pattern potentially forming on SOL’s chart. According to X analysis, the cryptocurrency has been developing a Head and Shoulder pattern since early 2024, with the neckline sitting around the $105 area in the weekly timeframe. The char shows that left shoulder formed during the Q1 2024 rally, while the head and right shoulder formed during its rally to its latest all-time high (ATH) in Q1 and Q3 2025 breakouts, respectively. “If $SOL loses the $105 support then the price could move down to the $75–$51 range and this phase may last until mid 2026,” the investor detailed, adding that “after this period, the overall trend for SOL can turn bullish and set up a better move ahead.” Similarly, Henry from Lord of Alts suggested that Solana has formed a double top formation with the neckline around the current levels instead of a Head and Shoulders pattern. Related Reading: Bitcoin Nears Red Yearly Close: Galaxy Digital Explains The Setup Per the analyst, “We put in a clean double top, rolled over, and now price is going back toward a zone that’s acted as real support before.” If the altcoin fails to hold the current support, its price could retrace toward the $60 mark, the chart shows. Moreover, he added that SOL’s price could also risk a drop to the $35 area in the coming months as there’s “a big gap below that market hasn’t dealt with yet.” Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto analyst|crypto market correction|Crypto Market Recovery|Crypto trader|Sol|SOL ATH|SOL breakdown|Solana|Solana Analysis|Solana Price|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56574720,
    "published": 1767067103000,
    "title": "Ethereum Price Momentum Rolls Over, Bearish Move Warning",
    "body": "Ethereum price started a decent upward move but failed near $3,050. ETH is now struggling and might continue to move down below $2,900. Ethereum started a recovery wave but struggled above $3,000. The price is trading below $2,950 and the 100-hourly Simple Moving Average. There is a short-term contracting triangle forming with resistance at $2,930 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move down if it breaks below the $2,880 zone. Ethereum Price Dips Again Ethereum price started a recovery wave above the $2,920 and $2,950 levels, like Bitcoin . ETH price even climbed above the $3,000 resistance before the bears appeared. A high was formed at $3,053, and the price started another decline. There was a sharp decline below $3,000 and $2,980. The bears even pushed the price below $2,950. A low was formed at $2,907 and the price is now consolidating losses below the 23.6% Fib retracement level of the downward move from the $3,053 swing high to the $2,907 low. Ethereum price is now trading above $2,950 and the 100-hourly Simple Moving Average. If the bulls are able to protect more losses below $2,900, the price could attempt another recovery wave . Immediate resistance is seen near the $2,940 level. Besides, there is a short-term contracting triangle forming with resistance at $2,930 on the hourly chart of ETH/USD. The first key resistance is near the $2,955 level. The next major resistance is near the $2,980 level. It is close to the 50% Fib retracement level of the downward move from the $3,053 swing high to the $2,907 low. A clear move above the $2,950 resistance might send the price toward the $3,000 resistance. An upside break above the $3,000 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $3,050 resistance zone or even $3,120 in the near term. Another Decline In ETH? If Ethereum fails to clear the $2,955 resistance, it could start a fresh decline. Initial support on the downside is near the $2,900 level. The first major support sits near the $2,880 zone. A clear move below the $2,880 support might push the price toward the $2,840 support. Any more losses might send the price toward the $2,800 region. The next key support sits at $2,720. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI – The RSI for ETH/USD is now below the 50 zone. Major Support Level – $2,900 Major Resistance Level – $2,955",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56575469,
    "published": 1767068001000,
    "title": "Iranian protests over currency collapse show why Bitcoin's needed: Bitwise CEO",
    "body": "Widespread protests took place in Iran’s capital after the rial slid to record lows, prompting Bitwise CEO Hunter Horsley to argue Bitcoin could help Iranians protect their savings.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56575840,
    "published": 1767068729000,
    "title": "XRP price slips to $1.85 as key support gives way",
    "body": "Technical analysis suggests a defensive market stance, with XRP struggling to reclaim resistance levels and momentum indicators showing oversold conditions.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56526971,
    "published": 1767030787000,
    "title": "Trump-linked crypto venture fires auditor after FT inquiries",
    "body": "Alt5 Sigma hires third accounting firm in six weeks, complicating efforts to bring its financial reporting up to date",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56579535,
    "published": 1767073694000,
    "title": "Rep Waters demands SEC oversight hearing about its approach to crypto",
    "body": "Democrat Maxine Waters demands an SEC oversight hearing after the agency dropped major cases against Coinbase, Binance, and other crypto firms.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56580387,
    "published": 1767074867000,
    "title": "BlackRock’s BUIDL hits $100M in dividends and passes $2B in assets",
    "body": "BUIDL tokens are used in crypto market infrastructure and as collateral, bridging traditional finance and blockchain technology.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56583979,
    "published": 1767080597000,
    "title": "Lighter DEX launches LIT token with 25% airdrop",
    "body": "The LIT token supply is split evenly between the ecosystem and team/investors, with a portion airdropped to early participants.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|DeFi|airdrop|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 204,
        "NAME": "AIRDROP",
        "CATEGORY": "AIRDROP"
      }
    ]
  },
  {
    "id": 56584732,
    "published": 1767081608000,
    "title": "Store of value demand, regulatory clarity to drive 2026 bull market: Grayscale",
    "body": "Grayscale says macro pressure and clearer US regulation are setting the stage for crypto’s next bull market in 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56585476,
    "published": 1767082731000,
    "title": "Institutions are increasingly using the bitcoin options playbook for altcoins: STS Digital",
    "body": "Institutions are increasingly using bitcoin options strategies on altcoins to manage price volatility and enhance returns, STS Digital told CoinDesk.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Bitcoin Options|Altcoins|Options|Derivatives|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]