[
  {
    "id": 57120009,
    "published": 1768287627000,
    "title": "Bitcoin HODLer Selloff Ending? LTH Outflows Decline",
    "body": "On-chain data shows the Bitcoin long-term holder outflows have been declining recently, a potential sign that selling pressure may be fading. Bitcoin Long-Term Holder Netflow Is Getting Less Negative In a new post on X, on-chain analytics firm Glassnode has talked about the latest trend in the netflow associated with the Bitcoin long-term holders (LTHs). The LTHs refer to BTC investors who have been holding onto their coins for a period longer than 155 days. Related Reading: Solana Price Jumps, But Network Adoption Remains Weak Statistically, the longer an investor holds onto their coins, the less likely they become to sell them at any point. As such, the LTHs with their long holding time are considered to include the resolute hands of the market. Though, while these HODLers tend to be patient, they have shown several phases of distribution during the last couple of years. Below is the chart shared by Glassnode that shows the trend in the monthly netflow of the Bitcoin LTHs. As is visible in the graph, the Bitcoin LTHs observed streaks of net outflows during both the bull rallies of 2024, suggesting that the diamond hands of the market participated in profit-taking. A short phase of distribution also appeared in mid-2025, indicating that the LTHs were doing yet another wave of profit realization. This selling was followed by a brief period of net inflows for the cohort, which was then followed by another wave of distribution in late 2025. This last phase of distribution is still ongoing, as the monthly netflow associated with the LTHs remains negative. The latest selloff has been a bit different from the last three, however, as it has occurred alongside bearish momentum in the cryptocurrency, not a price jump. While the distribution has continued, its intensity has been dropping lately as the netflow of the Bitcoin LTHs has been becoming less negative. As the analytics firm explains: Net outflows have rolled over from extreme levels, indicating that the market is progressively absorbing long-held supply and that a large portion of overhead supply may now be largely worked through. The decline in net outflows has come alongside a drop in the Realized Profit of the group, as Glassnode has pointed out in another X post. The Realized Profit here is an indicator that measures the total amount of profit that LTHs are realizing through their transactions. From the chart, it’s apparent that the profit-taking from the cohort was elevated earlier, but recently, the Realized Profit has dropped to a low level. Related Reading: Bitcoin Risks Drop To $69,000 If Pennant Support Breaks, Analyst Warns The analytics firm noted: Such conditions are often associated with heightened uncertainty and tend to emerge during mid-bull market pauses or the early stages of deeper bear markets. BTC Price At the time of writing, Bitcoin is floating around $91,800, down almost 3% in the last seven days. Featured image from Dall-E, Glassnode.com, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin hodlers|Bitcoin long-term holders|Bitcoin LTHs|bitcoin selloff|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57121279,
    "published": 1768291200000,
    "title": "21Shares' bitcoin and gold exchange-traded product debuts on London Stock Exchange",
    "body": "The ETP offers physically backed exposure to bitcoin and gold in a single investment vehicle.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Gold|Bitcoin Gold|21 shares|ETFs|UK|London Stock Exchange|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57121874,
    "published": 1768293055000,
    "title": "Standard Chartered Sees Ethereum At $40,000 By 2030, Cuts 2026 Target",
    "body": "Standard Chartered has set a new long-range target of $40,000 for Ethereum (ETH) by end-2030, while cutting its end-2026 forecast sharply, arguing that Ethereum’s relative setup is improving even as Bitcoin-led weakness has weighed on absolute crypto price targets. In a research note, the bank’s digital assets analyst Geoff Kendrick framed 2026 as a potential inflection point for Ethereum versus bitcoin, despite revising down its medium-term ETH-USD path. “We think ETH’s prospects have improved. We therefore expect the cross to gradually return to its 2021 highs,” Kendrick wrote, pointing to a rebound in the ETH/BTC relationship as the core expression of his thesis. Standard Chartered Recasts Ethereum Outlook Standard Chartered now expects ether to end 2026 at $7,500, down from its prior $12,000 estimate, before rising to $15,000 in 2027 (cut from $18,000) and $22,000 in 2028 (cut from $25,000), with $30,000 penciled in for 2029 (raised from $25,000) and $40,000 by end-2030. Related Reading: This Ethereum Triangle Breakout Puts Price Above $24,000, Here’s The Path “I think 2026 will be the year of Ethereum, much like 2021 was,” Kendrick writes. The bank attributes the near-term markdown to Bitcoin’s drag on dollar-denominated crypto performance, with Kendrick noting that weaker BTC action has “weighed on the outlook for digital assets priced in dollars,” forcing lower absolute targets through 2028 even as Ethereum’s relative fundamentals strengthen. Kendrick highlighted a set of Ethereum-specific supports that, in his view, are more likely to show up in relative performance than in immediate spot-price upside. He pointed to continued accumulation by Bitmine Immersion Technologies, which the note described as the largest Ethereum-focused digital asset treasury company, at a time when ETF inflows have “temporarily stalled” and broader corporate treasury buying has cooled. Related Reading: Ethereum Long-Term Cost Basis Holds Firm: Structural Floor Forms Near $2.8K He also cited Ethereum’s centrality to stablecoins, tokenized real-world assets, and DeFi as structural demand drivers, and emphasized execution on plans to increase Ethereum layer-1 throughput by roughly 10x over the next two to three years. “Analysis shows that higher throughput translates into higher market cap,” Kendrick wrote. Regulation was flagged as a further potential tailwind. Kendrick pointed to the US CLARITY Act as a development that could be supportive for the sector and “particularly ETH” if it helps unlock another phase of DeFi activity. The US Senate is due to review the bill on Jan. 15 with possible passage in Q1. For traders, the framework implies that Standard Chartered’s highest-conviction expression is less about pinning an exact ETH-USD level in the next 12 months and more about whether Ethereum can reclaim relative ground versus bitcoin as throughput, stablecoin-heavy activity, and policy clarity compound into 2026 and beyond. At press time, ETH traded at $3,126. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57121755,
    "published": 1768292435000,
    "title": "New Senate CLARITY Act draft allows activity-based stablecoin rewards",
    "body": "A revised Senate CLARITY Act draft would allow activity-based stablecoin rewards tied to payments, wallets, and staking, while barring interest paid solely for holding tokens.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 57123151,
    "published": 1768296564000,
    "title": "Kraken-linked SPAC files for $250M IPO targeting crypto infrastructure",
    "body": "The Kraken-backed SPAC aims to raise $250 million in an IPO, targeting companies building infrastructure and services for the digital asset ecosystem.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57122914,
    "published": 1768295910000,
    "title": "Solana Policy Institute urges SEC to exempt DeFi developers from exchange rules",
    "body": "The Solana Policy Institute urged the SEC to distinguish non-custodial DeFi code from exchanges, warning that current rules could chill innovation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57123185,
    "published": 1768296716000,
    "title": "Another Day, Another Crypto Wrench Attack in France",
    "body": "Armed robberies targeting crypto investors have surged, with criminals using kidnapping and home invasions to steal digital assets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57123166,
    "published": 1768296611000,
    "title": "Crypto Market Structure Bill Poised For A Trump Signature, SEC Chief Says",
    "body": "US Securities and Exchange Commission Chair Paul Atkins is confident that a long-awaited crypto market structure bill could find its way into US President Donald Trump’s office for signature before the end of the year. The SEC chief highlighted ongoing efforts during an interview with Fox Business to clarify rules around digital asset trading and said the bill could provide much-needed guidance to investors and trading platforms. Related Reading: Crypto Products Post $454M Weekly Outflows On Fed Jitters Atkins Expresses Confidence Atkins, who was confirmed by the Senate in April 2025 in a 52-44 vote, said tokenization and faster settlement systems are part of the next phase for US markets. He argued that a market structure law would give firms and investors clearer signals about which rules apply to trading in digital assets. Reports have disclosed that the chair sees the bill as fitting the administration’s push to make the US more competitive in crypto. This is a big week for crypto – Congress is on the cusp of upgrading our financial markets for the 21st century. I am wholly supportive of Congress providing clarity on the jurisdictional split between the SEC and the @CFTC. pic.twitter.com/NtDWRW85kL — Paul Atkins (@SECPaulSAtkins) January 12, 2026 Atkins discussed the regulatory forecast for crypto this year during an interview with Fox Business. Source: Paul Atkins Lawmakers’ Calendar And Odds Based on reports from financial analysts, the path to passage is not guaranteed. One market note put the chance of the bill clearing Congress in 2026 at roughly 50-60%, and warned that delays could push final action into 2027. Other analysts have suggested a longer road, saying implementation of final market structure rules might not be settled for years if political dynamics change. What Is Being Negotiated The draft measures under discussion aim to define which federal agency supervises different types of digital instruments, establish standards for trading venues that list tokens, and create clearer reporting rules for market participants. Reports have disclosed that committee markups are expected before any Senate floor vote, and those sessions will shape the bill’s final text. Industry Reaction, Market Talk The optimism expressed by Atkins has been welcomed by industry associations, as they see that clear guidance could lead to more institutional capital flowing into the onshore crypto trading space. On the other hand, the sentiment from many companies is that there is still a level of caution surrounding future regulations. Although regulators continue to show a level of agreement regarding overall regulation, the details of custody, custody provider(s), and oversight split between various regulatory agencies must be agreed upon by Congress before any definitive progress can be made. This back-and-forth between Congress and regulatory agencies has caused the markets to react in a pattern of quick positive movements followed by corresponding negative movements due to legislative inaction. Related Reading: CZ Fuels Optimism As Binance Coin’s $1,000 Target Trends Political Timing Could Matter The midterm and committee calendars are being watched closely. If the Senate delays key votes, support that exists now could wane or be reshaped by other priorities. Some commentators argue that fast action would lock in regulatory clarity; others say a rushed law could leave gaps that require later fixes. The debate over speed versus detail is active in Washington. Featured image from Gemini, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto|digital currency|Paul Atkins|sec|Stablecoins",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57124039,
    "published": 1768299183000,
    "title": "Banks Win Key Battle as Crypto Bill Bars Stablecoin Interest Payments",
    "body": "An updated Senate draft of the market structure bill prohibits yield \"solely in connection with the holding of a payment stablecoin.\"",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 57124158,
    "published": 1768299316000,
    "title": "Ukraine blocks Polymarket in wider online gambling crackdown",
    "body": "Polymarket is already restricted in 33 countries.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Ukraine|Polymarket|Gambling|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57124976,
    "published": 1768302011000,
    "title": "Bitcoin Could Be Entering A Supercycle, Fidelity Warns",
    "body": "Fidelity Labs managing partner Parth Gargava says bitcoin may be transitioning away from its familiar, halving-linked four-year rhythm and into something closer to a “supercycle”, a regime that could keep prices elevated for longer and make drawdowns less severe, if structural demand continues to build. Speaking in Fidelity’s Jan. 9 crypto outlook for 2026 video, Gargava anchored the discussion in the cycle framework many market participants have used for years: peaks arriving roughly a year and a half after each halving. “Traditionally, what we have seen is Bitcoin has had this four-year cycle,” he said, adding that the pattern has been “highly correlated to Bitcoin’s halving events.” He pointed to the 2016 halving followed by a peak in December 2017 near $20,000, and the 2020 halving followed by another peak in 2021 about 18 months later. That history matters because it frames the debate around the most recent halving in April 2024. Gargava acknowledged the straightforward inference some investors make from prior cycles: “So maybe we are past that peak price.” But he positioned that view as only one side of the argument, highlighting a competing thesis that the market’s structure is evolving. Related Reading: Bitcoin HODLer Selloff Ending? LTH Outflows Decline “On the other side, you’re also seeing a lot of arguments around how we might have entered into a supercycle as opposed to what we have seen in the past four years,” Gargava said. “And what a super cycle really means is you might have more prolonged highs, longer highs, and shallower dips.” Gargava credited Fidelity Digital Assets’ research team for outlining what he called the “super cycle mechanism,” and suggested an analogy to the commodities market in the 2000s. The key point was not that bitcoin would mechanically copy commodities, but that a sustained, multi-year bid can alter how markets behave, extending expansions and compressing the depth of selloffs. JUST IN: $5 trillion Fidelity talks about how #Bitcoin might have entered a “supercycle” Bullish 🚀 pic.twitter.com/IUv3GVHwEW — Bitcoin Magazine (@BitcoinMagazine) January 12, 2026 Three Forces That Could Push Bitcoin Into A Supercycle He outlined three drivers he believes could underpin that kind of regime shift. First is “steady buy-in by institutions focused on ETFs,” which Gargava framed as persistent demand rather than episodic speculative bursts. In his telling, ETFs can function as a channel that keeps incremental capital flowing even when sentiment softens, potentially changing the market’s typical post-peak unwind. Related Reading: Bitcoin Tops $92,000 As DOJ Subpoenas Escalate Trump-Powell Fight Second is policy. Gargava pointed to “pro-crypto policies” in the US as a supportive backdrop, implying that a friendlier regulatory stance could reduce headline risk and encourage broader participation from investors and intermediaries that previously stayed on the sidelines. Third is market maturation and changing correlations. “We’re also seeing how the crypto market as a whole is maturing and deviating from the S&P 500 and precious metals,” he said. The implication is that bitcoin’s trading behavior may be becoming less captive to traditional risk-asset moves and the simple “digital gold” narrative, an evolution that could matter for positioning, hedging, and macro sensitivity. Notably, Gargava did not claim the four-year cycle is definitively broken. Instead, he presented a live question for 2026: whether bitcoin continues to follow a post-halving path that culminates in a familiar, sharp boom-and-bust pattern, or whether structural forces: ETF-driven institutional demand, a more supportive US policy tone, and a maturing market profile support a longer, steadier expansion with “shallower dips.” At press time, Bitcoin traded at $92,182. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|Bitcoin Supercycle|btc|BTC news|btc price|fidelity",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57125875,
    "published": 1768304306000,
    "title": "Truebit exploit exposes smart contract flaw behind $26M token mint",
    "body": "Truebit lost $26 million after a smart contract overflow bug let an attacker mint tokens at near-zero cost, sending the TRU price down 99%.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 57125766,
    "published": 1768304023000,
    "title": "Ukraine blocks Polymarket, classifies prediction markets as gambling",
    "body": "The move adds Ukraine to a growing list of countries, including France, Germany, the UK, Italy, Poland, Thailand and Australia, where Polymarket is already restricted.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57126291,
    "published": 1768305659000,
    "title": "Top Bullish Predictions That Put XRP Price At New All-Time Highs Above $3.8",
    "body": "XRP is trading at around $2.06 on January 13, 2026, leaving its price action a full step below the zone that capped its last rally that ended with a high of $3.65 in July 2025. However, predictions that point to XRP reclaiming that peak and then pushing into new highs above $3.8, have been on the front page of bank research notes and trader-led chart projections. Notably, various technical analyses have suggested that XRP is programmed to return back into the upper-$3s and into new price territories this year. Standard Chartered’s XRP Target Clears $3.8 XRP’s all-time high price now looks out of reach, especially considering the cryptocurrency is now struggling to leave $2 behind. At the time of writing, XRP has dropped by about 44% from its July 2025 peak of $3.65, but institutional buys from Spot XRP ETFs are still giving glimmers of hope. Related Reading: XRP Back At The Edge: Will Breaking $2 Barrier Rewrite Its History? One of the most recently notable institutional-style projections from XRP comes from Standard Chartered’s digital assets research, which lays out a multi-year path that sees XRP breaking well above the $3.8 threshold. According to analysts at the bank, XRP is slated to reach as high as $8 by the end of 2026, a level that comfortably eclipses the previous peak and implies roughly 300% upside from current levels if certain conditions hold. Interestingly, this outlook came from Geoffrey Kendrick, Standard Chartered’s Global Head of Digital Assets Research. The prediction was made based on an outlook of continued institutional adoption and strong inflows into XRP-based spot ETFs. Technical Outlooks As Ripple Heads Into A Consequential 2026 Recent technical commentary from multiple analysts has converged on a bullish bias for XRP. For instance, XRP analyst EGRAG CRYPTO pointed out a developing breakout retest structure on the monthly candlestick timeframe. According to the analyst, historical probabilities favor upside as long as XRP holds above the $1.60 to $1.40 range on higher timeframes, with long-term channel projections placing the XRP price as high as $22. For a shorter-term perspective, Crypto Feras described XRP’s recent break above $2 as a bullish reversal signal. His analysis points to $2.67 and $3.01 as the next resistance levels, areas that could open the path toward a full retest of the prior peak near $3.8 if cleared. Adding to this, ChartNerd noted that XRP’s long-term upside fractal structure is still valid despite the recent XRP price correction. Related Reading: Analyst Updates XRP Price Prediction: Why $16 Is Still On The Table These price projections are being viewed more favorably against the backdrop of Ripple’s momentum heading into the year. Ripple CEO Brad Garlinghouse recently pointed to strong progress in 2025 with examples of major acquisitions of Ripple Prime and GTreasury and a growing global licensing footprint. Now that Ripple is positioning itself for what its leadership has described as a consequential 2026, the combination of technical outlooks and company fundamentals has strengthened the narrative that XRP could be approaching a move to new all-time highs. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|Brad Garlinghouse|ChartNerd|Egrag Crypto|Feras|Geoffrey Kendrick|GTreasury|Ripple|Ripple Prime|Spot XRP ETFs|Standard Chartered|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57126910,
    "published": 1768307400000,
    "title": "ClearBank taps crypto custody firm Taurus to power stablecoin services",
    "body": "The U.K. clearing bank has selected Taurus' wallet infrastructure as it expands into digital assets and stablecoin-based payments.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|ClearBank|Taurus|Crypto Custody|Stablecoins|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57126786,
    "published": 1768306755000,
    "title": "BNB Chain targets ‘around one second’ finality with Fermi hard fork",
    "body": "BNB Chain’s Fermi hard fork goes live on Wednesday, cutting BSC block times from 0.75 seconds to 0.45 seconds and tightening fast-finality rules.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 206,
        "NAME": "FORKS",
        "CATEGORY": "FORKS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57128046,
    "published": 1768310354000,
    "title": "ZKsync sets 2026 roadmap focused on privacy and institutional adoption",
    "body": "ZKsync’s 2026 plan shifts focus from experimentation to production-ready infrastructure designed for banks, enterprises and regulated financial systems.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 143,
        "NAME": "ZK",
        "CATEGORY": "ZK"
      }
    ]
  },
  {
    "id": 57128914,
    "published": 1768312800000,
    "title": "Franklin Templeton retrofits money market funds for tokenized stablecoin market",
    "body": "Franklin Templeton is amending institutional money market funds to support stablecoin reserves and onchain cash use without launching new crypto-native products.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57128695,
    "published": 1768312320000,
    "title": "Crypto infrastructure firm pushes deeper into stablecoin payments with $250 million deal",
    "body": "The move comes as crypto projects increasingly position themselves as offering payment platforms that resemble traditional digital banks, but operate on blockchain rails.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Polygon|Polygon labs|Stablecoin|payments|acquisition|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 38,
        "NAME": "MATIC",
        "CATEGORY": "MATIC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57129243,
    "published": 1768313845000,
    "title": "CoinDesk 20 Performance Update: Internet Computer (ICP) Gains 7.4%",
    "body": "NEAR Protocol (NEAR) was also a top performer, rising 6% from Monday.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "CoinDesk Indices|CoinDesk Indices|CoinDesk 20|charts|Prices|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 82,
        "NAME": "ICP",
        "CATEGORY": "ICP"
      },
      {
        "TYPE": "122",
        "ID": 89,
        "NAME": "NEAR",
        "CATEGORY": "NEAR"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57129146,
    "published": 1768313434000,
    "title": "Monero climbs to new high of $687 as crypto surveillance tightens",
    "body": "Tightening KYC regulations and growing scrutiny on the digital economy are triggering more investor demand for privacy-preserving digital assets like Monero.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 57,
        "NAME": "XMR",
        "CATEGORY": "XMR"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57128968,
    "published": 1768313146000,
    "title": "Bitcoin spikes to $92,500 as U.S. December consumer prices rise 0.3%",
    "body": "The U.S. Consumer Price Index came in roughly in line with expectations as market participants largely expects the Fed to leave interest rates unchanged at the January meeting.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Inflation|Bitcoin News|Federal Reserve|Economy|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57129159,
    "published": 1768307908000,
    "title": "Bitcoin rose above $92,000 as BlackRock ETF moved $300 million to Coinbase Prime",
    "body": "The asset manager sent 3,290 bitcoin, worth about $298 million, along with 5,692 ether valued near $17.8 million.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin ETF|ETFs|BlackRock|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57129472,
    "published": 1768312800000,
    "title": "Cyrpto's Altcoin Fringe Sees $40 Billion Exodus In Risk Unwind",
    "body": "Altcoins — once the high-octane casino of the crypto boom — are struggling to rally for even a month.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57130260,
    "published": 1768316545000,
    "title": "Ether collapse to zero could test Ethereum’s role as finance hub, Bank of Italy economist warns",
    "body": "The study suggests that Ethereum's role in financial systems makes its token economics a concern for regulators, who may need to consider safeguards for its use in regulated finance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Ethereum News|DeFi|central banks|Italy|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57130661,
    "published": 1768317519000,
    "title": "Bitcoin attempts $92K breakout as stocks hit new record on low US CPI data",
    "body": "Bitcoin sought new weekly highs as US CPI numbers came in below expectations and President Donald Trump called for more interest-rate cuts.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57131551,
    "published": 1768320051000,
    "title": "Crypto Bill Draft Grants XRP, Solana and Dogecoin Same Legal Status as Bitcoin",
    "body": "The draft provision would treat tokens as “non-ancillary” assets, exempt from SEC securities rules, if they were in an ETF by 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|dogecoin||||Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57131482,
    "published": 1768320000000,
    "title": "As America nears 250, financial freedom shouldn’t be up for debate",
    "body": "The banking lobby’s efforts to revisit or reinterpret Congress’ decisions regarding stablecoin rewards are driven by attempts to re-litigate settled law and blunt competition after the fact, argues Blockchain Association’s Summer Mersinger.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Opinion|Stablecoin|Stablecoin legislation|US Congress|Opinion",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 57131779,
    "published": 1768320734000,
    "title": "CZ’s YZi Labs invests in trading terminal as DeFi execution takes priority",
    "body": "The eight-figure investment in Genius Trading highlights how execution-focused tools are gaining relevance as crypto trading activity spreads across blockchains.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57132170,
    "published": 1768321859000,
    "title": "What’s Going On With Bitcoin And The Stock Market? Analyst Breaks It Down",
    "body": "Bitcoin (BTC) and the stock market have experienced sharp price swings and declines since 2025. Because of this volatility, a crypto analyst has warned that the market correction could intensify further in 2026. In a detailed analysis, he outlines a bearish scenario for Bitcoin, suggesting the flagship cryptocurrency could soon face another price crash amid persistent downward pressure in the broader stock market. Analyst Warns Of Major Bitcoin And Stock Market Plunge Market analyst Doctor Profit has raised concerns about the direction of the crypto and traditional markets, warning that both Bitcoin and stocks are currently in a severe bear market. In a technical breakdown on X this Monday, the expert highlighted three major bearish setups forming simultaneously in Bitcoin. Related Reading: Why The $2.9 Billion Bitcoin Whale Buy Could Spell Doom For The Market He highlighted a massive Bearish Divergence on the weekly and monthly charts, a clear bearish flag signaling a potential drop toward $70,000, and a possible Head and Shoulder pattern that could still play out. While he acknowledged that Bitcoin could still experience short-term price increases and briefly rise toward the $97,000-$107,000 range due to strong liquidity, he said that the ultimate target remains $70,000. Doctor Profit emphasized that Bitcoin’s potential decline to $70,000 could go two ways. It could either break out of the bearish flag to that downside target or complete the Head and Shoulders pattern before reaching $70,000. He stated that he will not add new short positions at current prices but plans to increase them aggressively from $115,000 to $125,000 if Bitcoin moves into the $97,000 to $107,000 range. The analyst painted a similarly grim picture for the stock market. He said he was “ultra-bearish” on both Bitcoin and the financial system. He also noted that the banks are stressed and that forced liquidations in precious metals like Silver are creating ripples across the broader market. Additionally, Doctor Profit noted that insider activity shows clear signs of panic among investors, with record levels of selling since August 2025. Because of this, the analyst believes that the market is heading for a 2008-style crash. Consequently, he has concluded that the current market conditions are too extreme. On the bright side, Doctor Profit said that although he maintains short positions on stocks and Bitcoin, he remains bullish on Gold and Silver. He explained that any upside to the $97,000-$107,000 range will prompt him to increase his short exposure and roll spot profits for BTC from $85,000 into these positions. Crypto Markets Brace For Key US Decisions Toward the end of his analysis, Doctor Profit discussed upcoming events that could influence Bitcoin and the broader financial markets this week. He stated that the US CPI inflation forecast of 2.7% will be released this Tuesday. Other than this, the rest of the week is expected to have few market-moving events. Related Reading: Bitcoin Price Hits Crash Line, But This Time Is Not Random Doctor Profit has also highlighted January 15 as an important date because US lawmakers will vote on the CLARITY Act. He explained that if the bill passes, it will move closer to becoming law, setting clear rules and oversight for the crypto market. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bearish divergence|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|CLARITY Act|Doctor Profit|gold|Head and Shoulder Pattern|silver",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57131896,
    "published": 1768320900000,
    "title": "Bitcoin-gold correlation signals at least 50% BTC price gains by March",
    "body": "Bitcoin may take the lead over gold in 2026 as liquidity expansion and cycle fractals point to a rally that can take BTC price to $144,000.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57133395,
    "published": 1768324683000,
    "title": "​​Polygon strikes $250M deal for Coinme and Sequence in stablecoin payments push",
    "body": "Polygon Labs CEO Marc Boiron told Cointelegraph that the acquisitions position the network as a regulated payments platform built to move stablecoins onchain at scale.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 38,
        "NAME": "MATIC",
        "CATEGORY": "MATIC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57133323,
    "published": 1768324500000,
    "title": "Bitcoin shrugs off CLARITY Act delay by rallying above $93K",
    "body": "Bitcoin made new weekly highs above $93,000 despite a delay in the CLARITY Act legislation by US lawmakers. Can BTC hold its gains without a surge in ETF flows and retail investor demand?",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57134251,
    "published": 1768327208000,
    "title": "SUI Reclaims Key Support With Strength — Is $2.35 The Next Target?",
    "body": "SUI is starting to show signs of renewed strength after reclaiming a critical high-timeframe support zone. Following a sharp selloff, the price has stabilized above this level, suggesting the downside deviation may be complete. As long as this base continues to hold, momentum could gradually build, putting the $2.35 zone firmly in focus as the next upside test. SUI Reclaims Critical HTF Support After Sharp Selloff Crypto analyst Scient, in a post on X, revealed that SUI’s recent price action is unfolding exactly where it should after the sharp selloff. The market has pushed back above a key high-timeframe (HTF) support zone that previously acted as an important pivot area. This reclaim suggests the brief move below support was a deviation rather than a structural breakdown, with price now beginning to stabilize and form a base. Related Reading: SUI Isn’t Done Yet: Weekly Accumulation Holds As Buyers Reload Below From a structural perspective, the grey box highlighted on the chart represents a crucial demand and decision zone. Holding above this area keeps the bullish reclaim intact and signals that buyers remain in control at higher timeframes. However, a move back below this zone would invalidate the setup and shift focus back toward downside risk, making this area pivotal for the next move. As long as SUI continues to hold and build acceptance above this base, Scient expects a steady grind higher toward the next resistance area around $2.35. A clean push into that zone could open the door for further expansion if momentum improves. Currently, this structure is appearing across multiple assets, with many charts printing similar high-timeframe PO3 accumulation patterns. Within that broader context, SUI stands out for reclaiming key support decisively, positioning it as one of the more constructive setups in the market. SUI Leads With Early 4H Trend Break According to an update by Daan Crypto Trades, SUI was one of the first major assets to break above its 4-hour downtrend and push decisively out of the prevailing range, signaling clear relative strength. This early breakout placed SUI ahead of many peers and put it on watch as a potential leader if broader conditions improve. Related Reading: SUI Climbs Into High-Risk Territory As Wave 4 Nears Its Exhaustion Point Currently, the price is consolidating directly on top of the former resistance area, a zone that now serves as key support. Holding this level would suggest a reclaim of the range and increase the likelihood of upward continuation. At the same time, a loss of this area would risk a return to consolidation and weaken the bullish structure. Overall, SUI continues to stand out as one of the stronger-looking majors, but the next leg higher still needs confirmation through renewed momentum. Although SUI’s progress remains closely linked to Bitcoin and Ethereum, both of which are still lacking a clear direction. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "SUI|Daan Crypto Trades|High-Timeframe|HTF|PO3 Accumulation Patterns|Scient|SUI price|SUIUSD|SUIUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 96,
        "NAME": "SUI",
        "CATEGORY": "SUI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57134070,
    "published": 1768325880000,
    "title": "Bitpanda Said to Gear Up for Frankfurt IPO in First Half of 2026",
    "body": "Bitpanda GmbH, a cryptocurrency trading platform backed by billionaire Peter Thiel, is gearing up for a Frankfurt initial public offering as soon as the first half of this year, according to people familiar with the matter.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57135332,
    "published": 1768329201000,
    "title": "Eric Adams’ NYC Memecoin Crashes After Debut, Sparking Outcry",
    "body": "Eric Adams’ fondness for crypto — which during his one-term tenure mayor of New York included the launch of the ill-fated ‘NYCCoin’ — is once again attracting controversy.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57135061,
    "published": 1768329093000,
    "title": "Stablecoin yield debate looks like 'parallel banking system,' JPMorgan CFO says",
    "body": "JPMorgan's Jeremy Barnum said the bank would compete with crypto offerings but warned that stablecoin yield products look like banks without the same regulation.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Market Structure Legislation|JPMorgan Chase|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57135087,
    "published": 1768327947000,
    "title": "PsyopAnime Meme up 30X! Are Memes back? Monero ATH! Interview W/ Joseph Chalom, CEO of Sharplink",
    "body": "Crypto majors are green; BTC +1.5% at $92,000; ETH +1% at $3,130, SOL +2% at $142; XRP +1% to $2.06. DASH (+60%), IP (+30%) and XMR (+13%) led top movers; XMR hit another new ATH at $680 (now $640). Gold and Silver hit new ATHs again in the wake of the Powell investigation. The US Senate released the draft Crypto Market Clarity Act, including limits on stablecoin rewards. Senator Warren pressed the SEC over inclusion of crypto in 401ks arguing they expose retirees to too much risk. Vitalik Buterin warned crypto needs better decentralized stablecoins, citing governance capture and inflation risks. World Liberty Financial launched a crypto lending platform built around its USD1 stablecoin, attracting ~$20M. BitGo filed for a U.S. IPO targeting a ~$2B valuation as custody assets surpassed $100B. Tennessee regulators ordered Polymarket, Kalshi, and Crypto.com to halt sports prediction markets and refund users, escalating a multi-state legal fight.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 57,
        "NAME": "XMR",
        "CATEGORY": "XMR"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57136271,
    "published": 1768332607000,
    "title": "XRP Is At An Unique Moment In History: Developer Calls End Of Suppression",
    "body": "An XRP Ledger ecosystem developer behind the meme coin DROP is drawing attention after predicting a sharp shift in XRP’s relative value versus bitcoin this year, framing it as the start of a new “price discovery” phase for the token. Bird, who posts under @Bird_XRPL, wrote on X yesterday that “5,000 XRP will be worth 1 Bitcoin in 2026,” then clarified his math with a specific price path in mind. “I said I think 5,000 XRP will be worth 1 Bitcoin,” he added. “For example 5,000 * $27 (XRP) = $135K (BTC).” While the post reads like a headline-grabbing forecast, the structure of Bird’s claim is a ratio trade: XRP outperforming BTC enough that 5,000 XRP could purchase one bitcoin. By anchoring the example to $27 XRP and a $135,000 BTC, Bird effectively argued that the market’s next leg higher could involve a meaningful repricing of XRP’s utility narrative rather than a simple beta move to bitcoin. Related Reading: Get Ready For An XRP Price Explosion Once This Happens; Analyst XRP Entering ‘Price Discovery’ Phase The call arrived alongside a series of posts linking XRP’s setup to broader risk-asset conditions and upcoming US macro catalysts. Bird argued that “above $2.70 $XRP opens the path to all time highs and beyond,” presenting that level as a technical inflection point. “Take a breath. Stay present. Remember this moment,” he wrote. “This is the end of a 7–8 year suppression and the beginning of true price discovery.” Bird’s longer thesis, posted on Jan. 11, focused less on short-term trading and more on a personal allocation framework that treats XRP as a long-duration hold. “XRP should be considered as part of your life saving plans,” he wrote, contrasting bank deposit yields with inflation drag. Related Reading: Ripple Builds ‘Next Amazon’ With XRP At The Center, Says Crypto CEO “Most people keep their money in banks earning around 4–6% a year and feel comfortable doing so, but they rarely factor in inflation. Over time, the buying power of the US dollar and the British pound for example has fallen so much, meaning your money often grows on paper while quietly losing value in the real world.” He then positioned XRP as an alternative store of value tied to expanding usage rather than fiat purchasing power. “That’s where XRP comes in. XRP has spent years suppressed by legal uncertainty, yet during that time the technology continued to mature. Now we have clarity, and we can clearly see what’s being built,” Bird wrote, pointing to “cross border payments, institutional adoption, stablecoins like RLUSD, and real world assets being tokenised on chain.” Bird framed the trade-off as custody and counterparty risk versus upside participation. “That’s why I personally treat XRP as a long term savings vehicle rather than a short term trade,” he wrote. “You can self custody it, store it on a cold wallet, and remove reliance on banks altogether.” Bird also tied the timing of his forecast to what he described as a convergence of market structure and policy headlines. “It’s a massive week for XRP,” he wrote, citing CPI and PPI as volatility events and highlighting that the US market structure bill is scheduled to drop on Thursday. “The charts are aligning. The macro is aligned. If this pushes in our favour and we clear $2.70+, an all time high can come very fast for XRP people!” At press time, XRP traded at $2.06. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|Ripple|xrp|xrp news|XRP Price|XRP Price Analysis",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57136113,
    "published": 1768332062000,
    "title": "Feds Seek Forfeiture of $200K in USDT Tied to Tinder ‘Pig Butchering’ Scam",
    "body": "Law enforcement seized $200,000 belonging to a Massachusetts victim who wired more than $500,000 into a suspected fake crypto trading platform.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57136526,
    "published": 1768333234000,
    "title": "SOL chart shows ‘masterpiece’ setup to $190 after key trend turns bullish",
    "body": "Steady ETF inflows, a bullish cup and handle chart pattern and improving sentiment across the total crypto market could propel Solana price to $190.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57137894,
    "published": 1768337073000,
    "title": "Strive, Semler Stocks Fall After Shareholders Approve Bitcoin Treasury Acquisition",
    "body": "Semler Scientific shareholders approved Strive's acquisition in an all-stock deal, but both Bitcoin treasury stocks dropped on the news.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57137957,
    "published": 1768339757000,
    "title": "Yield-bearing stablecoins risk 'dangerous' parallel banking system: JPMorgan CFO",
    "body": "Jeremy Barnum told JPMorgan shareholders that yield-bearing stablecoins risk creating a parallel banking system without the safeguards of traditional regulation.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 57137929,
    "published": 1768339737000,
    "title": "XRP Potential: Four Q1 2026 Triggers That Might Propel Price Beyond $8",
    "body": "As the cryptocurrency market enters the new year, optimism around XRP is growing, particularly following Standard Chartered’s positive outlook for the altcoin. As NewsBTC reported two weeks ago, the bank projects a significant surge for the token, forecasting a potential new all-time high of $8. Recently, market analyst Sam Daodu has identified four key catalysts that could drive XRP toward this major milestone, potentially in the first quarter of the year. What Could Drive Prices Higher? The first catalyst stems from the imminent passage of the CLARITY Act, the crypto market structure bill expected to be marked up on January 15. Daodu asserted that the clarity provided by this new bill could significantly enhance institutional participation in the XRP market. In addition, Ripple, the firm behind the altcoin, recently received conditional approval from the Office of the Comptroller of the Currency (OCC) to launch Ripple National Trust Bank, which will be a federally supervised trust institution. Related Reading: New Hope For Crypto: Senators Introduce Blockchain Regulatory Certainty Act Moreover, seven spot XRP exchange-traded funds (ETFs) are now trading in the US, boasting a combined assets under management (AUM) exceeding $2 billion and locking up 777 million XRP tokens. Another significant factor in XRP’s potential rise is the growth of the RLUSD stablecoin, which has achieved a market capitalization of $1.33 billion and ranks third among US-regulated stablecoins poised for compliance under the GENIUS Act. As banks begin deploying RLUSD across various payment corridors, activity on the XRP Ledger is expected to surge. Network fees paid in XRP create a direct link between the growth of stablecoins and a gradual reduction in XRP supply, turning utility into ongoing demand. Finally, the GENIUS Act, signed into law by President Trump in July 2025, established clear regulations for US stablecoins. This clarity extends to Europe, Asia, and emerging markets, allowing for smoother cross-border expansion. Bullish XRP Scenario Analyzing these factors, Daodu suggests a “bull case” scenario in which XRP could reach between $8 and $10. This depends heavily on sustained institutional demand and consistent inflows into exchange-traded funds. He noted in the report that if ETF inflows maintain the $300 to $500 million monthly rate observed in late 2025, it could lead to an additional 750 million to 1.25 billion XRP being locked by mid-year. Related Reading: Coinbase Mulls Exiting Support For Crypto Market Structure Bill Ahead Of January 15 Deadline Under these conditions, Daodu concluded that XRP has the potential to not only surpass the $8 threshold but to extend its gains into the $10 range as supply constraints exert greater influence on pricing. At the time of writing, the fifth-largest cryptocurrency on the market was trading at $2.13, marking a 3.7% increase on Tuesday. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|crypto|crypto market|crypto news|Ripple|RLUSDT stablecoin|xrp|XRP $8|XRP ETFs|xrp news|XRP Price|XRP Price Forecast|XRP price news|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57137920,
    "published": 1768339301000,
    "title": "How a battle with bankers tarnished crypto's market structure bill near the finish line",
    "body": "The crypto industry contends that Wall Street giants stood behind community banks to undercut digital competitors before they could get a major legislative win.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "News Analysis|Coinbase|Brian Armstrong|Crypto lobbying|crypto legislation|U.S. Senate|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57137944,
    "published": 1768338077000,
    "title": "Crypto Privacy Coins Are Going Nuts: Will It Last?",
    "body": "Monero breaks into all-time-high territory while Dash records its largest move since October. The privacy sector is heating up—here's what's driving it.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|monero|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 57,
        "NAME": "XMR",
        "CATEGORY": "XMR"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57137924,
    "published": 1768338059000,
    "title": "Why XRP Is Gearing Up For A Massive Week",
    "body": "Crypto pundit Bird has highlighted why this week could be a massive one for XRP. This comes as market investors keep an eye on key macro events such as the U.S. CPI and also the upcoming CLARITY Act markup. Why This Is A Massive Week For XRP In an X post, Bird stated that this is a massive week as the Russell 2000 has rallied to new all-time highs (ATHs). He explained that every previous time that this has happened, XRP has gone on to record a major run. The analyst also alluded to macro data dropping this week, which could also impact the XRP price. Related Reading: Analyst Outlines The Bull Case For XRP And Why Price Will Hit All-Time High Soon Bird noted that the CPI and PPI inflation data, which drops this week, always injects volatility into the crypto market. The crypto pundit also stated that the long-awaited markup of the market structure bill (CLARITY Act) is scheduled for this Thursday. This is significant because the legislation could provide legal clarity for XRP and other crypto assets. The pundit remarked that the charts and macro are aligning for XRP. He predicted that if these developments push the altcoin above $2.70, it could quickly rally to a new all-time high (ATH). Bird asserted that if this doesn’t happen, then the market is likely manipulated, as he believes that XRP and the broader crypto market should be recording significant gains right now. It is worth noting that XRP rallied to as high as $2.3 at the start of the year but has since lost most of those gains, though the altcoin is still up over 10% year-to-date (YTD). XRP could be one of the crypto assets that benefits most from the passage of the CLARITY Act, as it would boost Ripple’s operations, which could in turn drive more adoption for XRP. XRP Could Rally To $2.26 From Here Crypto analyst CasiTrades has predicted that XRP could rally to $2.26 from its current level. In an X post, she stated that she expects the altcoin to reach this level to complete a subwave 2 and that the next wave up is critical. The analyst warned that if the price action stays corrective, then there could be a sharp rejection that sends the altcoin into a subwave 3 down. XRP could break the .5 support in the process and target the $1.65 macro support. However, if XRP’s bounce has the strength to break above $2.41 and flip it into support, this could invalidate the scenario down to $1.65. CasiTrades remarked that this is the key decision in the market, even as market participants keep an eye on the macro fundamentals. Related Reading: Analyst Breaks Down Why Investors will Make More Money With XRP Than Bitcoin At the time of writing, the XRP price is trading at around $2.06, down in the last 24 hours, according to data from CoinMarketCap. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|altcoin|Bird|CasiTrades|CLARITY Act|CoinMarketCap|CPI|PPI|Ripple|xrp|xrp news|XRP Price|XRPUSD|xrpusdt|Year-To-Date|YTD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57138532,
    "published": 1768341817000,
    "title": "Senate's Warren: WLFI-tied bank application should be halted until Trump divests",
    "body": "Government-ethics questions still hang over the U.S. Senate's plans to vote on the crypto market structure bill, and Warren is raising a related argument.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|World Liberty Financial|Donald Trump|Elizabeth Warren|crypto legislation|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57139100,
    "published": 1768343366000,
    "title": "Former Mayor Eric Adams Hijacked 'NYC Token' Concept, Startup Claims",
    "body": "Former NYC Mayor Eric Adams' token is off to a shaky start, with fresh allegations levied against the project.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57138851,
    "published": 1768342465000,
    "title": "Crypto-friendly Old Glory Bank plans Nasdaq listing through SPAC",
    "body": "The “digital-first“ bank created in 2022 is set to go public on the Nasdaq, subject to shareholder and regulatory approvals.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 57139336,
    "published": 1768344112000,
    "title": "Strive tumbles 12% as reverse stock split stumps investors despite Semler acquisition",
    "body": "Upon completion, the combined firm would hold nearly 13,000 BTC, surpassing the holdings of Tesla and Trump Media & Technology Group.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Bitcoin News|Bitcoin Treasury Reserve Asset|Semler scientific|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57140628,
    "published": 1768347785000,
    "title": "Bitcoin Hits Two-Month High as CPI Steadies and Short Covering Accelerates",
    "body": "Bitcoin’s rally drew fuel from short covering as steady inflation data and the start of earnings season reinforced trader expectations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57141391,
    "published": 1768349980000,
    "title": "Bitcoin climbs to two-month high of $96,240 as altcoins surge and shorts get squeezed",
    "body": "Bitcoin climbed above $96,000 for the first time since November, triggering over $500 million in liquidations as altcoins outperformed and traders rushed to cover bearish bets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Markets|altcoin|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57142270,
    "published": 1768352429000,
    "title": "Futures Frenzy Pushed Crypto Exchange Volume To Nearly $80 Trillion In 2025",
    "body": "According to reports, global crypto exchange trading volume jumped to over $79 trillion in 2025, driven largely by futures and perpetual contracts. That surge pushed derivatives to claim most of the market’s activity, while spot trading grew at a much slower pace. Related Reading: XRP Ledger May Get A Tokenized Gold Upgrade, Web3 Founder Reveals Spot Volume Climbs While Futures Explode Spot trading finished the year near $18.6 trillion, an increase of roughly 9% versus the prior year. But futures and perpetuals were the real story: they totaled close to $62 trillion, making up about 77% of combined exchange volume. That heavy tilt toward derivatives shifted where liquidity and daily turnover were concentrated. Exchanges At The Center Of Activity Binance stood out as the top contributor to both segments. Reports show Binance handled roughly $25.4 trillion in Bitcoin perpetual futures alone — about 42% of the top 10 platforms’ Bitcoin perpetual volume — and continued to hold large stablecoin balances relative to peers. Other major venues such as OKX, Bybit and Bitget formed a secondary tier for futures trading. 2025 crypto exchange activity in review. Spot volume reached $18.6T (+9% YoY) while perpetuals surged to $61.7T (+29%), with Binance dominating spot, BTC perps, liquidity, and reserves. Growth is derivative-led, and market power continues to concentrate at the top. pic.twitter.com/Om8udJJ9Qv — CryptoQuant.com (@cryptoquant_com) January 12, 2026 Derivatives Data Variations Not all trackers measure markets the same way. Some platforms reported even higher figures for derivatives in 2025 — CoinGlass, for example, tallied about $85.7 trillion in crypto derivatives volume for the year. Differences in counting methods, which products are included, and which venues are covered explain much of the gap between sources. Why Futures Dominated Trading Traders used futures to take positions, hedge exposures, and respond quickly to price moves. That activity raised daily turnover and boosted the headline totals. While spot trading reflects direct buying and selling of coins, futures multiply notional flow because a single contract can represent a much larger notional value than a spot trade. The concentration of trading on a handful of platforms has drawn attention from watchdogs in recent years. Regulators have warned that heavy reliance on a small set of exchanges could pose risks if those venues suffer outages or enforcement actions. The data for 2025 renewed those concerns because a large share of the new volume was funneled through the biggest operators. Related Reading: Dogecoin Bulls Watch $0.28 As Breakout Signals Stack Up What This Means Going Forward Based on reports, the derivatives market’s dominance could continue unless spot demand picks up substantially or regulation alters trading incentives. Institutional interest, products tied to regulated markets, and changes to stablecoin rules are all possible factors that could reshape volumes next year. Analysts caution that headline totals will keep varying with methodology and which datasets are used. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|Binance|bitcoin|crypto|derivatives|futures|trading",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57142918,
    "published": 1768354187000,
    "title": "Perfect storm of activity sees record surge in new Ethereum wallets",
    "body": "An average of 327,000 wallets were created each day on average over the past week, likely pushed by a flurry of financial activity combined with recent network upgrades.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57143516,
    "published": 1768356006000,
    "title": "Bitcoin Decouples From Global Liquidity: Analyst Says Quantum Threat Behind It",
    "body": "Bitcoin has decoupled from the global M2 supply for the first time. Here’s what could be the reason for it, according to the founder of Capriole Investments. Bitcoin Has Diverged From The Global M2 Supply Trend In a new post on X, Capriole Investments founder Charles Edwards has talked about how Bitcoin has decoupled from the global liquidity flows recently. Below is the chart cited by Edwards, which compares the year-over-year (YoY) percentage change in BTC to that in the global M2 supply. As displayed in the graph, Bitcoin’s YoY change flatlined over 2025 while the total money supply of the world’s major economies witnessed growth, indicating BTC diverged from traditional liquidity flows. Related Reading: Bitcoin HODLer Selloff Ending? LTH Outflows Decline In the past, the cryptocurrency’s YoY percentage change has generally showcased a similar trajectory to the global M2 supply. “This is the first time Bitcoin has decoupled from money supply and global liquidity flows,” noted the analyst. What’s the reason behind this new trend? According to Edwards, it’s the threat posed by quantum computing to the network. Quantum computers are hypothesized to have the capability to break the cryptocurrency’s cryptography, with wallets from the blockchain’s early days being especially vulnerable. It’s uncertain when quantum machines will find a breakthrough, but the Capriole founder believes BTC passed into a “Quantum Event Horizon” in 2025. “The timeframe to a non-zero probability of a quantum machine breaking Bitcoin’s cryptography is now less than the estimated time it will take to upgrade Bitcoin,” said Edwards. In theory, a party with a sufficiently advanced quantum computer could break into old dormant wallets and dump the coins on the market. This would not only directly impact BTC’s price but could also undermine broader trust in the cryptocurrency itself. “Money is repositioning to account for this risk accordingly,” explained the analyst. One X user countered that most investors don’t seem to agree with Edwards’ quantum timeline, suggesting that the market would be unlikely to decouple based on a view not widely shared. “If you listen to all in bitcoin maxis on X you would think that,” Edwards replied to the user. “If you talk to real capital allocators and Bitcoin OGs in the space 7+ years in private – they are all considering this risk.” Related Reading: Solana Price Jumps, But Network Adoption Remains Weak In some other news, Bitcoin spot exchange-traded funds (ETFs) have continued to face weak demand recently, as data from SoSoValue shows. From the above chart, it’s visible that last week saw $681 million exit from the US Bitcoin spot ETFs. The new week has started with inflows so far, but it only remains to be seen whether they will continue in the coming days. BTC Price At the time of writing, Bitcoin is floating around $92,100, up nearly 2% in the last 24 hours. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin Quantum|Bitcoin Quantum Threat|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57143365,
    "published": 1768355339000,
    "title": "Warren seeks delay to World Liberty bank bid until Trump cuts ties",
    "body": "“We have never seen financial conflicts or corruption of this magnitude,” said Senator Elizabeth Warren on US President Donald Trump's links to World Liberty Financial.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57144104,
    "published": 1768357656000,
    "title": "Spot flows drive Bitcoin surge as analysts tip $100K run next",
    "body": "“Retail FOMO” may ramp up in the coming days if Bitcoin returns to $100,000, according to crypto sentiment platform Santiment.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57144773,
    "published": 1768359618000,
    "title": "The NYC Token Crash: Allegations Of Rug Pull After $2.5 Million Liquidity Withdrawal",
    "body": "Former New York City Mayor Eric Adams is facing significant backlash after the crash of his newly launched cryptocurrency, the NYC Token, shortly after its debut on Monday. The token initially soared to a market cap of $580 million but has since fallen sharply to approximately $133 million. Eric Adams Under Fire In a promotional video, Adams declared, “We’re about to change the game. This thing is about to take off like crazy.” However, the excitement was short-lived as evidence surfaced suggesting that the steep decline in value resulted from a significant sell-off involving a user connected to the NYC Token’s development team. Related Reading: New Hope For Crypto: Senators Introduce Blockchain Regulatory Certainty Act Blockchain analysis platform Bubblemaps flagged potentially concerning activity linked to the NYC Token. Notably, a wallet associated with the token’s deployer withdrew around $2.5 million in liquidity when the token peaked. Although about $1.5 million was returned after the token’s value dropped by 60%, approximately $900,000 remains unreturned. This has led users on social media platform X (formerly Twitter) to accuse Adams of orchestrating a crypto rug pull. Adams, who has been an outspoken proponent of cryptocurrency, stated during a Monday event that some of the funds generated by the NYC Token would be directed towards nonprofits focused on combating antisemitism and “anti-Americanism.” Additionally, he expressed intentions to use the proceeds to “teach our children about embracing blockchain technology.” The NYC Token’s official website states there is a total supply of one billion tokens in circulation, and details reveal that 10 percent of profits are allocated to the team’s activities, though the identities of those involved were not disclosed. NYC Token Team Responds In response to criticism, the NYC Token team acknowledged the liquidity withdrawal, stating, “Given the overwhelming support and demand for the token at launch, our partners had to rebalance the liquidity.” They added, “We’re in it for the long haul!” However, there remains uncertainty about the details surrounding the token’s launch, with a recently listed entity, C18 Digital, associated with the project. Delaware corporation records show that C18 Digital was incorporated on December 30, 2025. Related Reading: Coinbase Mulls Exiting Support For Crypto Market Structure Bill Ahead Of January 15 Deadline Typically, when a cryptocurrency launches, developers create a liquidity pool using various assets, such as Circle’s USDC or Solana (SOL), to allow users to buy and sell the new token. The NYC Token took a different approach by establishing a one-sided liquidity pool comprised solely of the token itself. As users began purchasing the token, they injected liquidity into the pool using USDC, which was followed by the significant withdrawal of $2.5 million. This tactic, described by analyst Vaiman, can be more subtle than direct token sell-offs. Following the viral reports of the alleged rug pull, a new account associated with the NYC Token announced that additional funds had been injected into the liquidity pool. Featured image from CNN, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto|crypto market|crypto news|cryptocurrency|Eric Adams|Mayor Eric Adams|NYC Token|NYC Token crash|NYC Token launch|NYC Token news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57144598,
    "published": 1768359187000,
    "title": "Bitcoin Price Rips Higher, $100K Narrative Gathers Pace",
    "body": "Bitcoin price started a fresh increase above $92,500. BTC is trading above $95,000 and attempting a close for another increase to $100k. Bitcoin started a decent increase above $92,000 and $94,500. The price is trading above $95,000 and the 100 hourly Simple moving average. There was a break above a contracting triangle with resistance at $92,000 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move up if it stays above the $94,000 zone. Bitcoin Price Gains Over 4% Bitcoin price managed to stay above the $90,500 support and started a fresh increase . BTC was able to settle above $92,000 and $92,500. There was a break above a contracting triangle with resistance at $92,000 on the hourly chart of the BTC/USD pair. The bulls were able to push the price above $93,500. Finally, the price spiked above $96,000. A high was formed at $96,476, and the price is now consolidating gains above the 23.6% Fib retracement level of the recent wave from the $89,995 swing low to the $96,476 high. Bitcoin is now trading above $95,000 and the 100 hourly Simple moving average . If the price remains stable above $94,500, it could attempt a fresh increase. Immediate resistance is near the $96,000 level. The first key resistance is near the $96,500 level. The next resistance could be $96,800. A close above the $96,800 resistance might send the price further higher. In the stated case, the price could rise and test the $98,000 resistance. Any more gains might send the price toward the $98,500 level. The next barrier for the bulls could be $99,000 and $100,000. Another Drop In BTC? If Bitcoin fails to rise above the $96,000 resistance zone, it could start another decline. Immediate support is near the $95,000 level. The first major support is near the $94,500 level. The next support is now near the $93,200 zone or the 50% Fib retracement level of the recent wave from the $89,995 swing low to the $96,476 high. Any more losses might send the price toward the $92,500 support in the near term. The main support sits at $91,500, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $95,000, followed by $94,500. Major Resistance Levels – $96,000 and $96,800.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57145037,
    "published": 1768360412000,
    "title": "Rattled retail retreats to Bitcoin, Ether after October crash",
    "body": "Retail traders fled to Bitcoin and Ether after the October crypto crash last year, adding to an already tough year for altcoins.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57144898,
    "published": 1768359924000,
    "title": "Galaxy Compares DeFi Provisions in Crypto Bill to Patriot Act Surveillance",
    "body": "Galaxy said that new Treasury authorities in a Senate draft could mark the largest surveillance expansion since 2001.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 57145332,
    "published": 1768361300000,
    "title": "Ethereum Price Rips Higher by 8%, Forcing Bears to Reassess",
    "body": "Ethereum price started a major increase above the $3,160 resistance. ETH is now consolidating gains and might dip toward the $3,250 zone. Ethereum started a downside correction after a major rally to $3,375. The price is trading above $3,300 and the 100-hourly Simple Moving Average. There was a break above a major bearish trend line with resistance at $3,140 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move up if it stays above the $3,250 zone. Ethereum Price Revisits $3,350 Ethereum price remained stable above $31,20 and started a fresh increase, like Bitcoin . ETH price rallied above the $3,160 and $3,200 resistance levels. There was a break above a major bearish trend line with resistance at $3,140 on the hourly chart of ETH/USD. The bulls even pumped the price above $3,300. A high was formed at $3,374, and the price is now correcting some gains. Ethereum price is now trading above $3,300 and the 100-hourly Simple Moving Average . If the bulls can protect more losses below $3,300 or the 23.6% Fib retracement level of the recent wave from the $3,061 swing low to the $3,374 high, the price could attempt another increase. Immediate resistance is seen near the $3,340 level. The first key resistance is near the $3,380 level. The next major resistance is near the $3,420 level. A clear move above the $3,420 resistance might send the price toward the $3,500 resistance. An upside break above the $3,500 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $3,550 resistance zone or even $3,650 in the near term. Downside Correction In ETH? If Ethereum fails to clear the $3,340 resistance, it could start a fresh decline. Initial support on the downside is near the $3,300 level. The first major support sits near the $3,250 zone. A clear move below the $3,250 support might push the price toward the $3,220 support and the 50% Fib retracement level of the recent wave from the $3,061 swing low to the $3,374 high. Any more losses might send the price toward the $3,180 region. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI – The RSI for ETH/USD is now above the 50 zone. Major Support Level – $3,250 Major Resistance Level – $3,340",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57145531,
    "published": 1768361268000,
    "title": "Bitcoin Climbs to Two-Month High of $96,000 on Macro Tailwinds",
    "body": "Bitcoin reached a two-month high, continuing a cautious climb higher in January as geopolitical uncertainty enhances its appeal.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57147347,
    "published": 1768366840000,
    "title": "Bitcoin Nears ‘Historic’ Technical Test As Price Eyes $93,500 Barrier – What’s Next?",
    "body": "As Bitcoin (BTC) breaks out of key resistance levels, an analyst suggests that the cryptocurrency is positioning itself for a move to higher levels and a retest of a crucial technical area in the coming weeks. Related Reading: Monero (XMR) Hits New $610 All-Time High – Veteran Trader Shares Silver-Like Setup Bitcoin Approaching Make-Or-Break Test On Tuesday, Bitcoin surged 2.5% to retest the $93,500 resistance level for the first time in a week. The cryptocurrency has been hovering between the $84,000 to $93,500 price range for three months and has failed to turn this level into support multiple times. Analyst Rekt Capital recently noted that the flagship crypto is near a “historic” test as it has begun to form “another technically decisive region” just above current price levels. The market watcher explained that BTC is approaching its dynamic Bull Market Exponential Moving Average (EMA) cluster, where the 50-week EMA and 21-week EMA are getting closer. This key cluster, currently located between the $96,000 and $97,500 levels, has historically been tested before a “meaningful crossover,” with the Bitcoin price overextending beyond the cluster. However, this has usually been followed by an unsuccessful confirmation of this region as support. “When that happens, the crossover itself often follows the bearish price event, rather than causing it, with the EMA cluster flipping into resistance from the underside and leading to downside continuation,” the analyst detailed. Notably, past cycles reveal that the 50-week and 21-week EMAs can move very close together, Rekt Capital wrote, emphasizing that they can even overlap for prolonged periods before a decisive crossover. Currently, Bitcoin has yet to retest and overextend beyond the two EMAs, but its historical performance suggests that it will likely occur. Moreover, BTC’s price is “positioning itself in a way that could allow for a springboard higher, potentially enabling a test of this cluster in the weeks ahead. The key question is timing.” BTC Price Breaks Out Of Key Resistances In his analysis, the market observer discussed BTC’s recent performance, which has seen a structural change despite the sideways price action. Last week, the cryptocurrency’s price closed above its multi-week downtrend, which has been serving as a major resistance point since late November. This marks “a small but notable technical milestone” as Bitcoin now holds above the November and December highs in the weekly timeframe, treating the previous resistance as support. In addition, the mid-zone of its local range, around the $90,500 level, is now “almost perfectly confluent with the former Downtrend, meaning the Downtrend that last week rejected price is beginning to act as layered support instead.” Therefore, if Bitcoin continues to hold the mid-range region, the price should be able to challenge higher levels and find a path toward $100,000. Rekt Capital added that, unlike previous retests, the most recent rejection from the crucial $93,500 resistance was significantly shallower and shorter, suggesting that it was getting weaker. Related Reading: Top Bullish Predictions That Put XRP Price At New All-Time Highs Above $3.8 Now, the flagship crypto has successfully retested the downtrend breakout area as support and momentarily reclaimed the $93,500 resistance, surging above the $94,000 area once again. Ultimately, BTC will need to hold this area and close the week above $93,500 to “kickstart a breakout from the Weekly Range as per previous green circles,” the analyst concluded. As of this writing, BTC trades at $94,334, a 2.6% increase in the weekly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|bitcoin breakout|Bitcoin correction|Bitcoin EMA|Bitcoin price analysis|btc|btc rejection|BTCUSDT|crypto analyst|Crypto Market Recovery|Crypto trader",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 57,
        "NAME": "XMR",
        "CATEGORY": "XMR"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57147523,
    "published": 1768367328000,
    "title": "Solana (SOL) Escapes Resistance Zone, Rally Pressure Intensifies",
    "body": "Solana started a fresh increase above the $142 zone. SOL price is now consolidating above $142 and might aim for more gains above the $150 zone. SOL price started a fresh upward move above the $142 and $145 levels against the US Dollar. The price is now trading above $142 and the 100-hourly simple moving average. There is a bullish trend line forming with support at $140 on the hourly chart of the SOL/USD pair (data source from Kraken). The pair could extend gains if it clears the $150 resistance zone. Solana Price Starts Fresh Surge Solana price started a decent increase after it settled above the $135 zone, like Bitcoin and Ethereum . SOL climbed above the $140 level to enter a short-term positive zone. The price even smashed the $142 resistance. The bulls were able to push the price above $145. A high was formed at $148, and the price is now consolidating gains. There was a minor decline below the 23.6% Fib retracement level of the recent upward move from the $138 swing low to the $148 high. Solana is now trading above $142 and the 100-hourly simple moving average. Besides, there is a bullish trend line forming with support at $140 on the hourly chart of the SOL/USD pair. On the upside, the price is facing resistance near $148. The next major resistance is near the $150 level. The main resistance could be $155. A successful close above the $155 resistance zone could set the pace for another steady increase. The next key resistance is $162. Any more gains might send the price toward the $170 level. Downside Correction In SOL? If SOL fails to rise above the $148 resistance, it could start another decline. Initial support on the downside is near the $144 zone. The first major support is near the $143 level or the 50% Fib retracement level of the recent upward move from the $138 swing low to the $148 high. A break below the $143 level might send the price toward the $140 support zone and the trend line. If there is a close below the $140 support, the price could decline toward the $135 support in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is gaining pace in the bullish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is above the 50 level. Major Support Levels – $144 and $140. Major Resistance Levels – $148 and $150.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Technical analysis|Sol|Solana|solbtc|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57147631,
    "published": 1768366841000,
    "title": "Bitcoin surges above $95,000 as ether, solana, cardano jump 8% on investor optimism",
    "body": "Lower inflation eased pressure on bond yields and improved liquidity conditions, a setup that has historically favored crypto and other risk assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57148138,
    "published": 1768368815000,
    "title": "‘Concerning trend’: Impersonation scams swell 1400% in 2025",
    "body": "Crypto security experts said a good way to counter scams that rely on deceiving victims is to be skeptical of every unsolicited message and interaction.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57148670,
    "published": 1768370426000,
    "title": "Monero (XMR) Rockets 51% To New ATH, But Watch Out For FOMO",
    "body": "Monero (XMR) has witnessed a sharp rally to a new record during the last few days, but social media suggests FOMO could be brewing in the market. Monero Has Shot Up To A New All-Time High Bitcoin and most other cryptocurrencies have been locked in consolidation recently, but Monero has been an outlier, with its price breaking away with a strong surge. Related Reading: Bitcoin Decouples From Global Liquidity: Analyst Says Quantum Threat Behind It Below is a chart that showcases how the asset’s recent performance has looked. The sharp rally has led to new all-time highs (ATHs) for the privacy-focused token, with the latest one coming earlier in the past day around $695. XMR has retraced a bit since this new high, but it’s still in a weekly profit of 51%, which is significantly higher than the returns of other top assets. For perspective, Bitcoin and Ethereum have seen returns of +1% and -2% in this period, respectively. Fellow privacy coin Zcash (ZEC) was flying earlier, but the asset has faced a steep 23% drop during the same window. Generally, rallies of the order that Monero has seen attract attention from traders, and data would confirm that the same has been true for the latest one as well. XMR Has Seen A Peak In Social Dominance Recently According to data from analytics firm Santiment, the Monero Social Dominance witnessed a spike recently. This indicator keeps track of the percentage of the Social Volume associated with the top 100 tokens that a given cryptocurrency is responsible for. The Social Volume here refers to a measure of the total number of posts/comments/threads on the major social media platforms that contain mentions of a given asset. In other words, it tells us about the amount of discussion that a particular coin is receiving from social media users. As such, the Social Dominance contains information about how the degree of talk surrounding a cryptocurrency compares against that of the top 100 coins combined. Here is a chart that shows the trend in this metric for Monero since the start of 2026: As displayed in the above graph, the Monero Social Dominance saw a huge spike on Sunday as the asset’s rally took off, suggesting social media interest in the asset shot up. Historically, a rapid surge in the Social Dominance has often corresponded to Fear Of Missing Out (FOMO) developing among traders, which is something that tends to not end well for rallies. Related Reading: Bitcoin HODLer Selloff Ending? LTH Outflows Decline Despite the crowd excitement, however, XMR has only continued to go up since the spike, setting new ATHs. Given the past pattern with digital asset markets, though, it only remains to be seen how long the coin can sustain its move. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Monero|monero|Monero ATH|Monero Development Activity|Monero Social Dominance|XMR|xmrusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 57,
        "NAME": "XMR",
        "CATEGORY": "XMR"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57148620,
    "published": 1768370312000,
    "title": "XRP zooms 6% higher on surge in trading activity",
    "body": "While XRP's recent rally stands out in a mixed crypto market, it remains below longer-term resistance levels.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57148423,
    "published": 1768369746000,
    "title": "Why Ethereum Could Be Ready to Outperform Bitcoin in 2026",
    "body": "Ethereum could narrow its performance gap with Bitcoin in 2026 as capital rotates and on-chain activity improves, Decrypt was told.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57148731,
    "published": 1768370555000,
    "title": "Stablecoin yields create ‘dangerous’ parallel bank system: JPMorgan exec",
    "body": "JPMorgan chief financial officer Jeremy Barnum told investors in an earnings call that stablecoin yields are a “dangerous and undesirable thing.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  }
]