[
  {
    "id": 58173545,
    "published": 1771468403000,
    "title": "Bitcoin Price Slips In Choppy Trade As Bears Tighten Grip",
    "body": "Bitcoin price corrected gains and tested the $66,000 support. BTC is now consolidating losses and might decline further below the $65,500 zone. Bitcoin is struggling to recover losses and moving lower below $67,200. The price is trading below $67,200 and the 100 hourly simple moving average. There is a declining channel forming with resistance at $68,000 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might dip again if it trades below the $66,000 and $65,500 levels. Bitcoin Price Dips Again Bitcoin price failed to remain stable above the $68,000 zone. BTC started a fresh decline and traded below the $67,500 support zone. There was a push below $67,000. The price dipped below the 76.4% Fib retracement level of the upward move from the $65,072 swing low to the $70,935 high. Finally, the price found some support near the $66,000 zone. It is now consolidating losses and there is a declining channel forming with resistance at $68,000 on the hourly chart of the BTC/USD pair. Bitcoin is now trading below $67,200 and the 100 hourly simple moving average . If the price remains stable above $66,000, it could attempt a fresh increase. Immediate resistance is near the $67,350 level. The first key resistance is near the $68,000 level. A close above the $68,000 resistance might send the price further higher. In the stated case, the price could rise and test the $68,800 resistance. Any more gains might send the price toward the $69,500 level. The next barrier for the bulls could be $70,000 and $70,500. More Losses In BTC? If Bitcoin fails to rise above the $68,000 resistance zone, it could start another decline. Immediate support is near the $66,000 level or the 83.2% Fib retracement level of the upward move from the $65,072 swing low to the $70,935 high. The first major support is near the $65,500 level. The next support is now near the $65,000 zone. Any more losses might send the price toward the $64,200 support in the near term. The main support now sits at $63,500, below which BTC might struggle to recover in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $66,000, followed by $65,000. Major Resistance Levels – $67,350 and $68,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58173870,
    "published": 1771468734000,
    "title": "Hyperliquid launches DeFi lobby amid ‘critical time’ for US policy",
    "body": "The Hyperliquid Policy Center says it will advocate on Capitol Hill for policies, particularly those related to perpetual derivatives and blockchain infrastructure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58176138,
    "published": 1771473314000,
    "title": "Warren warns crypto bailout would enrich Trump family biz: Report",
    "body": "Senator Elizabeth Warren said it was “deeply unclear” if the US government has plans to intervene in the current Bitcoin selloff.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58176787,
    "published": 1771474720000,
    "title": "XRP Price Downtrend Deepens With Limited Signs Of Relief",
    "body": "XRP price extended losses and traded below $1.4320. The price is now consolidating losses but faces hurdles near $1.4750 and $1.50. XRP price started another decline and traded below the $1.450 zone. The price is now trading below $1.450 and the 100-hourly Simple Moving Average. There is a declining channel forming with resistance at $1.480 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move down if it stays below $1.50. XRP Price Extends Decline XRP price failed to stay above $1.480 and extended its decline, like Bitcoin and Ethereum . The price declined below $1.4650 and $1.450 to enter a short-term bearish zone. The price even extended losses below $1.4320. A low was formed at $1.4102, and the price is now consolidating losses. There was a minor upward move toward the 23.6% Fib retracement level of the downward move from the $1.5119 swing high to the $1.4102 low. The price is now trading below $1.450 and the 100-hourly Simple Moving Average. If there is a fresh recovery move, the price might face resistance near the $1.450 level. The first major resistance is near the $1.4620 level or the 50% Fib retracement level of the downward move from the $1.5119 swing high to the $1.4102 low. The main resistance could be $1.480. There is also a declining channel forming with resistance at $1.480 on the hourly chart of the XRP/USD pair. A close above $1.480 could send the price to $1.50. The next hurdle sits at $1.5250. A clear move above the $1.5250 resistance might send the price toward the $1.550 resistance. Any more gains might send the price toward the $1.5880 resistance. The next major hurdle for the bulls might be near $1.60. More Losses? If XRP fails to clear the $1.480 resistance zone, it could start a fresh decline. Initial support on the downside is near the $1.4165 level. The next major support is near the $1.410 level. If there is a downside break and a close below the $1.410 level, the price might continue to decline toward $1.40. The next major support sits near the $1.3850 zone, below which the price could continue lower toward $1.350. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $1.4165 and $1.4100. Major Resistance Levels – $1.4500 and $1.4800.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58177809,
    "published": 1771476681000,
    "title": "Bitcoin can bounce higher — but the market still lacks fuel for a real run",
    "body": "Recent trading shows bitcoin staging short-lived rallies that quickly fade amid a stronger dollar, hawkish Fed signals and persistent selling pressure.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58178320,
    "published": 1771477717000,
    "title": "Coinbase lets XRP, ADA and dogecoin holders borrow up to $100,000 without selling",
    "body": "The exchange is widening access to its Morpho-powered lending product after a wave of liquidations earlier this month, giving holders of major retail tokens a way to borrow USDC without selling.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58178322,
    "published": 1771477690000,
    "title": "Solana (SOL) Pressured Below Key Levels, Further Drop Possible?",
    "body": "Solana failed to stay above $86 and corrected gains. SOL price is now below $84 and remains at risk of more losses below $80. SOL price started a downside correction below $86 against the US Dollar. The price is now trading below $85 and the 100-hourly simple moving average. There is a bearish trend line forming with resistance at $84 on the hourly chart of the SOL/USD pair (data source from Kraken). The pair could extend losses if it dips below the $80 zone. Solana Price Dips Further Solana price failed to stay above $90 and started a downside correction, like Bitcoin and Ethereum . SOL dipped below $88 and $86 to enter a short-term bearish zone. There was a move below the 61.8% Fib retracement level of the upward wave from the $76.55 swing low to the $91.20 high. The price even tested the $80 support. Besides, there is a bearish trend line forming with resistance at $84 on the hourly chart of the SOL/USD pair. Solana is now trading below $84 and the 100-hourly simple moving average. On the upside, the price is facing resistance near the $83 level. The next major resistance is near the $84 level. The main resistance could be $85.60. A successful close above the $85.60 resistance zone could set the pace for another steady increase. The next key resistance is $88. Any more gains might send the price toward the $92 level. More Losses In SOL? If SOL fails to rise above the $85 resistance, it could start another decline. Initial support on the downside is near the $80 zone and the 76.4% Fib retracement level of the upward wave from the $76.55 swing low to the $91.20 high. The first major support is near the $79 level. A break below the $79 level might send the price toward the $76.50 support zone. If there is a close below the $76.50 support, the price could decline toward the $72 support in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is losing pace in the bullish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is below the 50 level. Major Support Levels – $80 and $79. Major Resistance Levels – $85 and $88.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Technical analysis|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58178064,
    "published": 1771477201000,
    "title": "Bitcoin Doesn’t Get A Macro ‘Bailout’ This Time: Alden Warns Of Gradual QE",
    "body": "Bitcoin investors hoping for a familiar macro rescue may be reading the room wrong. In an interview with Coin Stories host Nathalie Brunell, macro analyst Lyn Alden argued that the next policy turn is more likely to resemble a slow balance-sheet creep than the kind of “nuclear print” that has historically juiced risk assets, leaving bitcoin to compete largely on its own fundamentals and narrative pull. Alden framed the current cycle as unusually underwhelming, not just in price terms but in participation. She noted that sentiment “is worse than 2022,” and attributed the malaise to a missing retail bid, a lack of “alt season,” and a broader crypto market that “kind of run out of narratives.” Bitcoin, she said, topped out at $126,000, below her own bar for a satisfying cycle. “Sometimes they give their time frames so we can just see if it hits that time frame or not,” Alden said, pushing back on the reflexive call that every drawdown forces the Fed’s hand. “Every kind of down tick in stocks or every kind of down tick they say well the we’re going to have to print soon. But really the Fed only cares mainly about the liquidity of the treasury market and the interbank lending market […] even stocks going down 10, 20, 30% is not really going to be a catalyst.” Related Reading: Is Jane Street Manipulating Bitcoin? The Viral Theory Explained Brunell pointed to comments she said came from Fed Chair Jerome Powell about “slowly” expanding the balance sheet, with purchases starting around $40 billion in short-end Treasury bills, far from the trillions some bitcoin bulls anchor on. Alden’s response was blunt: the plumbing doesn’t demand a shock-and-awe response right now. “Mainly because the conditions are not such that they would need a big print in the near future,” she said. “There are scenarios that can absolutely result in a big print or a nuclear print […] but when you kind of run the numbers of how much debt is coming out, how levered or unlevered banks are, they just don’t really need a lot of printing. A little printing gets them a long way.” In Alden’s telling, QE1-scale interventions were tied to a very specific setup: an overlevered banking system with low cash ratios and acute private-sector balance sheet stress. Today, she argued, bank cash ratios are “still pretty high,” and absent a COVID-scale disruption or an escalation in war or “financial war”, the base case is incrementalism. Bitcoin Still Has To Win Attention That matters because, in Alden’s framework, gradual balance-sheet expansion is supportive but not decisive for bitcoin. The era where “micro doesn’t matter at all” is reserved for true emergency stimulus and she doesn’t see that as the near-term setup. “Not a ton, I think,” Alden said when asked what gradual QE means for bitcoin. “It’s supportive […] but Bitcoin still has to compete on its own merits for investor attention. So, you know, basically it has to compete with Nvidia […] with everything out there that people can own.” Related Reading: Bitcoin Capitulation Or Buy Zone? What On-Chain Data Shows Right Now She tied the muted cycle to “mediocre” topline demand and a capital-market landscape where AI-linked equities and even precious metals have offered competition for mindshare. Sovereigns “didn’t really show up,” she said, and retail largely stayed sidelined, leaving “the corporate institutional side” and higher-net-worth brokerage buyers, aided by ETFs, as the main marginal bid. Alden also downplayed the idea that derivatives and ETFs are the chief culprit behind a capped upside, even if they can “inflate” synthetic supply for a time. The bigger issue, she argued, is simply that the demand impulse hasn’t been strong enough to overwhelm a now-larger, more liquid market. Looking forward, Alden expects bottoms to form as “fast money gets out” and coins rotate to “strongly held hands,” with price more likely to grind than V-recover. On the upside, she pointed to a potential setup where AI trades eventually peak, bitcoin sits “cheap for a while” in tight hands, and only “a marginal amount of new demand” is needed to restart reflexivity, possibly alongside continued buying from bitcoin treasury companies. For now, her core warning is that this cycle may not be saved by policy theatrics. If bitcoin is going to reassert itself, Alden suggested, it will be less about waiting for a macro bailout and more about whether enough investors still want “self-custodial […] undebasable savings,” even when other assets are stealing the spotlight. At press time, Bitcoin traded at $67,556. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|Lyn Alden",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58179151,
    "published": 1771479219000,
    "title": "AI Disruption Could Cut Creator Earnings by Nearly 25% by 2028, UNESCO Warns",
    "body": "A new UNESCO report projects steep revenue losses for music and screen creators as lawyers say the fair use doctrine is buckling under AI’s scale.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 58179389,
    "published": 1771479843000,
    "title": "Bitcoin is about to log its longest losing streak since 2022 as geopolitical nerves hit risk trades",
    "body": "Geopolitical tensions lift the U.S. dollar and crude prices, adding pressure to an already fragile crypto market.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Glassnode|U.S. Dollar|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58179883,
    "published": 1771480843000,
    "title": "XRP On The Spotlight As Arizona Advances Landmark Digital Asset Bill",
    "body": "Arizona moved closer this week to setting up a public reserve of cryptocurrency after lawmakers pushed a bill forward that names XRP among the tokens that could be held. Related Reading: What Bitcoin Rout? Michael Saylor Unfazed, Teases New Accumulation The push came after a committee vote that cleared one of the early hurdles for Senate Bill SB1649, and the mention of XRP has already drawn attention from traders and public officials who track crypto policy. Committee Vote Moves Bill Forward According to reports, the measure won a 4–2 vote on February 16 and now heads toward the next steps in the chamber where it started. The vote came in a session run by the Arizona Senate Finance Committee, which backed language allowing the state treasurer to hold, custody, and invest digital assets that end up in state hands. Reports note the measure would cover coins seized in law enforcement actions or surrendered to the state, and it would authorize modern custody options and regulated exchange-traded vehicles for safekeeping. What The Fund Would Hold The plan is straightforward on paper: create a fund, transfer qualifying assets into a managed reserve, and let officials use advanced custody tools to manage risk. Reports say XRP is on the list of eligible assets. That inclusion puts a spotlight on a token that has faced regulatory uncertainty in the past but also has a vocal group of supporters who argue it has a use case in cross-border payments. Some people see the move as a step toward routine public-sector dealings with cryptocurrencies; other observers warn it could raise legal, accounting, and operational questions that are not yet fully answered. Market And Policy Reactions Traders reacted with a mix of caution and optimism. A handful of market watchers noted that any state-level acceptance of a specific token can nudge sentiment, even if the actual impact on supply and demand is limited. Legal experts will likely scrutinize the bill’s text closely if it advances, especially around custody rules and how the fund values and reports holdings. There are also practical matters: who will audit these assets, how will they be insured, and what governance rules will guide when and how the fund can buy, sell, or hold tokens. Related Reading: Bitcoin Falls, But Robert Kiyosaki Says He’s ‘Excited’ And Buys More XRP Price Action At the time of writing, XRP was trading at $1.46, up 0.7% and 6.7% in the daily and weekly frames. Featured image from Gemini, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|Arizona|bitcoin|crypto|Digital Asset Reserve Bill|Ripple|xrp|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58181537,
    "published": 1771483694000,
    "title": "Ether, XRP, Solana slide in crypto retreat despite tech-led lift in Asia stocks",
    "body": "Major tokens stayed under pressure even as risk sentiment improved in equities, with a firmer dollar and Fed rate uncertainty keeping crypto rallies short-lived.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58181737,
    "published": 1771484451000,
    "title": "The Altcoin Exodus: Trading Volumes Halve As Capital Flees To Bitcoin $65,000 Fortress",
    "body": "The altcoin market has faced persistent difficulties since 2024, with many assets still struggling to recover from the euphoric highs reached during the 2021 bull cycle. Despite intermittent rallies, broader momentum has remained weak, reflecting reduced speculative appetite, tighter liquidity conditions, and a gradual shift in investor preference toward more established crypto assets. This prolonged underperformance has left a large portion of the altcoin sector trading well below historical peaks, reinforcing cautious sentiment across the market. Related Reading: Is Bitcoin Supply Moving To Strong Hands? Whale Data Suggest Structural Shift A recent CryptoQuant analysis provides additional context by examining capital rotation patterns during Bitcoin’s latest corrective phase. After a sharp pullback, Bitcoin has entered a consolidation range roughly between $65,000 and $72,000, an area where significant activity from whales, long-term holders, and institutional participants appears to be concentrated. Such consolidation zones often attract strategic accumulation rather than speculative altcoin exposure. Historically, deep corrections or late-stage bear phases tend to trigger capital migration toward Bitcoin, while altcoins experience reduced inflows. Binance trading volume data — segmented into BTC, ETH, and other altcoins — highlights this dynamic clearly. As Bitcoin reclaimed levels above $60,000, a noticeable shift in volume distribution emerged, suggesting investors increasingly prioritized Bitcoin over higher-risk altcoin exposure. Bitcoin Dominance Rises As Altcoin Trading Activity Weakens Altcoin trading activity has weakened noticeably during the current corrective phase, reinforcing the broader shift toward defensive positioning within the crypto market. According to a recent analyst assessment, Bitcoin trading volumes on Binance regained dominance on February 7, accounting for roughly 36.8% of total exchange activity. This leadership has persisted since then, suggesting sustained investor preference for the relative stability and liquidity associated with Bitcoin during uncertain conditions. In comparison, altcoins represented about 35.3% of total trading volume, while Ethereum accounted for approximately 27.8%. Although these figures still reflect meaningful participation, altcoins have experienced the sharpest contraction in activity. Back in November, altcoins represented around 59.2% of Binance trading volumes, but by February 13 their share had dropped to roughly 33.6%, marking close to a 50% decline in market participation. Similar patterns have appeared during prior corrective phases, including April 2025, August 2024, and late 2022 near the end of the previous bear cycle. Periods of heightened uncertainty typically drive capital toward Bitcoin, which continues to function as the sector’s primary liquidity anchor. This recurring rotation highlights Bitcoin’s role as a perceived safer crypto asset when volatility rises and speculative appetite diminishes. Related Reading: Bitcoin Miners Pull 36K BTC From Exchanges In Weeks: What Comes Next? Altcoin Market Cap Weakens As Risk Appetite Remains Limited The total crypto market capitalization excluding the top 10 assets continues to reflect persistent weakness, highlighting the fragile state of the broader altcoin segment. After peaking near the 2025 highs, this metric entered a sustained corrective phase, with recent price action hovering around the $170–180 billion range. This zone has acted as a tentative support area, but the lack of a strong rebound suggests that risk appetite remains subdued across smaller-cap assets. Technically, the structure shows the altcoin market trading below key moving averages, indicating that momentum still favors sellers. Previous recovery attempts have repeatedly stalled near dynamic resistance, reinforcing the idea that capital rotation toward major assets — particularly Bitcoin — continues to dominate market behavior. Elevated volatility during the most recent declines also points to fragile liquidity conditions. Related Reading: Ethereum Whale Losses Mirror Past Bottoms: Accumulation Continues Despite Pressure Volume dynamics further support this cautious interpretation. Spikes in selling activity accompanied the latest pullback, suggesting distribution rather than accumulation. While stabilization appears to be developing in the short term, there is limited evidence of sustained inflows returning to altcoins. Historically, similar configurations have often preceded prolonged consolidation phases rather than immediate recoveries. Unless broader market liquidity improves or Bitcoin dominance weakens, the altcoin market may remain structurally constrained despite occasional short-term rebounds. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|altcoin analysis|Altcoin Bearish|altcoin news|Altcoin Trading Volume|altcoins|Atcoin|bitcoin|OTHERS",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58181587,
    "published": 1771484101000,
    "title": "Why address poisoning works without stealing private keys",
    "body": "Address poisoning works by cluttering your transaction history with fake entries, tricking you into sending funds to a scammer’s address by mistake.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58182439,
    "published": 1771485919000,
    "title": "Ledn raises $188m with first bitcoin backed bond sale in asset backed market",
    "body": "Crypto lender packages more than 5,400 bitcoin collateralized loans into first asset backed securities transaction of its kind.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Ledn|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58184996,
    "published": 1771490872000,
    "title": "Bitcoin ETFs see $133M outflows as sentiment stays in ‘extreme fear’",
    "body": "US-listed spot Bitcoin ETFs have shed $238 million this week, setting up the first five-week outflow streak since March 2025.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58185663,
    "published": 1771492180000,
    "title": "Ledn raises $188M in first Bitcoin-backed loan securitization: Bloomberg",
    "body": "The Bitcoin lender reportedly packaged thousands of Bitcoin-backed consumer loans into rated bonds, giving investors a new way to take crypto‑linked risk without holding BTC.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58186983,
    "published": 1771495207000,
    "title": "Bitcoin ETFs Hold Billions as BTC Slips Below $70K, Analysts Warn of Potential Free Fall",
    "body": "Bitcoin’s (BTC) struggle to hold key price levels is raising fresh concerns across crypto markets, even as spot exchange-traded funds continue to control tens of billions of dollars in assets. Related Reading: Bitcoin May Gain If AI Job Losses Trigger Bank Stress, Hayes Says The largest cryptocurrency has fallen back below the psychologically important $70,000 mark, trading around $68,000 after weeks of steady selling pressure and weakening momentum. While institutional products still hold significant capital, analysts say the market structure shows growing downside risk rather than stability, with technical patterns, whale activity, and macroeconomic uncertainty all pointing to a fragile outlook. BTC's price trends to the downside on the daily chart. Source: BTCUSD on Tradingview Bearish Chart Signals and Whale Activity Intensify Pressure Technical indicators suggest the correction may not be finished. Market analysts highlight a developing “bear pennant” formation, a pattern that typically appears after sharp declines and often precedes another leg lower. A confirmed breakdown could push Bitcoin toward the $55,000–$60,000 range, representing roughly a 20% decline from current levels. On-chain data from CryptoQuant shows rising inflows into exchanges from large holders. The ratio tracking major transactions moving onto trading platforms recently reached elevated levels, historically associated with increased sell-side pressure. Analysts interpret this as preparation for distribution rather than accumulation. Additional data suggests the market has entered a “stress phase,” with losses mounting among newer investors while long-term holders remain profitable. Similar setups in past cycles often preceded extended consolidation or deeper corrections before recovery. Bitcoin ETFs Remain Large, But Not Necessarily Bullish Despite price weakness, U.S. spot Bitcoin ETFs still hold about $85 billion in assets, equivalent to more than 6% of the circulating supply. However, analysts caution that ETF resilience may not reflect strong bullish conviction. Research indicates a large portion of ETF ownership is dominated by market makers and arbitrage funds maintaining hedged positions rather than directional bets. Funds linked to asset managers such as BlackRock continue to see activity, but flows have recently turned negative, marking several consecutive weeks of net outflows. Institutional positioning is also shifting elsewhere. Filings show Harvard University reduced part of its Bitcoin ETF exposure late last year, highlighting a more cautious stance among some large investors. Macro Uncertainty And Sentiment Keep Markets On Edge Broader financial conditions are adding to pressure. Bitcoin has remained closely correlated with technology stocks and risk assets, both of which have reacted to expectations of prolonged higher interest rates. Upcoming Federal Reserve signals and economic data releases are likely to shape the short-term direction. Sentiment indicators tracked by Matrixport show extreme fear dominating markets, a condition that sometimes precedes rebounds but can also accompany late-stage corrections. Related Reading: Bitcoin Falls, But Robert Kiyosaki Says He’s ‘Excited’ And Buys More Meanwhile, corporate holders such as Strategy Inc continue accumulating Bitcoin despite volatility, underscoring a divide between long-term institutional conviction and short-term market weakness. Cover image from ChatGPT, BTCUSD chart on Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58189681,
    "published": 1771500361000,
    "title": "The bank of the future: 77% of stablecoin users say they’d open a wallet with their bank today",
    "body": "YouGov survey published by Coinbase and BVNK also found that 71% of users would use a stablecoin-linked debit card as a means of spending them.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Stablecoins|Wallets|banks|YouGov|Surveys|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58190511,
    "published": 1771502183000,
    "title": "Coinbase CEO Says Quantum Computing 'Solvable Issue' for Crypto",
    "body": "Brian Armstrong downplayed fears that quantum computing will break blockchain encryption, pointing to Coinbase’s new advisory council.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58190612,
    "published": 1771502125000,
    "title": "Robinhood’s L2 testnet hits 4M transactions in first week, CEO says",
    "body": "Robinhood plans a mainnet launch later this year as the testnet hosts experimental assets, including stock-style tokens.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58190476,
    "published": 1771501949000,
    "title": "Hacker returns $21M in Bitcoin stolen from South Korean authorities: Report",
    "body": "Local media reported that the stolen 320 Bitcoin was returned to a wallet controlled by authorities, with the unknown hacker seemingly having a sudden change of heart.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58192365,
    "published": 1771506011000,
    "title": "SUI Eyes Price Recovery As Institutional Exposure Expands With Grayscale, Canary ETF Launches",
    "body": "As the first two spot SUI exchange-traded funds (ETFs) debut in the US, some analysts have suggested that the cryptocurrency could be preparing for a massive recovery after bouncing from a crucial support level. Related Reading: BNB Chain’s AI Agent Ecosystem Surges As Crypto Markets Bleed SUI’s Institutional Momentum Expands On Wednesday, Grayscale and Canary Capital debuted the first two spot SUI ETFs, offering direct, regulated exposure to the cryptocurrency while allowing investors to benefit from staking rewards. Notably, Grayscale expanded its lineup of crypto-based products by converting its Grayscale SUI Trust into a spot ETF, which is now live on NYSE Arca under the GSUI ticker. According to the announcement, the fund is designed to “provide investors with exposure to SUI and its staking activity through an ETP, offering a convenient way to gain exposure to a network designed for scalable, real-world applications, and the next generation of digital experiences.” Krista Lynch, Senior Vice President, ETF Capital Markets, at Grayscale, affirmed that “GSUI’s launch on NYSE Arca marks an important milestone in expanding the range of exchange-traded products tied to the Sui ecosystem, including exposure to potential staking rewards.” Meanwhile, Canary Capital launched the first US spot ETF for the cryptocurrency on Nasdaq under the SUIS ticker. The Canary Capital Staked SUI ETF “brings that exposure into a regulated, exchange-traded structure, providing investors access to SUI and its staking reward potential,” stated Steven McClurg, CEO at Canary Capital. “Canary continues to deliver on its strategy to translate emerging blockchain networks into accessible, exchange-traded investment vehicles, and we’re pleased to add SUIS in the category,” he continued. The Sui Foundation highlighted that the latest launches added to a series of institutional milestones in the ecosystem, including multiple Sui-linked investment products and strategic initiatives from firms like 21Shares, Bitwise, and Franklin Templeton. SUI Preparing For Major Price Recovery? Amid the spot ETFs’ debut, SUI’s price continued its sideways movement under the $1.00 barrier, trading between $0.93 and $0.98 throughout the day. Ali Martinez suggested that the cryptocurrency could be preparing for a move to higher levels, noting it recently retested a key support level. As Martinex explained, SUI tested and bounced from a two-year rising support line after the early February market crash. This ascending trendline has previously triggered major rallies. According to the chart, the last two times the cryptocurrency hit this support line, it jumped 365% and 850% rallied respectively, with the latest sending its price toward its $5.35 all-time high (ATH) in the following months. To the analyst, if SUI holds the $0.80 area, “history suggests upside could follow. And this time, fundamentals are lining up too.” He pointed out that the growing institutional exposure and the technical structure alignment could set up a base “for something much bigger.” Related Reading: Crypto Funds Bleed $173M As Outflows Extend To Fourth Week – Report Similarly, market observer Bitcoinsensus highlighted SUI’s macro structure, which signals a potential leg up toward new highs. Per the post, the altcoin “has been moving up in a very technical structure” since its launch, repeating a 5-wave up followed by a 3-wave correction. The chart shows that the price is likely near the end of the C-wave of its corrective move, suggesting a new impulsive 5-wave structure could develop in the coming months. “If this trend continues, we could see SUI reach prices above 10$ per coin,” the analyst concluded. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|Canary Capital|crypto market correction|Crypto Market Recovery|grayscale|Grayscale SUI trust|GSUI|Spot SUI ETFs|SUI|SUI ETF|SUI Foundation|SUI price analysis|SUI price prediction|SUIS|SUIUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 96,
        "NAME": "SUI",
        "CATEGORY": "SUI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58192557,
    "published": 1771506000000,
    "title": "Blockchain data may predict drug overdose surges months in advance: Chainalysis",
    "body": "Larger crypto payments to darknet markets were linked to higher stimulant hospitalizations and deaths in Canadian health data.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58192364,
    "published": 1771505873000,
    "title": "Bundesbank President Wants Euro-Pegged Stablecoins to Prevent Dollarization",
    "body": "ECB Governing Council member Joachim Nagel argued a wholesale CBDC and euro-pegged stablecoins could boost the euro’s international role.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 58191610,
    "published": 1771503915000,
    "title": "Illicit networks accounted for $141 billion of the trillions of stablecoin volume in 2025",
    "body": "Sanctions-related activity accounted for 86% of illicit crypto flows last year, with most of those flows routed through stablecoin platforms, according to TRM Labs.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|TRM Labs|Stablecoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58193205,
    "published": 1771507679000,
    "title": "Figure is debuting its tokenized stock along with upsized $150 million offering",
    "body": "The FGRD token represents common shares of the company issued natively onchain with instant settlement and built-in lending tools.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Figure Technologies|Tokenized Assets|tokenized stocks|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 58193248,
    "published": 1771507179000,
    "title": "SocGen taps XRP Ledger for euro stablecoin distribution",
    "body": "The French banking giant expands its euro stablecoin to a third blockchain, deepening institutional use of XRPL for compliant digital assets and onchain settlement",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58195351,
    "published": 1771512045000,
    "title": "Bitcoin miner Bitdeer tumbles 17% as $300 million convertible note offering spurs dilution fears",
    "body": "The Singapore-based bitcoin miner and AI data center firm is raising capital to repurchase notes and fund expansion.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Bitcoin Miners|Bitdeer|Data Centers|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58196639,
    "published": 1771514256000,
    "title": "Dash Evolution chain integrates Zcash Orchard privacy pool",
    "body": "Initial features will support basic transfers, setting the stage for subsequent upgrades, including privacy features for tokenized real-world assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      }
    ]
  },
  {
    "id": 58197929,
    "published": 1771517115000,
    "title": "What's the Best AI Model to Run Your Business? The One That Lies Best, Apparently",
    "body": "GLM-5 beat Claude in business simulation by pretending to be American. Claude fell for it, shared strategies with competitors, and lost. Wall Street's AI deployment just got more complicated.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 58197771,
    "published": 1771516800000,
    "title": "Anchorage Digital offers non-U.S. banks a stablecoin stand-in for correspondent banking",
    "body": "Crypto bank Anchorage Digital is launching U.S.-compliant stablecoin rails for international banks, offering faster movement of assets across borders.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Anchorage Digital|stablecoin regulation|crypto legislation|Banking|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 58198935,
    "published": 1771519191000,
    "title": "Fed's Neel Kashkari calls crypto 'utterly useless,' dismisses stablecoins as 'buzzword salad'",
    "body": "The Minneapolis Fed president said stablecoins don’t beat Venmo and argued crypto fails basic real-world tests.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Federal Reserve|Neel Kashkari|Stablecoins|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58198565,
    "published": 1771518344000,
    "title": "Bitcoin price forecast sees new breakdown as crypto liquidates over $200M",
    "body": "Bitcoin fed into \"extreme bearish sentiment\" as a tight BTC price range fueled daily crypto liquidations of over $200 million.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 17841996,
    "published": 1771520043000,
    "title": "What Is Base? The Ethereum Layer-2 Network Launched by Coinbase",
    "body": "Base is designed to house Coinbase’s on-chain products and provide an open ecosystem for dapps, onboarding “billions of users.”",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Technology Guides",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58199776,
    "published": 1771520750000,
    "title": "CME targets May launch for 24/7 crypto derivatives trading",
    "body": "As both the SEC and CFTC explore 24/7 trading hours for US capital markets, several traditional financial exchanges file to expand hours in anticipation of such a move.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58199653,
    "published": 1771520516000,
    "title": "U.S. Federal Reserve researchers sing praises of prediction markets",
    "body": "A deep look at predictions on Kalshi called such platforms valuable to policymakers and researchers, according to a new Fed paper.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Economic data|Prediction Markets|Kalshi|Federal Reserve|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 58200213,
    "published": 1771521552000,
    "title": "Warren Presses Treasury, Fed to Rule Out Bitcoin Bailout As Prices Tumble: Report",
    "body": "The longtime crypto critic warned against using taxpayer dollars to rescue investors and firms amid the current market slide.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58200211,
    "published": 1771521550000,
    "title": "CME Will Make Crypto Derivatives Trading 24/7 in May as Wall Street Eyes Similar Goal",
    "body": "Top derivatives marketplace CME will adopt 24/7 crypto trading on May 29, pending regulatory approval. The CFTC has indicated it supports such moves.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58199920,
    "published": 1771520974000,
    "title": "Dow And SP500 Face A Liquidity Drain: 3 Charts That Show What’s Next",
    "body": "The market is going to get bumpy going forward, because the hyperscalers building out the AI future are going to suck up all available liquidity from every source.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 58200830,
    "published": 1771522841000,
    "title": "Billionaires Want Your Medical Records — And They Don’t Want To Pay For Them",
    "body": "The question is not whether it will be used — it is who owns it, who benefits from it, and whether patients are participants or simply sources.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|Innovation|/innovation|money|money|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58201142,
    "published": 1771522747000,
    "title": "Susquehanna-backed Blockfills up for sale after $75 million lending loss",
    "body": "The Chicago-based company said it was temporarily suspending client deposits and withdrawals last week due to recent market and financial conditions.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|BlockFills|Crypto Lending|mergers and acquisitions|Susquehanna international group|Exclusive|Breaking News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 58201441,
    "published": 1771524027000,
    "title": "Eric Trump reitrates claim bitcoin is just getting started on its road to $1 million",
    "body": "U.S. President Donald Trump’s son Eric Trump acknowledged bitcoin’s volatility but said its upside potential outweighs the risks as prices hover below $70,000.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Eric Trump|Bitcoin Price|World Liberty Financial|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58202388,
    "published": 1771525820000,
    "title": "SUI Drops Below $1 Despite Launch of First U.S. Staking ETFs by Grayscale and Canary",
    "body": "The debut of the first U.S.-listed staking ETFs tied to SUI was expected to mark a turning point for the token. Instead, the crypto slipped below the $1 level, showing the gap between growing institutional access and weakening market sentiment. Related Reading: Goldman Sachs CEO Says US Must Codify How Crypto ‘Will Operate’ On February 18, asset managers Grayscale Investments and Canary Capital launched competing spot staking ETFs, offering investors exposure to SUI alongside on-chain staking rewards. The products began trading on NYSE Arca and Nasdaq, bringing the Sui blockchain into regulated U.S. markets. Despite the milestone, SUI continued its downward trend, trading below $0.95 at the time of reporting after losing roughly 40% over the past month and extending a broader yearly decline. SUI's price trends to the downside on the daily chart. Source: SUIUSD on Tradingview Staking ETFs Introduce a New Investment Structure The newly launched funds, GSUI and SUIS, differ from earlier crypto ETFs by integrating staking directly into their structure. Rather than passively tracking price movements, the funds hold spot SUI tokens and stake a portion of their holdings to generate network rewards, which are reflected in the funds’ net asset value. This model allows investors to gain yield without managing wallets or validator infrastructure. Analysts view the structure as part of a broader shift toward “yield-bearing” crypto investment products that combine price exposure with blockchain participation. The ETFs also signal expanding institutional interest in the Sui Network, a layer-1 blockchain developed by former Meta engineers and designed for decentralized finance, gaming, and digital marketplace applications. Weak Market Data Overshadows Institutional Momentum Market indicators suggest traders remain cautious despite the ETF launches. Derivatives data shows open interest declining by nearly 30%, indicating reduced speculative activity and thinner liquidity. Trading volumes have also softened, reflecting lower participation compared with earlier market cycles. Network fundamentals have weakened alongside price performance. Total value locked (TVL) in Sui’s DeFi ecosystem has retreated to around $565 million, returning to levels seen before last year’s market rally. Analysts say declining capital inflows have limited the immediate impact of institutional developments. Technical indicators show SUI consolidating near key support between $0.88 and $0.90. A failure to hold this range could expose the token to deeper losses toward $0.70, while a recovery above $1.10–$1.20 would be needed to signal a potential trend reversal. Token Unlock and Market Outlook Additional pressure may come from an upcoming token unlock scheduled for March 1, when roughly 43 million SUI tokens are expected to enter circulation. Increased supply could introduce short-term volatility, particularly if demand from ETF inflows remains limited. Related Reading: Stellar Price Forecast: XLM Stabilizes After Dip, March Recovery Toward $0.20 in Focus The launch of staking ETFs represents a structural step forward for institutional adoption. However, SUI’s price action suggests that broader market conditions, liquidity trends, and network growth will likely determine whether the new products can translate into sustained recovery. Cover image from ChatGPT, SUIUSD chart on Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|SUI|SUI Network|SUIUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 96,
        "NAME": "SUI",
        "CATEGORY": "SUI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58202970,
    "published": 1771526884000,
    "title": "Accenture Is Tracking Whether Employees Use AI—And Promotions Are on the Line",
    "body": "Consulting giant Accenture is monitoring senior staff logins to AI tools and tying career advancement to adoption rates—all while AI threatens to eliminate jobs.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58203428,
    "published": 1771527502000,
    "title": "Bitcoin ETFs still sit on $53B in net inflows despite recent outflows: Bloomberg",
    "body": "Heavy outflows haven’t erased the success of spot Bitcoin ETFs, which still hold $53 billion in cumulative inflows, according to Bloomberg analyst Eric Balchunas.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58204566,
    "published": 1771530083000,
    "title": "‘Sell Bitcoin Now,’ Peter Schiff Warns, Predicts $20,000 Target On Breakdown",
    "body": "Economist and longtime Bitcoin (BTC) critic Peter Schiff has issued a fresh warning to cryptocurrency investors, arguing that the world’s largest digital asset could face a steep decline if a key price level fails. Schiff Predicts 84% Bitcoin Crash In a Thursday social media post on X, Schiff said that a break below $50,000 would likely open the door to a much deeper selloff. “If Bitcoin breaks $50K, which looks likely, it seems highly likely it will at least test $20K,” he wrote. Related Reading: Revealed: The Biggest Bitcoin Holders Of 2026, According To Arkham Data A drop to that level, he noted, would represent an 84% fall from Bitcoin’s all‑time high of $126,000 reached last October. While acknowledging that Bitcoin has experienced similar collapses in the past, Schiff argued that the current environment is different. He pointed to what he described as unprecedented hype, higher leverage in the system, greater institutional ownership and a much larger overall market capitalization. “Sell Bitcoin now!” he urged. BTC ‘Not Fit’ As Reserve Asset Schiff, who has long championed gold as a superior store of value, has repeatedly questioned Bitcoin’s role in the global financial system. In a previous interview, he said BTC is unsuitable as a reserve asset for central banks, contending that its volatility would make it impractical to hold in large quantities without causing market instability. Related Reading: Goldman Sachs CEO Says US Must Codify How Crypto ‘Will Operate’ According to Schiff, although some sovereign wealth funds and governments have taken limited positions in Bitcoin‑related products, those allocations remain small and are often motivated by performance pressure rather than deep conviction. He has also expressed skepticism about the durability of institutional demand. Schiff predicted that professional investors’ interest in Bitcoin could wane over time and warned that more recent entrants to the market may ultimately suffer losses if prices retreat sharply. At the time of writing, the leading cryptocurrency is trading at $66,900, with the largest resistance level at $70,000 and support floors at $65,800 and $62,800, limiting additional losses in the near term. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|BTCUSDT|crypto market|crypto news|peter schiff",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58205291,
    "published": 1771531370000,
    "title": "Ethereum Treasury Sharplink Reports Growing ETH Holdings, Institutional Investment",
    "body": "Sharplink is shaking up its branding as it reports additional Ethereum holdings and a rising number of institutional investors.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58205179,
    "published": 1771531227000,
    "title": "Can Litecoin Price Bounce To $285? This Trend Maps Out 5 Major Levels",
    "body": "Since the start of the year, Litecoin’s price has fallen by almost a third of its January open, tumbling massively and briefly trading around $45 in early February. The prolonged pullback has kept sentiment quiet, but Litecoin’s price is now back to stabilizing around $53. A recent technical analysis shared on X by crypto analyst Jonathan Carter shows that a triangle support defense is currently playing out for Litecoin. Technical analysis of Litecoin’s price chart shows a descending triangle that has been developing for several years on the weekly timeframe. Right now, Litecoin is trading close to the triangle support, and the reaction at this support will determine whether Litecoin could launch to $285. Descending Triangle Support Faces Major Test The weekly chart shows Litecoin locked inside a large descending triangle structure, with a downward-sloping resistance trendline that has rejected rallies since its 2021 peak at $410. Each subsequent rally has printed lower highs, and this has led to a long-term compression pattern. Related Reading: Litecoin Closes Bullish — $57 Break Could Ignite Next Leg Up Now, the price is sitting near the lower border of the formation, around $55-$45. This area is important because it has always attracted buyers, and Litecoin has never traded below this level since August 2020. Carter noted that Litecoin is attempting to bounce from this lower border, with bulls stepping in as trading volume begins to increase.If this level continues to hold, it would strengthen the case that there is a return to bullish momentum. The Five Major Levels On The Path Higher The bullish outlook is that Litecoin is about to keep trending upwards after recently bouncing on the support. The most recent weekly candlesticks have been a reversal in nature, with a doji candlestick with last week’s candle, which is a reversal candlestick. That formation came after five consecutive weekly red closes, and this makes last week’s candle particularly notable, as it hints at potential exhaustion from sellers and the early stages of a trend change. Related Reading: Why Litecoin Price Going To $2,000 Is Not A Fantasy, But Market Cap Math If Litecoin sustains a bounce from the triangle’s base, then there is a sequence of important resistance levels that could shape the recovery. Carter noted various upside checkpoints in between and $285 as the ultimate price target. The first checkpoint sits around $63, a price level that acted as a pivot area throughout 2025. Clearing this level on a weekly basis would likely change the short-term momentum in favor of buyers. Above that, there is another resistance around $85 that could slow the advance. The next mid-range targets are $115 and the 2025 swing high around $140. A move through these levels would point to a bullish structure where Litecoin returns to price levels not seen since the 2021/2022 cycle. In this case, the price targets are around $180, and the final and most ambitious level on the chart is $285. However, this is still below the long-standing Litecoin all-time high of $410 in May 2021. Featured Image from iStock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Litecoin|descending triangle|Doji Candlestick|Jonathan Carter|Litecoin news|litecoin price|ltc|LTC news|ltc price|ltc/usd|LTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 33,
        "NAME": "LTC",
        "CATEGORY": "LTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58207440,
    "published": 1771535610000,
    "title": "Bitcoin steadies near $67,000 as traders pay for crash protection",
    "body": "The average bitcoin ETF investor now sits on a 20% paper loss, leaving the market vulnerable to capitulation selling if prices slide further, a Wintermute trader said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Market Wrap|Bitcoin News|Wintermute|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58207441,
    "published": 1771535593000,
    "title": "Google Brings AI Music Generation to Gemini—We Tried It, and It's Too Little Too Late",
    "body": "Google AI music generator Lyria 3 is now available on the Gemini app. It works—mostly—but the competition has a big head start.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58207365,
    "published": 1771535183000,
    "title": "Community banks see net deposit outflows to Coinbase: Study",
    "body": "A transaction-level analysis of 92 community banks found $78.3 million in net deposits moved to Coinbase over 13 months, with money market accounts losing most outflows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58208201,
    "published": 1771536722000,
    "title": "Bitcoin Lightning Network exceeds $1B in monthly volume: Report",
    "body": "Analysis by Bitcoin services company River forecasts a transaction surge as individuals and businesses experiment with AI agentic payments.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58208639,
    "published": 1771537786000,
    "title": "Kraken’s xStocks tops $25B in volume with more than 80K onchain holders",
    "body": "Blockchain-based versions of US stocks are drawing growing investor activity, with onchain wallets and cross-venue trading expanding rapidly.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58208366,
    "published": 1771537244000,
    "title": "The SEC’s “2% Haircut” On Stablecoins Is A Bigger Deal Than It Sounds",
    "body": "SEC cuts broker-dealer stablecoin haircut from 100% to 2% aligning them with money market funds and accelerating digital asset integration under the GENIUS Act framework.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58208929,
    "published": 1771538418000,
    "title": "Why This Expert Is Predicting A $10,000 Base Price For XRP",
    "body": "Crypto expert Remi has raised the possibility that XRP could have a base price of $10,000. This came as the expert noted that the XRP Ledger (XRPL) could become the go-to network for tokenization, boosting XRP’s utility. How XRP Can Achieve A Base Price of $10,000 In an X post, Remi predicted that XRP could have a base price of $10,000. He suggested that this could happen if the altcoin has a “United States Crypto price Floor System.” Notably, he made this comment in reference to a report on the U.S. developing a critical minerals price floor system. Related Reading: Analyst Shares XRP Roadmap To $10,000: What Happens With Each Milestone? Remi suggested that this could also happen for XRP if the U.S. eventually considers it a very important asset. Meanwhile, the expert also noted that the XRP Ledger will tokenize gold and Bitcoin, which would also boost the altcoin’s utility and possibly contribute to the base case price of $10,000. In another X post, Remi declared that all the critical minerals will be tokenized on the XRPL with XRP as the bridge currency. He reiterated that the altcoin could reach $1,000, $10,000, and even $100,000 once these begin to happen on the XRPL. It is worth noting that the XRPL is already seeing a wave of tokenization of real-world assets (RWAs). Billiton Diamond and Ctrl Alt announced earlier this month that they had tokenized over $280 million of certified polished diamonds. Ripple also backed the deal, with the crypto firm providing custody services for this tokenization initiative. RWA.xyz data shows that the total tokenized assets on the XRPL are currently valued at $1.9 billion. The network ranks sixth among all networks in terms of tokenized RWAs. XRPL Gets New Upgrade The XRP Ledger has activated the Permissioned DEX, which enables compliant institutional trading. This is expected to further boost the network’s adoption, which is positive for XRP. Commenting on this development, expert X Finance Bull noted that regulated institutions can now trade on the network with vetted counterparties. Related Reading: Cup And Handle Pattern Puts XRP Price At $60 After Hitting Resistance He further remarked that this translates to compliant DeFi, on-chain order books, and KYC-gated trading. The expert also claimed that Ripple and its partner institutions have been waiting for this, and that the infrastructure is ready and the payment rails are open. X Finance Bull declared that this is how up to trillions of dollars will enter the XRP Ledger. He also mentioned that the CLARITY Act, being signed into law, will be the next bullish catalyst for XRP. Once that happens, he predicts that institutional inflows into the XRP ecosystem will increase. At the time of writing, the XRP price is trading at around $1.41, down over 4% in the last 24 hours, according to data from CoinMarketCap. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|altcoin|Billiton Diamond|bitcoin|CLARITY Act|CoinMarketCap|Ctrl Alt|DeFi|DEX|gold|kyc|Real world assets|Remi|Ripple|RWA.xyz|RWAs|X Finance Bull|xrp|XRP Ledger|xrp news|XRP Price|XRPL|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58208975,
    "published": 1771538402000,
    "title": "The Uneven Toll of Crypto’s Latest Slide Falls on Retail Investors",
    "body": "Sidhartha Shukla writes on how retail investors inherited the risk during the latest crypto market meltdown.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58208822,
    "published": 1771538171000,
    "title": "'Warhammer' Veteran Jervis Johnson Warns AI Could Become the 'Asbestos of the Internet'",
    "body": "The longtime Warhammer designer backed Games Workshop’s generative AI ban, arguing the technology undermines creative work.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Gaming",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      }
    ]
  },
  {
    "id": 58209982,
    "published": 1771540200000,
    "title": "Bitcoin options market structure leans toward $60K retest in February",
    "body": "Bitcoin may stay capped under $70,000 as traders deploy bearish options strategies, and spot BTC ETF outflows point to a retest of the yearly low.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58210842,
    "published": 1771542026000,
    "title": "Bitcoin’s Recent Drop Isn’t About Fundamentals, Brian Armstrong Says",
    "body": "The Bitcoin’s recent pullback may look concerning on the surface, but according to Brian Armstrong, the move has more to do with the market psychology than with any deterioration in fundamentals. After a period of strong performance, shifting sentiment and broader market uncertainty are playing a larger role in BTC’s price movement than structural weaknesses within the network or its long-term value proposition. Why Bitcoin’s Core Strengths Remain Intact A crypto expert known as Walter Bloomberg on X has revealed that the Coinbase CEO Brian Armstrong believes Bitcoin’s recent slide is temporary and is driven primarily by market psychology rather than weakening fundamentals. Related Reading: Standard Chartered Lowers Bitcoin Forecast: Predicts Price Dive To $50,000 Before Rebound Speaking to the Consumer News and Business Channel (CNBC) at the World Liberty Forum in Florida, Armstrong pushed back against the speculation linking the decline to potential Federal Reserve (Fed) leadership changes or emerging risks such as quantum computing. Instead, Armstrong explained that the move reflects investors locking in profits and reacting to what they believe others are thinking. He described the downturn as likely temporary, noting that Coinbase is repurchasing shares and buying more BTC at a lower price. Armstrong emphasized that crypto market cycles are normal, reiterating that BTC remains the best-performing asset of the past decade and that the company continues to focus on long-term growth. Is This The Early Stage Of Another Supply Shock? Bitcoin whales have accumulated more than 200,000 BTC despite the ongoing selling pressure. Analyst Darkfost highlighted that while whale inflows to exchanges have increased recently, their overall holdings have continued to grow. Thus, inflows typically reflect short-term behaviour and can generate immediate selling pressure. Related Reading: Bitcoin Whales Flood Binance As Correction Deepens: On-Chain Data Shows The chart below provides a medium-term perspective by tracking the evolution of the whale-held supply on a monthly average basis. After a sharp drop in this average to nearly -7% on December 15, whale behaviour appears to have shifted over the past month, with their holdings increasing by 3.4%. During this period, the BTC supply by whales grew from 2.9 million BTC to over 3.1 million BTC, representing an accumulation of more than 200,000 BTC. Meanwhile, the last time whale accumulation of this magnitude occurred was during the April 2025 market correction. At that time, this wave of accumulation had helped absorb selling pressure and supported the rally that pushed BTC from $76,000 to $126,000. However, with BTC still consolidating around 46% below its recent all-time high, the current level may be viewed as an attractive accumulation zone. Darkfost noted that it is not surprising to see some whales taking advantage of this opportunity. As selling pressure remains significant, this whale demand may not yet be sufficient on its own to fully counterbalance the broader market. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|Bitcoin whales|brian armstrong|btc|BTC news|btc price|btcusd|BTCUSDT|cnbc|coinbase|Consumer News and Business Channel|Darkfost|fed|federal reserve|Walter Bloomberg|World Liberty Forum",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58212764,
    "published": 1771545619000,
    "title": "This Analyst Predicted Solana Sell-Off At $250, And Is Back With A New Prediction",
    "body": "The crypto analyst who warned Solana (SOL) traders to sell near the cycle top at $250 is back with a new outlook after the market validated his earlier call. Crypto Patel says the decline in SOL’s price following his $200-$250 exit zone has now created the conditions for a new long-term opportunity, but only if another key level gives way. His latest chart frames Solana’s price action as a repeatable cycle of euphoric expansion and sharp correction before the next major rally. Crypto Patel Shares New Solana Price Prediction In a recent post on X, Crypto Patel reminded community members that when Solana was trading near its peak between $250 and $200, most investors were projecting a run to $1,000. Instead, the price reversed from a high around $295 and collapsed to near $67, marking a massive 77% drawdown from the top. Related Reading: Here’s Why The Bitcoin, Ethereum, And Solana Prices Are Still Crashing Hard Now, the analyst is presenting a new outlook, warning of a potentially similar decline in Solana’s price this cycle. He notes that Solana is now testing the $85 level, which corresponds to the 0.382 Fibonacci retracement on the chart. The zone has acted as a temporary support; however, it remains structurally weak given the broader trend of lower highs since the peak. The analyst suggests that if Solana fails to break $85, its price could slide into the $50- $30 range, extending its decline over the past two years. He has labeled this area as a strong Fair Value Gap (FVG) accumulation zone based on historical demand and volume behavior. The accompanying chart also maps prior expansion phases in which Solana surged by thousands of percent after long consolidation periods. In the 2021 bull cycle, price rallied by more 24,234.55% and then declined by 97.01% the following year. Crypto Patel’s current projection places Solana in a similar expansion and corrective phase. The cryptocurrency has already experienced its expansion stage in 2024, when its price jumped by more than 3,699% to a peak of around $295. Now the analyst predicts an upcoming correction, where price is expected to decline by a whopping 89.44% in mid 2026. Long-Term Targets Remain Intact Despite Correction Despite the bearish short-term outlook, Crypto Patel has not abandoned his long-range bullish projections for SOL. He maintains that once the corrective phase is complete, Solana could still target the $500– $1,000 range. His chart projects a sharp upward surge toward the $1,000 level by 2027, representing a massive 3,103% surge. Related Reading: XRP, Solana Secure Inflows As Institutions Move $1 Billion Out Of Bitcoin And Ethereum Going further, the analyst also shared his bullish price projection for Solana by late 2029. He expects that once the price hits $1,000, SOL could rally strongly and steadily toward $10,000. He has marked $9,270 as the next long-term target, reflecting a rally of approximately 27,660%. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Solana|Crypto Patel|Fair Value Gap|FVG|Sol|SOL news|SOL Price|Solana news|Solana Price|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58212874,
    "published": 1771545600000,
    "title": "Stablecoins Are The “Jet Fuel” Powering The Digital Economy",
    "body": "An interview with Sheila Warren, former CEO of the Crypto Council for Innovation, on why stablecoin is the jet fuel that will propel the digital economy off the runway.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58214651,
    "published": 1771549221000,
    "title": "Don’t Fall For The Bitcoin Trap: Analyst Explains Why Recovery To $76,000 Is Not A Good Thing",
    "body": "Bitcoin’s price action is struggling with bearish corrections, repeatedly failing to close daily trading sessions above $70,000. As it stands, Bitcoin is now moving in a tight range below $70,000, and crypto analysts are undecided on its next direction. Some see the current structure as a base for another push higher, but others warn that any bounce could invite new selling. Crypto analyst Sherlock is among the cautious voices, arguing on X that a rally to between $72,000 and $76,000 may not be a recovery but a kill zone for Bitcoin bulls. The $76,000 Breakeven Wall Crypto analyst Sherlock is of the notion that any Bitcoin price recovery to $76,000 from here might not actually be a good thing. Sherlock’s argument is based on the Bitcoin holdings of Strategy. At the time of writing, the company holds 714,644 BTC at an average cost basis of $76,052. That stash represents roughly 3.4% of the total Bitcoin supply that will ever exist. Related Reading: Extreme Bitcoin Shorts Could Predict A Bottom, Here’s The Significance Now that Bitcoin is trading around $68,000, Strategy’s position is significantly underwater, and the company is sitting at an estimated unrealized loss of about $5.7 billion at current prices. In the analyst’s view, every push to the $74,000 to $76,000 range brings this large concentration of supply closer to breakeven. Breakeven levels often act as selling zones. Based on that perspective, the $76,000 area could be risky because it brings Strategy’s position back to its average entry price, and many large holders might consider reducing exposure. That said, there is no indication that Strategy plans to sell. The company has repeatedly stated that it has no intention of offloading its Bitcoin and has even emphasized that its balance sheet could withstand a severe downturn, including a scenario where the Bitcoin price drops below $10,000. ETF Pressure And Bitcoin Cost Basis Sherlock also pointed to Spot Bitcoin ETFs as another source of pressure that might lead to a bull trap. As it stands, about 1.28 million BTC are currently held in these funds, with an estimated average entry price between $84,000 and $90,000. Related Reading: Could A Bitcoin Price Crash Below $10,000 Wipe Out Strategy? Saylor Shares What To Expect Since late 2025, these ETFs have recorded more than $6 billion in net outflows, and the Bitcoin price might face another pressure even if it reaches the average entry price. He also noted that about 63% of invested Bitcoin wealth has a cost basis above $88,000, meaning a large share of buyers in 2025 are sitting on losses, and a rally to their entry levels could also be a bull trap. Therefore, a climb into the $72,000 to $76,000 range could be a bull trap. If it doesn’t, then the next trap could be around $88,000. That said, if every breakeven level triggered selling, then Bitcoin might never form a bottom. At the time of writing, Bitcoin is trading at $66,980. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|Sherlock|spot Bitcoin ETFs",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58216154,
    "published": 1771551930000,
    "title": "AI agents not worth the cost as humans still cheaper: Tech execs",
    "body": "Tech investor Jason Calacanis says he’s paying around $110,000 annualized to run an AI agent, more than most US salaries, and it’s not running at full capacity.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 58216466,
    "published": 1771552827000,
    "title": "Ethereum Breakdown Deepens Below $2,100, But Fractal Signals Hope",
    "body": "Ethereum’s technical structure has weakened further after slipping decisively below the $2,100 level, reinforcing short-term bearish pressure. However, while the breakdown raises the risk of a deeper downside, a repeating fractal pattern on the higher timeframe offers a potential glimmer of hope, suggesting that a larger breakout could still emerge if history rhymes. Key $2.3K–$2.1K Support Zone Lost According to Crypto Candy, Ethereum has decisively lost its key daily support zone between $2,300 and $2,100, closing firmly below it and confirming a structural breakdown. This area had previously acted as a strong demand region, repeatedly absorbing selling pressure. Its failure marks an important technical shift, suggesting that the broader market structure has weakened. Related Reading: Ethereum Price Stalls Under Resistance With Breakout Hopes Delayed With the breakdown confirmed, the former support zone has now flipped into a significant resistance area. ETH has already attempted to reclaim the $2,100–$2,300 range but has failed to regain acceptance above it. This rejection reinforces the idea that sellers are defending the level aggressively, keeping short-term momentum tilted to the downside. If bearish momentum continues to build, the next major support region to watch sits between $1,700 and $1,500. A move into this range would align with typical continuation behavior following a failed reclaim of broken support. For now, the bias remains bearish as long as Ethereum trades below the $2,300–$2,100 zone. Only a strong reclaim followed by sustained consolidation above that range would invalidate the downside scenario. Ethereum Fractal Structure Mirrors Pre-Rally Setup Providing a weekly Ethereum update, Trader Tardigrade pointed to a compelling fractal comparison that suggests a familiar structure may be unfolding. The expert’s analysis highlights the formation of a rectangular consolidation box, a setup that closely resembles the price behavior seen before Ethereum’s explosive rally in late 2025. Related Reading: Ethereum’s Leverage Reset Clears The Path For A Healthy Rebound – Analyst During that previous cycle, ETH spent weeks compressing within a clearly defined horizontal range, building energy before eventually breaking out with strong momentum. The current chart shows a nearly identical box pattern forming, positioned similarly within the broader ascending channel. The symmetry between the two structures strengthens the case that this may not be random consolidation, but rather a repeat of a larger cyclical pattern. If the fractal continues to play out as it did before, a decisive breakout above the current range could trigger a powerful upside expansion. Just as in 2025, the longer the price compresses within the box, the more aggressive the eventual move could become. A confirmed break and sustained acceptance above the range would be the key signal that Ethereum is transitioning from accumulation to markup once again. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|Ascending Channel|Crypto Candy|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|ethusd|ETHUSDT|Trader Tardigrade",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]