[
  {
    "id": 58129356,
    "published": 1771382521000,
    "title": "Bitcoin Price Dips Toward Decisive Support As Bears Regain Control",
    "body": "Bitcoin price corrected gains and tested the $66,500 support. BTC is now struggling and might decline further below the $65,000 zone. Bitcoin is struggling to recover losses and moving lower below $67,500. The price is trading below $67,500 and the 100 hourly simple moving average. There is a declining channel forming with resistance at $68,850 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might dip again if it trades below the $66,500 and $66,000 levels. Bitcoin Price Dips Further Bitcoin price failed to remain stable above the $68,500 zone. BTC started a fresh decline and traded below the $67,800 support zone . There was a push below $67,200. The price dipped below the 61.8% Fib retracement level of the upward move from the $65,072 swing low to the $70,935 high. However, the bulls remained active near the $66,500 zone. Besides, there is a declining channel forming with resistance at $68,850 on the hourly chart of the BTC/USD pair. Bitcoin is now trading below $67,500 and the 100 hourly simple moving average . If the price remains stable above $66,500, it could attempt a fresh increase. Immediate resistance is near the $68,000 level. The first key resistance is near the $68,850 level. A close above the $68,850 resistance might send the price further higher. In the stated case, the price could rise and test the $69,200 resistance. Any more gains might send the price toward the $70,000 level. The next barrier for the bulls could be $7`,200 and $72,000. Another Decline In BTC? If Bitcoin fails to rise above the $68,850 resistance zone, it could start another decline. Immediate support is near the $66,500 level or the 76.4% Fib retracement level of the upward move from the $65,072 swing low to the $70,935 high. The first major support is near the $66,000 level. The next support is now near the $65,000 zone. Any more losses might send the price toward the $64,200 support in the near term. The main support now sits at $63,500, below which BTC might struggle to recover in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $66,500, followed by $66,000. Major Resistance Levels – $68,000 and $68,850.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58130199,
    "published": 1771384105000,
    "title": "Coin Center urges Senate not to axe crypto developer protection bill",
    "body": "Coin Center said internet and cloud hosting providers aren’t prosecuted when criminals misuse their platforms, arguing crypto developers shouldn’t be either.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58129814,
    "published": 1771383196000,
    "title": "eToro shares pop 20% as crypto revenues bolster Q4 earnings",
    "body": "eToro CEO Yoni Assia says he is positioning the trading platform “for a financial system that is increasingly moving on-chain,” after its crypto revenues boosted earnings in Q4.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58130345,
    "published": 1771384407000,
    "title": "Crypto lobby forms working group seeking prediction market clarity",
    "body": "The Prediction Markets Working Group, launched by The Digital Chamber, will champion the sector’s values while advocating for the CFTC to maintain primary oversight.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 58131022,
    "published": 1771385444000,
    "title": "Bitwise, GraniteShares join race for prediction market-style ETFs",
    "body": "Two more ETF issuers have filed prospectuses for six US election prediction market ETFs, allowing investors to gain exposure to election outcomes.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 58131345,
    "published": 1771386198000,
    "title": "Bitcoin's Divergence From Nasdaq Is a Warning on Dollar Liquidity: Arthur Hayes",
    "body": "Arthur Hayes warns Bitcoin's divergence from a flat Nasdaq signals an AI-driven credit crisis, but experts say the timeline is overstretched.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58133743,
    "published": 1771390820000,
    "title": "Brevan Howard’s crypto fund slumped 30% in 2025 amid bitcoin rout",
    "body": "Hedge fund manager’s digital asset strategy stung by ‘terrible year’ for cryptocurrencies",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58133707,
    "published": 1771390805000,
    "title": "$274 Billion In Potential Bitcoin Selling Could Hit Markets, Expert Says",
    "body": "While much of the market’s attention remains fixed on the Bitcoin (BTC) short-term price outlook for the remainder of the year, some early industry voices are raising a far longer-term concern — one that could introduce as much as $274 billion in potential selling pressure over the next decade. Quantum Risk Debate Grows In a recent post on social media, market expert Crypto Rover pointed to what he described as a growing conversation among early Bitcoin analysts and long-time participants in the space. According to the analysis, the warning is not coming from retail traders reacting to daily price swings. Instead, it is being discussed by so-called “OG” holders — investors who have been involved with Bitcoin since its earliest years. Related Reading: Top Expert Projects Bitcoin Bear Market To End In Less Than 365 Days The issue at the center of the debate is not macroeconomics or regulatory shifts, but quantum computing. A segment of early adopters believes that advances in quantum technology may no longer be a distant or purely theoretical risk. Within the next five to ten years, they argue, quantum systems could become powerful enough to challenge the cryptographic foundations that secure the Bitcoin network. If quantum machines were able to break or significantly weaken that encryption, older wallets — particularly those using early-generation security standards — could become vulnerable. The concern is not that Bitcoin’s network is currently weak, but that a sufficiently advanced quantum breakthrough could expose dormant coins whose private keys were once thought secure. This is where the potential supply shock comes into focus. Potential Return Of Early-Era Bitcoin An estimated 4 million BTC from Bitcoin’s early years, particularly before 2011, are considered inactive or lost. Markets generally treat those coins as permanently out of circulation, effectively reducing Bitcoin’s usable supply. However, Rover asserts that if quantum computing were ever able to unlock even a portion of those wallets, that supply could theoretically return to the market. To understand the magnitude of such a shift, Rover points to recent history. Since 2020, institutions and corporations have collectively accumulated roughly 3 million BTC, which played a key role in driving BTC from $10,000 to peak levels above $120,000. Related Reading: XRP Outlook Slashed: Standard Chartered Lowers Forecast From $8 To $2 The expert warns that if 4 million Bitcoin were suddenly viewed as potentially liquid supply, it would represent a long-term overhang far exceeding the scale of recent institutional accumulation. However, Rover highlighted that quantum computing does not represent an imminent danger to Bitcoin’s security. The technology is continuously evolving, and there is no confirmed ability to break modern cryptographic standards at scale. BTC was trading at roughly $67,800 at the time of writing, representing a 2.6% decrease over the previous seven days, according to CoinGecko data. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin chart|Bitcoin news|bitcoin price|Bitcoin quantum computing|Bitcoin Quantum Threat|btc|BTC news|btc price|BTCUSDT|crypto|crypto market|crypto news|quantum computing|Quantum computing risks",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58134738,
    "published": 1771392671000,
    "title": "Bitcoin's tech stock divergence is a 'fire alarm' for fiat: Arthur Hayes",
    "body": "Arthur Hayes warns that AI-related job losses will spark a credit crisis, forcing central banks to print money, which will drive Bitcoin to new all-time highs.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58135080,
    "published": 1771393560000,
    "title": "Oracle Error Leaves DeFi Lender Moonwell With $1.8 Million in Bad Debt",
    "body": "The error allowed liquidators to repay roughly $1 of debt to seize cbETH collateral, leaving Moonwell with nearly $1.8 million in bad debt.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "DeFi",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58135443,
    "published": 1771394400000,
    "title": "Bitcoin Accumulation Notably Weaker Than Nov 2025 Bounce: Glassnode",
    "body": "On-chain analytics firm Glassnode has highlighted how accumulation during the recent Bitcoin drop has looked weaker than some past crashes. Bitcoin Accumulation Trend Score Doesn’t Indicate Strong Accumulation In a new post on X, Glassnode has talked about the latest trend in the Accumulation Trend Score of Bitcoin. This indicator tracks whether the BTC investors are accumulating or distributing right now. Related Reading: Bitcoin Bull-Bear Cycle Indicator Drops To Deepest Level Since FTX Bottom The metric determines this by taking into account for two factors: the balance changes happening in the wallets of the holders and the size of the balances themselves. The latter factor means that larger entities have a higher weightage in the indicator. When the value of the Accumulation Trend Score is greater than 0.5, it means the large holders (or a large number of small entities) are in a phase of accumulation. The closer is the metric to the 1.0 level, the stronger is this behavior. On the other hand, the indicator being under the 0.5 mark suggests distribution is dominant on the network. The selling can be considered the strongest at a value of zero. Now, here is the chart shared by Glassnode that shows the trend in the 7-day moving average (MA) of the Bitcoin Accumulation Trend Score over the last few years: As displayed in the above graph, the Bitcoin Accumulation Trend Score took a yellow shade as the cryptocurrency’s January recovery rally topped out and a move downward followed. This suggests that the investors were distributing. As the coin has stabilized above $65,000 recently, the indicator’s color has changed to a darker one, implying it has broken back above the 0.5 mark. While this is a sign that there has been some accumulation at the post-crash price levels, the degree of it hasn’t been too high. From the chart, it’s apparent that this behavior is in contrast to how the market reacted to the November crash. Back then, the Accumulation Trend Score took a deep purple shade, indicating an aggressive amount of accumulation from the big-money hands. The LUNA and FTX crashes from the 2022 bear market were also met with a similarly extreme accumulation behavior. It now remains to be seen whether the lack of demand this time around will mean that Bitcoin will take some time to settle into a low. Related Reading: 46% Of Bitcoin Supply Now In Loss—What It Could Take For A Bottom In some other news, Glassnode has shared an update in an X post on how the major Bitcoin on-chain price models are looking. As is visible in the graph, Bitcoin’s decline has meant that its price is now trading under all major on-chain pricing models except for the Realized Price, corresponding to the cost basis of the network participants as a whole. This level is currently located at $54,900. BTC Price Bitcoin has stagnated since its recovery from the $60,000 low as its price is still floating around the $68,000 level. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin accumulation|Bitcoin Accumulation Trend Score|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58135344,
    "published": 1771394123000,
    "title": "Wall Street Pushes Deeper Into Prediction Markets With New ETF Filings",
    "body": "Prediction market exposure is being packaged for public investors as the U.S. election cycle draws institutional interest.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 58135801,
    "published": 1771395011000,
    "title": "4 data points suggest XRP price bottomed at $1.12: Are bulls ready to take over?",
    "body": "Multiple technical, onchain and exchange-traded product data points suggest $1.12 was the generational bottom for XRP. Is it time for a trend reversal?",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58137195,
    "published": 1771397674000,
    "title": "Peter Thiel's Founders Fund dumps every ETHZilla share",
    "body": "Peter Thiel's Founders Fund held zero shares in ether treasury firm ETHZillan at the end of 2025, per SEC filings.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Peter Thiel|Ether|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 58137745,
    "published": 1771398232000,
    "title": "Bitcoin losing $70,000 is a warning sign for further downside",
    "body": "Crypto majors soften while Asian equities rebound modestly, with traders continuing to weigh quantum fears, ETF flows and a possible shift in bitcoin’s broader trend.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58139222,
    "published": 1771401644000,
    "title": "This Korean XRP Exchange Data Has The Community Losing It",
    "body": "Crypto market researcher Dom (@traderview2) says he’s identified what looks like a persistent, algorithmic XRP seller on South Korea’s Upbit: one that, by his estimates, has offloaded roughly 3.3 billion XRP into the XRP/KRW order book over the past 10 months. If the analysis holds, it reframes Upbit’s XRP flow as a venue-specific phenomenon rather than a simple reflection of global risk-on/risk-off sentiment. XRP/KRW Saw $5 Billion in Net Selling Dom analyzed “82 million trades on Upbit XRP/KRW” and mapped their net imbalance over time. His headline conclusion: “A $5 billion one directional selling pipeline running 24/7 for almost a year.” Dom said the work began after an intense intraday stretch that forced a closer look at the tape. “It started with yesterday’s price action. -57M XRP in CVD over 17 hours. It looked insane,” he wrote. “So I ran forensic queries – bot fingerprinting, iceberg detection, wash trade checks. The selling was real. Algorithmic. 61% of trades fired within 10ms. Single bot running 17 hours straight with one 33 second pause.” Related Reading: Analyst Reveals What XRP Price Will Move Toward In Bid For $4 Instead of treating that -57 million XRP cumulative volume delta as an outlier, Dom said he zoomed out and found it matched a longer-running pattern. “-57M isn’t an anomaly,” he wrote. “Upbit XRP/KRW has been net negative every single month for 10 months,” listing several months with large net selling: “Apr: -165M,” “Jul: -197M,” “Oct: -382M,” and “Jan: -370M.” In total, he put the figure at “3.3 BILLION XRP in net selling. ~$5B.” He also argued the flow is unusually consistent. “Only 1 week out of 46 was positive. One,” Dom wrote, adding that there is “no weekday/weekend distinction” and “no time of day where buying outweighs selling in aggregate.” That persistence is part of why he framed it as something closer to execution infrastructure than discretionary trading. “This isn’t a trader,” he wrote. “It’s infrastructure.” A key part of the thread is the cross-venue comparison. Dom said Binance’s XRP/USDT market showed materially less sell pressure during the same windows—“2-5x less sell pressure on the same coin,” he wrote, pointing to a June period where “Binance was net positive while Upbit bled -218M.” He also flagged a weak relationship between the two venues’ hour-by-hour flow, claiming “the hourly correlation between the two venues is only 0.37,” which would imply Upbit’s net selling is being driven by local factors rather than simply mirroring global positioning. XRP Traded Cheaper In Korea For Months Dom’s pricing observations added another layer. He said that from April through September, Upbit XRP traded “3-6% BELOW Binance,” calling it a “reverse Kimchi discount.” In his view, that detail matters because it suggests the seller was willing to accept consistently worse execution than what was available elsewhere. “The sellers were accepting 6% worse fills than available on global markets, for many months,” Dom wrote. “They don’t care about the price. They need KRW, are mandated to use Upbit, and/or are Korean holders taking profit…” Related Reading: XRP Vs Gold Hits Historic Zone As Sentiment Capitulates: Analyst He then pointed to what he described as a structural break around Oct. 10. “Korean retail went insane. Premium flipped from -0.07% to +2.4% in a single day. Trades 5x’d to 832K,” Dom wrote, adding that the premium “has only briefly gone negative since.” The seller, in his telling, did not back off—if anything, the pace increased. “And the sellers? They doubled their daily rate. From -6.3M/day to -11.2M/day.” Dom tried to connect that behavior to market regimes by “bucket[ing] every day by what XRP did on Binance globally,” reporting that Upbit flow skews heavily negative on down days and especially on crash days. He summarized the dynamic as feedback between a systematic seller and retail behavior: “On moon days, Korean retail becomes a NET BUYER. They’re accumulating,” he wrote. “On crash days, sell intensity is 8x heavier. The systematic seller + retail panic amplify each other. Korean retail buys every rip. The pipeline sells into all of it.” To support the “machine versus retail” framing, Dom contrasted order-size fingerprints on both sides of the tape. He claimed the sell side repeatedly used round-number clips—“10, 50, 100, 500, 1000 XRP”—with “57-60% of all trades fire within 10ms,” while the buy side showed a large fraction of “tiny fractional sizes,” such as “2.535, 3.679, 2.681 XRP,” which he argued is consistent with KRW-denominated retail tickets like buying a fixed won amount of XRP. “One side looks like retail,” he wrote. “The other looks like a machine.” The scale claim is also central to why the thread traveled. Dom said “3.3 billion XRP” represents “5.4% of XRP’s entire circulating supply,” moved through “a single trading pair, on a single exchange, in 10 months.” He emphasized he’s working from trade-level datasets: “This analysis used tick trade data I collected from Upbit and Binance,” he wrote, citing “82M Upbit trades + 444M Binance trades.” Dom stopped short of naming a specific entity behind the selling, instead posing a question he framed as the next investigative step: who can sustain “300-400M per month for a year straight,” seemingly “doesn’t care about 6% discounts,” and “needs KRW specifically or is in some walled garden and can only use Upbit?” At press time, XRP traded at $1.45. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP News|Upbit|xrp|XRP analysis|xrp news|XRP Price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58140681,
    "published": 1771404460000,
    "title": "Peter Thiel’s Founders Fund dumps ETHZilla stake as ETH treasuries face pressure",
    "body": "A new SEC filing shows Peter Thiel-linked Founders Fund entities now own zero ETHZilla shares, after disclosing a 7.5% stake in 2025.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58141033,
    "published": 1771405259000,
    "title": "BNB Chain’s AI Agent Ecosystem Surges As Crypto Markets Bleed",
    "body": "While the crypto market struggles and broader sentiment sits at its lowest levels in years, BNB Chain has shown resilience, building on last year’s on-chain momentum, while taking key steps toward strong builder activity and growing user participation. Now, the ecosystem has turned to AI agents, one of the rapidly growing narratives, to start preparing for the next market phase. Related Reading: Crypto Funds Bleed $173M As Outflows Extend To Fourth Week – Report BNB Chain’s AI Agent Ecosystem Grows In a recent development, the BNB Chain has rolled out support for AI agent standards ERC-8004 and BAP-578, seeking to make agent identity practical at scale “with low fees, fast transactions, and infrastructure designed for frequent agent activity.” Notably, AI Agents are autonomous programs capable of making decisions, interacting with other systems, and carrying out tasks, including trading and managing data, without continuous human participation. However, these agents have shown limits that must be addressed to operate beyond single apps or centralized platforms. As a result, BNB Chain announced earlier this month the deployment of the ERC-8004 infrastructure on the BNB Smart Chain (BSC) Mainnet and Testnet. ERC-8004 is a new on-chain identity standard designed to give autonomous AI agents verifiable, portable identity across platforms. According to the announcement, they also introduced BNB Application Proposals (BAPs), which are a new standard for the application layer, to complement the ERC-8004 infrastructure. BAP-578, the first BAP, launches the Non-Fungible Agent (NFA) standard, which enables AI agents to “exist as on-chain assets that can hold assets, execute logic, interact with protocols, and be bought, sold, or hired. This marks the first step toward an open, predictable, and interoperable Agent Economy on BNB Chain.” By February 17, its AI Agent ecosystem had reached 58 projects across 10 categories, including infrastructure, social platforms, DeFi, trading, gaming, and entertainment. Moreover, it has seen over 200 builders participate in its ongoing “Good Vibes Only: OpenClaw Edition” hackathon event, focused on AI/on-chain actions. The Ecosystem’s Momentum The BNB Chain has continued to show strength across its ecosystem despite the recent market downturn and BNB’s price correction, holding key on-chain metrics and strong fundamentals. Crypto market intelligence firm Messari recently highlighted BNB Chain’s performance during the last quarter of 2025. Notably, BNB Chain remained the third-largest network by DeFi Total Value Locked (TVL), ending the year with $6.6 billion in TVL across its ecosystem, up 23.6% YoY. Per the report, average daily transactions surged 30.4% QoQ, while daily active addresses increased 13.3%. In addition, the total Real-World Asset (RWA) value grew to $2 billion, a 228.1% increase QoQ, and 554.6% up YoY from the $3.6 million registered at the start of the year. Related Reading: Bitcoin Whales Flood Binance As Correction Deepens: On-Chain Data Shows As reported by NewsBTC, most of these metrics have held throughout the recent market struggles, with TVL across its ecosystem, daily active addresses, and average daily transactions showing sustained growth since the end of 2025. Meanwhile, it has seen massive growth in the prediction markets sector, with leading platforms within the ecosystem reaching crucial milestones after surpassing $20 billion in cumulative volume in late January. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|AI Agent standards|AI Agents|BNB|bnb chain|BNB Chain AI Agents|BNB Chain ecosystem|BNb Chain prediction markets|BNB Chain Trading Volume|bnbusdt|BSC network|crypto market correction|Crypto market crash|messari",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58142854,
    "published": 1771408812000,
    "title": "Macro Wobbles May Send Bitcoin Back To The $50,000s, Industry CEO Claims",
    "body": "Bitcoin remains stuck below the $70,000 mark, a level that once served as a crucial floor for the cryptocurrency but has now turned into its most significant near-term barrier. After losing that support, the asset has struggled to regain momentum, and analysts warn that a combination of macroeconomic uncertainty and weak buying pressure could push the asset back into the $50,000 range — a level not seen since September 2024. Iran Tensions, Fed Uncertainty And ETF Withdrawals Market sentiment has noticeably deteriorated in recent weeks. “Sentiment is clearly bleak in crypto markets,” said Noelle Acheson, author of the Crypto is Macro Now newsletter. She pointed out that although traditional financial institutions continue to make meaningful strides in adopting digital assets, those developments have not translated into stronger prices, which she noted, is weighing further on investor confidence. Related Reading: Top Expert Projects Bitcoin Bear Market To End In Less Than 365 Days Broader macroeconomic forces are adding to the unease. According to Bloomberg, traders are assessing escalating geopolitical tensions involving Iran, as well as renewed debate over whether the economic impact of artificial intelligence (AI) could extend beyond the technology sector. At the same time, expectations surrounding Federal Reserve (Fed) interest rate cuts have shifted back into focus following last week’s inflation data, injecting additional uncertainty into risk markets. Capital flows are not offering much relief. US-listed spot Bitcoin exchange-traded funds (ETFs) recorded a fourth consecutive week of net outflows, with $360 million pulled last week alone. Bitcoin At Risk Of Drop To $50,000 “Macro news has been closely correlated with crypto’s risk profile over the last 12 months,” said Paul Howard, senior director at market maker Wincent. He expects Bitcoin to remain range-bound as it searches for a new catalyst to revive sentiment. Howard added that a pending US Supreme Court ruling on tariffs, expected Friday, could have a more meaningful market impact than routine Federal Reserve minutes or inflation reports. Related Reading: XRP Outlook Slashed: Standard Chartered Lowers Forecast From $8 To $2 Amid this debate, investors view $60,000 as a pivotal support level for Bitcoin, but that floor could give way if risk appetite weakens further, according to Robin Singh, CEO of crypto tax platform Koinly. Singh cautioned that the market does not yet display the type of deep capitulation typically associated with durable cycle lows. “One macro wobble, another wave of uncertainty, or even just sustained chop in the mid-$60,000s could easily tip this into a sharper flush back into the $50,000s,” Singh said. “This doesn’t have the same full capitulation feel we’ve seen at true cycle bottoms in the past.” At the time of writing, Bitcoin was trading at around $68,000, marking a 29% decline over the past thirty days. Compared to the all-time high of $126,000 reached last October, CoinGecko data shows a 46% difference between the current trading price and the all-time high. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|btc|BTC news|btc price|BTCUSDT|crypto|crypto market|crypto news|cryptocurrency",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58143264,
    "published": 1771408992000,
    "title": "Intesa’s Crypto Push Includes $96 Million in Bitcoin ETFs",
    "body": "Italy’s biggest bank Intesa Sanpaolo SpA said it held $96 million in Bitcoin exchange-traded funds at the end of last year as part of its growing exposure to crypto.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "MIL:ISP",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58144377,
    "published": 1771411520000,
    "title": "Brevan Howard's crypto fund said to lose 30% in worst year since inception: FT",
    "body": "BH Digital Asset underperformed bitcoin, which lost 6% in 2025.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Brevan Howard|Crypto Funds|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58144861,
    "published": 1771412422000,
    "title": "XRP Emerges As The Crypto Everyone’s Talking About, Grayscale Says",
    "body": "Reports of real-world trials and steady questions from advisers are giving XRP and its network fresh attention, but the story is part optimism and part early-stage testing. Related Reading: What Bitcoin Rout? Michael Saylor Unfazed, Teases New Accumulation Grayscale Investments Reports Growing Advisor Questions According to people familiar with sales desks, the firm’s teams keep hearing the same line from financial advisers: clients want to know about the token. That curiosity, while loud, does not automatically mean money is moving in large sums. Rayhaneh Sharif-Askary, who leads Product and Research at Grayscale Investments, said XRP ranks among the most talked-about crypto assets, with many investor discussions placing it just behind Bitcoin. The firm’s role is sales and research, and what gets asked about often leads product teams to track demand. Still, Reports say adviser interest is now a regular part of conversations that once focused almost entirely on Bitcoin. “Advisors are constantly asked by their clients about $XRP, and in some cases, it’s the second most talked about asset in this community behind Bitcoin.” As @Ray_scale shared during @Ripple’s XRP Community Day, advisors across the country consistently hear about $XRP from their… pic.twitter.com/ws3q1fJoZR — Grayscale (@Grayscale) February 16, 2026 Big Players Run Pilots Reports have disclosed that big names in finance and payments are running trials on the network. BlackRock and Mastercard have been linked to exploratory projects testing tokenized instruments and settlement flows. Pilots were set up to see whether on-chain liquidity and programmable money can shave steps from traditional processes. The work is at testing scale. It is not yet routine, and most of what’s public is limited to proof points. Token Demand Vs. Infra Checks XRP remains at the center of the conversation. Reports note that advisers and retail holders mention it often, and that community enthusiasm helps keep it in headlines. But supply, custody arrangements, and regulated product wrappers are the things that actually move investable capital. Meanwhile, the ledger that underpins the token is being vetted for features that large institutions find appealing. The ledger’s pace and fee profile have been looked at closely in these checks. Enterprise Features And Tokenized Funds Reports say the network includes native AMM-like mechanics, an on-ledger exchange, and trust line tools that can be adapted to compliance steps. Those features are part of why conventional firms have been willing to run pilots. Franklin Templeton and DBS took part in tokenized fund work last year, testing how regulated assets might flow on-chain with better liquidity. The results were mixed but instructive: tokenization can shorten settlement windows, yet legal and custody questions take time to solve. Related Reading: Bitcoin Should Be Flying—Instead, Quantum Risk Keeps It Grounded: Analyst Swap And Settlement Tests Gain Traction Reports note collaboration between market infrastructure teams and specialist firms to enable fund-share swaps and stablecoin rails. Securitize helped bridge traditional fund shares to on-chain representations, and Gemini was named in pilots that try converting fund exposure into a liquid on-chain form. Featured image from Klaus Vedfelt/Getty Images, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|/r/Bitcoin|altcoin|bitcoin|crypto|grayscale|xrp",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58144901,
    "published": 1771412390000,
    "title": "Wells Fargo sees ‘YOLO’ trade driving $150B into Bitcoin and risk assets",
    "body": "A Wells Fargo strategist says bigger US tax refunds could revive retail risk-taking by late March, potentially sending fresh cash into Bitcoin and momentum stocks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58145683,
    "published": 1771413829000,
    "title": "Collateral, Coins, And Charters: Georgia Aims To Shape Fintech’s Future",
    "body": "A combination of Stablecoins, Tokenized Deposits, and Georgia's MALPB could shape the future of banking and payments.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|Money|/money|Fintech|/fintech|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58146870,
    "published": 1771416052000,
    "title": "Is Jane Street Manipulating Bitcoin? The Viral Theory Explained",
    "body": "A fresh round of Bitcoin market-manipulation chatter is ricocheting through crypto X after Jane Street added 7,105,206 shares of BlackRock’s spot Bitcoin ETF, IBIT, in Q4 2025, bringing its reported position to 20,315,780 shares. Speculators tie this disclosure to a long-running rumor about a daily “10AM” sell program. Is Jane Street Manipulating The Bitcoin Price? The allegation is simple and sticky: the same sophisticated desk “accumulating” IBIT is also supposedly the desk leaning on BTC and BTC-linked vehicles at a predictable time each morning to create better entry prices. The rebuttal, from market structure veterans, is equally blunt: you’re reading a market maker’s inventory like it’s a directional bet. BullTheory framed the 13F as an accumulation story, writing that Jane Street bought 7,105,206 IBIT shares “worth $276 million” in Q4 2025 and “now holds 20,315,780 IBIT shares worth $790 million,” before adding: “This is the same entity rumoured to be behind the daily ‘10 AM’ manipulation to push Bitcoin prices lower.” Related Reading: Bitcoin Accumulation Notably Weaker Than Nov 2025 Bounce: Glassnode The screenshot circulating alongside the claim shows Jane Street Group LLC listed with a 13F source tag, an options indicator marked “Y,” a position of 20,315,780, and a latest change of 7,105,206, filed 12/31/25. That “Y” is the detail critics keep coming back to because it’s the quickest tell that the position may not be what the headline suggests. BREAKING: Jane Street bought 7,105,206 $IBIT shares worth $276 million in Q4 2025. It now holds 20,315,780 IBIT shares worth $790 million. This is the same entity rumoured to be behind the daily “10 AM” manipulation to push Bitcoin prices lower. pic.twitter.com/NFC5r5hHUn — Bull Theory (@BullTheoryio) February 17, 2026 Milk Road amplified the “10am theory,” calling it “persistent whispers” about “certain institutional trading desks running a very specific/shady playbook… (Jane Street included.).” The account described an alleged routine: “Around 10 AM ET, right at the US stock market open, large sell volumes hit BTC and related ETF shares. This creates panic → triggers liquidations of leveraged longs → and exploits thin liquidity pockets. Then the same firms allegedly buy back at lower prices.” Milk Road added that the pattern “apparently emerged prominently in early Nov 2025,” showed up in Q2 and Q3, and “has continued into early 2026,” while stressing: “To be clear – these are unverified rumors circulating in the community.” Not everyone bought the internal logic even on its own terms. CryptoQuant contributor Darkfost responded with the question many traders would ask first: “In this rumor, when is Jane Street supposed to have bought large amounts of BTC so as not to be selling at a loss right now”. Milk Road replied that the rumor “suggests they’d accumulated in the lead up,” then used existing holdings to “sell/dump prices → buy in size at a lower price,” adding again: “totally unverified.” Market Makers: Inventory Isn’t A Thesis The strongest pushback focused on mechanics, not vibes. Louis LaValle, CEO and co-founder of Frontier Investments, argued the viral framing misreads what a 13F is showing in the first place: “This isn’t correct. You’re misinterpreting the 13F. Jane Street is a lead market maker and Authorized Participant for IBI. They aren’t ‘holding’ as a bet. The ‘Y’ in the options column next to that $5.7B value confirms this is a delta-hedged position.” Related Reading: Bitcoin Whales Flood Binance As Correction Deepens: On-Chain Data Shows LaValle added that the Q4 increase could be operational rather than directional: “They added 7 million shares in Q4 to manage the record volatility and creation/redemption demand. As a market maker, they hold these shares to balance the risk of the options they write. It has nothing to do with conviction or some mysterious price manipulation.” Former hedge fund manager Michael Green struck a similar note, calling the discourse “painful” and pointing to what isn’t visible in the filing: “Jane Street may be taking a position in IBIT, but that position is almost entirely offset by undisclosed options (on IBIT) and futures positions. They are certainly not ‘accumulating’ a position in Bitcoin. That’s how market making works.” Others put it more sharply. Former prop trader Ryan Scott (“Horse”) warned: “Anyone posting this as bullish is committing a capital offense. This should be ‘You’ll never guess who also has offsetting derivative positioning that does not need to be reported’ Jane Street is not longing Bitcoin.” Nik Bhatia boiled it down to incentives: “Jane Street owns IBIT so that it can write options, arbitrage, and everything else a quantitative trading shop does to make fast money.” Overall, the market-maker explanation appears more consistent with how these positions are typically managed, while the “10AM slam” narrative remains, at this stage, just that, a theory circulating on crypto X rather than a verified claim. At press time, BTC traded at $68,107. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin manipulation|Bitcoin news|bitcoin price|btc|BTC news|btc price|Jane Street",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58146867,
    "published": 1771416000000,
    "title": "Milo tops $100 million in crypto-backed mortgages, closes record $12 million deal",
    "body": "The firm, which holds mortgage provider licenses in ten U.S. states with more to follow, has a perfect track record of zero margin calls across its mortgage portfolio.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|CoinDesk Wealth|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58146973,
    "published": 1771412582000,
    "title": "Moonwell's $1.12 nightmare: A pricing glitch just let bots seize millions in ETH collateral",
    "body": "A misconfigured Chainlink price oracle on DeFi lender Moonwell briefly valued Coinbase Wrapped ETH (cbETH) at about $1 instead of roughly $2,200.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Tech|Ether|DeFi|Oracles|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58148216,
    "published": 1771418289000,
    "title": "AMLBot says social engineering drove 65% of crypto cases it probed in 2025",
    "body": "Social engineering and impersonation-related scams were the most frequent attack vectors targeting crypto investors in AMLBot’s own investigations last year.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58148293,
    "published": 1771418441000,
    "title": "WLFI Jumps Double Digits Ahead of Mar-a-Lago 'World Liberty Forum'",
    "body": "Trump-backed DeFi project World Liberty Financial is up on whale buying and a short squeeze, amid scrutiny over its $500 million UAE deal.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58149124,
    "published": 1771419886000,
    "title": "Moonwell hit by $1.78M exploit as AI vibe coding debate reaches DeFi",
    "body": "The exploit saw the Moonwell protocol exploited for $1.78 million after cbETH was mispriced at $1.12 instead of roughly $2,200, intensifying debate around AI-co-authored smart contracts.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 58148901,
    "published": 1771419648000,
    "title": "Bitcoin Falls, But Robert Kiyosaki Says He’s ‘Excited’ And Buys More",
    "body": "Robert Kiyosaki expects a sharp market slide and sees it as a chance to add to his holdings. He has named Bitcoin and Ethereum alongside gold and silver as places to park money when prices tumble. Related Reading: Bitcoin Should Be Flying—Instead, Quantum Risk Keeps It Grounded: Analyst The book author and crypto figure calls scarcity a simple reason to act now. That idea is not new, but he is putting fresh public emphasis on buying during market panic. “I am so excited and bullish on Bitcoin I am buying more and more as Bitcoin’s price goes down,” Kiyosaki said in an X post. Kiyosaki’s Scarcity Argument Kiyosaki’s view rests on one clear point: some assets are limited. Bitcoin’s capped supply is used as the main example. He believes limited supply can protect value when currencies are under pressure. “I will be buying more Bitcoin as people panic and sell into the coming crash,” he said. The strategy he’s talking about is to keep buying during price drops, taking advantage of panic to pick up more at lower levels. I Am Warning You: In Rich Dad’s Prophecy published 2013 I warned of the biggest stock market crash in history still coming. That giant crash is now imminent. The good news is those of you who followed my rich dad’s warning and prepared….the coming crash will make you richer… — Robert Kiyosaki (@theRealKiyosaki) February 17, 2026 For people who can handle big swings, that approach may produce strong gains over many years. It is an aggressive stance, and it relies on the buyer staying calm while markets move wildly around them. “This coming crash may make you richer beyond your wildest dreams if you realize crashes are the best of times to get richer,” Kiyosaki said. Market Voices Push Back Not everyone agrees with that approach. Billionaire Warren Buffett has long warned that crypto looks speculative, and financial commentator Peter Schiff argues that digital coins lack a reliable store of value. Their warnings are blunt: prices can fall much further and stay low for a long time. This tension between bullish accumulation and caution is shaping investor debate right now. Price swings in a short span are not uncommon, and those moves can test conviction. What To Watch Next Liquidity and regulatory shifts remain key factors. Large drops have often been amplified when buyers pull back or regulators implement sudden rule changes. Exchange outages, forced selling by major holders, and rapid swings in lending markets have triggered past selloffs. Reports note that macro headlines and shifts in sentiment among big investors can drive prices lower even when long-term fundamentals appear steady. Steady accumulation during such periods has historically depended on the ability to endure these shocks. Related Reading: What Bitcoin Rout? Michael Saylor Unfazed, Teases New Accumulation A Plain Takeaway Kiyosaki is making a choice about how to deal with risk: accept volatility and buy more, or avoid it and likely miss big rebounds. Both approaches have been proven right at different times. Short-term noise will be loud and distracting. Long-term results will be shown by market prices and by who keeps their nerve. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|bitcoin|btc|btcusd|buy the dip|crypto|robert kiyosaki",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58148896,
    "published": 1771419600000,
    "title": "From 2016 hack to $150M Endowment: the DAO’s second act focuses on Ethereum security",
    "body": "Ten years after the famous hack, the DAO Security Fund has decided to stake the untouched ETH and use the yield to fund Ethereum security initiatives, honor claims indefinitely, and professionalize governance and key management.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Ethereum News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 58149371,
    "published": 1771420387000,
    "title": "American crypto holders are scared and confused about this year’s new IRS tax rules",
    "body": "Crypto tax platform, Awaken Tax, polled 1,000 crypto holders about a radical shift from self-disclosure to automatic reporting of transactions.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|CoinDesk Wealth|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58150911,
    "published": 1771423200000,
    "title": "AI Agents Meet Blockchain At ETHDenver 2026: What Leaders Must Know",
    "body": "At ETHDenver 2026, AI agents to blockchain in force. Here's how builders are giving autonomous AI the tools to transact, verify identity, and operate onchain",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      }
    ]
  },
  {
    "id": 58150729,
    "published": 1771422675000,
    "title": "How Europe’s blockchain sandbox finds innovation in regulation",
    "body": "The EU regulated blockchain earlier than most major economies. Its sandbox now tests whether dialogue unlocks innovation inside legal fences.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 58151331,
    "published": 1771423928000,
    "title": "Morning Minute: Web 4.0 - Autonomous AI Agents Powered by Crypto",
    "body": "Crypto's next major use case has arrived: powering autonomous AI agents. And they're already using \"natural selection\" to evolve onchain...",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Opinion",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58153074,
    "published": 1771427227000,
    "title": "Hyperliquid starts DeFi lobbying group with $29 million token backing",
    "body": "Jake Chervinsky, CEO of the Hyperliquid Policy Center, said markets are migrating to blockchain, and the U.S. need to adopt new rules of risk being left behind.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Hyperliquid|Crypto lobbying|Jake Chervinsky|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58152760,
    "published": 1771426596000,
    "title": "Canary lists spot SUI ETF with staking rewards",
    "body": "The Nasdaq-listed SUIS fund offers direct exposure to Sui’s native token while passing through proof-of-stake rewards in a regulated ETF wrapper.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Sui|ETFs|Staking|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 96,
        "NAME": "SUI",
        "CATEGORY": "SUI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58153236,
    "published": 1771427702000,
    "title": "Bitcoin's plunge signals coming AI crisis, but massive Fed response will drive new record high: Arthur Hayes",
    "body": "The rise of artificial intelligence is likely to displace millions of workers in quick order, triggering sizable credit defaults, said Hayes.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Arthur Hayes|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58154720,
    "published": 1771430466000,
    "title": "Sai’s New Perps DEX Offers ‘Clean, CEX-like Experience’ With Onchain Settlement",
    "body": "Sai Perps launches alongside ‘Let’s Go Saicho,’ an onchain trading competition with $25,000 in prizes up for grabs.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "DeFi",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 58154667,
    "published": 1771430387000,
    "title": "Bitwise aims to offer prediction market ETFs for U.S. elections in 2026 and 2028",
    "body": "Under \"Prediction Shares\" branding, Bitwise filed to list two ETFs tracking prediction markets betting on the outcome of the 2028 presidential election.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Bitwise|Prediction Markets|ETFs|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 58154666,
    "published": 1771430316000,
    "title": "NYSE President says exchange felt ‘responsibility’ to enter tokenization space",
    "body": "The exchange is expected to launch 24/7 trading of tokenized assets later this year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|NYSE|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 58155812,
    "published": 1771432600000,
    "title": "Modern Treasury integrates stablecoin settlement alongside ACH and wires",
    "body": "The payment software company has integrated stablecoin settlement into its existing payments stack, combining USDG, USDP and USDC with traditional rails.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58155644,
    "published": 1771432254000,
    "title": "What Happens If XRP Is Building Its Final Base At These Levels?",
    "body": "XRP’s weekly structure is drawing increased scrutiny as price consolidates within a historically sensitive range. Rather than signaling an end, a prominent XRP enthusiast suggests this phase could be laying the groundwork for a major structural pivot. Understanding this setup is key to seeing how historical consolidation phases define XRP’s expansion framework. Historical Consolidation Phases Define XRP’s Expansion Framework In a recent assessment posted on X (formerly Twitter), XRP market commentator @Austin_XRPL highlighted the asset’s historical price behavior as evidence of a recurring structural process. According to a chart he posted, each major appreciation cycle was consistently preceded by prolonged consolidation, during which price carefully built acceptance before advancing. Related Reading: Historic Trend That Led XRP To A Sharp 40% Trend Has Just Reappeared He points to the $0.15–$0.30 range as the earliest modern base, where XRP spent roughly two years forming foundational support before moving higher. Similar behavior occurred between $0.30–$0.50, establishing another two-year launch platform that allowed accumulation to occur efficiently. As price climbed, consolidation periods shortened but remained critical: $0.50–$0.75 saw about 18 months of structured interaction, followed by nearly a year of basing between $0.75–$1.30. Even the upper macro region of $1.80–$3.40, often interpreted through a distribution lens, recorded more than a year of sustained trading and accumulation. Austin’s framework emphasizes that expansions only follow extended structural preparation and disciplined accumulation. If XRP is now building a “final base” at current levels, the implication is clear: adequate consolidation could lay the necessary groundwork for the next significant and potentially long-term markup phase. Building The Final Base: $1.30–$1.80 In Focus Austin identifies the $1.30 to $1.80 range as the only major zone on XRP’s macro chart that never formed a proper base. His chart shows the price moved through this corridor rapidly during prior rallies, leaving minimal consolidation. Related Reading: XRP Sees Re-Accumulation Signals From Korean Trading Desks As Traders Quietly Build Positions He classifies the area as an inefficient range, where price advances without establishing durable support. Structurally, markets often revisit such zones to stabilize liquidity and build balance where trading activity was previously thin. Recent weekly price action shows XRP transacting within this corridor rather than rejecting it. Austin interprets this as structural repair, describing the behavior as gap-filling — price rotating inside the range to establish acceptance. If this process continues, he views it as a base formation. Converting this historically underdeveloped corridor into support would close what he considers the final structural gap on the macro chart, leaving all lower zones with established consolidation histories. The implication is reduced resistance above. Because XRP spent limited time consolidating beyond this band in prior cycles, overhead supply may be thinner once expansion begins. Within this framework, completing a base here signals late-stage preparation. With the inefficiency resolved and support established, XRP would be structurally positioned to transition from consolidation into expansion, with any breakout reflecting completed market structure rather than sentiment-driven momentum. Featured Image from Peakpx, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|@Austin_XRPL|Ripple|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58156338,
    "published": 1771433462000,
    "title": "Trump family-backed WLFI token surges 23% ahead of Mar-a-Lago crypto forum",
    "body": "Although US President Donald Trump was not slated to appear at today's event, it will include two senators, the CFTC chair, and industry leaders.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58156953,
    "published": 1771434883000,
    "title": "Bitcoin miner Riot Platforms stock jumps nearly 9% as Starboard urges AI data center expansion",
    "body": "The activist investor said Riot's 1.7 GW power capacity can drive premium AI hosting deals at Texas sites.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Crypto-Mining|Bitcoin News|Riot platforms|AI|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58157063,
    "published": 1771434725000,
    "title": "Goldman CEO Solomon, Long a Crypto Skeptic, Says He Owns Bitcoin",
    "body": "Long a cryptocurrency skeptic, Goldman Sachs Group Inc. Chief Executive Officer David Solomon now owns Bitcoin.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "NYS:GS",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58157838,
    "published": 1771436502000,
    "title": "SocGen's FORGE expands euro stablecoin to XRP Ledger in multi-chain push",
    "body": "The French banking group’s digital asset unit deploys EUR CoinVertible on a third public blockchain, alongside Ethereum and Solana.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58158522,
    "published": 1771437928000,
    "title": "Canary, Grayscale Sui ETFs Hit US Markets With Staking Rewards",
    "body": "The first Sui ETFs are now trading as Canary and Grayscale bring staking-enabled crypto exposure to traditional markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58160288,
    "published": 1771441658000,
    "title": "Kraken continues acquisition streak by buying token management firm Magna ahead of IPO push",
    "body": "The deal adds token lifecycle infrastructure to Kraken’s growing product suite.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Kraken|acquisition|Magna|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58160495,
    "published": 1771441945000,
    "title": "Sam Altman's OpenAI unveils ‘EVMbench’ to test whether AI can keep crypto’s smart contracts safe",
    "body": "Developed with Paradigm, the tool is OpenAI’s attempt to determine whether modern AI systems are up to the task of helping prevent smart contract issues.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Sam Altman|Openai|smart contracts|Paradigm|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58160990,
    "published": 1771443036000,
    "title": "Cup And Handle Pattern Puts XRP Price At $60 After Hitting Resistance",
    "body": "Crypto analyst CryptoBull has highlighted a bullish pattern that could send the XRP price to as high as $60. This ultra-bullish prediction comes as the altcoin continues to struggle below key resistance levels amid the current crypto market downtrend. XRP Price Could Reach $60 With This Cup and Handle Pattern In an X post, CryptoBull revealed that a Cup and Handle pattern is unfolding on the monthly chart and that the measured target for XRP is $60. In another X post, the analyst suggested that the altcoin’s downtrend may be over soon and that it could begin a run into double digits. Related Reading: Analyst Predicts XRP Price Will Reach $13 In 3 Months As Accumulation Ends This came as he drew attention to the Relative Strength Index (RSI) on the weekly and monthly timeframes, noting that it is below the 2020 bottom of $0.11. He added that the upside for the RSI is huge and that this will put the XRP price well above $10 very soon. Interestingly, the analyst declared that XRP, not Ethereum, will lead the altcoin season. He added that the chart shows a rounding bottom and that the next move is up. Crypto analyst Dark Defender also predicted that the XRP price could reach double digits at some point. In an X post, he stated that the altcoin has been proceeding in an ascending trend channel since 2017 and that the W Pattern is intersecting the Fibonacci level at $18. He added that nothing can stop what is coming. His accompanying chart showed that the altcoin could reach this $18 price target this year. XRP Is Still Facing Resistance At The Moment Crypto analyst CasiTrades noted that the XRP price is still facing resistance at the $1.65 level. The altcoin had rallied to this price level over the weekend but faced resistance there, leading to a sharp decline below key levels. With the price now below $1.53 again, CasiTrades stated that this suggests that the altcoin is losing momentum. Related Reading: XRP On The Verge? The Major Bullish Structure Shift That Could Send Price Soaring The analyst further remarked that with the strength of the selloff a few weeks ago, it is unlikely that the market pivots straight into macro Wave 3 without one more wave down to fully exhaust sellers. As such, there is the likelihood of XRP dropping to new lows before any potential bullish reversal to a new all-time high. CasiTrades stated that on the subwaves, there is alignment for a double bottom near $1.11, with a further drop to around $0.90 also still possible. She added that what matters now on the next low is seeing strong bullish divergence and momentum shift. On the bullish side, she noted that if the XRP price reclaims $1.65 and holds, it would be the first real sign of strength. At the time of writing, the XRP price is trading at around $1.47, down in the last 24 hours, according to data from CoinMarketCap. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|altcoin|Altcoin Season|CasiTrades|CoinMarketCap|cryptobull|Cup and Handle Pattern|Dark Defender|Fibonacci Level|Relative Strength Index|Ripple|RSI|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58161721,
    "published": 1771444373000,
    "title": "Riot Platform‘s AI/HPC push could net up to $21B, says activist holder",
    "body": "Starboard Value said that “time is of the essence,” stressing urgency in Riot getting “more material deals completed” related to AI and HPC.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58162210,
    "published": 1771427767000,
    "title": "Brevan Howard Cuts Bitcoin ETF Holding, Expands Options Position",
    "body": "Brevan Howard Capital Management has overhauled its position in BlackRock’s iShares Bitcoin Trust, becoming the largest seller of the spot ETF in the fourth quarter as Bitcoin’s rally unraveled.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NYS:BLK",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58162323,
    "published": 1771445502000,
    "title": "Ether 'bear pennant' puts target on $1.1K ETH price: Here’s why",
    "body": "Ethereum onchain data and a bear pennant on the daily chart suggest that bears may target the $1,100 level. Would a dip to that zone represent a generational buy opportunity?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58163004,
    "published": 1771447033000,
    "title": "Bitcoin sinks to $66,000, U.S. stocks lose steam as Fed minutes mention possible rate hike",
    "body": "Bitcoin is now on track for its fifth consecutive weekly decline, and losing this level could open the floor for a fresh leg lower.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Market Wrap|U.S. Dollar|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58162845,
    "published": 1771446548000,
    "title": "DerivaDEX launches Bermuda-licensed derivatives exchange under DAO governance",
    "body": "The decentralized exchange has begun offering crypto perpetual swaps after receiving a test license from Bermuda’s regulator, operating under DAO governance and formal oversight.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58163787,
    "published": 1771448684000,
    "title": "Peter Thiel Exits ETHZilla Investment After Ethereum Treasury Stock Craters",
    "body": "Billionaire investor Peter Thiel and Founders Fund held a 7.5% stake in Ethereum treasury company ETHZilla last year—but not anymore.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58163637,
    "published": 1771448445000,
    "title": "XRP’s Real Value Will Arrive When Infrastructure Is Ready — Here’s Why",
    "body": "The long-term value of XRP is increasingly tied to the development of the global financial infrastructure it was designed to support. Rather than relying on short-term price speculation or fixed adoption timelines, XRP was designed to operate at the plumbing level of global finance, where adoption depends on regulatory clarity, institutional integration, liquidity depth, and real transaction flow. These systems are built quietly, tested extensively, and activated only when reliability is proven. Why Financial Infrastructure Comes Before XRP Mass Adoption XRP’s journey has never been hitting precise timestamps on the chart, because utility does not operate on a calendar. An analyst known as ChartNerd on X has revealed that the journey to $27 has been a projected path for years, and based on a stack of multiple Fibonacci time maps and extension targets, the road to 2030 is where the vision fully aligns. Related Reading: Ripple’s Next Steps: Where XRP Stops Being Trade And Starts Being Infrastrucutre ChartNerd argues that what the market is witnessing right now is the groundwork for the foundation-building phase led by Ripple, following regulatory clarity from the US Securities and Exchange Commission (SEC). This phase includes expanding institutional infrastructure, banking charters, and ETF inflows, all of which require time to scale before translating into measurable price impact. In that context, the short-term noise might fluctuate about the price action. However, the macro trend for XRP points toward progressive valuation milestones of $8, $13, and ultimately the $27 zone targets as the global settlement adoption scales. This thesis is not about timing individual candles, but about a structural shift towards 2030, where utility-driven value overtakes market speculation. How The XRP Ledger Becomes A Safe Infrastructure To Integrate The passing of the Clarity Act would mark a decisive turning point for XRP. A crypto analyst known as Bird on X has noted that the leading altcoin already has a unique level of legal clarity due to prior court rulings that confirmed it is not inherently a security when traded on secondary markets, an advantage most digital assets are still waiting to acquire. Related Reading: Japan’s XRP Integration Signals A Shift In Global Capital Flows According to Bird, the Clarity Act would move a step further by establishing a defined regulatory framework for digital assets, especially how they are classified and used, removing uncertainty for institutions, payment providers, and large-scale capital allocators. Once the rules are written into law, the biggest barrier, which is regulatory hesitation, will no longer sit in the background of every integration decision. With regulatory hesitation reduced, broader adoption can accelerate, liquidity will deepen, and real utility can finally scale at speed, because companies can now gain the confidence to build on and integrate the XRP Ledger (XRPL) without worrying about sudden rule changes. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Bird|CLARITY Act|Ripple|US SEC|US Securities and Exchange Commission|xrp|XRP Ledger|xrp news|XRP Price|XRPL|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58164395,
    "published": 1771450254000,
    "title": "Eric Trump Doubles Down On $1M Bitcoin Forecast, Calls Banking A ‘Ponzi Scheme’",
    "body": "The World Liberty Forum held this week at Mar‑a‑Lago featured remarks from President Donald Trump’s sons, Eric Trump and Donald Trump Jr., who used the event to reaffirm their strong support for Bitcoin (BTC) and repeat their long‑standing $1 million price projection for the cryptocurrency. ‘Never Been More Bullish On Bitcoin’ Speaking on Wednesday, Eric Trump described himself as “a huge proponent of Bitcoin” and said he has never felt more optimistic about the asset’s future. “I’ve never been more bullish on bitcoin in my life,” he said, arguing that the digital currency has the potential to eventually reach $1 million per coin. Related Reading: Macro Wobbles May Send Bitcoin Back To The $50,000s, Industry CEO Claims However, amid falling Bitcoin prices, Eric acknowledged the asset’s volatility and characterized price swings as typical for an emerging technology with significant growth potential. In his view, Bitcoin’s upside contrasts sharply with traditional fixed‑income investments such as municipal bonds or US Treasuries (T-Bills), which generally offer lower yields. At the same time, Donald Trump Jr. offered sharp criticism of the traditional banking system, calling it a “Ponzi scheme” and arguing that the family’s move into crypto was not driven by trend‑chasing but by necessity. Trump Brothers Accuse Banks Of Political ‘Debanking’ During an interview with CNBC at the forum, Donald Trump Jr. said his family turned to digital assets after banks closed “hundreds of accounts” belonging to the Trump Organization in early 2021. “You know, we didn’t get into crypto because we were on the leading edge,” Trump Jr. said. “We got into it out of necessity. They basically forced us into it.” The brothers attributed the account closures to the political fallout following the January 6, 2021, riot at the US Capitol, when supporters of their father stormed the building while contesting the 2020 presidential election results. Related Reading: $274 Billion In Potential Bitcoin Selling Could Hit Markets, Expert Says They also claimed that banks had “debanked” other smaller clients over their conservative political views. Eric Trump said their crypto initiative, World Liberty Financial, is part of a broader effort to reshape the financial system. “We’re trying to modernize finance,” he said, adding that the family felt ostracized by mainstream institutions during that period. “We’re the most canceled people in the world in 2020, 2021,” he said. As of this writing, Bitcoin is still consolidating at approximately $66,258. This represents a 50% difference from the current trading prices and the all-time high of $126,000, which was reached last October. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|BTCUSDT|crypto|crypto market|crypto news|cryptocurrency|Donald trump Jr|Eric trump|Trump|Trump news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58164891,
    "published": 1771451190000,
    "title": "Bitcoin Miner Riot Must Embrace $21 Billion AI Opportunity, Says Activist Investor",
    "body": "An activist investor said Bitcoin miner Riot Platforms needs a \"renewed sense of urgency\" in order to capitalize on the major AI opportunity.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58165383,
    "published": 1771452202000,
    "title": "Can AI Agents Boost Ethereum Security? OpenAI and Paradigm Created a Testing Ground",
    "body": "OpenAI and Paradigm launched EVMbench, a tool that tests how capable AI agents are at finding and fixing smart contract vulnerabilities.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58165446,
    "published": 1771452144000,
    "title": "Coinbase's Base transitions to its own architecture with eye on streamlining",
    "body": "The Base engineering team said the protocol would remain open-source and encouraged developers to continue building unique implementations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58165911,
    "published": 1771453380000,
    "title": "Real estate billionaire Barry Sternlicht is ready to tokenize assets, but says U.S. regulation blocks it",
    "body": "The $125 billion real estate firm wants to offer blockchain-based tokens to clients but is stalled by regulation.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Tokenization|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 58166146,
    "published": 1771453838000,
    "title": "XRP Funding Levels Drop To Extreme Negative Levels, What This Means For Price",
    "body": "XRP’s derivatives markets are still showing signs of bearish pressure, with funding rates across major exchanges now in negative territory. According to real-time data, funding rates have been predominantly below zero in recent trading sessions, with the lowest exchange funding rate recorded around -0.0748%. At the same time, open interest has returned to levels associated with long-term base zones in previous years. Could this environment lead to a turning point, or is further downside still unfolding for XRP’s price action? Bearish Derivatives Positioning Shows In Deeply Negative Funding Real-time funding metrics from Coinglass reveal that XRP’s average funding across major exchanges has dipped into negative readings, and several crypto exchanges are on bearish rates. At the time of writing, the lowest funding observed is at -0.0748%, which is a clear indication that short positions are currently dominating sentiment. Related Reading: Analyst Reveals What XRP Price Will Move Toward In Bid For $4 Negative funding rates mean that perpetual futures shorts are paying longs, and bearish bets outweigh bullish ones across exchanges. In practice, heavily negative funding can reflect overcrowded short exposure. However, this is a condition that sometimes precedes sharp rebounds if the price begins to stabilize, as short sellers may eventually be forced to cover. Technical analysis posted on the social media platform X by crypto analyst Osemka shows that XRP’s aggregated funding rate, weighted by open interest, is in deep negative territory on a weekly timeframe. As it stands, this metric is now at its lowest level since late 2022, only bested by the week of the November 2022 FTX crash. However, the interesting thing is that the prolonged period of negative funding back then marked a bottom in 2022. Open Interest Returns to Multi-Year Base Levels Open interest has also dropped significantly alongside funding in negative levels. The weekly aggregated open interest metric is now sitting on levels associated with previous multi-year accumulation bases. This base, shown in the chart above, has been acting as the base level for open interest since October 2022. Each time open interest has revisited this zone since then, it has been followed by a rebound to higher levels. Related Reading: Here’s The Mistake Most People Are Making With XRP; Pundit Reveals In terms of price action, XRP has been struggling to find a sustainable bottom because the wider crypto market is yet to turn bullish. As it stands, XRP now needs to hold above two intermediate supports. The first of these is around $1.45, where recent daily candles have registered wicks. Beneath this lies a larger demand area roughly spanning $1.15 to $1.30. On one hand, the negative funding rate points to bearish positioning stress, but history shows this has always occurred just before lows. At the time of writing, XRP is trading at $1.49, although it recently traded above $1.60 during the weekly open. A weekly close above $1.50 will be the first step to confirming a return to bullish momentum. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP News|Coinglass|FTX|OI|open interest|Osemka|Ripple|xrp|XRP Funding Rate|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58166646,
    "published": 1771454700000,
    "title": "Bitcoin bottom signal that preceded 1,900% rally flashes again",
    "body": "Bitcoin’s “short-term holder stress” metric has fallen to lows not seen since 2018, suggesting the market has capitulated and possibly bottomed.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58168099,
    "published": 1771457400000,
    "title": "Solana futures data shows panicked bulls: Will $80 SOL hold?",
    "body": "A drop in Solana’s dApp revenues, along with limited institutional and retail investor interest, adds vulnerability to SOL’s $78 support.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 58168917,
    "published": 1771459246000,
    "title": "Bitcoin Structure Weakens Below $72,000 Despite Tight Range",
    "body": "Bitcoin continues to trade within a tight range, but beneath the surface, structural weakness is becoming increasingly evident. With price holding below the key $72,000 level, now acting as resistance, the broader technical outlook remains fragile, and any short-term consolidation may simply be masking underlying downside risk. Bitcoin Enters Clear Corrective Phase Bitcoin has entered a clear corrective phase after peaking in the $120,000–$125,000 region. Crypto analyst Alejandro₿TC notes that the weekly structure has broken to the downside, with the latest leg unfolding impulsively, a sign that momentum currently favors sellers rather than buyers. Related Reading: Bitcoin Ready To Bounce Again? The Major Accumulation Trend You Should Be Aware Of The key level to watch is the $72,000–$74,000 zone. Previously acting as strong support, this area has now been lost and flipped into resistance. As long as Bitcoin continues to close below this range on the weekly timeframe, any upward movement should be viewed as a corrective bounce rather than confirmation of a sustained reversal. On the downside, the $50,000–$52,000 region stands out as the primary magnet. This zone represents a significant weekly demand area and the base of the prior impulsive rally. If bearish pressure persists, it becomes the most logical target for a deeper retracement. The upcoming monthly close in 11 days could be decisive. A close below $72,000 would confirm the breakdown and increase the probability of further downside. Structurally, the market remains weak beneath that level, while a decisive reclaim above $74,000 would mark the first meaningful signal that strength is returning. Compression Intensifies Near $68,000 With volatility compressing as price trades within an increasingly narrow band, Bitcoin continues to coil tightly around the $67,000–$68,000 region. The lack of decisive movement in either direction suggests that the market is building energy for a larger expansion move. Related Reading: Bitcoin Eyes Untapped Liquidity: $64,000 Support Could Be Next Target According to Columbus, liquidity continues to build above the $70,000 level, and notable bids remain layered between $64,000 and $66,000. With liquidity stacked on both sides, the market is effectively squeezed between opposing forces, waiting for a catalyst. The longer Bitcoin remains trapped inside this tightening structure, the more aggressive the eventual breakout tends to be. Compression phases like this typically end with strong displacement, as one side of the market is forced to unwind positions. From here, sustained acceptance above the $69,500–$70,000 area would likely open the door for momentum toward heavier liquidity zones overhead. On the other hand, failure to reclaim that threshold keeps downside probes into the mid-$60,000s firmly in play, especially if bids begin to thin out under pressure. The next decisive move will likely be driven by which side of liquidity gets targeted first. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|Alejandro₿TC|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|Columbus",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58169565,
    "published": 1771460400000,
    "title": "South Korea’s Hanwha makes a $13 million bet on ‘seedless’ crypto wallets",
    "body": "The South Korean financial firm backs the U.S.-based blockchain company to accelerate enterprise wallet technology and real-world asset tokenization.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Wallets|Tokenization|Real World Assets|South Korea|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58171650,
    "published": 1771464637000,
    "title": "Ethereum Decision Point: It’s Time To Start Panicking If Price Breaks Below $1,800",
    "body": "Ethereum (ETH) is back on the knife’s edge, and market analyst Crypto Patel has suggested that there may be no room left for optimism if the next key level gives way. According to the analyst, the Ethereum price is hovering at a critical decision point beneath $2,000 after recording multiple price declines. However, a breakdown below $1,800 could trigger a massive crash. Ethereum Records Multiple Failed Bullish Structures In an X post this Monday, Crypto Patel admitted that Ethereum had broken his heart twice, pointing to two failed bullish structures that have now reshaped its broader outlook. The first dagger, as the analyst calls it, came when a clean Bull Flag formation emerged, and price broke down from the $3,700 region. Related Reading: This Ethereum Hidden Bull Divergence Says Price Will Rise Over 100% To Break $4,900 ATH On the chart, that breakdown marked the end of a multi-month climb that had pushed the ETH price toward the $4,700 to $4,900 area in late summer 2025 before rolling over under a descending trendline that capped every rally attempt. The second dagger followed months later as an ascending triangle structure collapsed at the critical $3,000 support zone. What had looked like a tightening consolidation beneath horizontal resistance instead turned into a decisive breakdown. The former support zone around $3,100 to $3,500 flipped into resistance, marked by repeated rejection wicks and lower highs pressing against the descending purple trendline on the chart. Based on Crypto Patel’s analysis, that failure led to a sharp drop below $2,000. Consequently, Ethereum is now trading between $2,000 and $1,850, a range the analyst describes as the last buffer before a much deeper pullback. $1,800 Emerges As ETH’s Critical Support On the daily timeframe, Crypto Patel’s chart shows ETH recently printing around $1,982 after a sharp sell-off that sliced through its previous structure. Although the cryptocurrency has recovered slightly above $1,990, the previous decline had driven its price down from roughly $3,100 in early 2026 to sub-$2,000 levels in a matter of weeks. This left a visible imbalance zone between $2,400 and $2,600, which the analyst marks as a potential Fair Value Gap (FVG). Related Reading: Ethereum Price Is Not Going To Keep Falling Forever, Analyst Says For now, all attention is on $1,800. Crypto Patel has predicted that if Ethereum holds this critical support, a relief bounce toward $2,650 becomes the immediate upside target, likely filling part of that imbalance zone and retesting former breakdown areas. On the flip side, if $1,800 fails, a broader market panic may become justified. According to Crypto Patel, a decisive break below this support could open the path toward $1,300, marked by the lower green demand block on the chart. He has also labeled this region as strong support and the best accumulation zone, where buyers could step in aggressively. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum|Ascending Triangle Structure|Bull Flag Formation|Crypto Patel|Descending Trendline|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|ethusd|ETHUSDT|Fair Value Gap|FVG",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]