[
  {
    "id": 54782895,
    "published": 1763881872000,
    "title": "Bitcoin ATM firm explores $100M sale following CEO’s federal indictment",
    "body": "Crypto Dispensers is weighing a $100 million sale as its CEO faces federal accusations of running a multimillion-dollar money laundering scheme.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54789243,
    "published": 1763892873000,
    "title": "Zcash risks ‘splitting the vote’ against Bitcoin, Bloomberg ETF analyst warns",
    "body": "Bloomberg’s Eric Balchunas says Zcash could dilute political and cultural support for Bitcoin, as critics accuse the privacy coin of manufactured hype.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54791579,
    "published": 1763892039000,
    "title": "Top Analyst Sounds Alarm: Bitcoin Is Highly Unlikely To Spring Back Anytime Soon",
    "body": "Bitcoin is trading in a fragile state after slipping below $90,000 and now in the mid-$80,000s. This price action has caused some analysts to grapple with the possibility that the next major rally may be further away than many expect. A recent technical outlook from prominent crypto analyst Tony “The Bull” Severino adds weight to this concern. His analysis focuses on the 6-week LMACD momentum indicator, which has just crossed bearish for the first time in years. Related Reading: Dogecoin Goes Wall Street: Grayscale Confirms Nov. 24 ETF Launch Momentum Turns Against Bitcoin On The 6-Week LMACD The technical outlook highlights a strong warning from Severino, who argues that Bitcoin is nowhere close to staging the kind of explosive recovery many are waiting for. Severino’s message revolves around momentum, which he says is now firmly pointed downward. The momentum is cited using the recent crossover on the 6-week LMACD, which is known for its decisive crossovers that confirm long-term trend changes. The 6-week LMACD is a lagging signal, meaning that by the time it flips bearish, Bitcoin is already well into a downturn. The chart confirms this with multiple examples: Bitcoin entered extended red phases lasting 812 days, 861 days, and 686 days following previous bearish crossovers. Because the signal lags price action, Bitcoin typically bottoms long after the crossover occurs. Severino noted that bear-market lows always appear between 250 and 365 days after the bearish flip, not within a few weeks. Therefore, traders expecting a bottom only 40 days after the new signal are ignoring how consistently slow this indicator behaves. The chart also highlights how severe each downturn becomes once the LMACD flips bearish. Previous cycles saw drawdowns of roughly 69% to 75% from the moment the cross happened, even though Bitcoin had already fallen significantly before the indicator flashed. Please pay attention to this post if you want to understand why Bitcoin is highly unlikely to suddenly spring back into a bull run One word: Momentum The 6-week LMACD has some of the cleanest crossovers representing pivotal trend change confirmation points. The signal lags,… pic.twitter.com/mq9uR2Fqec — Tony “The Bull” Severino, CMT (@TonyTheBullCMT) November 22, 2025 A Possible Long Road Before Any Significant Recovery Although the LMACD signal just crossed bearish, the current crossover is still unconfirmed for another 15 days, and the resemblance to past cycles is something to keep in mind. Severino noted that he is not predicting the end of Bitcoin’s long-term prospects, but he is urging traders to stop expecting rapid upside. Past behavior does not guarantee the same outcomes, and there is no certainty that Bitcoin will drop another 70% from here like previous cycles. Related Reading: Kiyosaki Dumps Bitcoin At $90K After Predicting A $250K Moonshot – Here’s Why The 6-week LMACD is a high-timeframe signal, and the shifts it captures reflect deep structural trends rather than short-term fluctuations. This means Bitcoin could still be months away from its true cycle bottom. At the time of writing, Bitcoin is trading at $85,670, down by 11% and 23% in the past seven and 30 days, respectively. Severino’s analysis means that the Bitcoin price could spend a prolonged period hovering around these levels or experience a further decline before any meaningful recovery into a new bull phase begins. Featured image from See The Wild, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|Bear market|bitcoin|btc|btcusd|crypto",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54792438,
    "published": 1763898010000,
    "title": "Grayscale calls Chainlink the ‘crictical connective tissue’ of tokenized finance",
    "body": "Grayscale says Chainlink will anchor the next phase of blockchain adoption, positioning LINK as the core infrastructure powering tokenization.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54793983,
    "published": 1763901000000,
    "title": "Cardano Temporarily Splits Into Two Chains After Attacker Uses AI-Generated Script to Exploit a Known Bug",
    "body": "The divergence emerged when newer nodes accepted a malformed transaction that older nodes rejected.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Cardano|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 54797105,
    "published": 1763906417000,
    "title": "On-Chain Metric Tips Ethereum To Form Price Bottom Below $2,000 – Here’s Why",
    "body": "Ethereum has been a major victim of the ongoing crypto market onslaught, recording a 27.63% loss in the last month alone. The largest altcoin now trades around $2,800, representing a significant fall from the local cycle peak around $4,800. As prices continue to tumble with each new drop triggering waves of liquidation, analyst Ali Martinez has postulated on a market bottom target. Related Reading: Ethereum Golden Pocket In Play – Can ETH Turn The Tide Above $2,800? ETH MVRV Pricing Bands Reveal Potential 28% Decline Ahead In an X post on November 22, Martinez shares critical on-chain data that suggests Ethereum may be headed for a local bottom target around $2,000. For context, the MVRV Pricing Bands are valuation bands derived from the MVRV ratio and Realized Price (RP), designed to indicate when a cryptocurrency (such as ETH) is undervalued, fairly valued, or overvalued based on its on-chain investor cost basis. This on-chain metric reveals a set of price levels calculated by multiplying ETH’s Realized Price by different fixed multiples (e.g., 0.8x, 1.0x, 2.4x, 3.2x), with each band representing a different degree of under- or over-valuation relative to the average investor’s cost basis. Using historical data on this metric, Martinez has identified that Ethereum tends to form a local bottom only when it dips below the lowest pricing band, i.e., 0.8× RP band (blue line). This pattern has consistently played out over the past three years, with clear examples in June 2022, December 2022, and most recently in March 2025. Notably, the current 0.8x RP band stands at $2,007.08. If ETH is repeating historical behavior, then investors should expect another 28% correction from the present market levels to $2000 before a price rebound kicks in. Related Reading: Pundit Reveals Why XRP Price At $1,000 Is Not A Dream – ‘It’s Math’ ETH RP Indicates Investors Remain In Profit — But Not For Long The Realized Price is defined as the average acquisition price of all circulating ETH tokens. It can be described as the true on-chain value of ETH, with any price gain above this level indicating a profit for an average investor and vice versa for a loss. According to Martinez’s on-chain analysis, ETH’s current market price is barely above its realized price at $2,508. While this observation suggests most investors are still in profit, the recent corrections and the extended downtrend indicate a cause for worry, especially as positive market sentiment gets increasingly weaker. While a price fall below $2,500 may pull so many investors into losses, it could also accelerate the token’s decline to $2,000 and trigger a price rebound. Looking at potential mid-cycle targets, this next bullish wave could push Ethereum to trade around $6,021. At press time, Ethereum is valued at $2,820, reflecting a slight 1.73% gain in the last day. Featured image from Flickr, chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum|Ali Martinez|ethereum|Ethereum Local Bottom|Ethereum MVRV Pricing Bands|Ethereum Realized Price|Ethereum Support|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54797655,
    "published": 1763907394000,
    "title": "Bitcoin Rebounds From 'Extreme Oversold' Levels; XRP Jumps 7%, ZEC Surges 14%",
    "body": "Bitcoin and major altcoins bounced Sunday after an oversold RSI reading and more than $200M in liquidations signaled seller exhaustion amid thin weekend liquidity.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Markets|btc|Bitcoin News|XRP News|Zcash|Altcoins|Technical Analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54799138,
    "published": 1763910000000,
    "title": "Sunrise Debut Streamlines Solana Token Imports as Monad Goes Live",
    "body": "The platform introduces a unified gateway that allows issuers and users to move tokens from any ecosystem into Solana.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Wormhole|Solana News|Monad|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54801255,
    "published": 1763913656000,
    "title": "Bitcoin Rapid Downturn Triggered By Excessive Long Positions — Expert Weighs In",
    "body": "According to the latest on-chain data, investors have been excessively betting on the Bitcoin price in recent weeks, leading to its overall struggles. Longs Vs Shorts Imbalance — How This Induced Price Crash In a November 22 post on social media platform X, Alphractal CEO and founder Joao Wedson revealed the underlying dynamics behind Bitcoin’s recent unchecked fall. In deciphering this downward trend, the crypto pundit evaluated the Estimated Long/Short Positions metric, which estimates how much of the Open Interest across exchanges is dedicated to long positions relative to short positions. Wedson reported that, across 19 exchanges, there are about 71,000 BTC positioned in longs, while a relatively smaller amount of BTC (27,900) is dedicated to shorts. While this observation does not include data from the Chicago Mercantile Exchange (CME), the discrepancy between longs and shorts remains unusually large. Related Reading: Kiyosaki Dumps Bitcoin At $90K After Predicting A $250K Moonshot – Here’s Why This imbalance is significant because when there are clusters of long positions at similar price levels, the market tends to lean into a more fragile state. Moderate pullbacks beneath these clusters often lead to a cascade of forced liquidations (known as a long squeeze) — an event which could in turn push prices further south. Notably, Wedson pointed out that traders must have been convinced that $100,000 was Bitcoin’s price bottom — a speculation that soon became null after its failure. Afterwards, $90,000 came into focus, with another series of liquidations following suit. At the moment, $84,000 seems to be the price majority of Bitcoin’s speculative traders target as the new price bottom. These liquidation events that took place after the $100,000 and $90,000 supports were breached provided more buy-side liquidity for the Bitcoin price to topple. At the same time, most significant short positions have been closed off, making it difficult for a more defined price recovery to take place, as there is barely any sell-side liquidity to send the Bitcoin price to the upside. For Bitcoin to recover, Wedson explained that there needs to be a significant decrease in long positioning, while short exposure goes on the rise. Watch Out For $81,250 — Analyst In another post on X, technical analyst Ali Martinez noted that Bitcoin’s 2-year moving average, which stands at approximately $81,250, is an important landmark for the future trajectory of the flagship cryptocurrency. The analyst explained that historical failures of the 730-day SMA have often marked the beginnings of bear markets. Thus, in the scenario where the Bitcoin price slips past its current 2-year average price, we could be witnessing the start of a long bearish cycle As of press time, Bitcoin holds a valuation of $86,251, reflecting an over 3% price jump in the past 24 hours. Related Reading: Only An Asteroid Can Sink MSTR’s Bitcoin Bet, CryptoQuant CEO Says Featured image from iStock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|bitcoin longs|Bitcoin news|bitcoin price|btc|btc price|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54809468,
    "published": 1763928000000,
    "title": "Bitcoin Exchange Inflow Hits $2 Billion As Profit-Taking Phase Lingers",
    "body": "After days of intense bearish action, the price of Bitcoin appears to be entering a calmer state, as it recovers above the $86,000 level. The latest on-chain data shows that several investors tried to take some profit in the past week, providing a basis for the premier cryptocurrency registering a double-digit loss. Bitcoin Exchange Inflow Spikes As Price Faces Downward Pressure In a recent post on the social media platform X, crypto analyst Ali Martinez revealed that significant Bitcoin amounts were sent to centralized exchanges in the past week. Data from Santiment shows that about $20,000 BTC (worth nearly $2 billion) has been moved to these exchanges in the past seven days. Related Reading: Risks To Crypto Market Ahead Of Key MSCI Ruling: Will It Spark A New Bitcoin Sell-Off? The relevant indicator in this on-chain observation is the Exchange Inflow metric, which tracks the volume of an asset (in this case, Bitcoin) that flows to centralized exchanges within a specified period. This metric is often important because one of the prominent exchanges’ service offerings is selling. Hence, an increase in the Exchange Inflow metric suggests the potential offloading of an asset by investors. The resulting increased supply of this cryptocurrency in the open market often adds downward pressure on the coin’s price, especially if there is no corresponding increase in demand. In a separate post on X, CryptoQuant’s head of research, Julio Moreno, shared a data piece supporting the recent spike in exchange inflows. According to data highlighted by the crypto researcher, the Bitcoin exchange inflows stood at about 81,000 BTC (the highest level seen since mid-July) on Friday, November 21. Ultimately, this recent spike in exchange inflows explains the volatility experienced by the price of Bitcoin on Friday. The flagship cryptocurrency succumbed to significant bearish pressure, seeing its price fall to just above $80,000 as the weekend approached. As of this writing, the price of BTC stands at around $86,070, reflecting an over 2% jump in the past 24 hours. Bitcoin In Profit-Taking Phase: CryptoQuant CEO CryptoQuant CEO Ki Young Ju revealed that Bitcoin is in a profit-taking phase, as evidenced by the rising exchange inflows. The crypto founder made this assertion based on the PnL Index Signal, which measures profit and loss levels using all wallets’ cost basis. With the current reading of the PnL Index Signal, Ju proclaimed that the classic cycle theory says that BTC is entering a bear market. According to the CryptoQuant CEO, only macro liquidity can override the profit-taking cycle—just as seen in 2020. Hence, all eyes will be on the Federal Open Market Committee (FOMC) meeting in December, especially with the falling expectations of an interest rate cut by the US Federal Reserve (Fed). Related Reading: XRP Price Has Surged 15% Anytime This Metric Appeared In The Past Featured image from iStock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin Exchange Inflow|Bitcoin news|bitcoin price|btc|btc price|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54811562,
    "published": 1763931600000,
    "title": "ETF Outflows, Stablecoin Flows and DAT Reversals Signal Crypto Capital Flight: NYDIG",
    "body": "Spot bitcoin ETFs have seen persistent outflows ($3.55 billion in November), and stablecoin supply has declined, indicating capital is leaving the market, NYDIG Said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|NYDIG|Digital Asset Treasury|Spot bitcoin etf|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54811740,
    "published": 1763931570000,
    "title": "Strategy and Bitcoin supporters call for 'boycott' of JP Morgan",
    "body": "The tension erupted following news that Strategy and other crypto treasury companies would likely be excluded from major market indexes.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54813672,
    "published": 1763935262000,
    "title": "Why This Billionaire Collector Continues to Buy NFTs in 2025",
    "body": "Businessman Adam Weitsman recently doubled down on NFTs with a record Meebits purchase, and says he’s never sold an NFT—and doesn’t plan to.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|NFTs",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54813593,
    "published": 1763935202000,
    "title": "Bitcoin Veterans Cashing Out Could Trigger Deeper Losses, Schiff Claims",
    "body": "Bitcoin has tumbled more than 30% from its all-time high of $126k and is trading around $85,500 after briefly falling to $82K, according to market reports. Traders warn that recent moves by long-term holders are changing how the market reacts to stress. Liquidity has thinned, and that makes price swings larger than usual. Related Reading: Dogecoin Goes Wall Street: Grayscale Confirms Nov. 24 ETF Launch Schiff Issues A Stark Warning According to gold investor Peter Schiff, Bitcoin is “finally having its IPO moment.” He said that when veteran holders turn into sellers, supply at the top of the market rises and future selloffs can become deeper. “This much Bitcoin moving from strong to weak hands not only increases the float, but also means future selloffs will be bigger,” Schiff said on Saturday. His view has been repeated by bearish voices for years, but this time the comment lands against clear on-chain moves and big ETF outflows. Traders note that when confident, long-term holders prune positions near local peaks; when many do it at once, price action often becomes more violent. Some argue that after all these years Bitcoin is finally having its IPO moment now that there’s enough liquidity for the OGs to cash out. I agree, but this much Bitcoin moving from strong to weak hands not only increases the float, but also means future selloffs will be bigger. — Peter Schiff (@PeterSchiff) November 22, 2025 Whale Moves And Major Sales Based on reports, whales and early wallets moved over 400,000 BTC in October, activity linked with large selling pressure. One early investor, Owen Gunden, reportedly liquidated his entire 11,000 BTC stake across October and November. High-profile retail figures also sold: Robert Kiyosaki announced a sale worth roughly $2.25 million, saying he bought when BTC was about $6,000 and sold near $90,000, and that he plans to redeploy proceeds into income businesses. Analysts at Bitfinex point to two key drivers of the recent drop: long-term holder sales and leveraged liquidations in derivatives markets. When margin positions unwind, prices can cascade lower before the market finds support. ETF Flows And Retail Sentiment According to Bloomberg and fund filings, investors pulled nearly $1 billion from Bitcoin ETFs in a single session, the second-largest daily outflow among the group of 12 funds. BlackRock’s IBIT led with $355 million, while Grayscale’s GBTC and Fidelity’s FBTC each saw about $200 million leave. Over the past month, ETF products have recorded roughly $4 billion in net outflows. Citi Research figures cited by market watchers place every $1 billion withdrawn at roughly a 3.4% negative swing in Bitcoin’s price. Still, there was a counter-move: reports show ETFs posted $238 million of inflows yesterday, underlining how flows can reverse quickly. Related Reading: Kiyosaki Dumps Bitcoin At $90K After Predicting A $250K Moonshot – Here’s Why Schiff’s warning shows that Bitcoin can still be shaken when big holders sell. Even with some institutions buying, moving coins from long-term owners to casual investors could make future price drops bigger and faster. People watching the market will likely pay close attention to what these veteran holders do, because their actions could decide how steep the next crash might be. Featured image from Born Free Foundation, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|crypto|etf|gold|peter schiff|whales",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54814079,
    "published": 1763931600000,
    "title": "Crypto Crash Is Eroding Wealth for Trump’s Family and Followers",
    "body": "In President Donald Trump’s second term, crypto assets transformed his family’s wealth. Now the Trumps — and their followers — are getting a crash course in the wild volatility ingrained in digital currencies.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NCM:ABTC",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54822518,
    "published": 1763951005000,
    "title": "Bitwise CIO Says Most DATs Are Headed for Discounts, Not Premiums: Here's Why",
    "body": "Bitwise's Hougan argues that structural drag in DATs outweighs the few uncertain paths firms have to lift their crypto-per-share.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54823555,
    "published": 1763952957000,
    "title": "NYSE approves Grayscale DOGE and XRP ETFs, clearing launch for Monday",
    "body": "NYSE Arca has greenlit the launch of Grayscale’s exchange-traded funds tied to Dogecoin and XRP, with the products set to go live for trading on Monday.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54826037,
    "published": 1763957631000,
    "title": "VanEck boss questions Bitcoin’s privacy, encryption against quantum tech",
    "body": "Jan van Eck says quantum computing could threaten Bitcoin's encryption and privacy, and his firm “will walk away” if it’s “fundamentally broken.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54826287,
    "published": 1763958218000,
    "title": "Bitcoin Logs Longest Losing Streak Since 2024 as Fed Repricing Fuels Cautious Rebound",
    "body": "Bitcoin's longest weekly slump in over a year puts it on track for its worst quarter since 2018, with a potential bull trap looming.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54828426,
    "published": 1763961982000,
    "title": "Bitcoin ETFs, Led By BlackRock's IBIT, See Record $40B Trading Volume as Institutions Capitulate",
    "body": "The U.S.-listed spot bitcoin ETFs saw a record $40 billion in trading volume last week, with IBIT leading the way.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|ETFs|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54828562,
    "published": 1763962464000,
    "title": "JPMorgan Chase Ends Banking Ties With Strike CEO, Rekindling Crypto Debanking Concerns",
    "body": "JPMorgan Chase’s move has renewed scrutiny of alleged anti-crypto debanking despite a Trump order banning the practice.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54828967,
    "published": 1763963214000,
    "title": "Department of Government Efficiency Winds Down Despite Months Left To Run: Report",
    "body": "The administration’s DOGE office has gone dormant months early as the White House weighs easier paths to close federal units.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "dogecoin|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54830348,
    "published": 1763965920000,
    "title": "Bitcoin climb to continue as selling pressure eases: Analysts",
    "body": "Bitcoin showed signs of recovery after nearing $82,000 on Friday, with analysts noting easing selling pressure and rising Fed rate cut expectations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54830347,
    "published": 1763965742000,
    "title": "Buterin says X’s new location feature ‘risky’ as crypto users flag privacy concerns",
    "body": "Uniswap founder Hayden Adams said X's new feature showing the country that an account is based in was “mandatory doxing.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 53,
        "NAME": "UNI",
        "CATEGORY": "UNI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]