[
  {
    "id": 56123817,
    "published": 1766294163000,
    "title": "Crypto community ‘very sorry’ over Senator Lummis' reelection decision",
    "body": "Industry supporters said crypto \"would not be where it is today\" without US Senator Cynthia Lummis, who announced she would not seek reelection next year.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56126314,
    "published": 1766300715000,
    "title": "US lawmakers propose tax break for small stablecoin payments, staking rewards",
    "body": "US lawmakers are proposing a $200 tax exemption for stablecoin payments and a multi-year deferral option for crypto staking and mining rewards.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56128163,
    "published": 1766305034000,
    "title": "Crypto activity in Brazil rises 43% with average investment surpassing $1,000: Report",
    "body": "Brazil’s crypto market showed signs of maturity in 2025, with higher transaction volumes, larger per-user investments and growing demand for low-risk products.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56130842,
    "published": 1766307615000,
    "title": "Bitcoin Remains In Bearish State Despite Recent Surge — Here’s Why",
    "body": "Although the Bitcoin price has recently displayed swift recovery to the upside, the broader picture still mirrors a bleak future for the flagship cryptocurrency. A new on-chain evaluation has surfaced, which suggests that Bitcoin’s recent price recovery could be happening within a broader, weak trend, with macroeconomic factors acting as the major influences. Related Reading: Bitcoin Could Drop To $70K As Bank Of Japan Rate Move Approaches—Analysts Weak Japanese Yen Fails To Ignite Crypto Risk Appetite In a QuickTake post on CryptoQuant, education group XWIN Research Japan explains reasons to believe that the Bitcoin market is merely at a “post-rebound adjustment” phase, rather than being underway to a full-scale price recovery. The research and education institution begins by pointing out the rate increment to 0.75% by the Bank of Japan. Since the move has been largely priced in, this rate hike did not give strength to the Japanese yen. Instead, a directly opposite result is the reality: the yen remains weak. Historically, a weak Yen has been a catalyst for ‘yen-funded carry trades’, where Japanese investors borrow Yen for the purpose of investing in other assets like cryptocurrencies for profits. However, XWIN Research Japan reveals that the current scenario deviates from historical trends. This conjecture depends on readings obtained from the Bitcoin: Estimated Leverage Ratio metric, which tracks how much leverage traders are using in the futures market, in relation to the amount of Bitcoin held on exchanges. Per the research group, there has been an ostensible decline in the estimated leverage ratio across exchanges. Also worth noting is the observation that there has been no leverage recovery, even during Bitcoin’s recent price fluctuations. Hence, it becomes clear that “yen-funded carry trade-driven risk-taking remains contained rather than expanding.” Related Reading: Bitcoin In Standby Mode: Weekend Ranges Rule Before Holiday ‘Chop’ Coinbase Premium Index Reveals Absent Spot Demand — Implications For Price At the same time, a very critical sign of a sustained bull market is nowhere to be found. This is monitored by the Coinbase Premium Index metric, which measures the difference between Bitcoin’s price on Coinbase (based in the U.S), and global exchange averages. Notably, the index has recovered from deep negative territory to moderate levels. However, this only indicates that selling pressure is easing, rather than intensifying. On the other hand, it also reveals that U.S spot investors are still uninterested in entering the market. XWIN Research Japan therefore concludes that, while the yen stays weak, “the lack of sustained spot buying implies that the current recovery does not yet reflect a structural uptrend.” Nonetheless, a possible scenario could also change the present narrative. This involves the Coinbase Premium Index regaining ground within positive territory, and price rising, without renewed heightened leverage. If these occur at the same time, XWIN Research Japan explains that it would be the perfect sign of an ongoing demand-driven accumulation. At press time, Bitcoin stands valued at $88,034, with CoinMarketCap data reflecting a minor 0.84% loss in the last 24 hours. Featured image from Pixabay, chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|Bank of Japan|Bear manrket|bitcoin|btcusd|BTCUSDT|Coinbase Premium|japanese yen",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56135900,
    "published": 1766300425000,
    "title": "Citi Projects $143,000 Base Case For Bitcoin In 12-Month Outlook",
    "body": "Bitcoin is back in focus after an outlook from Citigroup, where analysts mapped out a wide price range for the next year that captures both upside momentum and lingering downside risks. The bank’s latest projections point to a base-case target of $143,000 over the next 12 months, anchored in expectations around a growth in ETF participation and clearer regulatory frameworks. Furthermore, Citi outlined an optimistic path that stretches to $189,000, alongside a bearish scenario that projects a downward move to $78,500. Related Reading: Banks Could Favor A Higher XRP Price, Finance Expert Says ETF Adoption And Institutional Demand Citi’s base and bullish scenarios are built around the same core thesis: the growing role of regulated investment vehicles in shaping Bitcoin’s market structure. Crypto analysts are always noting that Spot Bitcoin ETFs have lowered barriers for institutional investors, making it easier for large pools of capital to gain exposure without direct custody concerns. Analysts at Citi are leaning into this school of thought and are projecting bullish price levels for Bitcoin. With the expectations of ETF interest and regulatory clarity in mind, Citi sees Bitcoin trending toward $143,000 under its base case within the next 12 months. Interestingly, the outlook of a bullish scenario from the analysts projected that Bitcoin will be trading somewhere around $189,000 within the next 12 months. These projections are notable considering the current state of Bitcoin’s price action, which is currently struggling near $90,000. They are also contingent on a turnaround in the state of flows surrounding Spot Bitcoin ETFs. LATEST: 📈 Citi analysts put Bitcoin’s 12-month price base case at $143,000, driven by anticipated ETF interest and regulatory clarity, with a bullish scenario of $189,000 and a bearish one of $78,500. pic.twitter.com/jAukEDkXQe — CoinMarketCap (@CoinMarketCap) December 20, 2025 Despite its constructive outlook, Citi also flagged downside risks that could derail bullish momentum. A bearish framework by Citi analysts projects the Bitcoin price sliding to $78,500 within the next 12 months. Fundstrat’s Internal View Contrasts With Citi’s Optimism Citi’s bullish projections are in contrast to a more cautious internal outlook recently reported by Fundstrat Global Advisors. Internal discussions within the firm are warning of a possible drawdown of the Bitcoin price toward the $60,000 to $65,000 range. According to an internal note circulated to clients, Fundstrat’s head of digital asset strategy, Sean Farrell, cautioned that a further correction may unfold during the first half of 2026 as macroeconomic pressures and tightening financial conditions weigh on risk assets. According to @_FORAB, Tom Lee’s fund, Fundstrat, stated in its latest 2026 cryptocurrency strategy advice to internal clients that a significant correction is expected in the first half of the year, completely contradicting Tom Lee’s public statements. The internal report sets… pic.twitter.com/HbRoNzr85z — Wu Blockchain (@WuBlockchain) December 20, 2025 The report outlined downside targets that place Bitcoin in the $60,000 to $65,000 range, a level that would represent a 30% decrease from its current price range. The same internal framework also projected Ethereum retreating downwards to $1,800 to $2,000, alongside Solana falling into a $50 to $75 range. Related Reading: Bitcoin Feels The Weight Of Quantum Risk Concerns, Industry Leaders Warn This goes against the public stance of Fundstrat co-founder Tom Lee, who has publicly maintained a bullish stance on the long-term trajectory and new all-time highs for Ethereum and Bitcoin. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|altcoins|bitcoin|bitcoin price|btc|citi|crypto market|crypto news|cryptocurrency",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 51823126,
    "published": 1766335206000,
    "title": "The 5 Largest Publicly Traded Solana Treasury Firms",
    "body": "Institutions are gobbling up Solana for their balance sheets. These are the top publicly traded treasuries.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Long Reads",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56143533,
    "published": 1766336419000,
    "title": "Ethereum ETFs Record Over $600M In Outflows — Warning Signal For Traders?",
    "body": "The price of Ethereum endured significant selling pressure over the past week, reflecting the current climate of the crypto market. The latest data shows that the spot US-based Ethereum ETFs (exchange-traded funds) did not have it any better, as significant capital flowed out of the market in the past week. Ethereum ETFs Weekly Outflow Exceeds $600 Million In a Quicktake post on the CryptoQuant platform, market pundit CryptoOnchain revealed an overwhelming exodus of institutional capital from the Ethereum market. More specifically, the analyst highlighted that over $600 million in capital flowed out of the US-based spot Ethereum ETFs over the past week. The relevant indicator here is the ETH ETF Net Flow metric, which monitors the net movement of capital (in millions of USD) into or out of the Ethereum exchange-traded fund market. Related Reading: Why XRP Price Is Playing Catch-Up Despite Successful ETF Launch: Analyst BlackRock’s iShares Ethereum Trust (with the ticker ETHA) is the primary contributor to the massive outflows witnessed by the Ethereum ETFs in the past week. CryptoQuant’s data shows that about $470 million in value was withdrawn from ETHA in the last trading week. Fidelity’s Ethereum Fund (ticker: FETH) also registered a notable amount in net outflows, as around $35 million was withdrawn by investors. Grayscale’s Ethereum ETF (ETHE) also posted significant net outflows of approximately $49 million in the past week. What The Outflow Means For Ethereum Price In normal conditions, the Ethereum ETFs tend to provide substantial price stability and institutional support for the ETH price. However, these products could also be a source of immense volatility for the market, depending on their investor behavior. Typically, waves of ETF outflows indicate a reduction in institutional risk appetite for Ethereum. CryptoOnchain explained that when the week begins with reduced exposure from institutional participants, their not-so-optimistic sentiment becomes apparent in the market, as price nosedives, too. The lack of institutional demand could, in turn, make it difficult for Ethereum to defend its immediate support levels. Moreover, this could mean that institutional interest sits at price levels further south of the Ethereum price. This creates a vacuum of demand beneath the current price levels, which short-term traders in general may have trouble filling. Until ETF flows begin ascending towards positive values, the Ethereum market could be in for more bearish pressure. It, then, becomes very likely that the ‘king of altcoins’ would revisit lower support levels. Hence, it is important that investors involve themselves in the market with utmost caution. As of press time, Ethereum is valued at approximately $2,975, with no significant price movement in the past day. Related Reading: Major Ethereum Metric Just Hit A New All-Time High – Can Price Reclaim $3,000? Featured image from Shutterstock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ethereum|Ethereum ETFs|ethereum price|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56143230,
    "published": 1766335850000,
    "title": "Why Bitcoin Billionaire Arthur Hayes Expects BTC to Hit $200K by March",
    "body": "BitMex co-founder Arthur Hayes thinks Bitcoin will range until year's end, but it could jump to $200,000 before March. Here's why.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 45336747,
    "published": 1766337109000,
    "title": "Crypto Game Crashouts: The Biggest Shutdowns in 2025",
    "body": "From Deadrop to Nyan Heroes and plenty in between, many promising crypto games closed up shop this year. These are the biggest.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Long Reads",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56147758,
    "published": 1766343646000,
    "title": "Whale Inflows Dampen XRP ETF Optimism As Selling Pressure Persists",
    "body": "Expectations around XRP exchange-traded funds were seen as a turning point that could unlock new institutional demand and change XRP’s price structure in favor of buyers. However, recent on-chain data suggests the price response has diverged immensely from that narrative. Metrics tracked by the on-chain analytics platform CryptoQuant point to a very different dynamic unfolding beneath the surface, one that explains why the altcoin continues to struggle for traction despite headline optimism and inflows into Spot XRP ETFs. Related Reading: Banks Could Favor A Higher XRP Price, Finance Expert Says Whale Exchange Inflows Expose Supply Pressure Data from on-chain analytics platform CryptoQuant reveals an interesting trend among XRP whale addresses and their activity on crypto exchange Binance. A closer look at the Binance Inflow-Value Band chart shows that recent XRP deposits to exchanges are overwhelmingly concentrated in the 100,000 to 1 million XRP range and transactions exceeding 1 million coins. These are not retail-sized movements. They reflect activity from large holders moving significant balances onto exchanges, and this behavior aligns with distribution or preparation for selling. The chart showing the exchange inflow into Binance makes this pattern clear, with repeated inflow spikes driven almost entirely by these higher-value bands, while smaller transaction sizes are comparatively lower. The chart image below shows inflows in chunks between 100,000 XRP and 1 million XRP in purple and inflows of chunks more than 1 million XRP in light blue. Most of the inflows into Binance in the past few days have been characterized by these two cohorts, with a few instances of inflows in chunks between 10,000 XRP and 100,000 XRP. XRP Ledger: Exchange Inflow Value Bands – Binance. Source: CryptoQuant This imbalance means that supply is being added to the market by whales at a pace that smaller buyers cannot absorb, and this is why inflows into Spot XRP ETFs have failed to have a positive effect on the altcoin’s price action. Lower Highs, Lower Lows Confirm Supply Overpowering Demand As shown in the price action overlaid in the chart above, the coin printed repeatedly lower highs and lower lows after major exchange deposits. This happens because of the relatively low numbers of new spot buyers on Binance, and even moderate selling pressure has been enough to cap rallies. As it stands, the crypto is facing selling pressure every time it approaches $1.95. Based on the intensity of exchange inflows and the market’s reaction, the first meaningful support zone is between $1.82 and $1.87. However, if large inflows persist, the data suggests the XRP price could continue declining to the $1.50 to $1.66 range. Related Reading: Bitcoin Feels The Weight Of Quantum Risk Concerns, Industry Leaders Warn The interpretation is that the ETF trend did not translate into sustained spot demand for XRP. Instead, whales who accumulated XRP ahead of ETF approval expectations appear to have used the resulting attention as an opportunity to dump their holdings. That said, inflows into Spot XRP ETFs may have helped limit deeper downside, as data from SoSoValue shows these funds recorded $82.04 million in inflows over the recent week. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|crypto news|cryptocurrency|digital currency|etf|Ripple|xrp|XRP ETF|xrp news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56154574,
    "published": 1766355448000,
    "title": "Tokenization will disrupt finance faster than digital disrupted media: Crypto exec",
    "body": "Putting real-world assets onchain opens up new markets, increases capital velocity and democratizes access to finance, advocates say.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  }
]