[
  {
    "id": 57701682,
    "published": 1770132893000,
    "title": "Bitcoin bounce fails, with price falling back to $77,000 while precious metals renew surge",
    "body": "Silver is higher by nearly 15% on Tuesday, while gold is nearing $5,000 per ounce after a 6.5% gain.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Market Wrap|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57702350,
    "published": 1770134464000,
    "title": "World Liberty launches $3.4B stablecoin: How it fits into onchain credit systems",
    "body": "World Liberty launches a $3.4-billion stablecoin and lending platform, positioning it within onchain credit, collateralized loans and DeFi markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57703365,
    "published": 1770137842000,
    "title": "Bitcoin will 'massively' outperform gold over 10 years, says Pantera's Dan Morehead",
    "body": "“I think crypto starts to become invisibly more part of everyone's lives,\" said Tom Lee — the two appeared on a panel together Tuesday morning at the Ondo Summit in New York.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Ether|Dan Morehead|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57703255,
    "published": 1770137536000,
    "title": "Galaxy Digital Shares Dive Following $482 Million Q4 Loss",
    "body": "Galaxy Digital shares fell after the institutional crypto firm disclosed a 22% hit to the value of its investments and digital assets in Q4.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57703899,
    "published": 1770139304000,
    "title": "BNB Chain Metrics Show Strong Performance As BNB Price Retests ‘Do Or Die’ Level",
    "body": "BNB Chain has shown strong performance over the last week, with the ecosystem holding key metrics despite the recent market downturn and BNB’s price correction toward a major support level. Related Reading: Crypto Market Crash ‘Worse Than Expected’ But Bottom Might Be Near, Says Tom Lee BNB Chain Key Metrics Hold Strong On Monday, BNB Chain shared its weekly ecosystem snapshot, revealing solid network performance and sustained growth on multiple key metrics from January 22 to January 28, 2026. According to the report, BNB Chain saw over 4.9 million average Daily Active Users (DAU) during the snapshot period, an 11.4% increase from the 4.4 million average DAU recorded the previous week. Notably, data from Dune Analytics shows that the BNB Smart Chain (BSC) recorded 2.59 million DAU, and opBNB saw 2.36 million DAU. While the BSC saw an 8.5% Week-on-Week decline, opBNB recorded a strong 46% weekly increase. Meanwhile, BNB Chain also registered over 142.6 million transactions during the recorded week, with 118.96 million from BSC and 23.65 million from opBNB. Although it represents a mild 2% decline from the previous week, it continues January’s trend of weekly transactions exceeding 140 million. Dune data cited by the report also shows that BNB Chain’s total trading volume reached $56.4 billion between January 22 and January 28, while the Total Value Locked (TVL) was at $6.83 billion. This builds on the ecosystem’s strong performance in 2025. According to a December report, its total unique addresses exceeded 700 million last year. Both BSC and opBNB achieved new usage milestones, with over 4 million DAU. In addition, its TVL grew by over 40%, while average daily transactions rose to 10.78 million, reaching an all-time high (ATH) of 31 million daily transactions in October. New Ecosystem Developments The latest report also highlighted key ecosystem developments, including significant steps toward broader institutional access, strong builder activity, and growing user participation. As reported by NewsBTC, Prediction Markets on BNB Chain recently reached a new milestone after surpassing $20 billion in cumulative volume last week. Dune data shows that prediction markets within the ecosystem have surged significantly since Q4, 2025, increasing nearly 89% in a month. BNB Chain also led in weekly trading volume by chain, surpassing off-chain prediction markets, Polygon, Solana, and Base since the start of this year. Grayscale filed an S-1 form with the US Securities and Exchange Commission (SEC) to launch a BNB-based spot exchange-traded fund (ETF), signaling major institutional interest in the ecosystem. BNB’s Price At Major Support Despite a packed week for the ecosystem, BNB is currently at a seven-month low, attempting to bounce from a crucial area to prevent a deeper correction. Notably, the altcoin has seen a 13.1% pullback over the past week, falling below the $900 and $800 supports. The cryptocurrency has also recorded a 44.5% decline from its October 13 ATH of $1,369, currently hovering between the $760-770 area. Market observer Whale Factor affirmed that BNB is “at the ultimate ‘do or die’ level.” Related Reading: Oct. 10 Started The Bitcoin Bear Market, On-Chain Data Shows The analyst highlighted that BNB retested a major support level as it tapped the $730 area on Monday. As he explained, this zone has held in the daily and weekly timeframes since August, and could set the stage for the next major move. If this level continues to hold in these key timeframes, “a clean bounce here targets $900+ for a massive reclaim.” On the contrary, “If we lose $730 on the daily close, we’re looking at a fast slide to the $650 liquidity gap,” Whale Factor warned. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|BNB|bnb chain|BNB Chain daily active users|BNB Chain ecosystem|BNb Chain prediction markets|BNB Chain Trading Volume|bnbusdt|BSC network|crypto analyst|crypto market correction|Crypto Market Recovery|opBNB",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57703849,
    "published": 1770139141000,
    "title": "'You are not scaling Ethereum': Vitalik Buterin issues a blunt reality check to the biggest crypto networks",
    "body": "The roadmap in place doesn't make as much sense because progress among layer-2s toward later stages of decentralization has been slower and more difficult, and Ethereum itself is now scaling directly on layer-1.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Vitalik Buterin|Ethereum News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57704678,
    "published": 1770141230000,
    "title": "Bitcoin nears weekend low of $74,600 as stock selloff adds to crypto's woes",
    "body": "Major declines in artificial-intelligence-linked stocks, software names and private equity are leading U.S. indices lower.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Breaking News|top news|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57705576,
    "published": 1770143515000,
    "title": "Smarter Web Company Joins Stock Exchange: Is $MAXI Next Crypto to Explode?",
    "body": "The game just changed. The Smarter Web Company (LSE: SWC) officially rang the bell on the London Stock Exchange’s Main Market today, proving that ‘Bitcoin treasury’ plays are now a centerpiece of the UK market. But it hasn’t been all champagne and green candles. SWC has had a literal trial by fire, weathering a $100M loss on its Bitcoin positions over the last three months as the market chopped. However, despite this, it will not change course. While the suits are debating whether SWC’s ‘diamond-hard’ conviction is genius or madness, the message is clear: Web3 validation is here, and it’s volatile. This move to the main market is a massive signal flare. When companies start stacking thousands of Bitcoin and holding through nine-figure drawdowns, it opens the floodgates for liquidity across the entire ecosystem. It’s this exact environment of high-stakes conviction and massive volatility that Maxi Doge ($MAXI) was built to dominate, positioning itself as the retail-native answer to the institutional ‘Maxi’ mindset. Retail Traders are Full-Sending the ‘Leverage King’ Culture The stock market might celebrate a tiny quarterly gain, but the crypto crowd is hunting for the kind of volatility that moves the needle overnight. Maxi Doge ($MAXI) isn’t just another dog coin; it’s a response to the boring market grind, and maybe the next crypto to explode . The project positions itself as a 240-lb juggernaut designed for one thing: giving traders the ‘gains’ they need to power through the same kind of market chop that SWC is currently fighting. By embracing a ‘1000X leverage’ mindset, $MAXI makes holding an actual game. They plan to launch Holder-Only Trading Competitions where the community battles for the top of the leaderboard. It turns a boring ‘buy and sit’ strategy into a full-contact sport. Honestly, it’s exactly what the market wants right now, less corporate fluff and more high-stakes adrenaline. The hype is becoming impossible to ignore. The $MAXI community is swelling at a breakneck pace, with social mentions and presale capital through the roof as thousands of new holders pile in. It’s a total grassroots takeover, while mainstream media is staring at stock tickers and loss reports, the $MAXI army is front-running the next rotation. Plus, the ‘Maxi Fund’ treasury is already locked and loaded to fuel massive partnerships and viral marketing stunts. BUY $MAXI FROM ITS OFFICIAL PRESALE PAGE. Presale Momentum: The Great Rotation is Here You can see the shift from traditional equities to on-chain assets just by looking at the $MAXI presale numbers. Investors who want actual upside are skipping the crowded stock market for early-stage entries. Maxi Doge has already raked in $4.5M with tokens sitting at a steal of $0.0002802. Why the hype? It’s the ‘Lift, trade, repeat’ loop. Unlike static meme coins that die when the trend ends, $MAXI has a built-in staking protocol. The smart contract plans to drop rewards from a 5% staking pool. This is the secret sauce for the unwavering resolve needed to give a token the chance to fly to the moon. It keeps the supply tight while the FOMO builds. Plus, whilst it’s still in presale, you can get 68% staking rewards. But this rate is dynamic and subject to change. If you’re watching the Smarter Web Company listing, don’t miss the forest for the trees. As the stock market absorbs the ‘safe’ money, the real risk-takers are moving further out on the curve. $MAXI is aiming to be sitting right at the center of gym-bro humor and actual rewards. If you ‘never skip a leg day,’ learn ‘ How to Buy Maxi Doge ‘ here. This article is for informational purposes only and does not constitute financial, investment, or legal advice. Cryptocurrency investments, particularly in presales and meme tokens, carry a high degree of risk. Always perform your own due diligence before making any investment decisions.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57705566,
    "published": 1770143129000,
    "title": "Galaxy Digital reports $482M net loss in Q4 2025",
    "body": "The crypto company reported significant net losses to its balance sheet in 2025 due in part to “lower digital asset prices and approximately $160 million of one-time costs.“",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57705511,
    "published": 1770142999000,
    "title": "Bitcoin Drops to Lowest Price Since Trump’s Election Victory",
    "body": "Bitcoin dropped to its lowest price level since Donald Trump retook the White House a little more than a year ago, erasing the gains registered by the bellwether digital asset since the election victory of the crypto-friendly US president.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57705802,
    "published": 1770143762000,
    "title": "Epstein Backed Coinbase in Crypto Exchange’s Early Years",
    "body": "Convicted sex offender Jeffrey Epstein made an early investment in crypto exchange Coinbase Global Inc., years after he was first charged and imprisoned by US authorities.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NMS:COIN",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57706946,
    "published": 1770147038000,
    "title": "Altcoins Are Not Dead? Analyst Says That ‘The Spring Is Loading’",
    "body": "A technical perspective shared by crypto analyst Cryptollica is pushing back against the belief that the altcoin era is over. This perspective is based on the outlook that the current environment may be less about the decline and more about preparation. Decade-Long Structure Is In Rotation Zone Bitcoin and other large-cap cryptocurrencies are dominating market attention, and many traders have written off altcoins as a lost cause. Extended underperformance, fading arguments, and months of sideways action have led to the belief that the altcoin era is over. Related Reading: Bitcoin Analyst Reveals How Long It Usually Takes For Altcoin Season To Happen Taking to the social media platform X, crypto analyst Cryptollica pointed to the OTHERS/BTC ratio, which tracks the total crypto market capitalization excluding the top ten assets relative to Bitcoin. According to the analyst, this ratio is now sitting directly on a trend support that has held for nearly a decade. Interestingly, the long-term chart shared by the analyst shows repeated historical interactions with this rising channel, where previous touches of the lower boundary led to major rotations into altcoins. At the time of writing, the OTHERS/BTC ratio has been compressing for the past few months without any clear sign of a directional breakout. Altcoin dominance has been drifting lower within a narrowing range, approaching the lower trendline while volatility continues to dry up. However, instead of interpreting the current compression as weakness, the analyst noted that price is respecting a decade-long geometric structure without a breakdown. Cryptollica described this setup not as a graveyard but as a rotation point rather than a graveyard. Therefore, traders declaring altcoins dead are reacting to fatigue, not structure. The market is behaving like a loaded spring and storing energy. Momentum Indicators Quietly Flip In Favor Of Altcoins A separate analysis of the OTHERS/BTC ratio shows that boxes may already be ticking beneath the surface for an altcoin season. Crypto analyst Ash Crypto noted that the monthly MACD on the OTHERS/BTC chart has just delivered two consecutive green closes for the first time in four years. Related Reading: Here’s When The Altcoin Season Happens Following The Bitcoin Cycle Not only that, but the Others/BTC MACD bullish cross has now been confirmed. History shows this kind of signal has always corresponded with the earliest stages of altcoin recoveries, especially when it appears after extended periods of underperformance. Ash Crypto also pointed to the ISM index moving back above the 50% level as another bullish sign for altcoins. This ISM moving back above 50% is notable because this macro indicator has repeatedly coincided with improving conditions for altcoins in past cycles. The confirmation of momentum on OTHERS/BTC and a hold above a decade-long support strengthens the case that the current altcoin lull may be less about weakness and more about positioning ahead for an incoming altcoin season. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoin|altcoin news|Altcoin Season|altcoins|Altcoins news|Ash Crypto|Cryptollica|ISM Index|MACD|OTHERS/BTC",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57707811,
    "published": 1770149254000,
    "title": "Jeffrey Epstein Invested in Bitcoin Firm Blockstream, Invited Founder Adam Back to Island",
    "body": "Adam Back confirmed that convicted sex offender Jeffrey Epstein invested in Blockstream as newly released emails point to a planned island visit.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57707644,
    "published": 1770148640000,
    "title": "U.S. Treasury probes crypto exchanges over Iran sanctions evasion, TRM Labs says",
    "body": "The U.S. Department of the Treasury is scrutinizing crypto platforms, not just wallets, for enabling Iran’s sanctions evasion, according to TRM Labs’ Ari Redbord.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|US Department of Justice|Coinbase|Brock Pierce|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57708145,
    "published": 1770150106000,
    "title": "Canada’s investment watchdog rolls out crypto custody rules to avoid another QuadrigaCX",
    "body": "CIRO’s new digital asset custody framework takes effect immediately, raising standards for crypto trading platforms as regulators push to reduce investor risk.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Canada|Regulations|Crypto Custody|QuadrigaCX|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57708031,
    "published": 1770149883000,
    "title": "Bitcoin Price Crashes Below $73,000, Hitting Lowest Level Since 2024",
    "body": "The market’s leading cryptocurrency, Bitcoin (BTC), slid to its lowest price level seen since November 2024 on Tuesday, falling below the $73,000 threshold. The asset dropped to around $72,900 as growing concerns about a prolonged bear market continued to weigh on investor sentiment. Data from CoinGecko shows that BTC is down roughly 4% over the past 24 hours and about 15% over the last seven days. Yet, the sell‑off has not been limited to Bitcoin. Other digital assets have also come under pressure, with Ethereum (ETH) losing 25% over the past week and XRP falling approximately 17% during the same period. Bitcoin May Drift Lower For Months Augustine Fan, a partner at Hong Kong‑based crypto options platform SignalPlus, said to Bloomberg that confidence among traders has sunk to extremely low levels, further contributing to the ongoing sell-off. He noted that volatility, which had been trending lower for nearly a year, has finally picked up as traders rushed to hedge their positions. According to Fan, markets are now firmly operating in bear‑market conditions. Related Reading: What’s Next For Bitcoin? Two Key Scenarios: Will It Crash To $60,000 Or Surge To $100,000? Some analysts warn that Bitcoin’s weakness could persist. Alex Thorn, head of research at Galaxy Digital, said recent price action suggests Bitcoin may continue to drift lower in the coming weeks or even months. He pointed to the 200‑week moving average (MA), currently near $58,000, as a potential downside target. He added that there is a noticeable supply gap between the $70,000 and $80,000 range, which could add to near‑term volatility. Bearish Bets Build Market analyst DarkFost observed that funding rates on the Binance platform have moved into what he described as an “extreme zone,” signaling a buildup of short positions and a growing bearish consensus among traders. Related Reading: Hyperliquid Unveils HIP‑4, Sending HYPE 14% Higher On Outcome Trading Plans Nonetheless, as of this writing, Bitcoin has briefly recovered from Tuesday’s lows, currently trading just above $75,000. From a technical perspective, DarkFost identified two key price levels now in focus for the leading cryptocurrency: resistance around $74,000 and support near $69,000. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|bitcoin|Bitcoin news|bitcoin price|bitcoin technical analysis|btc|BTC news|btc price|BTCUSDT|crypto|crypto market|crypto news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57708030,
    "published": 1770149878000,
    "title": "Trump's White House won't tolerate attacks on the president in crypto bill, adviser says",
    "body": "Patrick Witt, the president's digital assets adviser, told CoinDesk that anti-corruption provisions targeting Trump would not be acceptable.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Patrick Witt|White House|Donald Trump|Market Structure Legislation|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57709013,
    "published": 1770152421000,
    "title": "Bitcoin’s Network Growth Just Reached Extreme Levels Last Seen Before The 2021 Surge",
    "body": "Bitcoin’s on-chain fundamentals are flashing a powerful signal that hasn’t appeared since the last major bull run. Network Growth has surged to extreme levels, mirroring the same conditions seen in early 2021, just before BTC launched its historic rally toward new all-time highs. At the same time, liquidity is rapidly expanding across the market, suggesting fresh capital is flowing in. Rising Network Adoption Strengthens Long-Term Bull Thesis The last time Bitcoin’s network growth and liquidity reached comparable extreme levels was in 2021, just ahead of BTC’s final surge to a new all-time high. Swissblock revealed on X that these metrics are now showing signs of recovery, signaling that a final bullish phase may be forming. Related Reading: Is The Bitcoin Bottom In? CMT Reveals What Investors Need To See Now However, the current divergence and rising metrics alongside the declining price action suggest that investors are re-entering the market primarily to sell. The critical question is whether this renewed participation can persist long enough to allow the market to stabilize. If Network Growth and Liquidity continue to expand sustainably, they could provide the fundamental catalyst for one last upside push before the cycle concludes. FUD has intensified across social media following Bitcoin’s roughly 16% decline since January 28. Santiment has highlighted that after briefly dipping to around $74,600, BTC has rebounded toward $78,300, a move largely attributed to retail selling assets. This behavior is proof that markets move in the opposite direction of the crowd’s narrative. Social sentiment has turned sharply negative, with social data indicating this is the most bearish that retail has seen since the November 21st crash. Historically, periods of extreme negativity like this have been followed by a short-term relief rally, and early price action suggests this bounce is beginning to resemble the previous two post-FUD recoveries. How Next Cycle Leg Could Push Bitcoin To $104,000 Market expert and investor, The Milk Road, who previously nailed Bitcoin’s drop from its all-time highs, is now predicting a potential 40% gain starting immediately. According to Milk Road, BTC could still experience a correction ranging from -20% to -77% before the next major pivot, which is projected between November 19 and February 2. A shallow 20 to 34% drop seems unlikely. Locally, it should be more than that but smaller than 77%. Related Reading: Bitcoin Historical Performance Shows How Low The Price Will Go Before A Bottom Furthermore, BTC fell roughly -40% between its October 6, 2025, ATH and February 2, a move consistent with prior cycle behavior. Milk Road’s yearly cycle analysis signals a key pivot around February 2, after which BTC could stage a +40% rally, potentially reaching $104,000 between now and September. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin Network Growth and Liquidity|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|FUD|Santiment|Swissblock|The Milk Road",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57708948,
    "published": 1770152042000,
    "title": "Tian Ruixiang plans to acquire up to 15K Bitcoin in equity-linked deal",
    "body": "The Nasdaq-listed insurance brokerage said an unnamed investor would contribute BTC as part of a deal that also includes an AI- and crypto-focused strategic partnership.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57709195,
    "published": 1770152561000,
    "title": "Michael Burry Warns of Cascading Effects From Bitcoin Plunge",
    "body": "Famed investor Michael Burry warned that Bitcoin’s slump through some important thresholds could have cascading effects leading to massive value destruction.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57706478,
    "published": 1770145739000,
    "title": "Galaxy CEO Mike Novogratz doesn't see quantum as big threat for bitcoin",
    "body": "CEO Mike Novogratz said that the profit-taking trend among early bitcoin adopters is real, indicating weakening conviction in the \"HODLing\" philosophy.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Galaxy Digital|Bitcoin News|quantum computing|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57709983,
    "published": 1770154751000,
    "title": "Nevada authorities file lawsuit against Coinbase over unlicensed wagering",
    "body": "The enforcement action over wagers on sports event contracts followed Coinbase announcing the launch of prediction markets in all 50 US states.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57710431,
    "published": 1770156026000,
    "title": "Bitcoin’s Pain Trade Inflicts Maximum Punishment on Shareholders",
    "body": "David Pan reports on how the unwinding of Bitcoin’s record rally since the re-election of Donald Trump is weighing on the shareholders of the dozens of digital asset treasury companies that sprung up during the euphoria.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NMS:MSTR",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57710406,
    "published": 1770156025000,
    "title": "Bitcoin Hits Year-To-Date Low Amid Heavy Outflows, Signs Of Spot Buying Emerge",
    "body": "Bitcoin slid to a year-to-date low of $74,500 on Monday, a move that wiped roughly 38% off its peak. Markets reacted sharply, and traders felt the pinch as flows out of big funds accelerated. Related Reading: Bitcoin Suppression? Analyst Claims Single Force Keeping Price Under $90K Fund Flows And Market Mood According to reports, global crypto exchange-traded products saw heavy withdrawals last week. Big US spot ETFs led the selling, and that pushed overall fund flows into deep negative territory. Based on Bitwise’s Weekly Crypto Market Compass report, Bitcoin’s recent drop pushed its two-year rolling MVRV z-score to a record low, a level tied to undervaluation and suggesting fire-sale conditions for the asset. Sentiment gauges fell hard. Reports note that a two-year rolling MVRV z-score — a measure comparing market price to the average cost basis of holders, adjusted for volatility — hit its lowest reading ever. That kind of number points to widespread selling and prices that many investors now view as distressed. Buying Interest On The Spot Market On shorter time frames, signs of buying have appeared. The daily RSI plunged into the low 20s. This is a level that has often been followed by quick rebounds. Spot volume data on major venues such as Binance and Coinbase showed net aggressive buying as Bitcoin bounced back toward about $79,420. Open interest did not spike. Funding rates stayed negative. In plain terms: people were buying on the spot market rather than piling into leveraged long bets, which reduces the chance of a cascade of forced liquidations that can make moves messier. Capitulation And Liquidations Reports say long positions were crushed last week, with close to 2 billion in BTC long liquidations recorded across derivatives markets. That pain can clear the field for fresh entrants. At the same time, there are multiple billions of dollars of short positions clustered near higher price levels, around $85,000, that could be hit if Bitcoin climbs. Short-covering could add fuel to a bounce. Market structure now offers a mix of strong selling behind prices and real buying in front of them. Where Support Might Hold Based on reports, buying interest combined with very low valuation metrics could create an asymmetric trade. That means the potential upside may be larger than the near-term downside, at least for traders willing to accept volatility. Historically, dips into the RSI zone seen last week have led to roughly 10% rebounds most of the time since August 2023, although outcomes vary and nothing is guaranteed. Related Reading: Bitcoin ETF Investors Pull Nearly $3 Billion, Pushing Average Buy Below Water A Quiet But Real Conclusion Institutional flows remain cautious. Major products such as the Grayscale Bitcoin Trust and the iShares Bitcoin Trust posted sizable outflows, signaling that some big holders stepped back. Yet, on-chain and spot-volume signals hint that bargain hunting has started. The near-term path will probably be bumpy. Traders who want exposure will need to weigh the low valuation readings and pockets of buying against the very real possibility of further weakness if sentiment deteriorates again. Featured image from Vecteezy, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|btc|btcusd|crypto|digital currency|etf|gold",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57711106,
    "published": 1770157850000,
    "title": "AI Made Sam Altman Feel 'Useless and Sad'—X Users Tried to Make Him Feel Worse",
    "body": "OpenAI CEO Sam Altman said Codex made him feel useless. X users responded by roasting his vulnerability—and airing months of anger over AI job losses.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57711167,
    "published": 1770157935000,
    "title": "French Police Raid X’s Paris Office in Probe of Grok AI and Illegal Content",
    "body": "The French action comes as investigations into X’s Grok chatbot expand across multiple jurisdictions, including the UK and EU.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57711773,
    "published": 1770159638000,
    "title": "Here’s What To Expect If The Bitcoin Price Maintains Support Above $74,400",
    "body": "Crypto analyst and Elliott Wave expert Gert van Lagen has highlighted a critical level that could determine the next move in the Bitcoin price. In a recently shared 2-week chart, Lagen points to a broader market structure that suggests Bitcoin may be preparing for another strong upward leg, provided it continues to hold above $74,000. According to the analyst, this level now serves as a key support zone, marking the boundary between bull-market continuation and a potentially more concerning structural breakdown. Why $74,000 Matters For Bitcoin Price Bull Structure In an X post, Lagen shared a detailed analysis of Bitcoin, predicting its next price move based on Elliott wave structures. His accompanying chart shows BTC completing an extended corrective phase following a multi-year rally. This correction, labeled Wave IV, has pulled the price back into a previous consolidation zone without disrupting the broader bullish structure. As long as Bitcoin remains above $74,400, the analyst views this move as a healthy reset rather than the beginning of an extended bear market. Related Reading: Here’s Why The Bitcoin, Dogecoin, And XRP Price Are Crashing This Week Looking back at earlier phases of the cycle helps explain why the $74,400 support level is so critical. Lagen noted that during the build-up to Wave III, Bitcoin experienced a deep retracement that nearly revisited the low from the previous corrective wave before pushing higher. The cryptocurrency’s current price action appears to follow the same pattern, with the latest pullback approaching the bottom of Wave IV at mid-$70,000. This type of pattern repetition is common in Elliott Wave structures and often signals that the market may be preparing for a stronger upward move. In line with this, Lagen highlighted that BTC’s recent price movements match the characteristics of a Wave II correction within a broader Wave V advance. He said that $74,000 remains in the invalidation area. Holding above it keeps Bitcoin’s bullish outlook intact, while a decisive break below it would force a reassessment of BTC’s entire market structure. In any case, the analyst has stated he does not expect Bitcoin to break this support zone. What The Chart Says About Bitcoin’s Next Move If the $74,400 support level continues to hold, the projected path on Lagen’s chart suggests the start of a new impulsive rally that would mark the early phase of Wave V. The initial move higher is expected to push the Bitcoin price back above previous highs, signaling that the corrective phase has ended and momentum has flipped back in favor of the bulls. According to the analyst, if Bitcoin continues to mirror past patterns, a bearish outcome remains less likely. Related Reading: Bitcoin Price Will Still Rally Above $99,000 Despite Bearish Sentiment, Here’s Why Looking at his chart, Lagen has projected that Bitcoin could experience a bullish continuation toward the $260,000 to $320,000 region, which aligns with sub-wave 3, the strongest phase of a Wave V advance. Following this, the final extension of Wave V is expected to push Bitcoin toward $400,000, reflecting a final-cycle advance and representing a surge of more than 410% from current levels around $78,000. Featured image from Peakpx, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|Elliott Wave Structure|Gert Van Lagen",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57711850,
    "published": 1770159662000,
    "title": "'We Need a New Path': Ethereum Founder Vitalik Buterin Rips Up L2-Focused Roadmap",
    "body": "Some layer-2 networks have made concessions when it comes to decentralization, Buterin said, and shouldn’t be “branded” as extensions of Ethereum.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57712183,
    "published": 1770160614000,
    "title": "‘Big Short’ investor Michael Burry warns bitcoin plunge could trigger $1 billion gold, silver sell-off",
    "body": "Burry said crypto losses may have forced institutions to liquidate precious metals as bitcoin slid below $73,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57715811,
    "published": 1770170404000,
    "title": "Bitcoin LTH Profit-Taking Collapses: Is Smart Money Done Selling?",
    "body": "Bitcoin continues to trade below the $80,000 level as the market remains under sustained selling pressure and heightened uncertainty. Recent price action reflects a fragile environment in which downside moves are met with limited conviction from buyers, while broader risk sentiment across crypto stays defensive. As volatility persists, analysts are increasingly focused on on-chain indicators to assess whether the market is approaching exhaustion—or if further downside still lies ahead. Related Reading: Ethereum Experiences Broad Long Squeeze Across Derivatives Exchanges: Can Bulls Hold $2,300? A new report from CryptoQuant highlights a notable deterioration in holder profitability through the Spent Output Profit Ratio (SOPR), which has fallen to its lowest levels of the past year. The SOPR measures whether coins being spent are moving at a profit or a loss, offering insight into the behavior of different investor cohorts during periods of stress. One key observation is the convergence between long-term holders (LTHs) and short-term holders (STHs). The SOPR ratio has dropped sharply toward the critical 1.0 level, indicating that long-term holders are realizing significantly less profit than before—or are choosing to stop selling altogether at current prices. This behavior suggests a growing reluctance to distribute coins into weakness, even as short-term participants continue to face losses. With Bitcoin still below key psychological levels, the evolution of SOPR will be closely watched. Whether this shift marks early stabilization or simply a pause before deeper capitulation remains an open question for the weeks ahead. SOPR Signals Selling Exhaustion, Not Capitulation The report adds that Bitcoin’s recent price action closely mirrors the deterioration seen in SOPR. The price (black line) has reached a local low near $77,900. Aligning with the sharp drop in the ratio toward its lowest levels of the past year. This synchronization suggests that realized selling pressure has intensified alongside the decline in profitability, reinforcing the view that the market has moved into a stress phase rather than a routine pullback. From a sentiment perspective, historically depressed SOPR readings have often coincided with moments when so-called “smart money” reduces selling activity. When coins are no longer being spent at a meaningful profit, long-term holders tend to step back, allowing selling pressure to subside. In past cycles, similar conditions have preceded periods of accumulation or the formation of local market floors. Although timing has varied widely. Two scenarios now stand out. If the SOPR stabilizes around the 1.0 level, it would suggest that heavy distribution from long-term investors is largely exhausted. Creating room for a relief bounce as marginal demand returns. Alternatively, the steep, momentum-driven drop in price increases the likelihood of extended sideways consolidation, as the market digests recent volatility before establishing a clearer trend. In summary, the data points to a flush market. With SOPR at yearly lows, weaker hands appear to have exited, shifting the balance toward longer-term value considerations over short-term fear. Related Reading: Bitcoin Bear Market Signal Emerges: Supply in Loss Rises Above 40% Bitcoin Struggles Below Key Averages Bitcoin’s weekly chart highlights a market under sustained pressure, despite a modest rebound off recent lows. Price is currently hovering around the $78,000 area after briefly dipping toward the mid-$70,000s, a zone that has acted as an important short-term demand pocket. This bounce, however, has so far lacked follow-through and does not yet signal a structural trend reversal. From a technical perspective, Bitcoin remains below its major moving averages. The price is trading well under the 100-day and 200-day averages, both of which are now sloping downward. This configuration reinforces the broader bearish bias and suggests that rallies are still being sold into rather than accumulated aggressively. The prior support region between $85,000 and $90,000 has clearly flipped into resistance. Confirming a change in market structure compared to late 2025. Related Reading: Bitcoin Miner Fees Remain Near Cycle Lows: What Does This Signal? The sell-off into the $74,000–$76,000 range was accompanied by elevated volume. The subsequent rebound has occurred on comparatively lighter participation. This divergence implies short-covering or tactical buying rather than renewed conviction from longer-term investors. Structurally, Bitcoin appears to be transitioning from a distribution phase into a consolidation or corrective regime. As long as the price remains below reclaimed resistance and fails to regain key moving averages, downside risks remain active. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|Bitcoin LTH|Bitcoin news|bitcoin price|Bitcoin smart money|Bitcoin Whale Activity|Bitcoin whales|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57716664,
    "published": 1770172659000,
    "title": "Vitalik Buterin tempers vision for ETH L2s, pushes native rollups",
    "body": "The Ethereum co-founder said many layer‑2s have failed to decentralize and continue to be mediated by multisig bridges instead of inheriting Ethereum’s security advantages.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57716557,
    "published": 1770171909000,
    "title": "Bitcoin-Led Crypto Rout Erases Nearly Half a Trillion in a Week",
    "body": "Almost half a trillion dollars has been wiped off cryptocurrencies in less than a week as a selloff led by Bitcoin accelerated.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57716855,
    "published": 1770173246000,
    "title": "Bitcoin Price Bounce Looks Hollow, Downtrend May Resume",
    "body": "Bitcoin price extended its decline below $75,000. BTC is now attempting to recover from $72,850 but faces many hurdles near $76,500. Bitcoin is attempting to recover above $74,000 and $75,000. The price is trading below $79,000 and the 100 hourly simple moving average. There is a bearish trend line forming with resistance at $77,200 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might dip again if it trades below the $75,000 and $74,000 levels. Bitcoin Price Faces Hurdles Bitcoin price failed to remain stable above the $76,000 zone. BTC extended its decline below the $75,000 and $74,000 levels. The bears were able to push the price below $73,500. A low was formed at $72,865, and the price is now attempting to recover. There was a move above $75,000. The price surpassed the 50% Fib retracement level of the downward move from the $79,120 swing high to the $72,865 low. However, the bears are active near $77,000 and the 61.8% Fib retracement level of the downward move from the $79,120 swing high to the $72,865 low. Bitcoin is now trading below $77,000 and the 100 hourly simple moving average. If the price remains stable above $75,000, it could attempt a fresh increase. Immediate resistance is near the $76,750 level. The first key resistance is near the $77,000 level. There is also a bearish trend line forming with resistance at $77,200 on the hourly chart of the BTC/USD pair. A close above the $77,200 resistance might send the price further higher. In the stated case, the price could rise and test the $78,500 resistance. Any more gains might send the price toward the $79,000 level. The next barrier for the bulls could be $80,000 and $80,500. Another Decline In BTC? If Bitcoin fails to rise above the $77,200 resistance zone, it could start another decline. Immediate support is near the $75,000 level. The first major support is near the $74,000 level. The next support is now near the $72,850 zone. Any more losses might send the price toward the $71,500 support in the near term. The main support sits at $70,000, below which BTC might struggle to recover in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $75,000, followed by $74,000. Major Resistance Levels – $76,750 and $77,200.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57717536,
    "published": 1770174808000,
    "title": "Kraken parent Payward revenues jump 33% as crypto traders pile in",
    "body": "Kraken co-CEO Arjun Sethi said Payward’s revenues were “well balanced” in 2025, split almost evenly between trading and asset-based revenues.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57717628,
    "published": 1770175247000,
    "title": "Bitcoin Risks Further Slide as Momentum Weakens Below Key Support",
    "body": "Fragile momentum and macro uncertainty are keeping Bitcoin and the broader crypto market at risk of further declines, analysts say.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57717553,
    "published": 1770175104000,
    "title": "Ethereum Price Recovery Runs Into A Wall, Decline Risk Returns",
    "body": "Ethereum price extended its decline below $2,220 and $2,200. ETH is now attempting to recover from $2,000 but faces many hurdles near $2,250. Ethereum failed to stay above $2,300 and started a fresh decline. The price is trading below $2,265 and the 100-hourly Simple Moving Average. There is a major bearish trend line forming with resistance at $2,250 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh decline if it stays below the $2,350 zone. Ethereum Price Faces Resistance Ethereum price failed to remain stable above $2,320 and extended losses, like Bitcoin . ETH price traded below $2,220 to enter a bearish zone. The bears even pushed the price below $2,200. A low was formed at $2,107 and the price is now attempting to recover. There was a move above $2,220. The price tested the 23.6% Fib retracement level of the downward move from the $3,040 swing high to the $2,107 low. However, the bears are active near $2,265. There is also a major bearish trend line forming with resistance at $2,250 on the hourly chart of ETH/USD. Ethereum price is now trading below $2,265 and the 100-hourly Simple Moving Average. If the bulls remain in action above $2,175, the price could attempt another increase. Immediate resistance is seen near the $2,250 level. The first key resistance is near the $2,265 level. The next major resistance is near the $2,460 level. A clear move above the $2,460 resistance might send the price toward the $2,575 resistance or the 50% Fib retracement level of the downward move from the $3,040 swing high to the $2,107 low. An upside break above the $2,575 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $2,680 resistance zone or even $2,700 in the near term. Another Drop In ETH? If Ethereum fails to clear the $2,265 resistance, it could start a fresh decline. Initial support on the downside is near the $2,200 level. The first major support sits near the $2,175 zone. A clear move below the $2,175 support might push the price toward the $2,120 support. Any more losses might send the price toward the $2,050 region. The main support could be $2,000. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI – The RSI for ETH/USD is now below the 50 zone. Major Support Level – $2,175 Major Resistance Level – $2,265",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57718487,
    "published": 1770177605000,
    "title": "Bitcoin Unrealized Losses Reach 22% – Still No Capitulation Phase",
    "body": "Bitcoin is struggling to reclaim the $80,000 level after several days of sustained selling pressure and heightened market uncertainty. Price action remains fragile, with each rebound attempt failing to attract strong follow-through, reinforcing concerns that the market is still digesting a broader structural shift rather than a short-term correction. According to top analyst Axel Adler, Bitcoin entered a bear cycle in October 2025 and is now moving through a correction phase following the local peak near $125,000. Related Reading: Ethereum Experiences Broad Long Squeeze Across Derivatives Exchanges: Can Bulls Hold $2,300? On-chain data supports this interpretation. Two key indicators — Percent Unrealised Loss and the LTH/STH SOPR Ratio — point to mounting stress across the holder base, but without the hallmarks of full capitulation. Unrealised losses have risen sharply, tripling since January from roughly 7% to around 22% as prices declined from $95,000 to near $78,000. While this increase signals growing discomfort among investors, it remains well below the 40–60% levels historically associated with deep bear-market capitulation in 2019 and 2023. At the same time, the LTH/STH SOPR Ratio has dropped around 40% from its peaks, indicating compressed profitability and reduced willingness to sell at a loss, particularly among longer-term holders. Together, these signals suggest Bitcoin is in a mid-cycle stress phase: pressure is building, confidence is weakening, but widespread forced selling has not yet emerged. Profit Compression Without Capitulation Signals Adler also highlights the behavior of the Bitcoin LTH/STH SOPR Ratio as a critical lens for understanding the current market phase. This metric compares the profitability of coins being spent by long-term holders (LTH) versus short-term holders (STH), offering insight into who is absorbing losses and who is still distributing coins at a profit. High readings indicate that long-term holders are realizing profits far more efficiently than short-term participants, while lower values imply growing loss realization among newer entrants. Since peaking near 1.85 in October, the LTH/STH SOPR Ratio has fallen to around 1.13, representing a decline of roughly 40%. This sharp compression reflects a clear deterioration in profitability across the market. However, the indicator remains above the critical 1.0 threshold. Historically, sustained moves below 1.0 have marked periods where short-term holders capitulate en masse, selling at significant losses. Deeper drops into the 0.6–0.8 range coincided with full capitulation and cycle lows in 2015, 2019, and 2023. At the current level, profit margins are tightening for both cohorts, but long-term holders are still, on average, exiting positions above cost. Adler notes that a decisive break below 1.0 would signal a transition into true capitulation, while a recovery toward 1.3–1.4 would indicate renewed confidence. Taken together with rising unrealised losses, the data points to a mid-cycle stress phase rather than a terminal bear-market bottom. Related Reading: Bitcoin Miner Fees Remain Near Cycle Lows: What Does This Signal? Bitcoin Stabilizes After Sharp Sell-Off Bitcoin price action on the 12-hour chart reflects a market still under structural pressure. Despite a short-term stabilization attempt around the $78,000 zone. After an aggressive sell-off from the mid-$90,000s, BTC broke decisively below multiple key moving averages. This confirms a broader bearish regime rather than a simple pullback. The sharp downside impulse was accompanied by a notable spike in volume. Signaling forced selling and liquidation-driven flows rather than orderly profit-taking. Since tagging the local low near $78,000, the price has attempted a modest rebound. However, this bounce remains technically weak. Bitcoin continues to trade below the short-term and medium-term moving averages. Which are now sloping downward and acting as dynamic resistance. Previous support in the $88,000–$90,000 region has clearly flipped into a supply zone. Capping upside attempts and reinforcing the idea of a range forming beneath a broken structure. Related Reading: Bitcoin Bear Market Signal Emerges: Supply in Loss Rises Above 40% The current consolidation appears more consistent with a relief pause than a trend reversal. Momentum has slowed, but there is no evidence yet of sustained bid absorption or higher-timeframe demand stepping in. As long as BTC remains below the descending moving averages, downside risks persist. The price is vulnerable to renewed tests of the recent lows. Reclaiming and holding above the $82,000–$85,000 area would be required to signal a meaningful shift in short-term structure. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|Bitcoin capitulation|Bitcoin news|bitcoin price|Bitcoin Selling Pressure|Bitcoin Unrealized Loss|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57719853,
    "published": 1770181252000,
    "title": "Crypto Could Bounce Soon As Fundamentals Firm Up, Tom Lee Says",
    "body": "Tom Lee—long known for bullish takes—says crypto prices may be close to their floor. According to his comments on TV, he sees signs that buying pressure could return if the economic and on-chain backdrop holds. Related Reading: Gold Vs. XRP: One Asset Just Added 20x The Other’s Market Value During an interview on CNBC, Lee, Fundstrat’s head of research, said the current market setup could improve as fundamentals continue to firm up. That view sits alongside a big loss at his firm, which raises questions about how confident outside observers should be. Market Moves And Capital Flows Reports say capital moved sharply into precious metals as traders sought cover, and that flow drained money away from crypto. Gold and silver had run-ups that drew cash. At the same time, some market players were already light on borrowed positions. That mix left prices more exposed than many expected. “I think as long as crypto fundamentals are good, then crypto prices should follow,” says Tom Lee of @Fundstrat:https://t.co/pldeBkwChZ — Squawk Box (@SquawkCNBC) February 2, 2026 Big Sales And Liquidations About $2.56 billion in Bitcoin liquidations were recorded during the sharp swings this week, as traders closed out positions and risk appetite faded. Reports have disclosed that large sells pushed Bitcoin below key levels, and it dipped under $78,000 for a spell. BitMine, the firm tied to Lee, is reported to be sitting on roughly $6.95 billion in unrealized losses, a fact that complicates any narrative about neutral observers calling a bottom. Signals That Could Mark A Turn Reports note an uptick in Ethereum active accounts and growing work by big financial firms to build products on the network. Those are the kinds of measures that, over time, tend to reflect deeper demand than short-term speculation. A BitMine adviser has projected targets for Bitcoin and Ethereum—$77,000 and $2,400 respectively—and some say those levels could signal exhausted selling if reached. But the market has been jittery, and numbers on the screen can change fast. Policy Noise And Geopolitics Matter Policy moves in Washington have been flagged as a source of extra uncertainty. Some decisions by regulators and lawmakers are viewed as favoring certain firms or sectors, which adds to the uneven tone across risk assets. On top of that, tensions in the Middle East have pushed investors toward safe havens. When politics and geopolitics both push in the same direction, crypto tends to feel that pull. Related Reading: Bitcoin ETF Investors Pull Nearly $3 Billion, Pushing Average Buy Below Water Even if fundamentals look okay, timing is crucial. Liquidity conditions can tighten quickly if sentiment turns, and that can make any rebound short-lived or shallow. Reports say traders are watching for tapering in liquidations and clearer signs that flows into metals have paused before they will step back in with confidence. There is a case that the worst selling has happened. There is also a case that prices can fall further if a shock hits. Featured image from DALL-E, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|BitMine|btc|btcusd|crypto|Fundamentals|Tom Lee",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57719852,
    "published": 1770181199000,
    "title": "Nevada Moves to Bar Coinbase’s Prediction Markets Without State Gaming License",
    "body": "Nevada's enforcement action comes after Coinbase filed federal lawsuits challenging three other states over prediction market jurisdiction.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57720043,
    "published": 1770181681000,
    "title": "'Big Short' Michael Burry flags “death spiral” after silver liquidations beat bitcoin",
    "body": "Tokenized silver futures logged one of the largest wipeouts across crypto markets, overtaking the usual leaders bitcoin and ether.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Michael Burry|Silver|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57719916,
    "published": 1770181226000,
    "title": "Tether retreats from $20bn funding ambitions after investor pushback",
    "body": "CEO Paolo Ardoino downplays the scale of $185bn stablecoin group’s capital raise",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57720372,
    "published": 1770182563000,
    "title": "Crypto darknet drug kingpin Rui-Siang Lin gets 30 years",
    "body": "U.S. prosecutors say the Taiwanese operator of the $105 Million Incognito Market used cryptocurrency and anonymity tools before investigators tied him to the platform through domain records and digital traces.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|darknet|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57720612,
    "published": 1770185648000,
    "title": "ETF that feasts on carnage in bitcoin-holder Strategy hits record high",
    "body": "Leveraged anti-strategy ETFs are booming as shares in the bitcoin holder slide.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Strategy|Crypto ETF|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57720614,
    "published": 1770184810000,
    "title": "‘Sell Gold, Buy Bitcoin’: Cathie Wood Makes The Rotation Call",
    "body": "ARK Invest CEO Cathie Wood said she would “make a shift from gold into Bitcoin” after gold’s run left the metal looking extended on a key liquidity-adjusted measure, arguing that bitcoin’s supply dynamics and long-term adoption case still favor the crypto asset despite a sluggish year. Speaking on a Feb. 2 episode of The Rundown interview, Wood framed the call as part of a broader “great acceleration” thesis laid out in ARK’s latest “Big Ideas” report, which expects AI-driven capital expenditure to surge and spill into robotics, energy storage, blockchain, and life sciences through what she described as converging S-curves. Sell Gold, Buy Bitcoin Now? Wood pushed back on the idea that bitcoin has “lost its mojo” as gold has outperformed in recent years, starting with a statistical point. “First thing you should know, Bitcoin and gold are not correlated. We did the analysis the correlation […] is as close to zero as you can get so no correlation,” she said, adding that in the last two market cycles, gold led bitcoin before the crypto asset caught up. Related Reading: Bitcoin Net Taker Volume Sees Third-Largest Bearish Spike In 2 Years Her more forceful warning was directed at gold’s positioning versus broad money. “You’ll find this […] a chart showing gold divided by M2. It has only been—it has never been higher. It hit a new all-time high this week,” Wood said, arguing the setup resembles historical extremes that coincided with very different macro regimes. “Gold is probably riding for a fall […] The last two times it was anywhere near this was in the massive inflation […] in the 70s early 80s and […] the Great Depression.” Wood said the stablecoin boom has absorbed some of bitcoin’s “emerging markets” transaction narrative, but she characterized that as a payments-layer substitution rather than a savings-layer replacement. “That’s just for the equivalent of a checking account. When they want real savings, they’re going to buy Bitcoin, we believe,” she said, tying the view to ARK’s long-term upside case. She referenced a bull-case target of $1.5 million by 2030 in the conversation, alongside the firm’s previously discussed seven-figure framework. Related Reading: 70% Bitcoin Crash Incoming? CryptoQuant CEO Says It Depends On This Her core comparative claim against gold centered on issuance. “The supply growth of Bitcoin is 0.8% per year and it’ll drop to 0.4 in another two years,” Wood said, contrasting it with gold supply growth she pegged at about 1% on average and suggesting mining output could run higher than bitcoin’s deterministic issuance rate. She also pointed to “intergenerational wealth transfer” as a potential tailwind for bitcoin over time. Wood also offered a more tactical explanation for why bitcoin has struggled to sustain upside momentum, pointing to what she described as an October 10 “flash crash” tied to a software glitch at Binance and an auto-deleveraging cascade. “There was a flash crash caused by a software glitch at Binance and there was an auto deleveraging event,” she said. “People were just […] margin called to the tune of about 28 billion dollars […] and we think that is just now washing through the system.” Because bitcoin is “the most liquid of all crypto assets,” Wood argued it becomes “the first margin call,” making it the primary source of forced selling during broad deleveraging. She suggested that overhang is now fading, but her comments came before Monday’s downdraft that saw bitcoin slide to $74,600. In the interview, she said the market was “testing […] around 80,000 again” and expected it to “hold in the 80 to 90,000 range” absent a major geopolitical shock. “Unless all hell breaks loose in Iran […] then maybe we’ll see the store of value come back for Bitcoin,” she added. At press time, BTC traded at $78,377. Featured image from YouTube, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|Cathie Wood|gold",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57722629,
    "published": 1770191453000,
    "title": "Beyond Scaling: How SUBBD Token ($SUBBD) Realizes Vitalik’s Vision for Specialized L2s",
    "body": "Vitalik’s vision for Layer 2s becomes clear. The narrative surrounding blockchain scalability is undergoing a fundamental shift. Ethereum co-founder Vitalik Buterin recently signaled that the traditional view of Layer 2 (L2) as a mere scaling tool has reached its limits. Instead of a ‘rollup-centric’ model focused solely on speed, the industry is moving toward a future where L2s are seen as a collection of diverse, specialized options. Vitalik argues that for L2 projects to remain relevant, they must offer unique added value, such as specialized Virtual Machines for non-financial functions like AI, identity, and social platforms, rather than just being ‘cheap and fast.’ This evolution matters because it addresses the growing demand for socially meaningful applications. While Ethereum’s Layer 1 (L1) continues to scale through gas limit increases, the real innovation is now expected to happen at the application layer. The challenge for the next generation of blockchain projects is to build ecosystems where technology serves a specific human need, moving away from pure speculation and toward functional utility that can change how we interact online. As the market transitions toward these specialized environments, the creator economy has emerged as a prime candidate for disruption. By integrating AI-driven tools with decentralized social structures, new projects are fulfilling Vitalik’s call for ‘unique oracles’ and ‘specialized designs.’ One project, in particular, is leading this charge by building a dedicated ecosystem for creators and fans, perfectly aligning with the shift toward specialized, non-financial blockchain functions – SUBBD Token ($SUBBD) . SUBBD Token ($SUBBD) Steps in With an AI-Powered Creator Ecosystem SUBBDToken ($SUBBD) is positioning itself as the premier AI-driven platform to challenge the $85B subscription content industry. While traditional platforms struggle with high fees and creator burnout, $SUBBD leverages specialized AI agents to handle management tasks and enhance fan engagement. This aligns perfectly with the current trend toward specialized L2 functions, as it offers a dedicated environment for AI influencers and digital persona development. The platform allows creators to automate 24/7 interactions and provide personalized content, freeing them from the administrative burdens of legacy systems. The $SUBBD project is not just a concept; it is a rapidly growing powerhouse with over 2,000 top-earning creators and a combined reach of 250M followers. The project highlights its planned features, such as AI voice cloning, automated image generation, and ‘AI Livestreams,’ which provide the ‘ultra-low latency’ and unique designs that industry leaders are now prioritizing. Our experts see the value and predict an end-of-2026 price of $0.438 . If you bought at today’s price, that’s a potential ROI of 661%. Currently, the $SUBBD presale has raised over $1.47M, and you can buy tokens for $0.05749. This represents a ground-floor opportunity to participate in a project that is building the ‘socially meaningful applications’ the market craves. JOIN THE $SUBBD AI REVOLUTION TODAY. Staking and Creator Rewards: Driving Value in a Specialized Market In line with the movement toward decentralized governance and sustainable ecosystems, $SUBBD offers a robust staking model and reward structure. If you take part in the presale you can take advantage of a fixed 20% APY by staking your tokens, which also unlocks VIP perks such as early beta access, exclusive creator livestreams, and platform discounts. This model creates a circular economy where fans are rewarded for their loyalty and creators are incentivized to scale their presence using the platform’s advanced AI tools. The project’s roadmap is clear: moving from platform build and smart contract auditing, already verified by Coinsult and SolidProof, to a full-scale international launch and CEX listings. With 30% of the token supply dedicated to marketing and 20% to product development, $SUBBD is equipped to capture a significant share of the creator economy. As L2s evolve to become more than just bridges, $SUBBD stands as a prime example of a specialized platform delivering real-world value through AI and social connectivity, exactly what Buterin’s vision was referring to. Buy your $SUBBD from the official presale page. This is not intended as financial advice and should not be taken as such. Crypto is volatile, and you should always do your own research before making any investments.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57723028,
    "published": 1770192774000,
    "title": "Burry Warns of $1B Sell-Off: Why Bitcoin Hyper ($HYPER) is the Future of $BTC Utility",
    "body": "‘The Big Short’ investor Michael Burry has issued a stark warning to the markets. He suggests in his Substack that a potential Bitcoin plunge could trigger a massive $1B sell-off in traditional safe havens like gold and silver. Burry’s thesis is based on the idea that Bitcoin’s volatility is now so deeply intertwined with global finance that a ‘crypto-crash’ would force institutional deleveraging across all asset classes. This warning highlights a critical turning point: Bitcoin is no longer an isolated asset. It is a systemic pillar of the global economy. However, for Bitcoin to withstand this pressure, it must evolve beyond a simple ‘store of value.’ This warning matters because it underscores the desperate need for Bitcoin utility. If Bitcoin remains just ‘digital gold,’ it is subject to the same deleveraging risks as traditional commodities. However, if Bitcoin can become a functional, high-speed rail for global commerce and decentralized applications, it creates a layer of sticky utility that can mitigate the impact of price volatility. The market is now looking for Layer 2 solutions that don’t just scale Bitcoin, but transform it into a high-performance engine capable of handling institutional-grade throughput. As Burry’s warning echoes through the halls of Wall Street, the focus is shifting toward projects that can unlock the true power of Bitcoin. The goal is to build a network where $BTC is used not just for HODLing, but for payments, DeFi, and meme coins. This transition is essential for Bitcoin’s long-term resilience, and Bitcoin Hyper ($HYPER) is leading the charge by bringing SVM speed to the original blockchain. Bitcoin Hyper ($HYPER) Introduces High-Speed SVM Performance to the BTC Ecosystem Bitcoin Hyper ($HYPER) is positioning itself as the definitive solution to the utility crisis by launching the first true high-performance Layer 2 for Bitcoin. Unlike previous attempts that relied on slow sidechains, Bitcoin Hyper utilizes the Solana Virtual Machine (SVM) to deliver near-instant finality and incredibly low transaction costs. This architecture allows developers to build complex dApps and launch the best meme coins directly on top of Bitcoin’s security. By transforming ‘digital gold’ into a high-speed engine, the project aims to insulate the network from the deleveraging risks Michael Burry warned about. The technical framework is built around a trust-minimized canonical bridge and a Bitcoin Relay Program. This system allows users to deposit $BTC and receive a minted equivalent on the Layer 2, where they can trade or stake with zero friction. The network batches and compresses transactions using zero-knowledge (ZK) proofs, ensuring that the state of the Layer 2 is periodically and securely committed back to the Bitcoin Mainnet. The presale has already seen massive momentum, with over $31.2M raised as early adopters rush to secure their stake in what some might describe as the fastest layer in Bitcoin history. JOIN THE BITCOIN HYPER REVOLUTION TODAY. Staking and Scalability: The $HYPER Solution to Market Volatility The ongoing $HYPER presale offers a unique opportunity for participants to enter at the ground floor of a network designed for the 2026 landscape and beyond. Currently priced at $0.0136751 per token, the project incentivizes long-term holding through a robust staking model that offers 37% rewards. This mechanism is designed to secure the network while rewarding the community for its early support. By creating a functional reason to hold and use $BTC on a Layer 2, Bitcoin Hyper provides a buffer against the broad market sell-offs that Burry predicts. Investors are particularly drawn to the project’s 1:1 compatibility with the SVM, meaning any application built for Solana can be easily ported to Bitcoin Hyper. This opens the floodgates for a massive migration of liquidity and talent into the Bitcoin ecosystem. With audits from firms like Coinsult ensuring the security of the smart contracts, the project is rapidly becoming a top choice for those looking to capitalize on the Layer 2 narrative. Our experts predict $HYPER could reach $0.02595 by the end of 2026, giving you a potential ROI of 89% if you invested today. BUY YOUR $HYPER FROM THE OFFICIAL PRESALE PAGE. This article is for informational purposes only and does not constitute financial advice. Michael Burry’s warnings are speculative. Cryptocurrency investments carry high risk.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57707064,
    "published": 1770147302000,
    "title": "Dogecoin falls 7% as risk-off trade hits Ethereum tied tokens",
    "body": "The selloff was driven by risk-off positioning and heavy derivatives speculation, with futures volume surging even as spot trading declined.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57723426,
    "published": 1770193866000,
    "title": "Bitcoin ETF assets slip below $100B with fresh $272M outflows",
    "body": "Spot Bitcoin ETF AUM fell below $100 billion after $272 million in outflows, pushing year-to-date losses close to $1.3 billion.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57723936,
    "published": 1770195654000,
    "title": "Bitwise CIO Warns Market Is Facing A ‘Full-Bore’ Crypto Winter, Not A Pullback",
    "body": "Bitwise Chief Investment Officer Matt Hougan has released a new analysis of the current state of the crypto market, arguing that the industry has been firmly entrenched in a bear market for over a year. In a report shared on social media, Hougan stated that his research indicates the current downturn began as early as January 2025, despite widespread optimism fueled by institutional adoption, regulatory progress, and Bitcoin’s (BTC) rally to new all-time highs. Deep Bear Market Driving Crypto? Posting on X, formerly Twitter, Hougan pushed back against the idea that recent price weakness represents a routine pullback or short‑term dip. Instead, he described the current environment as a full‑scale crypto winter comparable to past downturns in 2018 and 2022. Interestingly, Hougan said the crypto market currently resembles a “2022‑like, Leonardo‑DiCaprio‑in‑The‑Revenant‑style” winter, driven by excessive leverage built up during the prior cycle and heavy profit‑taking by long‑time crypto holders. Related Reading: What’s Next For Bitcoin? Two Key Scenarios: Will It Crash To $60,000 Or Surge To $100,000? Hougan addressed a question many investors have been asking: why prices continue to fall despite a steady stream of positive developments. He pointed to expanding institutional involvement, improving regulation, and broader adoption as clear long‑term positives, but said none of that typically matters during the deepest phase of a bear market. According to Hougan, crypto winters are periods when good news is largely ignored, regardless of its significance. Even developments such as Wall Street firms hiring aggressively or major banks like Morgan Stanley increasing their crypto exposure are unlikely to spark a rally in the short term. He also cited market sentiment indicators to support his view. Hougan noted that the Crypto Fear and Greed Index remains near historically high levels of fear, even as the newly appointed Federal Reserve (Fed) chair is publicly supportive of Bitcoin. To him, this disconnect underscores how deeply negative sentiment has become. Drawing on past cycles, Hougan said crypto winters rarely end with renewed excitement or optimism. Instead, they typically conclude when investors are exhausted and disengaged. ETF Support Propped Up Bitcoin? Looking to history, Hougan observed that previous crypto winters have lasted roughly 13 months. Bitcoin reached its peak in December 2017 before bottoming a year later, and again peaked in October 2021 before hitting its low point in November 2022. By that measure, the current cycle might suggest more pain ahead, particularly since Bitcoin peaked again in October 2025. However, Hougan argued that focusing solely on that date misses a critical detail. In his view, the current winter actually began in January 2025 but was partially hidden by extraordinary institutional inflows. He said strong demand from exchange‑traded funds (ETFs) and Digital Asset Treasuries (DATs) masked underlying weakness across much of the crypto market. Hougan emphasized the scale of institutional support for Bitcoin in particular, calling it unprecedented. During the period he analyzed, ETFs and DATs collectively purchased more than 744,000 BTC, representing roughly $75 billion in buying pressure. He suggested that without this support, BTC’s price could have fallen by as much as 60%. Related Reading: Hyperliquid Unveils HIP‑4, Sending HYPE 14% Higher On Outcome Trading Plans Despite this, Bitwise CIO suggested several possible catalysts that could help lift sentiment and mark the beginning of a crypto recovery, including strong global economic growth that reignites risk appetite, progress on the CLARITY Act, early signs of sovereign adoption of Bitcoin, or simply the passage of time. Reflecting on his experience through multiple crypto market cycles, he said the current mood of despair, fatigue, and malaise closely resembles the final stages of past crypto winters. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|Bitcoin news|bitcoin price|bitwise|Bitwise CIO|btc|crypto|crypto analyst|crypto market|crypto news|crypto winter|cryptocurrency|Matt Hougan",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57723890,
    "published": 1770195177000,
    "title": "Tether scales back $20 billion funding ambitions after investor resistance: FT",
    "body": "Advisers are now discussing a smaller fundraising of roughly $5 billion, as prospective backers question both the size of the deal and Tether’s lofty valuation.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Tether|Stablecoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57722573,
    "published": 1770191252000,
    "title": "Bitwise to acquire crypto staking company Chorus One: Report",
    "body": "The reported acquisition comes as Ethereum staking demand surges, with more than 30% of ETH supply locked and validator wait times stretching beyond 70 days.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57724514,
    "published": 1770197659000,
    "title": "Market ‘Losses by Design’: Why MaxiDoge ($MAXI) Is the Ultimate Hedge for Strategic Traders",
    "body": "The crypto world was recently rocked by news of Bitmine’s staggering $6 billion paper loss on Ether. But according to veteran analyst Tom Lee, in a series of X posts , this massive figure is actually ‘by design.’ In a market where high-level institutional strategies often involve complex hedging and intentional tax-loss harvesting, what looks like a catastrophe to the average observer is often a calculated move by the ‘smart money.’ This revelation highlights a growing trend in 2026: the market is no longer driven by simple supply and demand, but by sophisticated maneuvers that prioritize long-term positioning over short-term optics. This ‘designed loss’ narrative matters because it changes how retail investors perceive volatility. When institutional giants are comfortable sitting on multi-billion dollar paper losses to achieve broader strategic goals, it signals that the current market dip is a period of accumulation rather than a terminal decline. However, for the retail trader, surviving these institutional games requires a different kind of asset, one that embraces the ‘full send’ nature of the market while offering a culture of resilience. As the majors are used as pawns in institutional chess, the community is looking for high-conviction projects that thrive on the very volatility these giants create. The shift in sentiment is clear: while institutions play for paper losses, degens are playing for ‘max gains.’ This has led to a surge in interest for projects that represent the ‘locked-in’ trader mindset, those who see a $6 billion loss and simply double down on their conviction. This is where the narrative of the resilient, high-leverage trader takes center stage, bridging the gap between institutional strategy and retail defiance. And Maxi Doge ($MAXI) is the project that exemplifies all that. MaxiDoge ($MAXI) Steps in With Gamified Rewards and High-Leverage Culture Maxi Doge ($MAXI) is the ‘locked-in’ symbol of the modern crypto degen, the trader who watches institutional ‘losses by design’ and responds with 1000x leverage. Far from a standard meme project, $MAXI is built for the ‘Maxi’ lifestyle, where extreme risk meets the potential for extreme gains. Maxi Doge plans to feature a robust ecosystem, including $MAXI contests for top ROI hunters and future integrations with trading platforms to facilitate gamified tournaments. By tapping into the culture of extreme crypto trading, MaxiDoge is creating a community that finds opportunity where others find institutional manipulation. The project’s tokenomics are designed to fuel this ‘full send’ mentality. With 40% of the supply dedicated to aggressive marketing and 15% to liquidity, the project is built to handle the extreme trading volume typical of the best meme coins. SolidProof and Coinsult audits provide a layer of security for those looking to ‘ape in’ during the presale, as no issues were found. Currently, the MaxiDoge presale has raised over $4.55M, with the current price sitting at $0.0002802. GET PUMPING AND JOIN THE $MAXI PRESALE. The Maxi Fund and Staking: Building the Future of Degen Wealth To ensure the project maintains its ‘max pump’ dynamics, the team has established the ‘Maxi Fund,’ which uses 25% of the token allocation for project exposure and ecosystem growth. This fund acts as a war chest for global marketing campaigns and partnerships with top-tier influencers who understand the ‘Maxi’ ethos. Furthermore, Maxi Doge offers a dedicated staking rewards pool (rates currently at 68%) with daily smart contract distributions. If you’re a $MAXI holder, it allows you to earn passive income while you wait for the next major market move, effectively ‘bulking up your bags’ without needing to monitor the charts constantly. The roadmap for Maxi Doge is as aggressive as its branding, moving from the ‘Wake Up’ phase of smart contract audits to the ‘PM Discord Ops’ phase, where it hopes KOLs and PR blitzes will take center stage. Unsure how to lock in? Check out our ‘ How to Buy Maxi Doge ‘ guide for all the info. As institutional players continue to report ‘losses by design,’ $MAXI stands ready to capture the attention of those who trade on maximum leverage and never look back. GRAB YOUR $MAXI TOKENS AND GET LOCKED IN. This is not financial advice. High-leverage trading involves extreme risk and potential loss of all capital. You should always do your own research before making any investments.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57725098,
    "published": 1770199237000,
    "title": "Bitcoin Drop Below $80,000 May Not Be The Final Capitulation Event, Checkonchain Says",
    "body": "On-chain analytics firm Checkonchain has pointed out how data could suggest that the latest Bitcoin decline is part of a deeper bear market progression, rather than the final capitulation event. Bitcoin Has Broken Below Both True Market Mean & Average ETF Cost Basis In a new post on X, Checkonchain has talked about the recent bearish action in the Bitcoin price. As the below chart shared by the analytics firm shows, this drawdown has taken the cryptocurrency below two key on-chain cost basis levels. The first level that Bitcoin dropped under was the ETF Cost Basis, corresponding to the average inflow price of the US spot exchange-traded funds (ETFs). Before this, the asset had stayed above the line since the second half of 2024. A close call came in the last quarter of 2025, but the level had ended up acting as a support cushion. This time around, however, the price went straight through the line. After the ETF Cost Basis was broken, the next level Bitcoin lost was the True Market Mean, a metric tracking the average buying price of the economically active BTC supply. Thus, the break also sent the majority of the asset’s active investors into a state of net unrealized loss for the first time since 2023. Related Reading: Shiba Inu’s Fate Hinges On This Support Level, Analyst Warns While the price drawdown so far has clearly induced a lot of market pain, it may not be enough yet, as Checkonchain has noted, “the underlying data suggests this is progression deeper into the bear, not the final capitulation event.” The analytics firm has listed a few metrics pointing to this. First, the spot ETFs have faced negative netflows recently, but while the outflows have been sizeable, they have still lacked the character associated with the panic exodus witnessed at the end of a cycle. Likewise, on-chain losses have observed an increase as the market crash has occurred, but they also haven’t yet reached a level that may be considered to be a reflection of a true capitulation event. Finally, futures market data suggests traders have still been trying to catch the bottom. Checkonchain has described these conditions as “a regime where durable lows rarely form.” Related Reading: Bitcoin Net Taker Volume Sees Third-Largest Bearish Spike In 2 Years This speculation from futures traders has been resulting in mass liquidations on the various exchanges. During the past day alone, long Bitcoin bets worth $50 million have been liquidated as the price has seen a swing from around $79,000 to levels under $76,500, according to data from CoinGlass. In total, the cryptocurrency market as a whole has witnessed the flush of $185 million in long positions inside this window. BTC Price At the time of writing, Bitcoin is trading around $76,100, down nearly 14% over the last week. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin capitulation|Bitcoin True Market Mean|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 44,
        "NAME": "SHIB",
        "CATEGORY": "SHIB"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57724824,
    "published": 1770198482000,
    "title": "Over 60% of crypto press releases are linked to high-risk or scam projects, study finds",
    "body": "Crypto press release services often provide misleading marketing content, creating an illusion of legitimacy by placing unverified announcements alongside legitimate news.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|News|top news|crypto market|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57725480,
    "published": 1770200291000,
    "title": "Crypto’s wealthy investors and industry leaders see IPO hype waning in 2026",
    "body": "Despite expectations for some IPO and venture activity in 2026, fewer investors feel as confident as they did last year, according to the latest CfC St. Moritz report.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|CoinDesk Wealth|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 57725999,
    "published": 1770201743000,
    "title": "Top Trending Crypto Assets: MaxiDoge ($MAXI) Defies the Global Market Sell-Off",
    "body": "The cryptocurrency market is currently battling a period of extreme turbulence for its major assets. Bitcoin , Ethereum , and XRP , are experiencing a painful free fall. This broad market sell-off stems from a mix of macroeconomic uncertainty and a sharp cooling of an earlier bullish sentiment. Consequently, while the ‘big three’ struggle to find a stable floor, the surrounding volatility has redirected the attention of seasoned traders. Instead of retreating, investors are moving toward high-conviction assets that thrive in chaotic environments. Historically, when the majors bleed, capital rotates into projects with strong cultural narratives and aggressive growth strategies. These shifting dynamics carry significant weight for the retail sector. Because traditional portfolios are taking a hit, the ‘degen’ community, traders who embrace maximum risk, is pivoting toward the meme coin sector to recoup losses. Indeed, in a sea of red candles, the projects that stand out are those that lean into the professional trader’s lifestyle. These projects celebrate the ‘locked-in’ mindset of those who trade through the sweat and exhaustion of a 24/7 market. Ultimately, this shift represents more than just speculation; it is about finding a community that refuses to hit the stop-loss button. As the broad market correction continues, the investment focus is sharpening on projects that offer more than just a funny image. Today’s investors demand audited security, high-leverage utility, and a clear roadmap for ecosystem dominance. Fortunately, Maxi Doge ($MAXI) is emerging as the ultimate mascot for this resilient trader class, offering a unique blend of ‘Doge’ culture and trading incentives to help traders weather the storm. MaxiDoge ($MAXI) Empowers High-Frequency Traders With Performance Utility MaxiDoge ($MAXI) acts as the definitive beacon for the high-octane trader, the individual who thrives on the 24/7 volatility of the Ethereum network. Rather than launching a standard meme project, the creators developed $MAXI to cater to the ‘Maxi’ ethos, where disciplined risk management meets the pursuit of massive ROI. Furthermore, the ecosystem plans to integrate $MAXI contests designed specifically for top-performing traders, alongside future plans for futures platform integrations and gamified tournaments. By embracing the culture of extreme market movements, MaxiDoge provides a home for those who view market dips as entry points rather than exits. To sustain this high-performance model, Maxi Doge utilizes a strategic tokenomic structure built for longevity and volume. Specifically, the team allocated 40% of the supply to global marketing and 15% to liquidity, ensuring $MAXI can absorb the rapid price action typical of top trending crypto assets. Moreover, the smart contracts have undergone rigorous third-party audits by Coinsult and SolidProof, offering peace of mind to those joining the presale. As of now, the Maxi Doge presale has successfully raised over $4.55M, and tokens sit at $0.0002802. JOIN THE MAXI DOGE PRESALE BEFORE THE NEXT PUMP Accelerating Ecosystem Dominance Through Strategic Milestone Execution The roadmap for Maxi Doge prioritizes a high-intensity rollout to ensure the project maintains its market lead during periods of broad volatility. Moving beyond the ‘Wake Up’ phase of security audits, the project is now entering a stage focused on aggressive PM Discord operations and Tier-1 influencer onboarding. By securing international ambassadors and forging futures trading partnerships, the developers aim to cement $MAXI as the premier currency for the leveraged trading community. This structured approach ensures that the project transitions from a successful presale into a high-liquidity asset capable of sustaining extreme DEX trading volumes. To further solidify its market position, the project has established the ‘Maxi Fund,’ which aims to aggressively reinvest in global visibility and optimal pump dynamics. This fund works in tandem with a dedicated staking pool that offers dynamic APY (currently 68%), incentivizing you to lock in your tokens and reduce circulating supply during critical launch windows. As the market looks for assets that can weather institutional sell-offs, $MAXI offers the perfect blend of audited security and aggressive growth potential. GRAB YOUR $MAXI TOKENS AND GET LOCKED IN This article is not intended as financial advice and should not be taken as such. Crypto is a volatile investment, and you should always do your own research before committing any capital.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57726062,
    "published": 1770201644000,
    "title": "Ethereum price: Classic chart pattern suggests ETH will go below $2K",
    "body": "Ether risks declining toward the $1,665-$1,725 range in February, according to a confluence of bearish technical and on-chain indicators.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57726626,
    "published": 1770203525000,
    "title": "LiquidChain ($LIQUID) Unlocks Unified Liquidity as Kraken Parent Reports Revenue Jump",
    "body": "The digital asset landscape is undergoing a massive shift from speculative trading to structural maturity, a move underscored by the latest financial results from Payward Inc. (the parent company of Kraken). On February 3, 2026, Payward reported a staggering $2.2B in adjusted revenue for 2025, marking a 33% year-over-year increase. More importantly, the data reveals a sea change in how capital is moving: while trading volume surged 34% to hit $2T, more than half of the company’s revenue (53%) now comes from non-trading services like custody, payments, and financing. This revenue surge highlights a critical bottleneck in the current market. As institutional giants and retail traders alike pile into the ‘Big Three’, Bitcoin, Ethereum, and Solana, they are finding their capital trapped in isolated silos. Payward’s growth was largely fueled by its role as a ‘unified infrastructure layer’ for its subsidiaries, yet the decentralized world remains fractured. Moving assets between Bitcoin’s security, Ethereum’s DeFi depth, and Solana’s execution speed still relies on clunky, high-risk bridges that create friction for the 5.7M funded accounts now active on platforms like Kraken. The market message is clear; the next step needs to be about providing a layer that can unify this fragmented liquidity. For the DeFi ecosystem to scale alongside traditional finance, it requires a decentralized equivalent to the unified systems used by major exchanges. It needs a unified solution that brings liquidity to one place – enter LiquidChain ($LIQUID) . Beyond Bridges: The LiquidChain ($LIQUID) Interoperability Revolution LiquidChain ($LIQUID) isn’t just another blockchain; it’s a specialized execution environment designed to collapse the distance between fragmented networks. While traditional Layer 2s focus on scaling a single chain, LiquidChain operates as a Layer 3 ‘Super-Hub’ that pulls Bitcoin’s massive store of value and Solana’s ultra-fast transaction speeds directly into Ethereum’s vibrant DeFi ecosystem. By implementing a Parallel Execution Engine, LiquidChain allows users to trigger trades that settle across multiple chains simultaneously. This removes the ‘wait time’ usually associated with cross-chain movement. Developers can now build applications that tap into the liquidity of all three major networks at once, without forcing users to manage multiple wallets or navigate complex gas fee structures for three different chains. With over $524K raise so far in its presale, the market is quickly realizing that $LIQUID is building the “highway system” that makes the rest of the crypto economy functional. At the current entry price of $0.0135, early adopters are positioning themselves at the core of this new architectural standard. BE PART OF UNIFYING LIQUIDITY -GET YOUR $LIQUID NOW 2026 Roadmap: Scaling Global Liquidity and Staking Incentives The $LIQUID vision for 2026 is centered on radical accessibility. To ensure the network has the deep pools necessary for institutional-grade trades, LiquidChain has introduced a dynamic staking protocol. Early supporters can access impressive staking rewards currently at 1965%, a rate specifically calculated to attract the ‘Liquidity Providers’ needed to fuel the Layer 3 engine. $LIQUID’s tokenomics are built for long-term dominance rather than short-term hype: Infrastructure Fund (35%) : Reserved for maintaining the cross-chain proof validators. Global Outreach & Labs (32.5%): Focused on onboarding the next generation of cross-chain dApps. Security & Audits: Continuous rigorous testing to ensure the ‘bridge-less’ architecture remains the safest way to move value. As Payward’s record revenues prove that the crypto audience is growing at an exponential rate, the demand for a unified execution layer becomes undeniable. LiquidChain is moving toward its Token Generation Event (TGE) with a clear mandate: stop the fragmentation and start the unification. SECURE YOUR PLACE IN THE $LIQUID PRESALE This article is not intended as financial advice and should not be treated as such. Crypto is a volatile investment. Always do your own research before committing any capital.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57727025,
    "published": 1770204549000,
    "title": "Crypto steadies after selloff as bitcoin, ether rebound from multiyear lows",
    "body": "Bitcoin and ether are posting gains after a sharp market-wide decline, with derivatives traders continuing to reduce risk exposure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|Derivatives|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57726824,
    "published": 1770203789000,
    "title": "Tether trims $20B funding plan amid $500B valuation skepticism: Report",
    "body": "Tether CEO Paolo Ardoino scaled back the company's $20 billion funding plan, calling the target a \"misconception,\" while maintaining a $500 billion valuation.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57726762,
    "published": 1770203700000,
    "title": "The Super Bowl Of Power Played Its Biggest Game Without Half The Team",
    "body": "Just like the Super Bowl, Davos sets the rules for AI and blockchain. With women a quarter of attendees, leadership gaps risk bias, governance, and lost economic value.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|Business|/business|Innovation Rx: Technologies|/feature/innovation-rx/technologies|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 57727767,
    "published": 1770206725000,
    "title": "This onchain metric has identified the Bitcoin bottom every cycle",
    "body": "Convergence between bitcoin supply in profit and supply in loss has repeatedly coincided with major market lows.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Glassnode|losses|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57728379,
    "published": 1770208583000,
    "title": "Toobit and LALIGA Forge Strategic Path for MENA Growth Following Landmark Press Event",
    "body": "What to Know: Regional Synergy: The Toobit and LALIGA partnership targets the MENA region’s high digital asset adoption and 8.7% annual sports growth. Massive Rewards: A $2 million initiative features the Super Match Carnival and Elite Championship with 150% cashback and mystery boxes. Fan Engagement: The roadmap includes VIP trips to Spain, signed LALIGA merchandise, and upcoming events with football legends. Market Leadership: MENA leads the world in stablecoin utility, accounting for over 52% of regional transaction activity. The intersection of elite global sports and the digital asset economy has reached a new milestone. In a high-profile press event held on February 4, 2026, the cryptocurrency exchange Toobit and LALIGA (the official Football League of Spain) outlined their strategic roadmap for the MENA region. This partnership, operating under the rallying cry ‘Play on a bigger stage, ‘ aims to harmonize the adrenaline of elite football with the sophisticated security of modern trading platforms in the 2025/2026 football season. The implications for the MENA market are significant, as regional sports interest is projected to grow at 8.7% annually, nearly triple the global average of 3.3%. Furthermore, with stablecoins accounting for over 52% of regional transaction activity, the appetite for digital assets in the region is undeniable. By positioning itself as the Official Regional Partner of LALIGA in MENA, Toobit is tapping into a demographic that thrives on strategic vision and the ability to decide quickly. Recent data suggests that football fans are 78% more likely to engage with cryptocurrency than the general population. This synergy provides a robust foundation for Toobit to bridge the gap between cultural excitement and measurable results. As the partnership unfolds, the focus remains on connecting the passion of the fan with the ambition of the trader through localized education and secure market access. Toobit and LALIGA ‘Play on a Bigger Stage’ With $2M Fan Initiative To celebrate the regional alliance, Toobit has unveiled an expansive $2M rewards pool designed to reward community engagement and trading excellence. This initiative features the Super Match Carnival and the Elite Championship , offering a variety of incentives ranging from tiered bonuses to a staggering 150% cashback for active participants. The roadmap is not limited to digital rewards; it extends ‘beyond the pitch’ to provide fans with the tools needed to navigate the digital economy securely while engaging with their favorite clubs. The strategic vision shared by Toobit Co-Founder Kelly and LALIGA Managing Director Maite Ventura emphasizes a fan-centric approach. ‘People often ask what a crypto exchange and a world-class football league have in common. To us, the answer is in the values we share,’ said Kelly, Co-Founder and Chief Operating Officer at Toobit . ‘Success comes when a deep understanding of the environment allows for confident movement, whether that is a player reading the pitch or a trader analyzing a market trend.’ The strategic vision shared by Toobit Co-Founder Kelly and LALIGA Managing Director Maite Ventura emphasizes a fan-centric approach. Key experiential rewards include: VIP Matchday Experiences: All-expenses-paid trips to Spain to witness LALIGA action live. Memorabilia Giveaways: Signed jerseys and limited-edition items from world-renowned clubs. Legend Activations: Upcoming events featuring LALIGA ambassadors at major regional milestones. By integrating these rewards, Toobit is creating a lasting, more organic, and interactive connection with the army of League fans. The partnership reflects a shared belief in the power of technology to enhance the fan experience, making the 2025/2026 season a transformative period for both the sports and crypto sectors in MENA. DISCOVER THE TOOBIT AND LALIGA REWARDS POOL Strategic Roadmap and Regional Growth Drive Toobit Expansion The collaboration comes at a time when the MENA region, known for being a world leader in stablecoin utility, is undergoing rapid evolution. This trend aligns perfectly with Toobit’s brand identity as an exchange built for those who thrive on exploring new frontiers. The 2025/2026 season roadmap focuses on localized initiatives, ensuring that fans are not just spectators but active participants in the digital economy. Success in both trading and professional sports requires a deep understanding of the environment, whether it’s a player reading the pitch or a trader analyzing market trends. Toobit’s commitment to providing a fair, secure, and transparent experience is mirrored in LALIGA’s drive for excellence. As Kelly noted during the event , ‘By partnering with LALIGA, we are inviting everyone to ‘Play on a bigger stage,’ where the passion of the fan meets the ambition of the trader.’ As the largest football ecosystem globally, LALIGA brings a network of 268M followers and a presence in 35 countries, providing Toobit with an unparalleled platform to showcase its cutting-edge technology and deep liquidity. JOIN THE TOOBIT COMMUNITY AND PLAY ON A BIGGER STAGE This article is for informational purposes only and does not constitute financial advice. Cryptocurrency investments involve risk; please conduct your own research.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57728300,
    "published": 1770208305000,
    "title": "TRM Labs hits unicorn status in $70 million fund raise with Goldman's participation",
    "body": "The company's software specializes in tracing cryptocurrency transactions across multiple blockchains, catering to increasing demand from law enforcement and financial firms amid rising crypto crime.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|TRM Labs|Fundraising|Series C|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57727964,
    "published": 1770207117000,
    "title": "Bitcoin bounces to $76K, but onchain and technical data signal deeper downside",
    "body": "Bitcoin’s rebound masks weak technicals and onchain signals that point to continued downside risk, with miners and exchange flows reinforcing the bearish trend.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57728938,
    "published": 1770210014000,
    "title": "XRP Just Hit A Golden Pocket, Relief Bounce Puts Price At $2.5",
    "body": "XRP is showing signs of a potential bullish turnaround after recently hitting a Golden Pocket. Analysts say this Golden Pocket could trigger a strong relief bounce in the XRP price, potentially propelling it toward $2.50. At the same time, they predict that a price drop to new lows remains possible if the market does not unfold as expected. In an X post on Monday, crypto market analyst CasiTrades announced that XRP has hit a Golden Pocket, bringing attention to an upcoming W4 relief bounce that could fuel a rally to $2.5. Sharing a detailed Elliot Wave chart, she noted that XRP experienced an expected flush into the Golden Pocket around the 0.618 Fibonacci level near $1.93. At the same time, the cryptocurrency aligned well with the 1.618 Extension for Wave 3, which CasiTrades describes as a textbook move. XRP Golden Pocket Signals Rally To $2.5 According to the analyst, this sets the stage for a full Wave 4 relief to begin. She pointed out that the first resistance to watch is the 0.382 Fibonacci Retracement level at $1.78, which also coincides with a previous support breakdown and could serve as a backtest of resistance. Related Reading: XRP To $11, And Then $70: The Next Impulse Wave To Watch Out For CasiTrades noted that XRP experienced a very shallow Wave 2, only retracing to the 0.382 Fibonacci level in the Elliott Wave chart structure. She explained that modest Wave 2 corrections often signal a deeper Wave 4 retracement, indicating the XRP price could experience a stronger pullback during the next corrective phase before potentially resuming its upward trend. Based on this pattern, the analyst stated that Wave 4 could push XRP higher, potentially reaching the $1.93 level from its current price of around $1.60. She added that the cryptocurrency could climb further to $2.03, which corresponds to the macro 0.5 retracement level. CasiTrades emphasized that XRP would need to reclaim the $2.03 level and hold it as support before a sustained upward move could begin. This highlights $2.03 as a key turning point that could trigger XRP’s next breakout phase above $2.50. The analyst further explained that holding $2.03 as support would eliminate the need for another corrective wave down toward $1.55 or lower. She added that maintaining this level could also prevent Wave 5 from failing. What Happens If Support Fails In her Elliott Wave analysis, CasiTrades admitted that “nothing is confirmed yet,” keeping her bullish outlook for XRP speculative. She noted that XRP’s recent drop to new lows created a Bullish Divergence, but the market could still revisit lows. Related Reading: XRP Price Could Surge Another 30% If This Trend Is Confirmed CasiTrades said that XRP’s bullish scenario will only be confirmed once it breaks through the key resistance level. The accompanying chart highlights the potential downside of support failing, projecting a roughly 8% decline from $1.60 to $1.47. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|bullish divergence|CasiTrades|elliot wave theory|Fibonacci retracement levels|golden pocket|Ripple|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57728937,
    "published": 1770210000000,
    "title": "Opinion raises $20 million as prediction markets draw capital in a weak crypto market",
    "body": "The blockchain-based platform says it handles a third of global prediction-market volume, betting that onchain settlement and category diversification can sustain growth.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Prediction Markets|Funding Rounds|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57728936,
    "published": 1770209850000,
    "title": "Bitcoin nears pre-election floor as ETF flows stall, Citi says",
    "body": "The cryptocurrency is trading below key ETF cost levels and nearing its pre-election price floor as inflows to these vehicles fade and headwinds build, the bank said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Bitcoin ETF|Citigroup|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57729319,
    "published": 1770210970000,
    "title": "Critics tell UK Lords stablecoins are not future money",
    "body": "At a House of Lords hearing, witnesses cast doubt on stablecoins as mainstream money, backing strict Bank of England oversight and criticizing the \"disastrous\" US GENIUS Act for letting non‑banks into “the money business.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 57729128,
    "published": 1770210528000,
    "title": "January rally bolsters near-term outlook for bitcoin mining stocks, JPMorgan says",
    "body": "Shares of mining companies rose last month despite softer bitcoin prices as storms cut the network hashrate and AI optimism grew, the bank said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin Mining|Bitcoin News|JPMorgan|Hashrate|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57729117,
    "published": 1770210117000,
    "title": "Mercado Bitcoin expands LatAm RWA push with $20M in Rootstock private credit",
    "body": "Brazil’s Mercado Bitcoin has issued more than $20 million in tokenized private credit on Bitcoin sidechain Rootstock and is targeting $100 million by April.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57729668,
    "published": 1770211862000,
    "title": "Morning Minute: Trump's Crypto Entanglements Threaten CLARITY Act Timeline",
    "body": "World Liberty Financial's $500 million deal with the UAE is causing major backlash in Congress, with the Clarity Act caught in the crossfire.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Opinion",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57729617,
    "published": 1770211800000,
    "title": "ProShares unveils first U.S. ETF that lets you buy the top 20 cryptos at once",
    "body": "ProShares has listed KRYP, the first U.S. ETF designed to track the CoinDesk 20 Index, giving investors exposure to the largest and most liquid cryptocurrencies.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|CoinDesk 20|ETFs|ProShares|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57729558,
    "published": 1770211412000,
    "title": "TRM Labs completes $70M investment round at $1B, becomes crypto unicorn",
    "body": "Blockchain intelligence firm TRM Labs reached a $1 billion valuation after closing a $70 million Series C funding round backed by major financial institutions.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57730328,
    "published": 1770213662000,
    "title": "Vitalik Buterin Calls for Inclusion of Prediction Markets, DAOs in Creator Coin Ecosystem",
    "body": "The Ethereum co-founder says that prediction markets and creator DAOs would reward inherent value, rather than celebrity or virality.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57730700,
    "published": 1770214773000,
    "title": "CIRO Formalizes Interim Crypto Custody Framework as LiquidChain Unifies ‘The Big 3’",
    "body": "What to Know: CIRO has formalized interim custody terms for Canadian crypto platforms, mandating stricter capital requirements and defined custodial locations. The regulations aim to reduce counterparty risk and pave the way for greater institutional participation in the crypto market. LiquidChain introduces a Layer 3 infrastructure that unifies Bitcoin, Ethereum, and Solana liquidity into a single execution environment. The ‘Deploy-Once’ architecture allows developers to build cross-chain applications without managing multiple codebases. The era of regulatory ambiguity in North American crypto markets is ending. Fast. The Canadian Investment Regulatory Organization (CIRO) has officially formalized its interim terms and conditions for crypto asset trading platforms (CTPs), marking a hard pivot toward institutional-grade custody standards. It’s not just about restriction, it’s about maturation. The interim crypto custody framework strictly defines ‘acceptable securities locations,’ forcing platforms to prove exactly where client assets sit. Implications for market participants are massive. The framework mandates rigorous capital requirements and limits where crypto assets can be held, effectively forcing CTPs to partner with custodians that meet distinct regulatory benchmarks. That matters. It directly targets the counterparty risk that decimated trust during the 2022 offshore exchange collapses (think FTX). By clarifying these rules, CIRO is laying the plumbing for traditional finance (TradFi) to enter the sector without looking over its shoulder. But there’s a catch. While regulators build safer silos for assets, the market faces a technical crisis: fragmentation. As compliant frameworks lock assets into specific ecosystems, moving liquidity between Bitcoin, Ethereum, and Solana gets harder. Capital becomes safe, sure, but stagnant. Policy won’t fix this; infrastructure will. That’s the gap LiquidChain ($LIQUID) targets, proposing a unified environment where chain borders essentially vanish. Layer 3 Infrastructure Targeting Liquidity Fragmentation Right now, DeFi looks like a series of walled gardens. Bitcoin has the value, Ethereum has the contracts, and Solana has the speed. Moving capital between them usually means risky bridges or ‘wrapped’ assets, mechanisms that have historically been the biggest vectors for hacks. LiquidChain enters as a Layer 3 (L3) protocol designed to fuse these ecosystems without that traditional friction. Think of LiquidChain as a universal translator for liquidity. Instead of forcing you to juggle three different wallets, gas tokens, and confirmation times, the protocol aggregates liquidity from the ‘Big 3’ into one execution layer. It’s aiming to be single-step execution: a transaction starting with $BTC liquidity can interact with an $ETH-based DeFi protocol or a $SOL-based NFT marketplace. No distinct hops required. This approach cuts reliance on fragmented liquidity pools. By verifying settlement across chains through a unified Cross-Chain VM (Virtual Machine), LiquidChain attacks the capital inefficiency plaguing the market. As CIRO’s framework encourages institutions to custody assets safely, protocols like this provide the rails for that capital to actually flow. Compliance shouldn’t mean gridlock. BUY YOUR $LIQUID HERE Deploy-Once Architecture Simplifies Institutional Access Canada’s rules suggest the next wave of crypto adoption will be driven by developers building compliant, institutional-grade applications. But here’s the headache: a developer wanting broad reach currently has to code for EVM (Ethereum), Rust (Solana), and Bitcoin Script separately. That triples the workload and the surface area for bugs. LiquidChain aims to fix this with its ‘Deploy-Once’ architecture. Developers write logic once that accesses assets across all supported chains simultaneously. For a new compliant exchange operating under CIRO’s guidelines, this could mean building a single interface sourcing deep liquidity from Bitcoin, Ethereum, and Solana without managing three backend nightmares. With the proposition on offer, it’s not surprising to see why $LIQUID made our list of the best crypto to buy . Plus, the protocol introduces a model for ‘Liquidity Staking’ to incentivize the fuel needed for this interoperability. LiquidChain is essentially betting that the future is about how effectively different chains work together. As clarity, like the interim crypto custody framework in jurisdictions like Canada, lowers the barrier to entry, the demand for infrastructure that simplifies complexity is only going to grow. BUY YOUR $LIQUID FOR $0.0135 The content provided in this article is for informational purposes only and does not constitute financial advice. Cryptocurrency investments carry significant risk, including the potential loss of principal. Always conduct your own research and consult with a qualified financial advisor before making investment decisions.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57730444,
    "published": 1770213825000,
    "title": "Bitcoin’s $68K trend line seen as potential BTC price floor: Traders",
    "body": "Bitcoin is approaching its 200-week moving averages, a long-term support zone traders say could help define a potential BTC price floor.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57730976,
    "published": 1770215591000,
    "title": "Tether Scales Back $20B Funding Push After Investor Resistance: Report",
    "body": "Investor pushback on a $500 billion valuation has reportedly prompted Tether to rethink the size of its planned capital raise.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57731606,
    "published": 1770217200000,
    "title": "Crypto VC Funding Doubled in 2025 as RWA Tokenization Took the Lead",
    "body": "Cointelegraph Research provides a data-driven report on crypto VCs, highlighting capital flows, sector rotation and changes in investor behavior.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57731961,
    "published": 1770218520000,
    "title": "Binance is Proof-of-Reserve Champ: Why $MAXI Is The Next Crypto to Explode",
    "body": "What to Know: Binance’s latest Proof-of-Reserves (PoR) confirms 1:1 asset backing, creating the safety baseline required for a broader market risk-on rotation. Smart money is moving from stable infrastructure plays into high-volatility assets, evidenced by aggressive accumulation in new presales. Maxi Doge ($MAXI) combines viral ‘gym-bro’ culture with trading utility, raising over $4.5M. Trust is the ultimate currency in digital assets. And right now, Binance is hoarding it. CoinMarketCap recently released its latest research on top exchanges by proof-of-reserves (PoR), reaffirming Binance as the industry’s leader. The data shows Binance holds user assets at a ratio exceeding 1:1, covering all customer balances across Bitcoin, Ethereum, and major stablecoins. In a market still haunted by the ghosts of 2022 (think FTX and Celsius), this level of on-chain verification isn’t just a compliance box-ticking exercise. It’s the bedrock of market confidence. But the implications of Binance’s solvency go way beyond safety. When the infrastructure layer proves itself robust, capital stops playing defense. It starts seeking offense. Historically, stable exchanges and transparent reserves signal the start of a ‘risk-on’ rotation. Traders, no longer sweating the safety of their deposits, are actively moving liquidity from stablecoins into high-beta assets. You can see this sentiment shift in recent on-chain flows. The market is pivoting from ‘wealth preservation’ to ‘wealth creation.’ The spotlight? It’s turning toward projects embodying high-leverage culture. Leading this charge is Maxi Doge ($MAXI) , a project capitalizing on this renewed appetite for volatility. Maxi Doge Redefines The High-Leverage Trading Culture While the broader market celebrates stability, the retail sector is hungry for the volatility that builds fortunes. Maxi Doge ($MAXI) has emerged not merely as a meme token, but as a cultural standard-bearer for the 1000X leverage mentality. Branded as a 240-lb canine juggernaut that ‘never skips leg day,’ the project taps into the viral ‘gym-bro’ humor that resonates deeply with crypto natives who view trading as a grind. Why does this matter? Frankly, culture drives valuation in the meme sector. But $MAXI distinguishes itself by planning to integrate tangible utility. The project aims to feature holder-only trading competitions with leaderboard rewards, directly incentivizing the high-activity behavior that drives volume. It solves a real problem for retail traders lacking whale capital: providing a gamified environment where conviction and strategy, rather than just wallet size, are rewarded. Plus, the tokenomics look designed to sustain momentum. The ‘Maxi Fund’ treasury ensures liquidity for partnerships, while the staking protocol offers dynamic APY (currently 68%) through daily automatic smart contract distributions. By allocating a 5% pool for staking rewards, the protocol encourages long-term holding. We think it could be one of the next crypto to explode . Long-term holding reduces circulating supply pressure while users chase trading glory. In a market bored by low-volatility utility tokens, $MAXI offers the adrenaline of the trading floor combined with the mechanics of a serious asset. EXPLORE THE MAXI DOGE ECOSYSTEM Tactical Security and the Path to Tier-1 Liquidity Beyond the high-octane branding, Maxi Doge is fortifying its technical infrastructure to prepare for a heavy-hitting 2026. While many meme-based assets struggle with transparency, $MAXI has prioritized institutional-grade validation to ensure the ‘pump’ is backed by a secure foundation. Audited for the Heavy Lift To support the massive volume expected at launch, the project’s smart contracts have undergone rigorous independent audits by SolidProof and Coinsult. These assessments confirm a clean architecture with: No Mint Functions : Ensuring the total supply remains fixed and protected against inflation. No Blacklist Capabilities : Maintaining a decentralized, permissionless environment for all traders. Verified Contract Integrity : Reducing the risk of technical vulnerabilities during high-traffic trading windows. No project is ever risk-free, but with audits like these, you can rest a little easier. Learn ‘ How to Buy Maxi Doge ‘ in our guide. A Roadmap for Market Domination Maxi Doge is moving through a structured execution phase dubbed the ‘Wake Up & Gym’ cycle. With over $4.5M already secured in its presale, the focus is now shifting toward unlocking global liquidity through a two-pronged listing strategy. The roadmap outlines the plan to be listed on both DEXs and CEXs. By securing a presence on major global platforms, $MAXI aims to provide the deep order books and low slippage required for its community to execute high-leverage strategies effectively. This shift from an early-stage ICO to a liquid market asset is designed to bridge the gap between ‘degen’ energy and a professionally managed ecosystem. GET PUMPING GET $MAXI for $0.0002802 This article is for informational purposes only and does not constitute financial advice. Cryptocurrencies are high-risk assets; investors should conduct their own due diligence. The specific dates and whale activity mentioned are based on available data snapshots and may vary by the time of reading.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]