[
  {
    "id": 54950934,
    "published": 1764192704000,
    "title": "New UAE Sweeping Banking Decree Looks to Cement Country’s Global Crypto Position",
    "body": "UAE’s new financial law brings crypto and blockchain into traditional finance and under Central Bank’s supervision.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|UAE|Central Bank|Financial Systems|digital assets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54952211,
    "published": 1764194387000,
    "title": "Why Is Bitcoin Down? Blame Trump, Says Economist Paul Krugman",
    "body": "Bitcoin critic Krugman says it's no coincidence that BTC is down, just as crypto-friendly President Trump stumbles in the polls.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54952491,
    "published": 1764194776000,
    "title": "Conor McGregor calls out Khabib over NFTs, gets shut down by ZachXBT",
    "body": "The former UFC champion tried to launch his own celebrity memecoin, REAL, in April, but the project failed to gain traction.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54954635,
    "published": 1764198052000,
    "title": "Ethereum ICO Whale Sells 20,000 ETH ($58M), Raising Questions Over Market Timing",
    "body": "Ethereum continues to trade below the critical $3,000 level as selling pressure intensifies and fear dominates sentiment across the crypto market. The broader downturn has pushed ETH nearly 40% below its August all-time high, raising concerns that the asset may be entering a prolonged bearish phase. Analysts who were once confident in a continued rally are now shifting their tone, warning that market structure, volatility, and liquidity conditions are beginning to resemble early-stage bear market behavior. Related Reading: Bitcoin Short Squeeze Flushes Out Late Longers as Funding Turns Negative: Classic Capitulation Signal At the same time, investor confidence is being further tested by fresh on-chain activity showing large holders reducing exposure. According to data from Lookonchain, an Ethereum ICO participant has sold another 20,000 ETH, valued at approximately $58.14 million, through FalconX just a few hours ago. With selling pressure accelerating, derivatives sentiment weakening, and long-term holders beginning to reduce positions, Ethereum now sits at a pivotal moment. Bulls must reclaim the $3,000 region to stabilize momentum, while bears argue that a deeper correction could unfold if support continues to erode. ICO Whale Selling Raises Pressure as Ethereum Awaits Direction According to Lookonchain, the wallet behind the latest sale — identified as address 0x2eb0 — is no ordinary holder. This Ethereum OG received 254,908 ETH during the ICO, paying just $79,000 at the time. At today’s prices, that allocation is worth roughly $757 million, highlighting the scale of unrealized gains still held by early participants. The recent sale of 20,000 ETH suggests that even long-standing holders with substantial profit cushions are beginning to offload coins, adding to the already fragile market environment. This selling activity is particularly impactful given the current sentiment. Ethereum has already fallen sharply from its highs, leverage has unwound across derivatives markets, and retail confidence has thinned. When an early participant with a cost basis near zero begins distributing, it sends a psychological signal that further downside is possible. Yet, some analysts argue that these sales may simply represent portfolio rotation rather than a long-term bearish stance. The coming days will be decisive, as investors watch whether Ethereum can stabilize and rebound or if selling pressure accelerates. A recovery above $3,000 could revive optimism and reset momentum, while continued weakness risks confirming a deeper downtrend for both ETH and the broader market. Related Reading: XRP OI Collapses to Lowest Level Since Nov 2024: Binance Data Shows Liquidity Is Fading Breakdown, Weak Structure, and Fragile Bounce Attempt Ethereum’s weekly chart reveals a clear deterioration in trend structure following the sharp rejection from the $4,400 region and the subsequent breakdown below the $3,200 support zone. The selloff pushed ETH toward the mid-$2,700s before a modest rebound, but the price remains below key moving averages, signaling that momentum continues to favor sellers. The 50-week moving average has rolled over, while the 100-week and 200-week moving averages now sit overhead, forming layered resistance that could cap any recovery attempts in the short term. Related Reading: Bitmine Scoops Up Another 28,625 Ethereum ($82.1M) as Market Bleeds – Details Volume during the decline expanded noticeably, indicating active distribution rather than passive drifting. The most recent candle shows a small bounce, but with no strong volume follow-through, suggesting hesitation and lack of conviction among buyers. For Ethereum to regain bullish structure, reclaiming the $3,000–$3,200 area is essential, as this zone acted as a pivotal support throughout earlier phases of the cycle and now threatens to flip into resistance. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ethereum|Ethereum Analysis|Ethereum ICO|Ethereum ICO Whale|ethereum news|Ethereum Whale Activity|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 205,
        "NAME": "TOKEN SALE",
        "CATEGORY": "TOKEN SALE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54957112,
    "published": 1764201639000,
    "title": "Bitcoin Price Breaks Below 50-MA For The First Time This Cycle, Why A Crash To $38,000 Could Be Coming",
    "body": "According to crypto analyst Tony Severino, the Bitcoin price has broken below the 50-week Moving Average (MA) for the first time in the current cycle, triggering renewed fears of a deeper decline. With price momentum weakening and long-term trend indicators flashing bearish warning signals, the possibility of a price crash to $38,000 is becoming hard to ignore. 50-MA Breakdown To Trigger $38,000 Bitcoin Price Crash The Bitcoin price action took a decisive turn this week as the market slipped below the 50 MA for the first time in this four-year cycle. Severino noted in his technical analysis shared on X this Monday that the 50 MA has historically marked the beginning of extended downturns. He stated that following Bitcoin’s launch over 14 years ago, every time it has closed below the 50 MA, a prolonged bear market has followed. Related Reading: Financial Strategist Debunks Prediction That Bitcoin Price Will Reach $220,000 In 45 Days Severino’s price chart highlights BTC’s price performance from 2017 to date. In the past three Bitcoin bear markets, after the price fell below the 50-week MA, BTC continued to drop an additional 61%, 59%, and 67%. On average, the cryptocurrency has lost 62% from the break point. Applying the 62% drawdown to this cycle’s 50 MA level, the analyst predicts Bitcoin could soon experience a price crash to $38,000. From the cryptocurrency’s current price of above $87,000, this represents a staggering 60% decline. Additionally, it would imply a roughly 70% decline from its all-time high of more than $126,000. Severino warns that traders calling for a price bottom may be ignoring how far Bitcoin has historically fallen once this long-term trend fails. He indicated that the 50-week MA has repeatedly served as a dividing line between bullish and bearish phases, and that price slipping below it has more often led to extended periods of weakness and capitulation. Bitcoin Momentum Indicator Falls To Historic Lows A second analysis presented by Severino focuses on Bitcoin’s daily LMACD, which is now near levels not seen in more than 1,250 days. The oscillator has only pushed below this level six times since BTC’s 2017 macro peak. These past instances correspond to periods of heavy downside momentum where the cryptocurrency had yet to complete its bottoming process. Related Reading: One Of The Most Popular Bitcoin Advocates Dumps Millions In BTC, Here’s Why Looking at Severino’s price chart, the extended period without revisiting this lower bound suggests Bitcoin may be overdue for a momentum reset. The LMACD indicator’s current reading is also unusually weak historically, signaling that market momentum has not yet reached extreme pessimism. The readings further indicate that, although BTC remains in a downtrend, price corrections remain possible before a true bottom is established. According to CoinMarketCap data, Bitcoin is trading below $87,000 amid volatile, choppy conditions that have contributed to its 24% decline over the past month. Featured image from Pngtree, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|CoinMarketCap|lmacd|m&a|moving average|Tony Severino",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54958495,
    "published": 1764203670000,
    "title": "Tether Faces Downgrade By S&P Global Amid Concerns Over Disclosure And Assets Holdings",
    "body": "Tether, the entity behind the world’s largest stablecoin by market capitalization, USDT, has experienced a downgrade in its rating by S&P Global. This decision, made public on Wednesday, stems from what the agency describes as “persistent gaps in disclosure” and a growing allocation of “high-risk assets” within Tether’s reserves. The assets highlighted include Bitcoin (BTC), gold, corporate bonds, secured loans, and other investments, all of which entail various risks, including credit, market, interest rate, and foreign exchange vulnerabilities. Tether CEO Responds To S&P Downgrade In a recent research note, S&P Global detailed that this upgrade came as part of a new assessment scale implemented in 2023, ranging from 1 to 5. This scale evaluates the risk associated with different stablecoins. Following the assessment, S&P rated Tether’s USDT stablecoin as “5 (weak),” marking it as the lowest possible score and down from its previous rating of “4 (constrained).” S&P expressed concerns regarding the limited insight Tether provides into the creditworthiness of its custodians and counterparties. Related Reading: Has The Bitcoin Price Hit Its Bottom? Key On-Chain Data Signals Potential Rebound Ahead Despite this, Tether’s CEO, Paolo Ardoino, responded in a social media post on X (formerly Twitter) stating, “We wear your loathing with pride.” He argued that traditional credit rating methods used by agencies like S&P arose from a system that has faltered, leading regulators to challenge these legacy models. Ardoino contended that Tether stands out as a “overcapitalized” organization within the financial sector, claiming it does not harbor “toxic reserves.” He further suggested that S&P’s methods are better suited for conventional banks and insurers with opaque financial histories, rather than being applicable to digital asset issuers who operate under different reserve structures. Ardoino’s remarks indicate a belief that the agency’s downgrade indicates discomfort within traditional finance toward entities like Tether that aim to transcend a “broken financial system.” The firm’s CEO noted: The traditional finance propaganda machine is growing worried when any company tries to defy the force of gravity of the broken financial system. No company should dare to decouple itself from it. Largest Independent Gold Holder In the aftermath of the downgrade, Tether strongly rejected S&P’s characterizations, emphasizing its resilience through various financial crises, including banking collapses, exchange failures, liquidity challenges, and extreme market fluctuations—all while maintaining full stability and the ability to redeem USDT. Tether also pointed to its issuance of approximately $184 billion worth of USDT, assuring stakeholders that it holds sufficient reserves, including US Treasuries and other assets, to satisfy redemptions. Related Reading: Monad (MON) Price Skyrockets 80%, Emerges As Best Performer Among Top 100 Cryptos Notably, recent reports from the Financial Times reveal that Tether has emerged as the largest independent holder of gold globally, highlighting the firm’s increasing exposure to non-traditional reserve assets. According to the report, the stablecoin issuer bought more gold in the last quarter of the year than any central bank in the world. The figures show that the firm bought 26 tons of gold, adding to its substantial gold reserve of nearly 120 tons. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|crypto|crypto market|crypto news|cryptocurrency|S&P Global|Tether (USDT)|Tether CEO|Tether news|Tether reserves|USDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54959478,
    "published": 1764205234000,
    "title": "Ethereum Steadies Near $2,900 as Fed Rate-Cut Odds Fuel $3,400 Rebound Hopes",
    "body": "Ethereum (ETH) is holding firm around the $2,900 level as improving macro sentiment, renewed whale accumulation, and rising ETF inflows strengthen expectations for a short-term rebound toward $3,400. Related Reading: Capriole Founder Not Bearish On Bitcoin Despite Headwinds—Here’s Why With Federal Reserve rate-cut odds now above 80%, traders are positioning for a potential shift in risk appetite that could benefit major cryptocurrencies, especially ETH. ETH's price trends to the downside on the daily chart. Source: ETHUSD on Tradingview Fed Pivot Hopes and Institutional Demand Bolster Ethereum Ethereum has traded between $2,700 and $3,300 in recent weeks, but fresh catalysts are helping the asset stabilize above $2,900. The biggest driver is macroeconomic. CME FedWatch data shows the probability of a December interest-rate cut has surged from 30% to more than 80%. Lower interest rates typically encourage investment in risk-on assets such as crypto. Institutional flows reflect that shift. U.S. spot Ethereum ETFs recorded $96.67 million in inflows on November 24, with BlackRock alone contributing $92.6 million, its first inflow in two weeks Treasury giant BitMine continues to accumulate aggressively, adding 69,822 ETH (over $200 million) last week and bringing its total holdings to 3.63 million ETH, around 3% of the circulating supply. At the same time, whale wallets holding 10,000–100,000 ETH amassed 440,000 ETH in one week, signaling renewed confidence despite broader market caution. Ethereum (ETH) Poised for a Breakout Toward $3,400 Despite trading under the 20-day SMA at $3,132, Ethereum is showing early signs of bullish momentum. The MACD histogram has crossed into positive territory, and the RSI is sitting near the neutral 50 line, with room to move higher before hitting overbought levels. Other indicators strengthen the bullish case: Bollinger Bands: ETH’s position near 0.32 suggests price is closer to the lower band, a common rebound zone. Volume: Binance 24-hour trading volume around $1.27 billion indicates enough liquidity to support a breakout. ATR: With daily ATR at $201.62, volatility remains elevated, favoring sharp upside moves if momentum builds. The first major test remains $3,132. A clean breakout and two consecutive daily closes above this level would likely trigger algorithmic buying and push ETH toward the $3,400 target within 5–7 days. Beyond that, resistance at $3,658 becomes the next upside objective. Market Risks and Short-Term Outlook While bullish momentum is building, Ethereum still trades in a broad descending channel, and market structure remains fragile. Failure to reclaim $3,132 soon could send ETH back toward $2,750, with deeper support at $2,623 and the cycle low of $2,659. Related Reading: The Bull And Bear Scenario For XRP That Could Play Out In November Broader crypto weakness, negative spot flows, or delays in network upgrades could delay a breakout. However, with rising institutional demand, whale accumulation, and rate-cut optimism, Ethereum’s probability of retesting $3,400 is steadily improving. Confidence Level medium is at Medium (65%), as ETH’s path to $3,400 remains viable but requires confirmation through key resistance levels. Cover image from ChatGPT, ETHUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|eth price|ethereum|ethereum price|ethusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54959832,
    "published": 1764205724000,
    "title": "Global Exchanges Urge SEC to Curb Broad Crypto Exemptions, Warn on Tokenized Stock Risks",
    "body": "The SEC is being warned not to let crypto firms bypass investor protection rules as it considers exemptive relief for tokenized stocks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54961953,
    "published": 1764208800000,
    "title": "Major Bitcoin LTH Sell-Off Signals Cycle Exhaustion as Supply Drops to 13.6M BTC",
    "body": "Bitcoin has struggled below the $90,000 level since last week and is now attempting to stabilize as selling pressure continues to shape market sentiment. The sharp downturn from the recent cycle high has left bullish traders on the defensive, with confidence weakening across spot and derivatives markets. Analysts who just weeks ago projected continuation toward new all-time highs are now shifting their tone, with many calling for the beginning of a bear market. Related Reading: Bitcoin Short Squeeze Flushes Out Late Longers as Funding Turns Negative: Classic Capitulation Signal The broader market environment has amplified these concerns. Momentum has flipped downward, liquidity has thinned, and buyers have been unable to reclaim key resistance levels that would signal strength. As Bitcoin searches for support, investors are now watching reactions around the high-$80K region to determine whether this decline is part of a deeper structural reversal or a temporary correction within the larger trend. According to top analyst Axel Adler, Long-Term Holders have played a pivotal role in the current downturn. He reports that this cohort conducted the largest profit-taking event of the entire cycle, reducing positions by 1.57 million BTC over the quarter as prices fell toward $80,000. This scale of distribution historically aligns with exhaustion phases and late-cycle tops, intensifying speculation that Bitcoin may be entering a more prolonged period of weakness. Long-Term Holder Distribution Signals Major Cycle Shift Axel Adler highlights that Long-Term Holders (LTH) are conducting massive profit-taking, pushing supply levels back to early 2023 lows. According to his data, the 30-day Net Position Change now reflects one of the deepest sell-offs seen in the entire bull cycle. LTH supply has fallen sharply from the peak of 15.75 million BTC to the current 13.6 million BTC—marking the lowest reading since the beginning of the cycle. Adler notes that this pattern aligns with a classic smart-money distribution phase often observed near major market tops. Over just the past two weeks (November 11–25), LTH sold 803,399 BTC, representing a drop of 5.54% and averaging 53,560 BTC per day. Historically, such compression in supply has only occurred during major inflection periods. Adler compares the current reading to previous extremes—March 2024, following the $73,000 all-time high sell-off, and October 2024, when Bitcoin corrected from the ATH toward $85,000. The present phase demonstrates aggressive coin dumping, with deeply negative red bars on the Net Position Change while price simultaneously declined from the October peak. This combination of rapid supply reduction and falling price suggests that LTH distribution is exerting meaningful pressure on the market. The data implies that the cycle may be transitioning toward a structurally weaker phase unless new demand re-enters to absorb the sell-side volume. Related Reading: XRP OI Collapses to Lowest Level Since Nov 2024: Binance Data Shows Liquidity Is Fading BTC Attempts Stabilization After Sharp Breakdown Bitcoin’s price action on the daily chart shows a market struggling to regain footing after a steep decline from the $120K region to a recent low near $80K. The current trading level around $86,800 reflects an attempted relief bounce, yet the broader trend remains clearly bearish. Price is positioned below the 50-day, 100-day, and 200-day moving averages, all of which are now sloping downward—a structure that typically signals sustained downside momentum. The rejection from the mid-November breakdown zone reinforces the idea that former support has flipped into resistance. Related Reading: 63K Bitcoin Exits Long-Term Wallets: A Surge of Speculative Short-Term Buying Volume spikes during the selloff indicate forced liquidation and capitulation-driven selling rather than orderly distribution, while the recent bounce has occurred on noticeably lighter volume, suggesting weak conviction from buyers. For bulls, the key focus is whether Bitcoin can build a base above the $85K region to avoid another wave of selling pressure. Losing this level could expose further downside toward $78K and potentially $72K. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|Bitcoin Cycle|Bitcoin LTH Selling|Bitcoin LTHs|Bitcoin news|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54963641,
    "published": 1764211308000,
    "title": "Bitcoin Price Powers Over $90K as Buyers Suddenly Regain Control of the Trend",
    "body": "Bitcoin price started a recovery wave above $90,000. BTC is now consolidating and might soon aim for a move above the $91,500 zone. Bitcoin started a recovery wave and climbed toward $92,000. The price is trading above $90,000 and the 100 hourly Simple moving average. There was a break above a key bearish trend line with resistance at $88,000 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move up if it settles above the $91,500 zone. Bitcoin Price Eyes Steady Gains Bitcoin price managed to stay above the $86,500 level. BTC formed a base and recently started a recovery wave above the $88,000 resistance zone . There was a break above a key bearish trend line with resistance at $88,000 on the hourly chart of the BTC/USD pair. The pair surged above the $90,000 level. There was a clear break above the 61.8% Fib retracement level of the downward move from the $92,872 swing high to the $80,595 low. Bitcoin is now trading above $90,500 and the 100 hourly Simple moving average . It is also above the 76.4% Fib retracement level of the downward move from the $92,872 swing high to the $80,595 low. If the bulls remain in action, the price could face resistance near the $91,500 level. The first key resistance is near the $92,000 level. The next resistance could be $92,500. A close above the $92,500 resistance might send the price further higher. In the stated case, the price could rise and test the $93,750 resistance. Any more gains might send the price toward the $94,500 level. The next barrier for the bulls could be $95,000 and $95,500. Another Decline In BTC? If Bitcoin fails to rise above the $92,000 resistance zone, it could start another decline. Immediate support is near the $89,750 level. The first major support is near the $88,500 level. The next support is now near the $88,000 zone. Any more losses might send the price toward the $86,500 support in the near term. The main support sits at $85,000, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $89,750, followed by $88,000. Major Resistance Levels – $92,000 and $92,500.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54963409,
    "published": 1764210942000,
    "title": "Asia Morning Briefing: Bitcoin's Fragile Rally is Built on Shrinking Liquidity",
    "body": "Large holder deposits have hit exchanges and realized losses are climbing, according to CryptoQuant and Glassnode, indicating the market’s rally is being built on thin liquidity.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|btc|Ether|Liquidity|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54964423,
    "published": 1764212429000,
    "title": "XRP Steps Into Its ETF Moment — Analyst Is Betting On A Rally Bigger Than Bitcoin’s",
    "body": "As the cryptocurrency ecosystem matures and evolves, a new narrative is gaining traction that positions XRP for an upcoming institutional-driven surge that could redefine market expectations. With momentum building around XRP exchange-traded funds, one prominent analyst now believes the asset could be on the verge of a rally so large it may outperform Bitcoin’s own ETF-driven surge. Why Analysts Believe XRP Is Poised For A Larger Upside Than Bitcoin XRP is entering its ETF chapter, and the scale of what’s coming could make Bitcoin look small. Crypto analyst Xfinancebull mentioned on X that early players like Grayscale, Bitwise, Franklin, and Canary Funds are already live with their XRP products. Meanwhile, the real power players like BlackRock, Fidelity, and the other giants haven’t even filed for an XRP spot ETF yet, which shows this is just a warm-up. Related Reading: Here’s Why A Supply Shock Could Be Imminent For XRP The heavyweights haven’t even stepped into the arena, and the initial institutional capital is already flowing. Spot ETFs were highly beneficial for BTC, which triggered a trillion-dollar shockwave that attracted Wall Street institutions and momentum traders who couldn’t ignore the access. According to Xfinancebull, XRP is a different beast, with functional utility, real-world adoption, and banking infrastructure already built out across Japan and Asia. The capital that will soon flood into XRP via ETFs won’t just speculate, but it will stay. When a fraction of over $80 billion in Assets Under Management (AUM) from these initial titans begins to rotate into XRP, the inflows could be significant. This is cold, hard math that is about to unlock high levels of liquidity and historically repeat the move on a larger scale. “The XRP spot ETF ignition is not coming, but it is already here. If you missed the Bitcoin momentum move, don’t miss this one,” Xfinancebull noted. An analyst known as RipBullWinkle has also highlighted that Bitcoin has leaked $151 million, while XRP led all inflows with $164 million. That’s not random, it’s institutions reallocating with intention into assets built for settlement and speed. When powerhouses like Franklin Templeton and Grayscale pull over $130 million into XRP on day one, it confirms where the institutional smart money is going. Market Stabilization Signals The Start Of A New Upward Leg Bitcoin and altcoins are reacting sharply to momentary declines after the brief pullback. TerraHaberTr has stated that BTC has reclaimed the $87,000 level, and if momentum continues at this pace, BTC will target $90,000 and $100,000 levels. On the altcoin side, the recovery is happening even faster, and altcoins that have experienced deep dips may start to gain strength. Related Reading: XRP Price Will Climb Above $10 When This Happens: Analyst Meanwhile, XRP is gaining traction as it pushes back above $2.20. If the move continues, XRP could reach the $3.00 region. Overall, opportunities have continued to emerge across major altcoins. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|altcoins|Assets Under Management|AUM|bitwise|BlackRock|Canary|fidelity|Franklin|Franklin Templeton|grayscale|RipBullWinkle|Ripple|spot Bitcoin ETFs|Spot XRP ETFs|TerraHaberTr|XFinanceBull|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54965602,
    "published": 1764213660000,
    "title": "Crypto Firm With Ties to Trumps Purges CEO Amid Legal Turmoil",
    "body": "A small company tied to a Trump family crypto project announced Wednesday that it dismissed members of its senior leadership following recent disclosures about longer-standing legal problems.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54965501,
    "published": 1764213626000,
    "title": "Nasdaq seeks to ‘super-size’ option limits for BlackRock's Bitcoin ETF",
    "body": "The push from the Nasdaq to increase option limits for the BlackRock Bitcoin fund shows Bitcoin markets are “breaking out of their training wheels.”",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54965214,
    "published": 1764213493000,
    "title": "Ethereum Price Rockets Above $3K Again — Are Bulls Preparing the Next Leg Higher?",
    "body": "Ethereum price started a recovery wave and surged above $3,000 0. ETH might continue to rise if it clears the $3,120 resistance. Ethereum started a recovery wave above $2,950 and $3,000. The price is trading above $3,000 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $2,880 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move up if it settles above the $3,120 zone. Ethereum Price Rallies Over 5% Ethereum price managed to stay above $2,850 and started a recovery wave, like Bitcoin . ETH price was able to climb above the $2,880 and $2,950 levels. The bulls were able to push the price above the 61.8% Fib retracement level of the downward move from the $3,165 swing high to the $2,620 low. More importantly, the price surged above $3,000 . Besides, there is a key bullish trend line forming with support at $2,880 on the hourly chart of ETH/USD. Ethereum price is now trading above $3,000 and the 100-hourly Simple Moving Average. It is also above the 76.4% Fib retracement level of the downward move from the $3,165 swing high to the $2,620 low. If there is another upward move, the price could face resistance near the $3,120 level. The next key resistance is near the $3,150 level. The first major resistance is near the $3,165 level. A clear move above the $3,165 resistance might send the price toward the $3,220 resistance. An upside break above the $3,220 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $3,320 resistance zone or even $3,350 in the near term. Another Decline In ETH? If Ethereum fails to clear the $3,150 resistance, it could start a fresh decline. Initial support on the downside is near the $2,980 level. The first major support sits near the $2,920 zone. A clear move below the $2,920 support might push the price toward the $2,840 support. Any more losses might send the price toward the $2,800 region in the near term. The next key support sits at $2,750 and $2,740. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI – The RSI for ETH/USD is now above the 50 zone. Major Support Level – $2,980 Major Resistance Level – $3,150",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54966314,
    "published": 1764214924000,
    "title": "Animoca bets on altcoin upside to lure investors as it plans for IPO",
    "body": "Animoca Brands’ founder, Yat Siu, anticipates that the crypto industry will not have a one-winner “takes all” scenario like the internet era in the early 2000s.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54966055,
    "published": 1764214665000,
    "title": "SEC tokenized stock exemptions should be targeted, stock exchanges argue",
    "body": "A group representing major stock exchanges has urged the SEC to abandon its plan to grant an “innovation exemption” to brokers and crypto firms seeking to offer tokenized stocks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54966053,
    "published": 1764214594000,
    "title": "Bitcoin risks deeper drop if whale exchange deposits stay high: Analyst",
    "body": "Bitcoin whale deposits to exchanges surged to 9,000 BTC on Nov. 21, with large holders driving 45% of inflows. If it keeps up, Bitcoin could have more to fall.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54967028,
    "published": 1764216002000,
    "title": "XRP Rebounds From Channel Bottom, Analyst Says $2.60 Could Be Next",
    "body": "A cryptocurrency analyst has pointed out how XRP has bounced off the bottom level of a Parallel Channel and could be headed toward its midway line. XRP Recently Found Support At The Lower Line Of A Parallel Channel In a new post on X, analyst Ali Martinez has discussed about a technical analysis (TA) pattern forming in the 3-day price of XRP. The pattern in question is a “Parallel Channel,” appearing whenever an asset’s price consolidates between two parallel trendlines. Related Reading: Capriole Founder Not Bearish On Bitcoin Despite Headwinds—Here’s Why The upper level of the channel provides resistance to the asset, making tops probable at it. Similarly, the lower line can facilitate bottom formations by acting as a source of support. A breakout of either of these bounds can imply a continuation of the trend in that direction. There are a few different types of Parallel Channels, but the one of interest here is the most basic version: a channel that’s parallel to the time-axis. This type corresponds to a phase of true sideways movement in the price. Now, here is the chart shared by Martinez that shows the Parallel Channel that the 3-day price of XRP has been stuck inside for the past year: As is visible in the above graph, XRP witnessed a failed breakout beyond the upper line of the Parallel Channel back in July. This kicked off a phase of downtrend for the cryptocurrency, which culminated in a retest of the channel’s lower line earlier in November. The coin has since observed a rebound, a potential sign that the support level of the Parallel Channel is holding up. The analyst thinks that the cryptocurrency may now be heading toward the midpoint of the pattern, located at $2.60. From the current price of the asset, a rally to this level would mean an increase of almost 20%. It now remains to be seen whether the coin’s surge will continue, or if it will retrace back to the support line again. Related Reading: XRP Jumps 7%, But Watch Out For Speculative Froth Something that could make the latter scenario more likely is profit-taking from the whales. As Martinez has highlighted in another X post, the large XRP holders carrying between 1 million and 10 million tokens participated in distribution during the asset’s latest recovery surge. As displayed in the chart, XRP whales reduced their supply by more than 180 million tokens (worth $391 million at the latest exchange rate) alongside its 17% price rally. This selloff was only a continuation of the trend from earlier in the month, and could be a potential sign that the sentiment among big-money traders hasn’t changed despite the rebound. XRP Price At the time of writing, XRP is floating around $2.17, down 1.5% over the last 24 hours. Featured image from Dall-E, Santiment.net, charts from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|xrp|XRP Parallel Channel|XRP Price|XRP Rebound|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54966831,
    "published": 1764215756000,
    "title": "Korea's Upbit Suspends Deposit And Withdrawal Service After Abnormal Activity in Solana Tokens",
    "body": "Upbit has suspended digital asset withdrawals after detecting irregular activity involving Solana network tokens.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Upbit|South Korea|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54968205,
    "published": 1764217285000,
    "title": "Nasdaq ISE Seeks to Quadruple Trading Limits on BlackRock's Bitcoin ETF Options",
    "body": "The move marks a shift that would bring Bitcoin derivatives in line with major equities and deepen institutional access to the market.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54969995,
    "published": 1764219643000,
    "title": "Dogecoin ETF Debut Fails To Impress, Taking In Only $1.4 Million",
    "body": "According to trading records and company filings, Grayscale’s new spot Dogecoin ETF — ticker GDOG — opened quietly, pulling in just $1.4 million in trading volume on its first day on NYSE Arca. Related Reading: Fear Surges, But Real XRP Holders Aren’t Shaken—Analyst Muted Debut On NYSE Arca Reports have disclosed that the debut fell well short of some public forecasts. Bloomberg analyst Eric Balchunas had suggested the fund might see roughly $10–12 million in opening-day volume, a target that the actual figures did not meet. That gap has drawn quick commentary from traders and analysts, who say the launch exposure was smaller than expected for a high-profile first spot product. Grayscale’s paperwork shows the ETF began life with holdings of about 11 million DOGE and roughly 94,700 shares outstanding, with assets under management reported at roughly $1.7 million at the time the fund started trading. The sponsor set a management fee of 0.35%, but that charge is being waived — the fund will carry a 0% expense ratio either until it reaches $1 billion in assets or for the first three months, whichever happens first. $GDOG (first Doge ETF) saw $1.4m volume on Day One.. solid for an avg launch but low for a ‘first-ever spot’ product. Not too surprising tho, we actually made a rhyme a while ago predicting this: ‘The further away you get from BTC, the less asset there will be.’ pic.twitter.com/ermlOcID1J — Eric Balchunas (@EricBalchunas) November 25, 2025 Market Shifts To Other Altcoins Based on reports from market trackers, other recent altcoin ETFs saw stronger early demand, leaving GDOG’s debut looking muted by comparison. Some XRP and Solana vehicles drew faster inflows during their openings, and that contrast has been used to explain why meme-coin exposure did not attract as much fresh cash on day one. Traders say that where money goes now may reflect a preference for certain tokens over meme-style names in regulated wrappers. What Investors Are Watching Next Observers note a few things to watch: whether the fee waiver helps the fund gather assets in the coming weeks, how DOGE’s market price behaves as more products list, and whether competing Dogecoin ETFs — including a product from Bitwise — change the flows. Related Reading: Bitcoin Creator Somehow Becomes ‘Poor’ By Losing $41 Billion Without Saying A Word Some analysts are watching short term creation and redemption activity and the order books around the ETF to judge real demand versus headline interest. Dogecoin’s spot market showed mild movement after the listing, trading near $0.15 as the ETF opened. That price action suggests traders reacted but did not rush in, and it leaves the question of long-term institutional appetite open. Based on the data so far, GDOG’s quiet first day is a clear signal that listing alone does not guarantee big capital flows. The next few weeks — when the fee waiver is still active and competing listings arrive — will be key to see whether the fund can widen its reach or remain a subdued debut in a busy ETF calendar. Featured image from Gemini, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Dogecoin|altcoins|crypto|doge|GDOG|memecoins|NYSE ARCA",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54970369,
    "published": 1764220137000,
    "title": "Dogecoin (DOGE) Shows Controlled Strength as Traders Eye Key Resistance Above",
    "body": "Dogecoin started a steady increase above $0.150 against the US Dollar. DOGE is now consolidating and might correct lower to $0.1480. DOGE price started a fresh increase above $0.1450 and $0.150. The price is trading above the $0.150 level and the 100-hourly simple moving average. There is a bullish trend line forming with support at $0.1490 on the hourly chart of the DOGE/USD pair (data source from Kraken). The price could aim for a fresh increase if it remains stable above $0.1480. Dogecoin Price Holds Gains Dogecoin price started a fresh increase after it settled above $0.1420, like Bitcoin and Ethereum . DOGE climbed above the $0.150 resistance to enter a positive zone. The bulls were able to push the price above $0.1550. A high was formed at $0.1565 and the price is now consolidating gains above the 23.6% Fib retracement level of the upward move from the $0.1330 swing low to the $0.1565 high. Besides, there is a bullish trend line forming with support at $0.1490 on the hourly chart of the DOGE/USD pair. Dogecoin price is now trading above the $0.150 level and the 100-hourly simple moving average. If there is another increase, immediate resistance on the upside is near the $0.1565 level. The first major resistance for the bulls could be near the $0.160 level. The next major resistance is near the $0.1620 level. A close above the $0.1620 resistance might send the price toward $0.1685. Any more gains might send the price toward $0.1740. The next major stop for the bulls might be $0.180. Another Decline In DOGE? If DOGE’s price fails to climb above the $0.1565 level, it could start a downside correction. Initial support on the downside is near the $0.1510 level. The next major support is near the $0.1480 level and the trend line. The main support sits at $0.1450 and the 50% Fib retracement level of the upward move from the $0.1330 swing low to the $0.1565 high. If there is a downside break below the $0.1450 support, the price could decline further. In the stated case, the price might slide toward the $0.1380 level or even $0.1330 in the near term. Technical Indicators Hourly MACD – The MACD for DOGE/USD is now losing momentum in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for DOGE/USD is now above the 50 level. Major Support Levels – $0.1510 and $0.1480. Major Resistance Levels – $0.1565 and $0.1600.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "DOGE|DOGE news|Doge price|DOGE USD|DOGE/BTC|DOGE/USDT|Dogecoin|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54971034,
    "published": 1764220970000,
    "title": "XRP Prints V-Shaped Recovery as ETF Catalysts Align With Technicals",
    "body": "Technical indicators suggest strong momentum, with XRP trading in an ascending broadening wedge and targeting further gains if it remains above key support levels.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54970982,
    "published": 1764220807000,
    "title": "XRP ETFs absorb 80M tokens: Is a new bull trend starting for the altcoin?",
    "body": "Two new XRP ETFs absorbed 80 million tokens on launch as the price formed a bullish flag after hitting resistance at $2.20.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54971521,
    "published": 1764221640000,
    "title": "DOGE Builds Bullish Structure With Higher Lows as ETFs Fail to Wow",
    "body": "Technical analysis shows DOGE breaking above resistance with a significant volume surge, indicating bullish momentum.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54973557,
    "published": 1764223999000,
    "title": "Buterin donates to 2 projects pushing ‘next steps’ of digital privacy",
    "body": "Ethereum co-founder Vitalik Buterin has just donated over $760,000 in Ether to two projects he says is pushing digital privacy forward.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54972995,
    "published": 1764223257000,
    "title": "Australia moves forward with bill to regulate crypto under finance laws",
    "body": "Australia has taken another step to bring about legislation that will place crypto platforms under the same laws and licensing obligations as financial institutions.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54975594,
    "published": 1764226857000,
    "title": "Will Crypto Explode If Kevin Hassett Takes Over The Fed In 2026?",
    "body": "Kevin Hassett, head of the White House National Economic Council, has suddenly become the market’s base case for the next Fed chair – and crypto investors are already gaming out what a “Hassett Fed” would mean. According to Bloomberg-sourced reporting, Hassett has “emerged as the frontrunner” for President Donald Trump’s choice to lead the Federal Reserve, seen as the candidate most aligned with Trump’s preference for lower interest rates. Earlier disclosures showed Hassett previously served as an adviser to Coinbase and holds at least $1 million in Coinbase stock. How Will Hassett Impact The Crypto Market? For crypto allocators, that combination of macro dovishness and direct exposure to a major US exchange is the core of the bull case. Bitwise senior investment strategist Juan Leon put it bluntly on X: “If Kevin Hassett becomes Fed Chair, the implications for crypto are strongly bullish.” He calls Hassett an “aggressive ‘dove’ who has publicly criticized current rates for being too high and advocated for deeper, faster cuts,” highlighting that he “served on Coinbase’s advisory board and owns large stake in COIN,” and that he “led the White House digital asset working group to shape pro-crypto regulation.” Related Reading: Crypto Has Entered Late-Cycle Territory, Says Global Liquidity Veteran But the potential Hassett regime cannot be separated from Treasury Secretary Scott Bessent’s emerging blueprint for the Fed. Bessent has been openly questioning the post-crisis operating framework. As Walter Bloomberg relayed from his CNBC appearance, “BESSENT ON FED: ‘AMPLE RESERVES REGIME’ MIGHT BE FRAYING.” Forward Guidance host Felix Jauvin summarized the direction of travel in a post: “Bessent wants a fed chair that gets us out of balance sheet shenanigans and simplifying things to how they were pre-ample regime. Dovish FFR, hawkish balance sheet.” He added: “I don’t know if I can emphasize enough just how far away we are from any sort of QE copium.” That framing matters for crypto. A Hassett Fed that cuts the policy rate faster in downturns is one thing; a return to full-blown quantitative easing is another. A “dovish FFR, hawkish balance sheet” mix would still be a friendlier macro environment than the post-2022 tightening cycle, but it is not a guaranteed repeat of the 2020–2021 liquidity wave that lifted every risk asset simultaneously. Rate cuts without large-scale asset purchases support risk appetite and lower discount rates, yet they do not automatically recreate the extreme “everything rally” conditions that many in crypto implicitly associate with Fed dovishness. The political logic behind Hassett’s rise has been described most clearly by macro commentator EndGame Macro (@onechancefreedm). In a thread, he argues that “Hassett isn’t leading because he’s the most academic or the most central bankerish. He’s leading because he checks the boxes Trump actually cares about.” Related Reading: Latest Crypto Crash Wipes $1 Billion Off Trump Family’s Wealth Trump, he writes, wants someone he already trusts, who has “spent years defending Trump publicly,” and who has been “openly critical of the Fed for being too slow, too cautious, and too political.” In that framework, “markets hear dovish. Trump hears I can deliver growth again. And crypto folks hear one of us.” Markets are starting to agree. On Polymarket, contracts tracking the Fed chair race show Hassett around 53% at press time, reinforcing that shift from speculation to probabilistic base case. Whether that translates into a genuine “explosion” in crypto will depend less on personalities than on the interaction of three forces: how aggressively a Hassett Fed actually cuts, how far Bessent is willing to go in shrinking or simplifying the balance sheet, and how markets reassess inflation, term premia and fiscal risk under a more overtly political central bank. The odds market is signaling that crypto is moving closer to the center of US monetary power. The scale of any move in 2026 will be determined by the cycle – and by how a Hassett-led Fed balances “dovish rates” with “hawkish balance sheet” in practice. At press time, the total crypto market cap stood at $2.96 trillion. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto|Crypto market news|crypto news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54977072,
    "published": 1764228808000,
    "title": "Bitcoin Rebounds Past $91K as XRP ETFs Continue to Grab Attention",
    "body": "Total XRP ETF assets crossed $628 million, absorbing nearly 80 million tokens in 24 hours, making for a stronger initial response than Solana’s ETF debut earlier this year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|XRP News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54978941,
    "published": 1764231242000,
    "title": "Best Wallet Token’s $17.6M Presale Ends Tomorrow as It’s Your Last Chance to Join",
    "body": "What to Know: Most crypto wallets remain either centralized with failure points or overly technical, lacking mobile-friendly UX and meaningful user rewards or integrated benefits. Fragmented tooling forces users to juggle separate apps for swaps, staking, tracking and presales, creating friction that slows broader Web3 adoption. Best Wallet Token backs a non-custodial, multi-chain mobile wallet that integrates tracking, swaps, staking and curated presales within a single interface. By tying fee discounts, higher staking yields and presale access to $BEST, Best Wallet Token aims to turn the wallet into a full-stack Web3 opportunity hub. Crypto wallets are no longer just key-storage tools. As more users live on-chain (trading, staking, gaming and joining presales) the wallet has quietly become Web3’s most important interface. Yet most options still force you to juggle multiple apps, sacrifice control, or tolerate clunky UX that scares off newcomers. Centralized wallets can freeze accounts or become single points of failure. On the other hand, many non-custodial wallets feel designed only for power users, with confusing signing flows, limited or no presale access, and few real perks for loyal holders. You’re either giving up sovereignty or leaving obvious value on the table. Best Wallet is positioning itself as a direct answer to that gap: a non-custodial, multi-chain Web3 wallet that bundles tracking, staking, swaps and vetted presales into one mobile-first app. The thesis is simple: if the wallet is where you live, it should also be where you earn, discover and save on fees. The Best Wallet Token ($BEST) presale ends tomorrow, giving a final chance to buy at presale price before listings and heavier marketing kick in. With $17.65M already raised at $0.026005 per token, there’s already strong demand for a wallet that aims to capture 40% of the crypto wallet market share by the end of 2026. Learn more about what is Best Wallet Token. Best Wallet Bundles Web3 Into One Mobile-First Experience Best Wallet Token is backing a non-custodial, no-KYC wallet that aims to be the ‘home screen’ for your entire Web3 life. Instead of bouncing between a swap app, staking dashboard, portfolio tracker and presale platform, you manage everything inside a single, mobile-first interface designed for everyday users, not just DeFi natives. Under the hood, Best Wallet integrates Fireblocks MPC-CMP security, multi-wallet portfolios, and a DEX aggregator powered by Rubic that connects to 50+ chains, 200+ DEXs and 20 cross-chain bridges. For you, that translates to better pricing on swaps, broader asset coverage (60+ chains in the future), and fewer blind spots when moving capital across ecosystems. The standout feature is the Upcoming Tokens portal, which curates the best crypto presales and streamlines presale participation. Instead of chasing links and worrying about fake sites, you can discover vetted opportunities directly inside the wallet and pay with assets you already hold. $BEST Price Potential & Whale Interest Signal Explosive Future On-chain signals are already flashing interest from larger players. Smart money is moving, with one whale buying $16K yesterday and another adding in $13.8K 5 days ago . That kind of conviction ahead of listings often reflects a longer-term view on utility, not just a quick flip narrative around launch. Our $BEST price prediction also estimates large gains in the future, with a 2026 prediction at $0.05106175/token. That’s a 96% from today’s price of $0.026005. The tokenomics also lean into long-term alignment. $BEST holders unlock reduced fees across the Best Wallet ecosystem, higher APY opportunities through the staking aggregator, and priority access to future presales inside the Upcoming Tokens portal. An 8% allocation, or 800M tokens, is reserved for staking rewards, with dynamic proportional yields and immediate staking available during presale. Best Wallet Token is trying to turn the wallet from passive infrastructure into your primary yield and access layer. By combining non-custodial security, multi-chain swaps, tracking, staking and curated presales in one app, it targets both crypto natives looking to consolidate tools and newcomers who want a simpler on-ramp with tangible perks. Here’s how to buy $BEST now. With the presale closing tomorrow and a current raise of $17.65M, the timing window is narrow for those looking to enter at the current valuation. If you believe the next wave of adoption will be won at the wallet layer, $BEST is positioned as a direct bet on that thesis. Join the $BEST presale before it ends tomorrow. This article is for informational purposes only and does not constitute financial, investment, or trading advice; always do your own research. Authored by Elena Bistreanu, NewsBTC – https://www.newsbtc.com/news/best-wallet-token-presale-ends-tomorrow-last-chance-before-listings",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54978922,
    "published": 1764231096000,
    "title": "Abu Dhabi regulator approves Ripple’s RLUSD stablecoin for institutional use",
    "body": "Ripple’s dollar-backed stablecoin secures a major regulatory win as Abu Dhabi allows licensed firms to use RLUSD inside its international financial center.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54980958,
    "published": 1764234016000,
    "title": "Metaplanet In Jeopardy: Bitcoin Needs To Surpass $108,000 By December 18 To Prevent New Crisis",
    "body": "Metaplanet, often dubbed Japan’s MicroStrategy for its adoption of Michael Saylor’s Bitcoin investment strategy, is nearing a critical juncture as Bitcoin (BTC) retraces below 30% of its all-time highs in under a month. Metaplanet Bitcoin Holdings Plummet As of November 26, Metaplanet ranks as the fourth largest public Bitcoin treasury company, holding just over 30,000 BTC valued at approximately $2.7 billion, with an average acquisition cost of around $108,000 per coin. Currently, Bitcoin is trading at approximately $87,700, placing the firm at a nearly 17% loss on its investments. The company finds itself about $640 million underwater, compounded by a steep drop in its stock price, which has plummeted 81% from June highs of ¥1,935 to its current valuation of ¥366 per share on the Tokyo Stock Exchange. Related Reading: Has The Bitcoin Price Hit Its Bottom? Key On-Chain Data Signals Potential Rebound Ahead Recently, Metaplanet borrowed an additional $130 million to bolster its Bitcoin holdings, a decision disclosed in a filing on November 21 under a previously established $500 million credit facility announced in late October. This loan is structured with a floating interest rate that renews daily, allowing for repayment at any point. Importantly, the loan is fully secured by the company’s Bitcoin reserves. However, market expert Shanaka Anslem has raised concerns on social media platform X (formerly Twitter) about the implications of these maneuvers for Metaplanet’s short-term stability. Key Dates Approach Anslem highlighted two pivotal dates that the market should closely monitor: December 18, when the Bank of Japan (BoJ) will decide on interest rates, and December 22, when Metaplanet shareholders will vote on a proposed $135 million fundraising initiative. The outcomes of these events are intertwined. The expert asserts that if the Bank of Japan opts for tighter monetary policy, resulting in a strengthened yen, Bitcoin prices may decline, potentially collapsing Metaplanet’s stock premium and jeopardizing the fundraising vote. Conversely, should the central bank maintain its loose policies, leading to a weakened yen but stable Bitcoin prices, the vote may pass, allowing the company to survive. Related Reading: Monad (MON) Price Skyrockets 80%, Emerges As Best Performer Among Top 100 Cryptos This situation holds significance beyond Metaplanet itself. Japan currently lacks a Bitcoin exchange-traded fund (ETF), making Metaplanet the sole avenue for Japanese investors to gain exposure to Bitcoin via the stock exchange. This factor contributed to a 4,000% increase in the company’s stock value in 2024; however, the price plunged 81% when Bitcoin dropped by 30% over the past month amid rising selling pressure that has prompted fears of a new bear market among investors. Leverage further amplifies the existing risks. For Metaplanet to break even, Bitcoin must reach $108,000. For their investment model to function effectively, however, BTC must surpass $130,000. If Bitcoin falls below $70,000, Metaplanet may have to sell assets to meet collateral requirements. Anslem further noted: For now, Metaplanet stands as neither triumph nor failure but as the most consequential experiment in corporate Bitcoin allocation currently running… The hotel company that bet everything on Bitcoin approaches its moment of truth. The world should be watching. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin Metaplanet|Bitcoin news|bitcoin price|btc|BTC news|btc price|BTCUSDT|crypto|Metaplanet|Metaplanet holdings|Metaplanet news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54980688,
    "published": 1764233530000,
    "title": "Upbit hit with $36M Solana hot wallet breach day after $10B Naver deal",
    "body": "The breach occurred as Upbit’s parent company, Dunamu, sealed a $10 billion acquisition deal with Naver and plans an initial public offering in the US.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54983038,
    "published": 1764236819000,
    "title": "Cathie Wood says ARK’s Bitcoin $1.5M bull price hasn’t changed as markets eye rally",
    "body": "ARK Invest expects another $300 billion in liquidity to return after the government shutdown, a development that may alleviate the “liquidity squeeze” affecting crypto and AI valuations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54983548,
    "published": 1764237620000,
    "title": "Bitcoin’s New ‘Line In The Sand’ May Be $82,000, Not $56,000: Analyst",
    "body": "An analyst has explained how Bitcoin’s bottom in the current cycle may not follow the same pattern as historical bear markets. Bitcoin Could Bottom Around True Mean Price Instead This Time In a new post on X, Checkonchain co-founder Alec Dejanovic has talked about a couple of pricing models related to Bitcoin. The first of these is the “Realized Price,” keeping track of the cost basis of the average investor on the BTC network. Related Reading: XRP Rebounds From Channel Bottom, Analyst Says $2.60 Could Be Next When the BTC spot price is trading above this level, it means that the network as a whole is in a state of net unrealized profit. On the other hand, the asset being under the metric suggests that the average token is being held at some loss. This indicator has displayed an interesting relationship with the cryptocurrency in the past. “Historical Bitcoin bears usually bottom around the Realised Price level,” explained Dejanovic. Below is the chart shared by the analyst that shows this effect in action. As is visible in the graph, the 2015, 2018, and 2022 bear markets all found their bottoms when the Bitcoin spot price plunged under the Realized Price. Even the COVID crash in 2020 bottomed out below the indicator. The explanation behind this pattern could lie in the fact that below this line, the majority of the network can be considered underwater, so there wouldn’t be many profit-takers left. In these conditions, resolute entities take coins off investors capitulating at a loss and selling pressure slowly reaches exhaustion, allowing BTC to regain its footing. Today, the Realized Price is situated at $56,000. Considering the past pattern, perhaps this cycle’s bear market would also bottom out around or below this level. Dejanovic thinks things can go differently this time, however, saying, “with ETF flows remaining resilient and no FTX-style fraud in sight, that target feels excessive.” If not Realized Price, then where else could Bitcoin find its bottom? The answer may be the second price model listed in the chart: the True Mean Price. This metric functions similarly to the Realized Price, except for the fact that it represents the cost basis of just the active market participants, not the entire network. A chunk of the Bitcoin supply has become lost due to associated wallets no longer being accessible. As BTC is growing older, this supply is only increasing in size, making the Realized Price a somewhat inaccurate representation of the real network situation. Related Reading: Capriole Founder Not Bearish On Bitcoin Despite Headwinds—Here’s Why By focusing on only the active part of the supply, the True Mean Price sidesteps this issue. Its value is currently $82,000, which is around where BTC found its recent low. “This could be the new line in the sand we are hammering out,” noted the analyst. BTC Price Bitcoin has shown a sharp jump during the past day that has taken its price back above $90,000. Featured image from Dall-E, checkonchain.com, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin Realized Price|Bitcoin True Market Mean|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54984043,
    "published": 1764238289000,
    "title": "Ripple’s RLUSD Stablecoin Wins Key Regulatory Green Light in UAE",
    "body": "The designation means licensed firms can use the dollar-pegged token for regulated activities, placing it into a small group of tokens permitted by the ADGM’s ring-fenced financial system.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Ripple|Rlusd|Stablecoins|Abu Dhabi|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54984871,
    "published": 1764239441000,
    "title": "Ark Invest Buys $16.5M of Coinbase Stock, Largest Purchase Since Aug. 1",
    "body": "COIN closed at $264.97, 4.27% higher on the day, accompanying a relative recovery in the crypto market, which saw bitcoin gain over 3.3% to reclaim $90,000.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|ARK Invest|Coinbase|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54984374,
    "published": 1764238753000,
    "title": "Cardano Recovery Signals Risk On As Traders Eye Best Wallet Token Presale",
    "body": "What to Know: Cardano’s 6% open interest jump as $ADA eyes a $0.50 retest points to leveraged traders positioning for continuation, not a fleeting relief rally. As DeFi and real‑world use cases expand on Cardano and beyond, non‑custodial, multi‑chain wallets are becoming critical infrastructure rather than optional add‑ons. Many legacy wallets remain either centralized with single points of failure or too clunky on mobile, leaving a gap for secure, feature‑rich, user‑friendly alternatives. Best Wallet Presale targets 40% of the wallet market by 2026, merging Fireblocks MPC‑CMP security, multi‑wallet portfolios and mobile‑first UX into a single $BEST‑powered ecosystem. Cardano’s latest bounce is starting to look like more than a relief rally. Derivatives data shows $ADA open interest jumping roughly 6% as price circles a potential retest of the $0.50 area , a level that rejected bulls earlier in the year and now acts as a clear psychological and technical barrier for traders. When open interest rises into resistance like this, it usually means leveraged money is stepping in, not just casual spot buyers averaging in. That tilt toward futures exposure tends to signal traders are positioning for continuation rather than a dead cat bounce, especially when liquidations stay controlled and funding doesn’t spike into obvious froth. Under the hood, Cardano’s DeFi and real‑world use cases have quietly expanded, giving this move some fundamental backing. TVL has climbed from cycle lows , stablecoin activity is more diversified, and on‑chain volume isn’t being driven purely by speculative memecoins. If you’re looking for the best crypto to buy now , $ADA’s mix of rising OI, key resistance overhead and improving on‑chain metrics keeps it firmly on the watchlist. But that broader ‘risk‑on’ shift is also pushing capital further out the curve into infrastructure plays and presales. Wallet infrastructure in particular looks primed for a re‑rating as users demand safer self‑custody, better presale access and cheaper cross‑chain execution. And that’s the backdrop where projects like Best Wallet and its Best Wallet Token ($BEST) utility token are starting to attract more serious attention from investors already leaning bullish on higher‑beta crypto exposure. Read more about $BEST in our guide. How Cardano’s Risk-On Shift Is Reshaping Wallet Demand A market where $ADA can credibly threaten a sustained break above $0.50 is a market where users are once again rotating into higher‑beta altcoins, NFTs, on‑chain games and complex DeFi positions. That activity doesn’t just lift prices; it dramatically increases the demand for non‑custodial wallets that can handle dozens of chains and asset types without forcing users into centralized chokepoints. The problem is that many of the incumbent wallets were designed for a simpler era. Centralized or semi‑custodial designs create single points of failure and regulatory risk, while some of the more trust‑minimized options still feel clunky on mobile. If you’ve ever tried to manage multiple DeFi portfolios, presales and cross‑chain swaps from your phone, you’ve probably felt those UX and security trade‑offs firsthand. That’s why the next wave of wallet competition is moving beyond ‘basic key storage’ into full‑stack execution layers: integrated DEX aggregation, curated presales, staking dashboards and chain‑agnostic portfolios. One of these solutions is making the rounds now – Best Wallet positions $BEST as one more option in this emerging class, but with a thesis built around deeply integrated security tech and a mobile‑first design. Why Best Wallet Token Is Drawing Risk-On Capital Where Best Wallet differentiates itself is the attempt to bundle institutional‑grade security with retail‑level accessibility. The project is building what it calls the first fully integrated Fireblocks MPC‑CMP wallet in a consumer app, combining multi‑party computation for key management with custom multi‑wallet portfolios. In plain English, that means you retain self‑custody while dramatically reducing single‑key compromise risk across every asset you hold. On top of that security stack, the wallet plans to embed an ‘Upcoming Tokens’ portal, giving users a simplified flow to access crypto presales without hopping between websites, spreadsheets and Telegram groups. For a market already hunting for ‘the next ADA’ every time open interest spikes, that kind of curated deal flow directly inside a wallet could become a compelling value add if the screening standards hold up. Execution is equally important. Best Wallet’s DEX aggregator, powered by Rubic, targets more than 50 chains, 300+ DEXs and 30 cross‑chain bridges from a single interface, with a mobile‑first UX designed to feel familiar even if you’re not a DeFi power user. That multi‑chain reach combined with non‑custodial, no‑KYC access aims to serve both advanced traders rotating between Cardano, Ethereum and emerging ecosystems, and newcomers who just want cheaper swaps and fewer failed transactions. Underneath it all sits the Best Wallet Token ($BEST) , which fuels a set of incentives inside the ecosystem. The presale has already raised $17.64M at a token price of $0.026005, and smart money is also paying attention: whale tracker data reveals 2 significant purchases totaling $29.8K, with the largest transaction of $16K happening just yesterday . Plus, our $BEST price prediction estimates a potential increase of 97% by the end of 2026 from the current price of $0.026005. For traders already leaning risk‑on thanks to Cardano’s recovery, that mix of security features, presale upside and yield mechanics makes $BEST an increasingly visible candidate for the next wave of wallet‑centric narratives. Buy $BEST in 5 simple steps before the presale ends. This article is for informational purposes only and does not constitute financial, investment, or trading advice; always do your own research. Authored by Aaron Walker, NewsBTC – https://www.newsbtc.com/news/cardano-recovery-best-wallet-token-presale-risk-on",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54985083,
    "published": 1764236819000,
    "title": "Cathie Wood says ARK’s $1.5M Bitcoin bull price hasn’t changed as markets eye rally",
    "body": "ARK Invest expects another $300 billion in liquidity to return after the government shutdown, a development that may alleviate the “liquidity squeeze” affecting crypto and AI valuations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54986175,
    "published": 1764241243000,
    "title": "Ethereum’s End-Of-Year Rally Still At Play? Analysts Eye 50% December Jump",
    "body": "Ethereum (ETH) is attempting to bounce from the market’s Q4 correction, retesting the $3,000 barrier once again. As we approach the end of November, some market observers have suggested that the end-of-year rally may still be possible in the coming weeks. Related Reading: XRP ETFs Outshine BTC, ETH, And SOL Funds With $164M Single-Day Inflows Ethereum Eyes $3,000 Ahead Of Key Upgrade On Wednesday, Ethereum experienced a 4.4% daily surge, retesting the $3,000 level for the first time in nearly a week. The cryptocurrency has been trading within the $2,680-$2,980 price range amid the latest market-wide correction, which also saw Bitcoin (BTC) lose some crucial support levels. At the start of the week, the King of Altcoins broke above the $2,900 area, attempting to retest the next key resistance over the past two days but ultimately failing to reclaim it. Analyst Ted Pillows highlighted this performance, noting that ETH “tapped the $2,950-$3,000 zone again and got rejected.” Per the post, until Ethereum successfully reclaims this level, “the chances of a new low are high.” On the contrary, if the cryptocurrency breaks above this zone with strong volume in the coming days, investors could “expect a rally towards the $3,400 level.” The analyst also suggested that the altcoin could see a remarkable recovery rally next week, driven by the upcoming Fusaka upgrade. As he explained, ETH soared around 50% after the network’s Pectra upgrade in May. As reported by NewsBTC, the upgrade introduced a series of improvements to increase transaction capacity, enhance efficiency, and reduce system stress. Following the implementation, the cryptocurrency rallied from the $1,800 level to the $2,700 area in a week, which was later followed by an 80% jump in Q3 to its latest all-time high (ATH) of $4,946. Now, the Fusaka upgrade is the network’s biggest update since The Merge and is expected to come on December 3, “to relieve one of the network’s most pressing bottlenecks: data availability for rollups,” VanEck explained in October. Based on this, Ted Pillows suggested that if ETH repeats its post-Pectra performance with the new upgrade, the altcoin’s price could soar above the $4,000 resistance in the next few weeks. End-Of-Year Rally Underway? Market watcher Merlijn The Trader also suggested that Ethereum could see another leg up soon, as it is “repeating a textbook wave structure” it has printed multiple times since hitting the bear market bottom in mid-2022. “Wave 1: Kicked off the cycle. Wave 2: Is shaking weak hands. wave 3: Where parabolas form,” the trader explained on X, noting that ETH could be ending its corrective move and potentially see another rally in the coming weeks. “This pattern printed 3 times before. Each time, ETH went vertical. Now it’s flashing again,” he stated. Similarly, Michaël van de Poppe highlighted Ethereum’s trading pair against Bitcoin, affirming that investors should keep an eye on the chart. Notably, ETH is retesting a multi-month downtrend line resistance against BTC, and could “see a strong breakout upwards in the coming weeks.” “This cycle is far from over,” van de Poppe added. Related Reading: Bitcoin’s November Crash To Continue If This Level Isn’t Reclaimed, Analyst Warns Meanwhile, Rekt Capital noted that Ethereum Dominance continues to occupy an area that served as a consolidation zone before the 2021 rally. “As long as ETHDOM can maintain itself above 10.05% then it should be positioned for higher market dominance levels over time,” the analyst concluded. As of this writing, ETH trades at $3,023, a 2% increase in the weekly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto analyst|crypto market bull run 2025|crypto market correction|Crypto trader|ETH|ethbtc|ETHDOM|ethereum|Ethereum ATH|Ethereum Breakout|Ethereum dominance|ethereum price|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54986173,
    "published": 1764241238000,
    "title": "Bitcoin Price Climbs Back To $91,000: Is The Decline Over? Key Levels To Watch",
    "body": "The Bitcoin price appears to be entering a new recovery phase, as the leading cryptocurrency recaptured the $91,000 level after falling by more than 30% from all-time highs last Friday, tumbling to an 8-month low of $80,000. Critical Bitcoin Price Range Technical analyst Daan Crypto Trades highlighted on social media site X (formerly Twitter) on Wednesday that the critical region for investors to monitor right now is between the $89,000 and $91,000 range. He observed that this price level acted as support in late 2024 and early 2025 before becoming a point of resistance during President Donald Trump’s recent tariff negotiations with the world’s top economies, including China. Related Reading: Has The Bitcoin Price Hit Its Bottom? Key On-Chain Data Signals Potential Rebound Ahead After breaking out of this zone almost exactly one year ago, the Bitcoin price reached new highs of $109,000 in January, which held until a new uptrend in May of this year resulted in BTC reaching $112,000. Daan emphasizes that a strong consolidation above these levels could pave the way for a rally toward the $106,000 to $108,000 range. Conversely, if Bitcoin falls back below these levels, it could revisit last week’s low of $80,000, which he identifies as the nearest support. Bullish Sentiments Amid Caution Another analyst, BitcoinVector, echoed Daan’s bullish sentiment but cautioned that the market remains in a high-risk environment and that the current momentum has yet to strengthen significantly. According to BitcoinVector, steady momentum is required for Bitcoin to break out of the compression pattern that has formed since its all-time high. He laid out the bullish path: first, the Bitcoin price must close within the $89,000 to $90,000 zone, followed by consolidation above this area, and finally, a breakout through the $93,500 to $95,000 compression band. For this recovery to gain traction, BitcoinVector stressed the importance of a “Risk-Off Signal,” indicating that buyers must begin to overpower sellers while generating momentum. Without such momentum, each upward movement would merely be a tactical reaction rather than indicative of a structural recovery. Prolonged Bear Market Ahead? Market analyst Skew provided additional insights, noting that the four-hour chart for Bitcoin appears more constructive for bulls. He pointed to several indicators suggesting upward momentum, including the price being above the four-hour 50 EMA, the RSI remaining above 50, and the Stochastic RSI trending higher. Skew identifies the $88,000 mark as a crucial “line in the sand,” arguing that a drop below this level would signal weakness and a failed attempt to gain momentum. Related Reading: Tether Faces Downgrade By S&P Global Amid Concerns Over Disclosure And Assets Holdings Despite the cautious optimism from some analysts, others, like Jacob King, offer a starkly different perspective. He argues that given the Bitcoin price decline from its all-time high in October, it has never experienced such a fall followed by a sustained bull market. According to King, Bitcoin is now in a bear market that may persist for years, poised to affect the fortunes of countless investors, particularly those heavily leveraged. As of this writing, the Bitcoin price stands at $91,390, marking a 4% recovery within the last 24 hours. This places the cryptocurrency 27% below its all-time high. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|Bitcoin price analysis|Bitcoin Price Forecast|bitcoin price news|bitcoin technical analysis|btc|BTC news|BTCUSDT|crypto|crypto market|crypto news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54986610,
    "published": 1764241795000,
    "title": "'Improving Risk Sentiment' Driving Bitcoin's $90K Retest: QCP",
    "body": "Analysts remain cautiously optimistic, with Bitcoin reclaiming $90K as the chances of a December rate cut hit 85%.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54987387,
    "published": 1764243000000,
    "title": "Crypto Markets Today: Bitcoin Leads Broad Recovery as Traders Eye Possible Santa Rally",
    "body": "Bitcoin and ether surged following Wednesday's tech-led equities rebound, while derivatives flows signal growing optimism for a year-end push.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|Derivatives|Markets|market analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54987297,
    "published": 1764242578000,
    "title": "Europe’s new chat police: Chat Control legislation nudges forward in the EU",
    "body": "EU governments agree to push forward with child sexual abuse “Chat Control” rules, but the compromise keeps voluntary scanning alive, leaving privacy advocates fuming.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 54988018,
    "published": 1764243924000,
    "title": "Next Crypto To Explode As Strategy Proves Bitcoin Reserves Can Easily Cover Its Debt",
    "body": "What to Know: Strategy’s new ‘Bitcoin Rating’ shows its $BTC stack covers convertible debt by about 5.9x at its average entry and would stay near 2x even in a deep crash, underlining how levered it is to long-term $BTC upside. Despite that cushion, institutions are bailing on the stock and moving into spot Bitcoin ETFs instead, leaving Strategy out of the S&P 500 and trading below the value of its own $BTC holdings. Bitcoin Hyper’s presale is building an SVM-based Bitcoin Layer 2 with near-instant, low-fee smart contracts and DeFi that settles back to Bitcoin, giving $BTC holders a scaling and yield angle instead of just spot exposure. PEPENODE’s presale pushes a mine-to-earn meme model where you buy virtual nodes, build a digital mining rig, and earn $PEPENODE plus other meme coins, with node upgrades and token burns tying demand to in-game activity. Corporate Bitcoin strategy hits differently when it’s backed by hard numbers instead of doompost threads. A 5.9x asset‑to‑debt ratio at the average $BTC cost basis, and even 2x coverage if Bitcoin nukes to $25K, is exactly the kind of balance‑sheet resilience big money cares about. When the top asset on corporate books still comfortably covers obligations after a deep crash, the signal isn’t ‘risk off’ – it’s that Bitcoin has matured into collateral that institutions actually trust. That trust doesn’t just sit in cold wallets; it becomes the backdrop for the next wave of risk‑on bets. Historically, when the market accepts Bitcoin as sound collateral, the next move is usually into high‑beta plays that can ride the same long‑term conviction with far larger upside. That’s where presales, aggressive Layer 2s, and high‑throughput chains tend to explode, turning $BTC strength into altcoin momentum. Below are three projects positioned to benefit from this environment – led by Bitcoin Hyper ($HYPER) , a Bitcoin Layer 2 trying to do for $BTC what high‑performance chains did for DeFi elsewhere, alongside Solana‑style execution and Tron’s stablecoin machine. 1. Bitcoin Hyper ($HYPER): SVM Speed On A Bitcoin Layer 2 Bitcoin Hyper pitches itself as ‘the fastest Bitcoin Layer 2 Chain’ with integrated Solana Virtual Machine (SVM), aiming to deliver faster performance than Solana itself while anchoring to Bitcoin for settlement. The idea is simple: keep Bitcoin as the base layer of trust, outsource speed and programmability to a purpose‑built Layer 2. Under the hood, Bitcoin Hyper uses a modular design: Bitcoin L1 for settlement and a real‑time SVM Layer 2 for high‑throughput execution. A single trusted sequencer batches transactions and periodically anchors state back to Bitcoin, enabling sub‑second confirmation at low cost instead of waiting for slow on‑chain $BTC finality and paying full L1 fees. This architecture attacks Bitcoin’s three core limitations at once: slow transactions, high fees, and lack of native smart contracts. On Bitcoin Hyper, you get extremely low‑latency processing, SVM‑based smart contracts, and SPL‑compatible tokens adapted for the L2. That opens the door to wrapped $BTC payments, AMMs, lending markets, staking protocols, NFTs, and gaming dApps built in Rust with SDKs and APIs developers already know. Here’s how to buy $HYPER before the presale ends tomorrow. The presale has raised $28.58M, with tokens at $0.013335, and staking is set at 40%, so there are long-term gains to be made alongside price appreciation. Join the $HYPER presale today. 2. PEPENODE ($PEPENODE): Mine-To-Earn Meme With Node Economics If Bitcoin Hyper is the infrastructure bet, PEPENODE ($PEPENODE) is the speculative meme play wrapped in a pseudo‑mining economy. Branded as the world’s first mine-to-earn memecoin, it swaps hash rate and ASICs for a virtual mining system where users deploy ‘nodes’ through a gamified dashboard to earn token emissions. Instead of proof‑of‑work, PEPENODE uses tiered node rewards to simulate miner economics. Higher‑tier nodes are designed to capture larger slices of emissions, encouraging early participation and laddering up through the system. Eventually, you’ll be able to receive rewards on popular meme coins like Fartcoin and Pepe. It’s a familiar pattern from DeFi node projects, but re‑skinned for meme traders who want something more interactive than simply buying and waiting. Despite the playful branding, there’s real capital flowing in. The PEPENODE presale has raised $2.2M with tokens at $0.0011685, putting it firmly in micro‑cap territory where order‑book depth will matter but upside can be violent if the narrative catches a bid. Our PEPENODE price prediction puts a potential 2026 price at $0.0071, which is a 508% increase from the current price. Staking isn’t specified yet, so yield for now is focused on the virtual mining mechanics and node tiers. In a market where Bitcoin is proving itself as a durable treasury asset, memes like PEPENODE sit at the opposite end of the risk curve: pure beta with a gamified wrapper. If you’re looking for exposure that can move multiples faster than $BTC on narrative alone, the mine‑to‑earn angle aims directly at that demand. Join the PEPENODE presale now. 3. Tron (TRX): Stablecoin Workhorse With Massive USDT Flows Tron (TRX) remains one of the purest expressions of ‘blockchain as payments rail’ in the market. It’s a high‑throughput network designed for fast, low‑cost transactions and dApp deployment, but its real edge today is stablecoins: Tron has become a major hub for $USDT transfers across exchanges and payment platforms. With high TPS and tiny fees, Tron quietly turned into the default settlement layer for a big chunk of crypto’s dollar liquidity. Recently, it even surpassed Ethereum in total circulating $USDT, reaching about $73.8B, underscoring how much real transactional flow now prefers Tron’s cost structure over more expensive chains for day‑to‑day movement. That stablecoin gravity feeds into a growing DeFi and cross‑chain ecosystem, where users can tap lending, swaps, and yield strategies without abandoning the payment rails they already use. In a market where Bitcoin is the collateral anchor, Tron offers exposure to the transactional layer of crypto dollars. And the token is showing signs of recovery from the recent market dump, with a 1% increase in the last day. You can get Tron from Binance. Recap: When corporate treasuries show Bitcoin reserves still comfortably covering debt even in a deep crash, it sets the stage for high‑beta plays. Bitcoin Hyper ($HYPER) and PEPENODE ($PEPENODE) stand out as the most direct bets in the current market. This content is for educational and informational purposes only and does not constitute financial, investment, or trading advice. Authored by Aaron Walker, NewsBTC – https://www.newsbtc.com/next-crypto-to-explode-strategy-proves-bitcoin-reserve-covers-debts",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54988013,
    "published": 1764243865000,
    "title": "Australia’s New Digital Assets Bill Seeks to Prevent Past Crypto Failures",
    "body": "The Australian government introduced digital assets legislation to modernize its financial system and safeguard consumers.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Australia|Financial Systems|crypto legislation|Cryptocurrency Regulations|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54988626,
    "published": 1764244809000,
    "title": "Analyst Says Get Ready For XRP Price Above $4 This Cycle",
    "body": "Despite the XRP price struggling to stay afloat in the current market, it has not deterred the bulls from continuing to push for higher prices. This is amid the XRP ETF launches that have taken place over the last week, X triggering a significant amount of inflow into the cryptocurrency. The calls for new all-time high prices to surpass its 2018 $3.84 peak have only grown louder, with timelines getting shorter. This time around, one analyst has predicted a new all-time high, with what they call a “true Elliot Wave view.” Why XRP Price Could Still Gun Above $4 In an analysis shared on X with over 35,000 followers, crypto analyst XForce Global has put forward the idea that the Elliot Wave Theory has not completely played out for the XRP price. So far, the belief has been that the XRP price has completed the last and final wave and could be headed into a bear market. However, the crypto analyst doesn’t believe this is the case. Related Reading: XRP Price Will Climb Above $10 When This Happens: Analyst XForce Global points to the fact that analysts who use the Elliot Wave theory could struggle with the chart they shared. But this chart apparently removes all of the market inefficiencies, allowing the XRP price to be viewed through a clear lens. The analysis suggests that the altcoin could see a bullish continuation, running a flat route upward after hitting support above $1.87. Such a surge would put the XRP price on the path above $4, with the digital asset possibly topping above $5. In the event that the price does crash further than the current local lows, the analyst believes that an expanded flat route beginning above $1.6 would still trigger a similar outcome. Both rallies are expected to push the XRP price above $4 and then top toward $6. Major Factor To Drive Price Explosion One major factor that analysts have put forward to drive an XRP price explosion is the launch of XRP ETFs. With more than 3 XRP ETFs now trading in the US, analyst Chad Steingraber has outlined how their launch could affect the altcoin’s price. Related Reading: Financial Strategist Debunks Prediction That Bitcoin Price Will Reach $220,000 In 45 Days Steingraber explained that, so far, the XRP price had been seeing some uptick during ETF trading hours, and then declining during off-hours. This is building pressure and momentum, and is expected to accumulate over time. The result of this is supposed to be a major price explosion in the next few months, possibly pushing XRP to new peaks. Featured image from Dall.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|analyst|crypto|crypto analyst|crypto news|Ripple|ripple news|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54988733,
    "published": 1764244795000,
    "title": "Ethereum raises block gas limit to 60M as network capacity climbs ahead of Fusaka",
    "body": "Ethereum co-founder Vitalik Buterin expects growth to continue next year, but with smarter adjustments that expand capacity without new bottlenecks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54989893,
    "published": 1764246683000,
    "title": "Best Crypto Presales to Buy as Top Trader Eyes 25% Solana Recovery And Risk On Rotation",
    "body": "What to Know: Bitcoin Hyper utilizes a modular Bitcoin-settlement plus SVM-execution design to integrate high-speed, low-fee smart contracts directly into the Bitcoin ecosystem. $HYPER’s presale and whale activity signal growing conviction in Bitcoin Layer 2 narratives as traders rotate back into risk assets. SUBBD targets the $85B creator economy by merging AI tools, token‑gated content, and crypto payments with 20% first‑year staking. LiquidChain’s Layer-3 architecture aims to unify BTC, ETH, and SOL liquidity, positioning LIQUID as a longer-term cross-chain DeFi infrastructure bet. A top trader calling for a 25% Solana rebound is exactly the kind of spark that can flip the market from defensive to risk-on in a heartbeat. When majors like SOL, BTC, and ETH stop leaking and start grinding higher, traders suddenly remember that upside volatility hits just as hard as the downside. Historically, the script has never changed. Once the large caps stabilize and push up, liquidity rotates into higher-beta plays, the small caps, narrative tokens, and presales, where a 2x is considered the warm-up, not the victory lap. Majors lead the move, but the real fireworks usually happen lower down the risk curve. That’s why presales matter in this setup. You still get the tailwind of improving macro and stronger majors, but you’re positioning before CEX listings, before full marketing cycles, and before retail FOMO starts tripping over itself. Instead of hoping Solana delivers a clean 25%, you’re looking at projects building the next wave of DeFi, Bitcoin scaling, infra, and cross-chain liquidity. Below are three presale-stage projects aligned with exactly that rotation: Bitcoin Hyper ($HYPER) — bringing SVM-style speed and parallel execution to Bitcoin SUBBD ($SUBBD) — where AI creator tools and Web3 payments collide LiquidChain (LIQUID) — a unified liquidity layer spanning Bitcoin, Ethereum, and Solana 1. Bitcoin Hyper ($HYPER) — First Bitcoin Layer-2 With SVM Speed If Solana really does lead the next risk-on bounce, the obvious second-order trade is throughput pressure on the chains it competes with, and none feels that more than Bitcoin. Bitcoin Hyper positions itself as the first Bitcoin Layer-2 to integrate the Solana Virtual Machine, targeting execution speeds that can rival, and potentially surpass, Solana’s own performance. Instead of trying to contort Bitcoin into a full smart-contract environment at L1, Bitcoin Hyper takes the modular route: Bitcoin for settlement, SVM for real-time execution. The result is sub-second finality, ultra-low latency, and high-speed transactions for wrapped BTC — all without compromising the base layer’s security guarantees. On the application side, $HYPER unlocks everything Bitcoin can’t natively support today: Full DeFi rails including swaps, lending, and staking High-throughput NFT marketplaces Gaming dApps and on-chain assets All of this runs on an SVM environment with Rust-based SDKs and APIs. SPL-compatible tokens can be deployed directly to the L2, giving Solana builders a familiar toolchain while tapping into deep Bitcoin liquidity. Presale momentum reinforces the narrative. The Bitcoin Hyper presale has raised over $28.5M, with tokens priced at $0.013335, placing it in late-stage, high-conviction territory rather than the usual micro-cap experiment. Smart money has noticed too: two high-net-worth wallets accumulated $396K in recent weeks, including a single $53K buy, a move that lines up with our own Bitcoin Hyper price prediction , which forecasts a potential 2030 high of around $0.253, roughly a 22x jump from current presale levels. The token design leans into long-term alignment, with staking rewards currently sitting at 40%, a short seven-day vesting period for presale stakers, and a reward structure built to encourage real network participation rather than pure emissions farming. For traders rotating part of their BTC exposure into Bitcoin-secured yield and high-beta infrastructure plays, the $HYPER presale is a clean, asymmetric bet on the next phase of Bitcoin scaling. 2. SUBBD ($SUBBD) — AI + Web3 Rail for the Creator Economy While traders obsess over Solana’s order books, another macro trend has been ripping completely on its own timeline: AI-powered content creation. SUBBD is going straight after the $85 billion creator economy with a Web3 + AI stack built to give creators more control, fewer fees, and a native way to monetize without feeding Web2 intermediaries. At its core, SUBBD is an AI-driven content creation and distribution platform. Creators can launch AI Personal Assistants to handle fan interactions, generate AI voice clones, and even deploy fully AI-generated influencers. All of this ties into token-gated content, subscription layers, and crypto payments, so revenue flows directly to the creator rather than being skimmed by middlemen. The presale numbers show the story is landing. SUBBD has raised $1,366,940.49, with tokens priced at $0.05705, signaling early but meaningful conviction from investors who see AI + ownership as a long-term macro pair. A 20% first-year staking yield adds a clear incentive for holders who want to participate in the ecosystem rather than just rotate in and out. For traders, SUBBD offers something distinct from the typical L1/L2 infrastructure play, exposure to AI-powered creator tooling, where the upside depends on user adoption, rather than gas fees or TPS bragging rights. And in a risk-on environment, narratives at the intersection of AI, social, and crypto tend to move quickly. If you want a deeper dive into potential long-term upside, our SUBBD price prediction breaks down the full forecast. 3. LiquidChain (LIQUID) — A Layer-3 Unifying BTC, ETH, and SOL Liquidity If Bitcoin Hyper is the bet on scaling Bitcoin and SUBBD is the bet on creators, LiquidChain (LIQUID) is the bet on where cross-chain DeFi is heading next. It’s a Layer-3 blockchain built to unify Bitcoin, Ethereum, and Solana into a single execution environment so liquidity, collateral, and dApps can actually move together, not in three different silos. Instead of relying on wrapped assets, LiquidChain is built around unified liquidity pools across BTC, ETH, and SOL. That means capital can be deployed without the usual friction associated with wrapping/unwrapping. A high-performance virtual machine handles real-time cross-chain execution, while trust-minimized proof systems verify UTXOs and state across all three major chains. In practice, that could look like a trader opening a leveraged position using BTC collateral against an ETH-denominated yield strategy, or a protocol routing orders through SOL and ETH liquidity without the user touching a bridge at all. As risk-on rotations send capital bouncing between ecosystems, infra that smooths those jumps tends to gain relevance fast. LiquidChain is still in an early stage, with presale momentum reportedly surpassing $40,000 raised and more than 3.3 million tokens staked during initial participation. The team is targeting a 2026 mainnet launch, framing LIQUID as a longer-dated multichain bet rather than a quick, speculative flip. Recap: As a 25% Solana recovery call nudges sentiment back toward risk-on, presales like Bitcoin Hyper, SUBBD , and LiquidChain offer higher-beta exposure to core narratives, Bitcoin scaling, AI-driven creator tools, and unified cross-chain liquidity. Of the three, Bitcoin Hyper stands out as the cleanest asymmetric bet on Bitcoin’s next DeFi chapter. This article is for informational purposes only and does not constitute financial, investment, or trading advice; always do your own research. Authored by Aaron Walker, NewsBTC – https://www.newsbtc.com/news/best-crypto-presales-to-buy-solana-25-percent-recovery/",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54991051,
    "published": 1764248421000,
    "title": "Bitcoin Price Could Rally Toward $93K As Bulls Look To Bitcoin Hyper Presale",
    "body": "What to Know: Bitcoin trading in a tight range below resistance often pushes traders toward higher‑beta assets that still track the underlying BTC macro trend. Infrastructure that makes Bitcoin more usable for payments, DeFi, and smart contracts is increasingly seen as a leveraged way to express long‑term BTC conviction. Bitcoin Hyper integrates an SVM‑powered Layer 2 with Bitcoin settlement, targeting low‑latency smart contracts to tackle BTC’s speed and programmability limits. Range-bound markets with upside potential toward levels like $93,000 can create strong narratives for BTC-aligned scaling plays and yield-bearing ecosystems. Bitcoin has spent weeks moving sideways, with bulls still eyeing a breakout toward the $93K zone even as heavy resistance sits just overhead. In this kind of late-cycle chop, tactical traders often look for higher-beta ways to express the same bullish thesis without simply adding more spot BTC. Rather than chasing marginal upside on a trillion-dollar asset, many rotate into narratives that closely track Bitcoin but offer structurally higher torque if the next leg higher begins. Bitcoin Layer 2s and yield-bearing BTC ecosystems are at the center of that shift, especially with fees elevated and block space still constrained. That’s where Bitcoin Hyper ($HYPER) enters the conversation. It’s pitching itself as a Bitcoin-aligned execution layer that feels closer to Solana in speed and throughput while still ultimately settling on Bitcoin. For traders, the appeal is twofold: exposure to BTC’s macro trend plus additional upside from payments, DeFi, and staking activity built on top of it. If Bitcoin does grind toward $93K in the months ahead, infrastructure that makes BTC faster, programmable, and yield-generating could attract outsized flows. Early access via the Bitcoin Hyper presale offers a way to stay positioned for Bitcoin’s broader move while taking on a more aggressive risk-reward profile than holding spot alone. Independent explainers are already unpacking where Bitcoin Hyper sits in the emerging Layer-2 race. Why Range‑Bound Bitcoin Pushes Flows Toward Higher‑Beta BTC Plays When Bitcoin spends weeks consolidating just beneath resistance, every new dollar of capital starts asking the same question: where does the risk pay off best? Historically, these conditions have pushed flows toward higher-beta expressions of the same macro view, leveraged derivatives, volatile altcoins, or infrastructure tokens that sit one layer out from BTC but still move in tandem with it. Layer-2 infrastructure has increasingly been the standout beneficiary. On Ethereum, rollup tokens and staking derivatives often outperform during consolidation because they enhance usability and unlock new yield on the base asset. A similar pattern is now emerging around Bitcoin as traders weigh Lightning, scaling-oriented sidechains, and next-generation programmable environments built on BTC collateral. Multiple architectures are competing to solve Bitcoin’s long-standing trade-offs between security, throughput, and programmability, from payment-channel networks to EVM-compatible sidechains to full smart-contract environments that settle back to Bitcoin. Within that mix, Bitcoin Hyper is positioning itself as a high-beta way to express the same core BTC thesis rather than a detached speculation play. A recent Bitcoin Hyper price-prediction breakdown has already started framing it in exactly that context. How Bitcoin Hyper Turns BTC Into a High‑Speed, Yield‑Bearing Asset Zooming in, Bitcoin Hyper positions itself as the first Bitcoin Layer 2 to integrate the Solana Virtual Machine (SVM), aiming to deliver execution speeds that rival, and in some cases surpass, Solana’s own environment. In practical terms, that means sub-second finality and ultra-low-latency processing for payments, DeFi, NFTs, and gaming, all while anchoring settlement and security back to Bitcoin. Its architecture is fully modular: Bitcoin L1 provides settlement, the real-time SVM Layer 2 handles smart-contract execution and high-throughput workloads, and a decentralized canonical bridge moves BTC in and out. Wrapped BTC becomes the base asset powering swaps, lending, and yield strategies. For developers, SPL-compatible tokens and a Rust-based SDK make it relatively easy to port Solana-style applications into a Bitcoin-aligned environment. That combination of throughput and Bitcoin-native alignment is already drawing interest. The presale has raised over $28.5M so far at a token price of $0.013335, signaling that investors are positioning for an ecosystem build-out rather than a short-lived meme rotation. In our deeper coverage of what is $HYPER , we’ve already noted how the architecture sets it apart from typical Bitcoin-adjacent plays. Our latest Bitcoin Hyper price prediction models point to meaningful upside if transaction volume, staking participation, and developer migration land even modestly in line with expectations. Smart money is accumulating as well: two high-net-worth wallets added $396K in recent weeks, with the largest buy at $53K. After TGE, high-APY staking (40%), a seven-day vesting period for presale stakers, and rewards tied to governance and community engagement are slated to keep capital sticky as the network comes online. For those who believe Bitcoin eventually breaks out while congestion and programmability constraints persist, a scalable Layer 2 like Bitcoin Hyper offers a direct, higher-beta way to express that thesis. Join the $HYPER presale. This article is for informational purposes only and does not constitute financial, investment, or trading advice; always do your own research. Authored by Aaron Walker, NewsBTC – https://www.newsbtc.com/news/bitcoin-hyper-presale-as-bitcoin-eyes-93k-range-break",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54991361,
    "published": 1764248824000,
    "title": "It’s ‘Finally Here’—‘Massive’ BlackRock Bitcoin ETF Update Helps Price Suddenly Soar",
    "body": "The bitcoin price has bounced from a recent low of $80,000 per bitcoin, helped by a major update for BlackRock's bitcoin ETF...",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54991977,
    "published": 1764249405000,
    "title": "BlackRock ETF investors bounce back to profit as price reclaims $90K",
    "body": "BlackRock Bitcoin ETF investors are back in profit, in a promising sign of a December market recovery from the cohort that drove much of Bitcoin’s rise to all-time highs in 2025.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54992886,
    "published": 1764250920000,
    "title": "How blockchain upgrades start: From idea to proposal",
    "body": "CTDG Dev Hub’s upgrade pipeline turns raw ideas into tested code, formal proposals and transparent governance across networks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      }
    ]
  },
  {
    "id": 54992885,
    "published": 1764250835000,
    "title": "Solana ETFs end perfect run as 21Shares’ TSOL sees $34M in outflows",
    "body": "The reversal was driven entirely by the 21Shares Solana ETF (TSOL), which saw over $34 million in withdrawals in a single day.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54992883,
    "published": 1764250445000,
    "title": "Visa doubles down on stablecoins in Europe, Middle East, Africa with new partnership",
    "body": "Visa has partnered with crypto infrastructure company Aquanow to expand stablecoin settlement across the CEMEA region, cutting cross-border costs and friction.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54992596,
    "published": 1764250445000,
    "title": "Visa doubles down on stablecoins in Europe, Middle East, Africa with new partnership",
    "body": "Visa has partnered with crypto infrastructure firm Aquanow to expand stablecoin settlement across the CEMEA region, cutting cross-border costs and friction.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54993551,
    "published": 1764252036000,
    "title": "Pundit Shares XRP Fact That Will ‘Blow Your Mind’",
    "body": "A crypto analyst has made a bold statement about XRP’s current price behavior, arguing that the cryptocurrency’s slow movements are necessary to build strong support levels. The analyst highlights the importance of consolidation and long-term accumulation, suggesting that XRP’s support levels are laying the groundwork for a market reset and a significant price surge. The Mind-Blowing Truth About XRP On Wednesday, crypto market expert Diep Sanh took to X, announcing that he had a mind-blowing message to share with the crypto community. The analyst explained that XRP’s current price action is far more important than many investors realize. According to him, extended periods of consolidation, as XRP is currently experiencing, lay the foundation for major rallies. Related Reading: Bitcoin Dead Cat Bounce: Analyst Reveals What To Expect As Price Recovers Sanh emphasized that when XRP spends a significant time near the $2 mark, it gives investors the chance to accumulate at that price. He explained that this accumulation builds a powerful layer of support, which can help stabilize the market during future corrections. He also noted that once XRP climbs to a higher region and stays there long enough to form a higher low, a new wave of investors usually enters. This creates the next support base and sets the stage for a major upward move. Sanh hinted that XRP could reach dramatic price targets, such as $10 or even $100. However, it would require several of these strong support layers to form over time. Each layer represents greater confidence in the asset and more liquidity to sustain a stronger market. The analyst noted that investors or traders who are frustrated by XRP’s low price and recent downturn are missing the bigger picture. He highlighted that they do not understand how these gradual accumulation phases work or how they can contribute to long-term gains. XRP Remains One Of The Best Crypto Plays After Price Dip In a subsequent analysis, Sanh reaffirmed his confidence in XRP’s future outlook following the recent market downturn. He noted that XRP remains one of the strongest crypto plays despite its recent price crash. The analyst emphasized that the cryptocurrency continues to stand out due to the utility of the XRP Ledger (XRPL), a blockchain network engineered for fast and efficient global payments. Related Reading: XRP 100x Rally To $225: Why The Only Place To Go Is Up Sanh noted that this unique design of XRPL gives it an advantage over many large-cap competitors. Moreover, with regulatory uncertainty largely resolved after the US Securities and Exchange Commission (SEC) dispute, the analyst highlights that XRP has already outperformed most top assets. Currently, XRP is trading at $2.2, experiencing a slight recovery despite recording weeks of choppy price action. Sanh disclosed that investors and traders tend to treat such corrections as strategic accumulation periods rather than signs of weakness. He argued that if XRP continues to expand in areas such as cross-border payments, tokenized asset markets, and stablecoin development, it would benefit its underlying structure. He added that these expanding sectors will also provide long-term support for the cryptocurrency’s growth potential. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Ripple|ripple news|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54994039,
    "published": 1764252444000,
    "title": "Malicious Chrome extension skims Solana swaps with hidden extra transfers",
    "body": "A malicious Chrome extension called Crypto Copilot lets users trade Solana directly from X but secretly skims a small portion of the transaction.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54995031,
    "published": 1764253998000,
    "title": "Houdini Pay targets freelancers with privacy-focused crypto payment tool",
    "body": "Houdini Swap launched Houdini Pay, a payment service that breaks onchain links between counterparties, offering surface-level privacy.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54996029,
    "published": 1764255655000,
    "title": "Dogecoin Falling Wedge Formation Says Expect 80-90% Rally In The Coming Days",
    "body": "Dogecoin (DOGE) is flashing a potential bullish reversal signal as a crypto analyst points to a breakout setup forming on the mid-term chart. The analyst’s chart highlights a tightening Falling Wedge on the 12-hour timeframe, signaling a possible shift in momentum after weeks of sustained decline. With price compressing toward the Falling Wedge’s apex, he has predicted that Dogecoin could soon see an explosive 80-80% price rally. Falling Wedge Pattern Points To Massive Dogecoin Breakout Crypto market expert Clifton Fx has released a new Dogecoin update on X, drawing attention to a clear Falling Wedge formation on the 12-hour chart. The chart shows that Dogecoin has been moving downward within the two converging trendlines of this wedge—a pattern that often precedes strong bull rallies. Usually, when a Falling Wedge appears, it indicates the end of a consolidation phase facilitated by a correction. Related Reading: Dogecoin’s 6,500% Surge: The Road That Leads From $0.15 To $10 This Cycle Dogecoin’s recent bounce from the wedge’s support suggests that the market may be preparing for a massive breakout. Building on this, Clifton Fx’s chart analysis shows that the wedge has reached a stage where volatility typically compresses before an expansion, making the next few sessions critical for a bullish confirmation. The expert’s analysis suggests that once the DOGE price breaks above the upper trendline of the Falling Wedge, the cryptocurrency could see a massive 80% to 90% bull rally in the days following the breakout. Dogecoin is currently trading at $0.15, reflecting the broader market downturn that has pushed the meme coin down by more than 23% in just over a month. If the price can initiate a rebound above 80%, it would erase the recent losses and also propel Dogecoin toward the $0.27 to $0.29 range. DOGE Cyclical Pattern Signals $5 Move By 2026 Sharing similar bullish sentiments about Dogecoin’s future, a pseudonymous crypto analyst, Bark, takes a broader view of the meme coin’s price behavior across multiple market cycles to decipher its next move. The accompanying chart maps out DOGE’s historical patterns since 2014, illustrating two major cycles characterized by extended accumulation phases and followed by explosive price surges. Related Reading: What Happens If Dogecoin Moves Out Of This Massive Wyckoff Accumulation? Each cycle was defined by similar chart structures, including a rounded base and consolidation zones that preceded each upward surge. According to Bark, Dogecoin appears to be replicating the fractal formation from past cycles. The first cycle in 2017 and the second in 2021 exhibited long accumulation periods before sharp vertical breakouts of about 5,858% and 21,457%, respectively. If the same historical pattern repeats in this cycle, Bark has predicted that Dogecoin could be setting the stage for a massive bull rally to $5 by 2026. The chart shows that a surge to this level from DOGE’s current price of $0.15 could represent a staggering 4,447% increase. Featured image from Peakpx, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|Bark|Clifton Fx|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt|falling wedge pattern",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54995836,
    "published": 1764255147000,
    "title": "Fiat inflation drives crypto adoption across the globe",
    "body": "Global inflation has slowed down, but in many countries, crypto is still providing an attractive and viable alternative to the local monetary system.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54996090,
    "published": 1764194776000,
    "title": "Conor McGregor calls out Khabib over NFTs, gets shut down by ZachXBT",
    "body": "The former UFC champion tried to launch his own celebrity memecoin, REAL, in April, but the project failed to gain traction.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54996728,
    "published": 1764256547000,
    "title": "Justin Sun Doubles Down on First Digital Trust Fraud Allegations, Urges H.K. Regulators to Act",
    "body": "Sun accused FDT of exploiting gaps in Hong Kong’s trust company regime and urged regulators to act after a Dubai court froze assets linked to the alleged misappropriation.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|First Digital Trust|Justin Sun|Hong Kong|lawsuits|Regulation|TrueUSD|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 173,
        "NAME": "TUSD",
        "CATEGORY": "TUSD"
      }
    ]
  },
  {
    "id": 54996654,
    "published": 1764256464000,
    "title": "Bitcoin Whales Return to Buying for the First Time Since August as Price Recovers Above $90K",
    "body": "Large holders return to buying after months of distribution, signalling renewed confidence at key support levels.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Glassnode|market analysis|top news|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54996611,
    "published": 1764194776000,
    "title": "Conor McGregor calls out Khabib over NFTs, gets shut down by ZachXBT",
    "body": "The former UFC champion tried to launch his own celebrity memecoin, REAL, in April, but the project failed to gain traction.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54997351,
    "published": 1764257472000,
    "title": "Spot Solana ETFs Post First Red Day Since Launch",
    "body": "Solana ETFs recorded their first-ever outflow of $8.1M amid a broader crypto market recovery, breaking a three-week streak of inflows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "dogecoin|||Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54997656,
    "published": 1764257922000,
    "title": "Bitcoin sees ‘significant step forward’ as $97K BTC price targets return",
    "body": "Bitcoin gained fresh bullish BTC price targets closer to $100,000 on the back of a sustained rebound and encouraging futures market signals.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54997617,
    "published": 1764194776000,
    "title": "Conor McGregor calls out Khabib over NFTs, gets shut down by ZachXBT",
    "body": "The former UFC champion tried to launch his own celebrity memecoin, REAL, in April, but the project failed to gain traction.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54998314,
    "published": 1764259216000,
    "title": "Selling Storm: Bitcoin Whales Could Drive Prices Down Further, Experts Warn",
    "body": "According to exchange data, inflows to trading venues topped 9,000 Bitcoin on Nov. 21 as prices slid to $80,600 on Coinbase — the weakest showing in seven months. Related Reading: Bitcoin Faces More Downside After Recent Crash, Data Shows Reports show that about 45% of those deposits came in chunks of 100 BTC or more, and on one day large transfers reached 7,000 BTC. The average deposit size in November rose to 1.23 BTC, the largest monthly figure in a year. Those numbers point to more than casual rebalancing; they point to coins being moved where they can be sold. Binance Stablecoins Hit Record According to market coverage, Binance’s stablecoin holdings climbed to a record $51 billion. At the same time, BTC and Ether inflows to exchanges swelled to roughly $40 billion this week, with Binance and Coinbase leading the move. Traders often park funds in dollar-pegged tokens when they want to wait on the sidelines. That build-up means cash is available, but it is sitting idle until sellers either step back or buyers turn up again. Bitcoin exchange inflows are rising as the price drops to ~87K, a seven-month low. Large deposits (100+ BTC) now make up 45% of all inflows, hitting 7K BTC on Nov 21. Large holders are increasingly sending BTC to exchanges, reinforcing the current downtrend. pic.twitter.com/UpN4rAL0FH — CryptoQuant.com (@cryptoquant_com) November 26, 2025 Analysts Eye Further Pullback Some market watchers warn the recent recovery could be only a pause, flagging remaining margin positions and suggested a test of lower levels. They said a wick into the $70k–$80k zone would be one way to clear out the last pockets of exposure. 10x Research put resistance levels at $92,000 and $101,000 as the key ranges to watch during any rebound. For context, Bitcoin had clawed back above $90,000 and was trading slightly higher at the time of reporting, but it remains down about 28% from the all-time high north of $126,000 reached in October. Short-Term Bounce, Not A Full Recovery Meanwhile, market moves in stocks and crypto have shown mixed signals. The S&P 500 and the Nasdaq were pushing gains as investors bet on a US Fed rate cut, and that helped risk assets. Yet reports from strategists show the usual close link between Bitcoin and the Nasdaq has weakened, with Bitcoin’s decline steeper in recent weeks. Ether and many altcoins also faced higher exchange inflows, and several tokens returned to bear-market lows as selling pressure widened. Related Reading: Bitcoin Whale Reenters ETH Market, Fires Off A $44-M Long What This Means Next Liquidity is present but it is parked in stablecoins, and big holders are still moving assets toward exchanges. A meaningful rally will likely need either heavy buying demand or a clear catalyst that draws those stablecoins back into risk assets. For now, the market sits in a waiting mode: a short rally could continue, but a deeper dip remains possible as positions get cleared and sellers complete their rotations. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|cryptoquant|fed|fed rate cut|whales",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54998001,
    "published": 1764258593000,
    "title": "UK Proposes ‘No Gain, No Loss’ Tax Rule for DeFi in 'Major Win' for Users",
    "body": "The proposal, with input from major industry players, aims to bring tax rules in line with how DeFi works, reducing outcomes that don't reflect reality.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|United Kingdom|Decentralized Finance|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 54998285,
    "published": 1764194776000,
    "title": "Conor McGregor calls out Khabib over NFTs, gets shut down by ZachXBT",
    "body": "The former UFC champion tried to launch his own celebrity memecoin, REAL, in April, but the project failed to gain traction.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54998752,
    "published": 1764259928000,
    "title": "Hash Ribbon Flashes Signal That Often Marks Cyclical Bottoms for Bitcoin Price",
    "body": "A historically reliable bottom signal appears after bitcoin’s 35% correction.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Glassnode|Bitcoin News|Miner Revenue|Hashrate|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54998439,
    "published": 1764194776000,
    "title": "Conor McGregor calls out Khabib over NFTs, gets shut down by ZachXBT",
    "body": "The former UFC champion tried to launch his own celebrity memecoin, REAL, in April, but the project failed to gain traction.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54998589,
    "published": 1764194776000,
    "title": "Conor McGregor calls out Khabib over NFTs, gets shut down by ZachXBT",
    "body": "The former UFC champion tried to launch his own celebrity memecoin, REAL, in April, but the project failed to gain traction.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54999231,
    "published": 1764260564000,
    "title": "Solana analysis: SOL price unlikely to break $150 for now",
    "body": "Solana struggles with recovery due to weakening network activity, a declining TVL, and negative ETF flows, as a classic chart pattern targets $100.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55000534,
    "published": 1764262808000,
    "title": "Ethereum Is 58% ‘Undervalued’ Based On Intrinsic Metrics, Says Hashed CEO",
    "body": "Ethereum is trading far below its modeled “intrinsic value,” according to a live valuation dashboard launched by Hashed CEO Simon Kim. On ETHval (ethval.com), the current snapshot shows Ethereum at a spot price of $3,034.0 while the reliability-weighted “Composite Fair Value” stands at $4,777.5, implying +57.8% upside versus the market. The median fair value across models is $4,026.68, or +33.8% above spot. The dashboard labels ETH “UNDERVALUED” and aggregates its eight models into five buy, one hold and two sell signals. How The Fair Value Of Ethereum Is Calculated Kim introduced the project on X with the explicit goal of shifting the discussion away from pure sentiment: “What is ETH actually worth? The crypto industry deserves better than price speculation. I built a dashboard to think about ETH’s intrinsic value with 8 models… Far from perfect and open to feedback.” ETHval makes those models and their outputs fully visible, along with their individual reliability tags. Related Reading: Ethereum Price To Recover Or Crash? The Real ‘Leverage Point’ Investors Should Know About The tool’s central panel breaks out each valuation. The TVL Multiple model, which prices ETH off total value locked in DeFi using a 7× TVL-to-market-cap anchor, assigns a fair value of $4,026.6, judging ETH 32.7% undervalued (reliability: medium). A more conservative MC/TVL Fair Value mean-reversion model, treated as high reliability, lands at $3,453.1, only 13.8% above spot and classified as “fair.” Models that embed stronger network-effect or cash-flow claims are far more aggressive. The DCF (Staking) framework, which discounts an implied perpetual stream of staking rewards, values ETH at $9,101.9, indicating it is 200.0% undervalued. A high-reliability Metcalfe’s Law implementation, which scales value with TVL to the power of 1.5, is even more bullish at $9,585.9, or 216.8% above the current price. The Ethereum L2 ecosystem model, which adds twice the TVL of major rollups to Ethereum mainnet TVL before applying a multiple, generates a fair value of $4,640.0, implying 52.9% undervaluation, although ETHval marks this model’s reliability as low. A Staking Scarcity model, also low reliability and based on liquid-supply contraction, prices ETH at $3,538.2, or 16.6% undervalued. Related Reading: Ethereum Steadies Near $2,900 as Fed Rate-Cut Odds Fuel $3,400 Rebound Hopes Two income-style models push in the opposite direction and still receive high reliability scores. The P/E Ratio (25×) model treats annualized protocol fees as “earnings,” applies a 25× multiple and arrives at a fair value of only $957.4, reading ETH as 68.4% overvalued. The Revenue Yield model reverse-engineers price from a target protocol yield of 2.5%; at current revenue levels it outputs $1,531.8, implying 49.5% overvaluation. To synthesize these conflicting signals, ETHval applies a disclosed weighting scheme: high-reliability models are multiplied by 9, medium by 5 and low by 2 when computing the $4,780.7 composite. That weighting, combined with the extreme upside implied by the DCF and Metcalfe models, is what drives the overall conclusion that Ethereum is strongly undervalued despite two respected frameworks pointing to downside. The dashboard itself stops short of making investment recommendations. Underneath the numbers, ETHval reiterates that the outputs are for reference only and that each model rests on explicit, debatable assumptions. But by fixing the current ETH price at $3,034.0 against a live fair-value band stretching from $957.4 on the bearish end to $9,585.9 on the most bullish, Kim’s site quantifies a debate that usually plays out in anecdotes and narratives—and, for now, that quantified view leans clearly toward Ethereum being undervalued. At press time, ETH traded at $3,029. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55000506,
    "published": 1764213626000,
    "title": "Nasdaq seeks to ‘super-size’ option limits for BlackRock's Bitcoin ETF",
    "body": "The push from the Nasdaq to increase option limits for the BlackRock Bitcoin fund shows Bitcoin markets are “breaking out of their training wheels.”",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55000364,
    "published": 1764213626000,
    "title": "Nasdaq seeks to ‘super-size’ option limits for BlackRock's Bitcoin ETF",
    "body": "The push from the Nasdaq to increase option limits for the BlackRock Bitcoin fund shows Bitcoin markets are “breaking out of their training wheels.”",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55001009,
    "published": 1764263616000,
    "title": "Bitcoin has a 75% chance of short-term rally, says trader Alessio Rastani",
    "body": "Veteran trader Alessio Rastani breaks down his bullish outlook for Bitcoin in the coming months in a new Cointelegraph interview.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55000864,
    "published": 1764213626000,
    "title": "Nasdaq seeks to ‘super-size’ option limits for BlackRock's Bitcoin ETF",
    "body": "The push from the Nasdaq to increase option limits for the BlackRock Bitcoin fund shows Bitcoin markets are “breaking out of their training wheels.”",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55001350,
    "published": 1764214594000,
    "title": "Bitcoin risks deeper drop if whale exchange deposits stay high: Analyst",
    "body": "Bitcoin whale deposits to exchanges surged to 9,000 BTC on Nov. 21, with large holders driving 45% of inflows. If it keeps up, Bitcoin could have more to fall.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55001348,
    "published": 1764213626000,
    "title": "Nasdaq seeks to ‘super-size’ option limits for BlackRock's Bitcoin ETF",
    "body": "The push from the Nasdaq to increase option limits for the BlackRock Bitcoin fund shows Bitcoin markets are “breaking out of their training wheels.”",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55002259,
    "published": 1764266455000,
    "title": "The Final XRP Bull Run That Will Send Price To $1,115",
    "body": "Crypto analyst NeverWishing has predicted that the XRP price will rally to as high as $1,115. He highlighted three paths for XRP to reach this target, in what the analyst described as the final bull run for the altcoin. Analyst Maps Out Final XRP Bull Run Rally To $1,115 In a TradingView post, the crypto analyst mapped out three paths for XRP to rally to the $1,115 target. They tagged the first path as the immediate delivery, the second as a normal delivery, and the third as one that will trigger only if the XRP price stays suppressed. For the third path, NeverWishing stated that a final backup execution could happen between January 1 and 6 next year. Related Reading: The Bull And Bear Scenario For XRP That Could Play Out In November For path A, NeverWishing stated that it will start between this month and next month, with the first impulse sparking an XRP rally to between $30 and $33. The secondary spike will send the altcoin to $186, while a consolidation phase will lead to a climb toward $285. After that, XRP will rally to its final blow-off target of $1,115. NeverWishing described the second path as the fastest, stating it will occur between January and March next year. The first stop will be between $30 and $33 for XRP, after which volatility waves will occur through February and March. The altcoin will then break into the macro expansion zone, with the major target at $285 and the final target at $1,115. The Third Path For XRP The analyst noted that the third path is smoother and slightly delayed. NeverWishing also reiterated that this is a suppressed variant and will only happen if the first and second paths fail. They explained that if the XRP price stays held down, then the algorithm will reset and fire between January 1 and 6 next year. Related Reading: Why XRP Price Crash Below $2 Is Not A Problem – $20 Is Still The Target XRP will have the same opening move as the first two paths, rallying to between $30 and $33. It will then have the same structure as the second path, with the macro targets being $285 and $1,115. NeverWishing then outlined the key timing windows for XRP as it eyes a rally to this $1,115 target. The first key timing is between this month and January 2026, which marks the entry and breakout window. The analyst tagged March 21, 2026, as the mid-cycle reversal point in the XRP final bull run. August 14, 2026, marks the “warning zone,” while the pullback is expected between October and November 2026. Lastly, NeverWishing stated that January 1, 2027, is the final liquidity window. At the time of writing, the XRP price is trading at around $2.20, up in the last 24 hours, according to data from CoinMarketCap. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|altcoin|CoinMarketCap|Macro Expansion Zone|NeverWishing|Ripple|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55001931,
    "published": 1764265780000,
    "title": "Avalanche ETF Race Heats Up as Bitwise Becomes First to Add Staking",
    "body": "Bitwise moves its Avalanche ETF closer to market with updated SEC filing and becomes first issuer to include staking.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Bitwise|exchange-traded funds|Avalanche|SEC|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55002502,
    "published": 1764214665000,
    "title": "SEC tokenized stock exemptions should be targeted, stock exchanges argue",
    "body": "A group representing major stock exchanges has urged the SEC to abandon its plan to grant an “innovation exemption” to brokers and crypto firms seeking to offer tokenized stocks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55002681,
    "published": 1764214665000,
    "title": "SEC tokenized stock exemptions should be targeted, stock exchanges argue",
    "body": "A group representing major stock exchanges has urged the SEC to abandon its plan to grant an “innovation exemption” to brokers and crypto firms seeking to offer tokenized stocks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55002548,
    "published": 1764214665000,
    "title": "SEC tokenized stock exemptions should be targeted, stock exchanges argue",
    "body": "A group representing major stock exchanges has urged the SEC to abandon its plan to grant an “innovation exemption” to brokers and crypto firms seeking to offer tokenized stocks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55002423,
    "published": 1764214665000,
    "title": "SEC tokenized stock exemptions should be targeted, stock exchanges argue",
    "body": "A group representing major stock exchanges has urged the SEC to abandon its plan to grant an “innovation exemption” to brokers and crypto firms seeking to offer tokenized stocks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55002422,
    "published": 1764214594000,
    "title": "Bitcoin risks deeper drop if whale exchange deposits stay high: Analyst",
    "body": "Bitcoin whale deposits to exchanges surged to 9,000 BTC on Nov. 21, with large holders driving 45% of inflows. If it keeps up, Bitcoin could have more to fall.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55002500,
    "published": 1764214594000,
    "title": "Bitcoin risks deeper drop if whale exchange deposits stay high: Analyst",
    "body": "Bitcoin whale deposits to exchanges surged to 9,000 BTC on Nov. 21, with large holders driving 45% of inflows. If it keeps up, Bitcoin could have more to fall.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55002547,
    "published": 1764214594000,
    "title": "Bitcoin risks deeper drop if whale exchange deposits stay high: Analyst",
    "body": "Bitcoin whale deposits to exchanges surged to 9,000 BTC on Nov. 21, with large holders driving 45% of inflows. If it keeps up, Bitcoin could have more to fall.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55002680,
    "published": 1764214594000,
    "title": "Bitcoin risks deeper drop if whale exchange deposits stay high: Analyst",
    "body": "Bitcoin whale deposits to exchanges surged to 9,000 BTC on Nov. 21, with large holders driving 45% of inflows. If it keeps up, Bitcoin could have more to fall.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55002498,
    "published": 1764213626000,
    "title": "Nasdaq seeks to ‘super-size’ option limits for BlackRock's Bitcoin ETF",
    "body": "The push from the Nasdaq to increase option limits for the BlackRock Bitcoin fund shows Bitcoin markets are “breaking out of their training wheels.”",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55002546,
    "published": 1764213626000,
    "title": "Nasdaq seeks to ‘super-size’ option limits for BlackRock's Bitcoin ETF",
    "body": "The push from the Nasdaq to increase option limits for the BlackRock Bitcoin fund shows Bitcoin markets are “breaking out of their training wheels.”",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55002678,
    "published": 1764213626000,
    "title": "Nasdaq seeks to ‘super-size’ option limits for BlackRock's Bitcoin ETF",
    "body": "The push from the Nasdaq to increase option limits for the BlackRock Bitcoin fund shows Bitcoin markets are “breaking out of their training wheels.”",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55003111,
    "published": 1764267986000,
    "title": "Balancer community proposes plan to distribute funds recovered from hack",
    "body": "The proposal details how roughly $8 million recovered from the $116 million November hack would be distributed to victims.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 10,
        "NAME": "BAL",
        "CATEGORY": "BAL"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 55003456,
    "published": 1764214924000,
    "title": "Animoca bets on altcoin upside to lure investors as it plans for IPO",
    "body": "Animoca Brands’ founder, Yat Siu, anticipates that the crypto industry will not have a one-winner “takes all” scenario like the internet era in the early 2000s.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55003222,
    "published": 1764214924000,
    "title": "Animoca bets on altcoin upside to lure investors as it plans for IPO",
    "body": "Animoca Brands’ founder, Yat Siu, anticipates that the crypto industry will not have a one-winner “takes all” scenario like the internet era in the early 2000s.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55003165,
    "published": 1764214924000,
    "title": "Animoca bets on altcoin upside to lure investors as it plans for IPO",
    "body": "Animoca Brands’ founder, Yat Siu, anticipates that the crypto industry will not have a one-winner “takes all” scenario like the internet era in the early 2000s.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55003220,
    "published": 1764214665000,
    "title": "SEC tokenized stock exemptions should be targeted, stock exchanges argue",
    "body": "A group representing major stock exchanges has urged the SEC to abandon its plan to grant an “innovation exemption” to brokers and crypto firms seeking to offer tokenized stocks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55003454,
    "published": 1764214665000,
    "title": "SEC tokenized stock exemptions should be targeted, stock exchanges argue",
    "body": "A group representing major stock exchanges has urged the SEC to abandon its plan to grant an “innovation exemption” to brokers and crypto firms seeking to offer tokenized stocks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55003218,
    "published": 1764214594000,
    "title": "Bitcoin risks deeper drop if whale exchange deposits stay high: Analyst",
    "body": "Bitcoin whale deposits to exchanges surged to 9,000 BTC on Nov. 21, with large holders driving 45% of inflows. If it keeps up, Bitcoin could have more to fall.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55003452,
    "published": 1764214594000,
    "title": "Bitcoin risks deeper drop if whale exchange deposits stay high: Analyst",
    "body": "Bitcoin whale deposits to exchanges surged to 9,000 BTC on Nov. 21, with large holders driving 45% of inflows. If it keeps up, Bitcoin could have more to fall.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55003914,
    "published": 1764270062000,
    "title": "Vitalik Buterin Donates $765K in Ethereum to Privacy Messaging Apps",
    "body": "Ethereum co-founder Vitalik Buterin supported two privacy messaging apps that are looking to break past sector leaders Signal and Telegram.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|zcash|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55004152,
    "published": 1764214924000,
    "title": "Animoca bets on altcoin upside to lure investors as it plans for IPO",
    "body": "Animoca Brands’ founder, Yat Siu, anticipates that the crypto industry will not have a one-winner “takes all” scenario like the internet era in the early 2000s.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55004150,
    "published": 1764214665000,
    "title": "SEC tokenized stock exemptions should be targeted, stock exchanges argue",
    "body": "A group representing major stock exchanges has urged the SEC to abandon its plan to grant an “innovation exemption” to brokers and crypto firms seeking to offer tokenized stocks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55004488,
    "published": 1764214924000,
    "title": "Animoca bets on altcoin upside to lure investors as it plans for IPO",
    "body": "Animoca Brands’ founder, Yat Siu, anticipates that the crypto industry will not have a one-winner “takes all” scenario like the internet era in the early 2000s.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55004829,
    "published": 1764214924000,
    "title": "Animoca bets on altcoin upside to lure investors as it plans for IPO",
    "body": "Animoca Brands’ founder, Yat Siu, anticipates that the crypto industry will not have a one-winner “takes all” scenario like the internet era in the early 2000s.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55004485,
    "published": 1764214665000,
    "title": "SEC tokenized stock exemptions should be targeted, stock exchanges argue",
    "body": "A group representing major stock exchanges has urged the SEC to abandon its plan to grant an “innovation exemption” to brokers and crypto firms seeking to offer tokenized stocks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55004985,
    "published": 1764214924000,
    "title": "Animoca bets on altcoin upside to lure investors as it plans for IPO",
    "body": "Animoca Brands’ founder, Yat Siu, anticipates that the crypto industry will not have a one-winner “takes all” scenario like the internet era in the early 2000s.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55005988,
    "published": 1764273662000,
    "title": "Malware Chrome Extension Secretly Siphoned Fees From Solana Traders for Months",
    "body": "Cybersecurity firm Socket warns the extension masks a second transaction instruction that quietly skims SOL from routine swaps.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55005909,
    "published": 1764273607000,
    "title": "SOL Holds $140 Support as Upbit Hack Fails to Shake Solana Ecosystem",
    "body": "Solana (SOL) is showing remarkable resilience this week, holding firmly above the critical $140 support zone despite heightened market anxiety following a $37 million hack on South Korea’s Upbit exchange. Related Reading: The Bull And Bear Scenario For XRP That Could Play Out In November The stability comes at a time when institutional interest in Solana is accelerating, highlighted by Franklin Templeton’s recent Form 8-A filing with the U.S. SEC to launch a Solana ETF. Franklin Templeton’s Solana ETF Fuels Institutional Momentum The global investment giant, which manages $1.67 trillion in assets, is positioning itself at the forefront of crypto-focused investment products. The proposed ETF would offer regulated exposure to Solana without requiring investors to hold the token directly, a move widely seen as a bullish catalyst for long-term adoption. Historically, ETFs have had mixed but notable effects on crypto markets. Bitcoin surged to new all-time highs after its ETF debut in 2024, while Ethereum took months to show similar momentum. Analysts say it remains unclear whether SOL will follow the Bitcoin pattern or display a more gradual response once the ETF is approved. SOL's price trends to the downside on the daily chart. Source: SOLUSD on Tradingview Upbit’s $37M Solana Hack Sends Shockwaves, But SOL Stays Steady Upbit confirmed an unauthorized outflow of roughly 54 billion KRW (about $37 million) involving SOL and several Solana-based tokens. The exchange immediately halted deposits and withdrawals, moved remaining assets into cold storage, and pledged to fully reimburse affected customers from its own reserves. While such incidents typically trigger steep price drops, Solana’s ecosystem demonstrated surprising stability. Not only did SOL hold above $140, a multi-month high-timeframe support zone, but Solana memecoins such as BONK, TRUMP, and MOODENG barely reacted. Traders pointed to on-chain data showing buyers aggressively defending key support levels, even as broader market sentiment wavered. Upbit has already frozen ₩12 billion worth of stolen LAYER tokens and is working with partners to trace additional assets. The timing of the breach, occurring nearly six years to the day after Upbit’s notorious 2019 hack, has drawn attention but has not shaken confidence in Solana’s network. Technical Outlook: Rebound or Breakdown? Analysts highlight $142–$145 as the immediate resistance band, supported by an estimated 13 million SOL accumulated at that level. A breakout could open the path toward $165, $188, and even higher liquidity pockets at $220–$240. Longer-term projections suggest potential targets between $360 and $480 if Wyckoff reaccumulation patterns complete. However, a failure to maintain $143 support could send SOL toward deeper zones at $130–$127. Related Reading: Has The Bitcoin Price Hit Its Bottom? Key On-Chain Data Signals Potential Rebound Ahead For now, Solana’s impressive stability, amid an exchange hack and ongoing market downturn, underscores growing confidence in the ecosystem as institutional players continue to step in. Cover image from ChatGPT, SOLUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Solana|Sol|SOL Price|SOLUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 55005818,
    "published": 1764214924000,
    "title": "Animoca bets on altcoin upside to lure investors as it plans for IPO",
    "body": "Animoca Brands’ founder, Yat Siu, anticipates that the crypto industry will not have a one-winner “takes all” scenario like the internet era in the early 2000s.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55006185,
    "published": 1764273883000,
    "title": "ETH traders ramp up positioning, setting a price target at $3.4K",
    "body": "Ethereum traders ramped up leverage as futures dominance surged and key technical levels came into play. Will ETH bulls succeed in catalyzing a rally to $3,400?",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55006931,
    "published": 1764275013000,
    "title": "Amundi brings euro money market fund onchain with first tokenized share",
    "body": "The asset manager’s hybrid rollout enables investors to choose between the traditional fund and a new blockchain-based version recorded on Ethereum.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55007059,
    "published": 1764220807000,
    "title": "XRP ETFs absorb 80M tokens: Is a new bull trend starting for the altcoin?",
    "body": "Two new XRP ETFs absorbed 80 million tokens on launch as the price formed a bullish flag after hitting resistance at $2.20.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55007013,
    "published": 1764220807000,
    "title": "XRP ETFs absorb 80M tokens: Is a new bull trend starting for the altcoin?",
    "body": "Two new XRP ETFs absorbed 80 million tokens on launch as the price formed a bullish flag after hitting resistance at $2.20.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55007312,
    "published": 1764220807000,
    "title": "XRP ETFs absorb 80M tokens: Is a new bull trend starting for the altcoin?",
    "body": "Two new XRP ETFs absorbed 80 million tokens on launch as the price formed a bullish flag after hitting resistance at $2.20.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55007265,
    "published": 1764220807000,
    "title": "XRP ETFs absorb 80M tokens: Is a new bull trend starting for the altcoin?",
    "body": "Two new XRP ETFs absorbed 80 million tokens on launch as the price formed a bullish flag after hitting resistance at $2.20.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55007399,
    "published": 1764220807000,
    "title": "XRP ETFs absorb 80M tokens: Is a new bull trend starting for the altcoin?",
    "body": "Two new XRP ETFs absorbed 80 million tokens on launch as the price formed a bullish flag after hitting resistance at $2.20.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55008035,
    "published": 1764277241000,
    "title": "Analyst Predicts XRP Price Will Hit $100 Before Bitcoin Hits $1 Million",
    "body": "A crypto analyst has issued a decisive projection that challenges the long timelines often associated with major price milestones for Bitcoin. His outlook was presented in response to the ultra-bullish forecasts from Michael Saylor and Jack Mallers, who have spoken openly about the possibility of Bitcoin reaching between $1 million and $20 million per coin. Rather than focusing on Bitcoin’s distant targets, the analyst directed attention to XRP, insisting that XRP will reach $100 long before Bitcoin touches the seven-figure mark. Analyst Says XRP Will Reach $100 Before Bitcoin’s Million-Dollar Target There have been many bullish predictions of Bitcoin breaking above the $1 million mark in recent months, with notable names like Michael Saylor and Cathie Wood pointing to million-dollar targets. Related Reading: Analyst Claims XRP Will Flip Bitcoin As These Developments Play Out However, an analyst who goes by the name 24HRSCRYPTO on the social media platform X referenced Saylor and Mallers’ price prediction, which places future Bitcoin valuations in the tens of millions per coin and implies a market cap approaching $500 trillion. He contrasted those long-range projections with what he believes is a more attainable and nearer-term milestone for XRP. Punching in the numbers shows that XRP is a 4,445% move away from $100 based on its current price level of around $2.2. Bitcoin, on the other hand, is 990% away from the $1 million price. Even with that difference, the analyst noted, “You will see XRP at $100 before Bitcoin hits $1 million.” The statement points to the view that XRP is positioned for faster price growth in the foreseeable future, as seen by price dynamics in the past few months. The crypto is increasingly being positioned in a situation where demand and adoption of the Ripple ecosystem could take it to new heights. On the other hand, Bitcoin’s price action is slowing down relative to XRP. Notably, technical analysis of the XRP/BTC pair places XRP on the path to outperforming Bitcoin in the coming weeks and months. The Altcoin Will Hit $1,000 Before Bitcoin Touches $19 Million The analyst extended his projection even further by asserting that XRP could rally to $1,000 before Bitcoin comes close to the $19 million figure referenced by Saylor. Such a valuation for Bitcoin would imply a market capitalization of roughly $500 trillion, a scale far beyond anything seen in global financial history. Related Reading: Analyst Claims XRP Price Will Surge To $220 Due To ETFs, But Is This Possible? Measured from today’s levels, Bitcoin would need to climb roughly 20,635% to reach the $19 million mark. XRP’s path to $1,000 amounts to an even larger jump of about 45,300%, which corresponds to a market cap of $60 trillion based on its current circulating supply. Still, XRP reaching $1,000 is, in his view, more feasible than Bitcoin reaching millions per coin. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|24HRSCRYPTO|bitcoin|Cathie Wood|Jack Mallers|Michael Saylor|Ripple|xrp|xrp btc|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55007770,
    "published": 1764220807000,
    "title": "XRP ETFs absorb 80M tokens: Is a new bull trend starting for the altcoin?",
    "body": "Two new XRP ETFs absorbed 80 million tokens on launch as the price formed a bullish flag after hitting resistance at $2.20.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55007816,
    "published": 1764220807000,
    "title": "XRP ETFs absorb 80M tokens: Is a new bull trend starting for the altcoin?",
    "body": "Two new XRP ETFs absorbed 80 million tokens on launch as the price formed a bullish flag after hitting resistance at $2.20.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55008320,
    "published": 1764220807000,
    "title": "XRP ETFs absorb 80M tokens: Is a new bull trend starting for the altcoin?",
    "body": "Two new XRP ETFs absorbed 80 million tokens on launch as the price formed a bullish flag after hitting resistance at $2.20.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55008270,
    "published": 1764220807000,
    "title": "XRP ETFs absorb 80M tokens: Is a new bull trend starting for the altcoin?",
    "body": "Two new XRP ETFs absorbed 80 million tokens on launch as the price formed a bullish flag after hitting resistance at $2.20.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55008683,
    "published": 1764220807000,
    "title": "XRP ETFs absorb 80M tokens: Is a new bull trend starting for the altcoin?",
    "body": "Two new XRP ETFs absorbed 80 million tokens on launch as the price formed a bullish flag after hitting resistance at $2.20.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]