[
  {
    "id": 58260598,
    "published": 1771640464000,
    "title": "Bitcoin's bull catalyst could be AI stocks becoming 'silly big': Lyn Alden",
    "body": "Bitcoin only needs a “marginal amount of new demand” to push higher, according to macroeconomist Lyn Alden, who is watching for a potential peak in AI stocks as a signal.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58261426,
    "published": 1771642844000,
    "title": "Why Bitcoin Could Be Headed For Another Drop: Research Firm Cites Three Key Risks",
    "body": "Bitcoin (BTC) is currently holding below the key $70,000 level. Still, a new report from data and research firm Ecoinometrics suggests that the market may not be building a base for recovery. Instead, the firm argues that the cryptocurrency remains vulnerable to another downward move, driven by three overlapping forces: weakening equity momentum, structural changes in Bitcoin’s volatility profile, and a Federal Reserve (Fed) that is steady but not supportive. Structural Headwinds For Bitcoin According to the report, Bitcoin no longer trades in isolation. It has become increasingly linked to equity markets, capital flows, and broader macroeconomic conditions. At the moment, that linkage is not working in its favor. Bitcoin is already showing signs of weakness, equity markets are losing steam, and the Federal Reserve is maintaining a neutral stance that offers little additional liquidity support. Together, those factors keep downside risks elevated. Related Reading: ‘Sell Bitcoin Now,’ Peter Schiff Warns, Predicts $20,000 Target On Breakdown While Bitcoin has attempted to stabilize in recent weeks, Ecoinometrics cautions that this does not resemble a clear bottoming pattern. Rather, it looks more like a pause within an ongoing bear phase. Structural headwinds are already in place, as highlighted by the firm, including continued outflows from Bitcoin exchange-traded funds (ETFs) and a broader “risk-off” environment in financial markets. The report noted that Bitcoin is trading below its long-term trend, with its 200-day moving average (currently above $100,000) turning downward and rallies repeatedly failing beneath that level — a classic sign of a bearish structure. By contrast, the Nasdaq 100 has stalled for roughly three months, but its 200-day moving average is still rising. That suggests equities are slowing but have not yet entered a confirmed structural downturn. The distinction is important. When Bitcoin weakens on its own, declines can unfold gradually. However, history shows that when equities roll over decisively, Bitcoin tends to fall sharply alongside them. Lower Volatility, Higher Correlation Beyond price action, the firm highlights a deeper structural shift in Bitcoin’s behavior: a marked compression in volatility. In prior cycles, 12-month realized volatility surged dramatically during both bull markets and subsequent crashes. This time, even after a full bear-bull-bear sequence since 2022, volatility has not returned to those previous extremes. In fact, peak volatility in the current cycle has been materially lower. This change reflects who is driving demand. ETF flows now play a dominant role in shaping trends. These flows are typically larger, steadier, and more systematic than the retail-driven surges that characterized earlier cycles. Bitcoin, in other words, has become embedded within institutional portfolios, often sitting alongside technology and growth stocks. That shift brings advantages, including lower volatility and more predictable flow patterns. It may also strengthen Bitcoin’s long-term durability. However, it comes with a trade-off: deeper sensitivity to equity market drawdowns. Ecoinometrics asserts that as BTC becomes more integrated into the broader risk-on complex, it behaves more like a component of that system rather than a detached speculative asset. Downside Risks Grow On the policy front, Ecoinometrics suggests the Fed’s posture remains largely unchanged: inflation has improved but is not fully contained, and the labor market remains resilient. Related Reading: House Democrats Urge Treasury Probe Into Trump Family’s Crypto Venture As a result, rate cuts are not urgent, and rate hikes are not imminent. The communications index sits well below the tightening peak seen in 2022 and far above the crisis-level dovishness of 2020, placing current policy in the middle ground. For Bitcoin, that steady stance removes the risk of a sudden policy shock, but it does not provide a tailwind. The firm said in a fragile market, stability may be preferable to tightening, yet it offers little support if risk assets begin to slide. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|bitcoin technical analysis|btc|BTC news|btc price|crypto|crypto market|crypto news|cryptocurrency",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58262792,
    "published": 1771646406000,
    "title": "Investors In Trump Family Memecoins Record $4.3 Billion In Losses As Tokens Sink",
    "body": "Retail investors of the official TRUMP and MELANIA memecoins have recorded significant losses since their launch, leaving holders absorbing over $4 billion in losses now that the tokens trade more than 90% below their early 2025 highs. Related Reading: Analyst ‘Cautiously Optimistic’ About Dogecoin As Price Rally Stalls Trump Family Memecoins Leave Investors In Red On Friday, a CryptoRank report shared how retail investors have lost billions on the official Trump family memecoins while insiders seemingly pocketed millions of dollars. Over a year ago, President Trump surprised the industry by launching his official token ahead of the start of his second term. The memecoin rapidly skyrocketed to an all-time high (ATH) of $75, bringing massive profits for many early investors. Two days later, the US First Lady, Melania Trump, announced the launch of her memecoin, which quickly surged to an ATH of $13.05 in less than 24 hours. However, the tokens faced significant backlash from the crypto community, with some X users calling the memecoins a “big red flag” as later reports revealed that one of the faces behind the MELANIA memecoin was Hayden Davis, the mastermind behind the LIBRA Token disaster. A year after their launch, the TRUMP and MELANIA memecoins have sunk, collapsing 92% and 99%, respectively, from their January 2025 highs. As of this writing, the token based on the US President trades around $3.55, while the First Lady’s token hovers around $0.11. According to CryptoRank, the damage to retail investors has been staggering, with holders absorbing losses at a 20-to-1 ratio. “For every dollar insiders earned, ordinary investors lost $20,” the report noted. As a result, retail losses have exceeded $4.3 billion from nearly two million wallets currently underwater. Citing data from blockchain analytics firm Chainalysis, CNBC shared that most wallets that lost money held smaller amounts of the token. Insiders And Crypto Exchanges Generate Millions While retail holders bear the losses, CryptoRank highlighted that insiders have cashed out over $600 million through fees and token sales. Notably, 45 wallets extracted approximately $1.2 billion combined, and 58 wallets made more than $10 million each, CNBC data shows. The report also noted that the selloff may not be over, as $2.7 billion in insider tokens that will be locked until 2028 suggests significant selling pressure is still on the horizon for the memecoins. As reported by NewsBTC, a Reuters analysis claimed that crypto exchanges were major beneficiaries of the presidential family’s memecoins, with the TRUMP token generating millions of dollars in revenue for some of the largest exchanges. Based on standard fee estimates compiled by the news outlet, the reviewed crypto platforms allegedly made more than $172 million in trading fees just six months after the token’s listing. Related Reading: SUI Eyes Price Recovery As Institutional Exposure Expands With Grayscale, Canary ETF Launches Meanwhile, the Trump family has also significantly benefited from their main crypto ventures, including World Liberty Financial (WLFI) and the TRUMP and MELANIA memecoins. According to recent Bloomberg data, the official presidential memecoins have generated gains worth roughly $280 million from the family’s holdings and associated proceeds. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto market breakout|crypto market correction|Crypto Whales|Donald Trump|melania memecoin|Melania Trump|retail investors|Trump|Trump family crypto ventures|Trump Family memecoins|Trump memecoin|TRUMPUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 205,
        "NAME": "TOKEN SALE",
        "CATEGORY": "TOKEN SALE"
      },
      {
        "TYPE": "122",
        "ID": 207,
        "NAME": "TOKEN LISTING AND DELISTING",
        "CATEGORY": "TOKEN LISTING AND DELISTING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58264781,
    "published": 1771650006000,
    "title": "Bitcoin Extreme Fear Streak Extends To 22 Days As Price Struggles",
    "body": "Data shows the Bitcoin Fear & Greed Index continues to be inside the extreme fear zone as the cryptocurrency market continues to struggle. Bitcoin Fear & Greed Index Is Still Pointing At ‘Extreme Fear’ The “Fear & Greed Index” refers to an indicator created by Alternative that tells us about the average sentiment present among traders in the Bitcoin and wider cryptocurrency markets. The index uses the data of the following five factors to determine the market mentality: trading volume, market cap dominance, volatility, social media sentiment, and Google Trends. Related Reading: Bitcoin Big-Money Exits: Large-Holder Supply Hits Lowest Since May 2025 When the value of the metric is greater than 53, it means the sentiment shared by the majority of the investors is that of greed. On the other hand, the indicator being under 47 suggests the investors are fearful. Naturally, values lying between the two thresholds indicate the presence of a net neutral mentality. Besides these three main zones, there are also two ‘extreme’ areas called the extreme fear (25 and under) and extreme greed (above 75). Recently, the market has been inside the former of the two. Here is how the latest value of the Bitcoin Fear & Greed Index looks: As is visible above, the Bitcoin Fear & Greed Index has a value of 7, which is pretty deep into the extreme fear zone. In fact, this level of despair is something that the traders have rarely held historically. The Fear & Greed Index has consistently been at similarly low levels during the last couple of weeks, as the below chart shows. Overall, the indicator has been stuck inside the extreme fear territory for 22 straight days now. The recent bad market sentiment is a result of the drawdown that the Bitcoin price has faced. In the past, cryptocurrency markets have often tended to move in the direction that goes contrary to the expectations of the majority. The probability of a contrarian move occurring has generally been the strongest in the extreme sentiment zones as that’s where the crowd is the most sure about the market’s outcome. Given this, the recent extreme fear mentality could help the sector bottom out. The lowest that the metric has gone this cycle is 5, which is similar to the lowest point of the previous bear market. In that bear market, however, the market consolidated and spent more time inside the extreme fear zone even after the low in the Fear & Greed Index, before a bottom was eventually reached. Related Reading: XRP Social Sentiment Hits 5-Week High—BTC, ETH Mood Still Off It now remains to be seen how long Bitcoin and others will take to hit a cyclical low this time around. BTC Price Bitcoin has been unable to make much recovery since its bounce from the $60,000 level as its price continues to trade around $67,700. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin Extreme Fear|Bitcoin Fear & Greed Index|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58266757,
    "published": 1771653636000,
    "title": "Bithumb $43 Billion Bitcoin Blunder Triggers Political Backlash In South Korea",
    "body": "South Korean lawmakers are ramping up pressure on financial regulators after a system failure at Bithumb, the country’s largest cryptocurrency exchange, led to the accidental distribution of more than $43 billion worth of Bitcoin (BTC) earlier this month. The February 6 incident has triggered political scrutiny of both the exchange itself and the agencies responsible for overseeing the virtual asset market. Behind The Bithumb Massive Bitcoin Mishap According to local reporting by The Korea Times, members of the National Assembly are questioning how such a massive error could slip through despite repeated regulatory inspections. Rep. Kang Min-guk of the main opposition People Power Party disclosed that the country’s Financial Services Commission (FSC) reviewed Bithumb three times between 2022 and 2025. Over the same period, the Financial Supervisory Service (FSS) conducted three separate inspections. Yet regulators failed to detect what has now been described as a critical structural weakness in the exchange’s system. Related Reading: ‘Sell Bitcoin Now,’ Peter Schiff Warns, Predicts $20,000 Target On Breakdown Kang argued that existing oversight mechanisms were inadequate. He pointed out that safeguards were insufficient to prevent a situation in which a single employee could initiate massive coin transfers. Kang said: The episode is not merely a technical mishap but a case that lays bare deeper structural weaknesses in the virtual asset market, including complacent supervision and gaps in regulation. Instead of crediting users with Bitcoin worth 2,000 won — approximately $1.38 — the system mistakenly credited 2,000 Bitcoin per user. In total, 620,000 Bitcoin were incorrectly distributed. Rep. Han Chang-min of the minor Social Democratic Party also criticized regulators, questioning whether supervisory authorities had meaningfully evaluated the exchange’s internal systems. “Authorities appeared to be shifting responsibility onto Bithumb despite their supervisory role,” Han said. Broader Crypto Oversight In response to the incident, the FSS extended the deadline for its formal investigation from Feb. 13 to the end of the month, citing the need for additional time. An eight-member inspection team is now intensifying its review, focusing on possible violations related to investor protection and anti-money laundering (AML) compliance. Particular attention is being given to the system architecture that allowed coins not actually held by the exchange to be credited to users. Regulators have not ruled out the possibility that further erroneous distributions could be uncovered. Related Reading: House Democrats Urge Treasury Probe Into Trump Family’s Crypto Venture Separately, financial authorities have reportedly formed an emergency response team in coordination with the Digital Asset eXchange Alliance (DAXA), a self-regulatory body representing domestic exchanges. The team has begun inspections of asset verification and internal control systems at four other platforms — Upbit, Coinone, Korbit, and GOPAX. Any deficiencies are expected to be incorporated into DAXA’s self-regulatory guidelines and could influence the next phase of cryptocurrency legislation in South Korea. At the time of writing, Bitcoin was trading at $67,763, marking a 2% decline over the past seven days and showing minimal change since Thursday’s trading session. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|Bithumb|Bithumb Bitcoin|Bithumb exchange|Bithumb news|btc|BTC news|BTCUSDT|crypto|crypto news|cryptocurrency",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58266848,
    "published": 1771653528000,
    "title": "Uniswap founder slams scam crypto ads after victim 'lost everything'",
    "body": "Uniswap founder Hayden Adams highlighted a case where a victim lost a “mid-six-figure” portfolio to a fake top search result posing as Uniswap.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 53,
        "NAME": "UNI",
        "CATEGORY": "UNI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58268635,
    "published": 1771656945000,
    "title": "Bitcoin miner MARA buys majority stake in AI data center firm Exaion",
    "body": "MARA acquires a 64% stake in French computing infrastructure operator Exaion, expanding into AI and cloud services as Bitcoin miners pivot toward data center revenue.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58274092,
    "published": 1771666780000,
    "title": "Spot Bitcoin ETFs record five weeks of net withdrawals, totaling $3.8B",
    "body": "US spot Bitcoin ETFs logged five straight weeks of outflows, with $315.9 million leaving last week as institutional investors de-risk amid macro uncertainty.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58276218,
    "published": 1771668029000,
    "title": "Bitcoin Trades Below ETF Cost-Basis As MVRV Signals Mounting Pressure",
    "body": "The middle of January marked the continuation of an already struggling price action for Bitcoin, as it took on another sharp downtrend. Early into February, the flagship cryptocurrency seemed to be on a free-fall, even breaching important psychological price levels as it crashed. One of these levels is the cost basis of one of Bitcoin’s most influential investor cohorts – the Bitcoin ETF investors. Data from a recent on-chain evaluation reveals that Bitcoin has since traded underneath this price, and has continued to meet investors with growing heat. Related Reading: Bithumb $43 Billion Bitcoin Blunder Triggers Political Backlash In South Korea MVRV Falls Below 1 — What This Means Market analyst PelinayPA has recently taken to QuickTake to reveal that the Bitcoin price is trading below the average realized price of Bitcoin ETFs, and the possible implications of this market setup. Notably, the ETF MVRV (Market Value to Realized Value) index has also slipped under the 1 mark, reinforcing the agitated situation of most ETF investors. Historically, a sustained move below an MVRV of 1 signals increasing stress conditions within the BTC market, as it reflects an overwhelming dominance of unrealized losses amid an investor group. According to PelinayPA, this condition may cause sell-pressure to heighten, seeing as market participants would increasingly act on their emotions when dealing in the market. As such, short-term recovery attempts are likely to be met with significant resistance (as is currently the case) until the situation sees a turnaround. This is because investors who entered at higher price levels would likely exit their positions at break-even, or even under minimal losses, to avoid deep losses. Because the realized price of Bitcoin ETFs is approximately $80,000, this price region could act as a strong resistance level in the event that the Bitcoin price attempts a rebound. PelinayPA clarifies that if MVRV stabilizes within the 0.8–0.9 range, it could be a sign that the current bear pressure is nearing an exhaustion point; a scenario that could precede a short-term rebound towards the realized price. On the other hand, if the MVRV continues to decline (as the analyst expects), it could be problematic for the Bitcoin price. This is because ETFs would be under significant pressure, which could trigger sell-offs among this investor cohort. This would, in turn, increase downward pressure and further send prices downwards, especially in the long-term. Related Reading: Bitcoin Enters Historic Buying Zone, Indicator Suggests Bitcoin Market Overview As of this writing, Bitcoin trades for $68,000, reflecting a 1.58% growth in 24 hours, according to CoinMarketCap data. Per SoSoValue data, Bitcoin ETFs have recorded a total net outflow of about $1.08 billion in February. This is after an even more staggering net withdrawal figure of $1.61 billion in January. Featured image from Unsplash, chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin ETF Cost Basis|Bitcoin ETF MVRV|cryptoquant|PelinayPA",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58278562,
    "published": 1771675238000,
    "title": "XRP Tipped As Central Bank Bridge Asset — Bigger Than Bitcoin?",
    "body": "A seasoned investor’s bold claim about XRP has reignited a common question in crypto markets: could a token built for fast settlement ever outgrow the original store-of-value? Related Reading: Bitcoin Market Bleeds $1 Trillion, Saylor Signals Strongest Crypto Conviction Yet According to posts on X by longtime Bitcoin backer Pumpius, if central banks adopt a single on-chain bridge, XRP could eclipse Bitcoin “by magnitude.” On-Chain Tension And Policy Moves Reports note recent market moves that have worried policy makers and traders. The trading desk at the Federal Reserve requested indicative dollar/yen quotes after a sharp move in the yen, a step that Treasury officials had asked for. That rare check underlines how currency volatility can push officials to consider new tools, and it has renewed talk about faster settlement rails. Every Central Bank will use XRP as the bridge asset. It’s now becoming a reality. When this happens, XRP will surpass Bitcoin by magnitude. Bookmark this. https://t.co/xyWxhVDCLx pic.twitter.com/kFTsXSw6Hn — Pumpius (@pumpius) February 19, 2026 Ripple’s Timeline And Institutional Talk Based on reports from company briefings and executive posts, Ripple’s leadership sees 2026 as the year when larger, regulated players might put real money onto the XRP Ledger. Ripple President Monica Long has sketched out scenarios where banks and asset managers run production systems tied to on-chain liquidity pools. Those views have been picked up across crypto news outlets and have added fuel to bullish narratives. How Would A Bridge Asset Work? Imagine dollar and euro liquidity on a ledger, available for near-instant swaps. In practice, permissioned pools and regulated stablecoins could provide the rails while an on-chain order book or matching engine handles the trades. Settlement times would be measured in seconds. Audit trails would be automatic. That said, large institutions put a premium on rules and oversight; any real rollout would be gradual and cautious. XRP Vs. BTC: The Size Of The Gap Numbers matter. Bitcoin’s market cap sits comfortably in the trillions, while XRP’s market value is under $100 billion dollars, depending on which tracker you consult. That gap is not small. For XRP to “flip” Bitcoin at present values would require trillions more in capital moving into the token — a shift that would likely need broad institutional flows and major regulatory clarity. Related Reading: Saylor Makes Bold $1M Bitcoin Call — “It’s Zero Or A Million” Geopolitics Adds Noise Geopolitical strain and trade frictions, amplified by speeches or decisions from leaders, can make markets jittery. US President Donald Trump has been named in debates over policy shifts and geopolitical risk, which in turn affect capital flows and safe-haven bids. When politics moves markets, technical fixes such as faster settlement can look more attractive on paper; adoption in practice is another matter. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|bitcoin|btc|crypto|Ripple|Stablecoins|xrp",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58280494,
    "published": 1771678800000,
    "title": "What’s next for crypto in Europe after Christine Lagarde steps down?",
    "body": "ECB president Christine Lagarde is a crypto skeptic, but her likely successors are no more enthusiastic about cryptocurrencies.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58280976,
    "published": 1771679512000,
    "title": "IoTeX confirms ‘suspicious activity’ involving token safe, says losses contained",
    "body": "IoTeX said it is assessing suspicious activity tied to a token safe, coordinating with exchanges to trace funds after analysts linked the incident to a possible private key compromise.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58282425,
    "published": 1771682463000,
    "title": "Bitcoin Quantum Threat Takes Center Stage at Ethereum Conference",
    "body": "At ETH Denver, developers warned that advances in quantum computing could threaten Bitcoin’s digital signatures as the industry continues to debate how to prepare.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58282401,
    "published": 1771682416000,
    "title": "Bitcoin Options Update: Market Panic Fades But Traders Remain Defensive – Details",
    "body": "Bearish sentiments continue to dominate the Bitcoin market as the premier cryptocurrency looks to record a fifth consecutive monthly loss. Presently, prices are consolidating beneath the $70,000 mark, as market bulls struggle to force a decisive breakout above the resistance zone. Amid this choppy price action, data from the Bitcoin options market shows that traders are beginning to expect less volatility but still acknowledge the fragile nature of the market. Related Reading: Why Bitcoin Could Be Headed For Another Drop: Research Firm Cites Three Key Risks Bitcoin Volatility Expectations Drop, Market Panic Fades In an X post on February 20, Glassnode shared its weekly Bitcoin options market update, analyzing the traders’ behavior and sentiment in relation to present market conditions. The market analytics firm reports a notable change in volatility expectations that helps to subside the presently heightened bearish sentiments. According to Glassnode analysts, At-the-money (ATM) implied volatility across maturities has significantly dropped to around 48%, down significantly from recent highs. Because ATM IV reflects the market’s expected move, the decline suggests traders are no longer betting on an immediate price crash. Notably, this shift is reinforced by moves in DVOL, an indicator for measuring aggregate implied volatility expectations. Following initial spikes during the market liquidation in late January/early February, DVOL has fallen by roughly 10 volatility points over the past two weeks, signaling that extreme hedging demand is easing out. In addition, the short-term volatility risk premium (VRP) has turned positive. Earlier this month, one-week VRP plunged to deeply negative levels at -45, as realized volatility far exceeded implied. Since then, implied volatility has repriced higher while realized volatility has stabilized, restoring a premium in short-dated options. Together, these metrics suggest that panic pricing is being reset, and expectations for outsized, volatile moves have declined. Related Reading: XRP Ledger Gets x402 Facilitator For AI Agent Payments: Why This Is Bullish Bitcoin Traders Remain Alert To Downside Despite the cooling in volatility expectations, other metrics show that traders are maintaining a defensive market position. For example, the Put skew, which measures the relative demand for downside protection versus upside exposure, remains quite heightened despite moving off the extreme hedge. After bottoming near the 7 volatility points, the one-week 25-delta skew has rebounded toward 14 vol. The recovery indicates that while extreme fear has subsided, demand for downside insurance remains firm. The taker flow data also tells a similar story. Puts represented two-thirds of last week’s options activity, with outright put buying representing about 34% of total flow. The dominance of protective positioning suggests that market participants are not fully convinced the correction has run its course. In conclusion, the options market is signaling a more measured outlook, where expectations for immediate turmoil have faded, but traders are hedging to hedge against the risk of another downside. At press time, Bitcoin trades at $67,628 following a 0.92% gain in the last 24 hours. More data from Glassnode also shows that Dealers are broadly short gamma across a wide price range between $70,000 and $58,000, a positioning structure that could amplify selling pressure if Bitcoin extends losses. Conversely, a large gamma concentration around $75,000 suggests positioning for a potential rebound. Featured image from Flickr, chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin options|btcusd|BTCUSDT|glassnode|Market Caution|Market Volatitlity",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58282398,
    "published": 1771682400000,
    "title": "Blue Owl liquidity crisis has investors bracing for 2008-style fallout — it could mean bitcoin's next bull run",
    "body": "Private-equity firm Blue Owl Capital (OWL) tumbled nearly 15% this week as it was forced to liquidate $1.4 billion in assets to pay investors looking to exit one of its private credit funds.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58284392,
    "published": 1771686000000,
    "title": "How AI is helping retail traders exploit prediction market 'glitches' to make easy money",
    "body": "A fully automated bot quietly captured micro-arbitrage opportunities on short-term crypto prediction markets, netting nearly $150,000",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Artificial Intelligence|Trading Bots|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 58287812,
    "published": 1771692180000,
    "title": "Bitcoin price slips after Trump hikes worldwide tariff to 15% from 10% despite Supreme Court decision",
    "body": "U.S. President Donald Trump announced a 15% worldwide tariff on imported goods, despite an earlier Supreme Court decision that invalidated earlier trade actions.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Donald Trump|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58290439,
    "published": 1771696815000,
    "title": "Bitcoin Liquidity Battles Heat Up As Demand Shows First Positive Print",
    "body": "Bitcoin remains range-bound as liquidity clears on both sides, keeping price action indecisive. After months of weakness, demand has finally turned positive, hinting that selling is easing and structural accumulation may be returning. BTC Stays Range-Bound Amid Active Liquidity Clearing Bitcoin remains locked in a range-bound state, characterized by a lack of directional commitment. Currently, the price is actively engaged in clearing liquidity on both sides of the spread. This creates a market environment where expansion is met with selling pressure, while price dips are swiftly absorbed by buyers, trapping the asset in a tug-of-war. Related Reading: Thinking Of Buying The Bitcoin Dip? Here’s What This Metric Says According to Columbus, market liquidity remains exceptionally well-defined both above and below the current price levels. This structure reinforces the ongoing choppy environment, as the market seems content to bounce between established pockets of orders. In such a scenario, the data suggests that patience is the most valuable asset for traders. From this juncture, the market’s trajectory depends on how it reacts after the nearby liquidity is purged. If Bitcoin begins to find acceptance above the current range following a liquidity sweep, the probability shifts toward a bullish expansion, triggering a move into higher upside pockets. Conversely, if the attempt to gain acceptance fails after a sweep, the market remains vulnerable to further downside. This could result in additional sweeping of lower liquidity levels before any sustained recovery can materialize. Until then, the prevailing goal remains a technical clean-up of liquidity before the next major trend is established. Bitcoin Demand Turns Positive After Months Of Weakness CryptosRus recently highlighted that after nearly three months of persistent weakness, Bitcoin’s apparent demand has finally turned back above zero, currently sitting around +1,200 BTC. This marks a notable shift in investors’ sentiment and action in a market struggling with heightened volatility. Related Reading: Bitcoin Extreme Fear Streak Extends To 22 Days As Price Struggles Back in December, demand had bottomed near -154,000 BTC, a quantity that helps explain the sluggish price action that persisted in the following weeks. Since then, the pressure has been quietly easing. Selling activity is slowing, and structural accumulation is beginning to re-emerge, signaling a potential shift in market dynamics. It’s important to understand what this metric represents, which is whether long-term holders are absorbing new supply. When demand is deeply negative, the market tends to struggle. Conversely, when the metric turns positive, it suggests that buying activity is rebuilding, creating conditions for a healthier market structure. That said, the market is not out of the woods yet. A single positive print does not confirm a trend reversal. However, if this recovery in demand persists, it is often one of the earliest indicators that the market is transitioning from a distribution phase back toward accumulation, setting the stage for potential sustained strength in the weeks ahead. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin apparent demand|Bitcoin long-term holders|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|Columbus|CryptosRus",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58290490,
    "published": 1771696860000,
    "title": "Iran’s rial collapse mirrors Lebanon’s crisis, driving citizens to bitcoin",
    "body": "With the rial plunging, middle-class savers are bypassing local banks to move billions into the domestic crypto ecosystem.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Opinion|Bitcoin|Opinion",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58291229,
    "published": 1771698161000,
    "title": "US lawmakers critical of Trump tariffs, say it will derail economy",
    "body": "The tariffs are just taxes on American businesses and consumers, while providing no benefit to the economy, critics of Trump's policies say.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 58291174,
    "published": 1771698085000,
    "title": "Japan's SBI to issue 10 billion yen onchain bond with XRP rewards for retail investors",
    "body": "The SBI START Bonds offer a fixed interest rate, blockchain settlement, and XRP rewards for eligible investors registered on the firm’s exchange.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|SBI Holdings|Ripple Labs|XRP News|Bond|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58292505,
    "published": 1771696800000,
    "title": "Bitcoin echoes 'late 2022' bear market bottom, K33 says",
    "body": "The current levels offer an attractive entry for long-term investors, even if their patience will be tested, Vetle Lunde said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|market analysis|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58293213,
    "published": 1771701706000,
    "title": "Ethereum's Vitalik Buterin proposes AI 'stewards' to help reinvent DAO governance",
    "body": "The system would use zero-knowledge proofs and secure environments (MPC/TEEs) to protect voter identity and sensitive data while preventing coercion and bribery.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Web3|Vitalik Buterin|Dao governance|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58295245,
    "published": 1771705263000,
    "title": "'Ethereum Is Going Hard': Vitalik Buterin Backs Censorship Resistance Upgrade",
    "body": "Ethereum developers scheduled a controversial upgrade for later this year. Buterin said it reinforces the network’s cypherpunk principles.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58295810,
    "published": 1771706401000,
    "title": "Crypto market retraces almost all 2024-2025 US election pump gains",
    "body": "The crypto market experienced a historic market crash in October that derailed the uptrend and caused investor sentiment to plummet.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]