[
  {
    "id": 55886861,
    "published": 1765910441000,
    "title": "Cathie Wood's Ark Invest Buys the Dip on Coinbase, Circle and Tom Lee’s Ethereum Giant BitMine",
    "body": "The actively managed ETFs of Cathie Wood's Ark Invest loaded up on crypto-related equities like Coinbase, BitMine, and Circle as prices sagged Monday.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55887558,
    "published": 1765911652000,
    "title": "XRP Price Is Not Going To $100 By End Of Year, ‘You Need A Reality Check’",
    "body": "Despite the recent crash that saw the XRP price fall below $2, many analysts claim that the cryptocurrency could still skyrocket to $100 by the end of the year. However, one expert has thoroughly dismissed these projections, urging investors to temper expectations and warning that those who believe such predictions need a “reality check.” Why XRP Can Never Reach $100 By Year’s End Crypto market expert Zach Humphries has delivered a detailed assessment of XRP, calling out extreme price predictions and overly optimistic expectations, especially during the current downtrend. In a video on X, he warns that claims suggesting XRP will reach $100 by the end of 2025 are unrealistic and potentially misleading for investors and traders. Related Reading: Crypto Analyst Predicts How Low The XRP Price Will Go Before Bouncing Humphries emphasized that while he supports XRP and believes in its long-term potential, the spread of exaggerated price targets in the crypto space is harmful. He explained that many investors assume that owning 100 XRP tokens will make them wealthy quickly, holding on to false hope and unrealistic financial expectations. The analyst points out the need for realism in the crypto space, arguing that viral hype posts and overinflated price forecasts can hoodwink people into making genuine financial decisions that could lead to losses. He noted that investors need to understand market structure and the underlying math behind XRP’s price action before believing in any extreme predictions. Humphries stated a $100 XRP price would imply a $5 trillion market capitalization, surpassing the size of Apple, Microsoft, and even the entire crypto market at some historical peaks. He noted that reaching this seemingly impractical price target would require XRP achieving overnight global adoption, full-scale replacement of existing payment rails, and massive sustained institutional inflows. The analyst also highlighted a common misunderstanding about liquidity. Humphries explained that for XRP to reach $100, it would require substantial global liquidity. He noted that despite XRP Spot ETFs recording over $1 billion in inflows recently, the cryptocurrency’s price did not rise; instead, it declined further. He highlighted that this is because institutional investors prioritize stability, deep liquidity, and predictability over volatile, high-risk payment assets. Although his statements may seem like a critique of XRP’s outlook, Humphries emphasized that the cryptocurrency has genuine strengths, including robust cross-border payment capabilities, strong enterprise relationships, and liquidity. He pointed out that, ironically, the more XRP succeeds as a payment rail, the less explosive its price becomes. Analyst Says XRP Could Still Outperform Many Assets In his video, Humphries stated that XRP has survived many market cycles, making it one of the rare resilient cryptocurrencies. Under the right conditions, he believes that the XRP price could outperform many digital assets, which is why it remains a top altcoin in his portfolio. Related Reading: XRP Price To Reach $27: The Technical Formation That Paints 1,300% Surge The analyst emphasized the importance of realistic growth driven by gradual institutional adoption, ETF integration, regulatory clarity, and steady price increases tied to actual usage and utility. He highlighted that these factors could help XRP perform very well, potentially reaching new all-time highs. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|altcoin|Ripple|xrp|xrp news|XRP Price|XRP Spot ETFs|XRPUSD|xrpusdt|Zach Humphries",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55888627,
    "published": 1765913143000,
    "title": "SEC ends probe into Aave after four years, CEO says",
    "body": "According to a letter posted by the protocol’s founder and CEO, the US agency does “not intend to recommend an enforcement action” against Aave.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55888216,
    "published": 1765912737000,
    "title": "Crypto Lending Protocol Aave Says SEC Has Ended 4-Year Investigation: 'DeFi Will Win'",
    "body": "Decentralized finance lending protocol Aave says the SEC has closed its investigation into the project after four years.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55889550,
    "published": 1765915216000,
    "title": "Bitcoin Under Pressure As Yen Carry Trade Unwind Hits Global Markets",
    "body": "The yen carry trade unwind has been hovering over markets lately — the kind of “plumbing” story that most people ignore right up until volatility spikes and everything suddenly feels connected. Graham Stephan put it into a Bitcoin and crypto-friendly frame yesterday. In a Dec. 15 post, the popular YouTuber described the yen carry trade as Wall Street’s long-running “infinite money glitch” — and argued it’s breaking down just as the Fed is signaling a shift in its outlook for next year. “Wall Street found an ‘infinite money’ glitch 20 years ago. They called it the Yen Carry Trade. It just broke, right when the Fed announced its plans for next year,” Stephan wrote. What The Yen Carry Trade Unwind Means For Bitcoin He presented it as a straightforward trade that scaled because the size was big enough to matter. “For decades, the ‘Yen Carry Trade’ has been the secret engine behind global liquidity. The mechanics were simple enough that a child could understand them, but profitable enough to move trillions of dollars.” Related Reading: Market Stress Continues As Bitcoin STH SOPR Dips Below 1– When Will The Pain End? Stephan then laid out the basic steps in plain English: borrow cheaply in Japan, rotate into higher-yield US assets, keep the spread. “Borrow Cheap: Investors borrowed money in Japan, where interest rates were effectively 0%… Invest Abroad: They took that ‘free money’ and bought US Treasuries paying 4-5%… Profit: They pocketed the difference without using any of their own money.” His argument is that the setup turns toxic when the rate differential compresses and the currency leg moves the wrong way. He framed the timing as especially awkward for risk assets: Japan tightening to support the yen while the Fed eases. “Japan is finally raising rates to save its own currency right at the time when the Fed has started slashing rates. The gap between the rates is getting squeezed. The ‘free money’ isn’t free anymore.” From there, he leaned into the mechanical consequence: when funding gets more expensive and the currency shifts, leveraged positions don’t get a long debate window — they get cut. “As Japanese rates rise, that trade flips. Investors are now being forced to sell their US assets to pay back their Yen loans. Instead of money flowing into the US markets, it is being sucked out to pay debts in Tokyo. This is a massive liquidity drain happening right under our noses.” That’s also where his Bitcoin read comes in. Not “Bitcoin is broken,” but that Bitcoin is where risk appetite and leverage tend to show up early — and where forced selling can look brutal when it hits. Stephan expanded on the same theme in a Substack post, pulling the Fed into the timeline more directly and warning readers to brace for turbulence. “You better get ready for a bumpy ride,” he wrote, claiming the Fed cut rates “for the third time this year,” and that the central bank “has officially ended ‘Quantitative Tightening’ and is quietly moving back toward printing money.” Related Reading: US Bitcoin Session Leads December Returns After Weak November He added a “pilot flying blind” angle as well, arguing the Fed cut “without any inflation data whatsoever” due to shutdown-related disruptions. He attached a specific interpretation of balance-sheet policy, too: “Finally, the most important news of the day: Quantitative Tightening (QT) is over… They even announced they will buy $40 billion of Treasuries over the next 30 days. The tightening era is dead. The ‘stimulus’ era is now being rebooted, and the money printer is being turned on.” Taken together, his thesis ends up with Bitcoin sitting between two forces that don’t necessarily move on the same clock: a potentially sharp deleveraging impulse from carry unwinds, and a slower easing impulse if policy conditions loosen. One can hit price violently in a short window; the other can take time to express itself cleanly. Stephan closed with a familiar Bitcoin-with-training-wheels framing: volatility is normal, drawdowns happen, and mining economics create a reference point. “Bitcoin isn’t broken. It’s just volatile, and this isn’t the first time this is happening. Statistically, Bitcoin has seen drastic crashes of 50% or more, but it has never dropped below its “electrical cost” (the cost to mine one coin), which sits around $71,000 today. If we get close to that number, history suggests it’s a strong buy zone,” he concluded. At press time, BTC traded at $87,082. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|Dollar-Yen Carry Trade",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55889645,
    "published": 1765915200000,
    "title": "3 reasons why trader demand for XRP evaporated: Is $1 next?",
    "body": "XRP fails to find demand under $2 as futures volume on Binance fell by 96% and traders’ use of leverage hits new lows. Is $1 XRP the next stop?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55889724,
    "published": 1765915287000,
    "title": "Bitcoin treasury Kindly MD faces potential delisting after Nasdaq price notice",
    "body": "The company has 180 days to regain compliance with Nasdaq’s minimum bid price requirement after its shares traded below $1 for 30 consecutive business days.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55891023,
    "published": 1765917946000,
    "title": "Zero-Knowledge Tech Is the Key to Quantum-Proofing Bitcoin",
    "body": "We can quibble over the exact timeline, but the quantum future is an approaching certainty, argues Arpa Network CEO Felix Xu. The time to act is now, while we still can.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Opinion|quantum computing|Opinion",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55890938,
    "published": 1765917600000,
    "title": "US senator sounds alarm on DeFi, cites PancakeSwap amid market structure delay",
    "body": "With the US Senate set to break for the holidays, Senator Elizabeth Warren asked Justice and Treasury Department officials to disclose any potential investigations into the DeFi platform.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55891712,
    "published": 1765919383000,
    "title": "RedotPay raises $107M Series B led by Goodwater for stablecoin payments",
    "body": "The company said the funds will support acquisitions, licensing efforts and expanded hiring as it enters new markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55892078,
    "published": 1765920157000,
    "title": "Elizabeth Warren Sounds Alarm on Trump's Crypto Dealings, PancakeSwap",
    "body": "Senator Elizabeth Warren is seeking answers on what she views as the potential national security risks of decentralized crypto exchanges.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55892531,
    "published": 1765920151000,
    "title": "FDIC Approves Thiel-Backed Bank for Deposit Insurance Coverage",
    "body": "The Federal Deposit Insurance Corp. gave the nod for Erebor Bank N.A. to receive deposit insurance coverage, a key step forward for the crypto-oriented lender as the Trump administration further embraces digital assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55893122,
    "published": 1765922431000,
    "title": "XRP Falls Below $2 As $721 Million Profit-Take Hits Market",
    "body": "One of the cleaner tells in crypto is when the old supply decides it’s time. Not “made a quick 20% and clipped it” time — years old. That’s basically what Glassnode researcher CryptoVizArt flagged after an XRP wallet aged roughly 5–7 years (with a cost basis around $0.40) realized more than $721.5 million in profit on Dec. 11. A single wallet doesn’t “break” a market on its own. But the timing is the point: this wasn’t profit-taking into a rip. It landed while XRP was showing weakness right at the $2.0 key level. Related Reading: XRP Dominates Institutional Inflows, But Why Is Price Still Low? CryptoVizArt wrote via X: “On December 11th, a 5-7 year old XRP wallet address (with a cost basis of $0.4) realized over $721.5M in profit! A rare sizable profit-taking while the price shows weakness right at the $2.0 key level.” What This Means For XRP Price That $2 handle matters for the usual reasons — round number, obvious chart magnet, psychological line in the sand — but also because the market’s been treating it like a live wire lately. Since early December last year, the support zone between $2 and $1.90 has been tested endless times. XRP bulls always managed to close above the zone on the weekly timeframe. So what does the $721M print mean? It’s a reminder that supply overhang isn’t theoretical. A 5–7 year wallet taking profits can be read as “de-risking,” sure. But in tape terms, it’s also distribution that the market has to absorb while price is already leaning. If bids are deep, it’s a shrug. If bids are thin, it turns $2 into a trapdoor. And right now, “thin” is kind of the vibe across crypto, not just XRP. Related Reading: Why XRP Isn’t Reacting to Major Institutional and Regional Developments CryptoVizArt’s broader framing from Dec. 13 is that the $80K–$90K Bitcoin consolidation is producing stress “comparable to late Jan 2022.” Via X, he wrote: “The current $80K–$90K consolidation range is generating a magnitude of stress comparable to late January 2022, with Relative Unrealized Loss approaching ~10% of market cap. This places the market in a regime where liquidity is constrained, and sensitivity to macro shocks is elevated, yet still below the levels typically associated with full bear-market capitulation.” That backdrop matters because alts don’t trade in a vacuum. When the whole complex is jumpy, big sell events at key levels have more punch. Not because every XRP holder suddenly panics, but because market-makers and discretionary traders tend to pull risk at the same time. Spreads widen, depth thins, and “one-off” flows start to move price more than they should. Still, it cuts both ways. A single, chunky realization can also be the market clearing a problem — old supply exiting, new demand stepping in, the kind of transfer that (eventually) makes a base sturdier. The trick is whether $2 holds while that handoff happens. At press time, XRP was trading at $1.89, which could make Sunday’s weekly close another extremely important event. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP News|xrp|xrp news|XRP On-Chain Data|XRP Price|XRP price news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55893973,
    "published": 1765924015000,
    "title": "Spot Bitcoin ETFs see $358M outflow: Are investors abandoning BTC?",
    "body": "Bitcoin price held above $85,000, but weakening spot BTC ETF flows and a disappointing end-of-year performance cast doubt on a December rally to $100,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55893745,
    "published": 1765923679000,
    "title": "Bitcoin Treasury KindlyMD Faces Nasdaq Delisting With Stock Down 99%",
    "body": "KindlyMD has been warned of a potential Nasdaq delisting after shares fell below $1. The Bitcoin treasury company has until June 2026 to regain compliance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55894403,
    "published": 1765925087000,
    "title": "Why Bitwise Expects New Bitcoin Highs in 2026—And the End of the 4-Year Cycle",
    "body": "Crypto investment firm Bitwise believes Bitcoin will set a new all-time high price in 2026 and end the typical four-year cycle. Here's why.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55894202,
    "published": 1765924601000,
    "title": "FTC Compels Nomad Operator to Repay Users After $186M Crypto Bridge Hack in 2022",
    "body": "Regulators said Illusory Systems misled users about security and failed to prevent a 2022 exploit that drained the Nomad cross-chain bridge.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 55894812,
    "published": 1765926014000,
    "title": "XRP Liquidity Dries Up: Futures Buy Volume On Binance Falls from $5.8B to $250M",
    "body": "XRP has slipped below the $2 level, a psychologically important threshold, as broader market conditions continue to deteriorate and selling pressure weighs on risk assets. While Bitcoin dominates liquidity and investor attention, altcoins are struggling to attract sustained demand, and XRP is increasingly reflecting this imbalance. Related Reading: Why Bitcoin’s Quiet Price Action May Be ‘Dangerous’ – IFP Signals Rising Structural Risk According to a CryptoQuant report by Darkfost, the weakness in XRP is not an isolated event but part of a broader contraction across the altcoin market. Whether on spot markets or in derivatives, trading activity has been shrinking significantly over recent months. Liquidity is gradually drying up, signaling a clear retreat from speculative positioning as investors reduce exposure to higher-risk assets. This trend is especially visible in XRP’s derivatives data. The Taker Buy Volume on Binance, which tracks aggressive buy orders in futures markets, has collapsed to its lowest levels of the year. After peaking above $5.8 billion in July, this metric has fallen to roughly $250 million, representing a sharp 95.7% decline. Such a dramatic contraction highlights the near-total evaporation of buying pressure and underscores the lack of conviction among traders. XRP Liquidity Compression Signals Downside Risk According to Darkfost, the broader market context is a major factor amplifying XRP’s current weakness. Liquidations have been accumulating across crypto markets, confidence remains fragile, and many participants are still psychologically impacted by the October 10 event. This lingering stress has reduced risk tolerance, particularly among short-term traders who typically provide liquidity during corrective phases. Beyond sentiment, altcoins are facing a clear structural headwind. Bitcoin continues to absorb the majority of available capital, both in spot and derivatives markets. As BTC dominance remains elevated, liquidity that would normally rotate into altcoins during recoveries is instead staying concentrated in Bitcoin. This leaves very limited room for a sustained rebound across the broader altcoin market, including XRP. Related Reading: Market Stress Continues As Bitcoin STH SOPR Dips Below 1– When Will The Pain End? Within this environment, the sharp collapse in XRP’s Taker Buy Volume is not surprising. The signal becomes even more relevant given that it is unfolding on Binance, which still accounts for the largest share of global XRP trading activity. A sustained drop in aggressive buying on the dominant exchange highlights the depth of demand erosion. At the same time, the Taker Buy Sell Ratio has remained negative for most of the period, confirming that sellers continue to dominate XRP’s derivatives market. Historically, such severe volume compression can precede volatility expansions. However, in the current setup, the lack of meaningful buying pressure and persistent bearish positioning suggests downside risks remain elevated. Even ETF-related optimism has failed to offset these structural weaknesses. XRP Price Struggles Below Key Moving Averages XRP price action on the 3-day chart reflects a clear loss of bullish structure and growing downside pressure. After peaking above the $3.40–$3.60 zone earlier in the year, XRP has formed a sequence of lower highs and lower lows, confirming a medium-term downtrend. The recent breakdown below the psychological $2.00 level is particularly significant, as this zone previously acted as both support and consolidation. From a technical perspective, XRP is now trading below its 50-day and 100-day moving averages, both of which have started to slope downward. This alignment reinforces bearish momentum and suggests that rallies are being sold rather than accumulated. The 200-day moving average, currently near the $1.70–$1.80 area, represents the next major structural support. A sustained move toward this level would not be surprising if selling pressure persists. Related Reading: Bitcoin Whales Refuse to Sell: Historic Signal Emerges As Binance CDD Drops To 2017 Levels Volume dynamics further confirm weakness. Since the August high, volume has steadily declined, indicating fading participation and weak dip-buying interest. The sharp volatility spike in October was followed by distribution rather than continuation, often a sign of a local market top. As long as XRP remains below $2.00 and fails to reclaim the declining moving averages, the path of least resistance remains to the downside. For any meaningful trend reversal, XRP would need to regain $2.30–$2.50 with expanding volume, signaling renewed demand rather than short-term relief rallies. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP News|xrp|XRP analysis|XRP Binance|XRP futures|XRP liquidity|xrp news|XRP volume|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55896306,
    "published": 1765929656000,
    "title": "Bitcoin Could Break Records Again In 6 Months, Grayscale Says",
    "body": "According to a Grayscale outlook released Monday, the asset manager expects rising demand for alternatives and clearer rules in the US to push Bitcoin to a new all-time high in the first half of 2026. Related Reading: Ethereum Meets Wall Street: JPMorgan Rolls Out Tokenized Fund The report lays out 10 key investing themes for 2026 and ties the Bitcoin call to two main forces: growing portfolio demand for stores of value and what Grayscale describes as improving regulatory clarity. Spot-Bitcoin ETPs reached the market in 2024, the firm notes, and Congress passed the GENIUS Act in 2025, steps that the report says reduce barriers for big investors. Macro Risks And Demand For Crypto Grayscale frames its outlook around a simple macro point. Rising public debt and the risk that fiat currencies lose buying power are pushing some money toward Bitcoin and Ether, the report says. That argument will sound familiar to many institutional buyers. It is also a broad claim. No exact price targets were offered for Bitcoin, only a view that valuations will climb in 2026 and that the so-called four-year cycle may be ending. Stablecoins are another major theme. Grayscale expects stablecoin use to grow: cross-border payments, collateral on derivatives, even use on corporate balance sheets are all mentioned as likely developments. Asset Tokenization And DeFi Growth Reports have disclosed that Grayscale sees asset tokenization reaching an inflection point next year. Lending protocols and staking are singled out as areas where activity could expand. The firm foresees practical outcomes: stablecoins in payment rails, more institutional access to staking, and tokenized assets showing up in trading and custody systems. Grayscale also flags two narratives it does not expect to move markets in 2026 — quantum computing risk for crypto and digital asset treasuries — saying research will continue but valuations are unlikely to be affected this soon. Related Reading: Analyst: Bitcoin’s Cycle Is Intact, Yet No Longer Purely Market-Driven Over the past 3 months, the average return across nearly all crypto sectors has underperformed Bitcoin. This persistent relative weakness highlights a market environment where capital concentration favours BTC. 📊 https://t.co/rFisuVfSY7 https://t.co/lpXqEe9bbW pic.twitter.com/WNtKEKclX7 — glassnode (@glassnode) December 16, 2025 Onchain Data Suggests Quiet Caution Meanwhile, data from onchain analytics group Glassnode was also cited in this context. Over the last three months, Glassnode reports, the average return across most crypto sectors has underperformed Bitcoin, indicating capital concentration in BTC. That has not translated into strong faith in leadership. A separate institutional feed, Bitcoin Vector, said dominance fell in the second half of the year, with ETH rotations cutting into BTC’s lead and a weaker rebuild after deleveraging events. In short: funds appear to prefer holding Bitcoin, but are not placing big new bets. Featured image from YourStory, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|digital currency",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55896372,
    "published": 1765929780000,
    "title": "Bank of Canada lays out criteria for ‘good money’ stablecoins",
    "body": "Canada’s central bank will approve only fiat-backed, high-quality stablecoins to ensure they are “good money” as part of the country’s plan to modernize its financial system.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 55897803,
    "published": 1765933229000,
    "title": "Bitcoin Bottom Forecast: Top Expert Predicts $40,000 Target Next Year, Here’s The Analysis",
    "body": "Bitcoin (BTC) has been struggling to regain momentum in the market, failing to surpass its nearest resistance level of $94,000 for over a month. The cryptocurrency is currently trading within a broad range between $85,000 and $93,000, leading to growing concerns about further price corrections in the upcoming months. Amid this uncertainty, market expert NoLimit recently expressed on social media platform X (formerly Twitter) that he anticipates Bitcoin could bottom out at around $40,000 sometime in 2026. This forecast implies a significant 54% decline from current levels, which are just above $87,860. A Historical Perspective On Market Cycles NoLimit’s analysis outlines several reasons for this predicted downturn. He points out that Bitcoin has a historical tendency to surprise investors, often when confidence in the market is high. While each price cycle may appear unique on the surface, NoLimit argues that the underlying mechanics remain largely unchanged. He emphasizes the cyclical nature of Bitcoin, noting that it moves within a four-year cycle influenced by liquidity, leverage, and human behavior rather than mere sentiment. According to him, the market is currently late in this cycle, and Bitcoin has consistently followed a three-step process during past upward movements. Related Reading: XRP Price Forecast: Key Factors That Could Propel It To $3 In Early 2026 First, Bitcoin tends to surge in price following the Halving event. This is typically followed by an influx of maximum leverage and late-stage buyers. Finally, the cycle concludes with a sharp and often chaotic reset before the next significant price expansion occurs. Historically, Bitcoin has experienced steep declines during these resets, such as an approximate 85% drop in 2013-2014, an 84% drop in 2017-2018, and a 77% drop during the 2021-2022 cycle. In each scenario, investors were convinced that the conditions were different, yet the outcomes remained consistent. $40,000 As Foundation For Bitcoin’s Next Bull Run Considering the current market situation, NoLimit highlights several critical indicators. He notes that Bitcoin has already seen substantial price appreciation, with institutional interest and exchange-trade fund (ETF) approvals now part of the landscape. He also observes that many traders are over-leveraged, market volatility is compressed, and there exists widespread hope for further price increases. These factors often signal a heightened risk of downside movement in the market. Related Reading: Will Bitcoin Suffer A 20% Decline After Japan’s Rate Hike? Historical Patterns Suggest So A potential drop toward the $40,000 range should not be viewed as an unforeseen disaster, according to NoLimit. He argues that significant price declines have historically preceded major upward movements. Additionally, this price target aligns well with several technical indicators, including previous resistance levels that have turned into support, long-term moving averages, and the liquidity gap created by ETF approvals. Such factors suggest that a move toward this region could exhaust forced sellers and provide a solid foundation for recovery. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin Bottom|Bitcoin news|bitcoin price|Bitcoin price analysis|Bitcoin Price Forecast|bitcoin price prediction|btc|BTC news|BTCUSDT|crypto market|crypto news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55898083,
    "published": 1765933608000,
    "title": "Crypto ETPs to enter ‘cheesecake factory’ era in 2026: Bitwise",
    "body": "The number of crypto exchange-traded products is going to “accelerate forward at ridiculous speed” in 2026, according to Bitwise researcher Ryan Rasmussen.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55898688,
    "published": 1765934887000,
    "title": "Tether leads $8M funding for Lightning startup focused on stablecoins",
    "body": "Speed, which leverages the Bitcoin Lightning Network to facilitate USDT transfers, has secured $8 million from Tether and Ego Death Capital.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55899503,
    "published": 1765936835000,
    "title": "TechCrunch Founder Names XRP Among His Largest Crypto Positions",
    "body": "Michael Arrington, the founder of TechCrunch and CrunchBase, has placed XRP among his largest personal crypto holdings, according to a recent social post. Related Reading: Ethereum Meets Wall Street: JPMorgan Rolls Out Tokenized Fund He listed XRP as one of his top five positions by dollar value, alongside Bitcoin, Ethereum, Solana and Immutable. The disclosure landed plenty of attention online and reignited debate about who is buying what and why. Arrington’s Holdings And Community Reaction Reports have disclosed that his post drew heavy engagement, with replies running the gamut from Bitcoin-only stances to more mixed portfolios. Several industry figures echoed Arrington’s mix; Tony Edward, for example, listed XRP with BTC and ETH when discussing core positions. The debate was loud and fast on social feeds. Some users framed the move as a vote of confidence. Others warned that one investor’s choices do not equal a market-wide shift. Tell me your top five crypto holdings (by total dollar value). Mine are XRP, BTC, ETH and IMX — Michael Arrington 🏴‍☠️ (@arrington) December 13, 2025 Institutional Moves Follow Based on reports, Arrington’s public support is tied to direct institutional activity. In October, Arrington Capital joined Ripple and SBI Holdings to back an initiative by Evernorth aimed at building a large institutional XRP treasury. The project, which has been described in some circles as among the biggest of its kind, aims to increase institutional use of XRP and to support on-ledger activity such as decentralized finance and lending. That involvement means Arrington is more than a vocal supporter; he is also tied to projects that could change how institutions use the token. XRP Market Moves And Key Figures XRP’s market picture has been mixed. As of December 16, 2025, the token was trading around $1.98, having held in a roughly $2.00 to $2.20 band in recent sessions. There was a small daily lift of about 1.2% to roughly $2.08 on Monday, which helped the token cover some ground after early-December weakness. The year has seen bigger swings: XRP peaked near $3.65 in July before giving back some gains. Activity in regulated derivatives has also grown. Reports point to XRP futures on the CME reaching a record open interest of roughly $3 billion in late October 2025, a figure that market watchers say reflects rising institutional appetite for regulated exposure. Related Reading: Analyst: Bitcoin’s Cycle Is Intact, Yet No Longer Purely Market-Driven A Past Claim That No Longer Holds Arrington has previously highlighted XRP’s strong performance. In March, he tweeted that XRP had been the best-performing major asset across multiple time frames — 90 days, 180 days, one year and three years. That claim no longer lines up with current rankings. Performance metrics have shifted since then, and the statement has been overtaken by later results. Featured image from Bitpanda Blog, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|altcoins|bitcoin|crypto|fed|techcrunch|Trump|xrp",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55900046,
    "published": 1765937579000,
    "title": "Aave founder outlines 2026 ‘master plan’ after end to SEC probe",
    "body": "Aave’s 2026 plan focuses on scaling via v4's Hub and Spoke architecture, $1 billion in real-world assets, and growing its new mobile app.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55900627,
    "published": 1765939002000,
    "title": "HashKey's shares fall 5% on debut in Hong Kong",
    "body": "Shares slid on debut as investors questioned whether Hong Kong’s dominant licensed exchange can turn surging volumes and regulatory advantage into sustainable profits.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|hashkey|Hong Kong|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55901439,
    "published": 1765940451000,
    "title": "Cantor Fitzgerald Projects Major Growth For Hyperliquid (HYPE) In Explosive New Report",
    "body": "Cantor Fitzgerald, one of the world’s leading asset management firms, has released an in-depth report highlighting the promising future of the decentralized exchange (DEX) Hyperliquid (HYPE). The 62-page analysis predicts significant growth for both the platform and its native token over the next decade, painting a bullish outlook for investors. Hyperliquid As ‘The Exchange Of All Exchanges’ As detailed in the report, Hyperliquid operates as a decentralized exchange specializing in trading perpetual futures and is built on a custom layer-1 blockchain. Currently, HYPE has a fully diluted market cap of approximately $15.8 billion. Year-to-date (YTD) 2025, the platform has generated an impressive $874 million in fees from a staggering $2.947 trillion in trading volume. Related Reading: Bitcoin Bottom Forecast: Top Expert Predicts $40,000 Target Next Year, Here’s The Analysis A key feature that makes HYPE particularly attractive, and highlighted in the report, is its unique fee structure: approximately 99% of all fees generated by the protocol are allocated to repurchasing and burning the underlying token. This mechanism not only supports the value of HYPE but also reduces its circulating supply. In early 2025 alone, about 2.6% of all HYPE tokens expected to be in circulation, or roughly 5% of the current supply, were repurchased and burned. With the anticipation of new product launches, Cantor Fitzgerald views HYPE as “the exchange of all exchanges” and believes there’s a realistic path for annual fees to soar to $5 billion within the next decade. Why Market Dynamics Favor HYPE When it comes to the platform’s native token, HYPE has successfully captured considerable market share and emerged as one of the standout products in the cryptocurrency space over the past year. In addition to perpetual trading, Hyperliquid has launched spot trading and HIP-3 markets, enabling users to create new markets for a variety of assets including stocks and commodities. Cantor Fitzgerald’s report emphasizes that the immediate determinant of HYPE’s market price will hinge on industry sentiment regarding competition. The ability of emerging rivals to challenge HYPE and affect its fee-generating capacity is paramount. However, the report argues that current fears surrounding competition may be overstated. It posits that “point tourists”—those who shift from platform to platform seeking incentives—are likely to return to the platform offering the deepest liquidity and best execution, which, according to Cantor Fitzgerald, is Hyperliquid. A mere 1% increase in market share from CEX competitors in the perpetuals sector could translate to approximately $600 billion in trading volume. Based on existing perpetual fee rates, this could result in an additional $272 million in annual fees. By applying a conservative 25x valuation multiple to these fees, the potential market capitalization would rise to $6.8 billion. HYPE Price To Reach $271? Assuming moderate share gains over the next decade—projecting around 17% in perpetual trades and 18% in spot trading—Hyperliquid’s annual fees could surpass the $5 billion mark. A conservative valuation multiple of 25x, this would suggest a future market capitalization of approximately $125 billion. Given that nearly all generated fees will be used to repurchase HYPE tokens, a large portion of the circulating supply could potentially be bought back by the time the platform reaches these fee levels. With a forecasted expansion of the fully diluted market cap from roughly $15.8 billion today to $125 billion in the future, combined with a declining supply of HYPE tokens, the projected share price is poised to increase at an even faster pace. Related Reading: XRP Price Forecast: Key Factors That Could Propel It To $3 In Early 2026 If 20% of the Hyperliquid token float is repurchased—valued at around $3.5 billion today—the report suggests that the HYPE price could reach $271 at a fully diluted valuation of $125 billion. The projections suggest that if HYPE captures just 1% of the market share annually and maintains consistent trading volumes from CEXs, the price of HYPE could grow substantially. By year 10, the asset manager believes that circulating supply could decrease from 577.2 million to approximately 144.9 million, while the market cap could remain around $16.1 billion based on conservative fee estimates excluding spot and HIP-3 revenues. At the time of writing, Hyperliquid’s native token is trading at $26.49, having recorded major losses of almost 32% over the past month. This represents a 55% gap from the current trading levels and the all-time high of $59.30. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|Cantor Fitzgerald|crypto news|Hype|HYPE news|HYPE price forecast|HYPE price news|Hyperliquid|Hyperliquid (HYPE)|Hyperliquid news|Hyperliquid prediction|Hyperliquid price|HYPEUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55903514,
    "published": 1765944017000,
    "title": "Why Ethereum Is Chosen As A Settlement Layer For New Money Market Fund",
    "body": "In a significant milestone for the evolution of on-chain finance, a new money market fund has selected Ethereum as its primary settlement layer toward blockchain-native infrastructure for traditional financial products. This decision reflects growing confidence in ETH security, scalability, ecosystem maturity, and qualities that institutional investors and asset managers increasingly demand when moving regulated financial instruments onto public blockchains. How The New On-Chain Settlement Improves Operational Efficiency The largest money whale in institutional finance just made its biggest move by launching a new money market fund on Ethereum, and it’s coming from J.P. Morgan Asset Management. According to an analyst known as Milk Road on X, the company oversees roughly $4 trillion in client assets, and seeds these funds with $100 million of its own capital before opening them up to the public. This fund is called My On-Chain Net Yield Fund (MONY), which is similar to a normal money market fund. Related Reading: Ethereum Emerges As A Dollar Settlement Powerhouse, Outpacing Traditional Payment Networks – Details It is set to hold assets designed to preserve capital and remain liquid. A key difference between the fund and others is that shares are issued and tracked on ETH using JPMorgan’s Kinexys platform. The feature allows the fund to settle faster, issue and redeem shares continuously, and transfer ownership without waiting on the traditional clearing system. Furthermore, this product is limited to large investors, individuals with at least $5 million investments, and institutions with $25 million, including a $1 million minimum to get started. The risk profile and purpose are familiar, and it’s a safe yield for investors. Meanwhile, for JPMorgan, this is a major operational upgrade offering faster cash transactions, tighter integration with treasury systems, and smoother collateral movement. Larger asset managers are starting by moving the safest, most conservative products on-chain first, because that’s where efficiency gains would show up immediately. “Adoption is accelerating,” Milk Road noted. Why Ethereum Is More Than Just Technology According to AdrianoFeria, the world’s greatest misunderstanding of Ethereum is viewing it solely as a technology. AdrianoFeria has pointed out that ETH is a network of economic actors coordinating around shared rules. It is also a social contract and a system that is designed to enable collaboration in the most adverse situations. Related Reading: Here’s Why Ethereum Emerges As The Global Capital Rails For On-Chain Finance At the core, ETH functions as a global and neutral arbitrator. Over time, it has proven itself to be the most long-standing, reliable, and trustworthy neutral arbitrator in the world. This arbitrator is the most valuable aspect of ETH, and any valuable model must account for it to have a chance of estimating realistic ETH price targets. “If you are stuck with a cash flow-centric valuation for ETH, then it is time to sit down and study the system more deeply, and if you believe cash flow explains most of ETH’s value, you haven’t dug deep enough,” the expert mentioned. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|AdrianoFeria|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|ethusd|ETHUSDT|jpmorgan|Milk Road|MONY|My On-Chain Net Yield Fund",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55904068,
    "published": 1765944772000,
    "title": "Why XRP’s drop below $1.93 shifts short-term market structure",
    "body": "The move followed multiple failed attempts to sustain momentum above recent resistance, leaving XRP vulnerable once support levels were tested again.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|XRP News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55904231,
    "published": 1765945133000,
    "title": "DOGE exits range as selling pressure builds at key levels",
    "body": "The $0.1310–$0.1315 zone is now a resistance area, with further downside likely if volume remains high on declines.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55904849,
    "published": 1765945859000,
    "title": "SAFE Crypto Act will have scammers shaking in their boots: Crypto lawyer",
    "body": "Newly proposed legislation could see the US Treasury, FinCEN, the Secret Service, and law enforcement coordinate to catch crypto scammers and fraudsters.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 162,
        "NAME": "SAFE",
        "CATEGORY": "SAFE"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55905899,
    "published": 1765947610000,
    "title": "Bitcoin, Ethereum Plunge Triggers Near-$600 Million Crypto Long Flush",
    "body": "Bitcoin, Ethereum, and other digital assets have witnessed a sharp retrace during the last 24 hours, which has resulted in a long squeeze on derivatives exchanges. Crypto Long Liquidations Have Neared $600 Million During The Past Day According to data from CoinGlass, the latest sharp price action in the cryptocurrency market has accompanied a huge amount of liquidations over at the derivatives side of the sector. Related Reading: US Bitcoin Session Leads December Returns After Weak November “Liquidation” here naturally refers to the forceful closure that any open contract has to undergo after it has amassed losses of a certain degree. For long investors, this happens when the asset’s price drops, while for shorts, liquidation occurs after a surge. How much the cryptocurrency will have to move in one direction to liquidate a specific position comes down to the percentage threshold defined by the platform and the amount of leverage that the trader has opted for. During sharp price swings, positions with high amounts of leverage attached are the first to go. Bitcoin and other assets have faced some notable volatility during the past day, which has once again caught out traders on the derivatives market. As the table below shows, liquidations have crossed $650 million over the last 24 hours. About $584 million of these liquidations involved long positions alone. That’s equivalent to almost 90% of the total, showcasing how disproportionate the price volatility has been during this period. In terms of the individual symbols, the largest contributor to the liquidation event has been Ethereum, not Bitcoin, as is often the case. With over $235 million in contracts involved, Ethereum has notably outpaced Bitcoin, which has witnessed $186 million in liquidations. ETH facing more liquidations is likely due to the fact that its price drawdown has been stronger during the past day. Out of the altcoins, Solana has come out on top with $37 million in positions flushed, ahead of XRP ($16 million) and Dogecoin ($12 million). Interestingly, SOL has outperformed the two despite its losses being more limited. In some other news, the latest Bitcoin decline has meant that its price has fallen back under a key on-chain price level, as the chart shared by analytics firm Glassnode shows. The level in question is the Active Realized Price, corresponding to the cost basis of the active participants on the Bitcoin network. Currently, it’s located at $87,900, which is above the cryptocurrency’s spot price. Related Reading: Cardano SuperTrend Turns Bearish—Last Signal Preceded 80% ADA Drop Thus, it would appear that the latest dip has put the active investors as a whole into a state of net unrealized loss. Bitcoin Price At the time of writing, Bitcoin is floating around $87,200, down more than 3% over the last seven days. Featured image from Dall-E, Glassnode.com, CoinGlass.com, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin liquidations|btc|BTCUSDT|crypto|crypto liquidations|ETH|ethereum|ethereum liquidations",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55905755,
    "published": 1765947310000,
    "title": "Former Theta Executives Accuse Crypto Firm's CEO of Fraud, Retaliation",
    "body": "Two former Theta Labs executives filed whistleblower lawsuits alleging deceptive token practices and retaliation by the company and its CEO.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55907730,
    "published": 1765950242000,
    "title": "Grayscale outlines top crypto investing themes for 2026 as institutional adoption grows",
    "body": "Grayscale says macro demand for alternative stores of value and regulatory clarity are underpinning a sustained crypto bull market heading into 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Macro|Markets|Blockchain Development|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55908355,
    "published": 1765951258000,
    "title": "SEC Wraps Up Investigation Into Aave Protocol, Confirms CEO Stani Kulechov",
    "body": "The US Securities and Exchange Commission (SEC) has officially concluded its investigation into the decentralized finance (DeFi) protocol Aave (AAVE), marking a significant development in the ongoing evolution of regulatory approaches within the cryptocurrency industry. Stani Kulechov, the founder and CEO of the Aave protocol, confirmed the end of the four-year investigation in a post on social media, expressing relief and optimism about the future of DeFi. Aave Founder Celebrates End Of SEC Investigation In his announcement, Kulechov emphasized the considerable effort and resources invested by the Aave team throughout this process. He stated, “We are finally ready to share that the SEC has concluded its investigation into the Aave Protocol.” Highlighting the impact of regulatory scrutiny on DeFi, he added, “This process demanded significant effort… to protect Aave, its ecosystem, and DeFi more broadly.” Related Reading: Will Bitcoin Suffer A 20% Decline After Japan’s Rate Hike? Historical Patterns Suggest So Kulechov expressed hope for a new chapter in which developers can freely innovate and contribute to the future of finance, asserting, “DeFi will win.” This conclusion is notable against the backdrop of heightened regulatory pressure that DeFi projects have faced in recent years. Under the previous SEC chair, Gary Gensler, the agency made a concerted effort to enforce regulations in the crypto space. In 2021, the SEC initiated 19 enforcement actions related to cryptocurrency in just the first nine months. However, recent patterns reveal a substantial shift in the commission’s stance on crypto enforcement. SEC Eases Crypto Enforcement Actions By Over 60% Since President Donald Trump returned to the White House, the SEC has reportedly eased enforcement actions in over 60% of ongoing cryptocurrency cases. A New York Times investigation published recently analyzed thousands of government documents and court records, revealing that the SEC has either dismissed, paused, or reduced penalties for a significant majority of active crypto cases since January 20, 2021. Related Reading: XRP Price Forecast: Key Factors That Could Propel It To $3 In Early 2026 While Trump’s first term saw an average of one high-profile cryptocurrency case per month—including the notable action against Ripple Labs—the current landscape indicates a less aggressive regulatory approach for major players like Binance, Ripple, and Gemini. Following the administration shift, enforcement actions against these companies have either been withdrawn or significantly softened. Paul S. Atkins, the newly appointed SEC chair under the Trump administration, has labeled this regulatory shift a “new day” for the cryptocurrency industry. At the time of writing, the protocol’s native token, AAVE, was trading at $187, having only surged by 1% following the announcement. However, on a year-to-date basis, the AAVE token has seen a significant 52% drop, with prices currently 72% down from the all-time high of $661 reached in May 2021. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|Aave (AAVE)|Aave CEO|AAVE news|AAVE Price|Aave protocol|aaveusdt|crypto|crypto news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 2,
        "NAME": "AAVE",
        "CATEGORY": "AAVE"
      },
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55908353,
    "published": 1765951218000,
    "title": "XRP’s Price Action Sends A Warning Despite Positive ETF Flows",
    "body": "Despite recent positive closes from spot XRP ETFs, the cryptocurrency’s price action is sending a clear warning to traders. Market structure remains weak, and without signs of a confirmed reversal, short-term risks persist. XRP’s current behavior highlights that bullish sentiment from ETFs alone isn’t enough to drive a sustained rally, making caution essential for anyone entering the market. New Year Volatility Hits Crypto Markets Hard Efloud, in a recent update, highlighted that with the start of the new year and continued uncertainty across the markets, cryptocurrencies have once again been among the hardest hit. Low trading volume and a lack of clear direction have kept pressure on the sector, and without an obvious reversal signal, altcoins continue to grind lower day by day. Related Reading: XRP Dominates Institutional Inflows, But Why Is Price Still Low? Given this backdrop, caution remains essential. As emphasized in previous analyses, any attempt to trade against the prevailing trend at support levels should be backed by clear bullish breakout structures on lower timeframes. Without such confirmation, moves higher are more likely to be short-lived reactions rather than meaningful reversals. From a technical standpoint, XRP’s price has now lost the “Daily Imb” zone, weakening the overall structure. If price dips below the most recent swing low and then attracts buying interest, the $1.98 area is expected to act as the first major resistance. As previously noted, the outlook remains negative unless the YO region is reclaimed. Beyond $1.98, another key resistance lies within the red boxed zone. Together, $1.98, the YO area, and the red boxed region form three critical hurdles where price is likely to face selling pressure in the near term. Price Action Still Outweighs ETF Optimism According to Efloud, while spot XRP ETFs have posted positive closes for 18 consecutive days, this development alone does not outweigh what the chart itself is signaling. He emphasized that price action and market structure remain the most important factors. Until these begin to shift in a clearly bullish direction, any purchases are better seen as part of a gradual accumulation strategy rather than a confirmation of a trend reversal. Related Reading: XRP Price Needs To Hold This Macro Support For Hope Of Revival From this perspective, these buys are primarily aimed at averaging down while the market searches for a more stable structure. Efloud added that if market suppression continues and a sharper correction unfolds, the area around $1.53 could emerge as a potential buy zone. However, this scenario depends on broader market behavior and is not a certainty. Finally, the analyst clarified that the $1.53 level was illustrated as a hypothetical example. Efloud warned that entering positions at support zones or key levels without observing clear breakout or reversal structures carries added risk and should be approached with caution. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|altcoins|Efloud|Ripple|Spot XRP ETFs|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55908438,
    "published": 1765950498000,
    "title": "Bitcoin slides with ether and XRP as market tests $3 trillion floor",
    "body": "BTC's weak tone contrasted with moderate gains in major Asian equity indices, which drew strength mostly from expectations of fiscal stimulus.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|XRP News|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55909096,
    "published": 1765952299000,
    "title": "Bitcoin could go ‘sub-$50K if quantum isn’t solved by 2028: Capriole",
    "body": "Quantitative Bitcoin and digital asset fund Capriole says the price of Bitcoin could plummet if the network doesn’t develop resistance to quantum computing.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55910593,
    "published": 1765954858000,
    "title": "XRP Price Must Defend This Level To Avoid 50% Breakdown, Analyst Warns",
    "body": "As the crypto market recovers from the latest pullback, XRP is attempting to climb up from its recent lows. Some analysts have suggested that the cryptocurrency must defend its current levels or risk a 50% drop to levels not seen since 2024. Related Reading: Solana Leads As Most Popular Blockchain Ecosystem For Second Consecutive Year – Report XRP At Make-Or-Break Level Amid the start-of-week market correction, XRP recorded a 6% drop toward its lowest level in weeks. The price lost $2.00 support on Monday morning and continued to lose key levels despite uninterrupted institutional interest. The cryptocurrency has been trading within the $2.00-$2.25 price range over the past month, only losing its lower boundary during the late November pullback. Monday’s correction sent the altcoin below the range’s lower support again, hitting a multi-week low of $1.88 before bouncing around an area that has been crucial for the past year. Notably, XRP has bounced from the $1.85-$1.90 support zone after every major correction since the November 2024 breakout, climbing back above the $2.00 level each time. However, some market observers have suggested that the price risks a significant correction if it is unable to hold the current levels. Ali Martinez pointed out that the cryptocurrency has fallen below its one-year price range, between the $1.92-$3.27 levels, which could lead to a 50% drop below this area. To the analyst, XRP’s price must secure a daily close above $1.92 to prevent a drop to the $1.00 support, which has not been seen in over a year. Similarly, Cheds Trading affirmed that XRP is “flirting with a high time frame breakdown.” Per the chart, the altcoin appears to be forming a high-timeframe rounding top or double top pattern with a higher high. The analyst noted that in the case of the latter, the M formation would be confirmed if the $1.88 level, where the pattern’s neckline is situated, is lost. This could lead to a “measured move to roughly [the] MA 200 area/$1.00 range.” Price Ready For 2026 Markup Phase? Despite the warnings, other market watchers shared a positive outlook for XRP in the coming months. Trader Niels affirmed that the leading altcoin is “looking good” at the current levels. According to the post, the cryptocurrency is “sweeping the $1.8 support zone again” while showing a bullish divergence on the daily timeframe, which suggests that the price could soon move to higher levels. To the trader, once XRP breaks above $2.20 resistance, it could surge 27%-37% towards the $2.80-$3.00 area “within a month.” Meanwhile, analyst ChartNerd highlighted that XRP appears to be repeating its 2023-2024 price action, which led to its massive breakout in November 2024. The chart shows that the altcoin accumulated for a year and a half, bouncing between the range’s lower and upper boundaries before its markup phase in late Q4 2024. Related Reading: XRP Hasn’t Entered A Bear Market Yet; Analyst Shares Why Following this expansion period, the cryptocurrency is showing a similar accumulation range, leading the analyst to suggest that XRP may continue consolidating within its current range before another markup phase occurs. “Regardless of scenarios, or how ugly/beautiful it gets, a massive markup phase similar to November 2024 is likely between now and late 2026,” he stated. As of this writing, XRP is trading at $1.92, a 1.65% increase in the daily timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto analyst|Crypto Bull Run 2025|crypto market correction|Crypto Market Recovery|crypto market volatility|Crypto trader|xrp|XRP analysis|XRP ATH|XRP Price|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55912874,
    "published": 1765958458000,
    "title": "Chainlink’s Top Whales Reverse Course, Quietly Scoop Up $263M In LINK",
    "body": "On-chain data shows the top 100 whales on the Chainlink network have again started accumulating the asset recently, retracing their earlier distribution. Top Chainlink Addresses Have Been Adding Since The Start Of November In a new post on X, on-chain analytics firm Santiment has discussed about the latest trend in the holdings of the top Chainlink addresses. Santiment defines “top addresses” as the 100 largest wallets on the network. Related Reading: Bitcoin, Ethereum Plunge Triggers Near-$600 Million Crypto Long Flush This category would naturally include the largest of whales on the blockchain, who carry some degree of influence due to the sheer size of their holdings. As such, the behavior of these investors may be worth monitoring. Now, here is the chart shared by Santiment that shows how the Chainlink supply held by the top addresses has changed over the last few months: The value of the metric appears to have gone up in recent weeks | Source: Santiment on X As displayed in the above graph, the combined supply of the 100 largest Chainlink wallets witnessed a decline in October, implying that these massive entities were participating in distribution. The selling from the top addresses first began as LINK’s price went through a sharp crash. The selloff continued until the start of November, when the indicator finally arrived at a bottom. Shortly after, the supply of the 100 largest LINK investors saw a reversal, signaling the return of accumulation. According to Santiment, these whales have collectively added 20.46 million tokens (about $263 million) to their holdings. This has not only retraced the October drawdown in their supply, but also in fact taken it to an even higher level. While the top Chainlink addresses have shown net accumulation since the start of November, the pace of buying hasn’t been constant. From the chart, it’s apparent that most of the accumulation occurred in November, with not much coming in December so far. It now remains to be seen what trend the 100 largest LINK investors will show next, and whether it will have any influence on where the cryptocurrency heads next. In some other news, Chainlink recently lost a multi-year technical support line, as analyst Ali Martinez has highlighted in an X post. As is visible in the above chart, Chainlink made two retests of this line during the first half of 2025 and each time, it found support. The retest that occurred after the latest price downtrend, however, ended up in failure, with the asset dropping below this line for the first time since 2023. Related Reading: US Bitcoin Session Leads December Returns After Weak November After the breakdown, LINK attempted to retrace it, but the retest from below also ended in rejection, a potential sign that the support may have flipped into resistance. LINK Price Following its most recent drop, Chainlink is trading around $12.96. Featured image from Dall-E, Santiment.net, charts from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Chainlink|chainlink|Chainlink accumulation|Chainlink Top Whales|Chainlink Whales|Link|linkusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55914734,
    "published": 1765960995000,
    "title": "SEC lawsuit puts Shima Capital’s future in question as wind-down message surfaces",
    "body": "Screenshots of an email shared online purportedly show founder Yida Gao stepping down as managing director of Shima Capital and outlining plans for an orderly wind-down of the fund.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 55915325,
    "published": 1765962047000,
    "title": "Crypto Exchange Hashkey’s Shares Flat In Hong Kong Trading Debut",
    "body": "Backed by Chinese billionaire Lu Weiding, Hashkey’s $207 million Hong Kong IPO comes amid market volatility, with bitcoin sinking to an eight-month low.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Asia|/asia|Asia|/asia|Business|/business|Forbes Digital Assets|/digital-assets|Money|/money|Markets|/markets|Editors' Pick|editors-pick|premium",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 55916594,
    "published": 1765963848000,
    "title": "The Bearish Structure That Puts Bitcoin Price At $92,550, And Then $82,000",
    "body": "Struggling under the weight of notable selling pressure, the Bitcoin price has since lost its hold on the $90,000 support, leading to a sustained downtrend through the middle of December. Despite calls for a bottom, the cryptocurrency does not seem to be heading in that direction, and some analysts have shared reasons as to why this is the case. Crypt analyst Lingrid maps out the trajectory of the Bitcoin price, showing a bullish short-term, but ultimately ending with more declines. Why The Bitcoin Price Could Crash Further Lingrid’s analysis focuses on Bitcoin’s recent price performance, having hit resistance multiple times above the $92,000 level. This comes as the digital asset is “capped below channel border,” something that is inherently bearish for the price, given the recent price action. Related Reading: Crypto Analyst Predicts How Low The XRP Price Will Go Before Bouncing The rejections between $92,500 and $93,500, according to the analyst, show that the Bitcoin price is likely to place in lower highs. Thus, even in the event of a recovery trend, this level still remains a significant roadblock to any rally. Furthermore, the crypto analyst adds that the recent slowdown in the Bitcoin price action has pushed it into a tight compression. With the price still sitting above the rising support line while this happens, Lingrid believes that this shows Bitcoin is entering into a state of equilibrium, and not strength. Usually, this means that the Bitcoin price could be headed for “directional expansion.” Presently, all eyes are on the bears and sellers as the Bitcoin price struggles to hold support. There is still the possibility that the price will rise to $92,500 before facing a rejection. In this scenario, it would trigger further decline toward $82,000 to put in lower lows. Related Reading: Can Bitcoin Price Still Hit $140,000? What The Global M2 Money Supply Says There is also the possibility that the digital asset does escape this bearish scenario, but the buyers would have to step back in the ring. Mainly, the Bitcoin price must break out and then hold above the channel, sustaining a move above $92,500. If this plays out, then Lingrid believes that the bearish thesis could be invalidated. Such a case would mean that the Bitcoin focus shifts back toward $100,000. However, with the price currently trending below $90,000 and sentiment being mostly negative, the chances of an invalidation remain slim. Featured image from Dall.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55916170,
    "published": 1765963066000,
    "title": "Hyperliquid governance vote aims to permanently sideline $1B Assistance Fund",
    "body": "The proposal seeks a binding social consensus that the funds will never be accessed through future protocol upgrades.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 206,
        "NAME": "FORKS",
        "CATEGORY": "FORKS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55917832,
    "published": 1765965418000,
    "title": "Bitcoin institutional buys flip new supply for the first time in 6 weeks",
    "body": "Bitcoin buying power from institutions flipped the daily mined BTC supply for the first time since the start of November, new data showed.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55920262,
    "published": 1765961514000,
    "title": "Memecoin boom turns into capitulation one year after $150 billion market peak",
    "body": "Daily memecoin volume slumped to just under $5 billion this month after surging more than 760% to near $87 billion in 2024 as interest in the pop-culture crypto tokens evaporated.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Markets|memecoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55921607,
    "published": 1765971000000,
    "title": "Crypto Markets Today: Bitcoin drifts lower as bearish trend persists",
    "body": "Bitcoin slipped overnight, dragging the broader crypto market lower as traders remained cautious with few external cues to provide direction.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|Derivatives|Markets|market analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55921421,
    "published": 1765970682000,
    "title": "How China’s strengthening yuan could support bitcoin prices",
    "body": "The yuan has rise to its highest in over two months against the dollar.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|China|Yuan|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55922903,
    "published": 1765972852000,
    "title": "5,606 Bitcoin: Lightning Network Sets Fresh Capacity Record",
    "body": "Lightning Network capacity hit a new high this week as major exchanges put more Bitcoin into off-chain channels, boosting the network’s total liquidity and changing how users move BTC. Related Reading: Ethereum Meets Wall Street: JPMorgan Rolls Out Tokenized Fund Exchange Support Drives Capacity According to reports, the Lightning Network’s public capacity climbed to about 5,606 BTC, with some trackers briefly showing a peak near 5,637 BTC. That is a clear uptick from earlier levels and marks the highest recorded total so far. Exchanges including Binance and OKX have been named as contributors that added Bitcoin to Lightning channels, and other platforms such as Kraken and Bitfinex are expanding their support as well. These deposits are aimed at speeding up deposits and withdrawals and cutting fees for customers. Network Activity Vs. Public Nodes Based on reports, that increase in capacity has not been matched by a big rise in the number of public nodes or channels. Public node counts sit near 14,940, while public channels are roughly 48,678. In other words, more Bitcoin is available inside the network, but the number of hands handling traffic has not jumped in the same way. Some of this extra liquidity is concentrated in larger, custodial channels run by exchanges, which can move big sums without creating many new public routes. That makes on-chain metrics a bit harder to read. Transaction counts and on-chain fee savings do show real user benefits, even when the node graph looks stable. A separate figure that shows real usage is the share of exchange traffic routed over Lightning. Based on reports, one exchange has routed around 15% of its Bitcoin transactions via Lightning rails after adopting Lightning integrations, pointing to meaningful operational changes at major platforms. New Use Cases And Funding Funding and protocol work are following capacity growth. Tether led a round that raised about $8 million for a startup focused on payments over Lightning, indicating interest in stablecoin flows on the network. Announcing Taproot Assets v0.7, now with reusable addresses, a fully auditable asset supply, and larger, more reliable transactions. ✅ With this release, we are laying the foundation for trillions of dollars to flow on bitcoin and Lightning. 💸 Read more below. Upgrade today! — Lightning Labs⚡️🌐 (@lightning) December 16, 2025 Protocol upgrades — including work around Taproot-related asset handling and reliability improvements — are also being rolled out to support more varied payments and token types. These developments point to Lightning being used for things beyond tiny tips: remittances, merchant payments, and stablecoin transfers are being tested more widely. Related Reading: TechCrunch Founder Names XRP Among His Largest Crypto Positions Market watchers say this mix of exchange liquidity, developer upgrades, and rising on-platform usage could make Lightning a more practical rail for everyday BTC movement. Some critics warn that heavier reliance on custodial channels raises centralization risks and reduces the visibility of true peer-to-peer routing. Others note that improved user experience, lower costs, and faster finality are what ordinary users will notice first. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|Lightning network",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 206,
        "NAME": "FORKS",
        "CATEGORY": "FORKS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55923368,
    "published": 1765973561000,
    "title": "Norway's sovereign wealth fund supports Metaplanet bitcoin plan ahead of EGM vote",
    "body": "Norges Bank, which holds a 0.3% stake in Metaplanet voted in favor of for all five proposals ahead of the Dec. 22 EGM.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|MetaPlanet|Bitcoin News|Norway|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55923295,
    "published": 1765973349000,
    "title": "Indian MP Pushes Tokenization Bill to Democratize Investment Access for the Middle Class",
    "body": "A new parliamentary push seeks to use tokenization to open high-value assets to India’s middle class through blockchain-based ownership.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 55923391,
    "published": 1765973320000,
    "title": "Bitcoin price at ‘critical’ point as whale moves $348M BTC to exchanges",
    "body": "A whale moved 4,000 Bitcoin to Binance, sparking fresh fears of a deeper BTC price drop if the $81,500 support level is lost.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55924115,
    "published": 1765974546000,
    "title": "Solana tests quantum-resistant transactions in new Project Eleven pilot",
    "body": "Solana has partnered with a post-quantum security company to test quantum-resistant technology on a Solana testnet, claiming to offer a scalable end-to-end solution.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55923759,
    "published": 1765973871000,
    "title": "CAR’s crypto push fueled ‘state capture’ by elites, criminal networks: Report",
    "body": "A new report warns that the Central African Republic’s crypto push favored elites and exposed the country to foreign criminal networks, rather than boosting financial inclusion.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55925349,
    "published": 1765976400000,
    "title": "Moon Pursuit Capital launches $100 million market-neutral crypto fund",
    "body": "The new quantitative vehicle aims to deliver risk-managed returns across crypto market cycles as the firm readies a global expansion push.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Crypto Hedge Funds|Exclusive|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55925350,
    "published": 1765976400000,
    "title": "Wall Street giant DTCC Picks privacy focused blockchain Canton Network for tokenization",
    "body": "Canton creator Digital Asset will help tokenize DTC-custodied U.S. Treasury securities.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|DTCC|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55924999,
    "published": 1765975945000,
    "title": "Securitize to offer first fully onchain trading for real public stocks in early 2026",
    "body": "The platform offers full legal ownership, with shares issued and recorded onchain, and provides real shareholder rights and self-custody.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Securitize|Tokenized Equity|Tokenization|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 55925779,
    "published": 1765976844000,
    "title": "Bitcoin miner Hut 8 lands $7B Google-backed AI data center lease",
    "body": "The 15-year agreement anchors Hut 8’s shift toward long-duration AI infrastructure revenue as hyperscalers seek power-first compute capacity.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55925519,
    "published": 1765976400000,
    "title": "Wall Street’s $4 quadrillion backbone to roll out tokenized US Treasurys",
    "body": "The SEC gave DTCC the green light to launch a tokenization service last week, and the company will be starting by minting US Treasurys on Canton.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 55926652,
    "published": 1765978247000,
    "title": "Analyst Who Predicted The Bitcoin Price Top Reveals The Next Buy Level",
    "body": "Crypto analyst Doctor Profit has revealed the next Bitcoin price level he is looking to accumulate at in anticipation of a relief rally. Despite plans to buy BTC, the analyst indicated that he is still bearish on the flagship crypto in the long term, with a larger decline expected to unfold. Analyst Reveals The Next Buy Level As Bitcoin Price Eyes Bounce In an X post, Doctor Profit stated that he is buying BTC around $86,000 as he looks to trade a short-term relief bounce. He reiterated that he sees the probability of the Bitcoin price revisiting the $97,000 to $107,000 region before the next major leg lower unfolds. The analyst added that this projected move is a 20% from the current region, which presents a good risk-reward trade with a tight stop loss. Related Reading: Analyst Shares Full Technical Bitcoin Price Breakdown – Here’s The Target Doctor Profit is known to have predicted the Bitcoin price top when it was trading at around $126,000. The analyst noted that he remains very bearish in the long term, expecting further declines. As such, he plans to play this move to buy BTC with absolute and the highest form of risk management. The analyst explained that this means he will ensure to place the stop loss at entry once in solid profit, while his short trade from between $115,000 and $125,000 will still be running. Doctor Profit further remarked that this long setup for the Bitcoin price is aimed at a few weeks only, before the bearish price action resumes with lower targets. BTC Remains “Extremely Unstable And Bearish” Doctor Profit stated that the Bitcoin price remains extremely unstable and bearish for the mid-term, noting that a strong downside continuation can happen at any moment, even before the flagship crypto reaches the projected $97,000 to $107,000 zone. The analyst added that a deeper and faster sell-off is absolutely possible, so those looking to buy now should take extreme caution. Related Reading: Can Bitcoin Price Still Hit $140,000? What The Global M2 Money Supply Says Doctor Profit reiterated that his short positions remain fully open, as any upside is treated as distribution and liquidity for the next leg down. The analyst noted that the $70,000 region remains the main target. If the Bitcoin price manages to revisit the $97,000 to $107,000 region, he stated that he would fully take profit again on the position and add the profits to his short position. In the meantime, crypto analyst Ali Martinez has warned that the Bitcoin price needs to hold the $87,000 region or risk dropping to as low as $70,000. BTC is currently on the edge with Japan set to raise its interest rates this week. At the time of writing, the Bitcoin price is trading at around $86,600, up in the last 24 hours, according to data from CoinMarketCap. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|Ali Martinez|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btcusd|BTCUSDT|CoinMarketCap|Doctor Profit",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55926450,
    "published": 1765977696000,
    "title": "Binance names alleged fake listing agents, offers up to $5M whistleblower reward",
    "body": "Binance has warned users to avoid token listing agents at all costs, offering up to $5 million to whistleblowers reporting listing fraud.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 207,
        "NAME": "TOKEN LISTING AND DELISTING",
        "CATEGORY": "TOKEN LISTING AND DELISTING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55927292,
    "published": 1765979100000,
    "title": "Uniform Labs’ Multiliquid targets structural gap in $35 billion tokenized asset market",
    "body": "The new protocol offers instant swaps between tokenized money market funds and stablecoins as regulators scrutinize yield-bearing stablecoin models.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Tokenization|Stablecoin|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55928010,
    "published": 1765980000000,
    "title": "Agentic Brokerage Viral Launch Signals Trouble For Incumbents",
    "body": "Public's agentic brokerage announcement drew a flood of customers from Schwab and Fidelity. The switching costs that protected incumbents are evaporating thanks to AI.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55927748,
    "published": 1765979763000,
    "title": "Hut 8 stock surges 20% on Fluidstack AI data center deal",
    "body": "The bitcoin miner deepened its pivot into AI infrastructure with a $7 billion long term lease backed by Google.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Hut 8|AI|Bitcoin News|Google|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55928101,
    "published": 1765980000000,
    "title": "New protocol targets redemption delays in $20B tokenized market",
    "body": "Uniform Labs’ Multiliquid aims to bridge the gap between tokenized funds and stablecoins, targeting liquidity constraints that have slowed institutional adoption.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55929065,
    "published": 1765981537000,
    "title": "Bitcoin Traders Brace for Bank of Japan Rate Hike Amid Crypto Sell-Off",
    "body": "The Bank of Japan's expected rate hike to a 30-year high could unwind the yen carry trade, draining liquidity from risk assets like Bitcoin.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55929037,
    "published": 1765981414000,
    "title": "Securitize announces ‘real’ tokenized stocks, touts DeFi integration",
    "body": "Securitize plans to launch compliant, natively tokenized stocks in early 2026, enabling real equity ownership to trade 24/7 fully onchain.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55928846,
    "published": 1765981119000,
    "title": "Solana TVL hits $8.6B six-month lows: Is $80 SOL price next?",
    "body": "SOL price traded 52% lower than its $255 highs reached on Sept. 18, as onchain data and a bearish pattern suggested that SOL investors risked further losses.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55930506,
    "published": 1765983600000,
    "title": "Most Influential: Caroline Pham",
    "body": "As an acting chairman at the Commodity Futures Trading Commission, Caroline Pham pulled no punches in pursuing crypto-friendly policy aims.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|CFTC|Caroline D. Pham|CoinDesk Most Influential 2025|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 16,
        "NAME": "COMMODITY",
        "CATEGORY": "COMMODITY"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 55930507,
    "published": 1765983600000,
    "title": "Most Influential: Carlos Domingo",
    "body": "The Securitize CEO ground through the uncool years of tokenization while NFTs, FTX and memecoins soaked up the hype. With billions in tokenized assets, a SPAC listing in the works and BlackRock as a flagship client and backer, Carlos Domingo’s early bet is finally paying off.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Real World Assets|Tokenization|Carlos Domingo|CoinDesk Most Influential 2025|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55930510,
    "published": 1765983600000,
    "title": "Most Influential: Jeremy Allaire",
    "body": "Allaire spent 2025 pushing regulated digital dollars into the mainstream, shaping U.S. policy and unveiling Arc as the foundation for institutional blockchain finance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Circle|Tether|CoinDesk Most Influential 2025|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55930343,
    "published": 1765983334000,
    "title": "Did Bitcoin's 4-year cycle break, and is the bull market really over?",
    "body": "Bitcoin ETFs, corporate treasuries, and macro tailwinds are challenging BTC’s traditional four-year cycle, which could result in new all-time highs in 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55930249,
    "published": 1765983266000,
    "title": "Gavin Newsom Singles Out CZ, Ross Ulbricht, Arthur Hayes as Trump's 'Criminal Cronies'",
    "body": "The California governor has launched a new website taking aim at Trump’s presidential pardons, including those of crypto figures.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55931730,
    "published": 1765985297000,
    "title": "Central African Republic’s Crypto Experiment ‘Riddled With Red Flags,’ Says Report",
    "body": "The Global Initiative against Transnational Organized Crime said that the CAR president’s embrace of crypto has offered few benefits.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55931250,
    "published": 1765984742000,
    "title": "Bitcoin re-takes $90,000 as price spikes early in U.S. session",
    "body": "Surging metals prices and dovish comments from leading Fed chair contender Chris Waller were among the news items possibly boosting crypto prices.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Market Wrap|Bitcoin News|Gold|Breaking News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55932243,
    "published": 1765986100000,
    "title": "Bitcoin shorts scramble for the exits as BTC climbs",
    "body": "Bitcoin surged from an intraday low near $86,200 to reclaim $90,000, driven by aggressive spot buying and a wave of short liquidations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|open interest|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55931972,
    "published": 1765985803000,
    "title": "Hut 8 and Coinbase outperform as Crypto stocks jump on bitcoin's sudden rally",
    "body": "Mining stocks, trading platforms, and cryptocurrency infrastructure firms saw significant gains, including Hut 8, Riot Platforms, and Coinbase.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Coinbase|Stocks|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55932966,
    "published": 1765987228000,
    "title": "Russia Draws Firm Line on Digital Assets, Keeping Crypto Out of Domestic Payments",
    "body": "Russia has reiterated its firm stance on crypto, drawing a clear distinction between digital assets and traditional currency. While global debate continues over whether crypto can coexist with national currencies, Russian lawmakers are reinforcing a long-held view. Related Reading: Bitcoin ‘Death Cross’ Panic Returns: History Says It’s A Late Signal Inside the country, payments remain the sole domain of the ruble. The position comes as crypto usage grows worldwide and as Russia experiments with alternative settlement tools for cross-border trade under pressure from sanctions. At the center of the latest comments is Anatoly Aksakov, chair of the State Duma Committee on Financial Markets and a key figure behind Russia’s crypto legislation. Speaking to state media, Aksakov said there is no ambiguity in the law. BTC's price records some gains on the daily chart. Source: BTCUSD on Tradingview Lawmakers Reinforce Ruble-only Payment Rule In Russia, cryptocurrencies such as Bitcoin and Ethereum can be held or traded as investments, but they are not permitted to function as a means of payment in domestic commerce, according to lawmaker Anatoly Aksakov. All payments for goods and services must continue to be settled in rubles. Aksakov’s remarks restate provisions introduced in Russia’s 2020 digital assets law, which removed cryptocurrencies from any form of legal tender. Lawmakers argue that money must be issued and controlled by the state, and private digital currencies do not meet that standard. Officials say there are no plans to soften this stance. The rule applies across retail, online services, and business contracts, closing the door on crypto payments regardless of adoption trends or market conditions. Central Bank Skepticism Shapes Policy The Bank of Russia continues to play a decisive role in this approach. Governor Elvira Nabiullina has long warned that cryptocurrencies pose risks to financial stability and consumer protection. The central bank has consistently opposed using crypto as a medium of exchange and has previously pushed for broad restrictions on exchanges and transactions. This position has led to years of friction with the Ministry of Finance, which favored regulation and taxation over outright limits. While several legislative proposals emerged from that debate, none altered the core prohibition on crypto payments. Today, policymakers appear to be aligned in preserving the ruble’s monopoly. Cross-Border Use Grows Despite Domestic Ban Although crypto is barred from internal payments, Russian authorities acknowledge its growing role in international trade. Businesses are permitted to use digital assets for cross-border settlements under an experimental legal regime, a workaround that has gained traction amid global financial restrictions. Officials estimate that billions of dollars’ worth of trade has already moved through such channels. Similarly, Russia has legalized cryptocurrency mining and is tightening oversight of the sector, underscoring a split strategy, limited use abroad, and strict control at home. Related Reading: The Bearish Structure That Puts Bitcoin Price At $92,550, And Then $82,000 That divide alone defines Russia’s crypto policy. Digital assets may serve as investment tools or external settlement instruments, but inside the country, the ruble remains the only means of payment. Cover image from ChatGPT, BTCUSD chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|btc|btcusd|crypto",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55932712,
    "published": 1765986749000,
    "title": "Bitcoin Miner Hut 8's Stock Soars After Inking $7 Billion Google-Backed AI Deal",
    "body": "Publicly traded Bitcoin miner Hut 8 inked a $7 billion data center deal with Google's financial backing, sending shares soaring Wednesday.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55933465,
    "published": 1765987917000,
    "title": "Bitcoin tumbles back below $88,000 as gains evaporate as quickly as they formed",
    "body": "It was a blink and you missed it rally as continued deflation in the AI trade sent the Nasdaq sharply lower, dragging crypto along with it.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Breaking News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55933491,
    "published": 1765987897000,
    "title": "Singapore Entrepreneur Loses Entire Crypto Portfolio After Downloading Fake Game",
    "body": "The malware downloaded by Mark Koh was able to steal wallet credentials without his browser wallets being open.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      }
    ]
  },
  {
    "id": 55933373,
    "published": 1765987850000,
    "title": "Robinhood looks better placed than Coinbase for prediction-market upside, Mizuho says",
    "body": "Robinhood stands to gain more from prediction markets than Coinbase as users plan to deploy fresh capital rather than sell existing crypto, the bank said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Robinhood|Coinbase|Prediction Markets|Mizuho|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55933138,
    "published": 1765987405000,
    "title": "Macquarie sees U.S. Senate near crypto deal as market structure, GENIUS rules advance",
    "body": "The bank said bipartisan Senate talks on market structure legislation and parallel GENIUS Act rulemaking could deliver a workable U.S. crypto framework by early 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Stablecoins|Cryptocurrency Regulations|Market Structure Legislation|Macquarie|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55933918,
    "published": 1765988575000,
    "title": "DTCC Handles $3.7 Quadrillion in Transactions a Year—Now It's Tokenizing Treasuries on Canton",
    "body": "DTCC unveiled plans to issue tokenized securities on Canton Network, the privacy-enabled blockchain built for financial institutions.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      }
    ]
  },
  {
    "id": 55933814,
    "published": 1765988445000,
    "title": "The Protocol: Bug that can drain all your tokens impacting 'thousands' of sites",
    "body": "Also: Ripple news, Aave protocol debate, and pudgy penguins takeover",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Tech|Newsletters|The Protocol|Bug|Aave|Ripple|Pudgy Penguins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 2,
        "NAME": "AAVE",
        "CATEGORY": "AAVE"
      },
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55935570,
    "published": 1765990832000,
    "title": "Saylor’s Long Bitcoin Bet Has Left Corporate Rivals Behind: Crypto Entrepreneur",
    "body": "Michael Saylor’s firm Strategy continues to make Bitcoin headlines with its enormous purchases, making it one of the largest holders in the world. Related Reading: TechCrunch Founder Names XRP Among His Largest Crypto Positions Reports show the company owns 671,268 Bitcoin, roughly 3.2% of the total supply, valued at about $58.61 billion at the time of publication, according to Saylor Tracker. Bitcoin entrepreneur Anthony Pompliano said on his podcast that it would be extremely difficult for any other public company to match Strategy’s buying pace. Massive Holdings And Recent Purchase Strategy announced a fresh buy of 10,645 Bitcoin for $980.3 million, paying an average of $92,098 per coin. That move pushed its total hoard to roughly 3.2% of all Bitcoin in existence. Those are large figures. They also show why rivals would need huge sums to close the gap. Pompliano On The Scale Needed To Compete According to comments made on The Pomp Podcast, Pompliano said that a company trying to match Strategy would have to “raise hundreds of billions of dollars.” He said it would be “very hard to see that happening.” He pointed to Strategy’s early entry in 2020, when Saylor’s initial purchase was about $500 million while Bitcoin traded between $9,000 and $10,000. That initial stake, based on current prices cited in reports, is now worth more than $4.8 billion with Bitcoin trading around $86,950. Market Impact And Buying Method Market watchers have flagged Strategy’s growing share as something to watch. Some worry a single large holder could influence price moves. Others note the firm does most of its buying through over-the-counter desks. OTC trades are used to handle big orders without sending shockwaves through exchange order books. Many investors see the regular, large purchases as a positive sign for Bitcoin demand. Holding Strategy And Influence Concerns Pompliano described 3.2% as “a big number, but it’s also a small number.” He added, “It’s not like they own 10%.” That view captures a split: the holding is large enough to matter for supply dynamics and market psychology, but not so large that it gives absolute control. Still, the combination of size and repeated buys draws attention from traders and regulators alike. Outlook And Long Term Plans Reports quote Strategy’s CEO Phong Lee as saying the company probably won’t sell any Bitcoin until at least 2065. Saylor has also posted that he plans on “buying the top forever.” Those statements reinforce a long-term stance rather than short-term trading. The market tends to treat such commitments as bullish, and many participants adjust expectations for future demand accordingly. Related Reading: Ethereum Meets Wall Street: JPMorgan Rolls Out Tokenized Fund A Dominant Buyer With 671,268 Bitcoin on the books and a steady program of purchases, Strategy remains a dominant public buyer. Based on current numbers and public comments, it will be difficult for another listed company to match that level of accumulation without very large capital raises or a dramatic change in corporate behavior. The pace set by Strategy is likely to keep drawing attention from investors watching supply and demand for Bitcoin. Featured image from Pexels, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|Anthony Pompliano|btc|btcusd|crypto|Michael Saylor|Strategy",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55935178,
    "published": 1765990268000,
    "title": "Crypto stocks pare gains as bitcoin retreats from $90,000 rally",
    "body": "Crypto-linked stocks pulled back, with miners like MARA Holdings (MARA) down 4.8% and Core Scientific (CORZ) down 6%.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Hut 8|Crypto Stocks|Coinbase|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55935878,
    "published": 1765991178000,
    "title": "XRP falls 5% as bitcoin’s sudden pump and dump rattles crypto markets",
    "body": "XRP's price action now faces resistance at the former support levels, with $1.90 as the immediate line of defense.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55936847,
    "published": 1765992480000,
    "title": "Polkadot's DOT drops 3% to $1.83 as crypto markets reverse lower",
    "body": "Strong selling pressure overwhelmed positive Coinbase integration news as the psychological $1.90 level failed to hold.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Polkadot|Technical Analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 21,
        "NAME": "DOT",
        "CATEGORY": "DOT"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55936560,
    "published": 1765992057000,
    "title": "BNB drops nearly 3% to as bitcoin whipsaw and tech selloff hit crypto market",
    "body": "The decline was accompanied by sharp volatility in bitcoin and weakness in U.S. tech stocks, suggesting a return of risk-off sentiment.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Technical Analysis|BNB|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55938354,
    "published": 1765994449000,
    "title": "Bitcoin Structure Turns Bearish As Structural Indicators Flip Negative",
    "body": "Bitcoin is struggling to reclaim the $90,000 level as it continues to test critical demand around the $86,000 zone. After weeks of corrective price action, bulls are finding it increasingly difficult to build a convincing case for trend continuation. Related Reading: XRP Liquidity Dries Up: Futures Buy Volume On Binance Falls from $5.8B to $250M Momentum has faded, upside attempts have been rejected, and market confidence is weakening. As a result, a growing number of analysts are beginning to openly discuss the possibility that Bitcoin is transitioning into a broader bear market phase rather than a temporary pullback within a larger uptrend. This shift in narrative is supported by structural data. In a recent analysis, Axel Adler highlights that Bitcoin’s price action is now aligned with a clear deterioration in market structure. His chart, which combines a composite Structure Shift signal with a Donchian Channel, shows that the indicator has decisively moved into negative territory. The Structure Shift composite ranges from -1 to +1, with values below zero signaling bearish regime dominance. Currently, the signal sits near -0.5, a level historically associated with sustained downside pressure rather than short-lived corrections. At the same time, Bitcoin price has dropped to the lower boundary of the 21-day Donchian Channel and is hovering just above the $85,000 support area. Together, these signals suggest that the market is operating in a risk-off environment, where downside risks remain elevated unless structure improves meaningfully. Bitcoin Structure Confirms Bearish Regime Adler notes that the current position of the Structure Shift composite signal confirms Bitcoin has firmly established itself within a bearish structural zone. With the indicator sitting below zero, the market is no longer in a neutral or transitional phase but operating under sustained downside conditions. According to this framework, the primary trigger for improvement would be a decisive recovery of the composite signal back above the zero threshold, ideally while price continues to hold support within the Donchian Channel. Without that shift, any short-term bounce risks remaining corrective rather than trend-changing. This bearish structure is reinforced by Bitcoin’s Bull-Bear market structure index, which focuses on derivatives dynamics through fast and slow regime components. The latest data shows the bullish component collapsing to just 5%, an extremely low reading that reflects the near absence of constructive long-side momentum. At the same time, the fast bearish component has moved deeper into negative territory, signaling rising seller pressure driven primarily by the futures market. This configuration highlights a critical imbalance. Short-term momentum is firmly controlled by bears, while spot demand has so far proven insufficient to absorb derivatives-led selling pressure. For conditions to improve, the bullish component of the index would need to recover meaningfully, signaling renewed participation from buyers. Taken together, both indicators point to the same conclusion: Bitcoin has undergone a local structural shift into bearish territory. The dominant risk remains continued downside pressure driven by derivatives, especially in the absence of strong spot accumulation. Related Reading: Who Really Sold The Dip? On-Chain Data Exposes Bitcoin’s True Sellers Bitcoin Price Tests Critical Support as Downtrend Persists Bitcoin continues to trade under clear downside pressure. The price now hovers around the $86,500 level after failing to reclaim higher resistance zones. The chart highlights a decisive breakdown below the short- and medium-term moving averages. With BTC trading well beneath the 50-day and 100-day averages. These levels, which previously acted as dynamic support during the uptrend, have now flipped into resistance. Reinforcing the bearish market structure. The most notable technical development is Bitcoin’s interaction with the 200-day moving average, shown in red. Price has briefly tested this long-term support but remains fragile, with follow-through buying notably absent. Historically, sustained trading below faster-moving averages while compressing near the 200-day often signals either a prolonged consolidation phase or the risk of an additional leg lower if demand fails to appear. Related Reading: Why Bitcoin’s Quiet Price Action May Be ‘Dangerous’ – IFP Signals Rising Structural Risk Structurally, Bitcoin remains in a lower-high, lower-low sequence since the October peak near $125K. As long as price remains capped below the $90K–$95K resistance zone, downside risks persist. For bulls to regain control, BTC must first stabilize above current demand and reclaim key moving averages. Signaling that sellers are losing dominance. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin bearish indicator|Bitcoin market structure|Bitcoin news|Bitcoin On-Chain Data|Bitcoin Structure|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55937810,
    "published": 1765993727000,
    "title": "Senators Introduce Bipartisan Bill to Establish Federal Crypto Scam Taskforce",
    "body": "The federal taskforce would have to issue a report within one year of forming, outlining its strategy for combating crypto fraud.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55939047,
    "published": 1765995387000,
    "title": "How Banks Learned To Stop Worrying And Love Stablecoins",
    "body": "Banks worry stablecoins will drain deposits. Data says they won't. The real value is replacing settlement rails built on duct tape and COBOL with a dollar that works.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|Investing|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  }
]