[
  {
    "id": 57065832,
    "published": 1768126530000,
    "title": "CryptoQuant founder slams X for penalizing crypto content instead of bots",
    "body": "X’s head of product said Crypto Twitter’s reach problems are self-inflicted, blaming overposting rather than algorithmic suppression.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57067788,
    "published": 1768129208000,
    "title": "Ethereum’s Inverted Chart May Be Setting Up Its Next Major Move: New ATH Soon?",
    "body": "Ethereum’s price action has spent an unusually long time moving sideways, and this behavior has tested the patience of many long-term bullish investors. When speaking of sideways movement, this movement has dragged on for many months, although Ethereum did manage to make a new all-time high in 2025. Interestingly, a technical analysis shared on X by Egrag Crypto shows how Ethereum’s current price action fits into previous playouts when viewed through an inverted monthly chart. This offers a perspective on what appears to be stagnation about to break into new price highs. Related Reading: Bitcoin’s Next Peak Might Ignite ADA’s Rally, Says Cardano Creator A Repeating Cycle With Changing Behavior The analysis is based on an inverted monthly Ethereum chart, which offers an interesting perspective that flips conventional interpretations of price movement. Ethereum’s inverted monthly chart shows a consistent pattern that’s changing with time in market structure across multiple cycles. A look at the inverted chart shows that previous price cycles were characterized by short accumulation phases followed by aggressive moves. As the market matured, those accumulation zones stretched out, and the resulting moves became less violent and more controlled. The first instance was in 2016, when Ethereum traded in a range for about 10 months before breaking out and going on a violent drop. A similar structure appeared between mid-2018 and mid-2020, when a longer consolidation phase preceded another drop that played out gradually at a softer pace. The current cycle, however, is playing out with a much longer accumulation. Therefore, the eventual drop should be shorter, according to Egrag Crypto. Inverted Ethereum Price Chart. Source: @egragcrypto on X A Drop Here Actually Means A Breakout The most important detail in this technical framework is that the chart is inverted. What looks like a downside move on this view actually points to upside expansion on the real Ethereum price chart. According to the previous outcomes, once Ethereum exits this range, the next move is likely to unfold quickly. It may not match the explosive nature of early-cycle rallies, but it is expected to be more orderly, sustained, and carry Ethereum to new price highs. When the structure is converted back into real price terms, Egrag Crypto identifies the $3,800 to $4,500 area as the first critical zone. This region represents initial resistance that must be cleared to confirm a bullish continuation. Only after a decisive move above this range would the $6,000 to $7,500 zone come into focus as a realistic upside target. Related Reading: Crypto Market Watches As Clarity Act Enters Senate Debate Next Week: US Senator The analysis also highlights a defined risk scenario. A pullback to the $1,800 to $2,200 region would postpone the breakout and act as a final shakeout before a final lift-off. However, as long as Ethereum holds its broader consolidation structure, such a retest would not invalidate the thesis. At the time of writing, Ethereum is trading at $3,100. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|blockchain|crypto|crypto market|crypto news|cryptocurrency|ETH|ethereum|ethusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57069222,
    "published": 1768136400000,
    "title": "Ethereum’s future hinges on zero-knowledge proofs, EF director says",
    "body": "In a recent interview with CoinDesk, Ethereum Foundation co-executive director Hsiao-Wei Wang described zero-knowledge as part of Ethereum’s midterm roadmap, pointing to “many amazing breakthroughs” in the past one to two years.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Ethereum News|Zero-Knowledge Proofs|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57069622,
    "published": 1768137631000,
    "title": "Ethereum co-founder Vitalik Buterin warns decentralized stablecoins still have deep flaws",
    "body": "The Ethereum co-founder argues that price benchmarks, oracle security and staking incentives remain unresolved challenges for decentralized stablecoins.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Tech|Stablecoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57071623,
    "published": 1768143634000,
    "title": "Bitcoin Price Compresses Below $94K, But Possible Repeat Of 2025 Breakout Looms",
    "body": "After retreating from late-2025 highs, Bitcoin has spent much of recent trading days fluctuating between the mid-$80,000s and low-$90,000s, with buyers consistently stepping in on dips and sellers defending the same resistance level. Interestingly, this technical setup resembles the structure Bitcoin formed before its last major rally that eventually pushed it to its price peak above $126,000. Related Reading: Crypto Market Watches As Clarity Act Enters Senate Debate Next Week: US Senator Bitcoin Revisits A Familiar Consolidation Structure A closer look at BTC price action on the daily candlestick timeframe chart shows that the leading cryptocurrency is tracing a pattern that looks very similar to what played out between March and May 2025. In that earlier phase, Bitcoin spent weeks trading between roughly $76,000 and $86,000, repeatedly failing to break higher and giving the impression of stagnation. During that time, the Bitcoin price held above support levels and continued to print lower lows within the range and gave the impression of a lack of immediate upside. That consolidation ultimately proved to be a base. Once Bitcoin broke above the upper boundary of that range at $86,000, the sentiment changed very quickly and created the stage for a strong upside move that eventually led to Bitcoin. The current structure shows the same characteristics, only at a higher altitude. This time, Bitcoin is ranging between approximately $84,000 and $94,000, with price compressing in a similar way to early 2025. Bitcoin Price Chart. Source: @aganstwallst On X Why Bitcoin Might Push To New ATHs The $94,000 level has become the primary area determining Bitcoin’s current upward price action. Bitcoin’s price action tested this zone during an early January rally, briefly pushing toward $94,500 on January 5 before facing rejection and dropping back into correction. That rejection is now in the past, and the next priority is what Bitcoin might do once it finally secures a decisive break above this resistance. The previous performance is a good reference point for what could follow a confirmed breakout. After Bitcoin cleared $86,000 during the prior consolidation last year, it pushed up for many months, eventually reaching a peak price of around $126,080. That move represented a gain of about 46% from the breakout level. No two price movements can play out in exactly the same way, but the similarities between the current setup and last year’s structure suggest that Bitcoin may once again be building energy below resistance. Related Reading: Bitcoin’s Next Peak Might Ignite ADA’s Rally, Says Cardano Creator If Bitcoin delivers a comparable expansion after breaking above $94,000, the projected upside targets would extend a little above $126,000 and lead to the creation of a new all-time high. Applying the same percentage move from $94,000 points to a potential advance to as high as $138,000. Featured image from Pexels, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|btc|btcusd|crypto|crypto market|crypto news|cryptocurrency",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57072838,
    "published": 1768146923000,
    "title": "Walmart and Google bet on AI agents to reshape how people shop online",
    "body": "The retail giant said a new Gemini integration reflects a broader shift from search-based shopping to AI systems that can act on a customer’s behalf.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|AI|Google|Walmart|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57074255,
    "published": 1768150826000,
    "title": "Spot XRP ETFs Hit Record Trading Volume In Past Week — Details",
    "body": "The launch of the spot XRP ETFs (exchange-traded funds) in the United States was one of the rare success stories of 2025’s final quarter. The crypto-linked products have helped ensure significant capital influx into the altcoin in recent months. While the XRP ETFs recorded their first negative outflow day in the past week, the exchange-traded funds also reached a new record in terms of the total value traded in a single week. This milestone reflects the growing maturity of the XRP ETF market in the US. XRP Funds Post $219M Trading Volume In Past Week According to the latest market data, the spot XRP ETFs posted their highest weekly trading volume since debut at $219 million. This figure is almost double the value traded in the XRP ETF market in the previous week ($117.4 million). Related Reading: Analyst Outlines The Bull Case For XRP And Why Price Will Hit All-Time High Soon Meanwhile, this new record merely surpasses the previous record of $213.9 million reached in the third week of December 2025. This feat signals the rising investor demand for the XRP exchange-traded funds despite the waning interest in the broader crypto ETF market. As mentioned earlier, the US-based XRP ETFs registered their first negative performance in the past week, with a net outflow of $40.8 million on Wednesday, January 7. However, this single-day performance didn’t stop the exchange-traded products from ending the week in the green. Data from SoSoValue reveals that the XRP ETF market saw an additional $38.07 million in value for the week ending January 9. However, a look at the chart shows that the capital inflow for the crypto-linked products is steadily declining. As of this writing, the spot XRP ETFs have accumulated $1.47 billion in total net assets since launching in mid-November 2025. Canary Capital’s XRPC tops the list with $375.1 million in net assets under management (AUM), followed by Bitwise’s XRP fund at $300.3 million, and Franklin Templeton’s XRPZ at $279.6 million. XRP ETFs Shine While Crypto ETF Market Flounders While the XRP ETFs seem to be enduring the market storm, the more-established Bitcoin and Ether ETFs have seen better days. According to recent market data, the crypto funds saw a combined withdrawal of $749.6 million during their first full trading week of the year. Most notably, the spot Bitcoin ETFs saw their largest single-day net outflows of $486.1 million on Wednesday, January 7. The BTC exchange-traded funds closed the week with a net outflow of over $681 million. Meanwhile, the Ethereum ETF market, which started on a positive note with inflows of $168.1 million on January 5 and $114.7 million on January 6, eventually ended the week with net withdrawals of $68.6 million. Related Reading: Bitcoin Tests $90,000 Support As Netflows Turn Positive — Details Featured image from iStock,chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|xrp|XRP ETFs|xrp news|XRP Price|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57076746,
    "published": 1768158004000,
    "title": "XRP Ledger May Get A Tokenized Gold Upgrade, Web3 Founder Reveals",
    "body": "Tokenized gold is getting fresh attention in the XRP community, and some voices are saying the technology is ready. According to posts from XRPL developers and industry figures, the ledger can support 24/7 access, quick transfers, and integration with automated market makers. Related Reading: Bitcoin’s Next Peak Might Ignite ADA’s Rally, Says Cardano Creator Meld Gold is cited as a concrete step: reports have disclosed that Meld partnered with Ripple in June 2024 and launched gold and silver tokens in Q3 2024, with each token backed by one gram of physical metal held by trusted providers. That move put an actual product on the ledger instead of just talk. Tokenized Metals Moving Toward XRPL Advocates argue that having on-ledger tokens backed by real metal changes the use case for XRP and the XRPL. Phil Kwok, co-founder of Web3 technology company and education platform EasyA, told followers that “tokenized gold is coming to the XRPL,” and validators like Vet pointed out the technical fit. absolutely. tokenised gold is coming to the xrp ledger. and it’s going to be epic. https://t.co/wSPobxHD2W — Phil Kwok | EasyA (@kwok_phil) January 9, 2026 Vet highlighted features such as constant availability and links to DeFi tools, and raised the question of why broad adoption has not happened yet. Some future features, including lending and escrow, were mentioned as ways to make tokenized metals more useful. Market Demand And The Incentive Gap Demand already exists in other corners of crypto. Reports note Paxos and Tether manage billions of dollars’ worth of tokenized metals, showing investor interest is real. Still, execution matters. Pano Mekras of Anodos Finance told the discussion that incentives are likely the missing piece; large firms may be reluctant to launch products on the XRPL unless there are clear economic reasons to do so. Attracting high-volume projects may require active outreach and stronger on-ledger incentives. Market Reaction And Price Action Based on reports, XRP’s price moved above $2 early in January 2026 and touched around $2.41 during a broader crypto upswing. The token later settled near $2 as traders digested gains. A pullback of roughly 14% has been reported since the highs, and trading has shown both inflows from institutions and bouts of profit-taking. There is no clear proof that tokenized metals have driven these swings, however; market moves are being tracked separately from on-ledger product launches. What This Means For The XRPL If more tokenized metal products arrive, the XRPL could find new uses beyond payments. Trading and settlement for gold and silver tokens would add transaction volume and could open room for new DeFi tools built around those tokens. Related Reading: Crypto Market Watches As Clarity Act Enters Senate Debate Next Week: US Senator Adoption will depend on custody arrangements, audit practices, and regulatory clarity, areas observers say still need work. Economic incentives, as Mekras warned, will play a key role in whether major issuers come onboard. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|Meld Gold|Precious Metals|Ripple|xrp|XRPL. Tokenized gold|yellow metal",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57077541,
    "published": 1768160131000,
    "title": "India tightens KYC requirements for crypto user onboarding",
    "body": "Tax and other regulatory agencies in India claim that cryptocurrencies and permissionless blockchain tech undermine tax collection.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57079145,
    "published": 1768165204000,
    "title": "Bitcoin Price Remains Below 50-Week Moving Average — What This Means",
    "body": "The Bitcoin price has slowed down after a relatively hot start to the year, as it appears that not much has structurally changed for the market leader. A crypto analyst recently revealed that the premier cryptocurrency continues to trade beneath a critical price threshold. Why The Present Scenario Raises Caution Among Investors In a January 10 post on social media platform X, analyst Ali Martinez shared that the Bitcoin price has continued to trade underneath its 50-week Simple Moving Average (SMA). This not-so-optimistic trend, according to the crypto pundit, has been ongoing for the past nine weeks. Related Reading: Bitcoin Maintains Mid-$90k Levels: Possible Price Targets — Analyst For context, the 50-week SMA is a long-term technical indicator that calculates, on average, the closing price of an asset — in this case, Bitcoin — over the past 50 weeks. This indicator is particularly useful in establishing points of dynamic support and resistance during differing market cycles. For example, it functions as support during bull markets and acts as resistance in bear markets. When Bitcoin trades above the 50W SMA, it is often a sign that the market is in a strong uptrend. Contrarily, when the Bitcoin price trades beneath this dynamic resistance level for an extended period, it indicates that upside momentum is weakening and that major corrections might soon ensue. Interestingly, historical data is the source of this observation. From the chart shared below, there are recurrent periods where the Bitcoin price stayed consistently below the 50W SMA. In those past cycles, these periods of prolonged deviation beneath the 50W SMA preceded major pullbacks for BTC, which often ranged between 50% to 70%. Notably, the pullbacks seen did not end Bitcoin’s long-term uptrend. Rather — as is typical of corrections — they likely served as reset phases, where excessive leverage was wiped out of the market in preparation for the next long-term continuations. As a result, concerns have been raised among Bitcoin market participants, considering the similarity of the current setup to past ones. If history were to repeat itself here, the Bitcoin price could see a pullback by at least 50%, with the price falling to levels as low as $50,000. Bitcoin Price Outlook On a more positive note, the Bitcoin price still has a chance to escape the snares of its historical woes. For this to happen, the world’s leading cryptocurrency would have to reclaim the 50-week moving average and hold above it for prolonged periods. As of press time, the price of Bitcoin stands at around $90,352, reflecting no movement in the past day. Related Reading: Bitcoin’s Next Peak Might Ignite ADA’s Rally, Says Cardano Creator Featured image from iStock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|50-week moving average|bitcoin|Bitcoin news|bitcoin price|btc|btc price|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57086091,
    "published": 1768186141000,
    "title": "Memecoins hit hardest in rough year that saw 11.6M tokens fail",
    "body": "Memecoin launchpads such as pump.fun flooded the market in 2025 with millions of “low effort” coins, leading to a record number of crypto token failures.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57087157,
    "published": 1768189165000,
    "title": "Bitcoin Shrugs Off Powell Probe as DOJ Targets Fed Chair",
    "body": "Experts note Bitcoin’s hedge narrative could strengthen if ​​Fed Chair Jerome Powell’s criminal investigation is successful.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57087518,
    "published": 1768190182000,
    "title": "Crypto YouTube views sink to 5-year lows, ‘it’s not just X’",
    "body": "Crypto content viewership on YouTube has plunged over the past three months, signaling bear market conditions as retail interest in crypto continues to decline.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57088167,
    "published": 1768192283000,
    "title": "Privacy tokens rally as XMR breaks all-time high",
    "body": "XMR, ZEC, SOL and other alts are rallying as BTC remains rangebound",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 57,
        "NAME": "XMR",
        "CATEGORY": "XMR"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57087896,
    "published": 1768191482000,
    "title": "XRP Price Approaches Resistance, Setting Up a Make-or-Break Moment",
    "body": "XRP price extended losses and traded below $2.10. The price is now attempting to start a fresh increase and faces hurdles near the $2.10 level. XRP price started a fresh decline below the $2.120 zone. The price is now trading below $2.120 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance at $2.10 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move down if it stays below $2.120. XRP Price Attempts Recovery XRP price failed to stay above $2.20 and started a fresh decline, like Bitcoin and Ethereum . The price declined below $2.150 and $2.120 to enter a short-term bearish zone. The price even spiked below $2.050. A low was formed at $2.034, and the price is now attempting to recover. There was a move above $2.080, but the price stayed below the 23.6% Fib retracement level of the downward move from the $2.415 swing high to the $2.034 low. The price is now trading below $2.120 and the 100-hourly Simple Moving Average. If there is a fresh upward move, the price might face resistance near the $2.10 level. There is also a key bearish trend line forming with resistance at $2.10 on the hourly chart of the XRP/USD pair. The first major resistance is near the $2.120 level. A close above $2.120 could send the price to $2.220 or the 50% Fib retracement level of the downward move from the $2.415 swing high to the $2.034 low. The next hurdle sits at $2.320. A clear move above the $2.320 resistance might send the price toward the $2.350 resistance. Any more gains might send the price toward the $2.3850 resistance. The next major hurdle for the bulls might be near $2.40. Another Decline? If XRP fails to clear the $2.120 resistance zone, it could start a fresh decline. Initial support on the downside is near the $2.050 level. The next major support is near the $2.020 level. If there is a downside break and a close below the $2.020 level, the price might continue to decline toward $2.00. The next major support sits near the $1.9650 zone, below which the price could continue lower toward $1.880. Technical Indicators Hourly MACD – The MACD for XRP/USD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $2.050 and $2.020. Major Resistance Levels – $2.10 and $2.120.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57088771,
    "published": 1768194010000,
    "title": "Strategy diehards keep faith in company that ‘the market doesn’t understand’",
    "body": "Bitcoin hoarder’s business model has come into question but retail traders still view founder as ‘visionary leader’",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57088880,
    "published": 1768194516000,
    "title": "Solana (SOL) Accelerates Higher, All Eyes on a Key Upside Level",
    "body": "Solana started a fresh increase above the $140 zone. SOL price is now consolidating above $140 and might aim for more gains above the $145 zone. SOL price started a fresh upward move above the $140 and $142 levels against the US Dollar. The price is now trading above $140 and the 100-hourly simple moving average. There is a bullish trend line forming with support at $138 on the hourly chart of the SOL/USD pair (data source from Kraken). The pair could extend gains if it clears the $145 resistance zone. Solana Price Outperforms Bitcoin Solana price started a decent increase after it settled above the $132 zone, outperforming Bitcoin and Ethereum . SOL climbed above the $138 level to enter a short-term positive zone. The price even smashed the $140 resistance. The bulls were able to push the price above $142. A high was formed at $144, and the price is now consolidating gains above the 23.6% Fib retracement level of the recent upward move from the $135 swing low to the $144 high. Solana is now trading above $142 and the 100-hourly simple moving average. Besides, there is a bullish trend line forming with support at $138 on the hourly chart of the SOL/USD pair. On the upside, the price is facing resistance near $144. The next major resistance is near the $145 level. The main resistance could be $150. A successful close above the $150 resistance zone could set the pace for another steady increase. The next key resistance is $162. Any more gains might send the price toward the $170 level. Downside Correction In SOL? If SOL fails to rise above the $145 resistance, it could start another decline. Initial support on the downside is near the $142 zone. The first major support is near the $140 level or the 50% Fib retracement level of the recent upward move from the $135 swing low to the $144 high. A break below the $140 level might send the price toward the $138 support zone and the trend line. If there is a close below the $138 support, the price could decline toward the $132 support in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is gaining pace in the bullish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is above the 50 level. Major Support Levels – $140 and $138. Major Resistance Levels – $145 and $150.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Technical analysis|Sol|Solana|solbtc|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57089970,
    "published": 1768197624000,
    "title": "CZ Fuels Optimism As Binance Coin’s $1,000 Target Trends",
    "body": "Binance Coin climbed again over the weekend, pushing past the $900 mark and touching about $907 on Sunday after a sharp 24-hour uptick. Markets were calmer overall, with the broader crypto complex up 0.55% for the day while Bitcoin hovered above $92,000 and Ethereum traded beyond $3,100. Related Reading: Bitcoin’s Next Peak Might Ignite ADA’s Rally, Says Cardano Creator Market Reaction To Regulatory Shift According to social posts from Changpeng Zhao, founder and former CEO of Binance who is also known as ‘CZ’, optimism around a possible new crypto cycle helped fuel demand. CZ linked the mood to a regulatory change, saying the Securities and Exchange Commission had removed crypto from its list of priority risks for 2026. Based on reports, that move is being read by some investors as a sign of easing scrutiny, and it appears to have lifted sentiment across tokens. I could be wrong, but Super Cycle incoming. https://t.co/6TLldEMmGA — CZ 🔶 BNB (@cz_binance) January 10, 2026 Institutional Buying Adds Fuel Reports note sizable institutional flows into Bitcoin products. According to a filing, Wells Fargo bought 383 million of Bitcoin ETF shares, a figure that market watchers flagged as a large institutional stake. Morgan Stanley also filed for its own spot Bitcoin ETF last week, which many see as more proof that big financial players are stepping in. Those actions are being cited by traders as one reason risk assets like Binance Coin could see more interest. Macroeconomic Calendar Could Swing Prices A packed US data week is ahead and traders say it could affect crypto angles. On Monday, the market will watch a speech by the FOMC president. On Tuesday and Wednesday, the US Consumer Price Index and the Producer Price Index are due. Jobless claims come on Thursday, and a Fed balance sheet update lands on Friday. Any big surprise in those numbers can push liquidity flows and quickly change appetite for tokens. Binance Coin: Technical Levels To Watch BNB briefly reclaimed the $900 zone and was reported at $909 in some feeds as the four-hour chart showed a steady climb. Short-term resistance sits near $950, with a psychological barrier at $1,000. Related Reading: XRP Ledger May Get A Tokenized Gold Upgrade, Web3 Founder Reveals Technical indicators offered cautious support for bulls: the MACD showed a bullish crossover with the blue line above the signal line, and the histogram printed positive bars, which suggests buying pressure building. The RSI sat around 56.10, under overbought levels, implying room for more gains. Traders still point to a key support range near $850. A break below that could invite heavier selling and take prices down toward $820. The scenario of a quick pullback is real; prices that move fast up can move fast down. Market participants will be watching both the macro calendar and any fresh regulatory updates for clues. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|Binance|Binance Coin|bitcoin|BNB|crypto|CZ|ethereum|FOMC",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57089953,
    "published": 1768197587000,
    "title": "South Korea to lift ban on corporate crypto investment: Report",
    "body": "South Korea’s FSC reportedly shared guidelines allowing listed companies to invest up to 5% of equity in the top 20 cryptocurrencies, ending a 2017 ban.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57089797,
    "published": 1768196898000,
    "title": "​​Top UK lawmakers push to ban political donations made in crypto",
    "body": "The chairs of seven UK government committees have asked for a ban on crypto donations to be added to an elections bill set to be introduced soon.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57083810,
    "published": 1768178945000,
    "title": "X to roll out ‘Smart Cashtags’ for crypto, stocks next month",
    "body": "Smart Cashtags aim to enable users to track real-time price movements of crypto tokens and stocks, building on X’s long-term vision to become an Everything App.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57093516,
    "published": 1768208237000,
    "title": "MEXC offers $200,000 P2P airdrop to attract new users",
    "body": "Crypto trading platform MEXC has rolled out a new promotional campaign built around its peer-to-peer marketplace, offering a $200,000 airdrop pool exclusively for users making their first-ever deposit on the platform. The limited-time event began on Jan. 4, 2026, at 11:00 UTC and will run until Jan. 31 at 16:59 UTC. Participation is restricted to accounts that have never previously deposited funds on MEXC, with eligibility tied specifically to deposits completed through the exchange’s P2P channel rather than standard trading methods. To take part, users must first register for the campaign via the dedicated event page. Only after opting in are participants able to qualify by completing their first P2P deposit and reaching a net deposited amount exceeding $100 during the event period. MEXC notes that users who fail to register before depositing will not be counted toward the promotion. Participants who meet the requirements within seven days of registration unlock a fixed 10 USDT reward. All rewards are distributed from a shared $200,000 pool and allocated on a first-come, first-served basis, meaning that late participants may miss out once the pool is fully claimed. Following the conclusion of the campaign, eligible rewards will be credited directly to users’ Spot wallets. MEXC states that distribution will take place within 14 calendar days after the event ends, with most users expected to receive their airdrops within five business days. The campaign places renewed focus on MEXC’s P2P trading service, which allows users to purchase cryptocurrencies using local currencies, flexible pricing, and a wide range of payment methods. Unlike traditional exchange trades, P2P transactions on MEXC come with zero platform fees, a feature the exchange continues to promote as competition among P2P marketplaces intensifies. Through the P2P platform, users can access major cryptocurrencies including USDT, Bitcoin, Ethereum, USDC, Dogecoin, and Solana. The service is designed to cater to regions where direct fiat on-ramps may be limited or where users prefer localized payment options. However, the exchange has outlined several restrictions tied to the promotion. Users who withdraw funds within 24 hours of meeting the deposit requirements will be disqualified from receiving rewards. In addition, participants who have previously received rewards from other MEXC P2P promotions are excluded from this campaign. Eligibility is limited to main accounts only. Sub-accounts cannot participate independently, and any activity associated with them will be consolidated under the primary account for the purposes of eligibility checks and reward calculations. MEXC also applies internal risk and compliance reviews before rewards are finalized. Any attempts to manipulate the event, including creating multiple accounts, providing false identity information, inflating trading data, or engaging in other forms of abnormal activity, may result in disqualification and forfeiture of rewards. The exchange added that the campaign rules may be adjusted or terminated if necessary. Users were also reminded that cryptocurrency markets remain volatile and that promotional incentives do not remove the risks associated with trading digital assets. Claim the P2P airdrop",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 204,
        "NAME": "AIRDROP",
        "CATEGORY": "AIRDROP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57093923,
    "published": 1768209470000,
    "title": "Bitcoin's early gains fade fast as prices fall back below $91,000",
    "body": "Risk sentiment deteriorates as safe havens outperform and equities weaken.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Gold|MicroStrategy|Michael Saylor|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]