[
  {
    "id": 55380201,
    "published": 1764914453000,
    "title": "Bitcoin Market Structure Echoes 2022 Bear Start, Glassnode Warns",
    "body": "On-chain analytics firm Glassnode has pointed out how the current Bitcoin market is reminiscent to the structure from the first quarter of 2022. Bitcoin Dynamics Are Currently Looking Similar To Early 2022 Bear Market In its latest weekly report, Glassnode has discussed about how the broader Bitcoin market structure is starting to resemble Q1 2022. First, the analytics firm has shared the data of its Supply Quantiles Cost Basis Model, highlighting price levels that correspond to a certain degree of investor profitability. In the chart, three supply quantiles are listed: 0.75, 0.85, and 0.95. If Bitcoin trades at the first of these levels, 75% of the supply will be in profit. Similarly, the latter two correspond to 85% and 95% profitability, respectively. Related Reading: Ethereum Back At $3,200 As Sharks Show Strong Accumulation It’s visible in the graph that Bitcoin has recently fallen below all three of these levels, indicating more than 25% of the cryptocurrency’s supply is now underwater. “This creates a fragile balance between the risk of top-buyer capitulation and the potential for seller exhaustion to form a bottom,” explained Glassnode. BTC similarly broke below the 0.75 quantile back during the sideways market of early 2022. Another indicator that reinforces the resemblance is the Total Supply in Loss, which measures, as its name suggests, the amount of the Bitcoin circulating supply that’s being held at some net unrealized loss. Below is a chart showing the 7-day moving average (MA) trend in the metric. As displayed in the graph, the 7-day MA Bitcoin Total Supply in Loss hit a high of 7.1 million BTC last week, which is the highest that it has been since September 2023, more than two years ago. The analytics firm noted: The current scale of supply in loss, ranging between 5M–7M BTC, is strikingly similar to the early-2022 sideways market, further reinforcing the resemblance noted above. Finally, the Bitcoin long-term holder Spent Output Profit Ratio (SOPR) also implies that the current market structure is mirroring Q1 2022. This metric tells us, in short, whether the Bitcoin investors holding since more than 155 days ago are selling their coins at a profit or loss. The Bitcoin long-term holder SOPR has witnessed a sharp decline recently, but its value is still above 1, indicating the long-term holders are selling at some net profit. With its current value of 1.43, however, there has been a notable shrinkage in the profit margins of the cohort. Related Reading: Next Key XRP Level Could Be $1.2 If Current Support Fails, Says Analyst It now remains to be seen whether the trends in these indicators mean that the cryptocurrency is on the cusp of a bear market transition like in early 2022, or if a rebound will come before long. BTC Price Bitcoin has seen a slight pullback during the past day as its price has dropped to $91,800. Featured image from Dall-E, Glassnode.com, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin bear|bitcoin bear market|Bitcoin Realized Loss|btc|BTCUSDT|glassnode",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55382059,
    "published": 1764917424000,
    "title": "Italy Launches 'In-Depth' Review of Crypto Risks",
    "body": "Regulators launch probe months after Italy's central bank warned that crypto's mainstream integration poses systemic financial dangers.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55383208,
    "published": 1764919521000,
    "title": "Kraken Launches High-Touch VIP Program for Ultra High Net Worth Clients",
    "body": "Kraken VIP members are paired with a specialist relationship manager, backed by 24/7 support and early insight into Kraken’s full product ecosystem.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|CoinDesk Wealth|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55384282,
    "published": 1764921606000,
    "title": "Why Bitcoin Traders Fear A Repeat Of July 2024’s Crash Next Week",
    "body": "Bitcoin is again trading under the shadow of a potential yen carry-trade shock as markets head into the 9–10 December FOMC meeting and a likely hawkish turn from the Bank of Japan at the December 18-19 meeting. The setup echoes last summer’s episode, when a policy shift in Tokyo triggered rapid deleveraging across risk assets, including crypto. Will The Bitcoin Price Crash Next Week? Analyst Benjamin Cowen explicitly links today’s environment to that July shock. He reminded followers that “in July 2024, the Fed cut rates while the BOJ raised rates, leading to the unwind of the carry trade. Bitcoin capitulated into it, and found a low 1 week later.” He added, “Good chance this happens again on December 10th (Fed cuts, BOJ raises rates). So maybe Bitcoin finds a low mid-Dec?” The precise sequencing last year was more nuanced – markets aggressively priced Fed easing while the BoJ surprised with a hike – but the core mechanism Cowen highlights is the same: when US policy is moving toward looser conditions just as Japan tightens, the long-running yen carry trade becomes unstable and high-beta assets sell off hard. Related Reading: Bitcoin Signals Bear Market: One Thing Could Flip It, Says CryptoQuant CEO Truflation’s thread lays out why this matters for Bitcoin and the wider crypto market. Large institutions and commercial banks “borrow money in Yen where interest rates are historically and famously low, and use that money to invest in the US.” They can park the funds in interest-bearing instruments to “earn healthy 3–4%” on the spread, or “more often, they invest in stocks and bonds to get way more.” This is reinforced by a BoJ policy of keeping the yen cheap against the dollar. The danger arises when stocks fall and the yen starts to rise or is expected to rise. Then “institutional and Commercial borrowers may exit, so as not to get stuck with significant losses on their Yen debts.” They “sell whatever assets they purchased in the US and get back into Yen to pay back their loans in Japan, resulting in a cascade of US asset sales and Yen purchases.” After “years of Yen carry trade being a relatively safe way for big banks and institutional investors to make easy money,” even a modest normalization can force broad, mechanical de-risking — and Bitcoin, as a liquid, leveraged risk asset, sits directly in that firing line. Crypto trader Kevin (@Kev_Capital_TA) underscores how tight the current window is. He notes that “we have the Fed’s preferred measure to track inflation via the Core PCE inflation and then the FOMC all in the next six days,” followed by a BoJ press conference on 19 December that will be “massive for Dollar, short end and long end of the yield curve not to mention Yen carry trade fears.” In a separate post, he stresses that “the JP10Y continues to make new highs. Pretty big deal folks,” highlighting that Japanese yields are grinding higher into that meeting and increasing pressure on the BoJ to act. Related Reading: US Sen. Lummis Hints At US Bitcoin Buy With ‘Franklin’ Meme A few days ago, BitMEX founder Arthur Hayes connected that macro repricing directly to Bitcoin’s latest leg down. “BTC dumped cause BOJ put Dec rate hike in play. USDJPY 155–160 makes BOJ hawkish,” he argues, framing the sell-off as a funding shock rather than a crypto-native event. Into December, futures and economist surveys put the probability of a Fed cut at roughly 80–87% for the 9–10 December meeting, even as the committee remains divided. At the same time, the BoJ is openly signalling it will “consider the pros and cons” of a hike at its 18–19 December meeting, with markets now pricing a high likelihood of tightening and 10-year JGB yields near multi-decade highs. That combination — Fed easing expectations plus BoJ tightening risk — is exactly the configuration that threatens the yen carry and makes a repeat of July 2024’s pattern plausible: a sharp flush in Bitcoin and other risk assets, followed by a bottom once forced deleveraging runs its course. At press time, BTC traded at $92,235. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55384964,
    "published": 1764922300000,
    "title": "BlackRock Bitcoin ETF Sheds $2.7 Billion in Record Outflows Run",
    "body": "BlackRock Inc.’s iShares Bitcoin Trust recorded its longest streak of weekly withdrawals since debuting in January 2024, in a sign that institutional appetite for the world’s largest cryptocurrency remains subdued even as prices stabilize.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NYS:BLK",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55386285,
    "published": 1764925240000,
    "title": "A New Era Begins: CFTC Approves Spot Bitcoin On Regulated US Markets",
    "body": "Regulators in Washington on Thursday cleared a major step that lets Americans trade spot Bitcoin and other cryptocurrencies on federally registered exchanges for the first time. Related Reading: Bitcoin Crash Fails To Shake Ripple CEO — He Still Calls For $180K According to the Commodity Futures Trading Commission, listed spot crypto products may now be offered on exchanges registered with the agency, a move announced on December 4, 2025. Regulated Spot Trading Begins The action comes from a CFTC press release labeled Release No. 9145-25 and that the change allows spot crypto contracts to be listed on futures exchanges that are registered with the CFTC. The regulator said its rules now permit such listings to trade under the oversight and surveillance standards those exchanges already follow. .@CFTCpham Announces First-Ever Listed Spot Crypto Trading on U.S. Regulated Exchanges: https://t.co/89Mx6f0ss4 — CFTC (@CFTC) December 4, 2025 Bitnomial Leads The Way Bitnomial, a Chicago-based derivatives exchange, is set to be the first exchange to list such products, with plans to offer both leveraged and non-leveraged spot trading on its platform. Market notices and statements show Bitnomial moved quickly to use the new framework, announcing a launch and filings that position it as the first US venue to trade listed spot crypto under CFTC rules. What This Means For Investors According to market commentators and reporting, the shift brings spot trades under long-standing market protections like clearing, surveillance and execution rules that apply to other listed products. That can make some institutional players and big funds more willing to trade onshore. At the same time, regulators say this is meant to pull activity away from unregulated offshore venues and improve market oversight. Acting Chairman Caroline Pham said the move is meant to strengthen the US position in the crypto market while giving traders access to safer and more transparent trading venues. Risks Remain Reports have disclosed that the change does not remove the underlying risks of crypto: prices can swing widely, and no regulatory move can stop market volatility. Also, only exchanges that seek and obtain the proper CFTC registration will be able to use this route, so most offshore platforms remain outside US oversight for now. Related Reading: Eric Trump Says Bitcoin Could Hit $500,000, Stands By ABTC Strategy Next Steps Observers will be watching whether other US exchanges follow Bitnomial, how many retail investors gain access, and how the SEC responds on parallel issues such as token classification and custody rules. The CFTC had flagged this pathway in August as part of a broader initiative to allow listed spot crypto trading, and agencies have since coordinated on guidance and public engagement. The CFTC’s Acting Chairman said this brings spot crypto trading into a regulated setting Americans can trust, and that exchanges with the right protections can now list these products. This development is part of a months-long policy push by the administration to create clearer rules for digital assets. Featured image from Barron’s, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|cftc|crypto|digital currency|US regulation",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55388245,
    "published": 1764928852000,
    "title": "Dogecoin Bulls Smell $1.30 As On-Chain Data Turns Red-Hot",
    "body": "Dogecoin is hovering near $0.15, but a cluster of technical and on-chain indicators shared on X suggests the market structure is far healthier than during the last bear phase, prompting fresh upside calls from analysts. Dogecoin Could Target $1.30 Trader Cryptollica posted a long-term monthly DOGE chart with the Mayer Multiple and a clear message: “DOGE Target > $1.30.” The Mayer Multiple, using 200- and 50-period moving averages with a 2.4 threshold, sits at 0.66005. Visually, that is far below the spikes above 5 that accompanied the 2017 and 2021 blow-off tops, indicating that Dogecoin is not yet in the overheated conditions historically associated with major market peaks. Cryptollica also highlighted an Alphractal chart titled “Dogecoin: Number of Days Spent at a Loss.” The series overlays DOGE’s price with a multicolour histogram of how long coins have been held in unrealised loss. Related Reading: Dogecoin Price Can Stage A 96% Rally If It Breaks This Falling Wedge Pattern Earlier cycle lows around 2014–2015 and the post-2021 unwind show extended peaks above roughly 1,200–1,500 days at a loss. In the latest segment, that metric has compressed back toward the lower end of the scale, resembling the early reset phases that preceded previous advances, and signalling that the proportion of long-suffering holders has markedly declined. DOGE On-Chain Data Looks Strong On the shorter-term on-chain side, Ali Martinez (@ali_charts) pointed to a sharp rebound in network activity. “Dogecoin just saw 71,589 active addresses. The biggest spike since September,” he wrote, sharing Glassnode data. The chart “DOGE: Number of Active Addresses” plots daily active addresses as yellow bars against the DOGE price in black. From early November, activity ranged around 45,000–47,500 addresses while price drifted lower from about $0.17 to $0.14. On December 3, active addresses jumped to 71,589 as price recovered to $0.15181709, signalling a broadening of participation rather than a purely price-driven move. Ali also drew attention to whale behaviour. Posting a Santiment chart of balances held by addresses with between 1,000,000 and 100,000,000 DOGE, he noted: “480 million Dogecoin bought by whales in 48 hours!” Related Reading: Is The Dogecoin Bottom In? This Price Level Could Be The Tell The grey area representing holdings in this band trends down from around 35.6 billion DOGE in mid-October to below 28 billion by late November while price falls from above $0.18 to about $0.135, indicating sustained distribution. In the final days of the chart, holdings rose again to roughly 28.45 billion as price rebounded from $0.14 to $0.15, confirming a renewed net accumulation phase among large holders. A third chart from Ali, “DOGE: Cost Basis Distribution Heatmap,” defines the next major technical hurdle. “$0.20 is the key resistance for Dogecoin. That’s where 11.72 billion $DOGE were accumulated,” he wrote. The Glassnode heatmap highlights a dense band between $0.20284609 and $0.20442947, with an annotated supply of 11,723,527,138.97 DOGE whose on-chain cost basis lies in that range. This cluster marks a heavy realised-price node where a large volume of coins moves from loss to breakeven as spot revisits $0.20, creating a clearly defined resistance zone. In combination, subdued valuation on the Mayer Multiple, a reset in “days at a loss,” the largest active-address spike since September, recent whale accumulation of 480 million DOGE and a well-defined $0.20 cost-basis wall form a favourable on-chain basis. Whether those higher levels are reached will depend on the market’s ability to absorb the 11.72 billion DOGE supply stacked around $0.20 and sustain the recent improvement in on-chain activity and large-holder demand. At press time, DOGE traded at $0.14451. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55388823,
    "published": 1764930884000,
    "title": "Polymarket Hiring In-House Team to Trade Against Customers — Here's Why It's a Risk",
    "body": "The prediction market’s move toward internal market making could blur the line with sportsbooks and undermine the platform’s neutrality, experts warn.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Polymarket|Prediction Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55388856,
    "published": 1764930802000,
    "title": "Ether vs. Bitcoin teases 170% gains as ETH price breaks 5-month downtrend",
    "body": "Ether price action staged a repeat of its 2021 bull market moves against Bitcoin, leading to predictions of fresh long-term highs against BTC.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55389226,
    "published": 1764932403000,
    "title": "FUD Frenzy: XRP Battles Its Biggest Sentiment Drop In Months—Data",
    "body": "According to an analytics report, XRP traded near $2.06 on Friday as social chatter around the token turned sharply negative after a two-month slide of about 30%. Related Reading: A New Era Begins: CFTC Approves Spot Bitcoin On Regulated US Markets Traders and data firms flagged a sudden rise in bearish messages, a shift from the more mixed views seen earlier this year. The mood has tightened around crypto, and XRP is not immune. Crowd Mood Shifts To Fear Based on reports from Santiment, its chart tracks XRP’s price against positive and negative comments and a combined sentiment line that aims to measure crowd feeling. Recent readings pushed the balance into what Santiment calls the fear zone, where negative talk outweighs optimism. On this same model, Santiment pointed to Nov. 21 as a comparable moment. Back then, XRP rallied more than 20% over the next three days before gains cooled. That past move is being used as a reference point by traders who watch social signals closely. 😨 XRP (-31% in the past 2 months), unlike Bitcoin, is seeing the most fear, uncertainty, & doubt (FUD) since October, according to our social data. 🔴 Circles indicate days where there are abnormally higher BULLISH comments compared to BEARISH comments, about XRP (Greed Zone)… https://t.co/lJNW8zlRwK pic.twitter.com/ZoFmwrtw3h — Santiment (@santimentfeed) December 4, 2025 Short Squeezes And Reflexive Moves Extreme pessimism can become a catalyst. When weaker holders sell and shorts pile in, a quick reversal can squeeze sellers and lift price sharply. This is the scenario many are watching: heavy bearish chatter could clear the way for a reflexive rebound if buying pressure appears. Santiment urged followers to keep an eye on the same dashboard to spot rapid shifts in sentiment, and some traders say the crowd’s mood often leads price in the very short term. Price Moves And Market Backdrop XRP was last reported down about 4% at $2.04, extending a loss of roughly 6% over the past month. The total crypto market value slipped about 1% to $3.22 trillion on the same day, a pullback that has dragged on many altcoins even as liquidity stays concentrated in the largest tokens. Order books on smaller pairs have thinned and leveraged positions were trimmed, leaving less depth to absorb big moves. Traders also cited uncertainty around upcoming US policy decisions as a factor behind cautious positioning. Institutional Push And On-Ledger Activity Analysts watching the token say it still has room to run toward $2.50 to $2.75 if cross-border liquidity flows pick up and stablecoin projects on the XRP Ledger gain momentum. Reports have disclosed that Ripple has been moving to broaden its institutional reach. Buy XRP. Stop focusing on any other Crypto Coins They don’t matter — Cameron Scrubs (@imcameronscrubs) December 2, 2025 Last month, the firm launched digital asset spot prime brokerage services in the US after acquiring Hidden Road and folding it into Ripple Prime, a combined trading and custody setup for professional clients. That push is being watched as a potential longer-term support for demand. Related Reading: Bitcoin Crash Fails To Shake Ripple CEO — He Still Calls For $180K Vocal Bulls And Market Signals Despite the FUD surrounding XRP, Cameron Scrubs, founder of Tradeship University, has again urged followers to “buy XRP,” stating that other crypto assets “don’t matter.” In previous posts, he also called to “sell everything and buy XRP.” Traders are watching these statements closely as sentiment shifts, while on-chain data and social signals are being monitored for indications that the current negative chatter may be starting to ease. Featured image from Gemini, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|altcoins|bitcoin|crypto|FUD|xrp|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55389588,
    "published": 1764931983000,
    "title": "BlackRock’s IBIT Faces Record Outflow Run as Bitcoin Struggles to Reclaim Bull Trend",
    "body": "Another $113 million exited on Thursday, putting the fund on track for a sixth week in the red, its longest streak since debuting in early 2024.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55389969,
    "published": 1764935203000,
    "title": "Crypto Markets Today: Bitcoin Slides to $91K as ETF Outflows Deepen Market Anxiety",
    "body": "Bitcoin’s early week rally unraveled as sharp ETF outflows, aggressive derivatives deleveraging and muted altcoin reactions to catalysts pulled the broader crypto market lower.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55390496,
    "published": 1764937168000,
    "title": "Turkish crypto exchange Paribu buys majority stake in competitor CoinMENA",
    "body": "Paribu has bought a majority stake in Dubai- and Bahrain-licensed CoinMENA in a deal valuing the exchange at up to $240 million.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55390421,
    "published": 1764937146000,
    "title": "Bitcoin ETFs Just Shed $194 Million—Highest in Two Weeks",
    "body": "Analysts argue this could mean institutional investors are continuing to unwind leveraged positions and basis trades.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55390822,
    "published": 1764938847000,
    "title": "Ethereum Options Traders More Bullish Than Bitcoin Counterparts: Analysts",
    "body": "Options data show Ethereum traders are less bearish than Bitcoin’s after recent network upgrades and improving macro uncertainty.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55391039,
    "published": 1764939785000,
    "title": "JPMorgan Retains Gold-Linked $170K Bitcoin Target Despite Recent Plunge",
    "body": "The bank’s volatility-adjusted bitcoin-to-gold model still points to a theoretical price around $170K over the next six to twelve months.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Strategy|Bitcoin Mining|JPMorgan|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55390881,
    "published": 1764939162000,
    "title": "Circle Stock Aims for $100 on Crypto Sentiment Rebound, Traders Rotate to $SUBBD",
    "body": "What to Know: Circle’s climb toward a potential $100 valuation reflects recovering crypto sentiment, renewed USDC activity, and stronger demand for regulated on-chain liquidity exposure. As risk appetite returns, capital often rotates from infrastructure equities and large caps into earlier-stage narratives with more asymmetric upside potential. AI-powered content platforms aim to fix Web2 creator pain points: high fees, opaque moderation, fragmented tools, and limited global payment options. SUBBD Token merges Web3 payments and integrated AI tools so creators can keep more earnings, automate fan engagement, and control content inside a transparent, tokenized ecosystem. Is Circle’s stock an indicator of a market rebound? Circle’s march toward a potential $100 valuation is becoming a barometer for how quickly crypto is healing after a brutal risk-off stretch. As sentiment improves and on-chain activity picks up , equity investors are treating Circle less like a speculative bet and more like an infrastructure proxy for stable, regulated liquidity. $USDC flows tell the same story . After periods of redemptions and market anxiety, on-chain volumes and stablecoin usage have started to normalize. This signals that traders want transparent, compliant rails to move capital across exchanges and DeFi. When that kind of infrastructure trade starts working again, it usually means risk appetite is quietly returning underneath. We’re already seeing that shift at the edges. Flows are rotating from ‘safe beta’ exposure like listed crypto firms and large-cap coins into earlier-stage narratives where the upside is more asymmetric. That’s especially true in sectors where real-world demand already exists. That’s the lane SUBBD Token ($SUBBD) is trying to occupy. As a Web3 and AI-powered content platform built on Ethereum, SUBBD is pitching itself as a higher-upside play on the same structural forces driving Circle. Why On-Chain Liquidity Plays Are Back in Focus Circle’s rise as a de facto equity proxy for on-chain liquidity reflects a simple narrative: if stablecoin volumes and institutional interest keep climbing, the pipes carrying that value should benefit most. That’s why regulated infrastructure names often rally first when the market starts to believe a new crypto cycle is forming. From there, capital tends to move outward along the risk curve. After stablecoin and Layer 1 exposure comes sector plays like AI-augmented creator tools, fan platforms, and tokenized media. Competing projects in this space are racing to combine AI assistants, subscription rails, and NFT access into a single, streamlined experience for creators. The problem they’re all solving is familiar. Web2 creator platforms can charge up to 70% in fees, enforce arbitrary bans, fragment AI tools across multiple subscriptions, and limit payment options based on geography. In that field, SUBBD Token ($SUBBD) is shining as a contender, positioning AI automation and Web3 payments as the upgrade path for creators who want more control and better economics. Already sold? We’ve got you covered in our ‘ How to Buy SUBBD Token ’ guide. How SUBBD Token Turns AI and Web3 Into Creator Infrastructure Where SUBBD Token leans in hardest is its promise to merge Web3 rails with integrated AI in one stack. Instead of creators juggling multiple apps and tools, SUBBD’s Ethereum-based ecosystem aims to bundle AI personal assistants, voice cloning, token-gated content, and NFT sales under a single token-powered model. The platform’s AI personal assistant is designed to automate interactions with fans, handle routine questions, and scale engagement without burning out the creator. On top of that, AI voice cloning and full AI influencer creation give studios and solo creators new revenue lines that are native to digital-first audiences, while token-gated access and NFTs turn exclusivity into programmable assets. Economics are central to the pitch. SUBBD targets platforms that currently take up to 70% in fees, offering crypto-native payments, global access, and on-chain governance instead. The presale has already raised over $1.3M and tokens are priced at $0.0571. See what our experts’ price prediction is for SUBBD Token . Staking rewards of 20% APY are on offer for early adopters of $SUBBD. But that’s not the only benefit for $SUBBD holders. You also get access to exclusive content, platform multipliers, discounts, and a whole heap more. If you believe the next leg of crypto growth will be driven by real products rather than pure speculation, SUBBD is framing itself as an infrastructure bet on tokenized content, AI-driven engagement, and user-owned economics. If you’re rotating out along the risk curve as Circle grinds higher, it’s one of the better plays. Join the $SUBBD presale today. Remember, this isn’t intended as financial advice, and you should always do your own research before investing. Authored by Aaron Walker , NewsBTC — https://www.newsbtc.com/news/circle-stock–eyes-100-as-crypto-sentiment-rebounds-traders-choose-subbd",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 208,
        "NAME": "ADMINISTRATIVE EVENTS",
        "CATEGORY": "ADMINISTRATIVE EVENTS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55390833,
    "published": 1764938716000,
    "title": "Solana WET presale hijacked by Sybil wallets as HumidiFi resets launch",
    "body": "Bubblemaps CEO Nick Vaiman said Sybil attacks are increasing across presales and airdrops, calling on teams to use KYC or algorithmic detection.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55391199,
    "published": 1764940359000,
    "title": "Stablecoins Threaten Central Banks, Warns IMF as Hard-Money Narrative Fuels Bitcoin Hyper",
    "body": "What to Know: IMF concerns about dollar stablecoins eroding local currencies reinforce the appeal of scarce, non-sovereign assets like Bitcoin in a fragmented monetary system. Bitcoin’s base layer remains constrained by slow confirmations, fee volatility, and minimal smart contract support, creating renewed interest in specialized Layer 2 infrastructure. Competing Bitcoin scaling projects, from Lightning to sidechains, are racing to capture BTC liquidity as programmable capital for payments and DeFi. Bitcoin Hyper uses an SVM-based Layer 2 anchored to Bitcoin to deliver extremely low-latency smart contracts, targeting DeFi, gaming, and high-speed BTC payments. Stablecoins are a threat. At least that’s according to the International Monetary Fund (IMF). In a recent report , the IMF shared concerns that dollar-backed stablecoins might hollow out weaker local currencies and dilute central banks’ control over domestic liquidity. If a digital dollar reaches everyone’s smartphone, what happens to the Peruvian sol, Nigerian naira, or Turkish lira? The report also discussed the positives of stablecoins like cheaper and quicker payments, and a simpler UX, so it wasn’t all doom and gloom. However, the warning does not just read as a technocratic worry. It reinforces a deeper macro story that crypto has been circling for a decade: demand for scarce, non-sovereign assets that cannot be printed at will, especially Bitcoin. In a world of increasingly digital dollars, Bitcoin’s hard cap can look less like a curiosity and more like a hedge. That backdrop is why attention keeps shifting from ‘number goes up’ to ‘what actually gets built on top of Bitcoin.’ If you believe Bitcoin will matter more as a neutral reserve asset, then the highest-beta plays sit in the infrastructure that makes $BTC programmable, spendable, and usable in DeFi at scale. In that lane, Bitcoin Hyper ($HYPER) is trying to position itself as a key liquidity rail. It pitches itself as the first Bitcoin Layer 2 using the Solana Virtual Machine (SVM), aiming to merge Bitcoin’s hard-money appeal with Solana-style throughput and developer tooling. Why Bitcoin Layer 2 Infrastructure Is Back In Focus When a body like the IMF flags dollar stablecoins as a systemic risk for smaller economies, it implicitly admits that monetary power is splitting. You are not just choosing between local cash and a bank account anymore; you are choosing between local fiat, dollar tokens, and non-sovereign assets like Bitcoin at the tap of an app. That split has pushed capital toward Bitcoin itself, but it has also exposed how limited the base layer is for real-world usage. On-chain Bitcoin still moves with minutes-long confirmation times, variable fees, a slow 7 TPS rate , and almost no native smart contract support. Competing Bitcoin scaling efforts have rushed to fill that gap. Lightning Network pursues off-chain payment channels for instant $BTC transfers, while projects like Stacks and Rootstock lean on sidechains and alternative virtual machines to bring DeFi into the Bitcoin orbit. In that growing field, Bitcoin Hyper ($HYPER) is standing out to turn dormant $BTC liquidity into programmable capital using Solana Virtual Machine (SVM) tech and a canonical bridge. See how to buy into the action with our ‘ How to Buy Bitcoin Hyper ’ guide. How Bitcoin Hyper Tries To Turn $BTC Into High-Speed Capital For years, the crypto trilemma suggested you couldn’t have speed, security, and decentralization in one place. Bitcoin Hyper ($HYPER) challenges that by changing the geometry of the network. Instead of forcing Bitcoin to be fast, Bitcoin Hyper accepts Bitcoin as the heavy, secure anchor (Settlement Layer). It then attaches a Ferrari engine on top: a modular SVM Layer 2 (Execution Layer). What does this unlock? Rust-based Smart Contracts: Developers can build complex dApps (Gaming, NFT, DEXs) identical to Solana’s ecosystem. Latency: Sub-second finality that beats Solana’s own benchmarks. Security: State is periodically anchored back to $BTC, preserving the ‘hard money’ thesis. The market is voting with its wallet. The presale has breached $29M, with whales accumulating and making purchases as large as $500K . With a price point of $0.013375 and high-APY staking currently at 40%, Bitcoin Hyper is positioning itself as the execution layer for the next bull run. Our experts predict $HYPER possibly reaching $0.08625 by the end of 2026. If you invested today, that means a potential ROI of over 544%. Don’t miss the upgrade. Buy your $HYPER today. Remember, this isn’t intended as financial advice, and you should always do your own research before investing. Authored by Aaron Walker , NewsBTC — https://www.newsbtc.com/news/imf-warns-stablecoins-threaten-banks-boosting-bitcoin-hyper-layer-2",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55391373,
    "published": 1764940862000,
    "title": "India's DRI Says Smugglers Ditching Hawala Networks for Stablecoins",
    "body": "In a new report, the anti-smuggling agency warns stablecoins like USDT are replacing hawala networks in transnational criminal operations.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||monero|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 57,
        "NAME": "XMR",
        "CATEGORY": "XMR"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55391836,
    "published": 1764942363000,
    "title": "Morning Minute: The CFTC Just Approved U.S. Spot Crypto Trading",
    "body": "Spot crypto trading is now cleared to go live with any CFTC-registered exchange, bringing down another barrier to institutional adoption.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Opinion",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55391765,
    "published": 1764942091000,
    "title": "Surprise Fed Warning Reignites Bitcoin Price Crash Fears",
    "body": "Shark Tank star investor Kevin O’Leary has warned he doesn’t expected the Federal Reserve to cut interest rates next month...",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55391771,
    "published": 1764941913000,
    "title": "Buy every dip? How pro hodlers blend surgical DCA with rules-based crypto buys",
    "body": "Pros don’t “ape the dip” on gut feel; they predefine their allocation, let rules-based systems do the buying, and use DCA-style flows as part of a disciplined, data-driven execution plan.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55391926,
    "published": 1764942467000,
    "title": "Bitcoin accumulation trends strengthen as realized losses near $5.8B",
    "body": "Bitcoin whales are accumulating at a record pace amid almost $5.8 billion in capitulation losses, signaling a potential bullish reversal.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55392297,
    "published": 1764943841000,
    "title": "Bitcoin Is Breaking From Stock Rally for First Time in a Decade",
    "body": "The S&P 500 has climbed more than 16% in 2025, while Bitcoin is down 3% — the first time since 2014 that stocks have rallied while the token is down, according to data compiled by Bloomberg.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55392116,
    "published": 1764943210000,
    "title": "From DOGE to Bitcoin: How fiat accidentally ‘orange-pilled’ Elon Musk",
    "body": "Elon Musk’s viral comments on Bitcoin’s intrinsic ties to energy and physics signal a changing attitude toward Bitcoin from Tesla’s founder.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55392387,
    "published": 1764944050000,
    "title": "XRP ETFs near $1 Billion, Sovereign wealth funds buying Bitcoin, CFTC approves U.S spot crypto trading - Daily Crypto Recap",
    "body": "",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55392604,
    "published": 1764945538000,
    "title": "Russian Banking Giant VTB to Become Country's First to Offer Spot Crypto Trading: Report",
    "body": "In 2026, VTB plans to be the first Russian bank to allow clients access to spot crypto trading services.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Russia|Spot Trading|banks|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55392839,
    "published": 1764945004000,
    "title": "Do Kwon Should Get 12 Years for ‘Colossal’ Crypto Fraud, US Says",
    "body": "Terraform Labs Pte. co-founder Do Kwon should be sentenced to 12 years in prison for the fraud that led to the TerraUSD stablecoin’s $40 billion collapse in 2022, US prosecutors said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 34,
        "NAME": "LUNA",
        "CATEGORY": "LUNA"
      }
    ]
  },
  {
    "id": 55393140,
    "published": 1764947432000,
    "title": "Crypto Sector Lit Up Bright Red as Bitcoin Slips Back to $90K",
    "body": "Softer than expected private inflation data did spark some hope that the Friday decline could reverse.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Market Wrap|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55393460,
    "published": 1764948617000,
    "title": "Has the DAT Bubble Already Burst? CoinShares Says In Many Ways, Yes.",
    "body": "Digital-asset treasury plays that once traded at big premiums have fallen back toward net asset value.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Digital Asset Treasury|CoinShares|Strategy|Analysts|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 55393320,
    "published": 1764948164000,
    "title": "European Crypto Scam Network Dismantled After Laundering $815M",
    "body": "Authorities across Europe took down a massive crypto fraud and laundering network tied to fake investment platforms, deepfake ads and call-center operations.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Europe|Europol|Fraud|Crime|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55393318,
    "published": 1764948030000,
    "title": "Strategy Stock Still a Buy at Cantor After Plunge Forces Major Price Target Cut",
    "body": "Lower adjusted net asset value multiple means Strategy can no longer issue equity at a premium, threatening its long-term plan to accumulate more bitcoin, analyst Brett Knoblauch wrote.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Strategy|Mizuho Bank|Analysts|Cantor fitzgerald|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55393665,
    "published": 1764949405000,
    "title": "US prosecutors request 12 years in prison for Terraform’s Do Kwon",
    "body": "A sentencing recommendation said that Do Kwon had caused more losses than Sam Bankman-Fried, Alex Mashinsky and Karl Sebastian Greenwood combined.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55393563,
    "published": 1764949104000,
    "title": "MARA Trades at a Premium Factoring in Its Debt, Not a Discount: VanEck’s Sigel",
    "body": "VanEck’s Matthew Sigel argues MARA’s valuation looks expensive when adjusted for its leverage and capital structure.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Marathon|Bitcoin News|MicroStrategy|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55393780,
    "published": 1764949865000,
    "title": "Turkey's Paribu Buys CoinMENA in $240M Deal, Expanding Into High-Growth Crypto Markets",
    "body": "With the acquisition, Paribu gains regulatory foothold in Bahrain and Dubai and access to the region's fast-growing crypto user base.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Paribu|Turkey|Acquisitions|Crypto Exchanges|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55393977,
    "published": 1764950610000,
    "title": "Maryland Man Sentenced for Helping North Korea Infiltrate U.S. Tech Firms",
    "body": "The scheme enabled overseas DPRK operatives to access sensitive government systems through fraudulent IT jobs.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      }
    ]
  },
  {
    "id": 55394328,
    "published": 1764952091000,
    "title": "Polish lawmakers fail to revive controversial crypto bill after presidential veto",
    "body": "Poland’s parliament upheld a veto on the Crypto-Asset Market Act, delaying EU-aligned regulation and deepening divisions over security and innovation.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55394386,
    "published": 1764952390000,
    "title": "Trump DOJ Wants Terra Founder Do Kwon Behind Bars for 12 Years, Citing SBF Sentence",
    "body": "Federal prosecutors reserved the right to pursue up to 12 years for Terra founder Do Kwon in an August plea deal. Now, they’re seeking that maximum.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "terra-luna-2|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55394706,
    "published": 1764953906000,
    "title": "US Prosecutors Seek 12-Year Sentence for Terraform Founder Do Kwon in Crypto Fraud Case",
    "body": "The collapse of Do Kwon's Terraform project caused losses that surpassed those by Sam Bankman-Fried's FTX, Celsius and OneCoin combined, the prosecutors argued.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Do Kwon|Terraform|Terra luna|Southern district of new york|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55395828,
    "published": 1764956815000,
    "title": "New IMF Report Warns of Stablecoin Risk, Sparking Criticism From Experts",
    "body": "The IMF released a report that campaigns in favor of CBDCs and warns against the risk stablecoins represent, sparking criticism among crypto experts.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|IMF|central banks|Stablecoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55396154,
    "published": 1764957627000,
    "title": "Trend Reversal Puts Dogecoin On A Path To $0.188",
    "body": "Dogecoin has quietly been trying to find its footing again. The price has started to firm up after a period of declines that dragged the meme coin to as low as $0.134 in early December, trading around $0.14 to $0.15 and showing signs that bearish pressure might be easing. In that backdrop, a recent chart analysis shared by crypto analyst BitGuru on X shows that Dogecoin could be forming a bullish base, and it offers a possible setup for a rebound towards $0.2. A Recovery Attempt Begins To Take Shape The daily candlestick price chart shows Dogecoin rebounding from the lower boundary of its demand zone after briefly dipping beneath it on December 1. That bounce is significant because it represents the willingness to defend the area that held price earlier in July and again during the October pullback. This playout means that Dogecoin has now created a higher low relative to the November breakdown, and this detail means that bullish movement might be moving in. Related Reading: The MicroStrategy Of Asia: Japanese Company Announces Plan For Bitcoin And XRP Treasury As it stands, Dogecoin’s price is now pushing back toward the middle of the broader range highlighted in green and teal on the chart below. Recent bullish candle closes on the daily timeframe show that the Dogecoin price is trying to push into that region once again, suggesting that buyers have begun testing the strength of mid-range resistance. The chart reflects this pattern by displaying earlier price expansions in July and September, both of which unfolded after the Dogecoin price created a higher low. Dogecoin Price Chart. Source: @bitgu_ru On X Dogecoin On A Path To $0.188 Dogecoin’s higher-low structure is the signal BitGuru highlights as the earliest sign that momentum may be shifting. Now that the price is now climbing away from the demand zone, the first area to watch is the dotted mid-range line on the chart, which is at $0.188. A clean move above that level would mean that buyers have regained control of the market structure. This could open the door for a broader recovery and see Dogecoin returning above $0.20. Related Reading: XRP Price Is Performing As Expected; Analyst Reveals What Comes Next At its current price of $0.148, the targets at $0.188 and $0.20 represent gains of roughly 27% and 35%. These levels fall within a range of short-term price targets that Dogecoin could realistically reach before the end of the year if there’s even a little bullish momentum. However, Dogecoin’s near-term outlook isn’t just about its own chart. Its fate is linked to the broader crypto market, especially Bitcoin. Therefore, Dogecoin’s price action might remain vulnerable to more declines and consolidations unless the wider crypto market turns bullish again. On the other hand, tentative signs of recovery, including rising trading volume, point to a bullish setup for Dogecoin. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55396077,
    "published": 1764957370000,
    "title": "Bitcoin, Ethereum and XRP Dive as Liquidations Hit $500 Million—While Stocks Rise",
    "body": "Bitcoin is back below the $90,000 mark as Ethereum flirts with another dip below $3,000—all while major stock indices stay green.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55397701,
    "published": 1764961254000,
    "title": "The $13.5 Billion Liquidity Injection That Could Send Bitcoin And Crypto Prices Flying",
    "body": "Bitcoin has been struggling to build momentum in recent weeks, and the return of cash into the system is raising questions about whether this could be the moment that changes the tone of the crypto market. That growing sense of anticipation has already started to show up in prices, with the total crypto market cap climbing more than $250 billion from its $3.016 trillion low on December 2. What Happened: The Liquidity Injection And Why It Matters After officially bringing its multi-year quantitative tightening (QT) program to an end, the central bank followed up with a $13.5 billion overnight repo operation, funneled through the New York Fed. Banks brought $13.5 billion in Treasuries to the Fed, the Fed accepted all of it, and instantly injected $13.5 billion of fresh reserves into the system. Related Reading: A Bitcoin Parabolic Rally Is Coming: Eric Trump Shares Why First Family Is Pro-Crypto The move, which is the second-largest liquidity injection since the COVID-19 crisis, effectively puts an end the steady shrinkage of bank reserves that has persisted for years, easing pressure on short-term funding markets and signaling a more accommodative liquidity environment. The crypto market responded almost instantly. A handful of major assets began turning green within hours of the injection, with Bitcoin leading the charge with an instant break above $92,000. The influx was visible at a macro level as well: the total crypto market cap climbed from a December 2 low of $3.016 trillion to $3.269 trillion by December 4. A gain of more than $250 billion in under 48 hours What Investors Should Watch Next Ending QT leads to better liquidity and often create a bullish environment for equities and other riskier investments like cryptocurrencies. However, although a single liquidity event does not guarantee a sustained multi-month rally, this injection stands out not just for its size but for what it represents. Related Reading: 4 Bitcoin Indicators That Led To Market Rallies In The Last 2 Years Have Returned In a CNBC interview, Fundstrat’s Tom Lee stated that the Fed’s decision to stop QT will be a turning point for the cryptocurrency market. Lee pointed out that the last time the Fed ended QT, the market rose about 17% within three weeks. The previous time the Fed brought quantitative tightening to a stop was in July 2019, roughly a year after it began reducing its balance sheet. In the three weeks that followed, the S&P 500 climbed about 5%. Bitcoin’s also initially rallied in the same period, but its strongest reaction came months after, towards late 2019 and early 2020. Featured image from Pngtree, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|cnbc|COVID-19|Fundstrat|QT|quantitative tightening|Tom Lee",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55397731,
    "published": 1764960402000,
    "title": "Bitcoin Options Show Traders Hunkering Down for Crypto Winter",
    "body": "Bitcoin options are showing that traders are betting that the largest cryptocurrency will remain mired in its current trading range in the wake of the fourth-quarter downturn that has cut more than $1 trillion in value from the digital asset market.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55399523,
    "published": 1764965385000,
    "title": "Bitcoin ‘risk off’ signals fire despite traders’ view that sub-$100K BTC is a discount",
    "body": "Bitcoin’s bounce evaporated as the weekly close approaches and traders say multiple risk-off metrics point to a high correction risk for BTC. Is $100,000 by the end of 2025 possible?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55400816,
    "published": 1764968444000,
    "title": "Is The Bitcoin Bottom In? Top Analyst Assigns 91.5% Probability",
    "body": "Crypto analyst Miles Deutscher has issued one of the most forceful bottom calls of this cycle, assigning a 91.5% probability that Bitcoin’s low is already in. In a X thread on December 4, he wrote: “F*ck it. I’m putting my neck on the line here. I’m 91.5% certain that the BTC bottom is in. And if it is, A LOT of people are about to be caught offside.” Is The Bitcoin Bottom In? Deutscher bases his conviction on four “pillars”: market reaction to news, the historical behaviour of FUD events, a shift in flows, and an improving global liquidity backdrop. Each pillar is scored in an internal model that culminates in a 91.5/100 bullish reading. He starts with price behaviour versus headlines. Over recent days, he notes, the market has digested an “influx of bad news” – including renewed Tether FUD, another round of “China banning crypto,” MicroStrategy scrutiny and concerns around a Bank of Japan–driven yen carry trade unwind. “Despite all this bad news, price rallied,” he writes, calling this “the first time since the major selloff began” that Bitcoin has responded positively to a destructive news cycle. He underscores an old trading adage: “The reaction to news is more important than the news itself. This tells you everything you need to know.” Related Reading: US Sen. Lummis Hints At US Bitcoin Buy With ‘Franklin’ Meme The second pillar is a systematic look at whether such FUD clusters tend to coincide with local lows. Deutscher says he backtested “every single time Tether, China, BOJ, and Microstrategy FUD entered the market” in a similar way. His conclusion is stark: “Every single time, these FUD events marked a local bottom. Tether FUD = bottom. China ‘banning’ crypto = bottom. Bank of Japan/carry trade concerns = bottom. Microstrategy FUD = bottom.” On this basis, his AI model assigns the maximum score of 28/28 to this pillar. He cautions that “in isolation, this factor doesn’t matter much,” but argues that, combined with the first pillar, it “starts to paint a convincing bull case.” The third pillar is flows, which he calls “the most critical factor (net buy/sell pressure).” For the past weeks, flows were “aggressively negative” with OG whales selling and ETFs dumping. Recently, he argues, this picture has changed. ETF inflows are “starting to stabilise & uptick,” treasury-company holdings remain stable, and “OG whales have stopped relentlessly dumping (this is clear on the orderbooks).” This earns a 22.5/25 score in his model. He adds one key caveat: as long as DATs exist, “there are material risks.” Related Reading: Why Bitcoin Traders Fear A Repeat Of July 2024’s Crash Next Week The fourth pillar is the liquidity and macro environment. Deutscher notes that market liquidity had been tightening for months, but now “things are shifting back toward increased market liquidity,” with global financial conditions “reloosened to near highs.” He highlights “macro tailwinds” and adds that a new, potentially more dovish Fed chair is coming and “QT has now officially ended.” This set of factors receives a 9/10 score in his framework. Aggregating all four pillars leads to the headline figure: “With all four market pillars taken into account, we arrive at a final score of 91.5/100.” Deutscher, however, explicitly lists caveats. He points out that US markets “have been on a massive run” and may need to cool off, that DATs “are still seeing some short-term pressure,” and that ETF flows “can flip negative at any time.” His conclusion is probabilistic rather than absolute: “Markets are a game of probabilities, and I think the odds are in favour of the bottom being in – given the extreme FUD we’ve had and the market’s reaction to it.” At press time, Bitcoin traded at $91,035. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|Is The Bitcoin Bottom In",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55400584,
    "published": 1764967773000,
    "title": "AI-powered studio Mugafi partners with Avalanche to tokenize entertainment IP",
    "body": "The collaboration aims to bring more than 1,000 entertainment properties onchain and establish a new framework for funding and distributing media as real-world assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55401153,
    "published": 1764968990000,
    "title": "Tether solvency fears are ‘misplaced’ as company sits on large surplus: CoinShares",
    "body": "James Butterfill counters claims about Tether’s solvency, pointing to a multibillion-dollar surplus despite new criticism from Arthur Hayes and S&P Global.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55401501,
    "published": 1764969947000,
    "title": "New 'Postal' Game Canceled One Day After Reveal, Following Generative AI Allegations",
    "body": "Postal: Bullet Paradise has been scrapped and the developer is shutting down after gamers claimed the trailer used generative AI assets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Gaming",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55402412,
    "published": 1764972055000,
    "title": "Binance Founder Crushes Bitcoin Critic In Game-Changing BTC Vs. Gold Debate",
    "body": "The Binance Blockchain Week event in Dubai became the center of a high-stakes showdown between traditional and digital innovation, with Bitcoin and gold going head-to-head. Investors, tech enthusiasts, and financial experts watched closely as Binance founder Changpeng Zhao expertly debated renowned Bitcoin critic Peter Schiff, making a compelling argument for why Bitcoin is better than gold. Binance Founder Dominates Bitcoin And Gold Debate During the Binance Blockchain Week in Dubai, Schiff and CZ faced off in a high-profile debate over the value of Bitcoin versus Gold. Schiff defended gold as a safe, stable, and tangible asset while the Binance founder made a compelling case for Bitcoin’s adoption, utility, value, and global reach. Related Reading: Crypto CEO Says Bitcoin Was Never Meant To Be ‘Digital Gold’ – So What Is It? Throughout the debate, which lasted over an hour, CZ consistently demonstrated the practical advantages of Bitcoin, leaving Schiff’s gold argument largely on the defensive. The Binance founder emphasized Bitcoin’s transparent and predictable supply and its role in the modern financial systems. He pointed to hundreds of millions of users who rely on Bitcoin for payments, savings, and transfers. Schiff argued that Bitcoin lacks inherent value and is mainly driven by hype and faith that its price will rise. He stated that gold remains tangible, centuries old, scarce, and valuable in industry, making it superior to BTC. He further asserted that “nobody needs” Bitcoin and that the cryptocurrency is “backed by nothing.” Practical demonstrations played a key role in the debate between Schiff and CZ. The Binance founder explained how Bitcoin and crypto payments already improve financial efficiency, especially in emerging markets. Schiff questioned whether these transactions truly count as money, since merchants ultimately receive traditional currency. CZ’s response highlighted the importance of adoption and network effects, noting that people who use BTC directly for payments give it real-world significance. The debate also considered the preferences of younger generations. CZ asked Schiff whether millennials and Gen Z favoured Bitcoin or gold. The Bitcoin critic responded sharply, suggesting that they would choose gold. He pointed out that, with many young investors losing money on BTC, gold offers a safer, more appealing alternative. The Binance founder countered that younger people understand digital value more intuitively and prefer mobile, borderless, and censorship-resistant assets. Digital Value And The Future Of Money The debate between CZ and Schiff also highlighted the changing definition of money. Bitcoin functions as a decentralized network that enables instant settlement and transparent verification. Its adoption has also helped evolve the financial economy, facilitating faster and more seamless cross-border payments. Schiff argued that gold’s scarcity and industrial demand preserve its value and make it a reliable hedge against economic uncertainty. Related Reading: What Happens To The Bitcoin Price If It Follows Gold? Tokenization also became a point of agreement during the discussion, with Schiff emphasizing that gold can be digitized and tokenized for easier ownership and distribution without moving the physical metal. CZ contended that Bitcoin offers similar advantages while also enabling global financial inclusion. They also discussed the supply of both assets, with the Binance founder noting that Bitcoin has a visible supply, while gold doesn’t. They also talked about the performance of both assets over the years. Schiff argued that gold had outperformed BTC over the past four years. CZ contended that Bitcoin has far outpaced gold over the last 8 years, and since its launch in 2009, it has skyrocketed from a few cents to an ATH above $126,000. He concluded his debate, predicting that Bitcoin’s growth will outpace gold over time. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|Binance|Binance Blockchain Week|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|changpeng zhao|gold|peter schiff",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55403962,
    "published": 1764975612000,
    "title": "Russia Steps Deeper Into Crypto As State Bank Prepares Direct Trading",
    "body": "VTB, Russia’s second-largest bank, has told clients it plans to let them buy and sell real cryptocurrencies through its brokerage service, with a target rollout in 2026 pending regulator approval. Related Reading: Bitcoin Crash Fails To Shake Ripple CEO — He Still Calls For $180K According to the bank, the move would go beyond the derivative products that most Russian banks have offered so far. It is a clear shift toward opening traditional finance to digital assets, at least for now among wealthy clients. Client Eligibility And Timetable Reports have disclosed that VTB intends to begin with high-net-worth customers only. The bank set thresholds for its initial offering: clients with assets above $1.3 million or annual income over $649,000 would be eligible at first. Andrey Yatskov, who heads VTB’s brokerage arm, said there is “sharp demand” from clients for access to actual crypto, not just paper products tied to token prices. The bank has picked 2026 as the planned start year, but it made that clear the launch depends on regulators signing off. Real Crypto, Not Just Contracts Based on reports, the service would allow ownership of the underlying coins — not merely derivative contracts or token-linked notes. That is a significant distinction in Russia, where until recently banks were limited to offering exposure through derivative instruments. Allowing customers to hold coins directly would require legal and compliance work, from custody arrangements to anti-money-laundering controls. Those steps are on the critical path before any retail expansion can happen. Potential Market Signals VTB has also given investors a sense of how it views crypto as an asset class. The bank recommended a 7% allocation to crypto for some investor profiles, and its internal forecasts have mentioned medium-term Bitcoin price targets in the $200,000–$250,000 range under favorable conditions. If VTB moves forward, it could be the first major Russian bank to operate in this way — a signal that some parts of the financial sector see token ownership as something to be offered through mainstream channels. Related Reading: A New Era Begins: CFTC Approves Spot Bitcoin On Regulated US Markets Regulatory Hurdles And Geopolitics The plan is not risk free. Russian regulation of crypto is still evolving, and any permit to offer direct trading will require approval from the relevant authorities. Sanctions and other geopolitical pressures could alter timelines or force changes to how the service is structured. Compliance teams will need to reconcile domestic rules with international restrictions that affect many big banks operating in or dealing with Russia. For now, the rollout remains conditional. VTB’s timeline, client criteria, and product design all hinge on legal clarifications and regulator consent. Market participants and clients will likely follow announcements from the Bank of Russia and other agencies to judge how soon broader access might come. Featured image from Pexels, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|bitcoin|btc|btcusd|crypto|digital currency|russia|VTB",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55406378,
    "published": 1764980627000,
    "title": "Strategy raised $1.44B to dispel ‘FUD’ amid a Bitcoin down cycle: CEO",
    "body": "Strategy CEO Phong Le said his firm raised 21 months of dividend runway in just eight days to head off investor unease.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55407358,
    "published": 1764982851000,
    "title": "Bitcoin Adoption Is Just Getting Started — 200x Growth Possible, Tom Lee Says",
    "body": "Fundstrat’s Tom Lee told attendees at Binance Blockchain Week that he believes the worst leg of the recent crypto slump is likely over and that markets may be ready for a gradual recovery. He pointed to weakening selling pressure and growing underlying activity as reasons for cautious optimism. Related Reading: A New Era Begins: CFTC Approves Spot Bitcoin On Regulated US Markets Market Sentiment May Be Near A Turning Point According to Lee, mood on the street turned darker after October, with many investors showing fatigue after steady losses. He said the current selling looks closer to exhaustion than to the start of another major decline. Trading desks have cut back. Volume has thinned. Sentiment is low. Lee argued that often, when pessimism peaks, conditions for a reversal begin to form. Bitcoin Drawdowns Are Not Uncommon Based on reports, Bitcoin has fallen about 36% from its all-time high in the recent retreat. That size of drop has happened in prior cycles, including 2017 and 2021, and has been followed by rallies that reached new records. “Crypto prices likely bottomed. The best years of growth are still ahead: there is 200x adoption to come.” – Tom Lee, Chairman of Bitmine pic.twitter.com/fPWbWdaosO — Binance (@binance) December 4, 2025 Lee pointed to long-term returns for bitcoin and ether compared with some traditional assets over the last decade, saying crypto’s gains were larger. He used that history to support the idea that patient holders have been rewarded after past stress. Tokenization Could Be A Major Story In 2026 Lee also presented tokenization as a key theme for the future. He said large institutions are preparing to move more financial products on-chain and that, if real estate joins the shift, close to a quadrillion dollars in assets could eventually be tokenized. Stablecoins were cited as an early example of why tokenized instruments can attract demand. He suggested that a broader institutional push could add steady interest to the market over time. BlackRock’s Bitcoin ETF Was Highlighted As A Signal Reports have disclosed that BlackRock’s bitcoin ETF has become one of the firm’s top fee-earning products, a fact Lee used to show growing involvement from legacy finance. That kind of institutional participation, he argued, points to deeper engagement from big players who were previously on the sidelines. Related Reading: Bitcoin Crash Fails To Shake Ripple CEO — He Still Calls For $180K Adoption Gap Suggests Large Upside According to Lee, only 4.4 million bitcoin wallets hold more than $10,000 in BTC, while nearly 900 million people globally have more than $10,000 in retirement savings. He said that gap shows how early the market still is and argued that if just a fraction of those savers put money into bitcoin, adoption could expand by as much as 200 times. The figure is speculative, he acknowledged, but he used it to show the potential scale for future demand. What This Means For Investors Now Lee questioned whether the old four-year cycle should be used as a strict guide. He suggested recent moves were driven more by de-leveraging and structural shifts than by the halving rhythm that shaped earlier cycles. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|etf|Fundstrat|Tom Lee",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55408925,
    "published": 1764986443000,
    "title": "Bitcoin Price Faces Potential 60% Decline As Expert Warns Of ‘Major Bull Trap’",
    "body": "Despite the Bitcoin price recovery above the crucial $90,000 threshold—a level that has historically served as a supportive floor for the cryptocurrency—the market is exhibiting signs that a further correction may be imminent. Bitcoin Price Recovery At Risk? Market expert Rekt Fencer recently shared insights on social media platform X, formerly known as Twitter, suggesting that the Bitcoin price might be forming what he calls a “massive bull trap.” This term refers to a deceptive bullish signal in which the price briefly surpasses a resistance level, in this case, the $90,000 mark, only to reverse into a decline. Such movements can entrap investors who bought in during the peak, leading to significant losses. Related Reading: XRP Price Predictions: AI Forecasts $4.40 By March 2026, Analysts Target Up To $6 Fencer pointed out a troubling pattern reminiscent of early 2022 when Bitcoin reclaimed its 50-week moving average (MA)—currently positioned above $102,300—before experiencing a severe decline of roughly 60%, plummeting below $20,000 by June of that year. He indicated that the recent price recovery following major drops to $84,000 should not be interpreted as a signal of near-term success, especially since the Bitcoin price is currently trading under the 50-week MA. If historical trends repeat, this could mean that Bitcoin might see a significant drop, potentially reaching around $36,200, which could potentially represent the low point of the bearish cycle for the cryptocurrency. On the other hand, there are analysts who retain a bullish outlook. BTC Bottom In Sight? Market researcher and analyst Miles Deutscher expressed a confident sentiment, stating he believes there is a 91.5% likelihood that the Bitcoin price has hit its bottom, based on his analysis of key developments. He noted that recent weeks have been dominated by negative news stories, including concerns surrounding Tether (USDT) and the implications of China’s actions on crypto, which he asserts often mark local price bottoms. Moreover, Deutscher pointed out a shift in market flows from predominantly bearish to bullish. He explained that the trading environment has recently seen a resurgence in buying momentum, with large investors, or “OG whales,” ceasing their selling. This change has been reflected in the order books, indicating a possible stabilization in market sentiment. Related Reading: Ethereum Fusaka Upgrade Goes Live Today: Experts Predict Potential Supply Crunch Ahead Additionally, the liquidity landscape appears to be shifting, with market conditions tightening in recent months. The potential appointment of a new Federal Reserve chair known for dovish policies, coupled with the official end of quantitative tightening (QT), could further influence market dynamics in favor of buyers. Deutscher concluded by emphasizing that given the extreme levels of fear, uncertainty, and doubt (FUD) in the market, combined with improvements in trading flows, he believes that the odds favor the notion that the Bitcoin price has indeed reached its bottom. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|bitcoin technical analysis|btc|BTC news|btc price|BTCUSDT|crypto|crypto market|crypto news|cryptocurrency",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55409932,
    "published": 1764988496000,
    "title": "Strive calls on MSCI to rethink its ‘unworkable’ Bitcoin blacklist",
    "body": "Strive CEO Matt Cole has urged the MSCI to “let the market decide” whether they want to include Bitcoin-holding companies in their passive investments.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55410446,
    "published": 1764990034000,
    "title": "Bitcoin Price Slides Below $90,000 – Is A Retest Of The November Lows Near?",
    "body": "Bitcoin (BTC) is retesting a crucial support area after its price slid 5% from the recent highs and fell below the $90,000 barrier. Some analysts have suggested that the cryptocurrency’s structure remains intact, but warned that it must bounce quickly or risk retesting the November lows. Related Reading: XRP ETFs Record 13-Day Streak As SOL Funds See Largest Outflows Since Launch Bitcoin Retests $88,000 After Rejection On Friday, Bitcoin lost the recently reclaimed $90,000 level, falling to a key support area before stabilizing. The flagship crypto has been attempting to recover from the November market correction, which sent its price to a seven-month low of $80,600. Since reaching its local lows two weeks ago, the cryptocurrency has traded within a macro re-accumulation range, between $82,000 and $93,500, attempting to break out of this zone on Wednesday, when it reached a multi-week high of $94,150. However, as the first week of December approaches its end, BTC has lost the upper area of its local range again, falling below its monthly open and tapping the $88,000 support. Amid the drop, Analyst Ted Pillows noted that BTC has been struggling to reclaim the $94,000 resistance, adding that price “wants to go lower here before another breakout attempt.” Therefore, he suggested that a bounce back from the $88,000-$89,000 support zone is likely. Altcoin Sherpa affirmed that the ongoing retest would confirm whether the recent bounce was “just lower highs and price is going lower or if we actually have any juice to bounce to like 100k or something.” The analyst outlined two potential outcomes. In the first scenario, the flagship crypto would retrace to the $87,000-$89,000 area and bounce above the $93,000-$94,000 resistance levels. In the second scenario, Bitcoin would continue to move sideways below the local resistance before eventually sliding to the November lows and potentially lower levels. Per the analysis, the leading cryptocurrency must bottom quickly, or it will risk the second outcome. BTC Shows Shallowing Pullback Tendency Analyst Rekt Capital also pointed out that Bitcoin continues to face rejection from the range high resistance. However, he considers that investors should not worry as long as the pullback isn’t as big as the previous ones. If “the rejection is shallower than the previous two, then this resistance will continue to weaken until eventually breached,” he explained, adding that “as long as this weakening continues, BTC should be able to finally breach this resistance over time & try to challenge the multi-week Downtrend above.” Earlier this week, the analyst affirmed that BTC’s consolidation structure will remain intact as long as Bitcoin closes the week above the range lows. He also noted that its Macro Downtrend, which “has been dictating resistance throughout this phase of the cycle,” remains the dominant structural barrier and the level to break. Related Reading: Solana Eyes Major Resistance After $140 Reclaim, But Analyst Questions SOL’s Strength As the price stabilized between the $88,500-$89,350 area, the analyst added that today’s retracement “continues to be a shallower pullback than the previous two,” which keeps the range “‘retrace shallowing’ tendency” intact. He noted that Bitcoin could technically drop into the ascending two-week support trendline, or tap the $86,000 level and still perform a shallower correction than the recent 10% drop. As of this writing, Bitcoin is trading at $89,400, a 2.9% decline in the daily timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|bitcoin price|Bitcoin Retrace|btc|BTC breakdown|BTC breakout|BTCUSDT|crypto analyst|crypto market bull run 2025|crypto market correction|Crypto trader",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55411913,
    "published": 1764993633000,
    "title": "Bitcoin Bull Run Set To Last Until 2027, Analysts Highlight Influential Factors",
    "body": "Many in the crypto space have echoed a familiar sentiment over recent months: “The four-year crypto market cycle is dead.” Experts from the Bull Theory assert that while the four-year cycle may have come to an end, the Bitcoin bull run itself is merely delayed and could stretch until 2027. Why The Four-Year Cycle May Be Ending In a recent post on social media platform X, formerly known as Twitter, the Bull Theory analysts noted that the concept of Bitcoin adhering to a neat four-year cycle is weakening. They highlighted that significant price movements over the last decade weren’t solely driven by Halving events; rather, they were influenced by shifts in global liquidity. The analysts pointed to the current landscape of stablecoin liquidity, which remains high despite recent downturns, indicating that larger investors are still engaged in the market, poised to invest when appropriate macroeconomic conditions arise. Related Reading: XRP Price Predictions: AI Forecasts $4.40 By March 2026, Analysts Target Up To $6 In the US, Treasury policies are emerging as pivotal catalysts. The recent buybacks are notable, but the analysts emphasize that the larger narrative lies in the Treasury General Account (TGA) balance, which is currently around $940 billion—almost $90 billion above its normal range. This surplus cash is likely to flow back into the financial system, enhancing financing conditions and adding liquidity that typically gravitates toward risk assets. Globally, the trends appear even more promising. China has been injecting liquidity for several months, while Japan recently announced a stimulus package worth approximately $135 billion, alongside efforts to simplify cryptocurrency regulations. Canada is also moving toward easing its monetary policy, and the US Federal Reserve (Fed) has officially halted its quantitative tightening (QT) measures—a historical precursor to some form of liquidity expansion. Political And Monetary Factors Align To Create Bullish Condition The analysts explained that when major economies adopt expansive monetary policies simultaneously, risk assets like Bitcoin tend to respond more rapidly than traditional stocks or broader markets. Additionally, potential policy tools, such as the Supplementary Leverage Ratio (SLR) exemption—implemented in 2020 to allow banks more flexibility in expanding their balance sheets—could return, resulting in increased credit creation and overall market liquidity. There is also a political dimension to consider. President Trump has discussed potential tax reforms, including abolishing income tax and distributing $2,000 tariff dividends. Furthermore, the likelihood of a new Federal Reserve chair who supports liquidity assistance and is constructive toward cryptocurrency could bolster conditions for economic growth. Extended Bitcoin Uptrend Historically, whenever the Institute for Supply Management’s Purchasing Managers’ Index (ISM PMI) surpasses 55, it has been followed by periods of altcoin season. The probability of this occurring in 2026 appears high, according to the Bull Theory. Related Reading: Trend Reversal Puts Dogecoin On A Path To $0.188 The convergence of rising stablecoin liquidity, the Treasury’s injection of cash back into markets, global quantitative easing, the cessation of QT in the US, potential bank-lending relief, pro-market policy shifts in 2026, and major players entering the crypto sector suggests a very different scenario than the old four-year halving model. The analysts concluded that if liquidity expands concurrently across the US, Japan, China, Canada, and other significant economies, Bitcoin is unlikely to move counter to that trend. Therefore, rather than experiencing a sharp rally followed by a prolonged bear market, the current environment indicates a more extended and broader uptrend that could span through 2026 and into 2027. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin bull run|Bitcoin chart|Bitcoin news|bitcoin price|bitcoin technical analysis|btc|BTC news|btc price|BTCUSDT|crypto|crypto market|crypto news|cryptocurrency",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]