[
  {
    "id": 57579793,
    "published": 1769738913000,
    "title": "US Finalizes Forfeiture of $400 Million Tied to Helix Darknet Mixer",
    "body": "The mixer processed hundreds of millions of dollars in Bitcoin that prosecutors say were tied to illicit activity on the dark web.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57580231,
    "published": 1769740430000,
    "title": "Bitcoin Price 10% Tumble Sparks Fears Of $80K Give-Way",
    "body": "Bitcoin price started a major decline below $86,500. BTC is down nearly 10% and might soon test the $80,000 support zone. Bitcoin failed to remain above $86,500 and started another decline. The price is trading above $85,000 and the 100 hourly simple moving average. There is a bearish trend line forming with resistance at $83,200 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might dip further if it trades below the $81,000 and $80,000 levels. Bitcoin Price Dips Again Bitcoin price failed to continue higher above the $88,000 zone . BTC started a major decline below the $87,200 and $86,500 levels. The bears were able to push the price below $85,000. It spared major bearish moves, pushing the price below $82,000. A low was formed at $81,000 and the price is still signaling more downsides. There is also a bearish trend line forming with resistance at $83,200 on the hourly chart of the BTC/USD pair. Bitcoin is now trading below $83,200 and the 100 hourly simple moving average . If the price remains stable above $80,000, it could attempt a fresh increase. Immediate resistance is near the $82,000 level. The first key resistance is near the $83,200 level or the 23.6% Fib retracement level of the downward move from the $90,438 swing high to the $81,000 low. A close above the $83,200 resistance might send the price further higher. In the stated case, the price could rise and test the $85,000 resistance. Any more gains might send the price toward the $85,700 level or the 50% Fib retracement level of the downward move from the $90,438 swing high to the $81,000 low. The next barrier for the bulls could be $87,000 and $87,500. More Losses In BTC? If Bitcoin fails to rise above the $83,200 resistance zone, it could start another decline. Immediate support is near the $81,000 level. The first major support is near the $80,500 level. The next support is now near the $80,000 zone. Any more losses might send the price toward the $77,000 support in the near term. The main support sits at $75,000, below which BTC might struggle to recover in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $81,000, followed by $80,000. Major Resistance Levels – $82,000 and $83,200.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57580767,
    "published": 1769742008000,
    "title": "Bitcoin Is The Money Of The AI-Powered Economy: CryptoQuant CEO",
    "body": "CryptoQuant CEO Ki Young Ju revived the “Bitcoin equals energy” thesis on Wednesday, arguing that proof-of-work is becoming the settlement layer for an AI-driven economy where power, not narratives, is the binding constraint. In a post on X, Ju framed Bitcoin as a digital instrument that can price energy with precision in a way commodities can’t. “Energy is money. Bitcoin precisely measures the value of energy,” Ju wrote. “Gold also embeds energy, but it cannot be measured accurately because it is not digital. Bitcoin is the money of an AI-accelerated energy economy.” The Link Between AI, Energy And Bitcoin Ju’s comments were posted alongside a long-form X post by Hashed CEO Simon Kim titled Monetizing Energy: Redefining Bitcoin’s Role in the AI Era, which argues that the old “energy waste” critique is being overtaken by an AI data center buildout that is rewriting the value of mining infrastructure. Kim’s core claim is that the debate has shifted from morality to grid economics and industrial pragmatism. “The oldest criticism of Bitcoin has always been about energy,” he wrote. “Claims that it ‘wastes electricity,’ ‘destroys the environment,’ and ‘competes with data centers for power’ have been repeated for over a decade, solidifying into conventional wisdom. But in 2026, this debate no longer resides in the realm of moral condemnation.” The thread points to capital flows as a tell. Kim highlighted Abu Dhabi sovereign wealth fund Mubadala’s $437 million allocation to BlackRock’s Bitcoin ETF in Q4 2024, followed by a partnership with Oman’s sovereign wealth fund to back Crusoe Energy and launch the Middle East’s first flare-gas mining operation. In October 2025, Mubadala co-led Crusoe’s Series E with a $1.375 billion check, pushing the company’s valuation above $10 billion—at which point Crusoe said it would divest its Bitcoin mining division and focus fully on AI infrastructure. Related Reading: Bitcoin Death Cross That Last Preceded A 66% Drop Is Back Kim’s thesis is that miners have already done the hard, unglamorous work AI now needs: securing power, mastering high-density thermal management, and building operational muscle around flexible load. He also leaned on an Elon Musk quote from a November 2025 podcast: “Energy is the true currency. This is why I say Bitcoin is based on energy. You can’t just pass a law and suddenly have a lot of energy.” A recurring theme in Kim’s post is that electricity’s constraints (locality, immediacy, and transmission losses) make flexibility economically valuable. He cited early examples like Sichuan hydropower curtailment exceeding 20 billion kWh by 2020, and argued that miners became a buyer of last resort for energy that couldn’t be stored or sold. Globally, he claimed curtailed renewable energy exceeds 200TWh annually, representing more than $20 billion in economic losses, positioning Bitcoin mining as an instant monetization path for surplus generation. In Texas, Kim pointed to ERCOT’s classification of mining as a controllable load resource, citing Riot Blockchain cutting power usage by 98–99% during the 2022 winter storm and receiving $31.7 million in power credits during an August 2023 heatwave, more than it would have earned mining that month. The framing is less “miners versus data centers” and more “premium uptime workloads versus interruptible demand that stabilizes the grid.” Related Reading: Bitcoin Won’t Break Out Until The Fed Steps Into Yen/JGB Chaos: Arthur Hayes Kim also argued the environmental critique is changing on the margin as the industry’s energy mix shifts. He claimed more than half of mining now comes from sustainable sources, exceeding 52%, while coal dependence fell from 36% to under 9%. On methane, he described flare-gas mining as an emissions arbitrage: methane has “80 times” the greenhouse effect of CO2, flaring combusts 93% with 7% escaping, while using gas for mining combusts over 99%, cutting CO2-equivalent emissions by over 60% versus flaring. The forward implication of Ju’s framing is that if AI accelerates the premium on reliable power and buildout speed, Bitcoin’s value proposition may increasingly be argued in the language of energy markets: measuring, monetizing, and transporting scarcity. Kim’s closing challenge was explicit: shift the question from consumption totals to system outcomes, suggesting the next phase of the debate will center on where miners sit in the stack of AI-era infrastructure, not whether they exist: “AI operates where continuous uptime is essential; Bitcoin operates where flexibility has value. Governments can print money, but they cannot print energy. Bitcoin’s proof-of-work is the mechanism that brings this physical reality into the digital economy. It’s a technology that takes energy from one place and transports it anywhere.” At press time, Bitcoin traded at $86,779. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|AI|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|ki young ju",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57580780,
    "published": 1769741970000,
    "title": "Bybit made ‘slow but steady comeback’ in 2025 after massive hack: CoinGecko",
    "body": "Bybit‘s market share climbed in 2025, even after it was hacked for $1.5 billion, while trading volumes on the top 10 exchanges rose by 7.6% on average last year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 57580749,
    "published": 1769741830000,
    "title": "Tech Giants Circle OpenAI in Funding Round That Could Top $100 Billion",
    "body": "Amazon’s talks could make it one of OpenAI’s biggest backers as the AI company continues to forge ahead with plans for an IPO this year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 57580584,
    "published": 1769741239000,
    "title": "BlackRock’s BUIDL aids Avalanche tokenization value boom in Q4",
    "body": "Messari reports that institutions put millions of dollars into Avalanche last year, but it didn’t help its token, which fell by nearly 60% in the fourth quarter of 2025.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57580965,
    "published": 1769742530000,
    "title": "Ethereum Price Dumps To $2,700, Bulls Scramble To Defend Support",
    "body": "Ethereum price started a major decline after it failed to clear $3,050. ETH is down 10% and is now struggling to stay above the $2,700 support. Ethereum failed to stay above $2,880 and started a fresh decline. The price is trading below $2,800 and the 100-hourly Simple Moving Average. There is a steep bearish trend line forming with resistance at $2,820 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase if it stays above the $2,700 zone. Ethereum Price Dips 10% Ethereum price failed to remain stable above $2,880 and started a major decline, like Bitcoin . ETH price traded below $2,820 to enter a bearish zone. The bears even pushed the price below $2,750. A low was formed at $2,680 and the price is now showing bearish signs below the 23.6% Fib retracement level of the recent decline from the $3,040 swing high to the $2,680 low. There is also a steep bearish trend line forming with resistance at $2,820 on the hourly chart of ETH/USD. Ethereum price is now trading below $2,800 and the 100-hourly Simple Moving Average . If the bulls remain in action above $2,700, the price could attempt another increase. Immediate resistance is seen near the $2,765 level. The first key resistance is near the $2,820 level and the trend line. The next major resistance is near the $2,860 level and the 50% Fib retracement level of the recent decline from the $3,040 swing high to the $2,680 low. A clear move above the $2,860 resistance might send the price toward the $2,900 resistance. An upside break above the $2,900 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $3,000 resistance zone or even $3,050 in the near term. More Losses In ETH? If Ethereum fails to clear the $2,820 resistance, it could start a fresh decline. Initial support on the downside is near the $2,700 level. The first major support sits near the $2,680 zone. A clear move below the $2,680 support might push the price toward the $2,620 support. Any more losses might send the price toward the $2,550 region. The main support could be $2,500. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI – The RSI for ETH/USD is now below the 50 zone. Major Support Level – $2,700 Major Resistance Level – $2,820",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57581634,
    "published": 1769744425000,
    "title": "Optimism passes buyback proposal to bolster OP token",
    "body": "The Optimism blockchain will begin to sell half of its Superchain revenue to buy back its own token starting next month, with the tokens held for future ecosystem use.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 92,
        "NAME": "OP",
        "CATEGORY": "OP"
      }
    ]
  },
  {
    "id": 57582580,
    "published": 1769747332000,
    "title": "XRP Price Breakdown Accelerates — Can Support Absorb The Shock?",
    "body": "XRP price extended losses and traded below $1.80. The price is now consolidating and might decline further if it remains below $1.8250. XRP price started a fresh decline below the $1.80 zone. The price is now trading below $1.80 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance at $1.8050 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move down if it stays below $1.8250. XRP Price Nosedives XRP price failed to stay above $1.90 and started a fresh decline, like Bitcoin and Ethereum . The price declined below $1.850 and $1.8250 to enter a short-term bearish zone. The price even spiked below $1.750. A low was formed at $1.710, and the price is now consolidating losses. There was a recovery wave above $1.740. The price is approaching the 23.6% Fib retracement level of the downward move from the $1.938 swing high to the $1.710 low. The price is now trading below $1.80 and the 100-hourly Simple Moving Average. If there is a fresh upward move, the price might face resistance near the $1.7650 level. The first major resistance is near the $1.80 level. There is also a key bearish trend line forming with resistance at $1.8050 on the hourly chart of the XRP/USD pair. A close above $1.80 could send the price to $1.8250 or the 50% Fib retracement level of the downward move from the $1.938 swing high to the $1.710 low. The next hurdle sits at $1.850. A clear move above the $1.850 resistance might send the price toward the $1.880 resistance. Any more gains might send the price toward the $1.920 resistance. The next major hurdle for the bulls might be near $1.950. Another Decline? If XRP fails to clear the $1.80 resistance zone, it could start a fresh decline. Initial support on the downside is near the $1.740 level. The next major support is near the $1.720 level. If there is a downside break and a close below the $1.720 level, the price might continue to decline toward $1.70. The next major support sits near the $1.6720 zone, below which the price could continue lower toward $1.650. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $1.740 and $1.720. Major Resistance Levels – $1.7650 and $1.80.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57582887,
    "published": 1769748206000,
    "title": "Rollercoaster bitcoin price moves end up liquidating $1.7 billion in bullish crypto bets",
    "body": "More than $1.7 billion in leveraged positions were liquidated in 24 hours as bitcoin fell to $81,000, with long bets accounting for nearly all the damage amid macro jitters and Fed chair speculation.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57582922,
    "published": 1769748202000,
    "title": "Securitize says revenues up 840% in filing to go public via Cantor SPAC",
    "body": "Securitize’s latest SEC filing showed the company’s revenue had increased nearly tenfold year-over-year as institutions are looking to experiment with tokenization.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 57582696,
    "published": 1769747582000,
    "title": "Bitcoin Slips to $82K as Liquidations Spike to $1.7B",
    "body": "Bitcoin has hit a nine-month low of $82,134 amid escalating policy shifts, including President Trump's Friday Fed Chair announcement.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57583261,
    "published": 1769749224000,
    "title": "Ethereum Drops Below $2,800 As Crypto Liquidations near $1B – Should Investors Worry?",
    "body": "Ethereum (ETH) has retested its crucial $2,800 support level for the second time this week, as the broader crypto market erases all its intraweek gains. Some market observers have weighed in on whether investors should worry about King of Altcoin’s performance. Related Reading: Analysts Say Dogecoin Consolidation Is About To End – Parabolic Run Or Crash Ahead? Ethereum Plunges Amid Broader Market Crash On Thursday, global markets experienced a sharp decline, with stocks, cryptocurrencies, and even precious metals erasing over $3 trillion in market value in just a few hours. Ethereum, the second-largest cryptocurrency by market capitalization, followed the market-wide correction, retracing 6.9% in the daily timeframe. The cryptocurrency has been hovering between $2,800 and $3,300 since the start of the year and attempted to reclaim the upper zone of this range this month. Nonetheless, the recent geopolitical tensions and macroeconomic uncertainty have weakened the appetite for risk assets and halted the crypto market’s early January momentum. According to Binance market data, Ethereum fell below $2,800 on Thursday morning, briefly bouncing before reaching a one-month low of $2,773. Meanwhile, the leading cryptocurrency by market capitalization, Bitcoin (BTC), saw a sharp 6.2% decline, reaching a two-month low of $83,934. Data from CoinGlass shows that crypto liquidations over the past 24 hours surged to nearly $1 billion, with $917.17 million in leveraged positions forcibly closed at the time of writing. During this period, 223,915 traders were liquidated, and the largest single liquidation order happened on Hyperliquid, valued at $31.64 million. Notably, more than half of the liquidations occurred in the past four hours, wiping out over $620 million since the morning. Around $422 million came from Bitcoin positions, while $160 million came from Ethereum positions. ETH Price In ‘Endless Range’ Amid the market correction, some analysts shared their perspective on ETH’s price action. Sjuul from AltCryptoGems highlighted Ethereum’s price range in the daily chart, where the altcoin has hovered over the past two months. According to the analyst, there isn’t a clear trend as Ethereum continues to trade within its “seemingly endless range” between $2,600 and $3,350. He suggested that investors should wait for a proper breakout above the upper boundary or a breakdown from the range lows before celebrating or worrying. Similarly, trader EliZ affirmed that ETH’s macro perspective doesn’t show either real strength or weakness, but “an enormous, forced equilibrium” on the longer timeframes. He pointed out that ETH “continues to move within well-defined boxes, above and below the same levels for months/years, without ever building a directionality that can be described as structural.” Related Reading: Prediction Markets On BNB Chain Explode As Trading Volume Crosses $20B Based on this, the trader asserted that without a successful move and confirmation from its key range, short-term efforts don’t signal a “change of regime. Only liquidity rotation.” “We are not in a bullish phase, nor are we in a bearish phase. We are in a macro stalemate, where the market decides not to decide. Until we see a clean and sustained breakout of the indicated boxes …or a net loss of the same …any strong narrative is just storytelling,” he concluded. As of this writing, Ethereum is trading at $2,798, a 5.3% decline on the weekly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|cfrypto analyst|Coinglass|crypto liquidations|Crypto market crash|Crypto trader|ETH|ETH breakdown|eth price|ethereum|ethereum crash|ETHUSDT|global Market correction",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57583513,
    "published": 1769749865000,
    "title": "Bitcoin falls to $81K, triggering $1.7B in liquidations",
    "body": "Bitcoin plunged to a nine-month low as geopolitical tensions, tariff threats, and tech earnings concerned traders, triggering billions of dollars worth of long liquidations.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57583438,
    "published": 1769749736000,
    "title": "Solana (SOL) Crashes Back To $112, A Level That Could Decide Everything",
    "body": "Solana failed to settle above $125 and extended losses. SOL price is now consolidating losses below $120 and might struggle to start a recovery wave. SOL price started a fresh decline below $120 and $115 against the US Dollar. The price is now trading below $120 and the 100-hourly simple moving average. There is a key bearish trend line forming with resistance at $116 on the hourly chart of the SOL/USD pair (data source from Kraken). The price could start a recovery wave if the bulls defend $112 or $105. Solana Price Dips Again Solana price failed to remain stable above $125 and started a fresh decline, like Bitcoin and Ethereum . SOL declined below the $125 and $122 support levels. The price gained bearish momentum below $120. A low was formed at $112, and the price is now consolidating losses. The price recovered a few points and climbed toward the 23.6% Fib retracement level of the downward move from the $128 swing high to the $112 low. Solana is now trading below $120 and the 100-hourly simple moving average. On the upside, immediate resistance is near the $116 level. There is also a key bearish trend line forming with resistance at $116 on the hourly chart of the SOL/USD pair. The next major resistance is near the $120 level or the 50% Fib retracement level of the downward move from the $128 swing high to the $112 low. The main resistance could be $122. A successful close above the $122 resistance zone could set the pace for another steady increase. The next key resistance is $125. Any more gains might send the price toward the $132 level. Another Drop In SOL? If SOL fails to rise above the $116 resistance, it could continue to move down. Initial support on the downside is near the $114 zone. The first major support is near the $112 level. A break below the $112 level might send the price toward the $105 support zone. If there is a close below the $105 support, the price could decline toward the $102 support in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is losing pace in the bearish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is below the 50 level. Major Support Levels – $112 and $105. Major Resistance Levels – $116 and $120.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Technical analysis|Sol|Solana|solbtc|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57583642,
    "published": 1769750156000,
    "title": "Kevin Warsh emerges as Fed chair favorite with Trump to reveal pick Friday",
    "body": "Kevin Warsh, seen as a more hawkish Federal Reserve chair pick, previously said Bitcoin could serve as a check on fiscal policy decisions.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57584454,
    "published": 1769752814000,
    "title": "XRP Risk-Adjusted Returns Signal Consolidation Rather Than Trend Formation – Details",
    "body": "XRP has slipped below the $1.90 level as selling pressure continues to weigh on the market, reinforcing a cautious tone across recent price action. Attempts at short-term stabilization have so far lacked follow-through, and momentum remains fragile as traders respond to weakening structure rather than clear directional signals. The move below $1.90 places XRP back into a zone where downside risk is being reassessed, particularly in the absence of strong demand on rebounds. Related Reading: Ethereum Leverage Remains At Record High: What Happens Next? A recent report from CryptoQuant provides context for this behavior, pointing to a market stuck in what it describes as a state of cautious equilibrium. According to Binance data, XRP is currently trading around $1.89, while the 200-day moving average sits near $2.54. This leaves price roughly 25% below its long-term trend reference, a gap that clearly signals ongoing structural weakness rather than a confirmed recovery. Historically, sustained bullish phases tend to develop only after price reclaims and holds above the 200-day average. XRP’s continued distance from that level suggests the market is still operating within a corrective range, where rallies are more likely to be sold than extended. While short-term recovery attempts are visible, they remain limited in scope and conviction. Risk-Adjusted Metrics Point to Consolidation The report explains that XRP’s current price action is best understood through a risk-adjusted lens rather than raw price movement. From this perspective, the 30-day Sharpe Ratio sits at just 0.034, a level close to zero. This indicates that over the past month, returns have provided minimal compensation for the risk assumed, a hallmark of markets lacking clear directional conviction. These conditions typically signal a consolidation phase, where volatility compresses, and traders become more selective, making price increasingly sensitive to shifts in liquidity rather than momentum. At the same time, the Sharpe Z-Score has turned positive at approximately 0.70, suggesting a relative improvement in return quality compared with XRP’s recent historical average. However, this reading remains well below the threshold generally associated with statistically significant trend formation. In practical terms, this implies that while selling pressure has eased from prior extremes, the market has not yet transitioned into a regime of strong risk-adjusted performance. Short-term dynamics reinforce this cautious view. The 7-day Sharpe Momentum stands near 0.03, reflecting weak but positive momentum. Although this keeps the indicator marginally above zero, the low magnitude points to gradual base-building rather than impulsive buying. Taken together, these metrics describe a market in balance—no longer under aggressive pressure, but still lacking the conviction and return profile typically seen at the start of sustained uptrends. Related Reading: OKX Launches Crypto Payment Card Across the European Economic Area XRP Remains Below Key Moving Averages XRP price action continues to reflect a market stuck in a corrective and defensive phase. On the daily chart, XRP is trading near $1.87–$1.90, failing to hold recent rebound attempts and remaining firmly below all major moving averages. The 50-day moving average (blue) is trending downward and acting as dynamic resistance, while the 100-day (green) and 200-day (red) averages remain well above price, reinforcing the broader bearish structure. With XRP trading roughly 25% below the 200-day MA, the long-term trend has not yet reset into a bullish regime. Related Reading: XRP Derivatives Reset: Open Interest Drops Nearly 60% From July Peak Structurally, the chart shows a clear sequence of lower highs and lower lows since the October breakdown, confirming sustained selling pressure. The sharp vertical drop in early October marked a decisive trend shift, after which the price has consolidated in a descending range rather than forming a reversal base. Recent attempts to reclaim the $2.10–$2.20 failed quickly. Suggesting weak follow-through from buyers. Selling spikes during downside moves remains more pronounced than buying volume during rebounds, pointing to defensive positioning rather than accumulation. As long as XRP holds below the 50-day and fails to reclaim the $2.20–$2.30 zone, price behavior is more consistent with distribution and consolidation, not trend recovery. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP News|xrp|XRP analysis|XRP consolidation|XRP Correction|xrp news|XRP pirce|XRP Risk-adjusted Returns|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57584360,
    "published": 1769752444000,
    "title": "Democrats Press DOJ Deputy Over Crypto Holdings, Enforcement Retreat",
    "body": "A group of Democratic senators is pressing the Justice Department over ethics questions tied to a rollback in crypto enforcement.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57584207,
    "published": 1769752002000,
    "title": "Here's why Fed contender Kevin Warsh is seen as bearish for bitcoin",
    "body": "BTC fell deeper to nearly $81,000 late Thursday as Warsh's odds surged in betting markets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Federal Reserve|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57584216,
    "published": 1769751930000,
    "title": "Bitcoin ‘to keep bleeding against stock market’ as cycle wraps: Analyst",
    "body": "Bitcoiners hoping for a big rotation from gold and silver might be chasing the wrong signal, says Benjamin Cowen.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57584814,
    "published": 1769753412000,
    "title": "Circle says durable stablecoin infrastructure will coax adoption",
    "body": "Circle has flagged scaling its payments network and institution-focused blockchain as a 2026 priority as companies look to examine how to use stablecoins.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      }
    ]
  },
  {
    "id": 57585123,
    "published": 1769754621000,
    "title": "Binance to shift $1 billion user protection fund into bitcoin amid market rout",
    "body": "Binance will convert the stablecoin holdings in its $1 billion Secure Asset Fund for Users to bitcoin over the next 30 days, with plans for regular audits.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Binance|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57587208,
    "published": 1769761808000,
    "title": "XRP To $100? Ex-Ripple CTO David Schwartz Weighs In On The Hype",
    "body": "Ex-Ripple CTO David “JoelKatz” Schwartz pushed back on viral XRP price calls, arguing that today’s market price is already a referendum on how much credible capital actually believes in a near-term path to $100. His comments also spilled into a broader discussion about XRPL economics and scaling tradeoffs that, in his view, get lost in the hype cycle. Can XRP Reach $100? Schwartz was responding to an X user urging him to tell “xrp supporters” that XRP “can’t and won’t go to 50-100$,” warning that “So many people get poor with investing in xrp.” Schwartz declined to make an absolute claim, but framed the debate in probabilistic terms, pointing to his own history of being surprised by crypto’s upside. Related Reading: 21Shares Drops 3 XRP Price Predictions For 2026: What’s The Upside? “I don’t feel comfortable saying something like that,” Schwartz wrote. “While I don’t think it’s likely, I didn’t think it was likely that XRP would ever hit $0.25. I started selling XRP at $0.10 because it seemed insane. I remember when bitcoin hitting $100 seemed like an impossible dream.” Rather than debating narratives, Schwartz offered a market-math thought experiment: if rational investors truly believed there was a meaningful chance of XRP reaching $100 within a few years, the current price would not sit far below double digits for long. “If many rational people believed that there was a 10% chance that XRP hit $100 within a few years, they definitely wouldn’t sell very much today at much less than $10,” he said. “Those with that belief would quickly buy up most of the XRP, because they’d value it more highly than those without that belief, and soon the supply of XRP well below $10 would dry up.” Schwartz then drew his conclusion from the gap between the hypothetical and the tape. “That the current trading price is well below $10 shows that there aren’t very many people who really think it has a 10% chance of hitting $100 within a few years with enough confidence to put their money where their mouth is,” he wrote, adding: “So anyone who says otherwise is not telling the truth.” He emphasized that readers can “do that same math” with different odds, time frames, and target prices. In a final note, Schwartz argued his baseline assumption is that crypto markets are “rational most of the time,” with major bull runs typically catalyzed by “unpredictable external changes,” rather than widely telegraphed certainties. Related Reading: XRP Risk-Adjusted Returns Signal Consolidation Rather Than Trend Formation – Details In a separate reply, Schwartz revisited an older famous X post by himself where he said that XRP “can’t be cheap.” Asked what he meant by this, he answered: “It means that a low price for XRP actually makes it more expensive to use for payments and exchanges.” The implication is mechanical: if XRP’s price is lower, more units are required to represent the same value in flight, potentially impacting how the asset is used across payment and exchange flows. Scaling The XRP Ledger Schwartz also addressed concerns about XRPL throughput after a user questioned whether “1500 per second (theoretical) is sufficient,” asking about ways to increase on-chain transactions per second. Schwartz said higher TPS is possible, but warned that most approaches shift costs onto node operators. “There are ways, but I don’t think you really want to,” he wrote. “Almost any way you do it imposes costs on everyone who runs a node. They have to receive more transactions, process and store more transactions, and relay more transactions to others.” He argued that decentralization pressure shows up when node costs rise without a matching benefit, and suggested a different optimization target: “This is why I think it makes more sense to try to increase the value of each transaction rather than trying to increase the number of transactions you can support.” With XRPL fees “so low,” he added, many transactions are “very low in value,” leaving room to “get more useful transactions on XRPL, even crowding out the worthless ones,” before throughput becomes the binding constraint. At press time, XRP traded at $1.76. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP News|David Schwarz|Ripple|xrp|XRP $100|xrp news|XRP Price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57588360,
    "published": 1769765423000,
    "title": "Bitcoin’s Slide To $82K Sets Off A $1.7 Billion Chain Reaction",
    "body": "Bitcoin slid sharply this week, hitting just above $82,000 in early US trading and triggering a wide purge of crowded positions. Based on data from Coinglass, roughly 270,000 accounts were wiped out across exchanges in the past day, and close to $1.70 billion in total liquidations was recorded. Many of the losses came from traders who had bet that prices would keep rising. Related Reading: Gold, Silver Steal The Spotlight As Crypto Hype Fades On Social Media: Santiment Liquidations And Market Shock The move was fast. Long bets were the hardest hit. Reports say over 90% of the liquidated contracts were long positions, mostly in Bitcoin and Ether. The market was shaken quickly as stop orders were pulled and margin calls were forced. Price gaps showed up on some platforms and volatility spiked. This kind of clearing event can leave prices unstable for a bit, even after traders calm down. Geopolitics And Policy Pressure Reports note heightened tensions in the Middle East added fuel to the selloff. A US warship deployment and renewed public statements from US President Donald Trump put risk assets on edge. At the same time, an executive action linked to tariffs on goods tied to certain oil deals raised fresh concern among global traders. Risk appetite cooled as investors mulled how those moves might affect energy flows and trade. Tech Earnings And Investor Mood Microsoft’s earnings miss was another note in the mix. Some big tech names fell hard after results that showed rising costs and slower growth in cloud services. That made investors question the near-term outlook for AI-driven growth stories. With confidence wobbling in both stocks and crypto, many reduced exposure. The market atmosphere turned cautious and buying dried up in minutes. Bitcoin price action, risk aversion and volatility amid conflict headlines were both feeding into the selling. News feeds were full of sharp alerts. Traders who follow headlines closely found themselves adjusting positions quickly. Support Test And Wider Market Drops Bitcoin is trading near a higher-timeframe support area that mattered in recent months. Weekly closes have been caged between roughly $94,000 and $84,000 for several weeks, and that structure faces another test now. If buyers do not step in, deeper weakness could follow. Reports say the wider crypto market lost around $200 billion in value across tokens during the worst of the move. What Traders Are Saying Some analysts called the reaction overblown and noted that prices had already been falling since October. Others warned that a longer correction could be in play if macro pressures persist. Related Reading: Banks And Crypto Firms Back At The Table As CLARITY Talks Restart Benjamin Cowen warned that Bitcoin may continue to act weak compared with stocks, suggesting any hoped-for rapid flip from gold or silver into crypto might not happen fast. According to Trading Economics, gold and silver have climbed to record levels, with gold reaching $5,608 per ounce and silver rising to $121.60. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|gold|iran|Precious Metals|silver|us",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57588811,
    "published": 1769765828000,
    "title": "U.S. listed bitcoin, ether ETFs bleed nearly $1 billion in a day",
    "body": "U.S.-listed spot bitcoin and ether ETFs saw one of their worst combined outflow days of 2026 as falling prices, rising volatility and macro uncertainty pushed investors to cut exposure.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Ethereum News|Bitcoin ETF|ether ETF|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57589558,
    "published": 1769768711000,
    "title": "Binance to convert $1B SAFU reserves into Bitcoin within 30 days",
    "body": "The shift takes Binance’s insurance-style fund out of US dollar-pegged assets and into Bitcoin within 30 days, raising questions about user protection.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57588727,
    "published": 1769766534000,
    "title": "Vitalik Buterin to spend $43 million on Ethereum development",
    "body": "Ethereum’s co-founder said the $43 million withdrawal will support a broader “full-stack openness and verifiability” vision as the foundation tightens spending.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Ethereum Foundation|Vitalik Buterin|Ethereum News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57589839,
    "published": 1769769548000,
    "title": "Former Google Engineer Convicted of Stealing AI Secrets for China",
    "body": "A U.S. jury found Linwei Ding guilty of economic espionage and trade secret theft after he stole Google’s sensitive AI infrastructure data.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      }
    ]
  },
  {
    "id": 57589721,
    "published": 1769769032000,
    "title": "Bitcoin loses crucial $84K support: How low can BTC price go?",
    "body": "BTC could drop to as low as $50,000 in the worst-case scenario after BTC price failed to hold the important $84,000 support level.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57590230,
    "published": 1769770843000,
    "title": "Solana Could Reach $1,600+ Within Five Years, Bitwise CIO Says",
    "body": "Matt Hougan, the chief investment officer at Bitwise Asset Management, said he thinks Solana could plausibly become a trillion-dollar asset within five years—an outcome that would roughly translate into a ~$1,600 SOL price on a simple market-cap-per-token basis, depending on circulating supply. Hougan made the remarks on the Jan. 29 episode of When Shift Happens, framing his Solana view through what he called a “two ways to win” setup: growth in the addressable market (stablecoins and tokenized assets), plus an increasing share captured by Solana versus competing networks. Why Solana Could Hit $1,600+ Within 5 Years Hougan argued that the “infrastructure market” for stablecoins and tokenization is expanding quickly enough that large, liquid L1s should be valued less like niche crypto experiments and more like enabling rails for traditional finance. “The US Secretary of Treasury expects the stablecoin market to 12x over the next four years,” he said, adding that Larry Fink has described a future where “every asset, every fund, ETF, stock, bond, real estate will be tokenized.” From there, his Solana thesis leaned heavily on relative positioning. Ethereum remains the incumbent in stablecoins and tokenization, Hougan said, but Solana is “a legit competitor with an interesting technological differentiation,” and crucially “it’s extraordinarily easy to use and the community has a ship first attitude.” Related Reading: Solana Scores Major Institutional Adoption As WisdomTree Goes On-Chain That usability point, in his view, is underpriced by investors who focus on benchmark-style comparisons. “I think ease of use is a killer app that’s underrated by investors,” Hougan said. “Investors like to talk about throughput and they like to talk… TPS… who cares about this? …For an end user who’s trading, who’s on-ramping, ease of use is the killer app. And Solana is just easy to use, just dead easy to use.” Hougan also acknowledged a common investor blind spot: token supply dynamics can separate price action from market cap growth. He noted that Solana’s market value can rise meaningfully even if the token price revisits prior highs, and suggested staking yield partially offsets dilution, citing “roughly like 7% a year.” Another thread in the discussion was how regulation shaped institutional behavior. Hougan said Solana’s footprint in stablecoins and tokenization was constrained during the prior US regulatory environment, arguing that institutions “couldn’t build on Solana” if they believed it sat “outside of the regulatory perimeter.” With that cloud lifting, he said, mandates are starting to broaden. He also described why the ETF wrapper matters more for a smaller asset. “You put a little bit of inflows into an ETF package and they’re chasing a relatively small supply of Solana,” Hougan said. “It’s one of the best setups for an asset that I’ve ever seen because you have this small constrained size, you have significant institutional demand, you have stablecoins and tokenization… you put all that together and it seems like a winner.” Still, he avoided hard price targets and instead stayed in market-cap terms. “In 5 years I think it could be a trillion dollar asset. I think that’s relatively easy to imagine,” he said. “It’s hard to give a precise target because it depends on the pace of growth on stablecoins and tokenization. It depends on whether Congress passes the Clarity Act. It depends on the sort of crypto market cycles.” E156: @Matt_Hougan from @BitwiseInvest – $6.5M Bitcoin and the strongest Solana setup ever? This might be the most bullish yet rational episode we’ve done on the future of crypto: why debasement, institutional flows & tokenization are just getting started. Timestamps: 0:00… pic.twitter.com/WMqvKL7pCj — MR SHIFT 🦁 (@KevinWSHPod) January 29, 2026 On simple market-cap math, a $1 trillion Solana valuation implies a four-figure token price depending on supply. The relationship is straightforward: token price equals market cap divided by supply. Using Solana’s circulating supply of roughly 566 million SOL, a $1 trillion market cap works out to about $1,766 per SOL ($1,000,000,000,000 ÷ 566,000,000). Related Reading: Solana Pauses After 20% Drop — This Key Level Could Decide What’s Next If you instead use a fully diluted-style denominator closer to 619 million SOL, the same $1 trillion market cap implies roughly $1,615 per SOL ($1,000,000,000,000 ÷ 619,000,000). In other words, Hougan’s “trillion-dollar asset” framing maps to something like the mid-$1,000s per token on today’s supply assumptions, with the exact number moving as supply changes. Notably, Hougan’s Solana call sat alongside a broader macro narrative he returned to repeatedly: monetary debasement pushing investors toward scarce and non-sovereign stores of value. On Bitcoin, he argued the “two ways to win” are the store-of-value market expanding and Bitcoin taking share from gold, an arc he said could drive multi-million-dollar BTC over decades if the last 10–15 years of adoption trends persist. For Solana, the equivalent is less about being “digital gold” and more about becoming a primary venue for stablecoin flows and tokenized securities. If those rails scale and if Solana continues gaining share as a high-velocity, institution-friendly network, Hougan’s trillion-dollar scenario implies the market is still pricing the opportunity too conservatively. At press time, SOL traded at $115.40. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Solana|bitwise|Matt Hougan|Sol|SOL news|SOL Price|Solana news|Solana Price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57590778,
    "published": 1769772600000,
    "title": "Bitcoin, ether extend declines as leverage unwind accelerates: Crypto Markets Today",
    "body": "Crypto markets fell further overnight as bitcoin and ether extended losses, metals tumbled and liquidation pressure hit leveraged traders across derivatives markets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|Derivatives|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57590705,
    "published": 1769772288000,
    "title": "Bitcoin ETFs Shed $817M as BTC Hits Nine-Month Low",
    "body": "Bitcoin’s crash to a nine-month low, coupled with growing uncertainty about macroeconomic policy, catalyzed $817 million in ETF outflows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57590981,
    "published": 1769773160000,
    "title": "Vitalik Buterin earmarks $45M in ETH for privacy and open tech",
    "body": "The move comes as the Ethereum Foundation enters a period of “mild austerity” while sticking to its core technical roadmap, Buterin said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57591425,
    "published": 1769774495000,
    "title": "Latin America’s biggest digital bank just won a key battle to offer crypto custody in U.S.",
    "body": "The Brazilian digital bank announced it received conditional OCC approval to provide deposit accounts, credit cards, lending and digital asset custody in the United States.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Nubank|OCC|banks|Crypto Custody|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57591985,
    "published": 1769776236000,
    "title": "Crypto Expert Says The Bitcoin Cycle Is Already Over, Here’s Why",
    "body": "Questions are already surfacing over whether Bitcoin is still in the expansion phase that many market participants assume it is. However, a crypto expert opted for a conservative stance, arguing that when Bitcoin is analyzed through traditional cycle theory and macroeconomic indicators, the primary cycle may already be complete. This crypto expert, Tony Severino, challenged popular bullish claims from “snake oil salesmen” and instead pointed to economic data and historical patterns that show the Bitcoin cycle has already transitioned into a different phase. PMI And ISM Datan Shows Where Bitcoin Is According to Tony Severino, Bitcoin’s bullish cycle is already over, and analysts saying otherwise are pushing a fairy tale that may or may not come true. Severino’s outlook is based on the U.S. ISM Purchasing Managers’ Index, which he views as a reliable macro gauge for cyclical behavior. Related Reading: Global Liquidity Says Bitcoin Is Extremely Undervalued – Here’s The ‘Real’ Figure The PMI data shown in the chart below highlights a clear pattern of lower highs and lower lows, which is a signal of a weakening manufacturing environment. According to Severino, real cycles are measured from trough to trough, not from speculative projections of future upside. From that perspective, the current PMI structure means that the cycle has already peaked and is now rolling over. At the time of writing, this index is sitting around 47.9. Severino warned that a sustained move below the 46 level would change the PMI from a local pullback into a more pronounced intermediate downtrend. A drop beneath 41.6 would carry even more serious implications, as that level would fall below the COVID-era low. Such a move would leave only extreme historical comparisons, including conditions last seen during the 2007-2009 Great Financial Crisis or the stagflation period of the 1970s and early 1980s. Therefore, this macro backdrop directly challenges the idea that Bitcoin is on the verge of a guaranteed new bullish phase. Severino also took direct aim at popular Bitcoin valuation models that compare BTC to gold or rely on long-term projections detached from economic reality. The current reality is that Bitcoin is lagging behind gold and silver, which are attracting consistent inflows in contrast to Bitcoin’s show of fatigue around $80,000. Bullish Conviction To Bearish Targets Severino’s current stance is notable because it is a significant difference from his outlook before the current cycle began, when he was very bullish on Bitcoin. His recent analysis, shown in the chart below, shows Bitcoin breaking below a moving average on the monthly candlestick timeframe. This is notable because similar breakdowns in previous years were followed by drawdowns averaging around 50%. Related Reading: Analyst Reveals How Far Bitcoin Price Will Crash If The Uptrend Doesn’t Continue The chart highlights multiple instances where Bitcoin suffered declines of 40% to over 60% after losing this type of technical support. Based on that historical behavior, Severino has floated a downside target of at least $45,000 before another bullish reversal. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|COVID|ISM|PMI|Tony Severino",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57592203,
    "published": 1769777071000,
    "title": "XRP-linked Ripple rolls out treasury platform after $1 billion GTreasury deal",
    "body": "New product lets companies manage cash, stablecoins and tokenized funds in one system, cutting cross-border settlement times from days to seconds.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57592104,
    "published": 1769776452000,
    "title": "Bitcoin, Ether ETFs see $1B outflows as crypto market tumbles 6%",
    "body": "US spot Bitcoin ETF flows turned negative for January after a series of outflows this week totaling nearly $1 billion, data from SoSoValue show.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57592037,
    "published": 1769776200000,
    "title": "There is no trust in DeFi without proper risk management",
    "body": "DeFi's composability creates cascading exploit risks while protocols handle risk idiosyncratically. Institutional adoption demands TradFi-style standardized frameworks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 57592751,
    "published": 1769778834000,
    "title": "Ethereum breaks below $2.8K as charts hint at another 22% ETH price drop",
    "body": "Ethereum dipped below $2,800 as onchain data suggested a transition into a bear market. The technical setup pointed to a $2,100 ETH price.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57593183,
    "published": 1769780431000,
    "title": "Trump picks crypto friendly Kevin Warsh as new Fed chair",
    "body": "US President Donald Trump has nominated former Fed governor Kevin Warsh to replace Jerome Powell as Federal Reserve chair, setting up a Senate confirmation fight.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57593568,
    "published": 1769781619000,
    "title": "Bitcoin Suppression? Analyst Claims Single Force Keeping Price Under $90K",
    "body": "Bitcoin drifted under $83,000 on Thursday as market focus shifted toward how liquidity is stacked on exchanges. Reports say a mix of big orders and tight ranges has left traders feeling boxed in. Some analysts warn that a break under a key level could spark sharper selling, while others point to concentrated buy orders that might cushion a drop. Related Reading: Gold, Silver Steal The Spotlight As Crypto Hype Fades On Social Media: Santiment Order-Book Pressure And Liquidity According to trading-room data, one group or a cluster of large accounts appears to be shaping short-term moves by placing big bids and offers in the order book. This can keep price stuck in a narrow band. Material Indicators’ research flagged a pattern where bids are clustering around $85,000 to $87,500 — a zone that could act like a floor for now. The idea is simple: by piling up liquidity at certain prices, large players can get fills on their orders or discourage quick recoveries before options expiry. Market participants say this kind of behavior can trap less-experienced traders who react to sudden moves. At times, the pressure seems deliberate; at other times, it may be a byproduct of many traders aiming for the same levels. Either way, the result has been choppy price action and rising tension in the book. FireCharts shows $BTC price is being suppressed by one entity using a liquidity herding strategy to push price lower, potentially to get their own bids filled, or possible to keep price pinned in the lower end of this range before Friday’s options expiry. A significant amount of… pic.twitter.com/c63miAxBkh — Material Indicators (@MI_Algos) January 29, 2026 Whales, Wyckoff And The Spring Idea Reports note that a group of traders using Wyckoff-style thinking expects a “spring” — a drop below recent lows that then leads to a strong bounce as heavy hands buy at lower prices. Pseudonymous analysts have pointed to $86,000 as a strong buy wall provided by large orders. One commentator shared charts showing how a quick dip under $80,000 could serve as the spring before a rebound. Some traders view this pattern as part of accumulation. Others see it as a risky setup that could widen losses if support fails. The truth may sit between those views: both accumulation and the risk of a flush are possible in a tense market. Bitcoin Price Action Bitcoin has been moving in a tight range after failing to hold above $90,000. Price slid near $82,300 as fresh worries about monetary policy and world events hit risk assets. Volatility has been low at times and then spikes quickly, which makes trading tricky. Buyers have stepped in at certain levels, but they have not yet forced a clear break higher. Geopolitics And Fed Moves Reports say rising tensions in parts of the Middle East and talk about a new Federal Reserve chair pick have added to uncertainty. Some investors fear tighter policy would drain liquidity from markets and weigh on crypto. Market chatter has even mentioned US President Donald Trump in relation to political shifts that could influence economic policy. Safe-haven flows into other assets have been seen when headlines worsen, and those moves have pulled money away from riskier holdings. Related Reading: Bitcoin’s Slide To $82K Sets Off A $1.7 Billion Chain Reaction Key Levels To Watch Traders should watch the $83,000–$85,000 zone closely. A daily close below $86,000 would be read by many as a negative sign and could open the door to deeper selling. On the flip side, sustained buying at those levels could set up a rally if big liquidity holders decide to lift offers. For most people, patience and clear stop rules matter right now, because the market is being pushed by both order-book tactics and outside news, and either factor can shift price fast. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|iran|Trump|us",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57565566,
    "published": 1769739247000,
    "title": "Analyst claims single entity is ‘suppressing’ Bitcoin below $90K",
    "body": "Bitcoin order-book analysis said that BTC price action was being held back by just one trading entity, while risking a trip to \"Bearadise.\"",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57593942,
    "published": 1769782500000,
    "title": "Bitcoin bear market almost over? BTC price metric outpaces 2022 bottom",
    "body": "Bitcoin's MVRV Z-score printed record lows on a rolling two-year basis, making BTC price more \"undervalued\" than at the pit of past bear markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57594341,
    "published": 1769784070000,
    "title": "Morning Minute: Washington Just Gave Crypto the Green Light",
    "body": "It was a big day for crypto policy in the US yesterday, but work still remains to be done",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Opinion",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57595099,
    "published": 1769787000000,
    "title": "Why Is Bitcoin Down While Gold Rallies? The Bitcoin Slump Explained",
    "body": "Gold added $1.6 trillion in one day while bitcoin fell to 2026 lows. It's a story about who's buying what – and central banks aren't in bitcoin yet.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57595540,
    "published": 1769788508000,
    "title": "Bitcoin Traders See Nearly Even Odds for $69K Drop or $100K Recovery",
    "body": "Bitcoin sentiment on Myriad flipped bearish for first time in two months as traders bet on further downside amid shutdown fears and extreme market volatility.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57596567,
    "published": 1769792437000,
    "title": "Here’s The Dogecoin Resistance Level That Is Stalling A 402% Move",
    "body": "Crypto analyst Javon Marks has released a fresh update on Dogecoin (DOGE), continuing a price analysis he has consistently shared on X since earlier last year. His latest update focuses on a resistance level currently holding Dogecoin back from a 402% rally, which could trigger a move to its next bullish target. Key Resistance Level Limits Dogecoin’s Upside Potential According to Marks, Dogecoin is holding above a key “resisting trend break” that was established following a prolonged downtrend. This level is important because the price has not fallen below it, indicating that the meme coin’s breakout structure remains intact. As long as this resistance holds, the analyst believes Dogecoin still has the potential for a significant upside move. Related Reading: Dogecoin Roadblock At $0.15: Analyst Predicts The Next Major Level Marks has highlighted $0.6533 as the critical resistance level that stands between Dogecoin and its next price rally. The analyst has said that the meme coin’s price is currently 402% below this key resistance, suggesting that DOGE’s price can only begin a substantial upward movement if it can rally as high as that. Until then, gains will likely remain limited or short-lived. One major reason Marks believes Dogecoin’s bullish structure remains uncompromised is that the meme coin continues to form higher lows on the chart. These higher lows indicate that recent selling pressure and price declines have been unable to push Dogecoin back to previous downside levels. The analyst notes that as long as this pattern persists, a move toward the $0.6533 target could simply be a matter of time. The chart also shows that Dogecoin has already confirmed a shift in structure by forming multiple higher highs after breaking the long-term descending trendline. This combination of higher highs and higher lows is typically associated with bullish market conditions. However, price must still overcome the $0.6533 resistance to validate the meme coin’s next bullish run. Marks has predicted that if Dogecoin successfully breaks above $0.6533, its next target could be $1.25111. In his previous analysis, the analyst consistently highlighted this target, noting each time that Dogecoin’s price was much closer to the $0.6533 resistance than it is now. This also indicates that, since his earlier updates, Dogecoin has continued to decline. Despite this prolonged correction, Marks remains confident in the meme coin’s bullish potential and its ability to cross the $1 threshold. Dogecoin Shows Signs Of Stabilization After Recent Drop Crypto analyst Bitguru has observed that Dogecoin may be forming a base following a recent liquidity grab. He said that the cryptocurrency has been compressing near lows and printing a long consolidation range after experiencing a sharp price decline. Related Reading: Dogecoin Price Just Confirmed A Reversal With The RSI Divergence This pattern often signals that selling pressure is fading and the market is quietly resetting. With Dogecoin now showing signs of stabilization, Bitguru’s chart shows that, once the consolidation stage ends, DOGE’s price could surge from $0.11 to $0.20. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|Bitguru|Descending Trendline|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt|Javon Marks|meme coin",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57596556,
    "published": 1769792232000,
    "title": "Nubank wins conditional US approval to form national bank",
    "body": "The conditional approval moves the Latin American fintech into the bank organization phase as it seeks to expand regulated banking and crypto services in the United States.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57596849,
    "published": 1769792516000,
    "title": "Bitcoin Slump Cuts Millions From Winklevoss Super-PAC Donation",
    "body": "The political fundraising group launched by crypto-billionaire brothers Cameron and Tyler Winklevoss raised more than $22 million in the last five months of 2025, but might not get as much bang for its Bitcoin.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57597131,
    "published": 1769794469000,
    "title": "Brian Armstrong was snubbed by top executives from the biggest U.S. banks in Davos: WSJ",
    "body": "Stablecoin rewards and the Clarity Act widen the divide between crypto and TradFi, according to people who spoke with the WSJ.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Coinbase|Brian Armstrong|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57597498,
    "published": 1769795902000,
    "title": "Blank Check Firm Linked to Crypto Exchange Kraken Raises $345 Million in Upsized IPO",
    "body": "A new special purpose acquisition vehicle (SPAC) tied to crypto exchange Kraken completed its IPO, raising $345 million.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57597611,
    "published": 1769796202000,
    "title": "Hong Kong regulators to submit draft bill for crypto framework in 2026",
    "body": "An official said that Hong Kong authorities would work on a draft framework, and had begun processing license applications for stablecoin issuers and addressing crypto taxes.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57597913,
    "published": 1769797307000,
    "title": "Liquidations knock Bitcoin out of world’s top 10 assets",
    "body": "A wave of leveraged liquidations erased hundreds of billions in value, reshuffling Bitcoin’s standing among the world’s largest investable assets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57599123,
    "published": 1769801189000,
    "title": "U.S. government seizes $400 million Helix allegedly made from drug-linked transactions",
    "body": "The Department of Justice said it now holds legal title over crypto, real estate and monetary assets tied to darknet mixing service, Helix",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Department of Justice|Dark Web|Cryptocurrency|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57599429,
    "published": 1769803246000,
    "title": "Bitcoin Miner Fees Remain Near Cycle Lows: What Does This Signal?",
    "body": "Bitcoin has slipped below the $83,000 level as selling pressure continues to dominate global markets, extending a correction that has unfolded alongside broader risk-off conditions. Weakness across equities and commodities has weighed on investor sentiment, and Bitcoin has not been immune to this environment. With volatility elevated and liquidity thinning, market participants are increasingly cautious, and several analysts now point to the possibility of a deeper retracement toward lower demand zones before any meaningful stabilization can occur. Related Reading: XRP Risk-Adjusted Returns Signal Consolidation Rather Than Trend Formation – Details Beyond price action, on-chain data suggests that the Bitcoin network itself is entering a period of unusually low activity. Transaction demand has cooled, and miner fee generation remains muted, signaling limited urgency for blockspace. This “quiet” state reflects a market where speculative interest has faded, and organic usage is subdued, a combination that often emerges during corrective or transitional phases rather than during strong uptrends. At the same time, the lack of aggressive on-chain selling pressure indicates that the move lower is not being driven by panic but by persistent distribution and reduced participation. This creates an environment where price can drift lower with relatively little resistance. As Bitcoin searches for its next area of support, the coming sessions will be critical in determining whether current weakness evolves into a deeper correction or forms the foundation for a more durable base once activity and demand begin to recover. Bitcoin Miner Fees Signal Prolonged Network Dormancy An analysis from Onchain Mind highlights a key metric for assessing the underlying health of the Bitcoin network: the Miner Fees to Block Subsidy Ratio. This indicator measures how much of miners’ revenue comes from transaction fees compared to the fixed block reward, making it a direct proxy for organic demand for blockspace. When users are competing to have transactions included in blocks, fees rise, and this ratio increases. When activity slows, the ratio compresses. Since July, this metric has remained pinned below 1%, marking a sharp and sustained cooldown in network usage. This stands in stark contrast to the conditions seen last May, when the ratio surged above 15% during periods of heightened on-chain activity and speculative demand. At that time, elevated fees reflected strong competition for blockspace and a network operating near capacity. The current environment tells a very different story. Persistently low fee contribution suggests that transaction urgency has largely evaporated, with users showing little willingness to pay premium fees for settlement. Historically, such prolonged periods of subdued fee pressure have been associated with bear market phases, when participation declines and on-chain activity contracts. This does not signal immediate stress for miners, given the dominance of the block subsidy in revenue. However, it does underline a broader slowdown in network engagement, reinforcing the view that Bitcoin is currently operating in a low-demand, defensive phase rather than a growth-driven one. Related Reading: Bitmine Stakes Additional 250,912 Ethereum Worth $745M – 61% Is Now Staked Bitcoin Breaks Key Support As Bearish Structure Strengthens Bitcoin’s price action continues to reflect a market under sustained pressure. BTC is now trading near the $83,000 area after failing to hold recent consolidation lows. The chart shows a clear sequence of lower highs and lower lows since the November peak. Confirming that the broader structure remains bearish rather than corrective. Price is firmly below the 50-day and 100-day moving averages, both of which are sloping downward and acting as dynamic resistance, while the 200-day moving average remains well above current levels, reinforcing the loss of long-term trend support. Related Reading: OKX Launches Crypto Payment Card Across the European Economic Area The recent breakdown below the $85,000–$84,000 zone is technically significant. This area had previously acted as a short-term base during December and early January. But the failure to defend it suggests that buyers are no longer willing to absorb supply at these levels. Volume spikes accompanying the latest sell-off indicate distribution rather than capitulation, pointing to continued, orderly selling pressure. The market is transitioning into a price discovery phase toward lower demand zones. If downside momentum persists, the next areas of interest lie near the $80,000 psychological level. Followed by deeper support closer to the low-$70,000 range, where previous consolidation occurred in mid-2024. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|Bitcoin Miner Accumulation|Bitcoin miner fees|Bitcoin network activity|Bitcoin news|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57599327,
    "published": 1769802893000,
    "title": "Bitwise CIO Matt Hougan says bitcoin could hit $6.5 million in 20 years",
    "body": "After a bruising 2025, Hougan sees sideways Bitcoin trading, rising institutional interest and early central bank curiosity setting up the next cycle.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|btc|Bitwise|Bitwise Asset Management|Gold|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57599665,
    "published": 1769804084000,
    "title": "Bitcoin futures imbalance may spark liquidation revenge rally to $90K",
    "body": "Bitcoin short positions continued to pile up as BTC price dropped near $81,000, potentially providing the liquidation fuel for a revenge rally back above $90,000.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57600192,
    "published": 1769806260000,
    "title": "Bitcoin Price Holds Steady as Gold Falls and Silver Craters",
    "body": "Bitcoin stays resilient while gold and silver see historic crashes amid Fed chair nomination fears and shifting rate expectations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57600335,
    "published": 1769806800000,
    "title": "Gold is acting like the hedge Bitcoin promised to be",
    "body": "As the dollar weakens, investors are turning to gold — onchain and off — while Bitcoin increasingly plays a supporting role in hedging currency risk.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57600718,
    "published": 1769808638000,
    "title": "Why Litecoin Price Going To $2,000 Is Not A Fantasy, But Market Cap Math",
    "body": "Crypto pundit BigShortRare has declared that a Litecoin price rally to between $1,200 and $2,000 is not a fantasy but a marketcap math. This came as he explained exactly how the altcoin will reach this price target based on its market cap and circulating supply. Why A Litecoin Price Rally To $2,000 Could Happen In an X post, BigShortRare noted that LTC has a circulating supply of roughly 76.78 million coins. As such, a $1,200 Litecoin price will give the altcoin a market cap of about $90 billion, while at $2,000 per LTC, the altcoin’s market cap is about $150 million. The pundit remarked that these numbers sound big until they are put in context. Related Reading: Here’s Why The Litecoin Price May Be Getting Ready For Another Massive Rally BigShortRare alluded to the fact that Bitcoin has already crossed $2 trillion in market cap in the past, while Ethereum has traded above a $500 billion market cap. Furthermore, he stated that in the previous cycle, capital has repeatedly concentrated into a few large, liquid, and battle-tested assets. Therefore, a Litecoin price rally to a $90 billion to $150 billion market cap would still be a fraction of Bitcoin’s market cap and well within historical altcoin concentration ranges during late-cycle rotation. BigShortRare also mentioned that what supports that valuation range is not illusion but structure. He explained that Litecoin is fully integrated across exchanges, wallets, payment processors, and merchant rails. The pundit added that the altcoin has a fixed supply, no VC overhang, no emissions surprises, and no dependency on speculative incentives. LTC is also said to function as a settlement and payment network, not a promise. “LTC Is The OG” BigShortRare also noted that LTC is an OG crypto project, which is another reason why he is confident that the Litecoin price can rally to as high as $2,000. He stated that when markets rotate from experimentation to reliability, capital doesn’t spread evenly but rather compresses into assets that already work at scale. Related Reading: XRP, HBAR, And Litecoin: Pundit Highlights Coins To Watch In 2026 The pundit remarked that a $1,200 to $2,000 price tag for LTC doesn’t require it to replace Bitcoin or Ethereum. Instead, it only requires the market to price Litecoin as a major monetary rail and not a side character. “That’s not a prediction of timing. It’s a valuation argument. Price decides when. Structure decides if,” he concluded. It is worth noting that BigShortRare’s thesis was in support of crypto analyst Surf’s prediction that the Litecoin price was about to rally to $2,000. His accompanying chart showed that the rally to this price target could happen by 2028. At the time of writing, the Litecoin price is trading at around $64, down over 5% in the last 24 hours, according to data from CoinMarketCap. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Litecoin|altcoin|BigShortRare|bitcoin|btc|CoinMarketCap|ETH|ethereum|Litecoin news|litecoin price|ltc|LTC news|ltc price|ltc/usd|LTCUSDT|Surf",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 33,
        "NAME": "LTC",
        "CATEGORY": "LTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57601054,
    "published": 1769810251000,
    "title": "SoFi posts record Q4 revenue after reentering crypto market",
    "body": "The fintech bank reported record quarterly revenue of $1 billion as it reintroduced crypto trading, launched a stablecoin and rolled out blockchain-based remittances.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57601085,
    "published": 1769810539000,
    "title": "Bitcoin Mining Profits Hit 14-Month Low After Winter Storm Rocks Miners: CryptoQuant",
    "body": "Bitcoin miners are \"extremely underpaid\" given the price of Bitcoin and current BTC mining conditions, according to a CryptoQuant report.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57601717,
    "published": 1769813554000,
    "title": "A Reddit-like social network for AI agents is getting weird, and memecoin traders are cashing in",
    "body": "Moltbook’s viral posts and strange user behavior memecoins, including MOLT soaring more than 7,000%.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "News Analysis|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57602785,
    "published": 1769817655000,
    "title": "Bitcoin’s Digital Gold Thesis Faces Reality As Gold Surges Ahead",
    "body": "Bitcoin was designed to function as digital gold, a decentralised store of value that protects wealth from inflation, currency debasement, and the long-term dominance of the dollar. Currently, the market behaviour is telling a different story as de-dollarisation accelerates and investors seek safety from geopolitical risk and inflation pressures, with gold capturing the bulk of that capital. Is Bitcoin Still A Store Of Value Or A Risk Asset? Crypto investor Himanshu Sinha has stated on X that Bitcoin was supposed to be digital gold because it was built for de-dollarisation, but gold and silver are winning the trade and fulfilling that role. Over the past year, gold has risen by roughly 55%, silver has surged around 150%, while BTC has remained flat. Related Reading: What’s Going On With Bitcoin And The Stock Market? Analyst Breaks It Down The Central banks are the drivers; they don’t want volatility that they can’t manage, and they don’t want an asset that moves in lockstep with the Nasdaq. Instead, they want a controllable monetary infrastructure, and they’re buying gold at the highest rate in history. Just hours ago, gold hit $5,600, then collapsed by 8.21% in a straight vertical drop to $5,140, which is a textbook margin liquidation. At the same time, Microsoft dropped 11.7% as tech sold their gold because it was their only profitable asset, and the investors needed cash fast. This is the same liquidity contagion that used to be seen in the crypto market. According to Sinha, gold cannot be sanctioned in a bar. As the West weaponizes the dollar through sanctions and financial controls, the rest of the world needs a neutral exit. In the end, BTC still proved it is a speculative tool, while gold is proving to be the replacement. Why Gold Is Likely To Keep Outperforming Bitcoin A crypto trader known as Doctor Profit pointed out that nearly a year ago, he shared a Gold versus Bitcoin chart, highlighting that once 0.02 BTC equals 1 ounce of gold, it should mark the top for BTC. Meanwhile, when 0.11 BTC equals 1 ounce of gold, it marks the bottom for BTC. This happened in 2021 during the BTC top and during the BTC bottom in 2022. Related Reading: Expert Who Nailed The Bitcoin Top Now Says Buy At These Levels According to Doctor Profit, the analysis was later proven right this year by calling the BTC top at $125,000 at 0.02 for 1 ounce of gold. Calculating this move, if 1 BTC is $5,500 in gold price and divided by 0.11, it should be $50,000 BTC, which matches the analysis of BTC bottom for this cycle between $50,000 and $60,000 BTC. However, the analysis played out as expected. If calculated with a gold price of $7,000, the equivalent of BTC bottom should be around $63,000, which also aligns with the bottom target. In the Doctor Profit view, gold might continue to outperform BTC in the coming months. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|Doctor Profit|gold|Himanshu Sinha|microsoft|silver",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57602928,
    "published": 1769818246000,
    "title": "Tether's gold holdings top $17 billion as net profits surpassed $10 billion for 2025",
    "body": "The stablecoin giant saw sharp growth in its USDT token's supply, and was one of the world's largest U.S. government debt holder with $141 billion Treasury exposure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Tether|USDT|Gold|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 164,
        "NAME": "XAUT",
        "CATEGORY": "XAUT"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57603644,
    "published": 1769821210000,
    "title": "Why Gold & Silver’s All-Time Highs Are Very Bullish For Bitcoin And Altcoins",
    "body": "Gold and silver have recently dominated headlines, outperforming both Bitcoin and altcoins in the broader crypto market. While both precious metals recorded new all-time highs in 2026, many altcoins failed to reach similar milestones. Bitcoin, by contrast, did achieve an ATH in 2025; however, following that peak, its price retraced sharply to new lows. With this in mind, analysts argue that the strength of gold and silver does not pose a threat to digital assets. Instead, they interpret the divergence as a major bullish signal for Bitcoin and altcoins. Gold And Silver ATH Signals Bitcoin And Altcoins Upside Crypto market expert Mark Chadwick delivered a detailed analysis of precious metals and cryptocurrencies on X this week, pointing to what he calls “the biggest price divergence” ever recorded between gold and Bitcoin. His chart and analysis suggest that a strong performance in gold could be a major indicator for a potential rally in cryptocurrencies. Related Reading: Dogecoin Price Could Continue To Decline If This Doesn’t Happen; Analyst Chadwick noted that gold has surged aggressively, reaching an ATH of over $5,600 in January 2026. This price rally has pushed the metal into extreme overbought levels on higher timeframes. In contrast, Bitcoin is facing prolonged weakness and negative sentiment in 2026, despite reaching an all-time high above $126,000 in October 2025. The analyst suggested that this performance imbalance has reached levels that typically signal a major market shift. Gold and silver have been boosted by factors such as central bank accumulation, inflation hedging, and geopolitical pressures. At the same time, Bitcoin has been weighed down by tighter liquidity, reduced investor interest, and risk-off conditions. As a result, traditional safe-haven assets have entered overbought territory, leaving BTC and altcoins largely overlooked. Chadwick argues that markets move in cycles driven by sentiment and positioning. When one asset becomes excessively overbought, returns diminish, and capital seeks higher upside elsewhere. In past macro cycles, periods of strong performance in gold and silver have often been followed by capital rotating into higher-risk assets once fear subsides. Based on his analysis, Bitcoin’s current positioning reflects exhaustion rather than structural weakness. Chadwick believes that when manipulation ends and capital starts flowing out of gold and silver into BTC, it could set the stage for a sharp rebound in the leading cryptocurrency. Since altcoins typically follow Bitcoin’s performance, the analyst expects that once Bitcoin regains momentum, some of that profit could also rotate into select altcoins, fueling a price rally. Related Reading: XRP Prints Bullish Divergence On The Weekly Chart, But Is ATHs Still Possible? How High Bitcoin And Altcoins Could Rally Chadwick has stated that Bitcoin’s price could easily surge 10x as capital flows back into it and market sentiment and liquidity improve. However, the chart outlines a short-term rally, projecting a 91.60% rise to $170,000 from the $82,000 region. The analyst also predicted that altcoins could rise 50-100x, reflecting a staggering potential for gains in the crypto market. He concluded his analysis by emphasizing that smart money knows massive returns often come from diversification. From this perspective, the current ATHs of gold and silver do not undermine cryptocurrencies but signal an upcoming shift in capital. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|Bitcoin|altcoin|altcoin news|Altcoin season Altcoin season|Altcoin season news|altcoins|Altcoins news|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]