[
  {
    "id": 57445798,
    "published": 1769304539000,
    "title": "US Bitcoin ETFs bleed $1.72B in five-day outflow streak",
    "body": "The extended outflow streak comes as a widely used crypto sentiment indicator has stayed within the “Extreme Fear” range since Wednesday.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57450766,
    "published": 1769324963000,
    "title": "Once-prominent NFT marketplace Nifty Gateway to wind down operations",
    "body": "The Gemini-owned NFT platform will close on Feb. 23, 2026, entering withdrawal-only mode as another major casualty of the sector’s prolonged downturn.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57452943,
    "published": 1769333697000,
    "title": "Colombia’s second-largest pension fund to offer Bitcoin exposure",
    "body": "AFP Protección says access to the Bitcoin-linked fund will be limited to qualified investors and will not alter the core allocation of Colombian pension savings.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57454489,
    "published": 1769328027000,
    "title": "Money Keeps Leaving: Bitcoin ETFs Shed $1.72 Billion In Just 5 Sessions",
    "body": "US-based spot Bitcoin exchange-traded funds pulled funds for a fifth straight trading day, and the totals added up quickly. According to Farside data, about $103.5 million left on Friday, bringing the five-day sum to roughly $1.72 billion. Related Reading: Crypto Meets Private Banking: UBS Weighs New Offering Bitcoin was trading near $89,160 at the time of these reports — still well below the $100,000 mark it last reached on November 13. This movement has sent a clear signal: many investors are stepping back right now. ETF Flows And Who Is Selling Reports note that ETF flows are often on the radar as a quick read on investor mood, but the picture is not always simple. Large outflows can reflect institutional rebalancing or tactical moves by funds, not only mass retail selling. The US market had a four-day trading week because of Martin Luther King Jr. Day on Monday, which may have concentrated trades into fewer sessions and amplified the numbers. Still, losing more than a billion dollars in a few days will get attention. Market Mood And Metals The wider mood has soured. The Crypto Fear & Greed Index registered an Extreme Fear score of 25, and sentiment trackers have been flashing caution. Reports say Santiment believes retail traders are pulling back while attention drifts toward more traditional assets. Meanwhile, metals have been strong. Reports disclose that with gold trading near $5,000 and silver approaching $100, some market players feel Bitcoin has been left out of a rally that lifted metals, which has weighed on confidence in the crypto market. Source: Alternative.me Bitcoin Price Action Bitcoin has struggled to find a steady rhythm over the past week. Prices slipped below the $89,000 to $90,000 range as traders reacted to fresh geopolitical tension and renewed trade worries, before stabilizing as nerves eased. This was driven higher after some soft political indicators around tariff threats, only to substantiate the idea that markets rarely react to conflict but rather to changes in tone and expectations. Signals That Could Matter These movements illustrate how Bitcoin behaves more like a risk asset rather than an asset shelter, falling in tandem with equities when unexpected financial shocks hit the globe, before rebounding when the fever subsides to gather fresh buyers. Related Reading: Gold Becomes The Whale Safe Haven As Bitcoin Takes A Back Seat Current price patterns indicate caution, where traders are weighing short-term political risks against medium- and long-term macro patterns, as well as institutional interests. There are some quieter indications that the rout could be losing steam. To this effect, there are assertions suggesting that supply distribution on-chain and social chatter can be circumstantial evidence showing there is less selling pressure. Featured image from Money; Shutterstock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|btc|btcusd|crypto|digital currency|etf",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57456074,
    "published": 1769344384000,
    "title": "Cathie Wood’s ARK adds Coinbase, Circle, Bullish as crypto slides",
    "body": "The fourth-quarter crypto pullback hit ARK ETFs, with Coinbase emerging as the biggest drag on performance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57457485,
    "published": 1769349605000,
    "title": "Bitcoin Whale Demand Hits Extreme Levels As Next Rally Loads Up",
    "body": "The Bitcoin price action has been muted over the past few days, trading within the $90,000 and $88,000 levels. Classically, consolidation periods often precede major moves either to the upside or downside of the market. As such, questions on the next trajectory of the flagship cryptocurrency are being asked. A latest on-chain evaluation has offered a positive prognosis on the next direction for the Bitcoin price. Accumulation Demand Metric Surges To All-Time-High In a Quicktake post on CryptoQuant, on-chain analyst CoinNiel hypothesized that the Bitcoin price could be at the beginning of a bullish trend. The market quant based this prognosis on two metrics — the Accumulator Address Demand and the Liquidity Inventory Ratio (month). Related Reading: Bitcoin Metric Suggests Miners Are In Recovery Mode — Price To Follow? The Accumulator Address Demand metric monitors the net buying pressure coming from addresses that buy Bitcoin consistently, and without any significant selling. This behavior (of buying and rarely selling) is typical of the large-scale Bitcoin holders, commonly known as the whales. Notably, CoinNiel also pointed out that when major withdrawals from exchanges occur, they are rarely ever incited by retailers, but by whales. As such, when the Bitcoin whales withdraw their holdings from exchanges, their buying pressure translates into an increase in the Accumulator Address Demand. From the chart above, the indicator has reached an all-time high level. According to the crypto pundit, this could be a sign that the whales are currently experiencing, on intense levels, the “fear of missing out.” The second metric, the Liquidity Inventory Ratio (Month), also reinforces CoinNiel’s bullish outlook. This metric tracks and compares existing Bitcoin demand to the supply available on exchanges, showing whether demand can overwhelm available supply. When this ratio rises sharply, it is usually a sign that demand is absorbing newly created supply. From the data shared by the analyst, the Liquidity Inventory Ratio has also reached an extreme value of 3.8. However, this extreme reading is only a reflection of what is happening on US exchanges. Hence, CoinNiel implied that, for the first time in years, US exchanges are recording exceptionally high demand relative to the coins available. In theory, a 3.8 reading implies the imminence of a supply shock in the scenario where current conditions prevail. But, the analyst highlighted that it may not necessarily happen, as a 3.8 reading is more a sign of intensified whale demand than a surefire means to predict supply shocks. The big picture, especially when these two metrics are looked at together, appears to be distinctly bullish. This is because available data points out that the whales are likely positioning for what could be a resumed bullish trajectory for the Bitcoin price. Bitcoin Price At A Glance As of this writing, Bitcoin is valued at $88,520, reflecting an over 1% decline in the past 24 hours. Related Reading: XRP Price Recovery Is Possible If It Reclaims This Ichimoku Base Featured image by DALL.E, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57457482,
    "published": 1769349600000,
    "title": "Sui Group charts new course for crypto treasuries with stablecoins and DeFi",
    "body": "The Nasdaq-listed firm said it is evolving beyond a crypto treasury vehicle into a yield-generating operating business.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Sui|Digital Asset Treasury|Stablecoins|DeFi|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57459047,
    "published": 1769355402000,
    "title": "RWA Tokenization Accelerates With Blockchain-Based Markets",
    "body": "TradFi continues to lead the push for mainstream crypto adoption, and invvestors should take notice",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57459373,
    "published": 1769356810000,
    "title": "XRP Charts Flash Familiar Signal As Analyst Calls For $11, Then $70",
    "body": "A growing number of chart watchers are pointing to a long stretch of sideways trading for XRP and saying this setup has come before big rallies. According to a widely followed analyst known as CryptoBull, the current price action echoes earlier runs in the token’s history. Related Reading: Crypto Meets Private Banking: UBS Weighs New Offering The signal is simple: long quiet periods sometimes lead to sharp moves when buying pressure returns. That does not mean a jump is guaranteed. Markets can stay quiet for a long time, and timing is uncertain. Pattern Mirrors Prior Cycles Based on reports, XRP’s weekly structure shows a stretch of range trading after strong breakouts from earlier years. The comparison reaches back several cycles. In past examples, long ranges eventually gave way to impulsive runs that pushed the price far above prior highs. The next impulse will take #XRP to $11 and the last wave to $70. The price pattern is copying the previous bullrun, only difference is time, which makes sense, as we need longer accumulation for higher prices. pic.twitter.com/WJxzYDVRKT — CryptoBull (@CryptoBull2020) January 23, 2026 CryptoBull argues the present consolidation has lasted longer than previous ones, which, he says, could compress price action and build fuel for a larger expansion when momentum flips. The idea rests on history repeating itself in broad strokes, not in exact moves. Longer Accumulation Could Support Bigger Targets Some analysts see a sixfold move as plausible if the same pattern plays out. That kind of rise would put XRP near $11, a figure being discussed by multiple commentators. There is also talk of a further, final wave lifting the token much higher in a later stage — talk that reaches $70 in extreme scenarios. A bottom test—where price revisits support to confirm strength before a new push—has appeared in a few past cycles and is being watched closely now. The presence of such tests can either validate a base or warn that the range has more work to do. Timelines are vague, and a long accumulation period can stretch for years before any decisive breakout. Related Reading: Money Keeps Leaving: Bitcoin ETFs Shed $1.72 Billion In Just 5 Sessions RLUSD Rumors Fuel Speculative Calls Reports that BlackRock may use Ripple’s RLUSD stablecoin have added fuel to the fire. News like that has pushed sentiment upward and sparked fresh technical calls, with some forecasts ranging from $6 to $14 in near- to mid-term scenarios. Other voices go far beyond, naming targets that would imply market caps so large they would be hard to reconcile with today’s market size. These more extreme numbers should be treated with caution, because they assume near-perfect conditions and massive capital flows that may never arrive. Still, adoption whispers can tilt sentiment and speed up moves when buyers pile in. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|BlackRock|Cypto|Ripple|RLUSD|Stablecoins|xrp",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57460289,
    "published": 1769360463000,
    "title": "How SharpLink Aims to Be the Most 'Focused, Disciplined' Ethereum Treasury in 2026",
    "body": "Ethereum treasury firm SharpLink Gaming hopes to stand apart from the pack by focusing on the long-term—with shareholders top of mind.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57460086,
    "published": 1769359359000,
    "title": "Tezos Tallinn upgrade now live, slashes block times to 6 seconds",
    "body": "The Tallinn protocol upgrade marks Tezos' 20th major update since launching in 2018, and was implemented without a network fork.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 206,
        "NAME": "FORKS",
        "CATEGORY": "FORKS"
      }
    ]
  },
  {
    "id": 57461216,
    "published": 1769364052000,
    "title": "Is Bitcoin Supercycle Truly On The Horizon? Analyst Predicts $31K Bottom In 2026",
    "body": "The calls of a potential Bitcoin supercycle in 2026 intensified over the past week after former Binance CEO Changpeng ‘CZ’ Zhao — yet another prominent voice in crypto — laid out his predictions for the new year. However, a popular analyst on the social media platform X has released an opposing view, predicting a deep bottom for the BTC price this year. BTC Price At Risk Of Further 65% Decline In a January 25th post on the X platform, prominent crypto trader Ali Martinez said, in a sarcastic tone, that “the super cycle is super cycling.” In what seemed like a response to the buzz around CZ’s Bitcoin supercycle projection, the market pundit tempered the expectations with a $31,000 price bottom call for the premier cryptocurrency in 2026. This bearish prediction is based on the appearance of price fractals on the BTC chart. For context, fractals are repeating patterns in price charts that can help map and project potential price movements for a particular cryptocurrency (Bitcoin, in this scenario). Related Reading: Gold Becomes The Whale Safe Haven As Bitcoin Takes A Back Seat As observed in the chart above, the price of BTC is currently following a similar movement pattern as in 2022. The premier cryptocurrency, after initially setting a then all-time high around $67,000 in early 2021, witnessed a nearly 55% correction to just above the $30,000 level by mid-July. While the price of Bitcoin recovered and went back to set a record high of above $69,000 by the end of 2021, the market leader spent the majority of the following year in a downward trend. Exacerbated by the various bearish events of 2022, BTC ended the year at a low of around $15,500. Martinez believes that the Bitcoin price is undergoing a similar movement pattern, having experienced an over 32% decline before climbing to the current all-time high of $126,080. The market pundit postulates that the premier cryptocurrency is currently witnessing the extended decline that saw its price reach $15,500 in 2022. However, it is worth mentioning that the target this time around lies at $31,800, nearly 65% drop from the current price point. Hence, if the historical patterns highlighted by Martinez are to go by, there seems to be a higher likelihood of the Bitcoin price embarking on an extended downward trend rather than a supercycle. Bitcoin Price At A Glance As of this writing, the price of BTC stands at around $88,528, reflecting an over 1% decline in the past 24 hours. Related Reading: Bitcoin Metric Suggests Miners Are In Recovery Mode — Price To Follow? Featured image from iStock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|bitcoin price|btc|BTC news|btc price|BTCUSDT|crypto",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57461044,
    "published": 1769363304000,
    "title": "Bitcoin slips below $88,000 ahead of Fed week and Big Tech earnings",
    "body": "Bitcoin and major tokens weakened Sunday as markets position ahead of the Federal Reserve’s next rate decision and a heavy slate of Magnificent Seven earnings.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57461817,
    "published": 1769366293000,
    "title": "Bitcoin sells off into weekly close as bulls face $86K BTC price reckoning",
    "body": "Bitcoin began losing gains as US futures prepared to open as markets geared up to deal with a host of potential downside volatility catalysts.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57463047,
    "published": 1769371201000,
    "title": "XRP Enters Phase 4 In Long-Term Chart Structure: Road To $21.5 Now Open",
    "body": "Technical analysis of XRP’s price action on the 3-week candlestick timeframe chart shows that the cryptocurrency is about to play out a road to the double-digit threshold based on its long-term structure. The analysis, which was shared on the social media platform X alongside a multiyear chart, points to XRP trading in what is labeled Phase 4. At the center of this setup is a clear technical target of a break above the previous all-time high and a run to at least $21.5 Related Reading: XRP Showing Strength, Analyst Points To $4 Potential XRP Price Action In Phases Technical analysis of XRP price action shows that the cryptocurrency has been trading in a series of four phases for more than a decade. One full sequence of four phases unfolded between mid-2013 and mid-2017 as the foundation for XRP’s first rally to price peaks. Since then, a second set of four phases has been developing and following a similar pattern. XRP transitioned into a new phase 1 and phase 2 sequence that led to a 2018 peak for phase 1 and then a pullback for phase 2 between 2018 and 2020. This was followed by an unusually long p3 that stretched from 2019 to mid-2024, visible on the chart as a broad, multi-year consolidation with converging trendlines of lower highs and higher lows. During this time, XRP’s price action was trapped inside the compression structure, just like the behavior seen during phase 3 of the first cycle. XRP Price Chart. Source: @amonyx On X Phase 4 Returns: XRP To Double Digits According to the technical analysis, phase 4 began in 2025, when XRP finally broke above the compression range in mid-2024. This breakout was the same structural transition seen in mid-2017, when XRP exited consolidation and entered expansion. Phase 4 has already been in progress for several months and includes the period when XRP rallied to new all-time highs in mid-2025, eventually topping out at $3.65 in July. Since that peak, however, XRP’s price action has been playing out a corrective downward trend and is down by roughly 48% at the time of writing. Despite the ongoing correction, the projection is that XRP is still in phase 4 and is going to break into new all-time highs soon. This shows that phase 4 could unfold over an extended period and not with a single impulse move. The current all-time high of $3.65 is the first major technical hurdle, and a break above it will serve as confirmation that XRP is back into price discovery. Related Reading: Gold Becomes The Whale Safe Haven As Bitcoin Takes A Back Seat Based on this technical analysis, past expansion ratios from the previous cycle are applied and a 6.618 Fibonacci extension is measured from the phase 3 support low. This points to a projected price level near $21.5. At the time of writing, XRP is trading at $1.89, meaning a move to that level would represent an increase of roughly 1,040% from current prices. Featured image from Pexels, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|crypto market|crypto news|cryptocurrency|xrp|xrp news|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57462904,
    "published": 1769370422000,
    "title": "'Opportunists' pushing protocol changes are BTC's biggest threat: Saylor",
    "body": "Major changes to the Bitcoin protocol should be well-thought-out and rare, Strategy co-founder Michael Saylor previously said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57463081,
    "published": 1769371262000,
    "title": "AI 'Swarms' Could Escalate Online Misinformation and Manipulation, Researchers Warn",
    "body": "A new academic paper examines how autonomous AI agents could make influence campaigns harder to detect and more effective at scale.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57464369,
    "published": 1769376028000,
    "title": "Foundry USA hashrate down 60% since Friday amid deadly storm: Report",
    "body": "Winter storm Fern is currently sweeping across the United States and has already left 1 million residents without electrical power.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      }
    ]
  },
  {
    "id": 57466735,
    "published": 1769385624000,
    "title": "Altcoins Don’t Move Slowly: 6-Week Window Can Rewrite Years Of Price Action",
    "body": "Crypto traders often assume that meaningful gains need long timelines to take place, and they often give up during the wait and silence. However, crypto has a habit of shattering that belief without warning. History shows that when conditions line up, altcoins do not grind higher over years. They release and erase multiple years of drawdowns in a matter of weeks. That memory was highlighted by a crypto commentator known as Waterman on the social media platform X, who noted a familiar seasonal window between February and late April to early May for an altcoin explosion. Related Reading: Gold Becomes The Whale Safe Haven As Bitcoin Takes A Back Seat Speed Matters More Than Time The most notable example of an altcoin rally season was in 2021, when the entire altcoin market went on a rally to new all-time highs, many of which are still unbroken for some cryptocurrencies. The 2021 cycle delivered some of the clearest reminders of just how fast capital can rotate once momentum takes hold. Solana moved from roughly $20 to $200 in about 50 days, a clean tenfold run. Although Solana has since broken above this peak to register a new all-time high of $293 in January 2025, this was still Solana’s most explosive rally to date. Dogecoin followed an even sharper trajectory, climbing from $0.07 to a peak of $0.73 in under a month due to speculative interest that flowed into other memecoins like Shiba Inu. Unlike Solana, Dogecoin is yet to reclaim or surpass this peak price. Avalanche went further, rallying from around $3 to $60 in less than 40 days, a twentyfold expansion that unfolded faster than most long-term projections ever anticipate. None of these moves required years of development or prolonged accumulation. A Timeframe To Watch Closely Notably, February through late April or early May has more often than not been the period where altcoin performance increases the most. If that pattern repeats, the coming weeks may matter far more than the years that came before them. At the time of writing, the notion of an altcoin season is still impeded by strong Bitcoin dominance. Much of that comes down to how the entire crypto industry ecosystem has changed massively since 2021, especially after the launch of crypto-based ETFs. That steady demand has kept capital inflows concentrated around Bitcoin and slowed the usual rotation into altcoins. Meme coins like Dogecoin and Shiba Inu have struggled to keep up in terms of price action, even with the launch of Dogecoin ETFs. Although the ETF has boosted visibility, it has not yet resulted into sustained upside. At the same time, investors have become more selective, favoring cryptocurrencies tied to clearer utility. As a result, many crypto communities have been working to create utility for their meme coins. Related Reading: XRP Showing Strength, Analyst Points To $4 Potential Nonetheless, as noted by Waterman, you only need about four to six weeks for an altcoin to wipe out three to four years of suffering. You don’t need one to two years for altcoins to make massive gains. Featured image from YouHodler, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|blockchain|crypto|crypto market|crypto news|cryptocurrency",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 44,
        "NAME": "SHIB",
        "CATEGORY": "SHIB"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57466741,
    "published": 1769385600000,
    "title": "Can’t Own SpaceX Or OpenAI? Tokenization Could Be The Next Best Thing.",
    "body": "Tokenization could unlock global access to an asset class historically reserved for pension funds, elite venture firms, family offices and sovereign wealth funds.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57467191,
    "published": 1769387413000,
    "title": "Crypto shaves $100B as Democrats threaten government shutdown",
    "body": "Senate Democrats have threatened to block a funding bill if it includes money for the Department of Homeland Security, making traders fearful of another possible US government shutdown.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  }
]