[
  {
    "id": 54472227,
    "published": 1763278694000,
    "title": "XRP Falls 4.3% Even After XRPC ETF Launch on Bitcoin Weakness, Finds Buyers Near $2.22",
    "body": "The market remains bearish with XRP struggling to break above the $2.23–$2.24 resistance zone.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|XRP News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54479249,
    "published": 1763290837000,
    "title": "US Bitcoin ETFs Post $1.1B Outflows As BTC Price Struggles Below $100K",
    "body": "Over the last two years, the performance of the US-based Bitcoin ETFs (exchange-traded funds) has been a fair reflection of the current market sentiment. With consecutive weeks of capital outflows, there is no doubt about the predominantly bearish climate of the market. This worsening sentiment can be seen in BTC’s dip below the psychological $100,000 price level. While selling pressure from various investor classes has been identified as one of the major factors behind BTC’s price decline, it is difficult to overlook the concurrent woeful performance of the Bitcoin ETFs. Bitcoin ETFs Record $492 Million Outflow To Close Week According to the latest market data, the US Bitcoin ETF market registered a daily total net outflow of over $492.1 million on Friday, November 14. This latest round of withdrawals marked the third-straight day of negative outflows for crypto-linked investment products. Related Reading: Is Bitcoin Falling Because Of Strategy Sell-Offs? On-Chain Data Fuels Debate Leading this massive capital outflow is the largest BTC exchange-traded fund by net assets, BlackRock’s iShares Bitcoin Trust (with the ticker IBIT). Data from SoSoValue shows that over $463.1 million was withdrawn from the spot BTC ETF on Friday. Grayscale Bitcoin Trust (GBTC) recorded the second-highest net outflow of $25.09 million on the day. Fidelity Wise Origin Bitcoin Fund (FBTC) and WisdomTree Bitcoin Trust (BTCW) were the only other Bitcoin ETFs that recorded negative outflows to close the week, with $2.06 million and $6.03 million, respectively. Grayscale’s Bitcoin Mini Trust (BTC) was the only spot Bitcoin exchange-traded fund that posted a capital influx on Friday, adding $4.17 million to its assets. On Thursday, September 13, the Bitcoin exchange-traded products registered their second-worst daily performance, with a total net withdrawal of $869.86 million. Meanwhile, Friday’s $492 million outflow worsened the US-based Bitcoin ETFs’ weekly record, bringing it to a total net outflow of over $1.11 billion. Bitcoin Lags Under $100,000: Price Overview Unsurprisingly, these Bitcoin ETFs’ woeful performances have coincided with the recent price decline below the crucial $100,000 level. As seen since launch in 2024, the price of BTC tends to move in tandem with the Bitcoin exchange-traded funds. As of this writing, the premier cryptocurrency is hovering around the $95,500 mark, showing some tame bullish action in the past 24 hours. According to data from CoinGecko, the price of BTC is down by nearly 7% in the past seven days. While selling pressure from spot investors continues to affect the market leader, an uptick in Bitcoin ETF demand could help kickstart a turnaround for the cryptocurrency. Related Reading: Bitcoin Market Top May Be In As Analyst Shares 1,064-Day Bull Cycle Pattern – Details Featured image from iStock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin ETFs|bitcoin price|btc|btc price|BTCUSDT|Spot Bitcoin ETF",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54481043,
    "published": 1763283652000,
    "title": "Trump’s Bitcoin Mining Firm Gets $100M+ Boost From Scaramucci Family: Report",
    "body": "AJ Scaramucci’s family has put more than $100 million into a Bitcoin mining company backed by US President Donald Trump’s sons, according to reporting on the deal. The cash came through Solari Capital, the firm led by AJ Scaramucci, and was part of a larger $220 million pre-IPO financing in July. Related Reading: Forget The Obituaries—Cardano Is Alive, Says Bitcoin Analyst Funding Round And Backers A report by Fortune has disclosed that the July financing was led by Solari Capital and raised $220 million in total. Solari’s investment is said to exceed $100 million, while Anthony Scaramucci also made a smaller personal contribution. Other investors named in coverage include the founder of Cardano, some real-estate figures, and a handful of entrepreneurs and public personalities. The move was framed by investors as a big bet on Bitcoin infrastructure rather than a simple token play. The Company’s Scale And Holdings According to filings, the company owned more than 60,000 Bitcoin miners as of May 31, 2025, with a reported fleet hashrate of about 10.17 EH/s. The same filings show the business has been building a strategic Bitcoin reserve: recent regulatory disclosures list thousands of coins held on the balance sheet. Those figures reflect both mined coins and market purchases used to grow the company’s stash. Partnerships And Ownership Structure American Bitcoin was formed in close partnership with a large mining operator that contributed infrastructure and much of the initial equipment. That partner holds the bulk of the new company’s economic interest, leaving the Trump brothers and a limited group of others with the remaining stake. The arrangement allowed American Bitcoin to scale quickly and move toward public trading through a merger agreement announced this year. National Security And Hardware Deals Coverage has raised concerns about a deal that gives the firm unusual access to equipment from a big Chinese miner. That arrangement reportedly includes the purchase of thousands of machines under extended payment terms — in some cases up to 24 months — with payments secured by pledged Bitcoin. Critics say such terms and hardware dependence could create political and security questions, especially given the firm’s high profile and links to US political leaders. Related Reading: XRP Earns Academic Praise: University Study Calls It ‘Gold In Your Hands’ Operational Performance And Recent Results Regulatory filings and quarterly releases show the business is producing Bitcoin from mining and is also buying coins on the open market to grow holdings. In the third quarter it mined several hundred BTC, a pace that helped lift revenue and margins in recent results. Backers say the model mixes production with accumulation to capture upside if prices rise. Some analysts warn the approach concentrates crypto price risk alongside the normal operational risks of running large data centers. Featured image from Pexels, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|AJ Scaramucci|American Bitcoin|Anthony Scaramucci|Bitmain|btc|btcusd|crypto|Trump",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54481906,
    "published": 1763296379000,
    "title": "Japan’s FSA plans to classify crypto as financial products, eyes 20% tax rate: Report",
    "body": "Japan’s FSA plans to reclassify crypto as financial products, enforce new disclosure and insider trading rules, and cut the crypto tax rate from 55% to a flat 20%.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54482756,
    "published": 1763298058000,
    "title": "Bitcoin To Eclipse Gold, Eric Trump Says—Calling BTC The ‘Greatest Asset’ Ever",
    "body": "According to remarks made at Yahoo Finance’s Invest event, Eric Trump told attendees he expects a major shift in how money flows between traditional stores of value and newer digital assets. Related Reading: Kiyosaki Stands His Ground—No Selling, More Bitcoin Buys Ahead He said Bitcoin’s fixed supply of 21 million coins and growing institutional buying are key drivers. In a separate interview with Fox Business in late September, he forecasted a long-term price target of $1 million per Bitcoin, a prediction that underscores how bullish his view is. Bitcoin Seen As A Faster Mover Of Value Eric argued that Bitcoin – which he called the “greatest asset” ever – moves value faster and cheaper across borders than metal that must be hauled and locked away. He called Bitcoin “digital gold,” and pushed the idea that its code-based supply gives it an advantage over physical bullion. Based on reports, he also framed crypto as a hedge against inflation, corruption, and weak monetary policy — reasons he said explain rising adoption around the globe. JUST IN: 🇺🇸 Eric Trump says a gold-to-Bitcoin rotation is imminent “The ratio will disproportionately shift to Bitcoin.” “It’s been the single greatest asset we’ve ever seen.” pic.twitter.com/4TYY1qALlm — Bitcoin Archive (@BitcoinArchive) November 14, 2025 American Bitcoin’s Rapid Rise Eric and his brother Donald Trump Jr. co-founded American Bitcoin (ABTC), which went public in September and now carries a market valuation approaching $4 billion. The firm has expanded quickly after merging with Gryphon Digital Mining. According to Bitcoin Treasuries, ABTC is the 25th-largest public company holder of Bitcoin in the US. Company officials say their West Texas mines benefit from low energy costs, allowing them to produce Bitcoin at roughly half of the current spot price. Source: Bitcoin Treasuries Company Growth And Risks Growth has been fast, but analysts and critics warn of clear risks. Mining firms gain when prices rise, and they can suffer when prices fall. Some worry that a combined ABTC-Gryphon business faces larger swings in earnings and asset values because crypto markets remain volatile. There are also concerns about mixing political ties with finance; World Liberty Financial, a Trump family-affiliated project, manages a WLFI governance token and a USD1 stablecoin, and some observers have flagged transparency questions. A Long Record Versus A Young Network Gold has centuries of use as a store of value and broad global acceptance. Bitcoin has existed since 2009 and shows rapid price moves that can create big winners and big losers. Historical data points to sharp shifts: during the 2017 rally, the Bitcoin-to-gold ratio hit record highs before it fell back when prices corrected. That history is often used to remind investors that gains can be followed by steep pullbacks. The correlation between the two has shifted over time, with each asset responding to different market pressures. Bitcoin and gold correlation. Source: Newhedge. What Analysts And Critics Warn Conflict of interest is one common critique: executives who publicly praise Bitcoin can also benefit directly when their companies hold or mine more coins. Forecasts that put a single Bitcoin at $1 million are seen by many as speculative rather than certain. Regulatory changes, tax rules, and policy moves in the US or abroad could change market conditions quickly, and those possibilities are stressed by cautious commentators. Related Reading: Forget The Obituaries—Cardano Is Alive, Says Bitcoin Analyst Eric Trump’s stance is clear: he believes capital will shift from gold to Bitcoin over time. Markets will decide if that prediction proves true. For now, both assets remain part of the conversation, each with different risks, costs, and histories that investors must weigh. Featured image from Alamy, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|American Bitcoin|bitcoin|btc|btcusd|crypto|Eric trump|gold|World Liberty Financial",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54482908,
    "published": 1763298267000,
    "title": "‘Flood Gates Are Now Being Opened’—Bitcoin Braced For Trump ‘Tsunami’ As He Promises 2026 Price Game-Changer",
    "body": "Bitcoin and crypto traders are betting on the Trump administration unleashing “a tsunami” of spending in 2026...",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54484792,
    "published": 1763302085000,
    "title": "What Is Q-Day? The Quantum Threat to Bitcoin Explained",
    "body": "Experts warn quantum computers could someday forge Bitcoin’s digital signatures, allowing unauthorized transactions.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Technology Guides",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54486816,
    "published": 1763305200000,
    "title": "Desperate Canadian Youth a Growing Target For Investment Scams",
    "body": "Strapped for cash and facing one of the bleakest job markets in decades, Canada’s young people are increasingly falling victim to financial fraudsters.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54488802,
    "published": 1763305231000,
    "title": "Bitcoin Indicator Sounds Buy Alarm For The First Time Since March — Return To $110K Soon?",
    "body": "The price of Bitcoin has struggled around the $95,000 mark after showing some early-weekend strength on Saturday, November 15. According to a prominent analyst on the social media platform X, the premier cryptocurrency seems to be showing signs of a potential rebound in the coming days. BTC Price To Return To $110,000? In a November 15 post on X, market analyst Burak Kesmeci shared that the price of Bitcoin is showing signs of recovery based on different technical indicators. In his analysis, Kesmeci fiddled with the possibility of BTC rising to $110,000 and the risk of falling to $85,000. Firstly, Kesmeci analyzed the Bitcoin fear (VIX) score, a technical indicator that evaluates volatility and fear in the market. According to data provided by the analyst, this indicator has been above the crucial 16.50 level for two consecutive days for the first time in 250 days, suggesting the presence of a buy opportunity. Related Reading: Massive Bitcoin Bid Walls Spotted On Binance: Bulls Step In With 2,800 BTC Cluster However, Kesmeci also highlighted that this signal does not automatically confirm a price rebound for the premier cryptocurrency from the current point. This buy signal might even persist and intensify if the VIX indicator continues to decline in the oversold zone. The crypto analyst noted that the Bitcoin price reacted a little to the daily Relative Strength Index (RSI) falling to 30, which marks the oversold territory. But Kesmeci mentioned that this RSI movement should offer little excitement, except if there is a positive divergence where RSI makes higher lows while price makes lower lows. Furthermore, Kesmeci examined the Fixed Range Volume Profile (FRVP), stating that there is a small gap with no volume between $95,000 and $85,000. According to the crypto analyst, a close below $95,000 could see the Bitcoin price fall—in a single candle—to as low as $85,000 in a bid to fill the FRVP gap. Kesmeci then hypothesized that holding above $95,000 could mean that Bitcoin is resting and building volume. With the current data suggesting that market makers are choosing to defend the $95,000, the crypto pundit believes that BTC could enjoy a reaction rally up toward $110,000, which is the real decision zone. Bitcoin Price At A Glance As of this writing, the price of BTC stands around $95,076, reflecting no significant movement in the past 24 hours. Related Reading: With Bitcoin At $94,000, Bitwise CEO Claims Crypto Has Endured A 6-Month Bear Market Featured image from iStock, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|bitcoin price|btc|btc price|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54490441,
    "published": 1763313476000,
    "title": "Tom Lee Says Ether Is Entering a Bitcoin-Like 'Supercycle'; Critics Push Back",
    "body": "BitMine Immersion Technologies’ executive chairman says ETH is beginning a bitcoin-style run as he highlights past drawdowns and patience.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Ether|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54493504,
    "published": 1763319600000,
    "title": "Judge Should Not Acquit Tornado Cash Dev Roman Storm, Prosecutors Argue",
    "body": "The DOJ filed its own post-trial motion last week, pushing back against Storm's motion for acquittal.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Roman storm|Tornado Cash|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54493179,
    "published": 1763318974000,
    "title": "Bitcoin Falls Below $94,000 for First Time Since May Amid 'Extreme Fear' Sentiment",
    "body": "Analysts highlighted retail distress, rare social-dominance surges and warnings of a possible deeper pullback as several major tokens remained under pressure.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Markets|Bitcoin News|btc|ETH|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54496761,
    "published": 1763326153000,
    "title": "SoFi Is Only The Beginning Of Bank-Based Crypto Products",
    "body": "As crypto adoption continues to accelerate, SoFi is staking out a retail-first position",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54497599,
    "published": 1763327554000,
    "title": "Bitcoin Erases Year’s Gain as Crypto Bear Market Deepens",
    "body": "Just a little more than a month after reaching an all-time high, Bitcoin has erased the more than 30% gain registered since the start of the year as the exuberance over the pro-crypto stance of the Trump administration fades and the recent cooling of high-flying technology stocks leads to a drop in overall risk appetite.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54497435,
    "published": 1763327327000,
    "title": "Peter Schiff calls Strategy's model 'fraud,' challenges Saylor to debate",
    "body": "Schiff also challenged Binance co-founder Changpeng Zhao (CZ) to a debate, slated to take place in December in the United Arab Emirates.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54499154,
    "published": 1763330953000,
    "title": "Ether Dips Below $3,100; Investment Manager Says Market Views ETH as 'More Risky' Than BTC",
    "body": "Timothy Peterson says ether ETFs have lost about 7% of cost-basis capital over five weeks, versus 4% for bitcoin ETFs.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Ether|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54502127,
    "published": 1763336532000,
    "title": "Bitcoin briefly erases 2025 gains as crypto bleeds over weekend",
    "body": "Bitcoin’s latest tumble pushed it below the $93,507 price it entered the year at, despite the year mostly seeing positive industry developments from corporations and governments.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54502348,
    "published": 1763337178000,
    "title": "Arca CIO Jeff Dorman Rejects Claims Saylor’s Strategy (MSTR) Faces Forced Bitcoin-Sale Risk",
    "body": "Dorman says fears that Strategy will be forced to sell bitcoin are misplaced, citing the firm’s balance sheet, governance and cash flow.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|btc|Peter Schiff|Jeff Dorman|Strategy|MSTR|Michael Saylor|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54506167,
    "published": 1763344405000,
    "title": "Harvard University triples stake in BlackRock’s Bitcoin ETF, filing shows",
    "body": "The Ivy League university held 6.8 million shares in BlackRock’s Bitcoin ETF as of Sept. 30, 2025, and has also boosted its exposure to gold.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54507819,
    "published": 1763347772000,
    "title": "Bitcoin Slides Deeper Into Red, Extending Decline Toward Key Support Zones",
    "body": "Bitcoin price failed to recover above $96,500. BTC is down over 3% and there are chances of more downsides below $92,000. Bitcoin started a fresh decline below $95,000 and $94,500. The price is trading below $98,000 and the 100 hourly Simple moving average. There is a bearish trend line forming with resistance at $96,600 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move down if it settles below the $92,500 zone. Bitcoin Price Dips Further Bitcoin price failed to stay in a positive zone above the $95,500 pivot level. BTC bears remained active below $95,500 and pushed the price lower. The bears gained strength and were able to push the price below the $94,000 zone. A low was formed at $92,890 and the price is now consolidating losses near the 23.6% Fib retracement level of the recent decline from the $103,998 swing high to the $92,890 low. Bitcoin is now trading below $95,000 and the 100 hourly Simple moving average . Besides, there is a bearish trend line forming with resistance at $96,600 on the hourly chart of the BTC/USD pair. If the bulls attempt another recovery wave, the price could face resistance near the $95,500 level. The first key resistance is near the $96,500 level and the trend line. The next resistance could be $97,200. A close above the $97,200 resistance might send the price further higher. In the stated case, the price could rise and test the $98,500 resistance. Any more gains might send the price toward the $99,500 level. The next barrier for the bulls could be $100,000 and $100,500. More Losses In BTC? If Bitcoin fails to rise above the $96,600 resistance zone, it could start another decline. Immediate support is near the $93,500 level. The first major support is near the $92,500 level. The next support is now near the $91,500 zone. Any more losses might send the price toward the $90,000 support in the near term. The main support sits at $88,500, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $92,500, followed by $90,000. Major Resistance Levels – $95,500 and $96,600.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54508384,
    "published": 1763348882000,
    "title": "Ethereum Slips to $3K, Highlighting Weakness After Recent Failed Rebound",
    "body": "Ethereum price failed to stay above $3,250 and extended losses. ETH is down over 5% and might struggle to recover above $3,250 in the near term. Ethereum started a fresh decline after it failed to stay above $3,200. The price is trading below $3,200 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance at $3,160 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move down if it settles below the $3,000 zone. Ethereum Price Dips Further Ethereum price failed to continue higher above $3,350 and started a fresh decline, like Bitcoin . ETH price dipped below $3,200 and entered a bearish zone. The decline gathered pace below $3,150 and the price dipped below $3,050. A low was formed at $3,003 and the price is now correcting some losses. There was a move toward the 23.6% Fib retracement level of the recent decline from the $3,560 swing high to the $3,003 low. Ethereum price is now trading below $3,200 and the 100-hourly Simple Moving Average. If there is another recovery wave, the price could face resistance near the $3,160 level. There is also a key bearish trend line forming with resistance at $3,160 on the hourly chart of ETH/USD. The next key resistance is near the $3,280 level and the 50% Fib retracement level of the recent decline from the $3,560 swing high to the $3,003 low. The first major resistance is near the $3,350 level. A clear move above the $3,350 resistance might send the price toward the $3,450 resistance. An upside break above the $3,450 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $3,500 resistance zone or even $3,550 in the near term. More Losses In ETH? If Ethereum fails to clear the $3,280 resistance, it could start a fresh decline. Initial support on the downside is near the $3,050 level. The first major support sits near the $3,000 zone. A clear move below the $3,000 support might push the price toward the $2,880 support. Any more losses might send the price toward the $2,750 region in the near term. The next key support sits at $2,640 and $2,620. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI – The RSI for ETH/USD is now below the 50 zone. Major Support Level – $3,050 Major Resistance Level – $3,280",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54509284,
    "published": 1763350370000,
    "title": "Tether mulls $1.15B deal with AI robotics startup Neura: Report",
    "body": "Tether is reportedly considering a $1.15 billion bet on robotics startup Neura, which could see its valuation rise to over $10 billion should a deal be made.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54509758,
    "published": 1763351389000,
    "title": "Arcade tokens are a ‘critical building block’ in crypto’s evolution: a16z",
    "body": "Venture capital firm a16z argues ecosystem-locked tokens, akin to airline miles, could be key for builders to create stable, spendable digital economies without the noise of speculation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54510236,
    "published": 1763352493000,
    "title": "XRP Price Continues Lower as Sellers Tighten Grip on Intraday Structure",
    "body": "XRP price started a fresh decline from $2.350. The price is now showing bearish signs and might extend losses if it dips below $2.150. XRP price started a fresh decline below the $2.320 zone. The price is now trading below $2.30 and the 100-hourly Simple Moving Average. There is a short-term bearish trend line forming with resistance at $2.2550 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move down if it settles below $2.150. XRP Price Dips Again XRP price attempted a recovery wave above $2.320 but failed to continue higher, like Bitcoin and Ethereum . The price started a fresh decline below $2.30 and $2.250. There was a move below the $2.20 pivot level. A low was formed at $2.155, and the price is now consolidating losses with a bearish angle. There was a minor move above the 23.6% Fib retracement level of the recent decline from the $2.525 swing high to the $2.155 low. The price is now trading below $2.30 and the 100-hourly Simple Moving Average. If there is a fresh upward move, the price might face resistance near the $2.2550 level. There is also a short-term bearish trend line forming with resistance at $2.2550 on the hourly chart of the XRP/USD pair. The first major resistance is near the $2.30 level, above which the price could rise and test $2.350 or the 50% Fib retracement level of the recent decline from the $2.525 swing high to the $2.155 low. A clear move above the $2.350 resistance might send the price toward the $2.440 resistance. Any more gains might send the price toward the $2.50 resistance. The next major hurdle for the bulls might be near $2.550. Another Decline? If XRP fails to clear the $2.350 resistance zone, it could start a fresh decline. Initial support on the downside is near the $2.20 level. The next major support is near the $2.150 level. If there is a downside break and a close below the $2.150 level, the price might continue to decline toward $2.050. The next major support sits near the $2.020 zone, below which the price could continue lower toward $1.880. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $2.20 and $2.150. Major Resistance Levels – $2.30 and $2.350.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54512094,
    "published": 1763356123000,
    "title": "Dogecoin (DOGE) Weak Rebound Attempts, Signaling Struggle to Mount Recovery",
    "body": "Dogecoin started a fresh decline below the $0.180 zone against the US Dollar. DOGE is now correcting some losses and might face hurdles near $0.1650. DOGE price started a fresh decline below the $0.180 level. The price is trading below the $0.170 level and the 100-hourly simple moving average. There is a bearish trend line forming with resistance at $0.1650 on the hourly chart of the DOGE/USD pair (data source from Kraken). The price could extend losses if it stays below $0.1650 and $0.170. Dogecoin Price Attempts Recovery Dogecoin price started a fresh decline after it closed below $0.20, like Bitcoin and Ethereum . DOGE declined below the $0.180 and $0.1720 support levels. The price even traded below $0.1650. A low was formed near $0.1535, and the price recently attempted a recovery wave. There was a move above the 23.6% Fib retracement level of the downward move from the $0.1776 swing high to the $0.1535 low. However, the bears were active near the $0.1620 resistance. Besides, there is a bearish trend line forming with resistance at $0.1650 on the hourly chart of the DOGE/USD pair. It is close to the 50% Fib retracement level of the downward move from the $0.1776 swing high to the $0.1535 low. Dogecoin price is now trading below the $0.1620 level and the 100-hourly simple moving average. If there is a recovery wave, immediate resistance on the upside is near the $0.1640 level. The first major resistance for the bulls could be near the $0.1650 level. The next major resistance is near the $0.170 level. A close above the $0.170 resistance might send the price toward the $0.180 resistance. Any more gains might send the price toward the $0.1840 level. The next major stop for the bulls might be $0.20. More Losses In DOGE? If DOGE’s price fails to climb above the $0.1650 level, it could continue to move down. Initial support on the downside is near the $0.1550 level. The next major support is near the $0.150 level. The main support sits at $0.1380. If there is a downside break below the $0.1380 support, the price could decline further. In the stated case, the price might slide toward the $0.120 level or even $0.1050 in the near term. Technical Indicators Hourly MACD – The MACD for DOGE/USD is now gaining momentum in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for DOGE/USD is now above the 50 level. Major Support Levels – $0.1550 and $0.1380. Major Resistance Levels – $0.1650 and $0.1700.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "DOGE|DOGE news|Doge price|DOGE USD|DOGE/BTC|DOGE/USDT|Dogecoin|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54514992,
    "published": 1763360383000,
    "title": "'Fat-Finger' Fail? Cardano Whale Torches $6M After Hitting Illiquid USDA Pool",
    "body": "The decision to route through an illiquid micro-cap stablecoin might go down as one of the year’s most costly errors.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Cardano|Trading|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54515484,
    "published": 1763362821000,
    "title": "Dogecoin Price Could Bounce Very Quickly If This Happens At $0.166",
    "body": "The Dogecoin price has generally followed the trajectory of other altcoins relative to Bitcoin and has seen deeper declines compared to the pioneer cryptocurrency. These declines have left the leading meme coin by market cap in the red, pushing it back down to levels not seen since 2023. As a result, the Dogecoin price is now in a precarious position where it needs to make a major move or DOGE investors risk more decline as the altcoin struggles to find support. Next Trajectory For The Dogecoin Price Bitguru, in an analysis on X, outlined where the Dogecoin price is and what could determine the next move for the cryptocurrency. This all comes back to a critical level that would send the price in either direction, making it the point where both bulls and bears are now fighting for dominance, and this level is at 0.166. Related Reading: Analyst Breaks Down Why There Can’t Be 7 Million XRP Holders As the crypto analyst explains, the Dogecoin price has been in a clear downtrend already, and there has been no indication that it will actually pull out of this soon. If anything, sideways movement has been the order of the day, and catalysts that could trigger another rally have not been forthcoming. It so happens that the Dogecoin price ended up being rejected at $0.1823, which has been established to be a major high for the digital asset. Hence, it puts the sellers in control once again as the price moves toward $0.166. This $0.166 level lies above the major support at $0.16, meaning that it is imperative for bulls to actually reclaim and hold it. Another problem that the digital asset is facing at this point is that it continues to form lower highs. Naturally, this is a bearish development for any cryptocurrency as it means that buyers are weakening and sellers are gaining control in the market. If these lower highs continue, then it could see further decline for the Dogecoin price as opposed to a possible recovery. Related Reading: Is Bitcoin Falling Because Of Strategy Sell-Offs? On-Chain Data Fuels Debate The Dogecoin price did try to rebound over the weekend, but was ultimately pushed back down as the Bitcoin price struggled at $95,000. Now, reclaiming the $0.166 is the next major task for bulls if the meme coin is to continue its ascent. In the event of a failure to reclaim $0.166 with momentum, then the Dogecoin price could correct lower. As the decline deepens, the next major support level lies firmly at $0.15, where there could be a wave of buying to trigger a short-term rise. Featured image from Dall.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]