[
  {
    "id": 55998526,
    "published": 1766084429000,
    "title": "XRP Faith Hits New Highs As Long-Term Holders Talk Of Historic Endgame",
    "body": "Reports have circulated across social channels this week after a prominent XRP commentator warned critics that they may be underestimating the token’s long-term role in finance. Related Reading: 5,606 Bitcoin: Lightning Network Sets Fresh Capacity Record According to a post on X by user UnknowDLT, XRP’s place in global payment rails was “planned more than a decade ago,” and the token could one day become “the most valuable asset in the world,” a claim that has stirred both debate and disbelief. Community Voice Turns Loud Supporters in the XRP community have long argued that market prices miss bigger shifts. Based on reports from prominent community accounts, followers say short-term trading noise hides structural moves that could lift demand for XRP over many years. One commentator, X Finance Bull, has suggested that Ripple’s escrow — which holds 34.4 billion XRP — will act as locked liquidity for banking corridors and institutional use, not as stockpiled supply destined for retail dumps. The world is NOT ready for what is coming for XRP. It was planned more than a decade ago, it is going to be the most valuable asset in the world. There will be war for your XRP. People keep laughing at XRP. They will end up crying for life, the end will be tragic for them. — {x} (@unknowDLT) December 15, 2025 Regulatory Moves And Institutional Aims Ripple’s recent regulatory steps are central to the bullish case. Reports have disclosed that the company received conditional clearance from the Office of the Comptroller of the Currency to pursue a national trust bank charter, and that it is seeking a Federal Reserve master account. Community analysts argue those developments, if fully realized, would move Ripple closer to mainstream financial plumbing and could change how markets view token supply and institutional demand. $XRP HOLDERS 🚨🚨🚨 If you’re thinking about selling your $XRP right now, THINK AGAIN! Remember this? Brad Garlinghouse confirmed the CLARITY Act is expected in early 2026. That’s not a maybe. That’s a countdown. And when it passes, Ripple will be forced to declare the fate of… https://t.co/s1E2KnarnM pic.twitter.com/C4xAcKDltR — X Finance Bull (@Xfinancebull) December 15, 2025 Some supporters also point to a possible US Clarity Act as a legal milestone, with a timeline floated by some voices for passage in the first half of 2026. Tokenization And Big Numbers Analysts and company projections are being used to sketch wider potential. Ripple has suggested the tokenization market could grow to $19 trillion by 2033. Other commentators take that figure and run scenarios: if a slice of that activity used the XRP Ledger, price forecasts can balloon — with one cited bullish figure at $189 per XRP under high-adoption cases. Some community voices expect large-scale tokenization momentum to build between 2026 and 2027, which they say would favor high-throughput ledgers like XRP’s. Related Reading: Ethereum Meets Wall Street: JPMorgan Rolls Out Tokenized Fund Numbers And Forecasts Not everyone shares the same optimism. Several firms mentioned by community members put much lower targets on XRP, with conservative models forecasting prices under $30 by 2030. Other professional models place $100 XRP well beyond the next decade. Traders and investors are left to weigh three competing threads: legal clarity, technical capacity, and whether escrowed holdings will be used for institutional flows rather than sold. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|bitcoin|CLARITY Act|crypto|memecoins|xrp",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55998473,
    "published": 1766084279000,
    "title": "Intuit to Integrate USDC Stablecoin Across TurboTax, QuickBooks",
    "body": "Fintech firm Intuit is working with Circle via a multi-year strategic alliance that will see USDC used across the firm's products.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55998195,
    "published": 1766083810000,
    "title": "Bitcoin Bounces Back Following Tepid Inflation Report",
    "body": "Bitcoin prices recovered on Thursday, December 18, bouncing back from the previous day’s decline after inflation figures came in lower than expected.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55998799,
    "published": 1766084735000,
    "title": "Bitcoin Policy Institute reps sound alarm on de minimis tax exclusion",
    "body": "US lawmakers are only considering de minimis tax exemptions for dollar-pegged stablecoins, according to Bitcoin Policy advocate Conner Brown.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56000693,
    "published": 1766088046000,
    "title": "Fading ETF Interest Puts Pressure on Dogecoin as Price Approaches Critical Cost-Basis Zone",
    "body": "Dogecoin (DOGE) is approaching a sensitive phase as weakening investor demand, stalled ETF inflows, and growing sell-side pressure converge near a key price area. Related Reading: XRP Risks Double-Top Crash Toward $0.40, Peter Brandt Warns Once driven largely by retail enthusiasm, the meme coin is now trading closer to levels where a significant share of holders last acquired their tokens, raising questions about downside risk if confidence continues to erode. At the same time, isolated whale accumulation and long-term cost-basis data suggest the market is approaching a zone that could define the next major move. DOGE's price trends to the downside on the daily chart. Source: DOGEUSD on Tradingview Dogecoin ETF Inflows Stall as Sentiment Softens One of the clearest shifts in Dogecoin’s recent market structure has been the loss of momentum in its exchange-traded funds. Data shows that the Grayscale and Bitwise DOGE ETFs have not recorded any inflows since December 11, with total inflows since launch standing at roughly $2 million. Combined assets under management are around $5.2 million, representing a negligible fraction of Dogecoin’s overall market capitalization. The muted response contrasts sharply with other altcoin ETFs, particularly XRP and Solana products, which have attracted hundreds of millions of dollars in inflows. The lack of sustained interest has raised questions about the long-term viability of DOGE-focused funds, especially given their low revenue potential at current asset levels. More broadly, the ETF slowdown reflects a risk-averse environment, with the crypto Fear and Greed Index remaining in fear territory. On-Chain and Derivatives Data Point to Bearish Bias Beyond ETFs, on-chain metrics show declining participation from large holders. Wallets holding between 100 million and 1 billion DOGE have reduced their balances by over 1 billion tokens since early December. Similarly, the proportion of DOGE supply in profit has slipped to near 50%, suggesting fewer holders are sitting on unrealized gains. Derivatives markets reinforce this cautious outlook. Short positions now account for more than half of open DOGE derivatives, while over $5 million in long positions were liquidated in a 24-hour period. Open interest has also declined, pointing to reduced speculative appetite rather than aggressive dip-buying. Price Near Key Support as $0.10 Comes Into Focus Technically, Dogecoin is trading near the $0.123–$0.126 range, an area that has repeatedly acted as support since April. The price remains below key moving averages, with momentum indicators such as MACD and RSI signaling continued downside pressure. A decisive break lower could expose the psychological $0.10 level. Related Reading: Ethereum Risks Slide To $2,000 If December Closes Below This Level: Analyst Analysts have also projected deeper historical support near $0.074, where roughly 28 billion DOGE last changed hands. While a move to that level would require further deterioration in sentiment, current conditions suggest Dogecoin is approaching a cost-basis zone that could determine whether sellers remain in control or longer-term holders begin to step in. Cover image from ChatGPT, DOGEUSD chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|Doge price|dogecoin price|dogeusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56000687,
    "published": 1766088000000,
    "title": "What if crypto's U.S. market structure effort just never gets there?",
    "body": "Guessing the direction of Congress is akin to long-range weather prediction, with so many variables in play, and the industry's fate depends on a break in the storm.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "News Analysis|U.S. Senate|Senate Banking Committee|Regulation|crypto legislation|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56000547,
    "published": 1766087785000,
    "title": "XRP slumps as bitcoin once again falls back to $85,000 level after surge",
    "body": "Crypto markets swung sharply Thursday following a softer-than-expected U.S. CPI print, which briefly lifted bitcoin above $89,000 during U.S. hours.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56003677,
    "published": 1766092917000,
    "title": "NYSE parent in talks to invest in crypto company MoonPay: Report",
    "body": "The discussions follow Intercontinental Exchange's $2 billion investment in prediction platform Polymarket in October.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56004362,
    "published": 1766094415000,
    "title": "Altcoins plunge as bitcoin's $85,000 test triggers $550 million in liquidations",
    "body": "Solana tumbled below $120 to its weakest price since April, while SUI, DOGE and ADA also fell sharply.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Market Wrap|Solana News|Altcoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56004020,
    "published": 1766093637000,
    "title": "SOL price action lags the wider altcoin market: Is Solana’s heyday over?",
    "body": "SOL falls behind multiple altcoin competitors as its onchain activity, fee and DApp revenues slump. Cointelegraph explains why.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56004807,
    "published": 1766095248000,
    "title": "Federal Reserve Revamps Bank Crypto Rules, Opening New Channels for Digital Asset Trading",
    "body": "The U.S. Federal Reserve has taken a notable step in reshaping how banks under its supervision can engage with crypto, reversing guidance introduced in 2023 that had sharply limited such activities. Related Reading: XRP Risks Double-Top Crash Toward $0.40, Peter Brandt Warns The decision reflects a broader reassessment inside the central bank about how regulation should adapt to financial innovation, especially as digital assets continue to intersect with traditional banking infrastructure. Under the earlier framework, uninsured state-chartered banks were required to follow the same constraints as federally insured institutions in order to remain under Federal Reserve supervision. That approach effectively barred some crypto banks from accessing core payment systems or Federal Reserve membership. BTC's price trends to the downside on the daily chart. Source: BTCUSD on Tradingview What the Policy Shift Changes for Banks The new guidance establishes a formal pathway for both insured and uninsured banks supervised by the Federal Reserve to pursue certain innovative activities, including those related to cryptocurrencies. Institutions will still be required to meet supervisory and risk-management standards, but they will no longer be automatically excluded based on their business models. For uninsured banks, the implications are significant. Access to Federal Reserve membership would allow direct settlement through central bank payment systems rather than reliance on intermediary banks. This idea could lower operational frictions for crypto custody, settlement, and related services, potentially expanding the role of banks in digital asset markets without changing existing safety and soundness expectations. Custodia Case Highlights Regulatory Tensions The policy reversal has renewed attention on Custodia Bank, a crypto-focused institution whose application for a Federal Reserve master account was denied in part due to the now-rescinded guidance. Custodia CEO Caitlin Long has argued that the 2023 policy effectively blocked lawful access to the Fed’s infrastructure and welcomed its withdrawal as a correction of past regulatory overreach. Not all policymakers agree. Federal Reserve Governor Michael Barr dissented from the decision, warning that loosening the framework could undermine a level competitive playing field and encourage regulatory arbitrage. Michael Barr’s position highlights the ongoing debate within regulatory circles over how to strike a balance between innovation and financial stability.r Broader Implications for Crypto Markets While the Fed’s move does not directly change how cryptocurrencies such as Bitcoin or Ethereum trade, it may influence market structure over time. Easier access for banks could support deeper institutional participation, greater liquidity, and expanded custody and settlement options. Related Reading: Ethereum Risks Slide To $2,000 If December Closes Below This Level: Analyst For now, the shift signals a more flexible regulatory posture, one that acknowledges the rapid evolution of digital asset markets and the banks that seek to serve them. Cover image from ChatGPT, BTCUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|bitcoin price|btc|btc price|btcusd|crypto",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56004847,
    "published": 1766095146000,
    "title": "Coinbase appoints ex-UK finance minister George Osborne to chair advisory council",
    "body": "Osborne began advising Coinbase in 2024 and has been critical of the UK government's lack of robust digital asset regulations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56004463,
    "published": 1766094412000,
    "title": "Brazilian stock exchange to launch tokenization platform and stablecoin",
    "body": "A representative from Brazil's stock exchange, B3, said the stablecoin would be “a tool to enable trading in tokens,\" which it planned to offer in 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 56004639,
    "published": 1766094300000,
    "title": "Charles Hoskinson Talks Trump's Impact on Crypto",
    "body": "Charles Hoskinson comments on Trump's meme coin, the president's impact on crypto, and how the government ruined the super cycle:“The minute that Trump Coin got launched. It went from ‘crypto is bipartisan’ to ‘crypto = Trump = bad = corruption.'\"",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56005074,
    "published": 1766095656000,
    "title": "Charles Hoskinson: Trump Crypto Ventures Have Been 'Frustrating'—But Others Won't Talk About It",
    "body": "The Cardano founder said Trump’s meme coin launch and politicization of crypto hurt the industry’s long-term prospects ahead of the 2026 midterm elections.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56004958,
    "published": 1766094900000,
    "title": "Charles Hoskinson Critiques US Government on Crypto Objectivity",
    "body": "Cardano’s Charles Hoskinson says the U.S. government needs much more rigorous testing when it comes to deciding which cryptocurrencies are considered valuable and which are not.“Why is XRP in the system but not Sui? Why is Solana in the system but not BNB? Can we objectively answer that against some metric?”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56005933,
    "published": 1766097149000,
    "title": "Crypto CLARITY Act set for Senate markup in January, says Sacks",
    "body": "White House AI and crypto czar David Sacks said the CLARITY Act will reach the Senate next month for debate and amendment before a full vote.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56006665,
    "published": 1766098818000,
    "title": "Solana Value Proposition Extends Beyond Tech Into Economic Infrastructure",
    "body": "In the evolving landscape of blockchain technology, Solana has rapidly emerged as a platform not merely defined by its technical capabilities but by its broader implications for economic infrastructure. By enabling the class of decentralized applications, SOL is positioning itself as a high-performance blockchain and a foundational layer for the next-generation economic activity. Why Infrastructure That Enables Continuous Markets In an X post, crypto analyst Vibhu mentioned that Solana is no longer just a piece of financial technology, but a fully functioning economy. What exists on SOL today has gone beyond transactions and smart contracts. Related Reading: Solana Gains Institutional Momentum as New On-Chain Bond Deal and XRP Integration Build Hype According to the expert, there are dollars and native currencies, real-world assets, metals and rare minerals, energy market, information markets, manufacturing primitives, and global trade rails all operating in real-time on-chain. SOL also has politics, governance processes, divided factions, and ongoing debates about the leading network’s future. At this point, we are witnessing the birth of a country that lives entirely on the internet. Measured through economic output, SOL would rank around the 157th largest country in the world by GDP (Gross Domestic Product), comparable in size to nations such as Eswatini or Fiji. However, SOL is globally integrated by default, and from a forex and asset-flow perspective, it punches above its weight, integrating with the largest banks and financial institutions across the globe. Furthermore, SOL has withstood sustained network attacks from nation-state actors, defending itself with systems engineers instead of armies. Economically, SOL is already engaged in trade with countries like Bhutan, ranked 164, the Isle of Man, ranked 154, and even Kazakhstan, which ranks 49 in global economic standings. “Solana is a digital country, and I am proud to be a citizen,” Vibhu noted. Why Real-Time On-Chain UX Finally Works On Solana Solana continues to see key updates and integration that tend to bolster the network capabilities. Co-founder of TeamElevenX1 and Ambassador at Solflare, Kristofer_Sol, has highlighted that MagicBlock is quietly doing some of the most important work in the Solana ecosystem, pushing real-time SOL closer to true production scale. Related Reading: Solana Faces Critical Test Near $100 as Macro Pressure and Network Upgrades Collide At the center of this shift is the deep integration of compressed accounts into the Light Protocol inside Ephemeral Rollups, reducing rent costs by up to 200 times, while still functioning like a normal account for developers. The compression demo is already live, and real applications are actively using it today. Others like Rush Trade deliver faster trades, and Pixels achieve smooth, real-time pixel updates. Kristofer_Sol stated that this is what a scalable on-chain user experience actually looks like. With low-cost reduction and speed improvements happening without forcing developers to rewrite everything, MagicBlock is quietly removing the friction that has held back games, social apps, and consumer products on SOL. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Solana|GDP|Gross Domestic Product|Kristofer_Sol|Light Protocol|MagicBlock|Sol|SOL news|SOL Price|Solana news|Solana Price|Solflare|SOLUSD|SOLUSDT|TeamElevenX1|Vibhu",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56007677,
    "published": 1766100600000,
    "title": "Synthetix returns to Ethereum mainnet after 3 years: ‘We can run it back’",
    "body": "Synthetix founder Kain Warwick expects other perpetual decentralized exchanges to follow Synthetix back to Ethereum, which is faster than ever.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56008771,
    "published": 1766102880000,
    "title": "XRP’s familiarity helps push ETFs past $1B assets: Exec",
    "body": "XRP has a “number of reasons” that are attracting traditional investor dollars, which has helped to push XRP ETFs over $1 billion in assets, says CF Benchmarks CEO Sui Chung.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56008707,
    "published": 1766102719000,
    "title": "Solana, Aptos Move to Harden Blockchains Against Future Quantum Attacks",
    "body": "Developers have begun testing new cryptography to guard against forged transactions and wallet theft, in preparation for a changing world.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "aptos||Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 70,
        "NAME": "APT",
        "CATEGORY": "APT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56011093,
    "published": 1766107643000,
    "title": "Senate confirms Trump crypto-friendly nominees to take over CFTC, FDIC",
    "body": "In a package of confirmations, the U.S. Senate approved Mike Selig to lead the CFTC and Travis Hill to run the FDIC, both with major potential reach into crypto.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|U.S. Senate|U.S. Commodity Futures Trading Commission|U.S. Federal Deposit Insurance Corp.|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56012154,
    "published": 1766109618000,
    "title": "Bitcoin Faces Elevated Downside Risk: Loss Selling Takes Hold As STH SOPR Falls Below 1",
    "body": "Bitcoin has been under intense selling pressure in recent sessions, leaving market participants increasingly cautious about near-term direction. On Wednesday, BTC briefly surged from the $86,000 area toward $90,000, offering short-term investors a moment of relief after weeks of downside volatility. That rebound, however, proved short-lived. Price quickly retraced back to the $86,000 level, once again stalling bullish momentum and reinforcing the perception that sellers remain firmly in control. Related Reading: From Cycles To Continuity: Why Bitcoin’s 4-Year Pattern May Be Breaking This failed recovery attempt has weighed heavily on sentiment, particularly among short-term holders who entered positions at higher levels during the previous consolidation range. According to a report by Axel Adler, on-chain data reveals that this cohort has entered a clear stress regime. Bitcoin’s price has fallen below the average purchase price of short-term holders, a condition that historically increases the probability of reactive selling behavior. The stress is further reflected in the Short-Term Holder Spent Output Profit Ratio (STH-SOPR, 30-day), which has declined to 0.98. This reading indicates that short-term holders are, on average, realizing losses when they sell. Such environments often coincide with deteriorating confidence and heightened sensitivity to further downside moves. With BTC unable to hold recent relief rallies and short-term participants increasingly underwater, the market enters a fragile phase. The coming days will be critical in determining whether this pressure evolves into deeper capitulation or stabilizes into a base-building process. Short-Term Holders Under Stress as Loss-Taking Accelerates Adler explains that the Short-Term Holder Spent Output Profit Ratio (STH-SOPR 30D) is a critical gauge of short-term market stress, as it measures whether recent coin sales are occurring at a profit or a loss. Values above one indicate that short-term holders are selling profitably, while readings below one signal loss realization. Historically, sustained periods below one reflect deteriorating confidence and raise the risk of further downside, as loss-taking behavior can cascade into additional sell pressure. A continued decline in SOPR would likely intensify this dynamic and open the door to new local lows. By contrast, a meaningful recovery would require the metric to reclaim and hold above the one level, signaling that selling pressure is being absorbed and losses are no longer dominant. This stress is reinforced by the Short-Term Holders Positive vs Negative Sentiment chart. The indicator classifies holders based on whether they are in profit or at a loss. Over the past five weeks, sentiment has shifted decisively toward the orange and purple zones, representing negative positioning. The growing dominance of underwater holders increases the probability of panic-driven selling. Together, both charts deliver a consistent message: short-term participants are under pressure, and the current environment remains fragile until clear signs of relief emerge. Related Reading: Bitcoin Structure Turns Bearish As Structural Indicators Flip Negative Bitcoin Tests Critical Support as Bears Persist Bitcoin continues to trade under pressure, with the chart showing price consolidating around the $87,000 area after a sharp corrective move from the October highs near $125,000. The rejection from the upper range marked a clear shift in market structure, as BTC lost the 50-day and 100-day moving averages and failed to reclaim them on subsequent rebounds. The blue moving average has now turned downward, reinforcing the short- to medium-term bearish bias. Price is currently hovering just above the 200-day moving average, plotted in red, which sits near the $86,000–$88,000 zone. This level represents a critical area of long-term demand and structural support. Historically, sustained closes below the 200-day average tend to coincide with deeper corrective phases or prolonged consolidation. Related Reading: XRP Liquidity Dries Up: Futures Buy Volume On Binance Falls from $5.8B to $250M Volume dynamics add to the cautious outlook. Selling pressure expanded significantly during the breakdown in October and November, while recent rebound attempts have occurred on relatively muted volume. This suggests that short-covering and tactical buying, rather than strong spot demand, are driving price stabilization. Structurally, Bitcoin is forming lower highs since the peak, keeping the broader trend vulnerable. A recovery scenario would require BTC to reclaim the $95,000–$100,000 region and hold above the declining moving averages. Until then, the chart favors continued consolidation or further downside risk around the long-term support zone. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|Bitcoin news|Bitcoin Short-Term Holder|Bitcoin STH|Bitcoin STH SOPR|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56013202,
    "published": 1766111400000,
    "title": "Bitcoin Price Retests Support—Is the Market Bracing for Volatility?",
    "body": "Bitcoin price attempted to start a fresh increase but failed at $89,500. BTC is now struggling below $86,500 and might continue to move down. Bitcoin started a fresh decline below the $86,500 zone. The price is trading below $86,500 and the 100 hourly Simple moving average. There was a break below a bullish trend line with support at $87,250 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move down if it settles below the $85,000 zone. Bitcoin Price Dips Again Bitcoin price attempted a fresh recovery wave above $88,000 and $88,500. BTC tested the $89,500 resistance zone and reacted to the downside. There was a sharp decline below $88,000. There was a break below a bullish trend line with support at $87,250 on the hourly chart of the BTC/USD pair. The price even spiked below the $85,000 support. However, the bulls were active near the $84,500 zone. A low was formed at $84,421 and the price is now consolidating losses below the 23.6% Fib retracement level of the downward move from the $89,437 swing high to the $84,421 low. Bitcoin is now trading below $87,000 and the 100 hourly Simple moving average. If the bulls remain in action, the price could attempt more gains. Immediate resistance is near the $86,600 level. The first key resistance is near the $87,000 level and the 50% Fib retracement level of the downward move from the $89,437 swing high to the $84,421 low. The next resistance could be $88,000. A close above the $88,000 resistance might send the price further higher. In the stated case, the price could rise and test the $88,800 resistance. Any more gains might send the price toward the $89,500 level. The next barrier for the bulls could be $90,000 and $90,500. More Losses In BTC? If Bitcoin fails to rise above the $87,000 resistance zone, it could start another decline. Immediate support is near the $85,000 level. The first major support is near the $84,500 level. The next support is now near the $83,200 zone. Any more losses might send the price toward the $82,500 support in the near term. The main support sits at $80,500, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $85,000, followed by $84,500. Major Resistance Levels – $87,000 and $88,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56014378,
    "published": 1766113252000,
    "title": "Flight To Metals? Gold And Silver Hit Records While Bitcoin Drops",
    "body": "Gold and silver hit fresh highs on Tuesday while Bitcoin slid back under $89,000, sending a clear message that some investors are favoring metal over riskier bets. Related Reading: Russia Rejects Crypto As Legal Tender, Finance Official Confirms According to Reuters and market data, gold traded above $4,330 an ounce and silver pushed past $66 an ounce in what market participants called a strong run for bullion. Reports have disclosed that silver’s rally has lifted local prices in India to about ₹2.06 lakh per kilogram. Metals Rally, Hit New Highs Silver’s advance has been dramatic. It is up roughly 120-130% year-to-date, a jump that outpaces gold by a wide margin. Traders point to a mix of stronger industrial demand from solar and electronics, tighter supplies, and flows into safe assets as reasons behind the move. Gold buyers have also been encouraged by signs that US inflation may cool and by shifting expectations for central bank policy, which tends to support non-yielding assets when real yields fall. JUST IN 🚨: Silver soars to $66 for the first time in history 📈🥳🫂 pic.twitter.com/YGCrB5VDPH — Barchart (@Barchart) December 17, 2025 Safe Haven Demand And Industrial Use Some investors are treating metals as a hedge. Others want exposure linked to real economy needs. Both forces are at work. Analysts say silver’s dual role — as an industrial metal and as a store of value — is amplifying moves. Energy prices and supply reports have added pressure on markets, and that has upped demand for physical metal in several trading hubs. Bitcoin Slips Under Key Level Bitcoin fell below $89,000 and was trading nearer to $88,450 in mid-session, giving back gains from earlier months. Based on reports and market feeds, BTC is about 7% lower year-to-date and roughly 30% below its October 2025 peak above $126,000. Some crypto funds recorded outflows recently, and several traders described market tone as risk-off, which has weighed on digital assets this week. Liquidity, ETF Flows And Sentiment ETF flows played a role. Where money leaves ETFs, prices can feel the impact quickly. Margin calls, profit taking after a volatile run, and investors moving to what they see as safer stores of value have all been cited by sources watching the tape. Technical levels near $84,000 to $85,000 are now being watched for support, while resistance sits close to $90,000 to $92,000. Related Reading: 5,606 Bitcoin: Lightning Network Sets Fresh Capacity Record Markets Eye Data And Policy Moves Economic reports and central bank signals are next on traders’ calendars. US inflation prints and comments from global central banks have been flagged as possible triggers for fresh moves in both metals and crypto. Investors also noted that equity weakness, especially in some large tech names, has nudged money toward hard assets and away from riskier positions. Several market strategists said that policy shifts overseas, including from the Bank of Japan, could further change global liquidity and investor choices. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|Bank of Japan|bitcoin|btc|crypto|etf|gold|metals|silver|yellow metal",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56014093,
    "published": 1766112596000,
    "title": "Bitwise files with SEC to offer spot SUI ETF",
    "body": "Bitwise has filed an initial registration for an ETF tracking Sui, joining the race to launch with Canary Captial and 21Shares.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 96,
        "NAME": "SUI",
        "CATEGORY": "SUI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56014632,
    "published": 1766113687000,
    "title": "Ethereum Price Sinks Again—Are Bulls Running Out of Defenses?",
    "body": "Ethereum price failed to stay above $2,95 0 and declined again. ETH is now consolidating and might soon aim to attempt another recovery wave if it clears $2,850. Ethereum started a fresh decline below the $2,920 zone. The price is trading below $2,900 and the 100-hourly Simple Moving Average. There is a connecting bearish trend line forming with resistance at $2,925 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move down if it settles below the $2,800 zone. Ethereum Price Faces Renewed Selling Pressure Ethereum price attempted a fresh increase but struggled above $2,950, like Bitcoin . ETH price dipped below $2,920 and $2,900 to enter a bearish zone. The bears even pushed the price below $2,820. A low was formed at $2,775 and the price is now consolidating losses well near the 23.6% Fib retracement level of the downward move from the $2,993 swing high to the $2,775 low. Ethereum price is now trading below $2,870 and the 100-hourly Simple Moving Average . Besides, there is a connecting bearish trend line forming with resistance at $2,925 on the hourly chart of ETH/USD. If there is another upward move, the price could face resistance near the $2,850 level. The next key resistance is near the $2,880 level and 50% Fib retracement level of the downward move from the $2,993 swing high to the $2,775 low. The first major resistance is near the $2,925 level and the trend line. A clear move above the $2,925 resistance might send the price toward the $3,000 resistance. An upside break above the $3,000 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $3,080 resistance zone or even $3,120 in the near term. Downside Continuation In ETH? If Ethereum fails to clear the $2,850 resistance, it could start a fresh decline. Initial support on the downside is near the $2,800 level. The first major support sits near the $2,775 zone. A clear move below the $2,775 support might push the price toward the $2,720 support. Any more losses might send the price toward the $2,640 region. The next key support sits at $2,620. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone. Hourly RSI – The RSI for ETH/USD is now below the 50 zone. Major Support Level – $2,775 Major Resistance Level – $2,880",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56016486,
    "published": 1766116329000,
    "title": "Bitcoin jumps above $87,000, yen slides as Bank of Japan hikes interest rates",
    "body": "The Bank of Japan raised its short-term policy rate by 25 basis points to 0.75%, the highest in nearly 30 years.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56017138,
    "published": 1766117287000,
    "title": "XRP Price Turns Lower as a Familiar Pattern Reappears Again",
    "body": "XRP price failed to gain pace above $1.920 and trimmed gains. The price is now struggling and faces resistance near the $1.820 level. XRP price started a fresh decline below the $1.850 zone. The price is now trading below $1.850 and the 100-hourly Simple Moving Average. There is a bearish trend line forming with resistance at $1.920 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move down if it settles below $1.780. XRP Price Dips To New Weekly Lows XRP price attempted a recovery wave above $1.90 but failed to continue higher, like Bitcoin and Ethereum . The price started a fresh decline below $1.880 and $1.850. There was a move below the $1.820 support level. A low was formed at $1.7707, and the price is now showing bearish signs below the 23.6% Fib retracement level of the downward move from the $1.9331 swing high to the $1.7707 low. The price is now trading below $1.850 and the 100-hourly Simple Moving Average. There is also a bearish trend line forming with resistance at $1.920 on the hourly chart of the XRP/USD pair. If there is a fresh upward move, the price might face resistance near the $1.810 level. The first major resistance is near the $1.8520 level or the 50% Fib retracement level of the downward move from the $1.9331 swing high to the $1.7707 low. A close above $1.8520 could send the price to $1.880. The next hurdle sits at $1.920 and the trend line. A clear move above the $1.920 resistance might send the price toward the $1.9650 resistance. Any more gains might send the price toward the $2.00 resistance. The next major hurdle for the bulls might be near $2.050. More Losses? If XRP fails to clear the $1.8520 resistance zone, it could start a fresh decline. Initial support on the downside is near the $1.780 level. The next major support is near the $1.7620 level. If there is a downside break and a close below the $1.7620 level, the price might continue to decline toward $1.720. The next major support sits near the $1.70 zone, below which the price could continue lower toward $1.680. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $1.780 and $1.7620. Major Resistance Levels – $1.8520 and $1.920.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56017611,
    "published": 1766117716000,
    "title": "Crypto market cap falls to 8-month low, analysts see more pain ahead",
    "body": "The total crypto market cap fell to $2.93 trillion, its lowest since April, erasing yearly gains as analysts anticipated further declines.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56018722,
    "published": 1766119450000,
    "title": "Bitcoin, ether pop higher as Japan rate hike lifts Asian risk appetite",
    "body": "Japan’s 10-year government bond yield briefly touched 2% for the first time since 2006 after the central bank lifted its benchmark rate.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56019191,
    "published": 1766119894000,
    "title": "How cheap power turned Libya into a Bitcoin mining hotspot",
    "body": "Libya’s cheap power fueled a hidden Bitcoin mining boom, straining the grid and forcing authorities into an escalating crackdown.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56019640,
    "published": 1766120889000,
    "title": "Dogecoin (DOGE) Sinks Further Into Red as Momentum Turns Sharply Bearish",
    "body": "Dogecoin started a fresh decline below the $0.1250 zone against the US Dollar. DOGE is now consolidating losses and might face hurdles near $0.1235. DOGE price started a fresh decline below the $0.1250 level. The price is trading below the $0.1220 level and the 100-hourly simple moving average. There is a key bearish trend line forming with resistance at $0.1300 on the hourly chart of the DOGE/USD pair (data source from Kraken). The price could extend losses if it stays below $0.1280 and $0.1300. Dogecoin Price Dips Further Dogecoin price started a fresh decline after it closed below $0.1300, like Bitcoin and Ethereum . DOGE declined below the $0.1280 and $0.1250 support levels. The price even traded below $0.1220. A low was formed near $0.1198, and the price is now showing bearish signs. It is consolidating below the 23.6% Fib retracement level of the downward move from the $0.1305 swing high to the $0.1198 low. Dogecoin price is now trading below the $0.1280 level and the 100-hourly simple moving average. If there is a recovery wave, immediate resistance on the upside is near the $0.1235 level. The first major resistance for the bulls could be near the $0.1280 level or the 76.4% Fib retracement level of the downward move from the $0.1305 swing high to the $0.1198 low. The next major resistance is near the $0.1300 level. There is also a key bearish trend line forming with resistance at $0.1300 on the hourly chart of the DOGE/USD pair. A close above the $0.1300 resistance might send the price toward the $0.1350 resistance. Any more gains might send the price toward the $0.1372 level. The next major stop for the bulls might be $0.1400. More Losses In DOGE? If DOGE’s price fails to climb above the $0.1300 level, it could continue to move down. Initial support on the downside is near the $0.1200 level. The next major support is near the $0.1195 level. The main support sits at $0.1150. If there is a downside break below the $0.1150 support, the price could decline further. In the stated case, the price might slide toward the $0.1050 level or even $0.10 in the near term. Technical Indicators Hourly MACD – The MACD for DOGE/USD is now gaining momentum in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for DOGE/USD is now above the 50 level. Major Support Levels – $0.1280 and $0.1250. Major Resistance Levels – $0.1340 and $0.1350.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "DOGE|DOGE news|Doge price|DOGE USD|DOGE/BTC|DOGE/USDT|Dogecoin|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56019561,
    "published": 1766120488000,
    "title": "US Senate confirms pro-crypto Selig to lead CFTC, Hill to head FDIC",
    "body": "Mike Selig pledged to make crypto a priority when he was picked to lead the CFTC in October, while Travis Hill has been speaking out against crypto debanking.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56021947,
    "published": 1766124026000,
    "title": "Bitcoin Mirrors Q1 2025 Playbook, Is It Headed To $70,000 Before Year’s End?",
    "body": "As the market volatility continues, Bitcoin (BTC) has failed to hold its short-lived momentum and reclaim a key resistance level for the second time this week. Some market watchers have affirmed that the flagship crypto may continue to have a disappointing end-of-year rally and potentially reach new lows before the pain is over. Related Reading: Did Crypto Investors Stop Believing In The Four-Year Cycle? Analyst Weighs In New Lows Before A 2026 Recovery? On Thursday, Bitcoin attempted to break past a crucial level after surging 2.9% from its daily opening. The cryptocurrency has been unable to reclaim $89,000-$90,000 area since the start-of-week correction, which sent the price to a two-week low of $85,145. Notably, the flagship crypto retested the crucial resistance area twice in the past 24 hours but has been rejected, falling back to the local lows. Market observer Ted Pillows highlighted that BTC has been holding above the $85,000 support zone despite the volatility, which could lead to another retest of the key $90,000-$92,000 zone if it holds. However, if price break below local support zone, Bitcoin would likely see a retest of the November lows, around the $80,000 mark. Ted also pointed out that the cryptocurrency may be mirroring its Q1 2025 price action, which suggests that a price drop below the recent lows could happen. Per the chart, BTC briefly bounced in March from its early 2025 correction before recording a lower low in the next few weeks. This was then followed by the Q2 and Q3 recovery rallies that propelled the price to its latest all-time high (ATH) of $126,000. Now, Bitcoin displays a similar performance, currently recovering from the initial corrective phase. If history repeats, the flagship crypto could see a 10%-15% drop to the $74,000-$76,000 area in the coming weeks before kicking off a rally toward new highs in 2026, the analyst suggested. Bitcoin To Continue With ‘No Direction’ Similarly, Ali Martinez affirmed that the cryptocurrency is at an inflection point and risks dropping up to 20% if the $87,000 support doesn’t hold. He explained that BTC is breaking out of a bear flag, which could target the $70,000 level if selling pressure spikes. Meanwhile, another analyst considers that “sentiment [is] flipping based on every last daily candle colour.” Daan Crypto Trades pointed out that Bitcoin has been trading within the $84,000-$93,500 for the past four weeks, “moving up and down in a choppy fashion, while trading in between these two larger levels.” To the trader, the next few weeks will continue to be “generally very choppy and lack direction” due to lower liquidity and trading volume during the holiday season. “I don’t think you’d be missing much if you log off and come back somewhere early January,” he added. Related Reading: XRP Price Must Defend This Level To Avoid 50% Breakdown, Analyst Warns On the contrary, analyst Crypto Jelle affirmed that despite the low-timeframe struggles, Bitcoin “still flat out refuses to drop lower, no matter how hard bears try.” He noted that price still sits “on a clear weekly support level” that has held since April, explaining that as long as this area holds, price can still reclaim the monthly opening, around the $90,300 area. As of this writing, BTC trades at $86,138 a 5.3% decline in the weekly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|Bitcoin breakdown|Bitcoin correction|bitcon|btc|BTC ATH|btc price|BTCUSDT|crypto analyst|Crypto Bull Run 2025|crypto market correction|Crypto Market Recovery|Crypto trader",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56021944,
    "published": 1766124021000,
    "title": "Crypto Payments Firm MoonPay Set For $5 Billion Valuation With NYSE Owner’s Backing",
    "body": "Crypto payment platform MoonPay is poised to receive a significant fundraising boost as recent reports suggest that Intercontinental Exchange (ICE), the owner of the New York Stock Exchange (NYSE), is exploring an investment in the company. According to a Bloomberg report, which cited sources familiar with the discussions, MoonPay is close to finalizing this fundraising round and is targeting a valuation around $5 billion. New Regulatory Approval And Investment Talks Based in New York, MoonPay specializes in simplifying the trading of cryptocurrencies through various payment methods, including PayPal, Apple Pay, and Venmo. The platform also offers tools for users to send, receive, and manage stablecoins. Notably, MoonPay recently obtained a Limited Purpose Trust Charter from the New York Department of Financial Services (NYDFS), a significant regulatory approval that complements its existing BitLicense. Related Reading: Bitwise’s 2026 Crypto Forecast: Bitcoin, Ethereum, And Solana Poised For New Record Highs This charter enables MoonPay to expand its custody and other crypto services within New York, placing the company in league with established players like Coinbase (COIN) and PayPal, which also operate under the state’s strict digital asset regulations. The momentum for MoonPay continues to build, particularly with news that Caroline Pham, the acting chair of the Commodity Futures Trading Commission (CFTC), plans to join the firm as its chief legal and administrative officer. CFTC Chair Caroline Pham to Join MoonPay Pham has been a notable figure in the regulatory landscape, having served on the CFTC’s board since April 2022 and becoming acting chair in January 2025. She announced her intention to return to the private sector once a permanent chair was confirmed, which is expected to happen this week with Mike Selig’s anticipated confirmation. Under Pham’s leadership, the CFTC expedited several initiatives focused on cryptocurrencies, including the allowance for spot crypto trading on futures exchanges and the launch of a digital assets pilot program permitting the use of assets like Bitcoin (BTC) and Ethereum (ETH) in derivatives markets. Additionally, Pham implemented various operational changes within the CFTC, reportedly leading to nearly $50 million in annual savings by enhancing governance and accountability. Related Reading: Optimism Grows In Crypto Market Structure Bill After Wednesday’s Senate Banking Meeting Pham articulated that her agenda as acting chair concentrated on executing a range of presidential executive orders aimed at promoting regulatory clarity and efficiency across government agencies. Reflecting on her decision to join MoonPay, she emphasized the importance of people in her career choices, stating that meaningful connections guide her decisions. Her connection to MoonPay began through a dinner hosted by Christie’s Art + Tech in 2023, where she met MoonPay’s president, Keith Grossman. A conversation that started at the dinner evolved into a friendship and later professional discussions as Pham considered her options post-government. Grossman expressed confidence in Pham’s capabilities, stating, “MoonPay has really matured, and Caroline is the exact type of leader with the exact type of big bank and regulatory experience that’s needed for us to be able to move to the next level.” Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|Caroline Pham|CFTC acting chair|crypto|crypto market|crypto news|cryptocurrency|ICE|Intercontinental Exchange|MoonPay|MoonPay news|NYSE crypto news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56026808,
    "published": 1766130609000,
    "title": "Bitcoin rebounds on Japan rate hike as Arthur Hayes sees dollar at 200 yen",
    "body": "Bitcoin headed higher despite the Bank of Japan's interest-rate hike while reactions saw bullish risk-asset signals and no further policy tightening.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56029507,
    "published": 1766134851000,
    "title": "Solana (SOL) Support Shattered, Potential $100 Test Looms, Says Analyst",
    "body": "Solana (SOL) is currently one of the poorest performers among the top ten largest cryptocurrencies in the market, experiencing a sharp 13% decline over the past week. Bearish Patterns Emerge For Solana This downturn comes as the cryptocurrency has broken below the critical support level of $120, which had acted as a pivotal floor since the start of the month and previously prevented further drops. The situation appears even more dire for investors with bullish sentiments, as recent data from CoinGecko indicates that Solana has retraced nearly 60% from its all-time high of $293, reached back in January of this year. Year-to-date, the token has experienced a significant loss of 40%, which raises additional concerns among top analysts about its near-term stability. Related Reading: Optimism Grows In Crypto Market Structure Bill After Wednesday’s Senate Banking Meeting Experts are cautioning that unless conditions change, the Solana price may soon retest the $100 mark—an area not seen since April. Should this scenario materialize, it would imply an additional drop of approximately 15.9%. Some analysts, like market commentator EddieTradezz, have pointed to a bearish “head and shoulders” pattern formed in SOL’s daily chart, suggesting that Solana is on the brink of a substantial decline. He notes that it is now breaking through strong long-term resistance, with April’s lows around $95 potentially being a more realistic target than $100. Adding to the bearish sentiment, fellow expert ColdBloodShill has indicated that Solana may be heading toward a price point of $80, which would result in a drastic additional drop of 32%. However, as EddieTradezz mentioned, the possibility for recovery would largely depend on market-wide conditions and investor sentiment. Institutional Interest Grows As SOL ETFs See Major Inflows Despite the prevailing bearish indicators, there has been a noteworthy development on the institutional front. Recently approved Solana exchange-traded funds (ETFs) in the US have seen impressive uptake, amassing $63.9 million in net inflows over the past week. This suggests that institutions are beginning to accumulate Solana, potentially viewing it as a long-term investment opportunity. However, this positive news has been overshadowed by heavy selling pressure in spot markets. Related Reading: Bitwise’s 2026 Crypto Forecast: Bitcoin, Ethereum, And Solana Poised For New Record Highs Increased volatility has led to a rise in liquidations for leveraged positions, dampening Solana’s price reaction to the overall positive developments in institutional interest. Ultimately, Solana’s future remains uncertain. While institutional interest may offer some hope, the immediate outlook is clouded by increased selling pressure and the inability to regain capital in the broader market, which has recently dropped below the $2.90 trillion mark in total market capitalization. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Solana|crypto|crypto news|Sol|SOL Price|SOL price analysis|SOL price news|Solana ( SOL)|Solana ETFs|Solana news|Solana price analysis|solana price correction|Solana price forecast|Solana Price prediction|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56031482,
    "published": 1766137475000,
    "title": "Metaplanet to debut US trading with Deutsche Bank under MPJPY",
    "body": "Metaplanet will debut US trading via American Depositary Receipts, aiming to broaden access for US investors without raising new capital.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 56031228,
    "published": 1766137271000,
    "title": "Metaplanet to start sponsored ADR program to woo over-the-counter U.S. investors",
    "body": "The sponsored level I ADR listing strengthens U.S. investor access, settlement quality and market credibility, the company said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|MetaPlanet|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      }
    ]
  },
  {
    "id": 56031856,
    "published": 1766137886000,
    "title": "Fragmentation drains up to $1.3B a year from tokenized assets: Report",
    "body": "New research models how crosschain price gaps and capital friction are eroding efficiency as tokenized markets scale across blockchains.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      }
    ]
  },
  {
    "id": 56032737,
    "published": 1766139453000,
    "title": "Bitcoin’s Post-CPI Whipsaw Liquidates Over $500M Again",
    "body": "Liquidations surged amid volatility from derivatives profit-taking and a shifting macro backdrop from the Bank of Japan’s rate hike.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56032669,
    "published": 1766139295000,
    "title": "Jump Trading hit with $4B lawsuit tied to $50B Terra crash: WSJ",
    "body": "Terraform Labs sued Jump Trading and senior executives for $4 billion, alleging the firm manipulated Terra’s ecosystem and unlawfully profited from the crash, the WSJ reported.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 34,
        "NAME": "LUNA",
        "CATEGORY": "LUNA"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 56032537,
    "published": 1766138996000,
    "title": "Coinbase files lawsuits in 3 states over attempts to regulate prediction markets",
    "body": "The crypto exchange is taking legal action against Connecticut, Michigan and Illinois, Chief Legal Officer Paul Grewal wrote on X.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Coinbase|Prediction Markets|Connecticut|Michigan|Illinois|lawsuits|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56032355,
    "published": 1766138722000,
    "title": "Latest bitcoin bull turns bear, Fidelity director warns of year-long crypto winter",
    "body": "Fidelity’s global macro director, Jurien Timmer, has called the end of the latest bitcoin bull run, while highlighting gold’s continued bull market strength.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Fidelity|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56035601,
    "published": 1766143812000,
    "title": "Bitcoin Feels The Weight Of Quantum Risk Concerns, Industry Leaders Warn",
    "body": "Concerns over quantum computing are weighing on Bitcoin’s price and slowing some investment flows, amid a sharp divide between developers and many investors. Related Reading: UK Crypto Ownership Takes Biggest Hit Since 2021, Regulator Says Developers Call Threat Distant According to Bitcoin developer Adam Back of Blockstream, quantum machines remain far from able to break Bitcoin’s protections. He said the tech is still “ridiculously early” and that research hurdles persist. Back expects no real threat within the next decade and argued that even if parts of Bitcoin’s cryptography were compromised, the network would not automatically be emptied. Security, he noted, does not rest solely on encryption in a way that would allow mass theft on the blockchain. i think the risks are short term NIL. this whole thing is decades away, it’s ridiculously early and they have massive R&D issues in every vector of the required applied physics research to even find out if it’s possible at useful scale. but it’s ok to be “quantum ready” and — Adam Back (@adam3us) December 18, 2025 The Risk That Keeps Some Awake Other voices in the community disagree. Jameson Lopp, a well-known Bitcoin engineer, has warned about the worst-case outcome if quantum advances allowed attackers to break the ECDSA signature scheme that secures many wallets. In that scenario, forged signatures could be used to move funds, and user confidence might erode quickly. That warning has been repeated as a technical possibility, not as something imminent. How should we treat quantum vulnerable coins in a future where quantum computing becomes a threat? This panel from the Presidio Quantum Bitcoin Summit features myself, @theblackmarble, and @cryptoquick.https://t.co/jhr6hjLXru — Jameson Lopp (@lopp) September 14, 2025 Investors Worry, Capital Shifts Nic Carter, a partner at Castle Island Ventures, told observers that it is “extremely bearish” when influential developers appear to dismiss any quantum risk outright. He said the gap between investor concern and developer assessment is large. Reports have disclosed that some capital is being held back while large holders consider spreading risk into other assets. Craig Warmke of the Bitcoin Policy Institute added that perceived quantum risk has already pushed some holders to reduce their Bitcoin positions. Quantum risk is stemming the flow of capital into bitcoin, and encouraging large holders to diversify out of bitcoin. When non-technical people express concerns, they sometimes use technically incorrect language. It’s frustrating to see technical people dismiss concerns with an… https://t.co/MtSNY7Ivg3 — Craig Warmke (@craigwarmke) December 18, 2025 Current Technology Falls Short Most cryptographers agree quantum computers today are not powerful enough to crack Bitcoin’s cryptography. That assessment is widely reported by analysts who follow both fields. Metaculus’s median date for when quantum computers will break modern cryptography is 2040:https://t.co/Li8ni8A9Ox Seemingly about a 20% chance it will be before end of 2030. — vitalik.eth (@VitalikButerin) August 27, 2025 Still, the timeline is debated. Based on reports from researchers and public comments from industry figures like Vitalik Buterin, there is a measurable chance — about ~20% — that a machine capable of breaking today’s crypto could exist by 2030. That estimate has prompted calls for proactive steps. Related Reading: Trump-Linked World Liberty Backs USD1 With Treasury-Fueled Expansion Calls For Preparedness Grow Financial institutions and national programs, the reports say, are investing heavily in quantum work, and tools like AI are accelerating research in the field. As a result, many in the crypto world argue contingency plans should be ready well before any practical threat appears. Suggestions include moving to quantum-resistant signature schemes and improving wallet practices so funds are not left exposed while upgrades take place. Some experts point out that banks and other big targets may face attacks earlier, which could give the crypto sector time to respond. Featured image from Shutterstock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|quantum computers",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56036251,
    "published": 1766144649000,
    "title": "Oracle TikTok deal lifts AI mining stocks as bitcoin tags $88,000",
    "body": "Oracle shares jumped 6% in pre-market on Friday as TikTok's U.S. agreement helped calm AI bubble fears after a volatile macro week.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|AI|Mining|TikTok|Oracle|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56036353,
    "published": 1766144747000,
    "title": "Jump Trading sued for $4 billion in connection to Do Kwon’s Terra Labs collapse: WSJ",
    "body": "The administrator winding down what remains of Terraform is suing Jump Trading, accusing it of contributing to its demise while profiting illegally.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Terra luna|Terraform|Do Kwon|Jump trading|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 56036640,
    "published": 1766143800000,
    "title": "Crypto Markets Today: Bitcoin rallies on Japan rate hike as futures traders pile in",
    "body": "BTC rose to $88,000 after the Bank of Japan raised interest rates. The increase, seen as a potential risk-off trigger, failed to spark a flight into the yen.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|Derivatives|market analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56039219,
    "published": 1766149210000,
    "title": "XRP Holders Are In For More Pain As There’s ‘Not A Single Support Holding’",
    "body": "XRP holders could be facing another prolonged stretch of downside pressure as the cryptocurrency continues to lose ground in a weakening market. XRP’s performance this period has been underwhelming enough that analysts have seemingly given up hope of the price challenging higher resistance levels in the near term. They revealed that XRP has slipped below key support zones, leaving few technical barriers to slow further declines. XRP Faces Further Decline As All Support Fails A crypto market analyst who goes by the name ‘Guy on the Earth’ on X has shared a rather bleak outlook on XRP’s near-term prospects. In his post on Thursday, the analyst revealed that XRP looks set for more pain as the market structure continues to deteriorate. He noted that price action is now threatening to lose its Descending Channel, signaling overall weakness rather than stabilization. Related Reading: Bitcoin Just Entered Extreme Oversold Levels And Analysts Predict New ATH Targets According to the expert, the probability of XRP reclaiming the $1.95 level by the weekly close is incredibly low. However, losing this consolidation range that has contained price since November 2024 opens the door to a technical downside target near $0.90. He also pointed out that a confirmation from the monthly timeframe aligns with the two-week chart, which is fast approaching its close in just a few days. Guy on the Earth stated there was little optimism left in the current price setup. He emphasized that no meaningful support levels are holding, and the market demand appears thin, leaving XRP vulnerable to continued selling pressure and potential declines. The analyst’s review of the cryptocurrency’s performance was blunt, suggesting that the market “is what it is” at this stage. Looking at the chart shared alongside the analysis, XRP is clearly trading within a well-defined downward channel that has guided price lower for several months now. Each bounce attempt has been capped by descending resistance, reinforcing the cryptocurrency’s bearish trend. Recent candles also show price drifting toward the lower boundary of the Descending Channel, increasing the risk of a correction. Momentum indicators at the bottom of the chart also reflect ongoing pressure. XRP’s Relative Strength Index (RSI) sits near the lower end of its range, showing persistent weakness as price fails to recover. Related Reading: Ripple Goes Institutional: What The Doppler Finance And SBI Partnership Means For XRP Analyst Weighs Short-Term Hope For XRP When asked by a crypto community member if a daily close back inside the Descending Channel could temporarily save XRP from an extended downturn, Guy on the Earth acknowledged the possibility. He stated that such a move could help in the short term but described it as a “trivial” development compared to larger structural levels. The crypto analyst’s focus remains on the $1.95 level on the two-week close, highlighting it as the most critical area to watch. He pointed out that this structure has remained intact for the past 13 months, making it a defining support zone for XRP. While bouncing back to the channel would not erase the broader bearish trend, the expert revealed that it would at least suggest that XRP still has a chance to grow. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|ripple news|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56039995,
    "published": 1766149996000,
    "title": "What Malaysia’s royal stablecoin reveals about Asia’s shift to tokenized money",
    "body": "Malaysia’s RMJDT shows how Asia is pulling stablecoins into regulated finance, linking tokenized assets with local-currency onchain settlement.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      }
    ]
  },
  {
    "id": 56040349,
    "published": 1766150738000,
    "title": "Terraform Bankruptcy Admin Sues Jump Trading for $4B Over TerraUSD Collapse: Report",
    "body": "Jump is accused of unlawfully profiting from and contributing to the collapse of Terra, in a lawsuit seeking $4 billion in damages.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "terra-luna-2|luna-wormhole|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 56041255,
    "published": 1766151861000,
    "title": "Solana AI token Ava hit by launch sniping tied to deployer: Bubblemaps",
    "body": "Bubblemaps says 23 wallets tied to the Ava deployer sniped 40% of the AVA supply at launch. The Solana AI token later fell 96% from its peak.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56041763,
    "published": 1766152849000,
    "title": "Here’s How Much % Of Bitcoin Supply Is Currently Sitting In Losses",
    "body": "On-chain analytics platform Glassnode has revealed the number of Bitcoin supply that is currently sitting at a loss. This comes as the BTC price continues to trade below the psychological $90,000 level following its crash, which began last month. Here’s The Amount Of Bitcoin Supply At A Loss In a report, Glassnode revealed that the Bitcoin supply in loss has risen to 6.7 million BTC, marking the highest level of loss-bearing supply observed in this cycle. The analytics platform further noted that this represents 23.7% of the circulating supply, which is currently underwater. 10.2% of this supply is held by long-term holders and 13.5% by short-term holders. Related Reading: The Bearish Structure That Puts Bitcoin Price At $92,550, And Then $82,000 Glassnode stated that this distribution suggests that, much like in prior cycle transitions into deeper bearish regimes, the loss-bearing Bitcoin supply accumulated by recent buyers is gradually maturing into the long-term cohort. Meanwhile, the analytics platform noted that the 6-7 million range, which has been at a loss since mid-November, mirrors early transitional phases of prior cycles, where mounting investor frustration came before a shift toward more bearish conditions and intensified capitulation at lower Bitcoin prices. Notably, the Bitcoin price has dropped to levels last seen in 2024, erasing its year-to-date (YTD) gains. Glassnode stated that this has left behind a dense supply cluster accumulated by top buyers in the $93,000 to $120,000 range. The resulting supply distribution is said to reflect a top-heavy market structure where recovery attempts are capped by heavy overhead sell pressure, especially in the early stages of a bearish phase. Glassnode declared that as long as the Bitcoin price remains below this range and fails to reclaim key thresholds, most notably the Short-Term Holder Cost Basis at $101,500, the risk of further corrective downside persists. BTC Spot Demand Is Unstable Glassnode revealed that the Bitcoin spot market flows continue to reflect an uneven demand profile across major venues. The Cumulative Volume Delta bias is said to show periodic bursts of buy-side activity, but has failed to develop into sustained accumulation, especially during the recent BTC price pullbacks. Related Reading: Why Is Bitcoin And Ethereum Prices Down Today? BlackRock Deposits Spark Worry The on-chain analytics platform noted that the Coinbase spot CVD remains relatively constructive, indicating steadier participation from US-based investors. On the other hand, Binance and aggregate Bitcoin flows remain choppy and largely directionless. Glassnode stated that these dispersion points point to selective engagement rather than coordinated spot demand. Meanwhile, the platform alluded to recent Bitcoin price declines, which it pointed out have not triggered decisive expansion in positive CVD. Glassnode noted that this suggests dip-buying remains tactical and short-term. In the absence of sustained accumulation across all venues, Bitcoin’s price action continues to rely more on activity in the derivatives market and liquidity conditions rather than organic spot demand. At the time of writing, the Bitcoin price is trading at around $86,800, up in the last 24 hours, according to data from CoinMarketCap. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|Binance|bitcoin|Bitcoin news|bitcoin price|Bitcoin Spot Market|Bitcoin supply|btc|BTC news|btc price|btcusd|BTCUSDT|Coinbase Spot CVD|CoinMarketCap|cumulative volume delta|glassnode|Year-To-Date|YTD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56041757,
    "published": 1766152800000,
    "title": "Re-litigating the GENIUS Act Brings Risk and No Rewards",
    "body": "If bipartisan agreements like the GENIUS Act can be immediately reopened whenever an incumbent industry dislikes their competitive implications, legislative compromise becomes impossible, argues Blockchain Association CEO Summer Mersinger.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Opinion|Stablecoin legislation|US Congress|Opinion",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      }
    ]
  },
  {
    "id": 56042373,
    "published": 1766153663000,
    "title": "CoinDesk 20 Performance Update: Index Jumps 4.6% as All Constituents Trade Higher",
    "body": "Sui (SUI) gained 7% and Solana (SOL) rose 6.9%, leading the index higher.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "CoinDesk Indices|CoinDesk Indices|CoinDesk 20|charts|Prices|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 96,
        "NAME": "SUI",
        "CATEGORY": "SUI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56042986,
    "published": 1766154496000,
    "title": "Is Bitcoin Primed for a 2026 Breakout? Analysts Weigh History vs. Fundamentals",
    "body": "Bitcoin's oversold RSI signals a potential rally to $170K, analysts argue, as record ETF inflows and fading headwinds build a bullish case.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56044194,
    "published": 1766156439000,
    "title": "Dogecoin Holds The Floor, But Momentum Says Otherwise — A Critical Standoff Unfolds",
    "body": "Dogecoin is showing resilience at key support, with buyers repeatedly stepping in to absorb downside pressure. However, momentum indicators and the broader structure continue to favor the bears, keeping the short-term trend under stress. This tug-of-war sets the stage for a decisive move, as the next reaction will determine whether DOGE stabilizes or slides deeper. DOGE Stuck In A Prolonged Corrective Phase According to a recent update by More Crypto Online, Dogecoin’s price action remains stuck in a corrective phase that has been in place since November 2024. The sharp flash crash on October 10 added complexity to the broader structure, making the chart harder to interpret. However, the core scenarios outlined in earlier analyses are still valid, with the short-term trend clearly leaning to the downside. Related Reading: Fading ETF Interest Puts Pressure on Dogecoin as Price Approaches Critical Cost-Basis Zone Although the “yellow” scenario allows for the possibility of one more push higher, downside momentum is still currently in control. Until DOGE shows a decisive reaction at a major support level, or at least manages to stabilize before slipping below the 9.6-cent level that marks the October 10 low, further weakness should be expected. Initial support sits at 9.6 cents, followed by deeper levels at 8.0 cents and then 5.4 cents. Whether price eventually reaches these lower targets is still uncertain, but for now, there are no technical signals suggesting that a local bottom has formed. Overall momentum remains negative, with DOGE still trading within a local downtrend. While a bullish reversal could develop at some point, current conditions do not justify adopting a bullish bias. Trying to anticipate a reversal ahead of confirmation carries increased risk in this environment, making caution the prudent approach for now. Bears Press, But Dogecoin Refuses To Break Crypto analyst Broke Doomer revealed that DOGE is displaying significant resilience, as bears have attempted to push the price lower multiple times without success. Despite the persistent downward pressure, the price continues to hold its ground, suggesting that the current support level is much firmer than sellers anticipated. Related Reading: Dogecoin Price Can Stage A 96% Rally If It Breaks This Falling Wedge Pattern The analyst noted that every dip into this specific zone is being bought up relatively quickly, a clear indication that strong bids are still stepping in whenever weakness is shown. This aggressive “buy-the-dip” behavior suggests that institutional or large-scale buyers are likely positioning themselves within this consolidation range, preventing a deeper breakdown. Given this ongoing battle between supply and demand, the focus has now shifted to the longevity of this base. Broke Doomer raised the question of how long this support will hold before buyers finally seize full control of the momentum. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Dogecoin|Broke Doomer|Corrective Phase|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt|More Crypto Online",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56044172,
    "published": 1766156400000,
    "title": "Most Influential: Hsiao-Wei Wang and Tomasz K. Stańczak",
    "body": "The Ethereum Foundation’s new leaders hope to bring in a new era for the second-largest cryptocurrency.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Ethereum Foundation|CoinDesk Most Influential 2025|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56043914,
    "published": 1766156148000,
    "title": "DraftKings enters prediction markets with CFTC-approved app for real-world events",
    "body": "The sports-betting giant enters the growing world of event contracts with CFTC-registered DraftKings Predictions in 38 states.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Prediction Markets|Sports|Sports Betting|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 56044000,
    "published": 1766156070000,
    "title": "Wall Street bank JPMorgan says stablecoin market could grow to $600 billion by 2028",
    "body": "The bank said stablecoin growth is still mostly driven by crypto trading, and rising payments use may boost velocity more than supply.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Stablecoins|JPMorgan|Analysts|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56047159,
    "published": 1766160962000,
    "title": "South Korean Police Probe Counterfeit Cash Ring That Targeted Crypto Traders",
    "body": "Investigators said suspects printed fake 50,000-won bills to scam crypto holders in face-to-face trades.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56048170,
    "published": 1766162580000,
    "title": "Foundation behind restaking protocol EigenLayer plans bigger rewards for active users",
    "body": "An Incentives Committee would direct programmatic token emissions, focusing allocations on participants that secure AVSs and contribute to the EigenCloud ecosystem.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|EigenLayer|Ethereum News|Governance|Eigenlabs|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      }
    ]
  },
  {
    "id": 56048850,
    "published": 1766163662000,
    "title": "Decrypt’s 2025 Project of the Year: Hyperliquid",
    "body": "Hyperliquid, a venue for high-risk leveraged trading on volatile assets, captured the attention of the crypto industry like no other project this year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Long Reads",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56048504,
    "published": 1766163230000,
    "title": "Bitcoin earns base case target of $143,000 at Citigroup",
    "body": "The Wall Street bank said its bitcoin forecast relies on further crypto ETF inflows and a continued rally in traditional equity markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Citigroup|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56048688,
    "published": 1766162232000,
    "title": "OpenAI bailed out? Trump Media stock up 40%! Wallet Connect Interview",
    "body": "Commission-free stock and etf trading (u.S.), allowing users to trade equities alongside crypto using usd or usdc. Prediction markets, enabling trading on real-world outcomes like elections, sports, and economic data via a partnership with kalshi. Equity futures and perpetuals trading, expanding derivatives access directly inside the main coinbase app. Solana dex trading via jupiter, allowing users to swap solana tokens directly on coinbase. New borrowing functionality against btc and eth holdings. Coinbase token sales, allowing for ico launches and early-stage token support. Coinbase tokenize, an institutional platform designed to support tokenized assets, including tokenized stocks over time. Base app global launch, making coinbase’s onchain “everything app” available in more than 140 countries. Coinbase business, now generally available, offering payments, invoicing, and usdc-based tools for companies. Expanded stablecoin and payments apis, including embedded wallets and custom-branded stablecoins for builders. Coinbase advisor, an ai-powered assistant designed to help users navigate portfolios and coinbase products.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 205,
        "NAME": "TOKEN SALE",
        "CATEGORY": "TOKEN SALE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56047048,
    "published": 1766160879000,
    "title": "Citi is still a believer in crypto stocks despite bitcoin being rocked to end the year",
    "body": "Circle remains the bank's top pick in the sector, with Bullish and Coinbase following.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Circle|Gemini|Bullish|Citi|Strategy|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56050124,
    "published": 1766165466000,
    "title": "Polish parliament approves revived crypto bill, heads to Senate",
    "body": "The legislation, which many have criticized for being overly restrictive for the digital asset market, was reintroduced with “not even a comma” changed, according to one lawmaker.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56050870,
    "published": 1766166900000,
    "title": "Coinbase ‘cautiously optimistic’ on 2026 as crypto nears institutional inflection point",
    "body": "Coinbase Institutional says clearer regulation, stablecoin growth and shifting macro conditions could mark a turning point for crypto markets in 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56050595,
    "published": 1766166363000,
    "title": "New Malware Poses as Roblox Mods to Steal Crypto Credentials",
    "body": "The Stealka malware is inserted into pirated mods for video games including Roblox, and can lift sensitive info from apps.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|dogecoin||monero|Gaming",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 57,
        "NAME": "XMR",
        "CATEGORY": "XMR"
      }
    ]
  },
  {
    "id": 56051390,
    "published": 1766167748000,
    "title": "SBF's cohorts at FTX take last SEC hit, Ellison banned from company roles for decade",
    "body": "Three of Sam Bankman-Fried's top lieutenants atop the former FTX empire — Caroline Ellison, Gary Wang and Nishad Singh — agreed to consent judgments.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Caroline ellison|FTX|Sam Bankman-Fried|Nishad singh|Gary wang|U.S. Securities and Exchange Commission|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  }
]