[
  {
    "id": 54749178,
    "published": 1763815592000,
    "title": "Spot Bitcoin ETFs pull $238M as Ether funds snap 8-day outflow streak",
    "body": "Bitcoin ETFs pull in $238 million as Ether funds end an eight-day outflow streak and Solana products extend a ten-day run of inflows.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54749626,
    "published": 1763817027000,
    "title": "Serious JPMorgan Warning Triggers Urgent Response As Fears Swirl Of 2026 Bitcoin And Crypto Price Crash",
    "body": "Analysts with Wall Street giant JPMorgan have sounded the alarm over a looming threat to bitcoin-buying behemoth Strategy...",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54750825,
    "published": 1763820042000,
    "title": "Bitcoin Investors Sitting On Deep Unrealized Losses — What This Means For Price",
    "body": "The price of Bitcoin has continued to struggle in the final quarter of the year, recently slipping beneath the 2025 starting point. According to the latest on-chain data, investors are currently sitting on deep unrealized losses, which suggests more pain for the market. STHs Sit On Heavy Losses Through Market Crash In a Quicktake post on the CryptoQuant platform, online crypto pundit Crazzyblockk revealed that specific classes of Bitcoin investors are holding through worrying amounts of losses. This evaluation is based on the Age-Band Unrealized PnL Distribution metric, which shows the amount of profit or loss different classes of Bitcoin holders (sorted by age of coins held) are yet to realize. Related Reading: Saylor’s Strategy Under Threat: Index Status At Risk With $8 Billion On The Line According to Crazzyblockk, Bitcoin’s latest investors, who have held between a day and a week, are facing significant unrealized losses. Meanwhile, recent funders with a slightly broader maturity bracket (1-day to 1-month) are not exempt from the current market heat. Additionally, short-term holders who have been involved for up to six months are also experiencing significant drawdowns, as the Bitcoin price stands far beneath their cost basis. In the Quicktake post, Crazzyblockk highlighted that when investor groups face these high amounts of unrealized losses, any price recovery stands as a source of exit liquidity. This is because crypto investors tend to exit the market under minimal losses, or at breakeven. As a result, the classic ‘Support Becoming Resistance’ phenomenon would continue to play out, as these investors keep exiting just beneath or at their cost basis. However, the verdict is not totally grim for the Bitcoin price, as the analyst explained. While the BTC market evidently leans towards a bearish structure, short-term holder behavior will play an important role in determining its direction in the coming days. Crazyyblockk explained, based on historical data, that if the short-term investors avoid capitulating at roughly 20 – 30% unrealized losses, the flagship cryptocurrency could avoid the deep reset associated with a full-blown bear market. On the flip side, a series of capitulation events among this investor cohort could cause a deep extension of Bitcoin’s crash, as these exits add more momentum to the already existing bearish pressure. And until this investor group is fully wiped out of the market, the price of Bitcoin could continue the current descent. Bitcoin Price At A Glance As of this writing, Bitcoin is valued at around $84,530, reflecting a 4% decline in the past 24 hours. According to data from CoinGecko, the premier cryptocurrency is down by more than 11% in the past week. Related Reading: Bitcoin Shows A Clear Momentum Reset — Is A Trend Reversal Coming? Featured image from iStock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|btc|btcusd|crypto",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54752230,
    "published": 1763823617000,
    "title": "Pundit Reveals Why XRP Price At $1,000 Is Not A Dream – ‘It’s Math’",
    "body": "A crypto pundit has ignited discussion about the long-term outlook of the XRP price after arguing that a surge to a $1,000 target is not a dream but a realistic goal supported by market math. The analyst believes that XRP’s future depends on measurable utility rather than market hype, positioning the cryptocurrency as an asset built for deep financial integration, which could fuel a prolonged upward rally. Why A $1,000 XRP Price Is Not A Dream Pseudonymous crypto analyst 24HRSCRYPTO predicted on X this Friday that XRP could climb from its current price of above $1.9 to $1,000. He described the path to this ambitious target as a matter of scaling rather than a dream. He also framed it as a math-based outcome, essentially driven by XRP’s foundational role as a global payments currency. Related Reading: Analyst Claims XRP Price Will Surge To $220 Due To ETFs, But Is This Possible? The analyst noted that XRP’s upside potential is more closely tied to real financial infrastructure than to short-lived speculation-driven appreciation. He emphasized that investors often overlook the role of utility, global settlement demands, and deep liquidity, which he believes are the backbone of XRP’s trajectory. These factors set XRP apart from other cryptocurrencies that mainly depend on traders buying at consistently rising prices. 24HRSCRYPTO uses a simple comparison to illustrate the difference that drives cryptocurrency prices. In his view, the Bitcoin price reaches new all-time highs primarily through speculation, while XRP grows through real financial activity supported by its innovative technology. According to the analyst, this disparity is why he believes patience and consistency matter more than hype cycles. The analyst also insists that XRP’s design positions it for long-term use in financial infrastructure where trillions of dollars flow, creating steady demand. He explained that even a modest investment of $5,000 held with discipline until 2030 can grow when supported by real value. This bullish scenario puts a $100 target for XRP within reach as global settlement usage increases. The same logic also supports the analyst’s bold $1,000 price projection. XRP Technical Analysis Signals Growing Strength The XRP price has been dragged down amid the broader market slump, recently crashing to new lows below $2. Despite the altcoin’s weak price action, analysts still hold out hope for a potential market shift to the upside. Related Reading: Analyst Claims XRP Will Flip Bitcoin As These Developments Play Out In a recent technical analysis, crypto market expert Rose Premium Signals notes that XRP has tapped the same demand zone for the third time, creating a strong triple bottom on the weekly timeframe. The analyst’s chart shows that each time the price returns to the $1.8 to $1.9 demand zone, it triggers strong buying. This repeated pattern confirms the formation of a triple bottom, which she considers a classic high-timeframe reversal signal. The chart also reveals that XRP’s recent downtrend has been controlled and met by a well-defended support level. Rose Premium Signals emphasized that each bounce from this support area has triggered progressively stronger reactions. If momentum is confirmed, she predicts that XRP could surge above $3 in the mid-term. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|24HRSCRYPTO|altcoin|Global Settlement|Ripple|Rose Premium Signals|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54752948,
    "published": 1763825523000,
    "title": "UK Crime Network, Worth Billions, Used Crypto to Funnel Drug Cash to Russia, NCA Says",
    "body": "A billion-pound laundering network spread across the UK used cryptocurrency to move criminal proceeds and help Russian interests evade sanctions, according to the NCA.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|crypto crime|Russia|UK|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54752891,
    "published": 1763825326000,
    "title": "Aerodrome Finance Hit by 'Front-End' Attack, Users Urged to Avoid Main Domain",
    "body": "The attack did not compromise the underlying smart contracts, but users are advised to avoid the compromised domains and instead use decentralized ENS domains.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Web3|Decentralized exchange|Attack|Exploit|Top Stories|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 139,
        "NAME": "ENS",
        "CATEGORY": "ENS"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 54753621,
    "published": 1763827146000,
    "title": "Europe Will Get Risky 3x Leveraged Bitcoin, Ethereum ETFs as Crypto Markets Melt Down",
    "body": "Investors in Europe can soon take a gamble on 3x leveraged Bitcoin and Ethereum ETFs thanks to LeverageShares.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54753437,
    "published": 1763826700000,
    "title": "Coinbase 'Negative Premium' at Widest Level since Q1, Signalling Weak U.S. Demand",
    "body": "Bitcoin is on track for its worst weekly performance since March, while U.S. demand indicators weaken as the Coinbase premium declines and spot ETFs reach a record volume.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Coinbase Premium|Bitcoin News|Bitcoin ETF|market analysis|Top Stories|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54753772,
    "published": 1763827678000,
    "title": "'Liquidity Crisis': $12B in DeFi Liquidity Sits Idle as 95% of Capital Goes Unused",
    "body": "This inefficiency disproportionately affects retail liquidity providers, with 50% losing money due to impermanent loss, and net deficits exceeding $60 million, a new report finds.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Web3|1inch|Decentralized Finance|Liquidity|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54754258,
    "published": 1763829023000,
    "title": "Why Zcash Could Be Vulnerable To A 50% Breakdown",
    "body": "The cryptocurrency market continues to bleed, with the total market cap now hovering around $2.89 trillion. Zcash (ZEC), one of the privacy tokens daring to defy the fearful market sentiment, has experienced a steady, choppy price action as market forces struggle to establish control. Interestingly, a prominent market analyst with the X username PlanD has discovered significant bearish potential on the horizon. Related Reading: Why is Zcash Surging? Analysts Break Down the ZEC Rally and What Comes Next Zcash To Fall To $281 – Is The Party Over? Despite its performance amid the general crypto market correction, Zcash struggles to break past a formidable barrier in the $750 price zone. In the last week, the privacy coin experienced this rejection in the two instances it climbed above the $700 price mark. According to PlanD, ZEC’s multiple rejections are also threatening the viability of an ascending channel that began in October. Notably, Zcash has broken below the lower boundary of this channel at $672, in successive moments, signaling increasing bearish pressure and weakening upward structure. If the market bears assume a dominant hand of the privacy coin, PlanD is projecting a price crash to around $281, indicating a potential 50% price loss from the present market prices. PlanD’s prediction is similar to that by fellow analyst Ali Martinez, who has since tipped ZEC could correct to around $325, following its struggles at the $750 price zone. However, while technical indicators point to an impending price collapse, strong fundamental developments provide bullishness for a continuous price uptrend. These include institutional endorsements as Cypherpunk Technologies, backed by Tyler and Cameron Winklevoss, which has recently launched a $50 million Zcash treasury strategy. Furthermore, the upcoming Zcash halving event, slated for November 28, adds another layer of bullish undertone as an increase in token scarcity is expected to drive demand pressure and subsequently boost prices. Related Reading: Dogecoin (DOGE) Falls Again as Trader Sentiment Turns Increasingly Bearish ZEC Price Overview At the time of writing, Zcash trades at $490.52, reflecting a drastic 24.11% decline in the past 24 hours as total crypto liquidation crossed $1.9 billion. Meanwhile, daily trading volume is down by 6.1% and valued at $2.24 billion. Nevertheless, ZEC’s monthly performance stands at a staggering 99.41% representing the coin’s defying bullish performance during a time when the total crypto market cap has reduced by 28%. In the last year alone, the privacy coin has surged by 928%, highlighting a remarkable and sustained bullish trajectory. With a market cap of $7.8 billion, ZEC now ranks as the 13th largest cryptocurrency in the world. Featured image from Shutterstock, chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "ZEC|Ali Martinez|Cryptododo7|PlanD|price resistance|ZCash|Zcash bearish prediction|Zcash Price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54754907,
    "published": 1763830800000,
    "title": "Is Strategy Stock the Preferred Hedge Against Crypto Losses? Tom Lee Thinks So",
    "body": "Strategy’s 650,000 BTC holdings make it a ‘pressure valve’ for the broader market, said the Bitmine Immersion chairman.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Strategy|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54756852,
    "published": 1763835977000,
    "title": "Bitcoin ETFs Just Had One of Their Worst Weeks on Record, Bleeding $1.2 Billion",
    "body": "Spot Bitcoin funds are closing in on $4 billion of outflows so far in November, with investors cashing out as the price of BTC dives.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54757081,
    "published": 1763836564000,
    "title": "Hobbyist Miner Beats \"1 in 180 Million Odds\" to Win $265K Bitcoin Block Using Just One Old ASIC",
    "body": "The winning miner controls just 0.0000007% of Bitcoin’s total network hashpower, which recently hit a record 855.7 exahashes per second.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin Mining|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54757923,
    "published": 1763838072000,
    "title": "Crypto Treasuries Are Fading—And Staking ETFs Will 'Eat Their Lunch': SOL Strategies CEO",
    "body": "SOL Strategies Interim CEO Michael Hubbard believes that there's \"there's no sustainable market\" for pure crypto treasuries. Here's why.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54761029,
    "published": 1763843462000,
    "title": "Group Asks Federal Agency to Halt Use of Elon Musk's Grok AI Amid Racism Concerns",
    "body": "Analysis showed Grok citing extremist sites as credible sources, raising another red flag after the AI's earlier \"MechaHitler\" incident.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54761954,
    "published": 1763845222000,
    "title": "XRP ETFs Could See Aggressive Accumulation – Here Are The Numbers",
    "body": "XRP has entered a new phase in its growth as Spot XRP ETFs begin trading across the United States. The excitement surrounding institutional access to XRP has grown quickly in recent weeks, especially as filings and inflow reports hint at rising interest from funds preparing to scale their exposure. A market commentator known as Chad Steingraber presented a projection showing just how intense ETF accumulation could become if issuers adopt an acquisition strategy similar to what was seen in Bitcoin ETFs. The estimates outline an aggressive period of accumulation that could reduce XRP’s available supply far faster than many expect, and here are the numbers. Related Reading: Trump’s WLFI Moves To Contain Wallet Breach While Federal Inquiry Looms A Breakdown Of Steingraber’s Projection Steingraber’s first scenario examines a modest but steady accumulation model where 12 Spot XRP ETF issuers acquire an average of 3million XRP per day. His projection is based on focusing on the average rather than trying to predict which fund accumulates the most, because the combined impact is what ultimately matters for XRP’s market price. Under this setup, daily inflows would reach up to 36 million XRP. Over a standard five-day trading week, that accumulation would climb to 160 million XRP. Over the course of a month, the amount absorbed by ETFs would increase to 720 million XRP. By the end of a full year, this single projection implies that as much as 8.64 billion XRP could be removed from public circulation and locked into ETFs. Of course, these numbers only take into account the possibility of consecutive net inflow days and no net outflow days. Although these figures are hypothetical, the pace aligns with the early patterns seen in Bitcoin ETFs, where strong averages across issuers created a sustained demand for Bitcoin. A More Aggressive Scenario Based On Recent Activity In another post, Steingraber offered a more forceful accumulation model using the activity of Bitwise’s Spot XRP ETF as a benchmark. Data shows that the Bitwise XRP ETF received inflows of about 5.82 million XRP in its first trading day. In this second scenario, the projected daily acquisition rate is doubled to about 6 million XRP per issuer. If 12 funds follow this pattern, the combined accumulation could hit 72 million XRP every day. Extending the same five-day cycle, the weekly total would rise toward 360 million XRP, while monthly totals would reach approximately 1.44 billion XRP. Over a full year, this more aggressive model ends with 17.28 billion XRP absorbed into ETF products. “The entire XRP public supply will be gone UNLESS THE PRICE GOES ASTRONOMICALLY HIGH,” Steingraber said. Related Reading: $2 Billion Gone In Minutes: Bitcoin Slide Shakes Crypto World The projections serve as a wake-up call on how quickly XRP’s supply ecosystem might change once ETF inflows stabilize and larger issuers like Grayscale, Bitwise, Canary, CoinShares, Franklin, 21Shares and WisdomTree get in on the action. However, BlackRock, which oversees the largest Spot Bitcoin and Ethereum ETFs, is yet to make any move on a Spot XRP ETF. The company had confirmed in August that it has no immediate plans to file for one. Featured image from Pexels, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|blockchain|crypto|crypto market|crypto news|cryptocurrency|digital currency|Ripple|xrp",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54764966,
    "published": 1763850613000,
    "title": "Bitcoin Hits Major Inflection Point As Rising Wedge Breaks",
    "body": "Bitcoin is now sitting at one of its most critical junctures of the entire cycle. A rising-wedge breakdown has driven price straight into a key support zone just as BTC prints its first major post-ATH drawdown of over 33%, a level that has historically signaled prolonged weakness and heightened volatility. With technical pressure colliding with a historically significant threshold, the market now faces a decisive moment. Rising Wedge Break Sends Bitcoin Lower Into Key Support Zone Crypto analyst The Boss, in a recent breakdown of Bitcoin’s daily chart, highlighted the formation of a rising wedge pattern. As expected, Bitcoin has broken down from this wedge, sending the price sliding into what is considered a strong support zone. This level has historically acted as a turning point, making its current test a crucial moment for the market. Related Reading: Bitcoin Shows A Clear Momentum Reset — Is A Trend Reversal Coming? According to the analyst, this area could trigger a potential upward reaction, as buyers often step in when the price reaches such well-established support levels. However, the possibility of a rebound is not guaranteed. The structure must show early signs of strength before any meaningful recovery can be considered reliable. Momentum indicators paint a cautious picture as they remain notably weak, showing no clear signal of bullish pressure returning to the market. At the same time, trading volume remains lower than necessary for a confident reversal, suggesting that buyers have yet to step in. Without stronger participation, any bounce may be shallow or short-lived. Due to these factors, the analyst emphasized that Bitcoin’s current level must be closely monitored. While a short-term reaction from support is possible, a failure to hold this zone would open the door to further downside and potentially expose deeper support areas. BTC Hits 33% Drawdown Threshold: A Historically Significant Signal According to a recent update shared by Crypto Patel, Bitcoin has now recorded a 33% drawdown from its all-time high, marking a correction significant enough to grab the market’s full attention. This is more than a routine pullback; it represents a level of decline that has historically signaled deeper shifts in market sentiment. Related Reading: Bitcoin Faces A Negative Correlation Trend And Still Holds Strong — Here’s Why Looking back through previous cycles, every instance where BTC retraced beyond 33% after a peak has been followed by prolonged periods of weakness, increased volatility, and continued downside pressure. These drawdowns often served as transitional phases, where momentum reset before the next major trend could establish itself. The market now sits in a critical phase, with traders and analysts watching closely to see whether Bitcoin repeats its well-known historical behavior or breaks the cycle with a stronger-than-expected recovery. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|Crypto Patel|The Boss",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54764646,
    "published": 1763849752000,
    "title": "Bitcoin OG's selling to 'weak' hands will deepen selloffs: Peter Schiff",
    "body": "A lack of conviction among \"weak\" hands will cause new Bitcoin holders to dump at the first sign of trouble, worsening market drawdowns.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54768155,
    "published": 1763856051000,
    "title": "Chainlink Is ‘Essential Infrastructure’ for Tokenized Finance, Says Grayscale Research",
    "body": "Grayscale's report comes shortly after it filed to convert its Chainlink Trust into an exchange-traded fund (ETF) that would trade on NYSE Arca.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Chainlink|Grayscale|Tokenization|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54768158,
    "published": 1763856038000,
    "title": "Bitcoin Block Channel Reveals $400,000 Price Target – Details",
    "body": "The Bitcoin market continues to witness an intense price correction in line with broader crypto market movement. In the past week, the premier cryptocurrency recorded another 10% price decline, trading as low as $80,800, before experiencing a modest bounce. Bitcoin now stands 32.79% below its all-time high, with distribution taking preference over accumulation for most investors. However, popular analyst Gert Van Lagen has unveiled an on-chain trend that postulates an impending revival of the bull market. Related Reading: Saylor’s Strategy Under Threat: Index Status At Risk With $8 Billion On The Line Bitcoin Historical Post-Halving Movement Indicates Bullish Hope In an X post on November 21, Gert Van Lagen outlines a positive Bitcoin price prediction based on data from the previous post-halving movement. The renowned analyst explains this forecast, using a long-term logarithmic chart of Bitcoin’s price vs Bitcoin block height, which highlights a regression channel the digital asset has followed since 2009. According to Van Lagen, Bitcoin has followed a similar pattern after every halving, which usually begins with pushing above the midline of this long-term regression channel. Thereafter, the premier cryptocurrency accelerates into a blow-off top (orange spikes) at the channel’s upper boundary as seen in 2013, 2017, and 2021. For all its price exploits in the present market cycle, Bitcoin presently trades just below the midline of the regression channel, suggesting there is ample space for price appreciation. However, Van Lagen notes some unusual price behavior in that Bitcoin has experienced rejection thrice at this midline, each time resulting in a bounce off the 0.382 Fibonacci retracement line. Nevertheless, the analyst still expects the premier cryptocurrency to maintain the 15-year historical trend and eventually secure a decisive move above the midline resistance. If this price development occurs, Van Lagen also predicts Bitcoin to rise to around $350,000 – $400,000, a price range target that aligns with the upper boundary of the regression channel. Related Reading: Why The Bitcoin Crash To $85,000 Is Actually Good News: Jeff Park The ‘Genuine’ Bearish Market Despite the heightened fears of a bearish market at the moment, Van Lagen explains that the much-dreaded crypto winter only commences after Bitcoin reaches its upper boundary target, establishing a market top. Based on the presented analysis, the market expert predicts Bitcoin will crash from this market peak to retest the 210,000 block SMA, i.e, the lower trend line of the regression channel. At the time of writing, Bitcoin is valued at $84,300 after a 2.36% price loss in the past day. In the last month, the crypto market leader has experienced a 21.96% price devaluation, suggesting a rather volatile and cautious market condition. Featured image from Pexels, chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|bitcoin block|Bitcoin bullish prediction|Bitcoin Halving|Gert Van Lagen|Regression channel",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54770479,
    "published": 1763860003000,
    "title": "BlackRock’s Bitcoin clients aren’t ‘underwriting’ the case for global payments",
    "body": "Bitcoin being widely used for daily payments in the future is just “out-of-the-money-option value upside,” according to BlackRock’s head of digital assets Robbie Mitchnick.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54773348,
    "published": 1763863213000,
    "title": "Dogecoin Goes Wall Street: Grayscale Confirms Nov. 24 ETF Launch",
    "body": "Grayscale Investments will list spot ETFs for Dogecoin and XRP on the NYSE Arca on November 24, 2025, offering a new way for everyday investors to buy those coins through regular brokerages. Related Reading: Kiyosaki Dumps Bitcoin At $90K After Predicting A $250K Moonshot – Here’s Why According to exchange notices and regulatory filings, the funds will trade under the tickers GDOG for Dogecoin and GXRP for XRP. The listings convert Grayscale’s existing private-placement trusts into publicly traded products. Grayscale Moves To List Dogecoin And XRP Reports have disclosed that both ETFs received approval to be listed, and the paperwork was filed with the US Securities and Exchange Commission. The move brings spot exposure to two smaller, but widely followed, cryptocurrencies into a mainstream vehicle. For many investors, that means access without directly managing wallets or private keys. Grayscale Dogecoin ETF $GDOG approved for listing on NYSE, scheduled to begin trading Monday. Their XRP spot is also launching on Monday. $GLNK coming soon as well, week after I think pic.twitter.com/c6nKUeDrtI — Eric Balchunas (@EricBalchunas) November 21, 2025 Market Activity Up Ahead Of Launch Trading activity in related derivatives climbed in the lead up to the announcement. Dogecoin derivatives volume increased by more than 30% to roughly $7.22 billion, based on exchange data. XRP derivatives surged as well, jumping about 51% to around $12.74 billion. Based on reports, these spikes reflect traders positioning for potential price swings around the ETF debut. Spot ETFs do not promise higher prices, but they do change who can buy the assets. Brokers, retirement plans, and funds that avoid direct crypto custody may now step in. That could affect liquidity in both the tokens and their markets. At the same time, the overall crypto market has seen pressure; reports say the launches come during a roughly six-week downturn. DOGE market cap currently at $21.4 billion. Chart: TradingView Questions Remain Over Demand And Flows Product fees, custody details, and how the trusts convert into ETF shares will shape investor appetite. Past launches of crypto ETFs showed brisk early flows for some products, while others saw muted interest. What matters for prices is not only listings, but inflows and outflows once trading begins. Related Reading: $2 Billion Gone In Minutes: Bitcoin Slide Shakes Crypto World Investors and analysts are likely to watch the first days of trading for clues. High volume and tight spreads would suggest strong demand. Low turnover or wide spreads could signal tepid interest. Based on reports, market participants will also monitor whether the ETFs draw the same sort of speculative trading that has driven derivatives volume in recent days. The listing of both GDOG and GXRP on the same date marks a notable step for mainstream crypto products. According to exchange filings, the funds are structured as spot ETFs that hold the underlying tokens via custodians. While that does not remove price risk, it does make buying these assets simpler for a broad group of investors. Featured image from Gemini, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|altcoins|crypto|Dogecoin|etf|grayscale|memecoin|xrp",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54782895,
    "published": 1763881872000,
    "title": "Bitcoin ATM firm explores $100M sale following CEO’s federal indictment",
    "body": "Crypto Dispensers is weighing a $100 million sale as its CEO faces federal accusations of running a multimillion-dollar money laundering scheme.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54789243,
    "published": 1763892873000,
    "title": "Zcash risks ‘splitting the vote’ against Bitcoin, Bloomberg ETF analyst warns",
    "body": "Bloomberg’s Eric Balchunas says Zcash could dilute political and cultural support for Bitcoin, as critics accuse the privacy coin of manufactured hype.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54790259,
    "published": 1763877615000,
    "title": "XRP Approaches Macro Breakdown Zone, Analyst Warns About One Final Leg Lower",
    "body": "XRP’s price action in November has dragged it below $2, but technical analysis suggests that the breakdown might not be over. A new technical outlook from crypto analyst CasiTrades suggests that the XRP price is entering the final stages of its corrective structure. The analyst believes the current movements are part of a clean Elliott Wave formation that is approaching its final wave to as low as $2.65 before a major bullish reversal takes place. Related Reading: Dogecoin Goes Wall Street: Grayscale Confirms Nov. 24 ETF Launch XRP Breaks Below Fibonacci Levels As Wave Structure Unfolds XRP’s volatility has intensified in recent days as the cryptocurrency continues to unwind into new November lows. Price action across the major exchanges shows a steady decline beneath retracement levels that have pushed XRP into deeper corrective territory. CasiTrades noted that XRP’s drop beneath the 0.5 Fibonacci retracement on Coinbase was the move that confirmed further downside. According to the analyst, she had already warned that a failure of this level would open the door to a wave of selling toward the extended Wave 3 support at roughly $1.84. XRP reached that target with precision, while Binance’s chart tagged its own macro .5 level around $1.88. The current bounce back above $1.9 might be looking like a reversal but is actually a subwave 4 relief move. This means XRP is temporarily recovering from deeply oversold conditions, yet the core market structure still points to one more leg lower before the trend shifts. Based on the Fibonacci map and wave count, the technical outlook is for XRP to retest familiar resistance levels around $2.00 or $2.09 before the final decline begins. 🚨 Get Ready! XRP Likely to test the Macro .618! 🚨 XRP has officially broken below its .5 retracement on Coinbase, and just like I said in my last update, if that level fails, the next target will be the extended Wave 3 support around $1.84. We’ve now reached that perfectly and… pic.twitter.com/tSQdVAlpdY — CasiTrades 🔥 (@CasiTrades) November 21, 2025 $1.65 As The Final Level To Complete Correction The most important area in CasiTrades’ outlook is the macro 0.618 support, located close to $1.65. This level aligns across both Coinbase and Binance and sits at the heart of the analyst’s projection for where Wave 5 of the correction should land. The chart above shows a descending wedge meeting the macro support, along with an RSI trend that has continued building a bullish divergence. These signals suggest that momentum is flattening. However, CasiTrades believes that XRP dipping into the $1.65 region would mark the moment the correction concludes. Related Reading: Kiyosaki Dumps Bitcoin At $90K After Predicting A $250K Moonshot – Here’s Why The analyst also pointed out that Bitcoin’s chart is moving in harmony with XRP’s structure. At the time of writing, Bitcoin has approached its own macro 0.382 retracement but has not fully reached it yet. The expectation is that XRP’s final leg to $1.65 will occur simultaneously with Bitcoin sliding to a clean $80,000 touch. CasiTrades projects Bitcoin entering its Wave 5 advance into new all-time highs shortly after touching its support. If that scenario plays out, both assets would complete their macro supports at the same moment, setting the stage for a synchronized bullish reversal. At the time of writing, XRP is trading at $2.02. Featured image from Gemini, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|crypto|xrp|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54791579,
    "published": 1763892039000,
    "title": "Top Analyst Sounds Alarm: Bitcoin Is Highly Unlikely To Spring Back Anytime Soon",
    "body": "Bitcoin is trading in a fragile state after slipping below $90,000 and now in the mid-$80,000s. This price action has caused some analysts to grapple with the possibility that the next major rally may be further away than many expect. A recent technical outlook from prominent crypto analyst Tony “The Bull” Severino adds weight to this concern. His analysis focuses on the 6-week LMACD momentum indicator, which has just crossed bearish for the first time in years. Related Reading: Dogecoin Goes Wall Street: Grayscale Confirms Nov. 24 ETF Launch Momentum Turns Against Bitcoin On The 6-Week LMACD The technical outlook highlights a strong warning from Severino, who argues that Bitcoin is nowhere close to staging the kind of explosive recovery many are waiting for. Severino’s message revolves around momentum, which he says is now firmly pointed downward. The momentum is cited using the recent crossover on the 6-week LMACD, which is known for its decisive crossovers that confirm long-term trend changes. The 6-week LMACD is a lagging signal, meaning that by the time it flips bearish, Bitcoin is already well into a downturn. The chart confirms this with multiple examples: Bitcoin entered extended red phases lasting 812 days, 861 days, and 686 days following previous bearish crossovers. Because the signal lags price action, Bitcoin typically bottoms long after the crossover occurs. Severino noted that bear-market lows always appear between 250 and 365 days after the bearish flip, not within a few weeks. Therefore, traders expecting a bottom only 40 days after the new signal are ignoring how consistently slow this indicator behaves. The chart also highlights how severe each downturn becomes once the LMACD flips bearish. Previous cycles saw drawdowns of roughly 69% to 75% from the moment the cross happened, even though Bitcoin had already fallen significantly before the indicator flashed. Please pay attention to this post if you want to understand why Bitcoin is highly unlikely to suddenly spring back into a bull run One word: Momentum The 6-week LMACD has some of the cleanest crossovers representing pivotal trend change confirmation points. The signal lags,… pic.twitter.com/mq9uR2Fqec — Tony “The Bull” Severino, CMT (@TonyTheBullCMT) November 22, 2025 A Possible Long Road Before Any Significant Recovery Although the LMACD signal just crossed bearish, the current crossover is still unconfirmed for another 15 days, and the resemblance to past cycles is something to keep in mind. Severino noted that he is not predicting the end of Bitcoin’s long-term prospects, but he is urging traders to stop expecting rapid upside. Past behavior does not guarantee the same outcomes, and there is no certainty that Bitcoin will drop another 70% from here like previous cycles. Related Reading: Kiyosaki Dumps Bitcoin At $90K After Predicting A $250K Moonshot – Here’s Why The 6-week LMACD is a high-timeframe signal, and the shifts it captures reflect deep structural trends rather than short-term fluctuations. This means Bitcoin could still be months away from its true cycle bottom. At the time of writing, Bitcoin is trading at $85,670, down by 11% and 23% in the past seven and 30 days, respectively. Severino’s analysis means that the Bitcoin price could spend a prolonged period hovering around these levels or experience a further decline before any meaningful recovery into a new bull phase begins. Featured image from See The Wild, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|Bear market|bitcoin|btc|btcusd|crypto",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54792438,
    "published": 1763898010000,
    "title": "Grayscale calls Chainlink the ‘crictical connective tissue’ of tokenized finance",
    "body": "Grayscale says Chainlink will anchor the next phase of blockchain adoption, positioning LINK as the core infrastructure powering tokenization.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54793983,
    "published": 1763901000000,
    "title": "Cardano Temporarily Splits Into Two Chains After Attacker Uses AI-Generated Script to Exploit a Known Bug",
    "body": "The divergence emerged when newer nodes accepted a malformed transaction that older nodes rejected.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Cardano|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  }
]