[
  {
    "id": 58446000,
    "published": 1771985942000,
    "title": "Bitcoin Jumps Above $66,000 Ahead of Trump’s Address to Congress",
    "body": "After a plunge earlier in the week, crypto traders were again pushing prices higher during early Asia trading on Wednesday.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58448936,
    "published": 1771992041000,
    "title": "Bitcoin Nears Death Cross That Preceded Final Bear Market Legs",
    "body": "An analyst has pointed out how Bitcoin could be approaching a death cross between the 50-day and 200-day SMAs on the 3-day chart. Bitcoin Is Potentially Nearing A Death Cross On The 3-Day Timeframe In a new post on X, analyst Ali Martinez has talked about a death cross on Bitcoin’s 3-day price chart. A “death cross” popularly refers to a bearish signal produced by a crossover between two simple moving averages (SMAs) of an asset. Typically, a death cross involves the longer SMA moving above the shorter one. In the context of the current topic, the SMAs of relevance are the 50-day and 200-day versions. Related Reading: Bitcoin Capitulation Persists As Short-Term Holders Realize $0.48B Daily Losses Below is the chart shared by Martinez that shows the pattern displayed by these two SMAs for the 3-day Bitcoin price. As is visible in the graph, the 50-day SMA of the 3-day Bitcoin price saw a cross under the 200-day SMA in each of the last three cycles. All of these crossovers preceded bearish price action. More specifically, the 2014 crossover led to a drawdown of 52.19% for the asset, the 2018 one to 50.56%, and the 2022 one to 45.91%. Interestingly, these price declines all led to the bottoms of their respective bear markets. “Since 2014, the death cross between the 50 and 200 simple moving averages on the 3-day chart has consistently preceded the final leg down of a Bitcoin $BTC bear market,” noted the analyst. Jumping to the present, BTC has faced a bearish shift in recent months with a notable drawdown in its price. This has resulted in the 50-day SMA witnessing a decline toward the 200-day SMA. As a zoomed-in chart shared by Martinez in another X post shows, there is now not much distance left between the 50-day and 200-day SMAs of the 3-day Bitcoin price. If the two lines continue to follow the current trajectories, the analyst has estimated that a death cross could occur on February 27th. Given the past trend, such a death cross could take Bitcoin into its final leg for the bear market. It only remains to be seen, however, whether the current cycle will actually follow a similar pattern or if it will show divergence. Related Reading: Another $438M In Crypto Longs Gone As Bitcoin, Altcoins Pull Back In some other news, the Realized Profit/Loss Ratio has slipped into the loss region recently, as on-chain analytics firm Glassnode has highlighted in an X post. In the past, a shift toward loss realization on the Bitcoin network has generally lasted for over six months before a return of liquidity has occurred. BTC Price Bitcoin has erased some of its recent recovery over the past couple of days as its price is now trading around $63,300. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin bear market|Bitcoin Death Cross|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58450936,
    "published": 1771995614000,
    "title": "The $33 Billion Drain: Bitcoin Realized Cap Craters as Capital Abandons the Network for a Second Month",
    "body": "Bitcoin continues to struggle to reclaim the $65,000 level as persistent selling pressure and weakening sentiment keep the market in a fragile state. Price action has remained subdued in recent weeks, with volatility elevated and risk appetite constrained by tightening liquidity conditions and macro uncertainty. The inability to secure sustained acceptance above this psychological threshold has reinforced caution among traders, leaving Bitcoin in what increasingly resembles a defensive phase rather than an early recovery environment. Related Reading: The Saylor Discount: Why Bitcoin Trading Below Strategy’s Realized Price is a Gift for Late-Cycle Allocators According to top analyst Axel Adler, recent on-chain data support this interpretation. Realized capitalization — which measures the aggregate value of Bitcoin based on the last price each coin moved — has declined for the second consecutive month. At the same time, the 3–6 month holder cohort has expanded significantly as coins acquired near cycle highs mature into that category. This dynamic typically reflects post-peak positioning rather than fresh accumulation. The 30-day Realized Cap Net Position Change currently sits around -2.26%, indicating sustained capital outflows from the network. Realized Cap peaked near $1.127 trillion in late November 2025 and has since contracted to roughly $1.094 trillion, representing about $33 billion in compression. Until this metric returns decisively to positive territory, evidence of renewed accumulation demand remains limited. HODL Waves Highlight Defensive Market Structure Adler notes that the latest HODL Waves data reinforces the view that Bitcoin remains in a defensive phase rather than active accumulation. The chart shows a sharp expansion in the 3–6 month coin-age cohort, which has risen to approximately 25.9% of the circulating supply. This reflects a growing share of coins last moved between August and November 2025 — a period closely aligned with purchases near the market peak. HODL Waves track the distribution of Bitcoin supply based on how long coins have remained dormant. Expansion of older cohorts generally indicates reduced transactional activity. However, in this case, the data suggests not confident accumulation but rather a “costly hold” environment, where many investors are sitting on underwater positions. The 3–6 month cohort has surged from roughly 19% at the start of February, while the 6–12 month group has also grown to about 20.2%. Meanwhile, short-term coins under one month account for only about 9.3% combined, signaling limited fresh demand entering the market. Combined with declining realized capitalization, the data points toward an aging supply without corresponding capital inflows. Until newer buying activity emerges and the 3–6 month cohort migrates into longer-term holding bands without selling pressure, Bitcoin’s broader market structure is likely to remain defensive rather than decisively bullish. Related Reading: The $45 Million Crypto Hammer: Whale Inflow To Binance Threatens To Shatter XRP’s Recovery Bitcoin Momentum Weakens As Price Tests Key Support Zone Bitcoin’s 3-day chart reflects clear structural deterioration as price accelerates lower toward the $63,000 region. After failing to reclaim the $90,000–$95,000 supply zone earlier in the year, BTC formed a distribution range before breaking decisively below its 50-period and 100-period moving averages. That breakdown triggered a sharp leg down, confirming a shift from consolidation to trend continuation on this timeframe. Currently, price trades well beneath the 50 SMA (~$92,000) and the 100 SMA (~$101,500), both of which have rolled over and now act as overhead resistance. The 200 SMA near the low-$90,000 region also remains far above the current price, reinforcing the broader bearish bias. The alignment of these moving averages — with shorter-term averages below longer-term ones — confirms negative momentum and sustained downside pressure. Related Reading: XRP’s Brutal Supply Compression Signals A Repeat Of The 2024 Expansion Volume expanded during the recent selloff, indicating active distribution rather than passive drift. The sharp rejection from the mid-$90,000 area, followed by impulsive downside candles, suggests sellers remain in control. From a structural perspective, the $60,000–$62,000 zone becomes the next critical support region. A sustained break below it could open the path toward deeper retracement levels. To stabilize, Bitcoin would need to reclaim at least the $75,000–$80,000 area and rebuild higher highs — a scenario not yet supported by current momentum. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|bitcoin bear market|Bitcoin news|Bitcoin Realized Cap|Bitcoin realized cap decline|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58450787,
    "published": 1771995048000,
    "title": "Bitcoin captures $65K after US stocks rebound from AI sell-off: Will it hold?",
    "body": "Bitcoin rallied above $66,000 following a positive close from US stock markets, putting Monday’s AI and tech-stock driven sell-off to rest. Will $60,000 remain the BTC bottom?",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Market Analysis",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58451250,
    "published": 1771996099000,
    "title": "Solana (SOL) Recovery Shows Strength After Breaking Initial Resistance Level",
    "body": "Solana failed to settle above $85 and trimmed some gains. SOL price is now recovering losses from $76 and showing a few positive signs. SOL price started a decent recovery wave above $78 and $80 against the US Dollar. The price is now trading above $80 and the 100-hourly simple moving average. There was a break above a key bearish trend line with resistance at $81 on the hourly chart of the SOL/USD pair (data source from Kraken). The price could continue to move up if it clears $82 and $84. Solana Price Attempts Recovery Solana price remained stable and started a decent recovery wave above $78, like Bitcoin and Ethereum . SOL was able to climb above the $80 level. There was a move above the 50% Fib retracement level of the downward move from the $86.68 swing high to the $75.64 low. Besides, there was a break above a key bearish trend line with resistance at $81 on the hourly chart of the SOL/USD pair. However, the bears are active near $82.50 and the 61.8% Fib retracement level of the downward move from the $86.68 swing high to the $75.64 low. Solana is now trading above $80 and the 100-hourly simple moving average. On the upside, immediate resistance is near the $82 level. The next major resistance is near the $84 level. The main resistance could be $85. A successful close above the $85 resistance zone could set the pace for another steady increase. The next key resistance is $92. Any more gains might send the price toward the $95 level. Another Decline In SOL? If SOL fails to rise above the $82 resistance, it could continue to move down. Initial support on the downside is near the $80 zone. The first major support is near the $79 level. A break below the $79 level might send the price toward the $77 support zone. If there is a close below the $77 support, the price could decline toward the $74 zone in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is gaining pace in the bullish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is above the 50 level. Major Support Levels – $80 and $77. Major Resistance Levels – $82 and $85.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Technical analysis|Sol|Solana|solbtc|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58451578,
    "published": 1771996411000,
    "title": "South Korean man faces jail over alleged poisoning over crypto trading losses",
    "body": "South Korean prosecutors reportedly accused a man of poisoning a business partner with pesticide in a dispute over losses due to crypto trading.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58451244,
    "published": 1771996031000,
    "title": "Bitcoin bounces above $65,000 as dollar weakens and bullish hopes build",
    "body": "A broad uptick across tokens arrived alongside a softer greenback and a rally in Asian equities, though analysts remain split on whether the Feb. 5 lows will hold.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58453113,
    "published": 1771999242000,
    "title": "Most Crypto Assets Need To Go To Zero, Research Firm Says",
    "body": "Castle Labs is arguing that crypto’s long tail is structurally overbuilt and that most tokens will ultimately be priced toward zero unless they can prove real business traction and tighter token alignment. The thesis, published in a long X post, frames the current market as a selection phase rather than a broad-based recovery story. The core point is not that crypto itself is failing, but that token supply has far outpaced sustainable demand. Castle Labs says the result is a market where a handful of majors dominate while thousands of smaller assets compete for shrinking liquidity. Too Many Crypto Tokens Castle Labs points to concentration data to make the case. According to the post, the top five crypto assets account for 84.4% of total market capitalization, leaving the rest of the market with 15.6%, or roughly $330 billion, spread across thousands of tokens. Related Reading: House Democrats Urge Treasury Probe Into Trump Family’s Crypto Venture It contrasts that with US equities, where the MAG7 represent 31% of the market and the S&P 500 represents 84.7%. In Castle Labs’ framing, crypto has reached roughly the same concentration level as the top 500 US companies, but with only five assets doing the heavy lifting. “Over the years, so many coins have been created that 99% of them need to go to zero for the industry’s good,” the firm wrote. It adds that the mismatch has become harder to ignore for investors who bought into crypto’s institutional adoption narrative but remain deep underwater in alt-heavy portfolios. Castle Labs outlines three broad paths for rebalancing: majors lose share to smaller tokens, external liquidity lifts the broader market, or weaker tokens lose value while majors absorb more of the capital. It argues the third outcome is the most likely, even if the first would be healthier in theory. A major part of the argument is simple market mechanics. Castle Labs says token unlocks will continue to add supply into a market where demand is already selective, citing $8.51 billion in unlock value this year and $17.12 billion over the next five years. That overhang, it argues, is colliding with poor business performance across much of the sector. Out of more than 5,600 protocols listed on DeFiLlama, Castle Labs says only 76 generated more than $1 million in revenue in the last 30 days, and only 237 cleared $100,000. Revenue is concentrated too. The post says the top 10 protocols in 2025 accounted for 80% of total crypto revenue, while the top three accounted for 64%, with Tether alone representing 44%. It also notes that only three of those top 10 revenue generators had launched tokens so far: Hyperliquid, Pumpfun, and Jupiter and says only HYPE materially outperformed. Related Reading: Goldman Sachs CEO Says US Must Codify How Crypto ‘Will Operate’ That backdrop helps explain Castle Labs’ skepticism toward new listings. It says there were about 118 major token launches in 2025, and 84.7% traded below their TGE valuation, which it describes as evidence of inflated launch pricing and weak post-launch structure. The Alignment Problem Castle Labs also argues the market is punishing tokens that are not economically aligned with the products they represent. It cites Circle’s acquisition of Interop Labs, where Axelar’s token AXL was not part of the deal, as an example of product value and token value diverging. “Tokens are not a legal representation of the business and don’t offer any actual rights over the company’s profits, unlike equity,” the firm wrote. “Investors, when they receive tokens, have these rights through the equity they hold. So they are in a better position, but token holders? They are at the project’s mercy when it comes to aligning their product with their token.” In that framework, buybacks are treated as one of the clearest signs of alignment. Castle Labs highlights Hyperliquid and Aave, and says Uniswap is only fully aligned with tokenholders after more than five years of its token’s existence. The firm’s conclusion is blunt but specific: capital should rotate toward protocols with real revenue, tokenholder alignment, and credible mechanisms to offset dilution. Whether that thesis holds in the next cycle may depend less on narrative and more on whether more projects adopt the kind of KPI- and revenue-led launch models Castle Labs says are now starting to emerge. At press time, the total crypto market cap stood at $2.16 trillion. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|altcoin news|altcoins|crypto|Crypto Asset News|crypto news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58454171,
    "published": 1772000929000,
    "title": "Crypto firm with U.S. bank charter holds bitcoin holder Strategy's preferred stock",
    "body": "Anchorage Digital, the first federally chartered U.S. crypto bank, has added perpetual preferred stock in bitcoin treasury firm Strategy to its balance sheet.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Anchorage Digital|Strategy|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58446594,
    "published": 1771987807000,
    "title": "Crypto lobby Blockchain Association pitches tax plan to Congress",
    "body": "The Blockchain Association urged Congress to exempt low-dollar crypto transactions and tax mining and staking rewards upon sale.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58456803,
    "published": 1772005433000,
    "title": "Leading stablecoin Tether shrinks again as market cap eyes second straight monthly drop",
    "body": "Growth of tether and other top stablecoins has stalled, posing risk to the broader crypto market.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Tether|Stablecoins|USDC|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58456823,
    "published": 1772005265000,
    "title": "Hong Kong to link new digital bond platform with regional tokenization hubs",
    "body": "Hong Kong will build a digital asset platform for digital bond issuance and settlement, while moving ahead with stablecoin licensing and CARF.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58457415,
    "published": 1772006427000,
    "title": "Crypto Funds Bleed $4 Billion As Investors Step Back – Here’s Why",
    "body": "Crypto investment funds have now recorded a fifth straight week of net outflows, wiping roughly $4 billion from investor coffers over that span. Related Reading: Bullish Signal? Coinbase Bitcoin Premium Turns Positive After Months In Red That steady removal of capital has been paired with a sharp fall in trading activity, signaling that many holders are standing on the sidelines rather than buying dips. Trading Volume Hits Multi-Month Low According to a CoinShares report published Monday, crypto funds saw $288 million in net outflows last week, bringing the five-week total to roughly $4 billion. Weekly trading volumes also fell to about $17 billion, the lowest level since mid-2025, highlighting a slowdown in market activity even as prices have recently stabilized. Fewer transactions were recorded across major investment products, reflecting a quieter stretch for the market compared with earlier periods of heavier trading. Regional Flows Paint A Split Picture Reports note the US led withdrawals, while parts of Europe and Canada added fresh money. The US recorded $347 million of outflows, while Europe and Canada together showed net inflows of close to $60 million. Digital asset investment products recorded US$288M in outflows last week.@Bitcoin remains the key proponent of this negative sentiment, seeing US$215M in outflows. @ethereum saw the second largest outflows totalling US$36.5M. Minor inflows were seen in XRP @Ripple (US$3.5M),… pic.twitter.com/HFWIxVAZgO — CoinShares (@CoinSharesCo) February 23, 2026 Countries such as Switzerland, Canada, and Germany were among those adding funds. That split shows that not all investors view the market the same way right now. Some see value at lower prices; others are trimming exposure until clearer signs appear. Bitcoin Remains The Main Focus Of Selling Bitcoin accounted for the largest single-asset outflows, with about $215 million removed last week. At the same time, instruments that profit from falling prices received renewed interest, with short-Bitcoin products taking in around $5.5 million. A fair amount of recent liquidations was tied to Bitcoin moves, driven by traders who had large positions and saw prices move against them. Some positions were forced closed. That pushed volatility up in the short term. Ethereum and a handful of other coins also saw money leave, though a few assets attracted small inflows. XRP, Solana, and Chainlink each gained minor sums relative to the overall outflow. These were selective bets rather than broad rotations back into risk assets. Investment managers who moved into specific tokens appeared to be making tactical, not broad, commitments. Sidelined Capital Is Waiting Reports say much of the market’s strength depends on outside cash returning. Right now, many potential buyers are waiting for clearer signals from the macro side — interest rates, big economic reports, and policy hints from regulators. Without sustained buying, price bounces are more likely to be brief technical recoveries than full trend changes. Related Reading: Bitcoin Buying Spree Nears Century Mark, Saylor Hints A Pause More Than A Collapse This is not a market breakdown. It is a pause, according to analysts. Participation has dropped and that creates a fragile environment. If macro sentiment shifts and more buyers step in, flows could reverse quickly. Until then, expect choppy moves, low volume, and a market that reacts strongly to each new piece of news. Featured image from Vecteezy, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|crypto|digital currency|ethereum",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58458677,
    "published": 1772008361000,
    "title": "US seizes $61M in USDT linked to ‘pig butchering’ crypto fraud scheme",
    "body": "The $61 million USDT seizure in North Carolina shows how US authorities can trace and freeze stablecoin flows tied to pig butchering scams, as AI‑driven impersonation schemes surge.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58459936,
    "published": 1772010540000,
    "title": "Anchorage buys STRC as Wall Street shorts mount against Saylor’s Bitcoin proxy",
    "body": "Strategy has become the most-shorted large-cap US stock as hedge funds ramp up bearish bets, according to data from Goldman Sachs.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58459563,
    "published": 1772010028000,
    "title": "Expert Forecasts $5 Trillions Pouring Into Crypto Post CLARITY Act Passage",
    "body": "Although final passage of the CLARITY Act—commonly referred to as the crypto market structure bill —has been delayed in Congress, some experts believe its eventual approval could unleash an unprecedented wave of capital into the crypto sector. Trillions On Hold In a recent post on X (previously Twitter), the expert known as 360Trader argued that trillions of dollars in institutional money are waiting on regulatory certainty before entering digital assets. Related Reading: History Repeating? XRP Flashes Signal Last Seen Before Explosive 60,000% Rally According to his assessment, the CLARITY Act could act as the trigger that opens Wall Street’s doors to crypto in a meaningful way, potentially driving more than $5 trillion into the space over time. 360Trader pointed to comments from White House Digital Asset adviser Patrick Witt, who stated that trillions in institutional capital are effectively sidelined as firms wait for legal clarity. Large asset managers, including BlackRock, are often cited as examples of institutions constrained by the current patchwork regulatory environment. If the CLARITY Act becomes law, the expert believes the crypto market capitalization could surge beyond $4 trillion, drawing comparisons to the rally that followed the approval of spot Bitcoin exchange-traded funds (ETFs) back in 2024. Catalyst For Next Crypto Bull Run? Stablecoins are another key element of the discussion. Under the proposed framework, banks would receive clearer authorization to issue stablecoins. The stablecoin market has already expanded significantly, reaching a reported $300 billion in supply in 2025 and processing approximately $33 trillion in transaction volume—figures that exceed the total throughput of Visa’s network. The possibility of major banks such as JPMorgan launching fully integrated stablecoins backed by substantial payment activity has been described as a potential turning point for the sector. The yield component is also drawing attention. Some stablecoin products currently offer returns in the range of 3% to 5%, compared with traditional savings accounts that average roughly 0.07%. Related Reading: World Liberty Financial Cites ‘Coordinated Attack’ — But Are There Deeper Issues? 360Trader suggested that this disparity could prompt a significant reallocation of capital—potentially as much as $6 trillion—from conventional bank deposits into crypto-linked instruments. Pension funds, university endowments and retail investors could all gain broader exposure to higher-yielding crypto products. In parallel, traditional financial institutions may begin integrating decentralized finance (DeFi) infrastructure to enable faster settlement and more efficient transaction rails. Yet, the traditional banking sector has consistently pushed back against stablecoin yield structures, citing concerns about the impact on their deposit bases. This has resulted in the current delay and the ongoing White House meetings. In the expert’s words: …I’m bullish on CLARITY unlocking trillions in dormant capital. This could be the catalyst that separates the next bull run from everything we’ve seen before. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Crypto|CLARITY Act|CLARITY Act news|crypto|crypto market|Crypto Market Structure Bill|crypto news|Stablecoin news|Stablecoin yields|Stablecoins",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58465263,
    "published": 1772019481000,
    "title": "U.S. Senator opens probe on Binance over alleged $1.7 billion flow to Iranian entities",
    "body": "Richard Blumenthal sent Binance co-chief Richard Teng a letter asking him for records about the exchange’s dealings with Iran-linked entities and the alleged dismissal of its investigators.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Binance|The new york times|U.S. Senate|Richard teng|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58465000,
    "published": 1772019041000,
    "title": "Crypto rebounds from oversold levels, altcoin season indicator revisits January high",
    "body": "Bitcoin rose as much as 3.7% overnight before paring gains, while altcoins outperformed and the altcoin season indicator hit its highest level since January.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|Derivatives|Altcoins|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58467475,
    "published": 1772022886000,
    "title": "FG Nexus sells another $14M in Ether as losses mount on treasury bet",
    "body": "FG Nexus has sold another $14 million in Ether from its corporate treasury, adding to losses of over $80 million as Ethereum-focused balance sheets come under mounting market pressure.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 58469489,
    "published": 1772026223000,
    "title": "Pundit Gives Reasons Why XRP Price Will Hit $10 In 2026",
    "body": "Pseudonymous market expert XRP Queen has boldly forecasted that a $10 XRP price is possible in 2026. To support her bullish outlook, the XRP advocate has highlighted several key reasons, focusing more on utility and institutional rails than price patterns and hype-driven growth. Reasons The XRP Price Could Reach $10 In 2026 In an X post this week, XRP Queen boldly forecasted that XRP could rise from its current price below $1.5 to $10 in 2026. She fired back at crypto members who had expressed skepticism about the ambitious target, asserting that those who had laughed at the possibility of a $10 surge would eventually delete their tweets once XRP reaches that milestone. Although her bullish predictions of XRP are not supported by technical chart patterns or historical data analysis, XRP Queen outlined several other key reasons she believed the cryptocurrency could reach $10 in 2026. Her argument primarily centers on XRP’s fundamental utility as a payment solution and institutional settlement rail. Related Reading: Bitcoin Final Sell-Off Coming? Analyst Says It’s Time To ‘Buckle Up’ Based on these factors, it’s likely the analyst expects XRP’s price to advance significantly, driven by the scale of adoption, rising demand, and broader recognition the cryptocurrency could achieve as it continues to be used for everyday transactions. The first point she highlighted was that XRP is already being used in “real payment corridors.” Currently, the cryptocurrency has expanded across multiple global regions and markets, where it facilitates cross-border transactions. One notable example of this traction is in South Korea, where XRP has emerged as the most actively traded cryptocurrency, underscoring its growing adoption and market demand. The second reason XRP Queen believes the cryptocurrency could hit $10 in 2026 is the expanding role of the XRP Ledger (XRPL) in tokenizing real-world assets (RWA) and supporting stablecoin issuance. Recent reports indicate that even the U.S. Treasury debt has been tokenized on the ledger, reflecting broader institutional interest in on-chain debt issuance. Furthermore, Circle’s USDC, one of the largest regulated stablecoins, has launched natively on XRPL, enabling issuance and use directly on the network. This development has direct implications for XRP’s value. Each time a tokenized asset or stablecoin is issued, transferred, or traded on XRPL, XRP is used to pay transaction fees, effectively serving as a bridge currency for liquidity between different assets. Consequently, as more institutions adopt XRPL, demand for XRP could rise, potentially fueling a price appreciation. Regulatory Clarity And Institutional Intent Another major point XRP Queen emphasized to support her ambitious $10 price forecast is the regulatory clarity XRP and Ripple have achieved recently. After nearly seven years of litigation with the US Securities and Exchange Commission (SEC), the case was settled in 2025 with a $125 million fine on Ripple. This legal resolution puts XRP back into the spotlight, transforming sentiment and fueling demand for the cryptocurrency. Related Reading: AI Explains What’s Driving The Ethereum Price Volatility, Can It Rise Above $3,000 Again? XRP Queen has also stated that “institutions do not build rails for fun,” implying that XRP’s vision is not merely theoretical or speculative, but a long-term effort to establish a global financial infrastructure. The crypto expert also hammered on the market capitalization argument, noting that even at $10, XRP’s valuation would still be below past cycle peaks for other major cryptocurrencies. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Ripple|ripple news|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58470600,
    "published": 1772028000000,
    "title": "The chief of the SEC is headlining an event sponsored by a crypto firm at war with it",
    "body": "SEC Chairman Paul Atkins is a marquee speaker at a policy summit backed by Unicoin, whose CEO says the agency chief is being duped by his staff.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "News Analysis|Unicoin|U.S. Securities and Exchange Commission|Digital Chamber|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58470658,
    "published": 1772027995000,
    "title": "Revolut among four firms chosen to test stablecoins in UK sandbox",
    "body": "The UK Financial Conduct Authority named Monee, ReStabilise, Revolut and VVTX to test stablecoin issuance and payments in its regulatory sandbox beginning in Q1 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58472116,
    "published": 1772030505000,
    "title": "Endowments eye crypto allocations amid tougher return outlook for traditional investments",
    "body": "Lower expected gains from traditional assets have prompted some funds to test bitcoin and ether exposure to diversify portfolios.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Endowment|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58466306,
    "published": 1772020253000,
    "title": "Circle’s Shares Surge After Profit, Revenue Top Estimates",
    "body": "Shares of Circle Internet Group Inc. jumped more than 20% after the company said strong demand for its stablecoin bolstered profit and revenue during the fourth-quarter downturn in digital assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "NYS:CRCL",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58473163,
    "published": 1772032217000,
    "title": "Circle Stock Jumps Double Digits as It Reports 72% Rise in USDC Circulation",
    "body": "Circle’s USDC grew 72% in Q4 as transaction volume soared and CRCL stock popped on bullish AI and payments commentary.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58472948,
    "published": 1772031840000,
    "title": "XRP jumps 6% as exchange data points to institutional accumulation",
    "body": "Break above $1.37 draws strong spot demand, with ETF inflows and retail buying suggesting positioning shift.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58474432,
    "published": 1772034079000,
    "title": "Bitcoin daily gains near 5% as analysis eyes bullish 'rotation' from gold",
    "body": "Bitcoin began an assault below the 200-week exponential moving average in fresh signs of upward BTC price momentum at the start of the US session.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58474143,
    "published": 1772033785000,
    "title": "Democrat Senator Launches $1.7B Iran Sanctions Probe Into Binance",
    "body": "Senator Richard Blumenthal has launched an inquiry into alleged Iran-linked crypto transfers as Binance pushes back against the claims.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58475310,
    "published": 1772035801000,
    "title": "MrBeast Employee Fined, Suspended by Kalshi for Insider Trading on YouTube Videos",
    "body": "Kalshi revealed its first enforcement actions Wednesday, against a political candidate and an employee of YouTube star MrBeast.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 58475403,
    "published": 1772035704000,
    "title": "Solana leads crypto recovery with 10% gain: Is $100 SOL price next?",
    "body": "Solana price eyes a potential rise toward the $110-$115 range, according to a confluence of bullish technical and onchain indicators.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Market Analysis",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58476011,
    "published": 1772037011000,
    "title": "Why Investors Are Not Buying Bitcoin And Ethereum Despite ‘Low’ Prices",
    "body": "Crypto analyst BitQuant has commented on why market participants are not buying Bitcoin and Ethereum despite the recent lows. This comes amid current market weakness, with the on-chain analytics platform CryptoQuant warning of a deeper decline. Why Investors Are Not Buying The Bitcoin and Ethereum Dip In an X post, BitQuant noted that no one, except Saylor’s Strategy, is buying Bitcoin at $65,000 because of reports that the U.S. may attack Iran. He added that if that happens, many believe that BTC will drop to $50,000, which is why they are not buying. Ethereum is expected to drop further if BTC declines. Related Reading: Here’s All You Need To Know About The Bitcoin Price This Week The analyst noted that these market participants are forgetting that Bitcoin fell from $90,000 to $60,000 without any news or headlines, and that they consider this nuance unimportant. As such, he suggested that BTC and Ethereum could still see lower prices, whether or not the U.S. attacks Iran. However, BitQuant indicated that current prices do not matter in the long-term as Bitcoin and possibly Ethereum are likely to trade higher. He stated that many still don’t understand that BTC is a system and that they only see it as an asset. The analyst added that for many, BTC resembles a football match where they celebrate when there is a goal and leave the stadium when there isn’t. Bitcoin, Ethereum, and the broader crypto market are currently facing downside pressure not only due to a potential U.S. attack on Iran but also due to the uncertainty around the Trump tariffs. The U.S. president over the weekend announced plans to hike the global tariff rate from 10% to 15% after the Supreme Court ruled against the tariffs under the International Emergency Economic Powers Act (IEEPA). BTC Could Still Drop Below $40,000 A CryptoQuant analysis recently suggested that Bitcoin could still drop below $40,000 to around $38,900, which is the long-term holders’ (LTHs) cost basis. The analysis also alluded to historical precedent, noting that each bear market has been characterized by BTC’s price breaking below its cost basis. This triggers a final capitulation phase marked by realized losses of around 20%. Related Reading: Analyst Predicts The Ethereum Price Bottom With A Marked Path To $15,000 The analysis also noted that it is only after this phase that the market has been able to rebuild the necessary foundations for a trend reversal, with Bitcoin and Ethereum reaching new highs. Meanwhile, another CryptoQuant analysis mentioned that the Coinbase Premium Index shows limited signs of recovery. The index’s 30-minute simple moving average had briefly crossed above the zero level but failed to maintain the momentum into the new week. CryptoQuant stated that this lack of sustained recovery in the premium, despite the temporary uptick, is considered a potential trigger for the recent downward price action. Featured image from Pngtree, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin Long-Term Holders Cost Basis|Bitcoin news|bitcoin price|Bitquant|btc|BTC news|btc price|btcusd|BTCUSDT|coinbase premium index|cryptoquant|Donald Trump|ETH|ethereum|IEEPA|International Emergency Economic Powers Act|Michael Saylor|Strategy",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58476398,
    "published": 1772037458000,
    "title": "Billionaire Alan Howard’s crypto incubator WebN closes down",
    "body": "WebN backed innovative digital asset firms like KAIO, Twinstake, TruFin and Geometry.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Laser Digital|Brevan Howard|CoinDesk Wealth|Incubators|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58477056,
    "published": 1772038800000,
    "title": "A $100 million crypto campaign fund with a pro-Trump vibe so far failed to show up",
    "body": "The Fellowship political action committee promised $100 million, with reports that Tether may have been tied as a backer, but the fund has so far delivered zero.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "News Analysis|U.S. Political Elections|campaign contributions|Fairshake|Tether|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58477219,
    "published": 1772038959000,
    "title": "UK Selects Firms for Stablecoin Regulatory Sandbox, Including Revolut",
    "body": "The four firms will now have free reign to experiment in a program that will inform final UK stablecoin rules set to be released later this year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58478030,
    "published": 1772040441000,
    "title": "Tether invests $200 million in digital marketplace Whop to expand stablecoin payments",
    "body": "The online marketplace said it will embed Tether's crypto wallet tools and USDT, USAT tokens to power crypto payments for over 18 million users.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Stablecoins|Tether|USDT|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58478378,
    "published": 1772041025000,
    "title": "Rachel Reeves’s crypto Isa move ‘at risk of being a damp squib’",
    "body": "No mainstream platform will offer both crypto ETNs and Innovative Finance Isas for April launch",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58478876,
    "published": 1772041832000,
    "title": "Blockfills co-founder and CEO Nicholas Hammer has stepped down amid $75 million lending losses",
    "body": "The crypto lender suspended client deposits and withdrawals earlier this month due to recent market and financial conditions.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|BlockFills|Crypto Lending|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58478821,
    "published": 1772041703000,
    "title": "The UK is picking winners for its digital dollar future while Coinbase CEO cries foul",
    "body": "Coinciding with the FCA’s announcement of its stablecoin trial, Coinbase’s Brian Armstrong criticized the U.K.’s regulatory process, saying it puts the region's global crypto leadership at risk.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|FCA Sandbox|U.K. Financial Conduct Authority|Revolut|Stablecoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58480922,
    "published": 1772045229000,
    "title": "Hut 8 swings to Q4 loss; compute revenue contribution increases",
    "body": "The Bitcoin miner's digital asset losses mounted, even as it advanced a 15-year, $7 billion AI data center lease.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58481848,
    "published": 1772046900000,
    "title": "Price predictions 2/25: BTC, ETH, XRP, BNB, SOL, DOGE, BCH, ADA, HYPE, XMR",
    "body": "Bitcoin bulls rushed toward $70,000, and ETH reclaimed $2,000 following a drastic improvement in investor sentiment, but will the gains hold?",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Top 10 Cryptocurrencies",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 12,
        "NAME": "BCH",
        "CATEGORY": "BCH"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58481548,
    "published": 1772046384000,
    "title": "MrBeast editor nabbed by prediction market firm Kalshi for alleged insider trading",
    "body": "The company said it punished the MrBeast employee and another user it said tried to get away with contracts relying on inside information.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Kalshi|Prediction Markets|U.S. Commodity Futures Trading Commission|Regulations|Insider Trading|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 58481332,
    "published": 1772046032000,
    "title": "Peter Schiff Says Bitcoin Has Never Beaten Gold Since 2021",
    "body": "Peter Schiff has a number. And he wants everyone to see it. The longtime gold supporter and Bitcoin critic took to social media this week to argue that when Bitcoin’s price is measured in gold rather than dollars, the flagship cryptocurrency has lost more than 66% of its value since hitting its all-time high in November 2021. Related Reading: Bullish Signal? Coinbase Bitcoin Premium Turns Positive After Months In Red The Math Behind Schiff’s Claim To make his case, Schiff reframed the comparison in a way that sidesteps the usual dollar-based charts. Back in November 2021, one Bitcoin could buy roughly 34.5 ounces of gold. Today, that same Bitcoin buys just 12 ounces — a drop of more than 64% in purchasing power relative to the precious metal. The dollar figures tell a similar story, at least from that starting point. According to Schiff, a $10,000 investment in Bitcoin at the November 2021 peak would be worth around $9,100 today. That same $10,000 put into gold over the identical period would have grown to more than $27,000. Gold was trading near $1,770 in late 2021 and has since climbed past $5,000 — a gain of roughly 185%. Bitcoin, by contrast, peaked at $69,000 during that same bull run. It has since pulled back sharply from a high of $126,200 reached in October 2025, and now sits around $63,000. Bitcoin is now down over 66% when priced in gold since its Nov. 2021 peak over four years ago. Putting that into perspective, had you invested $10,000 in Bitcoin back then, it would be worth about $9,100 today. But that same $10,000 invested in gold would be worth over $27,000. — Peter Schiff (@PeterSchiff) February 24, 2026 Bitcoin’s ‘Safe Haven’ Story Gets Complicated For years, Bitcoin was pitched to investors as a modern alternative to gold — scarce, decentralized, and resistant to inflation. The idea was simple: fixed supply would protect wealth the same way gold has for centuries. But recent market behavior has put that story under strain. When economic anxiety rises, many investors have continued to move money into gold rather than Bitcoin. Reports note that Bitcoin has, in several instances, moved more like a high-risk tech stock than a safe haven asset during periods of broader market stress. That pattern has made it harder for Bitcoin to claim the same defensive reputation that gold has built over a much longer history. CNBC crypto commentator Ran Neuner has also weighed in on the subject, saying that the store-of-value case for Bitcoin now faces serious scrutiny. Bitcoin supporters, for their part, push back on the framing. They point out that November 2021 was Bitcoin’s peak — about as unfavorable a starting point for comparison as one could choose. They also point out that the alpha crypto has climbed 320% from its cycle low of $15,000 in November 2023, while gold gained 150% over that same timeframe. For the first time in 12 years, I’m questioning Bitcoin’s thesis. It’s not the drawdown that concerns me; it’s how Bitcoin responded when markets genuinely moved into risk and uncertainty.$BTC evolved from “peer-to-peer cash” into “digital gold.” We fought for ETF approval.… pic.twitter.com/dblggAsanJ — Ran Neuner (@cryptomanran) February 16, 2026 Cycles, Not Trends, Say Bitcoin Supporters Reports say Bitcoin advocates cointend the crypto has always moved through boom-and-bust cycles, with steep recoveries typically following major beat-downs. Supply halvings, shifts in available liquidity, and swings in investor sentiment have historically been the impetus to those rebounds. Related Reading: XRP Fell Nearly 70% — Could History Repeat With An 835% Surge? From that view, the current stretch of underperformance against gold is seen as a normal part of Bitcoin’s cycle rather than a permanent reversal. Bitcoin completed a full market cycle last year, and a period of price correction is consistent with its historical behavior. Still, the gap between gold’s steady climb and Bitcoin’s volatile ride has given critics plenty of material. Schiff, who has maintained his skepticism of Bitcoin for well over a decade, shows no sign of changing his position anytime soon. Featured image from Unchained Podcast, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|btc|btcusd|crypto|gold|peter schiff|safe haven asset",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58483465,
    "published": 1772049450000,
    "title": "A $272 Billion UAE Bank Just Called Bitcoin 'Digital Gold'",
    "body": "CIO of Emirates NBD, the second-largest bank in the United Arab Emirates by assets, described Bitcoin as \"digital gold.\"",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58483471,
    "published": 1772049627000,
    "title": "TRON’s 994M Q4 Transactions Support TRX Push Toward Key Resistance Zones",
    "body": "Rising blockchain usage is increasingly shaping market sentiment around TRON, as strong on-chain activity begins to align with key technical price levels. Related Reading: Dogecoin Vs. Shiba Inu: What Meme Coin Should You Buy For Most Returns In 2026? Data from recent network reports show that sustained transaction growth and expanding stablecoin activity are reinforcing the fundamental narrative behind TRX, even as the token trades within a consolidation range. In Q4 2025, the TRON network processed roughly 994 million transactions, marking a 16.5% increase from the previous quarter. The surge reflects growing real-world usage rather than speculative trading, with payment transfers and stablecoin settlements accounting for a large share of activity. TRX's price moving sideways on the daily chart. Source: TRXUSD on Tradingview Network Activity and Stablecoin Usage Drive Growth TRON’s transaction count climbed steadily throughout 2025, with daily activity rising from about 8 million transactions early in the year to peaks above 12 million. The network averaged more than 10 million daily transactions by year-end, operating below capacity despite the increase in usage. Stablecoins remained the primary catalyst. The network hosted approximately $81.8 billion in stablecoin supply while settlement volumes exceeded $2.2 trillion during the quarter. These figures show TRON’s growing role in cross-border payments, remittances, and decentralized finance applications. Part of this expansion followed protocol changes, including a fee reduction proposal that lowered energy costs by about 60%, encouraging higher transfer activity, particularly USDT transactions. Additional integrations with cross-chain infrastructure and institutional platforms also broadened access to the ecosystem. TRX Price Action Tests Key Technical Levels Market data shows TRX trading around $0.28–$0.29 as of late February, reflecting modest gains despite broader crypto market volatility. Technical indicators currently signal neutral momentum, with oscillators such as RSI and MACD showing limited directional strength. Price action remains confined between support near $0.27 and resistance around $0.30–$0.32. Analysts note that a sustained break above this range could signal a move toward the $0.35–$0.37 zone, while a failure to hold support could trigger renewed consolidation. Trading volumes remain elevated compared with historical averages, suggesting active participation from both retail and institutional traders. However, weak trend strength indicates that markets are still waiting for a stronger catalyst. Adoption Metrics Shape Market Outlook TRON’s latest transparency data points to steady developer activity, continued smart-contract deployment, and governance updates aimed at improving scalability and decentralization. Network leadership has also emphasized expanding support for tokenized assets and large-scale settlement use cases in the coming years. Related Reading: Expert Forecasts $5 Trillions Pouring Into Crypto Post CLARITY Act Passage Historically, rising on-chain usage has often preceded stronger price performance for layer-1 tokens. Whether TRX can convert its growing transaction dominance into a decisive breakout may depend on broader market conditions, particularly movements in major assets like Bitcoin and Ethereum. Cover image from ChatGPT, TRXUSD chart on Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tron|TRON|TRX|TRX Price|trxusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 44,
        "NAME": "SHIB",
        "CATEGORY": "SHIB"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 51,
        "NAME": "TRX",
        "CATEGORY": "TRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58484298,
    "published": 1772050618000,
    "title": "Kraken introduces fixed-rate crypto loans for its Pro users",
    "body": "The crypto exchange’s new Flexline product lets Pro users borrow against digital assets at fixed rates of 10%–25% APR for terms of up to two years.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58485662,
    "published": 1772053211000,
    "title": "The Uncomfortable Truth About XRP That Shows How High Price Can Actually Go",
    "body": "The uncomfortable truth about XRP is that most people may be valuing it through the wrong lens. This point of view was made by commentator BarriC, who put forward a claim familiar among XRP enthusiasts: The altcoin was never designed to be a retail trade. In a recent post on X, he noted that the asset was built to move institutional value, and once financial infrastructure actually requires XRP, the price will not climb slowly. Instead, it will reprice to levels the system demands. XRP As Infrastructure, Not A Trade BarriC’s outlook on XRP’s price action is based on the idea that XRP’s purpose has been misunderstood. From the beginning, the XRP Ledger was structured to facilitate high-speed settlement, cross-border liquidity, and asset tokenization, where people can be their own bank and no middlemen tax their transactions. XRPL creators like David Schwartz have always pointed to these functionalities as the reason why the XRP Ledger is different. Related Reading: Cup And Handle Pattern Puts XRP Price At $60 After Hitting Resistance XRP is the bridge asset within that XRPL ecosystem. Through services built by Ripple, XRP has been positioned as a tool for on-demand liquidity between currencies and financial institutions. The reason offered by BarriC is that if banks and payment providers depend on it to settle value efficiently, demand would be based on usage, not just speculative trading like an average cryptocurrency. Under that framework, XRP’s valuation would no longer be based on retail buying pressure. It would reflect how much capital needs to flow through the network. How High Can The Price Actually Go? The most interesting part of BarriC’s statement is how much necessity pricing will affect the token’s price. The outlook is that when the token finally becomes required infrastructure, it does not grind higher step by step like a meme-based rally. Instead, it is going to reprice abruptly. That is why he dismisses price anchors such as $2 or even the three-digit mark at $100. Related Reading: Why This Expert Is Predicting A $10,000 Base Price For XRP If the necessity pricing were to happen, the price action is going to look more like $1,000 per XRP, $10,000 per XRP, or $50,000 per XRP. However, BarriC acknowledged that projections of $1,000 to $50,000 sound unrealistic under today’s conditions. This is especially true, considering the implied market cap if the altcoin were to trade at those predicted price levels. At the time of writing, XRP is trading within normal market structures and is currently trading at $1.37, up by 2.7% in the past 24 hours. Institutional usage of the altcoin is still limited compared to global payment volumes. However, recent moves by Ripple are increasingly seeing XRP becoming entrenched in the niche of global payments. It is currently unclear which path this price repricing will take, as there is no historical precedent in crypto markets for an asset transitioning into deeply embedded global payments settlement infrastructure. Therefore, projections from BarriC and other bullish XRP proponents are only forward-looking predictions. Featured image from RenderHub, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|BarriC|David Schwartz|Ripple|xrp|XRP Ledger|xrp news|XRP Price|XRPL|XRPL Ecosystem|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58485840,
    "published": 1772053629000,
    "title": "OpenAI, Google and Anthropic AI Models Deployed Nuclear Weapons in 95% of War Simulations",
    "body": "As the Department of Defense pushes for greater AI integration, researchers said the top models chose the nuclear option in nearly all war simulations.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58487369,
    "published": 1772056356000,
    "title": "Nvidia rises after earnings beat Wall Street's expectations, lifting AI-related crypto stocks",
    "body": "The AI bellwether reported $68 billion revenue last quarter, expecting it to grow to $78 billion next quarter.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Nvidia|Quarterly Earnings|Bitcoin News|Artificial Intelligence|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58487424,
    "published": 1772056332000,
    "title": "'Buy Bitcoin' Searches Hit A 5-Year High. Are Dip Buyers Right?",
    "body": "'Buy bitcoin' Google searches hit a 5-year peak. On-chain data, Jane Street, Trump, and an AI macro thesis explain what's driving this interest wave.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58489820,
    "published": 1772060386000,
    "title": "Nvidia Earnings Results Steady Markets as AI Spending Debate Intensifies",
    "body": "Nvidia’s earnings lifted technology shares and steadied broader markets, even as investors weighed how long the AI investment cycle can run.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      }
    ]
  },
  {
    "id": 58489866,
    "published": 1772060442000,
    "title": "Bitcoin Emerges As Strategic Asset In Emirates NBD Investment Plans",
    "body": "In a sign of the growing convergence between traditional finance and digital assets, Emirates NBD is reportedly exploring the addition of Bitcoin to its investment portfolio. The development reflects a broader shift in institutional strategy, as major financial institutions increasingly recognize BTC’s potential role in portfolio diversification, inflation hedging, and long-term value preservation. Why Emirates NBD Is Exploring Bitcoin Integration Emirates NBD, one of the largest banks in the United Arab Emirates but frequently described as the UAE’s second-largest bank, is actively evaluating whether to add Bitcoin to its investment portfolio. Crypto market commentator MartyParty has mentioned on X that the news stems directly from comments by Maurice Gravier, the Group Chief Investment Officer (CIO) at Emirates NBD, during an appearance on CNBC Squawk Box. Related Reading: Bitcoin Sees “Most Aggressive” Institutional Selling Ever, Analyst Says Gravier’s key points were viewing BTC as digital gold and framing it primarily as a store of value rather than merely an alternative currency. He noted that Bitcoin has matured significantly, citing its proof-of-work security model, limited supply, and structurally low inflation rate as attributes that enhance its appeal to institutional investors. Furthermore, Gravier has suggested that BTC’s current valuation appears more attractive compared to six months ago, when the price was considered relatively high. According to MartyParty’s summary, the bank has an internet model, and indicates that BTC could reasonably approach the $100,000 range within the next 12 months. However, the projections are still being refined. The Emirates NBD’s bank asset management division reportedly oversees approximately $16 billion in assets, and any potential allocation would be limited in size and used for diversification purposes. Nonetheless, with no final decision or execution, it is still under review amid ongoing market volatility. This consideration has highlighted a growing institutional interest in BTC across traditional finance in the Middle East. How Businesses Are Using BTC Payments At Scale While individuals are focused on Bitcoin dropping to $63,000, with the price down 50% from its high, a major milestone in its underlying network activity last week has largely gone unnoticed. Crypto analyst Fernando Nikolić pointed out that the Lightning Network surpassed $1 billion in monthly transaction volume for the first time, reaching approximately $1.17 billion across 5.2 million transactions in November. Related Reading: Bullish Signal? Coinbase Bitcoin Premium Turns Positive After Months In Red The data shows that the average transaction size nearly doubled year-over-year from $118 to $223, indicating that this is not just micropayment experimentation. Nikolić believes that businesses are using it, and exchanges are moving real money through it. In other words, its actual usage as a payment network just hit an all-time high. In his view, both realities can coexist and underscore a broader disconnect between market narratives and underlying network fundamentals. Also, Nikolić noted that the adoption milestone has received relatively little attention because it challenges the dominant bearish storyline surrounding the BTC price action. Featured image from Peakpx, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|emirates nbd|Fernando Nikolić|MartyParty|Maurice Gravier",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58491853,
    "published": 1772064041000,
    "title": "Elliot Wave Analyst Predicts Bitcoin Price Will Crash In Final Move, What’s The Target?",
    "body": "According to a new forecast from an Elliott Wave analyst, the Bitcoin price could be gearing up for more pain as bearish pressures continue to weigh heavily on it. As a final bear market move, the analyst has projected that Bitcoin could crash by more than 14% from its current price near $65,000. Bitcoin Price Readies For Final Bear Market Plunge Elliott Wave Strategy, a market expert on X who focuses primarily on Elliott Wave structures and analysis, has warned that Bitcoin is entering its final leg down of its current bear market cycle. In his updated post, the analyst declared that BTC’s corrective Wave 4 structure has ended precisely as projected. He summarized the outlook bluntly, stating that the relief phase is finally over and Wave 5 is now in motion. Related Reading: Bitcoin Dominance To Experience Major Crash? Pundit Shares What This Would Mean The accompanying TradingView chart shows Wave 5 beginning at the end of a triangle formation, which marked Wave 4. The projected target for the final wave has been clearly defined, with the first measured move expected to drag Bitcoin’s price down toward the 1.0 Fibonacci Retracement level at $60,385. Elliott Wave Strategy has also forecasted a potential market bottom. He expects Bitcoin to decline further to the next bearish target at $55,759, marked by the 1.618 Fibonacci level. Based on the expert’s analysis, BTC’s current structure shows no clear signs of a possible recovery until it completes its correction. As a result, the analyst has urged investors and traders to brace for the potential decline to $55,759, which could wipe out more than 55% of BTC’s value from its ATH levels above $126,000. A Recap Of Bitcoin’s Wave 4 Performance Based on the wave count displayed on the Elliott Wave Strategy’s chart, Bitcoin has already completed Waves 1 through 4 of a five-wave bearish impulse. The structure shows an earlier price breakdown from above $90,000, slicing through the 0.382 retracement at $90,601 before accelerating below $75,300, which coincided with the 0.5 retracement level. Following this, Bitcoin continued its downward spiral below the 0.382 Fibonacci Retracement at $71,689.20, marking the start of the Wave 4 consolidation. Related Reading: Here’s What’s Driving The Bitcoin Price Crash Toward $60,0000 In a previous analysis, Elliott Wave Strategy noted that Bitcoin had already entered its corrective Wave 4 structure as of February 12. He warned that the temporary rally above $71,000 that preceded the onset of Wave 4 should not be mistaken for a new bull market cycle, reinforcing his predominantly bearish stance on BTC. The now-completed Wave 4 triangle has been capped by descending resistance near $70,000 and supported by a rising trendline around $66,000. Elliott Wave Strategy characterized this trendline as a classic bearish continuation pattern, suggesting further downside pressure for BTC’s already weak price. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|Elliott Wave Strategy|Fibonacci Retracement Level",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58492347,
    "published": 1772064664000,
    "title": "Kalshi boots a US politician off the platform for insider trading",
    "body": "CFTC chair Mike Selig said the agency established a prediction markets advisory to help catch insider traders, warning there would be consequences.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 58496168,
    "published": 1772071943000,
    "title": "ETHZilla shares pop as it rebrands to Forum in tokenization pivot",
    "body": "ETHZilla will now go by Forum in its second rebrand in less than 12 months as it looks to catch a windfall from the hype around tokenization.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 208,
        "NAME": "ADMINISTRATIVE EVENTS",
        "CATEGORY": "ADMINISTRATIVE EVENTS"
      },
      {
        "TYPE": "122",
        "ID": 214,
        "NAME": "TICKER CHANGE",
        "CATEGORY": "TICKER CHANGE"
      }
    ]
  }
]