[
  {
    "id": 55776710,
    "published": 1765722000000,
    "title": "Bitcoin ‘extreme low volatility’ to end amid new $50K BTC price target",
    "body": "Bitcoin traders braced for a major move “around the corner” after days of BTC price action sticking to a tight range around $90,000.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55773831,
    "published": 1765717200000,
    "title": "Spanish Authorities Bust Crypto Kidnapping Ring After Deadly Attack",
    "body": "The case highlights a growing trend of physical attacks aimed at extracting access to crypto wallets, known as \"wrench attacks.\"",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "CoinDesk News|Security|Spain|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55775441,
    "published": 1765713641000,
    "title": "Reasons Why XRP’s Technical Structure Favors Upside Than Down Over Next 6 Months",
    "body": "XRP’s recent pullback to $2 has not changed the broader technical picture, according to a new analysis shared on X by crypto analyst Egrag Crypto. Despite the lack of bullish price action in recent weeks, the technical analysis proposes that the market structure continues to favor an upside continuation rather than the trend ending. This outlook places the next three to six months in a constructive zone for XRP’s price action, where the probability of further upside is higher than the risk of a downward move. Related Reading: Do Kwon Falls Hard — Terraform Labs Chief Gets 15 Years For Wire Fraud XRP Currently In Consolidation, Not Distribution The assessment of Egrag’s technical analysis is based on XRP’s price action currently ticking a list of boxes that points to the next move being up. The first of these boxes is what the analyst referred to as a regime shift, which occurred after the XRP price made a decisive breakout from a multi-year base around $0.5 last year. This decisive breakout shifted the market from accumulation to expansion. Pullbacks in this phase are usually corrective, not trend-ending. In that context, the current price action can be viewed as part of a natural pause rather than a signal that the larger bullish move has failed. Another central argument in the analysis is that the current price behavior represents consolidation rather than distribution. Egrag Crypto describes the market as being in a compression phase following an impulse, and this is a pause, not a top. Although XRP has spent about 13 months ranging within this structure, the analyst interpreted this as extended consolidation instead of a distribution process. Chart Image From X. Source: @egragcrypto On X EMA Structure Keeps Bullish Bias Intact Another reason as to why the trend is more likely bullish is because XRP is still trading in alignment with its long-term exponential moving average, which remains above the 21 EMA. That relationship preserves the bullish bias, even though price currently sits below the faster 9 EMA, but this only reflects short-term weakness rather than a structural breakdown. Beyond pure chart structure, fundamental developments have added weight to the case for longer-term appreciation. XRP is currently holding $2 as an important support zone, and recent developments have emerged that could increase bullish sentiment. An example is Ripple’s conditional approval alongside other crypto firms for a national trust bank charter from the US Office of the Comptroller of the Currency. Related Reading: Solana’s Long-Awaited Firedancer Launch Sparks 5% Rally Although the outlook is much more bullish, there is always the possibility of turning bearish within the next six months. According to Egrag, this outlook can only turn bearish if XRP records a sustained monthly close below the $1.80 to $1.60 region. Taken together, the analysis concludes that XRP is more likely to resolve higher than lower over the next three to six months, even if there is price volatility along the way. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|blockchain|crypto|crypto market|cryptocurrency|digital currency|Ripple|xrp|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55688297,
    "published": 1765713174000,
    "title": "Bitcoin Price Crash Fears Suddenly Emerge After Serious Saylor Warning",
    "body": "Michael Saylor has warned of “chaos, confusion,\" and \"profoundly harmful consequences\" if his bitcoin-buying company Strategy is ejected from MSCI indices...",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55768912,
    "published": 1765708163000,
    "title": "Bitcoin will ‘dump below $70K’ thanks to hawkish Japan: Macro analysts",
    "body": "The Bank of Japan is expected to increase its benchmark interest rates on Friday, a historically bearish signal for riskier assets like Bitcoin.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55773232,
    "published": 1765706433000,
    "title": "Bitcoin And Ethereum Market Structure Points To Crypto Winter – Details",
    "body": "The crypto market has shown a modest price rebound in the last three weeks, returning to a total market cap of $3.07 trillion. During this time, Bitcoin has climbed by 11% from its local bottom at $80,700, while Ethereum has been more aggressive, gaining by 18% within the same period. Despite these reassuring performances, a market analyst with the username PelinayPA postulates that the bear market has commenced, considering certain technical parameters. Related Reading: Bitcoin Bullish Structure Weakens As Inter-Exchange Liquidity Touches Red Zone – Details BTC & ETH Moving Averages, Trading Volumes Signal Bear Season Bear market speculations have been at a heightened level in Q4 2025, as the crypto market suffered extensive price corrections, during which Bitcoin alone retraced by around 36.5%. While the market may have shown some steady upward mobility in recent weeks, many analysts remain convinced the bears have assumed market control, leaving little bullish potential for a full market reversal. In analyzing Bitcoin’s chart, PelinayPA explains that price is presently trading below the short (7, 14), medium (30, 50), and long-term moving averages (100), indicating a strong sellers’ dominance in the market. However, the more concerning observation is that these averages are sloping downward, suggesting the recent downtrend or corrections may not be temporary. Furthermore, the seasoned crypto analyst notes these moving averages are acting as resistance in classic bear-market behavior that initiates a selling spree upon contact with price. In addition, sellers are also aggressive as red candles come with higher volume, while hesitant buyers load the green candles with relatively lower volumes. Based on these technical observations, PelinayPA explains that Bitcoin is not launching a bullish market reversal, but rather remains in a reaction within a larger bear market. Meanwhile, the Ethereum market analysis shows a similar situation in that price is trading below key moving averages. However, the short-term MAs (7, 14) are beginning to turn upward. In addition, the price rebounds from lows are stable and stronger while candles are recording shorter wicks, indicating the selling pressure is less aggressive, why buying interest remains visible. Therefore, while Ethereum is clearly stronger than Bitcoin, the bullish strength remains insufficient to initiate a trend reversal as long-term MAs remain downward sloping amid low buying volume. Related Reading: If This Ethereum Bear Flag Pattern Holds, ETH Price Could Be On Its Way To $2,400 Bitcoin Price Overview At the time of writing, Bitcoin trades at $90,155 after a minor 0.22% decline in the past 24 hours. Meanwhile, daily trading volume is down by 20.34% and valued at $64.22 billion. According to PelinayPA, the Bitcoin bull rally is finished, and a deeper price correction is needed before investors see another parabolic surge or all-time high. The analyst predicts Bitcoin to bottom around $50,000 in the “ongoing” bear market, postulating a potential 44.4% decline from the present market prices. Featured image from Freepik, chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|Bear market|bitcoin|crypto winter|cryptoquant|ethereum|moving averages|PelinayPA",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55766241,
    "published": 1765703400000,
    "title": "Twenty One’s first-day slide highlights investor caution toward BTC-backed stocks",
    "body": "Twenty One Capital’s NYSE listing showed how tightly markets now price Bitcoin-heavy firms, with investors refusing to pay much beyond the underlying BTC value.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55772079,
    "published": 1765699253000,
    "title": "Ethereum Active Address Count Hits Seven-Month Low  — What This Means",
    "body": "While the Ethereum price still struggles to mount a sustained bullish momentum, an investigation into its on-chain activity has revealed a significant change in the behavior of its market participants. Active Addresses Decline To 327,000 From 483,000 August High In a Quicktake post on the CryptoQuant platform, market analyst CryptoOnchain shared that there has been a growing scarcity of activity within the Ethereum network. Specifically, the quant referenced data obtained from the Ethereum Active Addresses metric, observed on the 7-day Simple Moving Average. Related Reading: If This Ethereum Bear Flag Pattern Holds, ETH Price Could Be On Its Way To $2,400 Since reaching its peak in August, the Active Addresses metric has declined steadily from about 483,000 to 327,000 — a level which marks the lowest reached since May this year. This downturn of more than 32% suggests an increasing exit of willing participants from the Ethereum network. Interestingly, the aforementioned downturn is not a stand-alone phenomenon. Just around the same period where active addresses explored the southside of the charts, the Ethereum price also took on a bearish direction. This period saw the Ether token lose its $4,800 valuation and begin its descent to the current price around $3,100. According to the analyst, this strong correlation between the falling Ethereum valuation and its contracting network usage points to something clear — that the recent price drop is likely a result of reduced network demand. This further shows that market participants are moving past speculation, and are in lieu adopting a broader outlook on the Ethereum blockchain. Ethereum Market Outlook On the more positive side, CryptoOnchain explained how healthy bull cycles differ from the present market cycle. Typically, rising prices are not taken for granted as they often indicate a healthy bullish cycle. An expansion of the cryptocurrency’s network usage also lends credence — enough to serve as confirmation — to suspicions of structural shifts into bullish phases. This theory holds true from a variety of historical occurrences. So, a market would not qualify as bullish enough if the Ethereum price were on the rise without any parallel growth in on-chain activity. Hence, for a convincing price reversal to hold, there has to be a significant and sustained recovery of active addresses. This would signal the return of on-chain demand and further heighten expectations of imminent momentum. Until those conditions are simultaneously met, the Ethereum market remains in a state of utmost caution, where prices could head towards either direction, with the major factor being the influx of network users. As of press time, the Ether token is valued at about $3,106, reflecting no significant movement since the past day. Related Reading: XRP Mirrors 2016 Trend That Led To 69% Crash Before 110,000% Rally Featured image from iStock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ethereum|ethereum active addresses|ethereum price|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55762286,
    "published": 1765695554000,
    "title": "Standard Chartered, Coinbase deepen alliance to build institutional crypto infrastructure",
    "body": "Standard Chartered and Coinbase are expanding their partnership to develop trading, custody and financing services aimed at institutional crypto clients.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55772648,
    "published": 1765692056000,
    "title": "Bitcoin Investors Brace For BOJ Rate Hike As Market Sell-Off Continues — Details",
    "body": "The Bitcoin market has continued to consolidate within the $90,000 price zone over the last day, reflecting a minor 0.04% gain within this period. Notably, the premier cryptocurrency has witnessed a steady rally in recent weeks, forming the early phases of an ascending channel. To protect this potential uptrend, recent on-chain data shows that investors are moving to initiate a downside and price in the market effect of an anticipated negative catalyst. Related Reading: Bitcoin Macro Retracement Meets Mid-Range Battle – Will Bulls Reclaim Momentum? Bitcoin Sees High Inflows, Negative Funding Rates As Investors Guard Against Rate Hike In a QuickTake post on CryptoQuant, the crypto analysis page XWIN Research Japan discusses how potential Japan economic developments are presently impacting the Bitcoin market. Notably, analysts and economists expect the Bank of Japan to announce a 25 bps rate hike at its next policy meeting between December 18-19, as the Asian nation moves to end an ultra-loose monetary regime. Interest rate hikes are generally interpreted as bearish catalysts as they force investors to move out of risky assets due to less available capital, thereby inducing a price decline. According to XWIN Research Japan, Bitcoin investors may currently be attempting to absorb the resulting price pressure, potentially muting the immediate impact of the primary catalyst itself. This theory is based on multiple developments, such as exchange netflows. The analysts at XWIN report that exchange inflows are rising to mirror similar levels seen during previous BOJ hikes. Investors are presently exiting exchanges and minimizing their spot exposure to reduce the market impact of the expected decision. Meanwhile, the funding rates are also declining, another event seen during past rate hikes. Notably, investors are proactively losing their leverage in what is a pre-event caution movement. Related Reading: Ethereum Holds Support As Smart Money Steps In – What This Means For Price What Next For Bitcoin? At press time, Bitcoin tie valued at $90,190, reflecting a market gain of 0.77% in the past week. With the Bank of Japan’s hawkish pivot largely priced in, XWIN Research says that market focus has shifted away from the rate hike itself toward post-announcement yen dynamics. Going forward, the analysts explain that Bitcoin’s near-term direction may hinge on whether the yen continues to strengthen or if markets respond with a “sell the rumor, buy the fact” reversal, signaling that the adjustment phase is already unfolding. With a market cap of $1.67 trillion, Bitcoin continues to rank as the largest cryptocurrency with a current market dominance of 58.2% Featured image from Flickr, chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|Bank of Japan|bitcoin|BTCUSDT|cryptoquant|Interest rate hike|XWIN Research Japan",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55759658,
    "published": 1765690166000,
    "title": "XRP bulls gain ground over bears on social media, ETF inflow streak continues",
    "body": "Spot XRP exchange-traded funds continued a streak of positive flows, with over $20.1 million recorded on Friday, marking 19 consecutive days of net inflows.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55753565,
    "published": 1765677639000,
    "title": "Ethereum Holds Support As Smart Money Steps In – What This Means For Price",
    "body": "Ethereum is holding firm above key support as smart money steps in, hinting at growing confidence beneath the surface. With bullish signals and steady inflows aligning, the market now watches whether this stability can spark a meaningful upside move. ETH Coils Below $3,200 Ahead Of A Decisive Move AltCoin Việt Nam, in a recent post, highlighted that ETH is positioned at an extremely tense moment on its chart, signaling that the asset is preparing for a major directional move. This immediate pressure is being fueled by a significant bullish divergence that has just appeared on the chart, marking the first time the signal has materialized in over a month. Related Reading: Why Ethereum’s Rally Isn’t Overheated – And Where Demand Must Grow Next The analyst reinforced the expectation of high volatility by referencing historical data. Their research shows a consistent history of 9–16% price volatility whenever ETH falls below the $3,200 level. Given that the price is currently fluctuating tightly around the $3,100 mark, this historical context provides a clear signal that a sharp volatility explosion may be imminent. Adding overwhelming conviction to the bullish case is the recent action of market movers. AltCoin Việt Nam reported that a single super large whale just opened a leveraged long position totaling a massive $392 million (equivalent to 120,094 ETH). This colossal bet on the upside demonstrates a firm, high-conviction among institutional players. Furthermore, the institutional framework continues to provide a reliable underlying demand. The Spot Ethereum ETF market is still actively attracting substantial capital inflows, totaling over $250 million this week. BitMine Technologies also purchased an additional 33,504 ETH (valued at $112 million) today, highlighting persistent institutional accumulation. Considering the confluence of technical divergence, historical volatility context, and massive whale and institutional purchasing, the market faces a critical juncture. AltCoin Việt Nam posed the final question: Can ETH break out strongly and immediately confirm the uptrend, or will it need to retest lower support levels before initiating the expected explosive rally? Buyers Step In As Ethereum Defends Key Support According to crypto analyst The Boss, ETH has shown a highly encouraging response from a key technical area. Ethereum has reacted positively with the $3,091 support zone, and is currently holding firmly above this level, which is a strong signal that short-term buying pressure remains resilient and active in the market. Related Reading: Ethereum Inches Toward A Critical Decision Point: Bullish Break Or Deeper Dive? As long as the price stays above the green line, the analyst confirms that the primary focus remains the upside, validating the potential for a move toward the resistance zone marked by the blue line. The Boss emphasized the importance of these structural defense moves, concluding that such strong reactions from established support levels are vital signals for confirming the validity of the current structure and providing clear direction of the prevailing trend. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|AltCoin Việt Nam|BitMine Technologies|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|ethusd|ETHUSDT|Spot Ethereum ETF|The Boss",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55751872,
    "published": 1765674006000,
    "title": "XRP Mirrors 2016 Trend That Led To 69% Crash Before 110,000% Rally",
    "body": "XRP has struggled to create any upside traction over the past few days, with the price rejecting above $2.15 in the middle of the week and now back to lingering just above the $2 level. A new long-term technical comparison shared by crypto analyst ChartNerd places XRP’s price behavior since its July all-time high of $3.65 into an interesting context, implying that what XRP is doing now resembles a phase from its 2016 market cycle that points to an incoming huge rally. Related Reading: American Bitcoin Makes Big Buy, Adds 416 BTC To Its Stack Repeating 2016 Rejection And ABC Crash Structure According to crypto analyst ChartNerd, XRP’s current structure matches a similar price action that unfolded in late 2016. when price rejected an accumulation supply block and rolled into an ABC corrective move. That correction ultimately produced a 69% flash-wick decline that extended into the first quarter of 2017. The drop was severe and unfolded over several months, eventually pushing XRP to as low as $0.00240, but it eventually represented the end of the correction rather than the end of the bullish cycle. The chart accompanying the analysis, which is shown below, highlights a similar rejection pattern forming now. This pattern is based on how the XRP price rejected at its most recent all-time high in July. Since then, the monthly price chart has been printing consecutive red candles, with monthly closes consistently below opens. At the time of writing, XRP is about a 44% correction from this all-time high. This means a 69% correction is yet to play out in its entirety. Therefore, if history repeats, a full 69% ABC-style move from the all-time high would drag XRP back below $1 and as low as $0.8. This move is expected to play out into the first quarter of 2026. XRP Price Chart. Source: @ChartNerdTA Potential Drop Could Be A Set-Up For A Much Larger Rally XRP is currently trading at $2.04. Therefore, a deeper pullback below $1 will translate to a 51% decrease from the current price action. The idea of a deeper pullback from $2 is tough to imagine, especially given the inflows into Spot XRP ETFs. In fact, a pullback of that magnitude could test conviction across the market and cause many bullish traders to step aside. However, the technical analysis frames it as a structural reset rather than anything else. In 2017, the post-crash consolidation laid the groundwork for one of XRP’s most explosive rallies on record, ultimately delivering gains in excess of 110,000%. Related Reading: Is Dogecoin Waking Up? Critical On-Chain Metric Explodes Higher If this sequence plays out as expected, then the real bullish opportunity would develop later in 2026. From that reset zone, the chart projects a long-term advance to the 1.618 Fibonacci extension, placing a potential upside target around $27. The visual projection in the chart above shows a clean multi-month expansion zone that delivers a 2,300% gain after the corrective phase. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|blockchain|crypto|cryptocurrency|digital currency|Ripple|xrp|xrp news|XRP Price|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55748789,
    "published": 1765666842000,
    "title": "Bitcoin Macro Retracement Meets Mid-Range Battle – Will Bulls Reclaim Momentum?",
    "body": "Bitcoin is facing a critical juncture as its macro retracement converges with a tight mid-range battle between $86,000 and $100,000. With bearish patterns confirmed and short-term support holding, the market now waits to see if bulls can reclaim momentum or if a deeper pullback is on the horizon. Bitcoin Confirms Macro Top: Bearish Phase Underway According to an update from Crypto Patel, Bitcoin appears to have confirmed a market top and is now transitioning into a broader macro retracement phase. The loss of a key bullish support level has shifted the market structure into a bearish phase. Related Reading: Bitcoin’s Market Structure Strengthens Despite Slower Trading Activity — Here’s Why The chart shows that a Head and Shoulders formation has fully played out. Classical technical rules suggest that the 162% downside projection has already been achieved, reinforcing the view that a cycle top is in place and a larger trend reversal is underway. Looking at the macro Fibonacci retracement from the bear-market low to the recent peak, several key levels come into focus. These include the 0.382 retracement, which sits near $56,700, and the 0.5 level around $44,000, representing a zone of potential bear-market acceptance. Additionally, the 0.618 retracement near $35,000 stands out as the strongest long-term support area. On the liquidity side, an unfilled fair value gap between $98,000 and $100,000 acts as a magnet for a short-term relief bounce before the broader downtrend resumes. Overall, the macro outlook for Bitcoin remains bearish. While a bounce toward the $98,000–$100,000 region is possible, the dominant path points toward a deeper move into the $70,000–$60,000 Fibonacci supports. Traders are advised to wait for confirmation and remain flexible, respecting multiple scenarios as the market unfolds. BTC Trapped: $96,000–$100,000 Cap Meets $86,000 Support Bitcoin remains range-bound between two critical zones as noted by CyrilXBT. Price is hovering near the $90,300 area after facing another rejection from the $96,000–$100,000 supply zone and the 50-day EMA. This region has consistently capped upside attempts over the past several weeks. Related Reading: Report Reveals 65% Of Bitcoin Treasury Companies Struggling With Major Unrealized Losses On the downside, buyers continue to show up around the $86,000–$88,000 demand zone, preventing the price from slipping into a broader breakdown and keeping BTC locked within its current range. From a broader market perspective, Bitcoin previously cooled off while tech stocks surged. As momentum in tech begins to slow, BTC is attempting to stabilize, but a decisive reclaim of the $96,000–$100,000 zone is still required to shift momentum. A sustained move above $100,000 would open the door to trend reversal. Conversely, a loss of the $88,000 support could expose Bitcoin to a deeper pullback toward the $72,000–$76,000 region. Until either scenario plays out, price action remains choppy, and patience is warranted. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|Crypto Patel|CyrilXBT|EMA|Fibonacci Retracement Level|Head and Shoulders Formation",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55747686,
    "published": 1765664094000,
    "title": "BTC OGs selling covered calls is the main culprit suppressing price: Analyst",
    "body": "Despite traditional ETF investors willing to pay premiums to go long, Bitcoin natives selling covered calls have put a damper on a price rally.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55746288,
    "published": 1765661263000,
    "title": "The downfall of Do Kwon",
    "body": "FTAV watched on in court as a New York judge eviscerated the Terraform Labs co-founder — and explained his dramatic rise and fall",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 34,
        "NAME": "LUNA",
        "CATEGORY": "LUNA"
      }
    ]
  },
  {
    "id": 55745412,
    "published": 1765659622000,
    "title": "Dogecoin Triangle Support Test Maps Out Recovery Roadmap And When To Sell",
    "body": "Dogecoin (DOGE) is testing the lower boundary of a long-term triangle pattern, a move that could determine its next major price direction. A new technical analysis highlights a roadmap with key recovery levels and outlines a potential timeframe when selling and profit-taking may become favorable. Dogecoin Triangle Pattern Signals Recovery Path In a recent X post, crypto analyst Jonathan Carter presented a new analysis of Dogecoin’s price action, predicting that a potential recovery may be imminent. Carter explained that Dogecoin is currently testing a critical support area around $0.135 within a long-standing descending triangle chart structure. The setup is unfolding over the 3-day timeframe, with price action remaining above the pattern’s lower boundary. This zone has become a key battlefield between buyers and sellers. Related Reading: Is Dogecoin Waking Up? Critical On-Chain Metric Explodes Higher Carter highlights that the ongoing support area offers a favorable risk-reward profile for market participants. Buyers stepping in at this level are attempting to prevent a breakdown that could invalidate the broader recovery outlook. This means holding above this support zone could keep Dogecoin’s bullish scenario intact. The descending triangle visible on the analyst’s shared chart shows a series of lower highs pressing against the stable support zone at $0.135. This compression often precedes a decisive move once the price reacts strongly at the base. Dogecoin’s current structure also suggests the market is steadily approaching that inflection point. The volume data at the bottom of the chart has yet to show strong expansion near the support area. This indicates that Dogecoin’s trading activity has been relatively muted, suggesting that the market may be waiting for confirmation before committing to a significant upward move. If Dogecoin successfully rebounds from the $0.135 support zone, Carter’s chart maps out several upside levels to watch. Initial recovery targets are seen around $0.155 and $0.190, where previous price reactions occurred. Clearing these levels would signal growing momentum and a possible end to DOGE’s downtrend. Further upside extensions projected on the chart include $0.250 and $0.310, which align with previous consolidation areas. A stronger continuation could open the path toward $0.370 and ultimately the resistance zone near $0.470. Resistance Zone Reveals When To Sell DOGE Carter’s Dogecoin chart clearly shows the $0.47 resistance zone, where sellers are expected to become active again. A rally into the zone would likely face increased selling pressure based on historical price behaviour. As a result, the resistance area serves as a strategic level for profit-taking rather than for new entries in Dogecoin. Related Reading: Binance’s USD1 Stablecoin Push Deepens Relationship With Trump’s Crypto Platform Overall, Carter’s analysis suggests that Dogecoin’s price is sitting at a pivotal technical level that could shape its next major move. The meme coin’s price is currently down, having crashed by over 22% year-to-date, according to CoinMarketCap. Despite this slip, Carter remains optimistic about DOGE’s recovery path. The recovery timeline highlighted in the analysis suggests that by 2026, the meme coin may have emerged from its downturn. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|crypto|crypto market|crypto news|cryptocurrency|digital currency|doge|Dogecoin|dogeusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55743673,
    "published": 1765655689000,
    "title": "The Securities and Exchange Commission publishes crypto custody guide",
    "body": "The guide was a good-faith primer on crypto custody basics and best practices, including different forms of wallet storage and common risks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55742048,
    "published": 1765652400000,
    "title": "These Three Metrics Show Bitcoin Found Strong Support Near $80,000",
    "body": "Onchain data shows multiple cost basis metrics confirm heavy demand and investor conviction around the $80,000 price level.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Glassnode|support level|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55777357,
    "published": 1765723080000,
    "title": "Emerging Asian Economies Pivot To Stablecoins",
    "body": "Explore how emerging Asian economies like the Philippines, India, and Pakistan are leading in stablecoin adoption, revolutionizing cross-border payments and inclusion.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|Money|/money|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55778111,
    "published": 1765724400000,
    "title": "YO Labs Raises $10M to Scale Cross-Chain Crypto Yield Optimization Protocol",
    "body": "The protocol automates yield generation by rebalancing capital across DeFi protocols, factoring in risk, and offers access to various assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Web3|Yield|Crypto|Fundraising|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      }
    ]
  },
  {
    "id": 55780302,
    "published": 1765728042000,
    "title": "Ethereum Forms Wyckoff Breakout Setup: $10,000 Price Target Back In Focus",
    "body": "A recent technical analysis shared on X by crypto analyst Merlijn The Trader presents Ethereum’s price action on the 2-day candlestick chart as a textbook example of Wyckoff accumulation. In his assessment, Ethereum has already moved through several key stages of the model and is now approaching a powerful expansion phase, provided the structure stays intact. Related Reading: American Bitcoin Makes Big Buy, Adds 416 BTC To Its Stack Wyckoff Accumulation Structure Taking Shape On Ethereum Chart Over the past several days, Ethereum has traded between roughly $3,050 and $3,400, repeatedly failing to secure a sustained move beyond either boundary. At the time of writing, Ethereum’s price action is trading around $3,100. This prolonged standoff has reinforced the view that Ethereum has returned to consolidating rather than trading in a defined trend, a behavior that aligns closely with the accumulation phase highlighted in a technical analysis by Merlijn The Trader. In his post, Merlijn described Ethereum’s chart as a “Wyckoff masterclass,” pointing to a sequence of events that align with textbook behavior from the Wyckoff accumulation schematic, which have been playing out for the entirety of 2025. According to the annotated structure, the spring occurred when ETH briefly dipped below $1,500 in the first half of the year. Price did not linger below that level for long, reclaiming the range within days and going on a rally that eventually ended at a selling climax (SC) of $4,946 Within this structure, the initial selling climax and automatic downtrend reaction established a clear range in which the cryptocurrency has been trading up until now. The chart labels show this as Ethereum moving through Phase D, and this has been highlighted by a downtrend in recent months. However, based on the Wyckoff framework, Ethereum seems to now be approaching the breakout zone, with a transition into a full Phase E and a potential vertical markup coming next if the structure continues to play out. Phase E Projection Points To Strong Upside Scenario If the Wyckoff roadmap continues to unfold as outlined, Merlijn believes Ethereum is setting up for a full Phase E, the final stage of the accumulation process. This phase is characterized by a sustained markup, where price exits the selling climax (SC) decisively and trends higher with increasing momentum. Ethereum / US Dollar: @MerlijnTrader on X The projection on the chart shows a sharp upside expansion once overhead resistance is cleared, with Merlijn pointing to $10,000 and higher as a long-term objective if the structure completes. The path higher is not expected to be linear. The model anticipates an initial push into new all-time highs, followed by a modest rejection around the $5,000 area before the price pauses to consolidate towards the Backup and Last Point of Support Related Reading: Do Kwon Falls Hard — Terraform Labs Chief Gets 15 Years For Wire Fraud According to the chart, this BU/LPS would likely form around $3,750. If Ethereum holds above that level during the pullback, it would confirm structural strength, with the subsequent expansion targeting above $10,000. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|blockchain|crypto market|cryptocurrency|digital currency|ETH|ethereum|ethusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 34,
        "NAME": "LUNA",
        "CATEGORY": "LUNA"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55779932,
    "published": 1765727100000,
    "title": "Why oil-rich investors are fueling Bitcoin’s next liquidity wave",
    "body": "From petrodollars to ETFs, oil-rich investors are entering Bitcoin via regulated rails, deepening liquidity while reshaping market structure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55779953,
    "published": 1765720851000,
    "title": "Bitcoin Headed For $200 Trillion? CEO Makes Bold Prediction",
    "body": "A new public company with a big Bitcoin stash is pitching a bold claim. Twenty One Capital, which listed on the New York Stock Exchange on December 9, arrived with close to $4 billion Bitcoin treasury and now holds the third-largest BTC reserve among public firms. According to the firm’s CEO, Jack Mallers, Bitcoin’s role could expand far beyond a speculative holding. Related Reading: Solana’s Long-Awaited Firedancer Launch Sparks 5% Rally CEO Sees Bitcoin As A Reserve Asset Mallers told viewers on theCUBE+NYSE Wired that Bitcoin has compounded holders’ portfolios at roughly 50% a year over the past five to 10 years. Based on reports, he expects that the current $2 trillion market for Bitcoin could grow to between $20 trillion and $200 trillion. He argued Bitcoin might become the next global reserve asset as finance “recollateralizes” itself away from traditional treasuries and government debt. If supply then stood at 20 million tokens when a 100x market rise happened, Bitcoin would trade near $10 million per coin. At a present price of $92,270, that outcome would equal an increase of about 10,730%. Market Signals Remain Mixed Short-term market signs are not all in favor of a big rally. According to market watchers, the Federal Reserve’s recent rate cut barely moved Bitcoin, leaving price action largely flat and directionless. The MACD histogram, however, is showing hints of bullish momentum in some technical reads, which suggests buyers may be warming up. The dollar index is showing signs of weakness, which often helps assets like Bitcoin. ETF flows keep disappointing. Without steady inflows from funds, big narratives can struggle to turn into lasting price gains. Product Push Aimed At Liquidity Without Selling Twenty One Capital says it wants to offer services that let holders tap liquidity without selling their coins. The firm plans to start in credit and lending and has said it will roll out products in partnership with Tether. Related Reading: Do Kwon Falls Hard — Terraform Labs Chief Gets 15 Years For Wire Fraud Mallers described the company as more than a balance-sheet accumulator; he compared their ambitions to Coinbase while stressing a narrower focus on Bitcoin services. If executed, these offerings could change how holders manage risk and cash needs. Big Numbers And Big Questions The projection to $200 trillion is headline-grabbing. It is a vision, not a forecast, and it hinges on major shifts in global finance and adoption. Reports note that other industry figures have offered similar long-term targets, which means the idea is not unique but remains highly debated. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|fed|rate cuts",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55782376,
    "published": 1765731655000,
    "title": "XRP Holders Labeled ‘Uneducated Perma Bulls’ By Veteran Trader – Details",
    "body": "Veteran market trader Peter Brandt has reignited debate around XRP after issuing sharp remarks about the token’s most loyal supporters. Drawing from a career that spans more than five decades, Brandt grouped XRP alongside silver when describing markets where bullish belief often holds firm despite repeated price swings and long periods of disappointment. Related Reading: Do Kwon Falls Hard — Terraform Labs Chief Gets 15 Years For Wire Fraud According to people familiar with his comments, Brandt grounded his criticism in personal trading history. He said he has handled thousands of contracts across commodities, equity benchmarks, and digital assets, and argued that the “perma bulls who I find most uneducated and biased are those who trumpet Silver and XRP,” pointing to what he sees as a pattern of investors staying bullish even when price action and broader conditions turn against them. Brandt Highlights Decades Of Experience Brandt’s tone was blunt and personal. He has a long record of public commentary, and his criticisms of XRP are part of a pattern that stretches back years. Earlier this month he called XRP supporters “obsessed” and compared their conviction to that of silver bulls. For 50 years I have traded many thousands of contracts of every commodity, stock indexes and as many cryptos as you can think of The perma bulls who I find most uneducated and biased are those who trumpet Silver and XRP — Peter Brandt (@PeterLBrandt) December 12, 2025 At times he has made bearish forecasts — including predictions that XRP would slide toward zero against Bitcoin — while at other moments he identified bullish chart patterns and set higher targets that were later hit before the market reversed. Community Pushback And Surprises Responses came fast. Zach Rector, a known figure in the XRP space, pushed back on Brandt’s view. Reports disclosed that Bitcoin maximalist YoungHoon Kim said on December 12 that he would start buying XRP — a notable shift for someone who had favored Bitcoin exclusively. Kim has claimed an IQ of 276, a detail many readers flagged as unverifiable, but it was repeated in social posts and prompted discussion. X Finance Bull accepted Brandt’s trading record but suggested that charts alone may miss broader structural moves in crypto markets. Dr. Don Woods, a self-described silver bull, joked that triple-digit returns had left him unbothered by labels of bias or ignorance. XRP: Price Context And Market Moves According to market snapshots tied to the exchanges, XRP traded above $3 at one point before slipping toward the lower end of the $2 region. Volume and broader crypto swings played parts in that move. Brandt’s critics point to that resilience as proof his calls are sometimes off. His supporters say his track record over five decades still deserves weight. Both views are in circulation, and both are being used to argue different investment cases. 10,000 XRP And The Freedom Argument Meanwhile, Edoardo Farina, founder of Alpha Lions Academy, has kept a steady bullish stance. Based on his past posts, he argued that holding 10,000 XRP could put an investor in a special position if prices rise enough. Related Reading: American Bitcoin Makes Big Buy, Adds 416 BTC To Its Stack “It’s hard to understand how free you’ll be,” he wrote in one message that was later shared widely. That claim contains no timeline or clear price targets. It is a conviction play, not a forecast built from disclosed assumptions. The differing views is part of a wider debate about bias, data, and belief in crypto. Some traders treat Brandt’s words as a warning against unchecked optimism. Others treat community pushback as evidence that XRP’s story is not settled and that broader factors — legal, regulatory, and adoption-related — could change the math. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|bitcoin|crypto|Peter Brandt|xrp|XRP Bulls|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55782373,
    "published": 1765731600000,
    "title": "Compliance, Credibility, and Consumer Trust in the New Age of Crypto ATMs",
    "body": "Bitcoin Depot’s Scott Buchanan argues that crypto ATM operators must continually strengthen their safeguards and make things safer and more transparent for users — protective actions that not only benefit individual crypto users but also bolster the market’s integrity and support its long-term growth.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Opinion|Bitcoin ATMs|Opinion",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55784857,
    "published": 1765736055000,
    "title": "Firestorm erupts in Aave governance forum over CoW Swap fees",
    "body": "Members of the Aave DAO clashed with Aave Labs, with some arguing that the company was not acting in the best interests of token holders.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]