[
  {
    "id": 54321838,
    "published": 1762983044000,
    "title": "Abundance of Catalysts Suggests XRP Price Could Take Off This Week",
    "body": "XRP is entering one of its most crucial weeks in months as a series of bullish catalysts align to set the stage for what could be a breakout move. The token has held firmly above the $2.20 support zone despite the recent market crash, and both technical and fundamental factors now point toward a possible surge in price. According to crypto analyst Guy on the Earth, XRP is in a make-or-break moment, with abundant news catalysts giving traders reasons to stay optimistic about the short-term direction. XRP Holds $2.20 Support; Analyst Eyes Resistance Ahead “Another reversal from lows as XRP holds onto the $2.20 support,” said Guy on the Earth in a recent post on X, capturing the cautious positiveness in the price of XRP. He noted that the token is currently slap bang mid-range, targeting a retest of the $2.63 to $2.72 resistance zone. Related Reading: The XRP Price Is About To Do This In November – “Get Ready” According to him, there is an abundance of positive catalysts this week, ranging from ETF speculation to the end of the ongoing government shutdown. These catalysts are very important, as XRP needs a continuation of its momentum bounce from $2.2 to target the next resistance from here; otherwise, this is a dead cat at best. The analyst emphasized that XRP’s ability to defend its key support levels will be critical in shaping its near-term trajectory. He warned that if the token revisits the $2.20 range, it may struggle to hold that level again, potentially slipping to between $1.90 and $2.00. Despite this caution, he maintained his conviction that the recent lows are already in and that XRP is gradually preparing for a range breakout to the upside. “Things are coming together for the rally we’ve been looking for,” he added, while noting that chopping around this zone is healthy before a break of the range higher. ETF Anticipation Builds Momentum For XRP A large part of this week’s optimism surrounding XRP is tied to growing speculation that a US-listed exchange-traded fund could be nearing approval. Canary Capital’s recent Form 8-A submission to the US Securities and Exchange Commission has increased expectations that the long-discussed spot XRP ETF might debut soon, possibly under the ticker “XRPC.” Related Reading: XRP Price Performance In November: History Says It’s The Most Bullish Month In History The anticipation surrounding this ETF has already begun shaping market sentiment, reflected in the steady stream of excitement from XRP supporters across social media. Traders are drawing comparisons to the rallies seen in Bitcoin and Ethereum following their respective ETF approvals, anticipating a similar influx of institutional demand if XRP’s turn arrives. At the time of writing, XRP trades at $2.41, a 2% dip in the past 24 hours. Maintaining the $2.20 support remains the key technical objective for bulls, as holding that level could pave the way for another attempt at the $2.72 resistance zone in the next few days. Featured image from Peakpx, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|bitcoin|Canary Capital|ethereum|Guy on the Earth|Ripple|US SEC|US Securities and Exchange Commission|xrp|xrp news|XRP Price|XRPC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54321990,
    "published": 1762983009000,
    "title": "IBM claims major leap toward quantum computers with new chips",
    "body": "IBM targets quantum advantage by 2026 and fault-tolerant systems by 2029 with new processors and faster error correction, advancing the race toward quantum computing.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54323032,
    "published": 1762985700000,
    "title": "Dubai Court Issues Worldwide Freeze of $456 Million Tied to Justin Sun's Stablecoin Bailout",
    "body": "A judge ordered a freeze of $456 million in assets tied to a stablecoin reserve bailout that reportedly involved Tron founder Justin Sun.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 54324163,
    "published": 1762988419000,
    "title": "Bitcoin’s Historical Liquidity Indicator Just Lit Up — Big Move Incoming?",
    "body": "According to an analyst, Bitcoin sits in a liquidity set-up that has shown up before big rallies. Prices are not shooting higher yet. At press time Bitcoin trades around $104,500, down 0.5% over the past day. Related Reading: XRP’s Next ‘Face-Melting’ Rally Could Hit Within 6 Weeks—Analyst Traders watched a decline of about 1.8% earlier that pushed the price near $103,400 and it briefly touched $102,850 during the move. Stablecoin Signal Points Toward Accumulation CryptoQuant analyst Moreno points to the Stablecoin Supply Ratio, or SSR, as the first clear indicator. The SSR compares Bitcoin’s market cap to the total market cap of stablecoins. It has dropped back into the 13 range. Based on historical readings, that 13 area has lined up with market lows in mid-2021 and at several moments across 2024. Reports show that when SSR fell to similar levels, liquidity quietly built up and buying followed after a period of low volatility. Liquidity Pattern Has Appeared Before Every Bitcoin Surge — And It’s Back “We’re witnessing a liquidity configuration that has only appeared a handful of times since 2020, and each instance marked a pivotal moment for Bitcoin’s trajectory.” – By @MorenoDV_ pic.twitter.com/vWKcCkyn55 — CryptoQuant.com (@cryptoquant_com) November 11, 2025 Binance Reserve Trends Add A Second Layer The second metric Moreno highlights comes from Binance. On that exchange, stablecoin balances are rising while Bitcoin reserves are shrinking. In plain terms: more cash-like tokens sit on the exchange and fewer coins are being held there. That pattern has appeared only a handful of times since 2020, according to the data he referenced. Each time, the movement suggested capital waiting on the sidelines and holders moving coins off exchanges into longer-term storage. Market Calm Can Hide Big Moves The current trading backdrop is cautious. Many investors expected a lift after news that the US Congress approved short-term federal funding through January 30, yet crypto did not rally with other risk assets. Some capital rotated back to stocks. At the same time, large holders took profits after recent highs, and momentum cooled. That mix shows how macro events can shift flows without immediately turning into crypto buying. Risk Still Exists — Structure Could Break Moreno warns this liquidity zone acts like a final structural support. If the metrics break down decisively, it could signal a deeper reset before any sustained recovery. In that scenario, buying would likely be delayed and volatility would rise. This is not a guaranteed outcome, but it is a clear risk that traders watch closely. Outlook: Limited Downside, Growing Upside Based on reports and on-chain signals, Moreno believes the risk-to-reward favors buyers at these levels. He points to the built-up stablecoin supply and falling exchange BTC reserves as reasons for that view. Related Reading: Could Shiba Inu Triple? Analyst Sees 200% Move Coming Historical patterns suggest the last three months of the year often bring gains for Bitcoin, but past behavior does not promise future returns. For now, the indicators show capital parked in stablecoins and fewer coins available on major exchanges. That creates a setup where fresh buying could push the market higher quickly if sentiment turns. Yet the opposite is possible: a break below these levels would reshape the cycle and force many participants to rethink positions. Markets will decide which path comes next. Featured image from Gemini, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|Bitcoin News|bitcoin|btc|btcusd|crypto|digital currency|federal reserve|liquidity|US shutdown",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54325549,
    "published": 1762991394000,
    "title": "Brazil Targets Illegal Bitcoin, Stablecoin Use Through New Proposals",
    "body": "Brazil's government and central bank are tightening rules on crypto use in targeting criminals.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54327893,
    "published": 1762996203000,
    "title": "Bitwise’s exec says 2026 will be crypto’s real bull year, here’s why",
    "body": "With crypto markets failing to meaningfully rally toward the end of 2025, this only sets up 2026 for more upside, according to Bitwise’s Matt Hougan.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54328134,
    "published": 1762996973000,
    "title": "NYSE-Listed Exodus Posts Solid Third-Quarter Lift as Bitcoin Revenue Climbs",
    "body": "Exodus posted stronger third-quarter results and unveiled a new Latin America payments acquisition as it expands its Bitcoin-driven business.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54329085,
    "published": 1762999213000,
    "title": "Uniswap (UNI) Soars 63% as ‘UNIfication’ Fee Proposal and $842M Token Burn Ignite a Frenzy",
    "body": "Uniswap (UNI) has sparked a storm across DeFi after founder Hayden Adams unveiled the long-awaited “UNIfication” proposal, a sweeping governance overhaul that introduces protocol fees, a substantial $842 million token burn, and a strategic buyback plan. Related Reading: XRP’s Next ‘Face-Melting’ Rally Could Hit Within 6 Weeks—Analyst The move marks Uniswap’s biggest reform since its 2020 token launch, designed to transform UNI from a passive governance token into a deflationary, yield-generating asset. Under the proposal, 0.3% of all trading volume will now be split between liquidity providers (0.25%) and a UNI buyback pool (0.05%), creating continuous demand for the token. With over $1 trillion in annualized trading volume, analysts project roughly $38 million in monthly buybacks, about $450 million annually. Whales Accumulate as Uniswap (UNI) Skyrockets 63% The market reaction was explosive. Uniswap (UNI) surged by over 63% in one week, peaking at $10 before stabilizing around $8.57. On-chain data from Santiment shows rising whale accumulation and a steady increase in UNI held outside of exchanges, indicating long-term investor confidence. BitMEX founder Arthur Hayes reportedly purchased $244,000 worth of UNI, joining institutional buyers positioning for a supply shock. CryptoQuant CEO Ki Young Ju predicted that if protocol fees remain active, annual burns could exceed $500 million, drastically tightening supply. “Even with unlocks, a UNI supply shock seems inevitable,” Ju noted. The rally also extended to other DeFi assets, such as AAVE, Synthetix, and Compound, as traders speculated that Uniswap’s model could set a new standard for protocol-owned liquidity and value distribution. UNI's price trends to the upside on the daily chart. Source: UNIUSD on Tradingview UNIfication Ushers in the Next Era of DeFi Governance Beyond tokenomics, UNIfication unites Uniswap Labs, the Foundation, and the Unichain L2 network under one ecosystem. The proposal eliminates interface fees, introduces fee discount auctions to enhance LP returns, and compensates governance delegates, turning Uniswap’s decision-making into a professionalized, revenue-sharing system. Adams emphasized that the initiative represents more than a technical upgrade, it’s a cultural shift. “Uniswap can be the primary place tokens are traded globally,” he said. “This proposal ends a restrictive chapter and begins the decade of Uniswap.” Related Reading: Ethereum Ready To Explode To $12,000 By January, Says Tom Lee With UNI up more than 66% this week and investors anticipating formal governance approval, the DeFi giant appears poised to reclaim its dominance as crypto’s flagship decentralized exchange. Cover image from ChatGPT, UNIUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Uniswap|UNI|UNI price|uniusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 53,
        "NAME": "UNI",
        "CATEGORY": "UNI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54329647,
    "published": 1763000346000,
    "title": "Bitcoin Drops Again After Failed Recovery — $100K Support Now in Focus",
    "body": "Bitcoin price failed to recover above $105,000. BTC is trimming gains and might could continue to move down if it trades below $101,200. Bitcoin started a fresh decline after it failed to clear $105,500. The price is trading below $105,000 and the 100 hourly Simple moving average. There is a bearish trend line forming with resistance at $103,300 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move down if it settles below the $101,200 zone. Bitcoin Price Dips Further Bitcoin price failed to stay in a positive zone above the $105,500 pivot level. BTC bears remained active below $105,500 and pushed the price lower. The last swing high was formed at $107,400 before the price started a fresh decline. There was a drop below the $105,000 and $104,000 levels. The price dipped below the 61.8% Fib retracement level of the upward move from the $99,220 swing low to the $107,400 high. Bitcoin is now trading below $104,000 and the 100 hourly Simple moving average . Besides, there is a bearish trend line forming with resistance at $103,300 on the hourly chart of the BTC/USD pair. If the bulls attempt another recovery wave, the price could face resistance near the $102,500 level. The first key resistance is near the $103,250 level and the trend line. The next resistance could be $103,500. A close above the $103,500 resistance might send the price further higher. In the stated case, the price could rise and test the $105,000 resistance. Any more gains might send the price toward the $105,500 level. The next barrier for the bulls could be $106,800 and $107,000. More Losses In BTC? If Bitcoin fails to rise above the $103,500 resistance zone, it could start another decline. Immediate support is near the $101,200 level and the 76.4% Fib retracement level of the upward move from the $99,220 swing low to the $107,400 high. The first major support is near the $100,500 level. The next support is now near the $100,000 zone. Any more losses might send the price toward the $98,800 support in the near term. The main support sits at $96,500, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $101,200, followed by $100,500. Major Resistance Levels – $103,250 and $103,500.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54329682,
    "published": 1763000337000,
    "title": "Tokenization demand is no longer tied to Bitcoin: Galaxy executive",
    "body": "Galaxy tokenization head Thomas Cowan says interest in tokenization is now “independent of the price of Bitcoin” as institutions have started to see the benefits.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54330759,
    "published": 1763002848000,
    "title": "Ethereum Whale Adds $105M To His ETH Position – $1.33B Bought Since Nov 4",
    "body": "Ethereum has entered a consolidation phase following a turbulent period of selling pressure driven by macroeconomic uncertainty and market fear surrounding the US government shutdown. Over the past week, Ethereum’s price has stabilized around the $3,500 level after briefly dipping below key supports, as traders and institutions reassess risk exposure across the crypto market. Related Reading: Bitcoin STH-MVRV Rebounds From Local Low – Potential Recovery Toward $115K–$120K Despite the cautious sentiment, on-chain data reveals a contrasting story — large holders, or “whales,” are quietly accumulating ETH during the downturn. According to data from Lookonchain and CryptoQuant, several high-value wallets have increased their Ethereum positions significantly, signaling growing confidence among long-term investors even as broader market momentum slows. This accumulation phase suggests that sophisticated players view current price levels as an opportunity rather than a sign of broader weakness. Historically, similar patterns of whale buying during macro uncertainty have preceded periods of recovery and renewed market strength. Whale Activity Suggests Strategic Accumulation Despite Market Uncertainty According to data from Lookonchain, a whale known for aggressive Ethereum accumulation has just purchased an additional 30,548 ETH ($105.36 million) within the past hour. This move brings his total acquisitions since November 4 to an astonishing 385,718 ETH, worth roughly $1.33 billion. Notably, around $270 million of the funds used for these purchases were borrowed from the decentralized lending platform Aave, highlighting a highly leveraged but strategic positioning. This type of activity often signals strong institutional confidence in Ethereum’s medium-term outlook. Borrowing large sums to accumulate ETH indicates that the whale expects price appreciation substantial enough to offset borrowing costs and volatility risks. It also reflects growing demand for Ethereum exposure within decentralized finance (DeFi), where whales utilize platforms like Aave to optimize capital efficiency. Such large-scale buying can have multiple implications: it absorbs available market liquidity, strengthens psychological support zones, and may trigger a sentiment shift among retail investors who interpret the move as bullish. However, it also introduces potential short-term risk — if prices correct further, leveraged positions could amplify volatility. Overall, the data points toward renewed accumulation momentum, suggesting that sophisticated market participants are positioning for Ethereum’s next major move. Related Reading: Uniswap Founder Submits Governance Proposal To Burn UNI — Token Jumps 50% Bulls Attempt to Reclaim Momentum Ethereum (ETH) is currently showing signs of stabilization after weeks of intense selling pressure, trading around $3,479 at the time of writing. The daily chart shows ETH holding just above the 200-day moving average (red line) — a key long-term support level that has historically acted as a launch point for bullish recoveries. After dipping below $3,200 earlier in the week, Ethereum bounced strongly, supported by renewed whale accumulation and improving market sentiment. However, the 50-day (blue) and 100-day (green) moving averages remain above the current price, indicating that the short-term trend is still tilted to the downside. For bulls to regain control, ETH needs to close decisively above $3,650–$3,700, where a confluence of resistance sits. Related Reading: Ethereum Trading Volume On Binance Surpasses $6 Trillion: A Speculative Frenzy Unfolds Volume data suggests that selling pressure is gradually fading, but momentum remains weak. If Ethereum fails to maintain the $3,400–$3,450 zone, the next major support lies near $3,200. On the upside, reclaiming the $3,700 mark could open the door to a recovery toward $4,000. Overall, Ethereum appears to be in a consolidation phase, with large holders accumulating while retail traders remain cautious — a structure that often precedes a stronger directional move. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ethereum|Ethereum accumulation|Ethereum Analysis|ethereum news|Ethereum Price analysis|Ethereum Whale|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54330952,
    "published": 1763003303000,
    "title": "Ethereum Slips After Rebound, Struggling to Keep Momentum Above $3,500",
    "body": "Ethereum price failed to stay above $3,550. ETH is trimming gains and might decline further if it dips below the $3,350 support. Ethereum started a fresh decline after it failed to stay above $3,550. The price is trading below $3,500 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance at $3,550 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move down if it settles below the $3,350 zone. Ethereum Price Dips Further Ethereum price failed to continue higher above $3,650 and started a fresh decline, like Bitcoin . ETH price dipped below $3,550 and entered a short-term bearish zone. The decline gathered pace below $3,500 and the price dipped below the 50% Fib retracement level of the upward move from the $3,176 swing low to the $3,658 high. Ethereum price is now trading below $3,550 and the 100-hourly Simple Moving Average . If there is another recovery wave, the price could face resistance near the $3,475 level. The next key resistance is near the $3,500 level. The first major resistance is near the $3,550 level. There is also a key bearish trend line forming with resistance at $3,550 on the hourly chart of ETH/USD. A clear move above the $3,550 resistance might send the price toward the $3,650 resistance. An upside break above the $3,650 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $3,800 resistance zone or even $3,880 in the near term. More Losses In ETH? If Ethereum fails to clear the $3,500 resistance, it could start a fresh decline. Initial support on the downside is near the $3,400 level. The first major support sits near the $3,360 zone and the 61.8% Fib retracement level of the upward move from the $3,176 swing low to the $3,658 high. A clear move below the $3,360 support might push the price toward the $3,280 support. Any more losses might send the price toward the $3,240 region in the near term. The next key support sits at $3,220 and $3,200. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI – The RSI for ETH/USD is now below the 50 zone. Major Support Level – $3,360 Major Resistance Level – $3,550",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54331863,
    "published": 1763005261000,
    "title": "Bitcoin Cash Gains 1.9% to $518 Breaking Key Resistance",
    "body": "Technical breakout drives BCH higher as institutional accumulation emerges above $515 support",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Technical Analysis|Bitcoin Cash|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 12,
        "NAME": "BCH",
        "CATEGORY": "BCH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54331793,
    "published": 1763005068000,
    "title": "Jobs Data Blackout to Muddy Bitcoin's Macro Read as U.S. Shutdown Comes to a Close",
    "body": "Even as the shutdown ends, the loss of October’s inflation data has left investors without a key read on price pressures heading into year-end.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54332608,
    "published": 1763006916000,
    "title": "Australia Warns Criminals Are Abusing National Cybercrime Platform to Drain Crypto Wallets",
    "body": "Police have urged vigilance, saying Australians should “check for warning signs, and protect themselves from cybercrime.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54333936,
    "published": 1763010039000,
    "title": "Dogecoin Alert! Price Could Explode Over 2,800%, Analyst Says",
    "body": "According to market reports, crypto analyst Crypto Patel has put forward bold targets for Dogecoin, saying the memecoin could reach $2 and $5 this cycle. Related Reading: XRP Has Held Its Ground As Most Altcoins Fall, Market Observers Say At the time of his post, DOGE was trading around $0.17, making those estimates equal to roughly 1,076% and over 2,800% gains from that level. The call has drawn attention because it ties price hopes to repeating chart behavior rather than fresh fundamentals. Chart Patterns And Historical Runs According to the analyst’s charts, DOGE has formed a long-running descending triangle since its $0.75 peak in 2021. Traders are being shown a breakout followed by a retest pattern. Reports point to similar setups in past rallies: in 2017 DOGE moved from about $0.00022 to $0.019 — roughly 9,800% — and in 2021 it climbed from about $0.0025 to $0.75, a surge of over 32,000%. Those runs are the basis for the “fractal confluence” argument that history could repeat. DOGECOIN READY FOR ITS NEXT HISTORIC MEGA RUN 🚀 Breakout ✅ Retest ✅ Structure locked and loaded for a parabolic explosion! The same pattern that sent $DOGE flying in 2017, 2021 is repeating again on the monthly timeframe and this time, the move looks even more powerful.… pic.twitter.com/yZIFHthnm5 — Crypto Patel (@CryptoPatel) November 11, 2025 A Recent Breakout, Retest Highlighted As Trigger Based on reports, DOGE cleared the triangle in December 2024 during a US President Donald Trump-led crypto market boom, pushing above $0.48. The coin then came back to test the former trendline, which some traders call a normal step after a breakout. Other analysts have flagged similarities between today’s action and the token’s early bull runs, and some see that as confirmation for more upside. Short-Term Indicators Looking Up Technical numbers show a nearer-term forecast of a rise of 13.51% to $0.2002 by December 12, 2025. Current readings described by data providers list sentiment as Bearish and the Fear & Greed Index at 20 (Fear). Over the last 30 days DOGE had 13/30 (43%) green days and about 6.71% price volatility. Those numbers suggest that, for now, traders remain cautious even as longer-term charts are cited as bullish. Bitwise DOGE ETF Reports note that Bitwise moved forward with a DOGE ETF filing under Section 8(a) using CF Benchmarks’ settlement price, an action that could draw institutional interest if it progresses. Related Reading: XRP’s Next ‘Face-Melting’ Rally Could Hit Within 6 Weeks—Analyst Meanwhile, on-chain snapshots indicate that large holders are trimming supply, while retail activity has ticked up and some momentum indicators have turned higher. According to Bitwise, its fund would use the CF DOGE-Dollar Settlement Price from CF Benchmarks to calculate net asset value, which provides transparent, rules-based pricing across venues. If approved, this structure could make DOGE more accessible to institutions needing a regulated vehicle, potentially boosting order book depth and easing inflows or outflows. This increased access, combined with clearer pricing, could explain the recent movements in the market value of DOGE. Featured image from Gemini, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|altcoins|bitcoin|bitwise|crypto|doge|etf|memecoin",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54334687,
    "published": 1763011601000,
    "title": "XRP Moves 3% as Ripple-Linked Token's ETF to Go Live at U.S. Market Open",
    "body": "Token rallies through key resistance with 31% volume surge as Nasdaq certifies first U.S. spot XRP ETF",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54334661,
    "published": 1762996203000,
    "title": "Bitwise exec says 2026 will be crypto’s real bull year; here’s why",
    "body": "With crypto markets failing to meaningfully rally toward the end of 2025, it only sets up 2026 for more upside, according to Bitwise’s Matt Hougan.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54335645,
    "published": 1763013619000,
    "title": "SEC Chair Sets Out Plans For Crypto Taxonomy To Define Digital Asset Classification",
    "body": "In recent statements made by Chair Paul Atkins, the US Securities and Exchange Commission (SEC) announced a strategic plan targeted at giving much-needed clarity on the classification of crypto assets. Howey Test And Token Taxonomy In Crypto Atkins highlighted the forthcoming consideration of establishing a “token taxonomy” within the Commission, a structured framework rooted in legal rationale to discern between securities and commodities. He emphasized the importance of adhering to “limiting principles” in laws and regulations to ensure a cohesive approach towards crypto asset classification. Related Reading: Bitcoin To Bottom Out In 300 Days: Top Expert Forecasts $38,000 To $50,000 Price Point Atkins commended the efforts of Commissioner Hester Peirce, particularly her work in providing a transparent and economically grounded treatment of crypto assets under federal securities laws. The Chair emphasized three key themes in his address: the significance of a clear token taxonomy, the application of the Howey test in recognizing the temporary nature of investment contracts, and the practical implications for innovators, intermediaries, and investors in the evolving crypto landscape. Addressing the prevalent issue of distinguishing between securities and non-securities in the crypto space, Atkins noted that while most tokens are not inherently securities, certain tokens may have been sold within the context of an investment contract during a securities offering. However, he refuted the notion that every token involved in an investment contract perpetually retains its security status, emphasizing the importance of contextual analysis and recognizing the dynamic nature of investment contracts. Atkins Pledges Support For Evolving Digital Asset Laws In his remarks, Atkins also underscored the challenges faced by developers, exchanges, custodians, and investors in navigating the crypto ecosystem, where tokens serve various functions beyond traditional securities. He criticized the previous administration’s “blanket treatment” of all tokens as securities, highlighting the need for a more nuanced and practical approach to regulation to prevent stifling innovation and driving it offshore. Related Reading: China’s Cybersecurity Agency Alleges US Government Stole $13 Billion In Bitcoin In alignment with ongoing legislative efforts, Atkins reassured that the SEC aims to complement, rather than replace, existing crypto legislative initiatives. He emphasized the agency’s commitment to robust fraud enforcement and the development of clearer regulatory guidelines to ensure the safety of US investors. In closing, Atkins emphasized the importance of forward-looking regulatory practices, rejecting a stagnant approach rooted in fear of change. He reiterated the SEC’s commitment to delineating clear boundaries and providing transparent guidance. The statement concluded: That is what Project Crypto is about. That is what the Commission should be about. And that is the commitment I make to you today as Chairman: we will not let fear of the future trap us in the past. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto|crypto market|crypto news|cryptocurrency|US crypto news|US crypto regulation|US Securities and Exchange Commission",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54335716,
    "published": 1763009381000,
    "title": "US shutdown ends, crypto progress resumes as Trump signs bill",
    "body": "US President Donald Trump signed the bill ending the record 43-day government shutdown and resuming federal operations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54336028,
    "published": 1763014112000,
    "title": "Canary Capital files for MOG ETF, boosting the little-known memecoin",
    "body": "The memecoin Mog Coin saw a slight lift in its price on Wednesday after Canary Capital filed to launch an ETF tracking the token.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 185,
        "NAME": "MOG",
        "CATEGORY": "MOG"
      }
    ]
  },
  {
    "id": 54337361,
    "published": 1763017211000,
    "title": "Winklevoss Twins Back Zcash (ZEC) Treasury Company With $58M Investment",
    "body": "Following the recent comeback of privacy-focused cryptocurrencies, Cypherpunk Technologies has launched a $50 million Zcash (ZEC) treasury strategy backed by Winklevoss Capital. Related Reading: SUI Eyes Key Retest As Price Breaks Out Of Downtrend – Rally To $3 Ahead? Cypherpunk Technologies Launches Zcash DAT On Wednesday, Leap Therapeutics announced the official launch of its Zcash Digital Asset Treasury (DAT) strategy and rebrand to Cypherpunk Technologies. The biotech company previously revealed that it had closed a $58.88 million private placement in October, led by Winklevoss Capital, as part of its plan to expand to the digital assets sector. The company currently holds 1.25% of the current ZEC supply after acquiring 203,775 ZEC at an aggregate purchase price of approximately $50 million, or $245.37 per token. Cypherpunk Technologies will reportedly continue to accumulate Zcash to own at least 5% of the total ZEC supply. The Company believes that privacy-protecting assets and related technologies will be critical in an increasingly digital world. The Company intends to acquire and hold ZEC, the native coin of Zcash, as its primary digital asset and to be an active participant in the Zcash community. Douglas E. Onsi, President and CEO of Cypherpunk Technologies, asserted that “This past month has been transformative for the Company, marked by closing a $58.88 million private placement led by Winklevoss Capital and successfully deploying $50 million to build a digital asset treasury designed to create long-term shareholder value focused on active participation in the development of Zcash and acquiring ZEC.” Per the announcement, the company will begin trading on Nasdaq under the new CYPH ticker on Thursday, November 13. Meanwhile, its ongoing cancer research and development operations will continue under a subsidiary that will take the Leap Therapeutics name. Winklevoss Twins Back ‘Encrypted Bitcoin’ In an X post, Gemini’s co-founder, Tyler Winklevoss, explained the reasons behind Winklevoss Capital’s investment in Cypherpunk Technologies, emphasizing the importance of supporting privacy and self-sovereignty in the online era. “Privacy is the precondition for many of our freedoms. It’s the point at which government and corporate reach end and our individual freedoms and self-sovereignty begin. As our lives have moved online, privacy’s become a rare, vanishing commodity,” the post reads. Winklevoss highlighted Zcash’s “highly symbiotic relationship” with Bitcoin since its launch nine years ago, affirming that, “If bitcoin is digital gold, Zcash is encrypted bitcoin, or digital cash.” One is your store of value, the other is how you privately move your value. We’ve been tracking this symbiosis for years and believe that now — as we enter the age of AI — is the right time to begin accumulating ZEC. Gemini’s co-founder also argued that Zcash could capture “a meaningful percentage” of BTC’s market capitalization, which he has predicted will surge to $1 million per BTC over the next 5-10years. Therefore, he believes that “Zcash will appreciate significantly from here as well.” Related Reading: Ethereum (ETH) Reclaims $3,500 Amid Market Rebound, Analysts Forecast December Take-Off It’s worth noting that Zcash has recorded a parabolic rally since September, surging 1,775% to its all-time high (ATH) of $750 last Friday. Since then, the cryptocurrency has followed the market’s correction, dropping over 40% to the $420 area before recovering. As of this writing, Zcash is trading at $507, a 15% increase in the daily timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|btc|crypto market|Cypherpunk Technologies|Winklevoss Capital|winklevoss twins|ZCash|Zcash parabolic rally|Zcash Price|Zcash Treasury Company|ZEC|ZEC rally|ZECUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54337082,
    "published": 1763016525000,
    "title": "Peak Degen Warfare? Alleged POPCAT Manipulation Hits Hyperliquid with $4.9M Loss",
    "body": "Hyperliquid reportedly took a bad debt of $4.9 million due to alleged POPCAT manipulation.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Hyperliquid|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54337540,
    "published": 1763017621000,
    "title": "BREAKING – Crypto Markets Cheer As Trump Signs Bill Ending Gov’t Shutdown",
    "body": "United States President Donald Trump late Wednesday signed legislation that ended the country’s 43-day government shutdown, reopening federal agencies and restarting paused services after what had become the longest shutdown in modern history. Reports have disclosed the measure passed both houses this week and moves quickly to restore pay and services. Related Reading: Dogecoin Alert! Price Could Explode Over 2,800%, Analyst Says Funding Push Restores Pay And Services According to official House materials, the measure passed the House by a 222–209 vote and carries continuing appropriations that fund agencies through January 30, 2026. The bill covers several full-year appropriations and aims to return back pay to hundreds of thousands of federal workers who were furloughed or forced to work without pay. President Trump signs bill to OFFICIALLY reopen the government, ending the Democrat Shutdown. Let’s get our country WORKING again. 🇺🇸 pic.twitter.com/QJqX90k9sC — The White House (@WhiteHouse) November 13, 2025 Markets Liked The Certainty Risk assets jumped as lawmakers moved to end the standoff. Reports have disclosed Bitcoin climbed back toward the $105,000 area after the breakthrough, while broader crypto tokens also showed gains as traders priced in the reduction of fiscal uncertainty. Short, sharp moves in the market reflected traders unwinding defensive positions. Crypto Reaction In Numbers Bitcoin rose from lows near $99,300 earlier in the week to above $105,000 on news of progress, a move that some outlets measured as a roughly 6.7% uptick over recent sessions. Ethereum recovered toward about $3,600 as investors rotated back into riskier assets. These moves came alongside rallies in stocks and other risk markets. Based on reports from market commentators, the end of the shutdown reduced one layer of macro uncertainty. That made it easier for large funds and ETFs to move money without the risk of sudden policy disruption. Some short-term flows into crypto appear tied to renewed confidence that key infrastructure — like air travel and federal programs — will run normally again. Political Fallout And Next Steps Lawmakers from both parties have already signaled new fights ahead, with pressure to address policy items that were left out of the funding package. The White House framed the outcome as a win for governance, while critics said parts of the deal leave important programs and protections unresolved. Related Reading: XRP Has Held Its Ground As Most Altcoins Fall, Market Observers Say Market Watchers Offer Caution While the immediate market reaction was positive, several analysts warned that gains tied to the shutdown’s end could be temporary. Volatility may return if political gridlock reemerges or if technical resistance levels hold for major tokens. The buying seen on the reopening was broad, but not unanimous, and many traders are watching whether flows remain steady into year-end. Featured image from ABC News, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|crypto|digital currency|shutdown|Trump",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54338089,
    "published": 1763018492000,
    "title": "How Ripple plans to bridge crypto and Wall Street in its $4B expansion",
    "body": "Ripple bundles custody, prime brokerage, treasury and stablecoins so institutions can operate like banks with crypto rails.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54339123,
    "published": 1763020838000,
    "title": "$30M Manipulation On Hyperliquid: The POPCAT Connection And What You Need To Know",
    "body": "Memecoin POPCAT experienced a significant downturn on Wednesday following a major manipulation event on Hyperliquid (HYPE), one of the leading decentralized exchanges in the cryptocurrency market. POPCAT Faces 43% Drop Following Manipulative Scheme According to a detailed analysis of the situation by DeFi researcher Hanzo on social media site X (previously Twitter), an unknown trader executed a well-coordinated strategy approximately 13 hours prior to the market disruption. The trader withdrew $3 million in USDC from the OKX exchange and distributed the funds across 19 different wallets on Hyperliquid. Subsequently, they initiated sizable long positions on POPCAT, accumulating total exposure estimated between $20 million and $30 million. Related Reading: Bitcoin To Bottom Out In 300 Days: Top Expert Forecasts $38,000 To $50,000 Price Point To create an illusion of demand for the memecoin, the trader placed a massive buy wall at the price point of $0.21, with orders totaling $30 million lined up on the order book. This artificial façade of high buying interest successfully attracted real traders, prompting them to jump on the bandwagon and increase their own buying activity. However, the situation took a swift turn when the trader removed the buy wall without warning, leading to an instantaneous collapse in the price of POPCAT. This shift resulted in the liquidation of all the long positions taken by traders. The unknown trader lost their $3 million collateral, while Hyperliquid’s HLP system automatically absorbed the open positions. This action triggered an additional loss of approximately $4.9 million to the HLP, exacerbating a broader market selloff across the token. Hyperliquid Faces Third Major Disruption This Year In the wake of the incident, the Hyperliquid team took emergency measures to stabilize the market and close any remaining exposures. Shortly after, the platform paused its Arbitrum (ARB) bridge, although it continued processing deposits and withdrawals normally. The community has expressed skepticism regarding the circumstances surrounding this incident, with many suggesting it may not have been a random liquidation. Instead, some believe the event could resemble a deliberate stress test or an attack aimed at destabilizing Hyperliquid’s liquidity system. Some contend that the rapid loss of millions in such a short time frame seems too calculated to be merely coincidental. Related Reading: China’s Cybersecurity Agency Alleges US Government Stole $13 Billion In Bitcoin This incident marks the third major market disruption on Hyperliquid in 2025, raising serious questions about the exchange’s approach to handling liquidity concentration and its systemic risk management practices, as noted by Hanzo in his analysis. Following the manipulation, the POPCAT memecoin saw a steep decline of approximately 43%, dropping from $0.21 to $0.12, with total liquidations reaching around $63 million. The decentralized exchange’s native token, HYPE, also declined significantly following the event. According to CoinGecko data, it is currently trading at $38.25, which is a 7% decrease on the weekly timeframe. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto news|HYPE price|Hyperliquid|Hyperliquid (HYPE)|Hyperliquid manipulation|Hyperliquid news|HYPEUSDT|POPCAT|Popcat news|Popcat price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 71,
        "NAME": "ARB",
        "CATEGORY": "ARB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54338983,
    "published": 1763020268000,
    "title": "Tokyo exchange operator eyes crackdown on Bitcoin-holding firms after DAT rout",
    "body": "Metaplanet CEO Simon Gerovich said JPX’s concerns are with companies that feature poor approvals and insisted the critique doesn’t apply to them.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      }
    ]
  },
  {
    "id": 54341724,
    "published": 1763026242000,
    "title": "Will The Shiba Inu Price Hit A New All-Time High In 2025? Machine Learning Algorithm Answers",
    "body": "The Shiba Inu price and its trajectory over the last few months have been a source of growing concerns for SHIB investors as the meme coin has failed to secure any meaningful recovery. Despite the Bitcoin price rallying, Shiba Inu has remained quite muted, failing to reach new all-time highs through the bull rally. Therefore, with only two months left in the year 2025, the question remains as to whether the Shiba Inu price can still rally to new all-time highs. Machine Learning Algorithm Predicts Shiba Inu Price Trajectory The machine learning algorithm at the Coincodex website has shown a trajectory for the Shiba Inu price that suggests that the meme coin is destined for more sideways action this year. The prediction for the new year is that the meme coin will continue to trade in a very tight range. Related Reading: Institutions Have Been Buying Solana Every Day For 2 Weeks, Is $300 Possible? Even with the Shiba Inu price currently trending more than 88% below its all-time high from 2021, the machine learning algorithm does not see it bouncing anytime soon. For the rest of the year, the cryptocurrency is expected to trade under $0.000012. This puts it in the tight range of $0.00001-$0.000012. Interestingly, though, the same way the machine learning algorithm has predicted no increase, there is no expectation of a decline. The trajectory of the SHIB price over the next two months shows an almost straight line, and then continues into the year 2026 in the same manner. When Will SHIB Hit New All-Time Highs? According to the machine learning algorithm, SHIB investors awaiting the meme coin to hit a new all-time high have a long wait ahead of them. The long-term prediction suggests that the Shiba Inu price will not hit a new all-time high in the next decade. Related Reading: Dogecoin Price Rally Above $0.74 ATHs In The Works As HTF Trend Holds This long-term prediction moves through the next three decades, going all the way into the year 2050, and yet Sh. For most of the time, the algorithm suggests that the cryptocurrency will only see double-digit growth for each year over the next couple of years. Interestingly, historical data also support muted performance for the Shiba Inu price for the rest of the year. CryptoRank website shows an average return of 0.31% for SHIB for the month of November and -9.84% for the month of December. If these hold, then it means that the SHIB price is more likely to decline than recover as the year moves toward an end. Featured image from Dall.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Shiba Inu|SHIB|SHIB news|SHIB price|Shiba Inu news|Shiba Inu Price|SHIBUSD|SHIBUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 44,
        "NAME": "SHIB",
        "CATEGORY": "SHIB"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54341646,
    "published": 1763025971000,
    "title": "Community expects the first US spot XRP ETF to launch on Thursday",
    "body": "Analysts suggest Canary Capital’s spot XRP ETF could go live today, even as formal approval by the SEC is still technically pending.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54342121,
    "published": 1763026800000,
    "title": "Trader torches $3M to punch a $5M hole in Hyperliquid’s vault",
    "body": "A community member called the $3 million wipeout “performance art,” saying that only in crypto do villains torch millions purely for the sake of the plot.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54341950,
    "published": 1763025971000,
    "title": "Community expects the first US spot XRP ETF to launch on Thursday",
    "body": "Analysts suggest Canary Capital’s spot XRP ETF could go live even as formal approval by the SEC is still technically pending.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54343980,
    "published": 1763030668000,
    "title": "Best Altcoins to Watch as Solana Whales Start Buying",
    "body": "What to Know: Solana’s order books show renewed whale demand while spot $SOL ETFs log a multi-day inflow streak, reinforcing risk appetite. SoFi’s crypto rollout adds a mainstream on-ramp for US retail, a structural tailwind for altcoin participation. Bitcoin Hyper ($HYPER), Best Wallet Token ($BEST), and SPX6900 ($SPX) align with throughput, utility, and liquidity narratives that typically lead early in rotations. Solana just lit up the order books. Fresh ‘smart money’ buy walls and block-sized prints show whales leaning in, with net spot inflows building across top venues. The flow tells a simple story: big players are scaling bids into weakness and front-running a potential trend shift. The backdrop helps. Spot Solana ETFs have now chalked up 10 straight days of net inflows , a rare streak during a choppy week for majors. That run, led by Bitwise’s $SOL fund, pushes the narrative toward persistent demand and strengthens the case for an alt rotation if risk stabilizes. Retail rails are opening too. SoFi Bank has rolled out in-app crypto trading to its millions of customers, becoming the first nationally chartered US bank to offer crypto buying and selling – with Bitcoin, Ethereum, and Solana at the forefront. Easier fiat on-ramps plus ETF flows and whale accumulation is the kind of three-piece puzzle that often precedes a broader alt rally. With that macro tailwind in mind, three tokens stand out due to their fundamentals and timing – two presales riding clear narratives and one listed memecoin with heavyweight liquidity. It’s a focused watchlist for anyone scouting the best altcoins to watch into the year-end. 1. Bitcoin Hyper ($HYPER) – BTC L2 Built With SVM Speed Bitcoin Hyper ($HYPER) takes a direct swing at the oldest pain point in crypto: slow and expensive $BTC transactions that negatively impact the ecosystem’s scalability. The design funnels transactions to a Bitcoin-settled Layer 2 and uses the Solana Virtual Machine for high throughput execution. The result aims for near-instant finality, ZK-assisted validity, and periodic L1 commitments to keep security anchored to Bitcoin. That’s serious design space for payments, dApps and even meme coins, with $BTC as the settlement bedrock. If $SOL ETF inflows are a proxy for demand for high-speed chains, then a Bitcoin-secured L2 using SVM could capture overflow interest from developers and traders looking for $BTC-native performance. Timing and numbers matter in presales. The token is priced at $0.013265 with the presale sitting at $26.99M raised. Based on the presale’s performance and Hyper’s utility proposition, a realistic price prediction for $HYPER puts it at $0.08625 by the end of 2026 and $0.253 by 2030. From today’s prices, these numbers translate into an ROI of 550% and 1,807% respectively. Given that Hyper targets a Q4 2025 – Q1 2026 release window, the earlier you join the $HYPER train, the better. Make sure you read our guide on how to buy $HYPER first. Visit the official presale page and buy your $HYPER today. 2. Best Wallet Token ($BEST) – Utility-First Wallet Ecosystem Token $BEST is the native token for Best Wallet , a non-custodial, multi-chain wallet aiming to turn power-user features into default settings. Think cross-chain swaps via an autorouter across 300+ DEXs and 30 bridges, MPC security without seed phrases, real-world spending with the upcoming crypto card, and a token launchpad baked into the app. The token links to fee reductions, access, and ecosystem rewards across features that already map to daily crypto usage. Presale mechanics are straightforward. The token is live at $0.025935 with more than $17M raised. Our price prediction for $BEST outlines a potential 2026 high near $0.05106175, representing 96% gains. For a wallet token, utility density is the tell – on-ramp integrations, multi-chain coverage, and soon, in-app staking partners build a clear reason to hold through volatility. The tie-in to today’s flow: SoFi’s crypto rollout and $SOL ETF traction could nudge casual users to seek simple, secure self-custody with swap and bridge UX done right. $BEST plugs that gap natively. If you want in, make sure you read our guide on how to buy $BEST first. Then visit the presale page and buy your $BEST today. 3. SPX6900 ($SPX) – Meme Liquidity With Big-Cap Exchange Reach SPX6900 ($SPX) is a culture-driven meme asset with multi-chain reach and a simple message: internet-scale community meets exchange-grade liquidity. The token’s market cap sits above $615M, with $SPX sitting at $0.6609. As attention rotates, high-beta meme names with deep order books often act as liquidity barometers. They move first, they move fast, and they draw flow. Crucially, $SPX trades on Coinbase , which tends to boost retail access and tightens spreads for US users. That exchange reach matters when volatility returns and users want instant fills on familiar apps. Recent Coinbase pages and converters reflect live SPX markets and volumes on the platform, while aggregators show additional venues and pairs. If ETF and banking rails keep onboarding newcomers, liquid memes like $SPX can catch outsized bursts. And talking about bursts, $SPX showcases an all-time ROI of 25M%, which is literally a wealth-building performance. So, go to your favorite exchange and buy your $SPX today. Recap: Whales are scaling into $SOL, spot ETFs keep stacking inflows, and SoFi’s launch opens a bank-grade retail door. In that setup, Bitcoin Hyper ($HYPER) , Best Wallet Token ($BEST) , and SPX6900 ($SPX) each tap a live narrative – $BTC-secured speed, wallet-centric utility, and meme liquidity with top exchange access. This isn’t financial advice. Do your own research before investing. Authored by Aaron Walker, NewsBTC: www.newsbtc.com/news/best-altcoins-to-watch-as-solana-whales-start-accumulating",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54344857,
    "published": 1763032175000,
    "title": "Scammers posed as Australian police to steal crypto, AFP warns",
    "body": "Scammers in Australia impersonated police using the government’s own ReportCyber system to legitimize their calls and trick victims into handing over crypto.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54344585,
    "published": 1763031906000,
    "title": "Next Crypto to Explode? Bitcoin Hyper Could Change Bitcoin with L2 Tech",
    "body": "What to Know: Bitcoin’s constraints on throughput and programmability cap mainstream utility. A performant L2 with Bitcoin settlement is the logical unlock. Bitcoin Hyper pairs SVM-speed execution with ZK-verified settlement on Bitcoin, targeting fast, low-cost transactions and DeFi. The $HYPER presale is nearing $27M raised, signaling strong interest ahead of mainnet milestones and initial listings. Using the current $0.013265 price, our forecast for $HYPER goes to a 1.9x high in 2025 and 6.5x in 2026 if roadmaps land. Bitcoin still moves like a freight train: unstoppable over distance, painfully slow up close. Block space is scarce, fees spike when demand pops, and native programmability is minimal. That leaves everyday payments clunky and DeFi on Bitcoin mostly stitched together with workarounds. Those constraints are tolerable for a store-of-value narrative. They’re a drag on mainstream utility. For reference, Bitcoin ranks 22nd among the fastest blockchains by TPS, which is far below industry standards. Solana ranks second on the same list. Layer-2 solutions are the obvious release valve. Payment channels handle throughput but struggle with complex logic and liquidity routing. Sidechains help, then trade off security assumptions. The real unlock is an L2 that processes high-throughput transactions and settles back to L1 with strong guarantees. Builders get speed and programmability. Users get cheaper, near-instant finality without abandoning the Bitcoin security umbrella. This is the gap Bitcoin Hyper ($HYPER) is trying to close. The project proposes an L2 architecture that batches transactions, uses zero-knowledge proofs for validity, and periodically commits state to Bitcoin. Execution rides on a Solana-style virtual machine for throughput, with a canonical bridge to move $BTC in and out trustlessly. If it ships as planned, the stack aims to make Bitcoin programmable at scale – fast payments, convenient on-chain trading with staking flows, and full DeFi rails tied back to $BTC. Macro doesn’t hurt either. With Bitcoin hovering near cycle highs this year and institutional demand sticky, anything that expands $BTC’s utility surface tends to catch flows. A credible L2 narrative aligned to Bitcoin’s brand strength has a shot at outsized attention. Bitcoin Hyper: Solana-Speed Execution Meets Bitcoin-Grade Settlement Bitcoin Hyper’s ($HYPER) blueprint starts with a canonical bridge that verifies Bitcoin block headers and transaction proofs, then mints equivalent assets on the L2. The execution layer uses an SVM-compatible environment to push throughput while fees stay low. Hyper batches transactions, proven with ZK cryptography, and anchors the resulting state roots to Bitcoin for settlement. Withdrawals reverse the path and release $BTC on L1 after proof validation. The design targets three user wins: speed, cost, and programmability – without straying from Bitcoin’s security philosophy. If executed, this architecture invites real apps. Payments clear in seconds. Orderbooks and automated market markers operate without gas anxiety. Yield farming and structured products become feasible for $BTC holders who never wanted to leave the Bitcoin orbit. Developer momentum matters here: an SVM toolchain lowers friction for teams already fluent in that ecosystem, while $BTC settlement keeps the conservative crowd onside. That mix – familiar dev experience plus Bitcoin trust – is the project’s most pragmatic wedge. Competition exists. Lightning remains the OG for peer-to-peer payments. Other Bitcoin-adjacent stacks chase programmability with different compromises. But none of them offer the comprehensive solution that Hyper confidently pitches. Thinking about joining the ecosystem? Learn more about what Bitcoin Hyper does . Bitcoin Hyper is cleaner: keep settlement on Bitcoin, use a high-throughput Solana VM for execution, and prove correctness before committing. In a market where latency and user costs decide winners, that’s a sensible bet. Visit $HYPER’s website for more. Hyper’s Presale Economics and Realistic Upside Potential Momentum is there. The $HYPER presale is now at $26.99M, supported by a run of larger buys as the cycle grinds higher. That’s sizable traction for an early-stage L2 with a technical roadmap and a clear narrative tied to Bitcoin’s growth, which recommends $HYPER as one of the top crypto presales of 2025. The token price is now sitting at $0.013265 per $HYPER, with staking rewards at 43% . From that base, our price prediction for $HYPER maps two checkpoints: a potential 2025 high at $0.02595 if initial listings and early dApps land on schedule, and a 2026 high at $0.08625 if incentives and governance broaden participation. At today’s price, that implies 1.9x growth potential in late 2025 and 6.5x in 2026, respectively. Of course, crypto makes no guarantees. What could go wrong? Execution risk. Building a performant rollup and secure bridge on Bitcoin is not a trivial task. Other stacks chase the same mindshare. If $BTC chops for months, risk budgets thin across the board. Offsetting that, the thesis is simple: extend Bitcoin’s utility without diluting its core promise. If Bitcoin Hyper proves the tech and ships real apps, capital tends to follow utility. Hyper targets a Q4 2025-Q1 2026 listing window, so the presale train doesn’t have much fuel left. And based on the project’s value proposition and investor support, $HYPER could become the next crypto to explode in 2026. Get your $HYPER today. This isn’t financial advice. DYOR and manage risks wisely before investing. Authored by Aaron Walker, NewsBTC: https://www.newsbtc.com/news/next-crypto-to-explode-bitcoin-hyper-l2-could-change-bitcoin",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54345397,
    "published": 1763033400000,
    "title": "Crypto Markets Today: Bitcoin Holds $103K, Altcoins Consolidate on `Fearful' Sentiment",
    "body": "Bitcoin and ether steadied on Thursday while altcoins faced sharper pullbacks, with AERO, STRK and FET leading declines as market sentiment remained firmly in “fear” territory.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 116,
        "NAME": "FET",
        "CATEGORY": "FET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54345336,
    "published": 1763032175000,
    "title": "Scammers posed as Australian police to steal crypto, authorities warn",
    "body": "Scammers in Australia impersonated police using the government’s ReportCyber system to legitimize their calls and trick victims into handing over crypto.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54345580,
    "published": 1763033476000,
    "title": "Emory University ups stake in Grayscale’s Bitcoin ETF to $52M",
    "body": "Since disclosing its initial $15 million investment in Grayscale’s Bitcoin Mini Trust ETF last year, Emory University has increased its holdings by 245%.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54345981,
    "published": 1763025971000,
    "title": "Community expects first US spot XRP ETF to launch on Thursday",
    "body": "Analysts suggest Canary Capital’s spot XRP ETF could go live even as formal approval by the SEC is still technically pending.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54346633,
    "published": 1763035638000,
    "title": "Metaplanet’s Bitcoin gains fall 39% as October crash pressures corporate treasuries",
    "body": "The October market crash has pressured Corporate Bitcoin treasuries, as Bitcoin fell under the average acquisition cost basis of multiple treasury firms.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54346983,
    "published": 1763036252000,
    "title": "Singapore warns unregulated stablecoins pose systemic risk as new rules near",
    "body": "The Monetary Authority of Singapore says only fully regulated, reserve-backed stablecoins will qualify as settlement assets as Singapore prepares legislation and expands CBDC trials.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 54347410,
    "published": 1763037000000,
    "title": "Institutions must stake Ether on decentralized infrastructure",
    "body": "Institutions must stake ETH on decentralized networks using Distributed Validator Technology to secure Ethereum and maximize returns.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54348379,
    "published": 1763039101000,
    "title": "Czech Central Bank Becomes First Central Bank to Buy Bitcoin",
    "body": "The bank said it created a $1 million \"test portfolio\" of digital assets, mostly made up of bitcoin.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Czech Republic|Bitcoin|Central Bank|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54348492,
    "published": 1763038800000,
    "title": "BNY Launches New Money Market Fund for Stablecoin Issuers",
    "body": "The Bank of New York Mellon Corp. is launching a money-market fund tailored to issuers of stablecoins who need to comply with a recently signed US stablecoin law.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "NYS:BK",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 54350149,
    "published": 1763042402000,
    "title": "Circle Unveils On-Chain FX Engine to Expand Stablecoin Trading on Arc Network",
    "body": "Circle's dual offerings seek to modernize institutional cross-border currency trading with real-time settlement.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54350117,
    "published": 1763042400000,
    "title": "Circle enters world’s largest financial market with onchain FX engine",
    "body": "Circle is seeking to improve FX market infrastructure by offering institutions deeper global liquidity access with fewer intermediaries and reduced counterparty risk.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54350118,
    "published": 1763042400000,
    "title": "OKX adds decentralized trading for US users as DEX volumes hit record high",
    "body": "The crypto exchange enabled decentralized trading for US users, integrating DEX access and self-custody wallets as onchain volumes reach record highs.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54350054,
    "published": 1763042400000,
    "title": "Circle Unveils StableFX to Power Onchain Currency Trading on Upcoming Arc Blockchain",
    "body": "The USDC issuer's new stablecoin foreign exchange engine aims to modernize cross-border payments, reduce risk and streamline settlement.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Stablecoin|Circle|USDC|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54350051,
    "published": 1763042400000,
    "title": "Ethereum Layer-2 RISE Unveils RISEx and MarketCore to Build Global On-Chain Markets",
    "body": "The move comes as RISE’s acquired BSX Labs, a perp DEX on layer-2 Base, whose technology will underpin RISE’s new global markets offering.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|layer 2|Ethereum|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54350145,
    "published": 1762996203000,
    "title": "Bitwise exec says 2026 will be crypto’s real bull year; here’s why",
    "body": "With crypto markets failing to meaningfully rally toward the end of 2025, it only sets up 2026 for more upside, according to Bitwise’s Matt Hougan.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54350445,
    "published": 1763043173000,
    "title": "Crypto Asset Manager Grayscale Files for IPO in the U.S.",
    "body": "The crypto asset manager submitted an S-1 to the SEC for a proposed stock offering as industry players accelerate moves into U.S. public markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Grayscale|IPO|FastNews|top news|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54350321,
    "published": 1763042904000,
    "title": "Taiwan Plans BTC Reserve Review — A Bullish Rally Signal For Bitcoin Hyper",
    "body": "What to Know: Taiwan is auditing $BTC exposure and assessing a reserve strategy, with a formal report due by end-2025. This marks a credible institutional tailwind for Bitcoin. Sovereign-level interest strengthens the ‘digital gold’ case and can add marginal demand, supportive for $BTC price and $BTC-native infrastructure. Bitcoin Hyper targets speed and programmability for $BTC via an SVM-based Layer-2, aiming to unlock faster payments, DeFi, and dApps within Bitcoin’s ecosystem. $HYPER’s presale price is $0.013265; a potential high of $0.08625 in 2026 could mean a +550% ROI if devs successfully hit project milestones. Taiwan plans to put Bitcoin on its policy map. Lawmakers have pushed for a full audit of the government’s $BTC exposure and a formal study into adding Bitcoin to national reserves. Premier Cho Jung-tai pledged a detailed Taiwan reserve-strategy report by year-end 2025 . That’s not a casual nod. It’s a signal that $BTC is graduating from ‘risk asset’ to potential sovereign-grade reserve. The motivation is simple enough: diversify a reserve stack still dominated by USD and add a liquid, hard-capped asset with global settlement. This decision comes after Taiwanese legislator Ju Chun Ko had framed Bitcoin as a ‘digital gold’ hedge to USD concentration back in a May 9 session, signalling political cover for a serious allocation debate. Today, Taiwan’s FX hoard sits in the hundreds of billions, totalling $602.94B (of which 90% is USD), as per the CBC . So, even a small allocation would be material on the margin. A proper audit also sweeps up seized coins held by agencies following legal cases — inventory that could seed a pilot treasury program instead of being dumped at auction. This policy change could cause a domino effect. One credible government exploring $BTC reserves tightens the supply narrative and reinforces the ‘digital gold’ idea – particularly in an environment where ETFs have already absorbed a steady flow. If the report lands on schedule and the door opens to a modest allocation, the market gets another demand vector. Projects building real utility around Bitcoin typically benefit first. That’s the plan for Bitcoin Hyper ($HYPER) , a $BTC-centric Layer-2 aiming to turn store-of-value into a spend-and-build ecosystem. Bitcoin Hyper Wants to Turn Bitcoin Into a High-Throughput DeFi Ecosystem Bitcoin Hyper ($HYPER) is building a Layer-2 that uses the Solana Virtual Machine (SVM) for fast execution while anchoring finality to Bitcoin’s base layer. In plain English, this means: cheap, low-latency transactions and smart-contract capability without altering Bitcoin’s consensus. Imagine Solana-style speed and programmability on top of Bitcoin’s security – a combination that’s been missing in $BTC-native ecosystems. To make this happen, the project’s playbook includes a canonical bridge for wrapping $BTC for DeFi use on the Hyper side chain, then releasing the L1 $BTC back to your wallet on exit. Once the live net is up, this setup makes it possible to onboard tooling for payments, DeFi, and dApps. Security is also a dev priority, especially for the project’s financing rounds. External checks from Coinsult and SpyWolf have reviewed the $HYPER token contract and flagged no backdoors or mint functions, a non-negotiable baseline to ensure token scarcity and fair trading. That doesn’t guarantee crypto success, of course. But good security does reduce avoidable smart-contract risk at the token layer. If Taiwan’s review lifts Bitcoin mindshare and on-chain activity, networks that make $BTC usable sit in the slipstream. That’s the lane $HYPER wants to own with its cheap payments, DeFi compatibility, and quick confirmations. See Bitcoin Hyper’s ecosystem plans. $HYPER Token’s Presale Is in Full Swing with $27M+ Raised Bitcoin Hyper ($HYPER) is the utility crypto for the Hyper network. Now in presale, $HYPER has crossed $27M, with plans to set aside 75% of its funds to support project development, marketing, and a long-term treasury. The token is priced at $0.013265 right now, though its fundamentals leave room for upside once liquidity and listings arrive in Q4 2025/Q1 2026. According to our $HYPER token forecast , the token has a potential high of $0.02595 in 2025 and $0.08625 in 2026 if listing and live mainnet milestones land as planned. From the current presale price, those levels imply about +96% and +550% respectively — not the moonshot hype you’d see on Crypto Twitter, but grounded in real value and fundamentals. Put simply, if utility ships and Bitcoin stays bid, this type of multiple isn’t fantasy. The market context is certainly on Hyper’s side. Taiwan’s review timeline runs through 2025, overlapping with Bitcoin Hyper’s roadmap windows. A favorable government report won’t flip a switch on day one, yet it improves the macro narrative for $BTC-aligned infrastructure exactly when $HYPER aims to turn on throughput. If a sliver of sovereign-level demand materializes, the liquidity tide can lift the $BTC-centric stack, extending to bridges, wallets, and L2s that make $BTC actually usable. That’s where a fast SVM execution layer tied to Bitcoin’s settlement could capture real volumes instead of pure speculation. Join Bitcoin Hyper and get 43% APY. This article is informational content, not financial advice. Crypto is volatile; research market momentum and sentiment and remember – presales don’t offer guarantees. Authored by Aaron Walker, NewsBTC — https://www.newsbtc.com/news/taiwan-bitcoin-reserves-end-of-2025-bitcoin-hyper-layer2-to-rally/",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54350193,
    "published": 1763042652000,
    "title": "Best Crypto to Buy as Franklin Templeton Extends Benji to $6T Canton Network",
    "body": "What to Know: Canton’s $6T processed assets and $280B daily repo volumes show tokenization has graduated from pilots to real transaction flow. Franklin Templeton extending Benji to Canton tightens the loop between regulated funds, collateral networks, and on-chain settlement. Bitcoin Hyper ($HYPER) targets Bitcoin’s biggest gap – throughput – while Best Wallet Token ($BEST) leans into UX; Stellar ($XLM) anchors cross-border payments with deep listings. For presale exposure, $HYPER offers higher beta to Layer-2 demand; $BEST ties to wallet utility; $XLM provides listed liquidity. Franklin Templeton just plugged its Benji tokenization stack into the Canton Network, the institution-first blockchain linking collateral, settlement, and regulated markets. The move expands Benji’s reach from public networks into Canton’s private, permissioned rails where banks and trading firms already exchange tokenized assets. It’s a small line in a press release, but a big nudge toward mainstream on-chain finance. This matters, because Canton has scaled beyond pilot theater. Applications on the network are handling more than $6T in tokenized assets and north of $280B in daily U.S. Treasury repo transactions, a scale that signals real throughput rather than slideware. If tokenization is the sticky bridge between TradFi and crypto, Canton is where that bridge is getting traffic – and Benji now sits on it. For investors, this is a credibility signal. Regulated fund shares moving on a network that already processes institutional collateral give tokenized money funds and RWA collateral a clearer route into trading workflows. 💡 That’s a tailwind for projects positioned around Bitcoin scalability, self-custody user experience, and cross-border payments – three narratives with actual users and obvious product-market fit. Through that lens, three names stand out today as the best crypto to buy now. Read on as we delve into Bitcoin Hyper ($HYPER) and Best Wallet Token ($BEST), both in presale, plus Stellar ($XLM) on the listed side. 1. Bitcoin Hyper ($HYPER) – Bitcoin Layer-2 With Throughput Ambitions When regulated funds go on-chain, low-latency settlement and high-capacity rails stop being optional. Bitcoin Hyper’s ($HYPER) pitch is simple: bring Solana-style speed to Bitcoin via a Layer-2 that batches, executes, and settles back to the Layer-1. The presale broke the $27M milestone today, suggesting there’s real appetite for a throughput-first Bitcoin Layer-2 rather than just another meme coin with orange branding. $HYPER is currently priced at $0.013265 with 43% staking APY. ➡️ Check out our step-by-step guide to buying $HYPER. In simple words, Hyper relies on tools like the Solana Virtual Machine and a canonical bridge to make the Bitcoin ecosystem more scalable, cheaper, and more performant, which would qualify it for mainstream adoption. If the Benji-to-Canton momentum translates into higher institutional tolerance for on-chain collateral, Layer-2s enabling $BTC-adjacent activity benefit first. The near-term math checks out. 💰 Our price prediction for $HYPER suggests a potential 2026 high near $0.08625 as core roadmap items – initial dApps, listings, and a DAO – ship. From today’s $0.013265 presale price, that’s roughly ~6.5x to the 2026 high if execution stays on track. These stats alone recommend $HYPER as one of the best crypto to buy today. This isn’t a free lunch; delivery risk is real and competition across Bitcoin Layer-2s is heating up. But the asymmetry suits presale math, and the story aligns with the market’s push toward on-chain collateral and instant settlement. 🚀 Don’t delay – buy your $HYPER today. 2. Best Wallet Token ($BEST) – Utility-First Wallet Token With Presale Traction Canton’s growth underscores a simple truth: the next wave of users will need better UX for multi-chain portfolios, bridging, and payments. Best Wallet Token ($BEST) centers that need. It’s the native asset for the self-custody Best Wallet app ecosystem that folds in a DEX, cross-chain swaps, and a card product. The presale has reached the 17M raised, with the token currently priced at $0.025935. That’s not froth; that’s users voting for utility and distribution. The Best Wallet ecosystem offers non-custodial services and plans to ‘capture 40% of the crypto wallet market share by the end of 2026’. The roadmap details the exact strategy at work, which involves milestones like 60+ chain support, a fiat offramp, and the Best Card, to name a few. 💰 Our price prediction for $BEST sees a potential end-2025 range topping around $0.035215 and a 2026 potential high near $0.05106175 if the roadmap lands – wallet growth, card rollout, and deeper integrations. From the current presale price, that’s ~36%–90% upside across the two years, with compounding utility rather than pure narrative carrying the lift. Yes, execution and listings timing matter. Still, with tokenized funds and RWAs normalizing, a wallet that abstracts network sprawl while offering real-world spend hooks is exactly what many newcomers will need. ➡️ Our guide to buying $BEST will help you navigate the purchase process. But hurry – the presale ends in two weeks. 🚀 Buy $BEST today and stake it for 77% APY while you still can. 3. Stellar ($XLM) – Payments Rail With Exchange Liquidity Today Stellar ($XLM) remains one of the most proven options for compliant cross-border transfers and fiat on-/off-ramps, now supported by Soroban smart contracts to widen its developer surface. Recent figures show $XLM at $0.2921 with a market cap above $9.3B, and the asset is broadly listed, including on Binance and Coinbase – meaning price discovery and liquidity are not theoretical. In a world where tokenized fund shares and repo collateral settle on permissioned chains, there’s still a huge role for public infrastructure that lets fintechs, remittance players, and stablecoin issuers move value across borders. ⚙️ Stellar’s blend of speed, low fees, and established exchange coverage keeps it relevant as the tokenization stack grows above it. Holders also get a clean story: payments first, programmability now, and plenty of listings to trade the cycle. With $XLM above $0.29 at the time of writing and an all-time ROI north of 9,677%, this one seems to be a banger. 🚀 Buy $XLM on Binance and other leading platforms today. Recap: Franklin Templeton’s Canton integration is the headline, but the subtext is bigger: regulated liquidity is moving on-chain at industrial scale. That is the connective tissue behind $HYPER’s Layer-2 throughput pitch, $BEST’s UX-led approach to self-custody, and $XLM’s liquid payments rail. If the question is the best crypto to buy into this tokenized-finance backdrop, these three sit squarely in the narrative with distinct roles and risk profiles. Disclaimer: This isn’t financial advice. Always do your own research before making any investment decision. Authored by Aaron Walker, NewsBTC: https://www.newsbtc.com/news/best-crypto-to-buy-franklin-templeton-canton-hyper-best-stellar",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 56,
        "NAME": "XLM",
        "CATEGORY": "XLM"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54350539,
    "published": 1763000337000,
    "title": "Tokenization demand is no longer tied to Bitcoin: Galaxy executive",
    "body": "Galaxy tokenization head Thomas Cowan says interest in tokenization is now “independent of the price of Bitcoin” as institutions have started to see the benefits.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54350514,
    "published": 1763000337000,
    "title": "Tokenization demand is no longer tied to Bitcoin: Galaxy executive",
    "body": "Galaxy tokenization head Thomas Cowan says interest in tokenization is now “independent of the price of Bitcoin” as institutions have started to see the benefits.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54350537,
    "published": 1762996963000,
    "title": "Funding bill set to reopen US government heads to Trump’s desk",
    "body": "The House passed a funding bill to end the longest US government shutdown in history, which had previously delayed crypto ETF approvals and key crypto bills.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54350535,
    "published": 1762996203000,
    "title": "Bitwise exec says 2026 will be crypto’s real bull year; here’s why",
    "body": "With crypto markets failing to meaningfully rally toward the end of 2025, it only sets up 2026 for more upside, according to Bitwise’s Matt Hougan.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54350256,
    "published": 1762996203000,
    "title": "Bitwise exec says 2026 will be crypto’s real bull year; here’s why",
    "body": "With crypto markets failing to meaningfully rally toward the end of 2025, it only sets up 2026 for more upside, according to Bitwise’s Matt Hougan.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54350281,
    "published": 1762996203000,
    "title": "Bitwise exec says 2026 will be crypto’s real bull year; here’s why",
    "body": "With crypto markets failing to meaningfully rally toward the end of 2025, it only sets up 2026 for more upside, according to Bitwise’s Matt Hougan.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54350956,
    "published": 1763044250000,
    "title": "Popular Crypto Trader Reveals Why Bitcoin Price Is Still Crashing",
    "body": "Bitcoin is down by 2.1% in the past 24 hours, and its latest decline has come at a moment when many traders expected the opposite. The US government shutdown is already in the process of winding down after weeks of uncertainty, yet the prices of Bitcoin and Ethereum have continued to drift lower and are under pressure. The cryptocurrency market’s inability to rebound notably has led to active debate among traders on X. One of the most vocal views came from a popular trader known as The White Whale, whose remarks express a growing sense of frustration across the crypto community. The Shutdown Isn’t Really Over The White Whale argument is that the crypto market’s price action is yet to rebound because the government shutdown is not truly over. The analyst insinuates that the apparent resolution to the shutdown is far less reassuring than it looks. Related Reading: Adam Beck’s Bitcoin Realization: What Kind Of Money Is BTC? In his view, the government only approved short-term funding so that federal workers get paid through the holiday period, but this leaves the underlying issue unresolved. The temporary nature of the fix means the same uncertainty could come back in just a few weeks, which he believes is preventing markets from reacting positively. The discussion attracted instant responses, including a contrasting view from another commentator, Nara Sumas. Sumas dismissed the idea that the shutdown is the main factor behind price action, noting that markets barely reacted when the shutdown began. The point is that the macro crypto environment is already heavy with weak sentiment, and there is bad news about the markets every day. Therefore, the crypto market’s decline has more to do with those structural conditions than with government drama. Furthermore, the brief uptick earlier in the week was due to exuberance and not anything based on fundamentals. Despite the pushback, The White Whale doubled down on his stance. He maintained that markets do react to shutdowns, but not immediately. Therefore, the delayed downturn is a reaction after it became apparent to investors that the situation wasn’t going to be resolved quickly. What’s Next For The Crypto Market? The path ahead for the crypto market is tied to whether confidence can return after weeks of choppy price action and sentiment. The exchange between traders on X, like the one highlighted above, shows that many are weighing the impact of the temporary government funding deal against the deeper macro issues that have shaped this downturn. Related Reading: Bitcoin Bull Market Peak Indicators Says Hold Despite Crash Below $100,000, What’s Happening? Even though the shutdown is winding down, the uncertainty around what happens next is notable, especially for investors who rely on clear policy direction before taking on additional risk. At the time of writing, Bitcoin is trading at $102,900, down by 2% in the past 24 hours. At the same time, XRP is witnessing a resurgence in interest, as investors are now awaiting the possible launch of a US-based Spot XRP ETF this week. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|ethereum|Nara Sumas|US-based Spot XRP ETF|White Whale",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54350951,
    "published": 1763044198000,
    "title": "First XRP Spot ETF Opens for Trade With Canary Capital's XRPC",
    "body": "XRP is the latest token to be wrapped in a spot exchange-traded fund after the introduction of bitcoin and ether funds 2024 and solana just weeks ago.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|XRP|Breaking News|top news|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54350639,
    "published": 1763000337000,
    "title": "Tokenization demand is no longer tied to Bitcoin: Galaxy executive",
    "body": "Galaxy tokenization head Thomas Cowan says interest in tokenization is now “independent of the price of Bitcoin” as institutions have started to see the benefits.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54350888,
    "published": 1763000337000,
    "title": "Tokenization demand is no longer tied to Bitcoin: Galaxy executive",
    "body": "Galaxy tokenization head Thomas Cowan says interest in tokenization is now “independent of the price of Bitcoin” as institutions have started to see the benefits.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54351386,
    "published": 1763045151000,
    "title": "Kyrgyzstan’s Gold-Backed Stablecoin Could Be Shining New Light on Best Wallet Token",
    "body": "What to Know: USDKG changes the usual stablecoin model by backing a dollar peg with real gold from Kyrgyzstan’s reserves. If gold and commodity stablecoins grow, users will want wallets that handle many stablecoins without turning their portfolio into a spreadsheet headache. Best Wallet Token ($BEST) gives real perks, like lower fees, early presale access, and smooth cross-chain swaps. Stablecoin liquidity drives the market, and wallet-layer tokens can collect lasting value from routing, discovery, and spending features. Think of them as the toll booths of the crypto highways. Kyrgyzstan surprised the stablecoin world with $USDKG, a gold-backed dollar coin that comes with a $50M first mint. It’s a different style in a market where most issuers rely on T-bills and repo. This launch is not just a flashy headline. It shows Kyrgyzstan wants more freedom in cross-border trade in a world full of sanctions and red tape. It also pushes the idea that dollar-pegged coins do not always need US financial plumbing behind them. $USDKG is pegged 1:1 to the dollar . Simple. But the backing is the twist. Gold replaces the usual short-term US assets. If USDKG becomes useful for settlement in Central Asia and nearby regions, we could see other countries and commodity exporters try non-Treasury collateral, too. It won’t shake the US.bond market tomorrow, but it does widen the design space for stablecoins. Think of it as switching from a single spice kitchen to a full spice rack. This shift brings wallets into the picture. People don’t change stablecoins alone – they change the tools they use. A wallet that handles swaps, cuts fees, and helps you find new assets becomes the winner. Best Wallet Token ($BEST) is built for this moment. It offers a retail-friendly, non-custodial setup where the token has real utility inside the app. If gold-backed and commodity-linked stablecoins pick up speed, users will want wallets that make juggling multiple coins painless. That’s where $BEST fits. The token supports an ecosystem made for cross-chain swaps, presale access, and smoother on-off-ramp flows. Why Best Wallet Token ($BEST) Stands Out in the New Stablecoin Era When collateral changes, user habits change too. Gold backing means nothing if you can’t hold USDKG next to USDT, USDC, and your favorite RWA tokens without stress. Best Wallet Token ($BEST) focuses exactly on removing that stress. The Best Wallet app is non-custodial and multi-chain. It uses Fireblocks MPC security, so you stay in control while avoiding the classic seed phrase panic moment (we’ve all had that nightmare). Inside the app, a DEX aggregator pulls liquidity across some 300 chains and 30 bridges. You rebalance your assets with one tap instead of spending a week crying over gas fees, failed approvals, and mystery errors. $BEST shapes the economics of the wallet. Hold it, and you pay fewer fees. Swaps can get better terms when the network is busy. You also get early access to new tokens through the Upcoming Tokens portal. In a future where gold coins, sovereign coins, and tokenized Treasuries sit side by side, this curation layer becomes useful. You find new assets while staying inside one interface that already holds your $BTC, $ETH, $SOL, and standard stablecoins. Add portfolio tools, multiple wallet support, and anti-fraud features, and you end up with an app built for fast moves between new stablecoin rails and the wider crypto market. If USDKG and similar coins create new trade routes, the wallets that lower switching costs will capture users. It’s a smart time to check out the $BEST presale. The $BEST Presale and Why Timing Helps Wallet Tokens Macro forces help this story. Stablecoins already hold huge piles of T-bills and dominate on-chain liquidity. If some capital shifts toward gold-backed or commodity-linked models, that could expand stablecoin use cases rather than shrink them. In that world, wallet-layer tokens can capture a steady flow of fees and loyalty. The $BEST presale just passed the $17M mark, and you can buy $BEST for just $0.025935. The setup is simple: give the token real perks inside the app and reward people who use it. That includes reduced fees, early allocations, and higher engagement through staking. As cross-chain swaps and launchpad tools grow, the token becomes something you feel in daily use, not just a number on a dashboard. Holders get cheaper transactions, exclusive early access to trusted new projects before they launch publically, and a voice in which chains and features appear next. Demand is not imagined. It grows from an app that already solves basic user problems. At the current presale price, future listings and feature rollouts matter mainly through fee savings and access. That is a healthier angle in a market where narratives move quickly and every little transaction cost adds up. If you think stablecoins will keep diversifying and retail users will keep chasing easier tools, Best Wallet Token is one of the best crypto presales to invest in. This article is for informational purposes and doesn’t constitute financial advice. Always do your own research (DYOR) before investing in crypto. Authored by Aaron Walker, NewsBTC — www.newsbtc.com/news/kyrgyzstan-gold-backed-usdkg-stablecoin-best-wallet-token",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54351280,
    "published": 1763044804000,
    "title": "Ethereum whale stacks $1.3B in ETH, fueling $4K recovery hopes",
    "body": "Unknown whales continue to increase their Ethereum exposure as technical indicators suggest a short-term ETH price rally to $4,000.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54351042,
    "published": 1763044396000,
    "title": "Bitcoin, Ethereum ETF Operator Grayscale Files to Go Public in US",
    "body": "Crypto asset manager Grayscale Investments has announced plans to go public on the New York Stock Exchange.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54351410,
    "published": 1763000337000,
    "title": "Tokenization demand is no longer tied to Bitcoin: Galaxy executive",
    "body": "Galaxy tokenization head Thomas Cowan says interest in tokenization is now “independent of the price of Bitcoin” as institutions have started to see the benefits.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54351757,
    "published": 1763046000000,
    "title": "Acurast raises $11M to turn smartphones into confidential compute nodes",
    "body": "Acurast raised $11 million to launch a smartphone-based confidential compute network that claims tamper-resistant execution on consumer phones.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54351693,
    "published": 1763046000000,
    "title": "Zero-Knowledge Identity Startup Self Raises $9M, Introduces Points Program",
    "body": "Self raised $9 million to expand its zero-knowledge identity platform and introduced a rewards program aimed at driving on-chain verification adoption.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Fundraising|Zero-Knowledge Proofs|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54351543,
    "published": 1763045524000,
    "title": "Thai-FBI Operation Recovers $432,000 in Crypto From Alleged European Hacker",
    "body": "The operation, code-named \"Operation 293,\" returned the recovered digital assets to Thai victims on Monday.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54351447,
    "published": 1763045337000,
    "title": "Singapore's Central Bank to Trial Tokenized Bills, Introduce Stablecoin Laws",
    "body": "The Monetary Authority of Singapore sees a wholesale CBDC as an anchor for a system in which private settlement assets are used for different market needs.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Singapore|Monetary Authority of Singapore|Tokenization|Stablecoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 54351950,
    "published": 1763046494000,
    "title": "BNY Eyes $1.5T Stablecoin Market With New Reserve Fund for Issuers",
    "body": "The bank aims to provide a key piece of infrastructure for stablecoin issuers to back the value of their tokens, similarly to BlackRock's Circle Reserve Fund for USDC.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Stablecoins|BNY Mellon|Anchorage Digital|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54351882,
    "published": 1763046184000,
    "title": "Crypto most ‘fearful’ since March as Bitcoin eyes one-year lows versus gold",
    "body": "Bitcoin and crypto market sentiment hit seven-month lows, with the BTC price still above $100,000, while gold and silver received a post-shutdown boost.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54352518,
    "published": 1763047527000,
    "title": "What happens if the Fed cuts rates before Christmas Eve?",
    "body": "A pre-Christmas Fed rate cut could boost spending, shift bond yields, lift risk assets and increase demand for crypto.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54352436,
    "published": 1763047377000,
    "title": "Czech National Bank tests Bitcoin, crypto reserve with historic $1M buy",
    "body": "The Czech National Bank invested $1 million to test a crypto reserve that includes Bitcoin, a stablecoin and tokenized bank deposits.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54352211,
    "published": 1763044140000,
    "title": "CoinDesk 20 Performance Update: Ripple (XRP) Gains 5.1% As Nearly All Assets Rise",
    "body": "Uniswap (UNI) was also among the top performers, up 4.1% from Wednesday.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "CoinDesk Indices|CoinDesk Indices|CoinDesk 20|charts|Prices|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 53,
        "NAME": "UNI",
        "CATEGORY": "UNI"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54352557,
    "published": 1763009381000,
    "title": "US shutdown ends, crypto progress resumes as Trump signs bill",
    "body": "US President Donald Trump signed the bill ending the record 43-day government shutdown and resuming federal operations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54352517,
    "published": 1763009381000,
    "title": "US shutdown ends, crypto progress resumes as Trump signs bill",
    "body": "US President Donald Trump signed the bill ending the record 43-day government shutdown and resuming federal operations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54333831,
    "published": 1763009381000,
    "title": "US shutdown ends, crypto progress resumes as Trump signs bill",
    "body": "US President Donald Trump signed the bill ending the record 43-day government shutdown and resuming federal operations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54352889,
    "published": 1763009381000,
    "title": "US shutdown ends, crypto progress resumes as Trump signs bill",
    "body": "US President Donald Trump signed the bill ending the record 43-day government shutdown and resuming federal operations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54353106,
    "published": 1763048971000,
    "title": "Singapore to Roll Out Stablecoin Regulations, Expand CBDC Trials",
    "body": "Chia Der Jiun of the Monetary Authority of Singapore said that regulation is key to confidence as tokenization gains traction.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 54353405,
    "published": 1763009381000,
    "title": "US shutdown ends, crypto progress resumes as Trump signs bill",
    "body": "US President Donald Trump signed the bill ending the record 43-day government shutdown and resuming federal operations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54353053,
    "published": 1763009381000,
    "title": "US shutdown ends, crypto progress resumes as Trump signs bill",
    "body": "US President Donald Trump signed the bill ending the record 43-day government shutdown and resuming federal operations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54353619,
    "published": 1763050228000,
    "title": "Cathie Wood's Ark Invest Buys $30 Million in Circle Shares Ahead of Potential Arc Token",
    "body": "Cathie Wood's investment firm bought around $30 million worth of shares in stablecoin issuer Circle as its price continues to dip.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54353657,
    "published": 1763009381000,
    "title": "US shutdown ends, crypto progress resumes as Trump signs bill",
    "body": "US President Donald Trump signed the bill ending the record 43-day government shutdown and resuming federal operations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54353535,
    "published": 1763009381000,
    "title": "US shutdown ends, crypto progress resumes as Trump signs bill",
    "body": "US President Donald Trump signed the bill ending the record 43-day government shutdown and resuming federal operations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54353688,
    "published": 1763009381000,
    "title": "US shutdown ends, crypto progress resumes as Trump signs bill",
    "body": "US President Donald Trump signed the bill ending the record 43-day government shutdown and resuming federal operations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54353929,
    "published": 1763050967000,
    "title": "dYdX Governance Approves Buyback Increase to 75% of Protocol Revenue",
    "body": "The new proposal, which 59.38% of the community approved, charts a course to raise the buy-back allocation up from 25% of net protocol fees.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|dYdX|Governance|DAO|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 54353864,
    "published": 1763050901000,
    "title": "Emory University Doubles Down on Bitcoin With $52M Grayscale BTC ETF Stake",
    "body": "The managers of the Georgia university's endowment are showing an inclination towards hard assets, opening a sizable position in a gold ETF as well.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin ETF|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54353793,
    "published": 1763050320000,
    "title": "Last US penny minted shows why savers need Bitcoin",
    "body": "The last US penny, which is valued at $0.01, costs about 3.7 times its face value to mint, as inflation erodes the value of fiat currency.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54354940,
    "published": 1763053256000,
    "title": "Bitcoin Eyes New All-Time High As Analyst Sets $170K Target",
    "body": "According to market watchers, US-listed spot Bitcoin ETFs posted a $520 million inflow on Tuesday, a sharp change after a mild $1.15 million inflow the day before and a recent week that saw $1.22 billion in withdrawals. Related Reading: XRP Has Held Its Ground As Most Altcoins Fall, Market Observers Say That swing in flows is being watched closely because inflows into ETFs have in the past helped drive big price climbs. Right now Bitcoin trades around $104,000, and some analysts say a jump toward $160,000–$170,000 is possible if buying pressure keeps building. Diminishing Golden Curves Hint At Lower Peaks Based on reports from CryptoCon, a model called diminishing golden curves maps price bands using logarithmic regression. The model tracks how far Bitcoin moves above a “Golden Curve” growth path and labels those moves with deviation levels. The next target for #Bitcoin is between $160,000 and $170,000 🚀 pic.twitter.com/QAd3RdDS8q — Bitcoin Teddy (@Bitcoin_Teddy) November 12, 2025 Past cycle tops landed at +5 in November 2013, +4 in December 2017, and +3 in November 2021. CryptoCon’s projection now places the next top near the +2 band, which translates to a range between $160,000 and $170,000, with a possible swing toward $186,000. If that plays out, Bitcoin would climb about 70% from current levels near $104,000. Halving Rhythm Still In Play Reports show the chart also uses halving-based sine waves. Since the last halving occurred in April 2024, the model expects a market peak in late 2025, a timing that matches the rough 12–18 month pattern seen after previous halvings. That rhythm has been a simple guide for many traders. It is not a guarantee, but it helps explain why analysts are paying attention to late 2025 as a possible climax point. Stablecoin And Exchange Reserves Add Weight On-chain signals add more detail. The stablecoin supply ratio has fallen to levels that historically lined up with market lows, suggesting there is dry powder waiting on the sidelines. Data from Binance shows stablecoin reserves rising while Bitcoin reserves on the exchange fall — a mix often read as accumulation by long-term holders. CryptoQuant analyst Moreno says liquidity is increasing and volatility is low, which can make the risk-reward seem attractive to buyers. Related Reading: Dogecoin Alert! Price Could Explode Over 2,800%, Analyst Says Timing And Risks Remain Important Market conditions could change quickly, Especially with new economic data and the end of the US government shutdown. That kind of macro event can add volatility and shift flows. Models like the Diminishing Golden Curves are useful tools, yet they depend on history repeating in ways that might not hold if a major shock appears. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|etf|Trump|US shutdown",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54354689,
    "published": 1763052580000,
    "title": "HBAR Drops 3.5% Breaking Support as ETF Inflows Hit $68 Million",
    "body": "Hedera's native token retreats from $0.1817 to $0.1754 despite institutional accumulation.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 81,
        "NAME": "HBAR",
        "CATEGORY": "HBAR"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54355326,
    "published": 1763054102000,
    "title": "Bitcoin Slides to $100K, Crypto Stocks Eviscerated as Liquidity Crunch Hammers Risk Markets",
    "body": "Crypto’s U.S. trading-hour weakness continues as hopes for new 2025 BTC high fade, market strategist said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Market Wrap|Bitcoin|Breaking News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54355178,
    "published": 1763053572000,
    "title": "Asset manager Grayscale files for US IPO",
    "body": "The registration statement was made public about four months after the asset manager had filed confidentially for an initial public offering.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54355081,
    "published": 1763053473000,
    "title": "Canary's XRP ETF Off to Hot Start, Has 'Good Shot' of Breaking Record: Analyst",
    "body": "The Canary XRP fund appears on track to notch the year's hottest start for any ETF, already beating estimates in just 30 minutes of trading.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54355080,
    "published": 1763053453000,
    "title": "JPMorgan Analysts Flip Bullish on Circle, Citing Faster Stablecoin Growth",
    "body": "The analysts said Circle’s third-quarter results were solid.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54355314,
    "published": 1763014112000,
    "title": "Canary Capital files for MOG ETF, boosting the little-known memecoin",
    "body": "The memecoin Mog Coin saw a slight lift in its price on Wednesday after Canary Capital filed to launch an ETF tracking the token.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 185,
        "NAME": "MOG",
        "CATEGORY": "MOG"
      }
    ]
  },
  {
    "id": 54355365,
    "published": 1763014112000,
    "title": "Canary Capital files for MOG ETF, boosting the little-known memecoin",
    "body": "The memecoin Mog Coin saw a slight lift in its price on Wednesday after Canary Capital filed to launch an ETF tracking the token.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 185,
        "NAME": "MOG",
        "CATEGORY": "MOG"
      }
    ]
  },
  {
    "id": 54355519,
    "published": 1763054485000,
    "title": "Stellar Tumbles Below Key $0.285 Support as Bears Take Over",
    "body": "XLM retreated to $0.281 as selling pressure intensified during afternoon trading, with volume surging amid failed resistance test.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 56,
        "NAME": "XLM",
        "CATEGORY": "XLM"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54355498,
    "published": 1763014112000,
    "title": "Canary Capital files for MOG ETF, boosting the little-known memecoin",
    "body": "The memecoin Mog Coin saw a slight lift in its price on Wednesday after Canary Capital filed to launch an ETF tracking the token.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 185,
        "NAME": "MOG",
        "CATEGORY": "MOG"
      }
    ]
  },
  {
    "id": 54355568,
    "published": 1763014112000,
    "title": "Canary Capital files for MOG ETF, boosting the little-known memecoin",
    "body": "The memecoin Mog Coin saw a slight lift in its price on Wednesday after Canary Capital filed to launch an ETF tracking the token.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 185,
        "NAME": "MOG",
        "CATEGORY": "MOG"
      }
    ]
  },
  {
    "id": 54355446,
    "published": 1763014112000,
    "title": "Canary Capital files for MOG ETF, boosting the little-known memecoin",
    "body": "The memecoin Mog Coin saw a slight lift in its price on Wednesday after Canary Capital filed to launch an ETF tracking the token.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 185,
        "NAME": "MOG",
        "CATEGORY": "MOG"
      }
    ]
  },
  {
    "id": 54355623,
    "published": 1763014112000,
    "title": "Canary Capital files for MOG ETF, boosting the little-known memecoin",
    "body": "The memecoin Mog Coin saw a slight lift in its price on Wednesday after Canary Capital filed to launch an ETF tracking the token.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 185,
        "NAME": "MOG",
        "CATEGORY": "MOG"
      }
    ]
  },
  {
    "id": 54356203,
    "published": 1763044804000,
    "title": "Ether whale stacks $1.3B in ETH, fueling $4K recovery hopes",
    "body": "Unknown whales continue to increase their Ether exposure as technical indicators suggest a short-term ETH price rally to $4,000.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54356613,
    "published": 1763056830000,
    "title": "XRP Price Jumps as First U.S. Spot ETF Debuts on Nasdaq, Analysts Predict Rally in Weeks",
    "body": "The XRP market just hit a historic milestone as the first U.S. spot XRP ETF, Canary Capital’s XRPC, officially debuts on Nasdaq, sending bullish shockwaves for the XRP price and other assets in the market. Related Reading: Ethereum Ready To Explode To $12,000 By January, Says Tom Lee The launch gives traditional investors direct exposure to XRP through regulated brokerage accounts, and analysts say this could be the spark that propels prices sharply higher in the coming weeks. XRP's price moving sideways on the daily chart. Source: XRPUSD on Tradingview First Spot XRP ETF on Nasdaq Unlocks New Demand Nasdaq has certified the Canary Capital XRP ETF for trading under the ticker XRPC, making it the first fully spot-based XRP ETF in the U.S. The fund holds XRP directly and tracks the XRP-USD CCIXber Reference Rate Index, offering a simple, regulated way for institutions and retail investors to gain exposure without managing wallets or private keys. The ETF’s approval comes after the fund completed its Form 8-A filing with the SEC, clearing key regulatory hurdles. Other heavyweights, Franklin Templeton, Bitwise, CoinShares, and 21Shares, also have XRP ETF applications in the pipeline, signaling a second wave of products that could further deepen liquidity and demand. On-chain data already shows shifting behavior ahead of the launch. Exchange inflows are down, suggesting holders are accumulating rather than selling, even as XRP trades around the $2.39–$2.50 zone and consolidates above support near $2.20–$2.40. Analysts See ‘Face-Melting’ XRP Price Rally as Technicals Coil Popular crypto analyst Egrag Crypto believes XRP is entering the final stages of a major consolidation that could lead to an explosive move within 4–6 weeks. Drawing on historical rallies in 2017 and 2021, he notes that XRP is once again forming a large symmetrical triangle, typically a “compression before expansion” structure. Using Fibonacci projections, Egrag highlights potential long-term targets between $10 and $37, while acknowledging that short-term market sentiment remains cautious. He argues that impatience and emotional selling often precede the biggest upside moves, and that today’s sideways action is more “preparation” than weakness. BlackRock Narrative and Macro Tailwinds Add Fuel Institutional narratives are also lining up behind XRP. At Swell 2025, BlackRock’s Maxwell Stein described the XRP Ledger as a scalable rail for trillions of dollars in tokenized assets and cross-border payments, reinforcing XRP’s status as a utility-driven asset rather than a purely speculative token. Related Reading: Bitcoin Death Cross Is Coming: Don’t Be Fooled By The Name With the Fed’s December rate decision approaching and risk appetite poised to shift, XRP now sits at the intersection of a powerful trio. Fresh ETF inflows, tightening technical patterns, and growing institutional validation. If these forces align, the XRPC launch may be remembered as the moment XRP’s next major rally truly began. Cover image from ChatGPT, XRPUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ripple|xrp|XRP Price|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54336050,
    "published": 1763018492000,
    "title": "How Ripple plans to bridge crypto and Wall Street in its $4B expansion",
    "body": "Ripple bundles custody, prime brokerage, treasury and stablecoins so institutions can operate like banks with crypto rails.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54356270,
    "published": 1763018492000,
    "title": "How Ripple plans to bridge crypto and Wall Street in its $4B expansion",
    "body": "Ripple bundles custody, prime brokerage, treasury and stablecoins so institutions can operate like banks with crypto rails.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54356583,
    "published": 1763018492000,
    "title": "How Ripple plans to bridge crypto and Wall Street in its $4B expansion",
    "body": "Ripple bundles custody, prime brokerage, treasury and stablecoins so institutions can operate like banks with crypto rails.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54356839,
    "published": 1763057313000,
    "title": "‘The Worst Outcome’—Bitcoin Suddenly Drops Under $100,000 Price As Stark Fed Warning Fuels Crash Fears",
    "body": "Analysts are scrambling to decode what the data blackout might mean for the coming Federal Reserve interest rate meeting...",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 54356762,
    "published": 1763057048000,
    "title": "Bitcoin Dives Below $100K for Third Time This Month as Crypto Liquidations Top $500 Million",
    "body": "Bitcoin dropped below $100,000 per coin for the third time this month as broader concerns over the U.S. economy weighed on investors.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54356708,
    "published": 1763018492000,
    "title": "How Ripple plans to bridge crypto and Wall Street in its $4B expansion",
    "body": "Ripple bundles custody, prime brokerage, treasury and stablecoins so institutions can operate like banks with crypto rails.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54356904,
    "published": 1763018492000,
    "title": "How Ripple plans to bridge crypto and Wall Street in its $4B expansion",
    "body": "Ripple bundles custody, prime brokerage, treasury and stablecoins so institutions can operate like banks with crypto rails.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54358043,
    "published": 1763059353000,
    "title": "21Shares launches crypto index ETFs under SEC’s Act 40",
    "body": "21Shares’ new crypto index ETFs utilize the stricter 1940 Act framework, marking a shift toward traditional fund oversight for diversified digital asset exposure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54358437,
    "published": 1763060410000,
    "title": "Bitcoin Leverage Cooldown Signals Market Reset: OI Drops 21% As Excess Risk Is Flushed Out",
    "body": "Bitcoin continues to consolidate below the $105,000 mark, maintaining stability above the key $100,000 support level despite ongoing market uncertainty. Bulls appear to be losing momentum, yet sellers are showing signs of exhaustion as the price resists further decline. According to top analyst Darkfost, the market has entered a clear deleveraging phase following the major liquidation event on October 10 — a structural reset that is removing excessive leverage from the system. Related Reading: Ethereum Whale Adds $105M To His ETH Position – $1.33B Bought Since Nov 4 Data shows that open interest — the total value of active futures contracts — has fallen by 21% over the past 90 days, marking one of the steepest declines of the cycle. This drop reflects traders reducing risk exposure and liquidations steadily clearing overleveraged positions. Darkfost notes that leverage usage is gradually cooling down, with the current drawdown echoing previous cleansing phases seen in September 2024 and April 2025. Historically, such periods of forced unwinding have preceded new market strength as liquidity stabilizes and speculative excess fades. Deleveraging Signals a Potential Turning Point for Bitcoin Darkfost explains that the current deleveraging phase bears striking similarities to previous corrective periods that ultimately paved the way for major recoveries. During the September 2024 and April 2025 corrections, open interest fell by approximately 24% and 29%, respectively — deep enough to flush out excessive speculation and restore balance across the market. With the current 21% decline in open interest over the last three months, Bitcoin is now approaching those same historical levels of leverage reduction. According to Darkfost, these phases are not necessarily bearish; instead, they serve as healthy resets during bullish market cycles. By forcing overleveraged traders to exit and cooling down speculative behavior, the market is able to rebuild on a stronger, more stable foundation. In past cycles, such unwinding events were often followed by trend reversals once selling pressure eased and new demand emerged. The reduction in leverage also tends to attract long-term investors and institutions seeking lower-risk entry points. If Bitcoin continues to hold its ground above $100K through this period of structural cleanup, it could signal that the worst of the correction is over, setting the stage for a potential new impulse phase once confidence returns. Related Reading: Bitcoin Inflows To Binance Surge: Daily Average Hits 7,500 BTC BTC Tests Support As Consolidation Continues Above $100K The weekly Bitcoin chart shows that BTC remains in a tight consolidation range between $100,000 and $105,000, testing key structural support. The price has repeatedly defended the 100-day moving average (blue line), indicating that despite sustained selling pressure, buyers continue to step in around this psychological zone. The overall trend remains bullish on higher timeframes, with the 200-week moving average (red line) trending upward and well below current price action — a signal that Bitcoin’s long-term market structure remains intact. However, momentum indicators reflect weakness, as BTC struggles to reclaim the $110,000 resistance level that capped previous rebound attempts. Related Reading: Bitcoin STH-MVRV Rebounds From Local Low – Potential Recovery Toward $115K–$120K Trading volume has decreased since the October liquidation event, aligning with Darkfost’s observation that the market is undergoing a deleveraging phase. This lower volume environment suggests investor hesitation but also indicates that forced selling may be nearing exhaustion. A decisive weekly close above $106,000 could confirm renewed bullish momentum, while a breakdown below $100,000 might trigger deeper corrections toward $92,000 — the next major support zone. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|Bitcoin leverage|Bitcoin news|Bitcoin Open interest|bitcoin price|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54358244,
    "published": 1763060103000,
    "title": "Chainlink Breaks Below $14.50 Amid Broader Selloff; Reserve Adds 74K LINK Despite Losses",
    "body": "Technical breakdown occurred despite positive institutional developments as volume surged during selloff",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Chainlink|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54358172,
    "published": 1763059528000,
    "title": "Bitcoin falls to $98K as futures liquidations soar: Should bulls expect a bounce?",
    "body": "Bitcoin data forecast the drop to $98,000 as key supports failed to generate hefty buying from bulls, and futures traders saw their long positions liquidated.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54358092,
    "published": 1763020268000,
    "title": "Tokyo exchange operator eyes crackdown on Bitcoin-holding firms after DAT rout",
    "body": "Metaplanet CEO Simon Gerovich said JPX’s concerns are with companies that feature poor approvals and insisted the critique doesn’t apply to them.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      }
    ]
  },
  {
    "id": 54359587,
    "published": 1763062599000,
    "title": "Czech Republic Invests in Crypto, With Eye on Eventual Bitcoin Reserve",
    "body": "The nation’s central bank has unveiled a pilot investment in Bitcoin, stablecoins, and tokenized deposits to better understand how to adopt digital assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54359513,
    "published": 1763062518000,
    "title": "This One Weird Trick Defeats AI Safety Features in 99% of Cases",
    "body": "New research shows that AI's extended reasoning creates a security vulnerability, with extremely high attack success rates across major models including GPT, Claude, and Gemini.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 54360161,
    "published": 1763064049000,
    "title": "Solana at a Breaking Point: Fading Memecoin Hype and Alameda Unlocks Test the $140 Support Zone",
    "body": "Solana (SOL) is once again under intense market scrutiny as a combination of fading memecoin activity, declining user engagement, and continuous token unlocks by Alameda Research puts pressure on one of crypto’s strongest 2025 performers. Related Reading: Ethereum Ready To Explode To $12,000 By January, Says Tom Lee While institutional inflows via ETFs remain robust, Solana’s ability to defend key technical levels, particularly the $140–$150 demand zone, will determine whether the asset stabilizes or slides into a deeper correction. Memecoin Cooldown Sends User Activity to One-Year Low Solana’s explosive rise in late 2024 and early 2025 was largely fueled by rapid memecoin launches and hyperactive retail speculation. But that frenzy has sharply cooled. According to Glassnode and The Block, the number of daily active addresses has dropped to 3.3 million, down from over 9 million at the start of the year, marking a 12-month low. Most of the decline comes from the disappearance of bots and short-term users who flooded the chain during its speculative peak. This slowdown has immediate consequences. Lower address activity has translated into softer fee revenue and thinner liquidity, making SOL more sensitive to market shocks. Analysts warn that until new high-utility use cases, such as payments, gaming, or real-world asset apps, attract stickier users, Solana’s engagement metrics may continue to oscillate with speculative cycles. Despite this decline, Solana’s ecosystem remains fundamentally strong. Its DeFi TVL stands at nearly $10 billion, supported by Jupiter, Jito, and Kamino, while developers continue to build stablecoin primitives, high-throughput consumer applications, and institutional-grade infrastructure, such as Firedancer. SOL's price trends to the downside on the daily chart. Source: SOLUSD chart from Tradingview Alameda Unlocks Clash With Record Solana ETF Inflows Another major pressure point is the ongoing monthly SOL unlocks from the FTX/Alameda bankruptcy estate. On November 11, Alameda unstaked 193,000 SOL ($30 million), part of a vesting schedule that runs through 2028. These tokens often find their way to exchanges, creating short-term selling pressure. However, institutional demand is delivering the opposite effect. Solana has now recorded 10–11 consecutive days of ETF inflows, totaling $336 million for the week. Bitwise and Grayscale Solana ETFs collectively hold $351 million, and even traditional institutions like Rothschild Investment and PNC Financial Services have disclosed new positions. SoFi Bank’s move to enable direct SOL purchases from U.S. checking accounts has further legitimized Solana within the regulated finance sector. This tug-of-war, systematic selling vs. accelerating inflows, defines Solana’s current volatility. Technical Setup: $140 Is the Line in the Sand SOL is trading around $152–$156, having broken below key support at $156 amid rising volume. Indicators remain bearish: OBV continues trending downward, signaling persistent seller dominance. Market structure shows lower highs and lower lows since early November. Liquidity heatmaps reveal strong magnetic zones at $144 and $140, making a retest highly likely. Analysts view $140 as the crucial support area. If it fails, liquidity extends toward $120, opening the door for a deeper correction. Related Reading: Bitcoin Death Cross Is Coming: Don’t Be Fooled By The Name But a successful defense could trigger a sharp rebound toward $165–$180, especially if ETF flows remain steady and Bitcoin holds above the $98k–$100k range. Cover image from ChatGPT, SOLUSD chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Solana|Sol|SOL Price|SOLUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54360572,
    "published": 1763026800000,
    "title": "Trader torches $3M to punch a $5M hole in Hyperliquid’s vault",
    "body": "A community member called the $3 million wipeout “performance art,” saying that only in crypto do villains torch millions purely for the sake of the plot.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54360961,
    "published": 1763065651000,
    "title": "Solana Slides 5% to $145 as Technical Breakdown Overshadows ETF Momentum",
    "body": "The token fell through key support despite elevated trading volume and continued institutional inflows into spot ETFs.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Technical Analysis|Solana|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54360999,
    "published": 1763065239000,
    "title": "FDIC Considers Guidance Over Tokenized Deposit Insurance",
    "body": "The head of the Federal Deposit Insurance Corp. said the regulator is working on guidance for tokenized deposit insurance, a move that would help steer financial institutions that want to broaden their footprint in digital assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54360997,
    "published": 1763064979000,
    "title": "Bitcoin Sinks Deeper Below $100,000 as Bear Market Grips Crypto",
    "body": "Bitcoin sank deeper below the $100,000 mark, dragged down by a fresh wave of risk aversion and a selloff in tech stocks that reignited Wall Street jitters.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54361381,
    "published": 1763066162000,
    "title": "UFC taps Polymarket to add betting signals for live fight coverage",
    "body": "Polymarket’s onchain prediction data and fan-sentiment feeds will be integrated across UFC events, creating a new interactive layer for viewers.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54362341,
    "published": 1763068500000,
    "title": "Ether’s chance of turning bullish before 2025 ends depends on 4 critical factors",
    "body": "Ether’s struggle to reclaim $4,000 is the result of weakening onchain activity, a decline in fees, and competition from Solana, BNB Chain, and upcoming altcoin ETFs.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54362144,
    "published": 1763068263000,
    "title": "WBTC expands to Hedera as Bitcoin liquidity flows into new DeFi rails",
    "body": "Wrapped Bitcoin's move to Hedera brings tokenized BTC and increased liquidation to the network's growing decentralized finance ecosystem.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]