[
  {
    "id": 56035601,
    "published": 1766143812000,
    "title": "Bitcoin Feels The Weight Of Quantum Risk Concerns, Industry Leaders Warn",
    "body": "Concerns over quantum computing are weighing on Bitcoin’s price and slowing some investment flows, amid a sharp divide between developers and many investors. Related Reading: UK Crypto Ownership Takes Biggest Hit Since 2021, Regulator Says Developers Call Threat Distant According to Bitcoin developer Adam Back of Blockstream, quantum machines remain far from able to break Bitcoin’s protections. He said the tech is still “ridiculously early” and that research hurdles persist. Back expects no real threat within the next decade and argued that even if parts of Bitcoin’s cryptography were compromised, the network would not automatically be emptied. Security, he noted, does not rest solely on encryption in a way that would allow mass theft on the blockchain. i think the risks are short term NIL. this whole thing is decades away, it’s ridiculously early and they have massive R&D issues in every vector of the required applied physics research to even find out if it’s possible at useful scale. but it’s ok to be “quantum ready” and — Adam Back (@adam3us) December 18, 2025 The Risk That Keeps Some Awake Other voices in the community disagree. Jameson Lopp, a well-known Bitcoin engineer, has warned about the worst-case outcome if quantum advances allowed attackers to break the ECDSA signature scheme that secures many wallets. In that scenario, forged signatures could be used to move funds, and user confidence might erode quickly. That warning has been repeated as a technical possibility, not as something imminent. How should we treat quantum vulnerable coins in a future where quantum computing becomes a threat? This panel from the Presidio Quantum Bitcoin Summit features myself, @theblackmarble, and @cryptoquick.https://t.co/jhr6hjLXru — Jameson Lopp (@lopp) September 14, 2025 Investors Worry, Capital Shifts Nic Carter, a partner at Castle Island Ventures, told observers that it is “extremely bearish” when influential developers appear to dismiss any quantum risk outright. He said the gap between investor concern and developer assessment is large. Reports have disclosed that some capital is being held back while large holders consider spreading risk into other assets. Craig Warmke of the Bitcoin Policy Institute added that perceived quantum risk has already pushed some holders to reduce their Bitcoin positions. Quantum risk is stemming the flow of capital into bitcoin, and encouraging large holders to diversify out of bitcoin. When non-technical people express concerns, they sometimes use technically incorrect language. It’s frustrating to see technical people dismiss concerns with an… https://t.co/MtSNY7Ivg3 — Craig Warmke (@craigwarmke) December 18, 2025 Current Technology Falls Short Most cryptographers agree quantum computers today are not powerful enough to crack Bitcoin’s cryptography. That assessment is widely reported by analysts who follow both fields. Metaculus’s median date for when quantum computers will break modern cryptography is 2040:https://t.co/Li8ni8A9Ox Seemingly about a 20% chance it will be before end of 2030. — vitalik.eth (@VitalikButerin) August 27, 2025 Still, the timeline is debated. Based on reports from researchers and public comments from industry figures like Vitalik Buterin, there is a measurable chance — about ~20% — that a machine capable of breaking today’s crypto could exist by 2030. That estimate has prompted calls for proactive steps. Related Reading: Trump-Linked World Liberty Backs USD1 With Treasury-Fueled Expansion Calls For Preparedness Grow Financial institutions and national programs, the reports say, are investing heavily in quantum work, and tools like AI are accelerating research in the field. As a result, many in the crypto world argue contingency plans should be ready well before any practical threat appears. Suggestions include moving to quantum-resistant signature schemes and improving wallet practices so funds are not left exposed while upgrades take place. Some experts point out that banks and other big targets may face attacks earlier, which could give the crypto sector time to respond. Featured image from Shutterstock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|quantum computers",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56036251,
    "published": 1766144649000,
    "title": "Oracle TikTok deal lifts AI mining stocks as bitcoin tags $88,000",
    "body": "Oracle shares jumped 6% in pre-market on Friday as TikTok's U.S. agreement helped calm AI bubble fears after a volatile macro week.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|AI|Mining|TikTok|Oracle|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56036353,
    "published": 1766144747000,
    "title": "Jump Trading sued for $4 billion in connection to Do Kwon’s Terra Labs collapse: WSJ",
    "body": "The administrator winding down what remains of Terraform is suing Jump Trading, accusing it of contributing to its demise while profiting illegally.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Terra luna|Terraform|Do Kwon|Jump trading|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 56036640,
    "published": 1766143800000,
    "title": "Crypto Markets Today: Bitcoin rallies on Japan rate hike as futures traders pile in",
    "body": "BTC rose to $88,000 after the Bank of Japan raised interest rates. The increase, seen as a potential risk-off trigger, failed to spark a flight into the yen.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|Derivatives|market analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56039219,
    "published": 1766149210000,
    "title": "XRP Holders Are In For More Pain As There’s ‘Not A Single Support Holding’",
    "body": "XRP holders could be facing another prolonged stretch of downside pressure as the cryptocurrency continues to lose ground in a weakening market. XRP’s performance this period has been underwhelming enough that analysts have seemingly given up hope of the price challenging higher resistance levels in the near term. They revealed that XRP has slipped below key support zones, leaving few technical barriers to slow further declines. XRP Faces Further Decline As All Support Fails A crypto market analyst who goes by the name ‘Guy on the Earth’ on X has shared a rather bleak outlook on XRP’s near-term prospects. In his post on Thursday, the analyst revealed that XRP looks set for more pain as the market structure continues to deteriorate. He noted that price action is now threatening to lose its Descending Channel, signaling overall weakness rather than stabilization. Related Reading: Bitcoin Just Entered Extreme Oversold Levels And Analysts Predict New ATH Targets According to the expert, the probability of XRP reclaiming the $1.95 level by the weekly close is incredibly low. However, losing this consolidation range that has contained price since November 2024 opens the door to a technical downside target near $0.90. He also pointed out that a confirmation from the monthly timeframe aligns with the two-week chart, which is fast approaching its close in just a few days. Guy on the Earth stated there was little optimism left in the current price setup. He emphasized that no meaningful support levels are holding, and the market demand appears thin, leaving XRP vulnerable to continued selling pressure and potential declines. The analyst’s review of the cryptocurrency’s performance was blunt, suggesting that the market “is what it is” at this stage. Looking at the chart shared alongside the analysis, XRP is clearly trading within a well-defined downward channel that has guided price lower for several months now. Each bounce attempt has been capped by descending resistance, reinforcing the cryptocurrency’s bearish trend. Recent candles also show price drifting toward the lower boundary of the Descending Channel, increasing the risk of a correction. Momentum indicators at the bottom of the chart also reflect ongoing pressure. XRP’s Relative Strength Index (RSI) sits near the lower end of its range, showing persistent weakness as price fails to recover. Related Reading: Ripple Goes Institutional: What The Doppler Finance And SBI Partnership Means For XRP Analyst Weighs Short-Term Hope For XRP When asked by a crypto community member if a daily close back inside the Descending Channel could temporarily save XRP from an extended downturn, Guy on the Earth acknowledged the possibility. He stated that such a move could help in the short term but described it as a “trivial” development compared to larger structural levels. The crypto analyst’s focus remains on the $1.95 level on the two-week close, highlighting it as the most critical area to watch. He pointed out that this structure has remained intact for the past 13 months, making it a defining support zone for XRP. While bouncing back to the channel would not erase the broader bearish trend, the expert revealed that it would at least suggest that XRP still has a chance to grow. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|ripple news|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56039995,
    "published": 1766149996000,
    "title": "What Malaysia’s royal stablecoin reveals about Asia’s shift to tokenized money",
    "body": "Malaysia’s RMJDT shows how Asia is pulling stablecoins into regulated finance, linking tokenized assets with local-currency onchain settlement.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      }
    ]
  },
  {
    "id": 56040349,
    "published": 1766150738000,
    "title": "Terraform Bankruptcy Admin Sues Jump Trading for $4B Over TerraUSD Collapse: Report",
    "body": "Jump is accused of unlawfully profiting from and contributing to the collapse of Terra, in a lawsuit seeking $4 billion in damages.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "terra-luna-2|luna-wormhole|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 56041255,
    "published": 1766151861000,
    "title": "Solana AI token Ava hit by launch sniping tied to deployer: Bubblemaps",
    "body": "Bubblemaps says 23 wallets tied to the Ava deployer sniped 40% of the AVA supply at launch. The Solana AI token later fell 96% from its peak.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56041763,
    "published": 1766152849000,
    "title": "Here’s How Much % Of Bitcoin Supply Is Currently Sitting In Losses",
    "body": "On-chain analytics platform Glassnode has revealed the number of Bitcoin supply that is currently sitting at a loss. This comes as the BTC price continues to trade below the psychological $90,000 level following its crash, which began last month. Here’s The Amount Of Bitcoin Supply At A Loss In a report, Glassnode revealed that the Bitcoin supply in loss has risen to 6.7 million BTC, marking the highest level of loss-bearing supply observed in this cycle. The analytics platform further noted that this represents 23.7% of the circulating supply, which is currently underwater. 10.2% of this supply is held by long-term holders and 13.5% by short-term holders. Related Reading: The Bearish Structure That Puts Bitcoin Price At $92,550, And Then $82,000 Glassnode stated that this distribution suggests that, much like in prior cycle transitions into deeper bearish regimes, the loss-bearing Bitcoin supply accumulated by recent buyers is gradually maturing into the long-term cohort. Meanwhile, the analytics platform noted that the 6-7 million range, which has been at a loss since mid-November, mirrors early transitional phases of prior cycles, where mounting investor frustration came before a shift toward more bearish conditions and intensified capitulation at lower Bitcoin prices. Notably, the Bitcoin price has dropped to levels last seen in 2024, erasing its year-to-date (YTD) gains. Glassnode stated that this has left behind a dense supply cluster accumulated by top buyers in the $93,000 to $120,000 range. The resulting supply distribution is said to reflect a top-heavy market structure where recovery attempts are capped by heavy overhead sell pressure, especially in the early stages of a bearish phase. Glassnode declared that as long as the Bitcoin price remains below this range and fails to reclaim key thresholds, most notably the Short-Term Holder Cost Basis at $101,500, the risk of further corrective downside persists. BTC Spot Demand Is Unstable Glassnode revealed that the Bitcoin spot market flows continue to reflect an uneven demand profile across major venues. The Cumulative Volume Delta bias is said to show periodic bursts of buy-side activity, but has failed to develop into sustained accumulation, especially during the recent BTC price pullbacks. Related Reading: Why Is Bitcoin And Ethereum Prices Down Today? BlackRock Deposits Spark Worry The on-chain analytics platform noted that the Coinbase spot CVD remains relatively constructive, indicating steadier participation from US-based investors. On the other hand, Binance and aggregate Bitcoin flows remain choppy and largely directionless. Glassnode stated that these dispersion points point to selective engagement rather than coordinated spot demand. Meanwhile, the platform alluded to recent Bitcoin price declines, which it pointed out have not triggered decisive expansion in positive CVD. Glassnode noted that this suggests dip-buying remains tactical and short-term. In the absence of sustained accumulation across all venues, Bitcoin’s price action continues to rely more on activity in the derivatives market and liquidity conditions rather than organic spot demand. At the time of writing, the Bitcoin price is trading at around $86,800, up in the last 24 hours, according to data from CoinMarketCap. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|Binance|bitcoin|Bitcoin news|bitcoin price|Bitcoin Spot Market|Bitcoin supply|btc|BTC news|btc price|btcusd|BTCUSDT|Coinbase Spot CVD|CoinMarketCap|cumulative volume delta|glassnode|Year-To-Date|YTD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56041757,
    "published": 1766152800000,
    "title": "Re-litigating the GENIUS Act Brings Risk and No Rewards",
    "body": "If bipartisan agreements like the GENIUS Act can be immediately reopened whenever an incumbent industry dislikes their competitive implications, legislative compromise becomes impossible, argues Blockchain Association CEO Summer Mersinger.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Opinion|Stablecoin legislation|US Congress|Opinion",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      }
    ]
  },
  {
    "id": 56042373,
    "published": 1766153663000,
    "title": "CoinDesk 20 Performance Update: Index Jumps 4.6% as All Constituents Trade Higher",
    "body": "Sui (SUI) gained 7% and Solana (SOL) rose 6.9%, leading the index higher.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "CoinDesk Indices|CoinDesk Indices|CoinDesk 20|charts|Prices|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 96,
        "NAME": "SUI",
        "CATEGORY": "SUI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56042986,
    "published": 1766154496000,
    "title": "Is Bitcoin Primed for a 2026 Breakout? Analysts Weigh History vs. Fundamentals",
    "body": "Bitcoin's oversold RSI signals a potential rally to $170K, analysts argue, as record ETF inflows and fading headwinds build a bullish case.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56044194,
    "published": 1766156439000,
    "title": "Dogecoin Holds The Floor, But Momentum Says Otherwise — A Critical Standoff Unfolds",
    "body": "Dogecoin is showing resilience at key support, with buyers repeatedly stepping in to absorb downside pressure. However, momentum indicators and the broader structure continue to favor the bears, keeping the short-term trend under stress. This tug-of-war sets the stage for a decisive move, as the next reaction will determine whether DOGE stabilizes or slides deeper. DOGE Stuck In A Prolonged Corrective Phase According to a recent update by More Crypto Online, Dogecoin’s price action remains stuck in a corrective phase that has been in place since November 2024. The sharp flash crash on October 10 added complexity to the broader structure, making the chart harder to interpret. However, the core scenarios outlined in earlier analyses are still valid, with the short-term trend clearly leaning to the downside. Related Reading: Fading ETF Interest Puts Pressure on Dogecoin as Price Approaches Critical Cost-Basis Zone Although the “yellow” scenario allows for the possibility of one more push higher, downside momentum is still currently in control. Until DOGE shows a decisive reaction at a major support level, or at least manages to stabilize before slipping below the 9.6-cent level that marks the October 10 low, further weakness should be expected. Initial support sits at 9.6 cents, followed by deeper levels at 8.0 cents and then 5.4 cents. Whether price eventually reaches these lower targets is still uncertain, but for now, there are no technical signals suggesting that a local bottom has formed. Overall momentum remains negative, with DOGE still trading within a local downtrend. While a bullish reversal could develop at some point, current conditions do not justify adopting a bullish bias. Trying to anticipate a reversal ahead of confirmation carries increased risk in this environment, making caution the prudent approach for now. Bears Press, But Dogecoin Refuses To Break Crypto analyst Broke Doomer revealed that DOGE is displaying significant resilience, as bears have attempted to push the price lower multiple times without success. Despite the persistent downward pressure, the price continues to hold its ground, suggesting that the current support level is much firmer than sellers anticipated. Related Reading: Dogecoin Price Can Stage A 96% Rally If It Breaks This Falling Wedge Pattern The analyst noted that every dip into this specific zone is being bought up relatively quickly, a clear indication that strong bids are still stepping in whenever weakness is shown. This aggressive “buy-the-dip” behavior suggests that institutional or large-scale buyers are likely positioning themselves within this consolidation range, preventing a deeper breakdown. Given this ongoing battle between supply and demand, the focus has now shifted to the longevity of this base. Broke Doomer raised the question of how long this support will hold before buyers finally seize full control of the momentum. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Dogecoin|Broke Doomer|Corrective Phase|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt|More Crypto Online",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56044172,
    "published": 1766156400000,
    "title": "Most Influential: Hsiao-Wei Wang and Tomasz K. Stańczak",
    "body": "The Ethereum Foundation’s new leaders hope to bring in a new era for the second-largest cryptocurrency.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Ethereum Foundation|CoinDesk Most Influential 2025|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56043914,
    "published": 1766156148000,
    "title": "DraftKings enters prediction markets with CFTC-approved app for real-world events",
    "body": "The sports-betting giant enters the growing world of event contracts with CFTC-registered DraftKings Predictions in 38 states.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Prediction Markets|Sports|Sports Betting|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 56044000,
    "published": 1766156070000,
    "title": "Wall Street bank JPMorgan says stablecoin market could grow to $600 billion by 2028",
    "body": "The bank said stablecoin growth is still mostly driven by crypto trading, and rising payments use may boost velocity more than supply.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Stablecoins|JPMorgan|Analysts|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56047159,
    "published": 1766160962000,
    "title": "South Korean Police Probe Counterfeit Cash Ring That Targeted Crypto Traders",
    "body": "Investigators said suspects printed fake 50,000-won bills to scam crypto holders in face-to-face trades.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56048170,
    "published": 1766162580000,
    "title": "Foundation behind restaking protocol EigenLayer plans bigger rewards for active users",
    "body": "An Incentives Committee would direct programmatic token emissions, focusing allocations on participants that secure AVSs and contribute to the EigenCloud ecosystem.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|EigenLayer|Ethereum News|Governance|Eigenlabs|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      }
    ]
  },
  {
    "id": 56048850,
    "published": 1766163662000,
    "title": "Decrypt’s 2025 Project of the Year: Hyperliquid",
    "body": "Hyperliquid, a venue for high-risk leveraged trading on volatile assets, captured the attention of the crypto industry like no other project this year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Long Reads",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56048504,
    "published": 1766163230000,
    "title": "Bitcoin earns base case target of $143,000 at Citigroup",
    "body": "The Wall Street bank said its bitcoin forecast relies on further crypto ETF inflows and a continued rally in traditional equity markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Citigroup|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56048688,
    "published": 1766162232000,
    "title": "OpenAI bailed out? Trump Media stock up 40%! Wallet Connect Interview",
    "body": "Commission-free stock and etf trading (u.S.), allowing users to trade equities alongside crypto using usd or usdc. Prediction markets, enabling trading on real-world outcomes like elections, sports, and economic data via a partnership with kalshi. Equity futures and perpetuals trading, expanding derivatives access directly inside the main coinbase app. Solana dex trading via jupiter, allowing users to swap solana tokens directly on coinbase. New borrowing functionality against btc and eth holdings. Coinbase token sales, allowing for ico launches and early-stage token support. Coinbase tokenize, an institutional platform designed to support tokenized assets, including tokenized stocks over time. Base app global launch, making coinbase’s onchain “everything app” available in more than 140 countries. Coinbase business, now generally available, offering payments, invoicing, and usdc-based tools for companies. Expanded stablecoin and payments apis, including embedded wallets and custom-branded stablecoins for builders. Coinbase advisor, an ai-powered assistant designed to help users navigate portfolios and coinbase products.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 205,
        "NAME": "TOKEN SALE",
        "CATEGORY": "TOKEN SALE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56047048,
    "published": 1766160879000,
    "title": "Citi is still a believer in crypto stocks despite bitcoin being rocked to end the year",
    "body": "Circle remains the bank's top pick in the sector, with Bullish and Coinbase following.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Circle|Gemini|Bullish|Citi|Strategy|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56050124,
    "published": 1766165466000,
    "title": "Polish parliament approves revived crypto bill, heads to Senate",
    "body": "The legislation, which many have criticized for being overly restrictive for the digital asset market, was reintroduced with “not even a comma” changed, according to one lawmaker.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56050870,
    "published": 1766166900000,
    "title": "Coinbase ‘cautiously optimistic’ on 2026 as crypto nears institutional inflection point",
    "body": "Coinbase Institutional says clearer regulation, stablecoin growth and shifting macro conditions could mark a turning point for crypto markets in 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56050595,
    "published": 1766166363000,
    "title": "New Malware Poses as Roblox Mods to Steal Crypto Credentials",
    "body": "The Stealka malware is inserted into pirated mods for video games including Roblox, and can lift sensitive info from apps.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|dogecoin||monero|Gaming",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 57,
        "NAME": "XMR",
        "CATEGORY": "XMR"
      }
    ]
  },
  {
    "id": 56051390,
    "published": 1766167748000,
    "title": "SBF's cohorts at FTX take last SEC hit, Ellison banned from company roles for decade",
    "body": "Three of Sam Bankman-Fried's top lieutenants atop the former FTX empire — Caroline Ellison, Gary Wang and Nishad Singh — agreed to consent judgments.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Caroline ellison|FTX|Sam Bankman-Fried|Nishad singh|Gary wang|U.S. Securities and Exchange Commission|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 56052289,
    "published": 1766169078000,
    "title": "New Bitcoin whales are rewriting BTC’s market structure: Data",
    "body": "Bitcoin's onchain data reveals new BTC whales with 50% of the realized capital, highlighting a shift in how capital is shaping the market.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56052288,
    "published": 1766169052000,
    "title": "UK crypto regulation is coming: What the FCA’s new consultation means",
    "body": "The UK’s financial watchdog has launched a sweeping consultation that could reshape how crypto exchanges, staking services and DeFi operate ahead of a 2027 rollout.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56053084,
    "published": 1766170815000,
    "title": "$2,500 Solana? Scaramucci Says The Setup Is Already In Motion",
    "body": "SkyBridge Capital founder Anthony Scaramucci said he still sees a path to Solana reaching $2,500 over a five-to-ten-year horizon, arguing that tokenization plus clearer US regulation could turn Solana into a core financial “rail system.” Scaramucci made the remarks in an interview with SolanaFloor filmed during last week’s Solana Breakpoint conference and released on Dec. 18. Why Solana Is Still Poised For $2,500 Scaramucci framed the $2,500 thesis as a long-duration bet that won’t play out cleanly. “It’s not going to come without… volatility,” he said, pointing to what he called a messy US regulatory year and sticky inflation as headwinds that “probably slowed down our trajectory.” “If you had asked me at the beginning of the year” whether Washington would pass stablecoin legislation and “the market structure, the CLARITY bill,” he said he would have expected both. “That did not happen.” Still, he argued “the timing is still right,” with the caveat that price will likely remain jumpy until those macro and regulatory variables resolve. Related Reading: Solana (SOL) Support Shattered, Potential $100 Test Looms, Says Analyst To explain the patience required, Scaramucci leaned on a tech-investing analogy, recalling Amazon’s drawdowns by 90% before mass adoption. The lesson, in his words: stay with “great technology” through uncertain stretches because durable infrastructure eventually gets adopted. Asked what surprised him most this cycle, Scaramucci singled out the Trump and Melania memecoins. He described their Solana launch as “a compliment to Solana” because it was selected for “ability to handle large scale large volume transactions with great certainty and finality.” But he also argued the episode backfired on policy. “I think those coins slowed down the regulatory process in the US,” he said, suggesting that the optics of a US president entering the memecoin business created a political “foil” that opponents could use to resist crypto bills. “I think we would have gotten everything that we wanted this year had the president sort of stayed out of the meme coin business,” he added, calling it “short-term regulatory” damage. He also claimed the memecoin surge “sucked out all the liquidity from a lot of the altcoins,” which he said “hurt the industry,” even as it showcased Solana’s throughput. Tokenization Is The Endgame Scaramucci’s core argument was simple: tokenization is coming, and Solana is positioned to host a meaningful share of it. He said Paul Atkins, whom he described as a longtime personal friend, delivered what Scaramucci considers an underappreciated prediction: “In 5 years all of our assets are going to be tokenized.” Scaramucci then pushed his own conclusion: “What’s going to be the number one rail system to tokenize on? It’s going to be Solana.” He argued superior systems tend to win through adoption, not ideology. “If you have something that works better than something else, it gets adopted,” he said, comparing Solana’s trajectory to the internet’s jump from dial-up to today’s high-bandwidth reality. He also flagged operational progress on the network. “I don’t want to jinx us,” he said, but suggested Solana had gone “two years now without any” downtime. Related Reading: Solana Value Proposition Extends Beyond Tech Into Economic Infrastructure SolanaFloor challenged Scaramucci on why SkyBridge tokenized a $300 million fund on another chain. Scaramucci said it was “a very small fund,” and that a larger fund “will likely get tokenized on Solana.” He also rejected maximalism: “I don’t believe in chain monogamy,” he said. His view is that “three or four chains” will win, naming Solana and Avalanche. He argued Avalanche can be attractive for certain compliance-driven deployments, while Solana is where “stocks and bonds are going to be tokenized” and where “the larger funds are going to be tokenized.” Scaramucci also disclosed his personal positioning: “My largest personal position even greater than Bitcoin is my position in Solana and I have it all staked,” he said, adding he owns Avalanche and Bitcoin and holds a “very small position” in Ethereum. Scaramucci tied the next leg of the cycle to US policy and liquidity. If the US passes market-structure rules next year, he said, prices should respond. If inflation cools and the Fed can cut more aggressively under a new chair, he argued that would add liquidity and reinforce a “positive flywheel.” At press time, SOL traded at $125. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Solana|Anthony Scaramucci|Sol|SOL news|SOL Price|Solana news|Solana Price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56053199,
    "published": 1766170800000,
    "title": "Bitcoin dips below $85K as DATs face ‘mNAV rollercoaster’: Finance Redefined",
    "body": "The volatility of the cryptocurrency market is threatening the stability of corporate crypto treasury companies, resulting in larger swings in their net asset value that threaten their fundraising abilities.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56054936,
    "published": 1766174402000,
    "title": "Bitcoin Price Lags Network Utility: A Valuation Reset Is Underway",
    "body": "Bitcoin continues to struggle below the $90,000 level as volatility remains elevated and market conviction weakens. Short-term price swings have failed to establish a clear directional bias, reinforcing a broader sense of uncertainty among traders and investors. While price remains historically high, internal market conditions suggest that underlying stress is building beneath the surface, particularly within the mining sector. Related Reading: Bitcoin Faces Elevated Downside Risk: Loss Selling Takes Hold As STH SOPR Falls Below 1 A recent analysis by Axel Adler highlights growing pressure on Bitcoin miners using the Miner Financial Health Index, a composite metric that assesses mining profitability relative to price. Readings above 80% historically signal excessive profitability and late-cycle conditions, while levels below 20% indicate financial strain and elevated risk for miners. Currently, the index sits near 22%, once again approaching the Alert zone. This places miner profitability near one of its weakest levels since 2022, despite Bitcoin trading well above its summer 2022 price range. Similar conditions have typically appeared during post-correction phases or shortly after halving events, when revenue compression collides with high network difficulty. This divergence between elevated price levels and deteriorating miner fundamentals raises important questions about the sustainability of Bitcoin’s current structure as the market searches for its next equilibrium. Miner Economics Signal Growing Stress Beneath Bitcoin’s Price Adler’s analysis further examines the demand–supply balance within Bitcoin’s mining economics, offering deeper insight into why miner profitability continues to deteriorate. This index tracks the ratio of transaction fee revenue relative to new coin issuance, effectively measuring how much users are willing to pay for blockspace compared to the rate of supply expansion. Historically, readings above 70% indicate strong demand and a risk-on environment, while levels below 30% reflect structural weakness. Currently, the demand–supply balance sits near 38% on a 30-day average. While not yet in outright stress territory, the metric has declined steadily from local highs above 60%, placing it firmly in a neutral-weak zone. This trend suggests that organic demand for blockspace remains subdued, with users showing little urgency to outbid one another through higher fees. For a clear improvement in conditions, Adler notes that the index would need to reclaim levels above 50%, likely requiring a surge in transaction activity or a meaningful on-chain catalyst. This weakness is mirrored in absolute miner revenue. Bitcoin miner revenue, measured in US dollars and smoothed over seven days, has fallen to roughly $40 million after a recent peak. Although consistent with 2025 averages, this level remains well below revenue spikes seen during periods of heightened network activity. With difficulty remaining elevated, declining revenues amplify pressure on less efficient miners, reinforcing the stress signaled by both profitability and demand metrics. Related Reading: Legendary Bitcoin OG Deepens Ethereum Bet Despite Losses Exceeding $70 Million Bitcoin Price Struggles to Reclaim Key Trend Levels Bitcoin’s price action on the daily chart reflects a market struggling to regain structural strength after a sharp corrective phase. BTC is currently trading around the $88,000 area following a rebound from recent lows, but the broader trend remains fragile. The selloff from the $120,000–$125,000 region marked a clear break in momentum, with price slicing below the short-term moving averages and triggering accelerated downside pressure. Notably, Bitcoin lost the daily 50-day and 100-day moving averages during the decline, confirming a shift toward a bearish short-term structure. While the 200-day moving average continues to trend higher and remains intact, price is now consolidating just below it, turning this level into a critical zone of resistance. As long as BTC fails to reclaim and hold above this long-term trend line, upside attempts are likely to face selling pressure. Related Reading: Bitcoin Structure Turns Bearish As Structural Indicators Flip Negative The sharp increase in sell volume during the breakdown contrasts with relatively muted buying volume on the rebound, suggesting that recent upside moves are corrective rather than impulsive. Structurally, Bitcoin is forming a lower-high pattern, which keeps downside risk elevated if support near $85,000–$86,000 fails. For bulls to regain control, BTC must reclaim the 200-day moving average and establish higher highs. Until then, the chart favors consolidation or further volatility rather than a sustained recovery. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|Bitcoin network activity|Bitcoin news|bitcoin price|Bitcoin valuation|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56054593,
    "published": 1766173581000,
    "title": "Samourai co-founder claims Biden-era lawfare in calling for Trump pardon",
    "body": "Keonne Rodriguez said on social media that he will report to prison on Friday to begin his five-year sentence for operating an illegal money transmitter.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 56056849,
    "published": 1766178000000,
    "title": "Crypto Biz: Bank stablecoins get a rulebook; Bitcoin gets a land grab",
    "body": "FDIC reveals a path for bank-issued stablecoins under the GENIUS Act as corporate BTC treasuries expand, Anchorage buys Securitize’s RIA arm and Bhutan taps reserves.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56056497,
    "published": 1766177206000,
    "title": "Galaxy predicts stablecoins will overtake ACH transaction volume in 2026",
    "body": "In its annual predictions report, Galaxy’s analysts said onchain dollar transfers could process more volume next year than the US bank system that handles payroll and bill payments.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 56057581,
    "published": 1766179531000,
    "title": "Crypto's closest ally in Congress, Sen. Lummis, is retiring next year",
    "body": "The most tireless advocate of digital assets issues in the U.S. Senate said she's grown too tired to keep at it, leaving her Republican seat in play next year.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Cynthia Lummis|U.S. Senate|crypto legislation|U.S. Senate Banking Committee|U.S. Political Elections|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56057603,
    "published": 1766179422000,
    "title": "South Korean Hyundai Offices Evacuated Over Bomb Threat, Bitcoin Ransom Demand: Report",
    "body": "An anonymous individual called in a bomb threat on two Hyundai buildings in South Korea, demanding over $1 million in Bitcoin as ransom.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56057860,
    "published": 1766179800000,
    "title": "SEC confirms years-long director bans for former Alameda, FTX executives",
    "body": "In the latest update on the FTX saga, the SEC confirmed Caroline Ellison had consented to a officer-and-director bar, preventing her from leading any companies for 10 years.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 56058646,
    "published": 1766181630000,
    "title": "Ethereum Exchange Supply Just Crashed To New Lows, Why This Is Bullish For Price",
    "body": "CryptoQuant has released a new report, highlighting a significant shift in Ethereum’s exchange supply dynamics and institutional behavior. According to the data, the amount of ETH held on crypto exchanges has crashed to unexpected lows. The decline coincides with growing institutional accumulation, a trend often viewed as an early signal of a bullish price outlook. Ethereum Exchange Balances Fall To 2016 Lows Arab Chain, a crypto analyst on CryptoQuant, revealed that Ethereum’s exchange supply ratio across all tracked platforms has declined to approximately 0.137. According to the data referenced in the report, this represents one of the lowest readings observed since 2016. Related Reading: Ethereum 2-Year Trend Maps Out This Unique Crash Path To Bottom At $2,187 The analyst emphasized that this metric reflects the proportion of total ETH supply currently held on exchanges relative to the overall circulating supply. Lower levels of this metric reflect a smaller fraction of ETH ready for liquidation on exchanges, which the analyst identifies as an important factor in understanding market liquidity conditions. Arab Chain also noted that the sustained decline in this ratio indicates a continued outflow of ETH from centralized exchanges to external wallets. This movement suggests that a smaller portion of Ethereum’s supply is readily available for trading. It also signals growing confidence among holders who prefer long-term positioning over short-term speculation. From a broader market perspective, a shrinking exchange supply is often seen as bullish for prices due to basic supply-and-demand dynamics. When fewer coins are available to sell, even a slight increase in demand can push prices up, as buyers compete for a smaller pool of liquid ETH. Reduced liquidity can also limit the intensity of declines, as large sell orders become harder to execute without moving the market. In his report, Arab Chain references historical behaviour, illustrated by a chart showing the Ethereum supply ratio for all exchanges. The analyst noted that similar declines in exchange supply have occurred during periods of reaccumulation or in the lead-up to stable price movements following significant market volatility. Ethereum Supply On Binance Crashes Arab Chain has also shared insights on Ethereum’s supply on Binance. The analyst disclosed that ETH balances on the exchange have been steadily declining over the past few months. As one of the largest crypto exchanges in the world, Binance’s reserve changes often reflect broader market sentiment. Related Reading: Why Did The Bitcoin, Ethereum, And XRP Prices Crash, And Will It Continue? The CryptoQuant report highlights that the Exchange Supply Ratio on Binance has crashed to 0.0325, a relatively low level compared to previous months. This indicates a steady withdrawal of ETH from the crypto exchange, reducing the amount of tokens available for immediate spot market selling. Arab Chain suggested that the drop in Ethereum supply on Binance shows that traders are becoming more cautious. Rather than engaging in short-term trades, many appear to be holding ETH off exchanges due to ongoing market volatility and uncertainty. The analyst added that the falling supply, combined with ETH’s price stability, indicates lower selling pressure. It also signals that the market may be entering a new phase of liquidity absorption and repositioning. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|Arab Chain|Binance|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|ethusd|ETHUSDT|exchange supply ratio",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56058453,
    "published": 1766181201000,
    "title": "FTX, Alameda Execs Will Be Barred From Wall Street Roles for Up to 10 Years",
    "body": "The SEC proposed settlement agreements for key members of FTX co-founder and former CEO Sam Bankman-Fried’s inner circle.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 56058825,
    "published": 1766181915000,
    "title": "Brooklyn Man Charged in Phishing Scheme That Swiped $16 Million From Coinbase Users",
    "body": "A 23-year-old Brooklynite, Ronald Spektor, was charged with stealing $16 million in cryptocurrency from dozens of Coinbase users.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56061829,
    "published": 1766188803000,
    "title": "Citi Analysts Project Bitcoin Price Could Reach $189,000 Next Year In Bullish Scenario",
    "body": "The Bitcoin price has experienced a significant correction after reaching all-time highs above $126,000 in October, currently trading just above $87,900. This marks a notable 30% decline over the past few months. Despite this setback, analysts at Citi express optimism for the cryptocurrency’s future, forecasting that its value will continue to rise through 2026. Optimistic Bitcoin Price Predictions According to Citi’s analysts, the base case for the Bitcoin price is set at $143,000, reflecting a potential 62% increase from current levels. In a more bullish scenario, the cryptocurrency could surge to over $189,000, indicating a substantial 114% increase. Conversely, the analysts also present a bear case for the leading crypto, with an estimated price around $78,500, which would represent an additional 10.6% decline from current trading levels. Related Reading: Solana (SOL) Support Shattered, Potential $100 Test Looms, Says Analyst The forecast from Citi relies on the assumption that investor adoption will persist, particularly with an influx of funds into exchange-traded funds (ETFs) projected to reach $15 billion. This influx is seen as a catalyst that could significantly boost the Bitcoin price. Furthermore, ongoing negotiations in the US Senate regarding their version of the crypto market structure bill, namely the CLARITY Act, which aims to regulate Bitcoin under the Commodity Futures Trading Commission (CFTC), is anticipated to enhance market adoption. In contrast to Bitcoin, analysts express concerns regarding Ethereum’s (ETH) potential for growth. They argue that Ethereum, being viewed more as “programmable money,” has seen decreased activity, which has resulted in its current trading price of just below $3,000—40% below its all-time high of $4,964. Additional Catalyst For Price Growth Chris Neiger, an analyst at The Motley Fool, also attaches bullish predictions to the Bitcoin price future, highlighting that recent US job data reflects an unemployment rate increase to 4.6%, the highest since 2021. He asserted that if the Federal Reserve (Fed) chose to lower interest rates by 2026, the Bitcoin price could benefit since lower rates typically enhance the cryptocurrency’s value by making borrowing more affordable. In November, JPMorgan provided a more conservative estimate, suggesting that Bitcoin could reach $170,000 by 2026, with potential upside expected over the next six to twelve months. Related Reading: Crypto Payments Firm MoonPay Set For $5 Billion Valuation With NYSE Owner’s Backing Meanwhile, even more aggressive predictions from market researcher Fundstrat forecast the Bitcoin price could soar between $200,000 and $250,000 by the end of 2026, largely driven by the mainstream adoption of ETFs. Additionally, the establishment of the Strategic Bitcoin Reserve by the federal government has encouraged states to consider similar initiatives. Neiger concludes that just as ETFs have contributed to the credibility of cryptocurrencies and facilitated price increases, the formation of state-level Bitcoin reserves could serve as another critical driver propelling Bitcoin’s value higher in 2026. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|Bitcoin Price Forecast|bitcoin price news|bitcoin price prediction|bitcoin technical analysis|btc|BTC news|btc price|BTC price news|BTCUSDT|crypto|crypto market|crypto news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56063466,
    "published": 1766192450000,
    "title": "Peter Brandt Highlights Bearish XRP Price Chart, ‘You Need To Deal With It’",
    "body": "Veteran chartist Peter Brandt has once again turned his focus to the XRP community after sharing a technical breakdown that points to a bearish market structure on the weekly timeframe for the cryptocurrency. Brandt’s technical analysis focused squarely on chart behavior rather than sentiment, warning that the current setup carries downside implications that traders cannot ignore and must deal with. Peter Brandt Calls Out A Potential Double Top Taking to the social media platform X, Brandt highlighted what he described as a potential double top forming on XRP’s weekly chart. He acknowledged upfront that the pattern could still fail but stressed that, as things stand, the structure leans bearish. Related Reading: Analyst Says This XRP Level Is Keeping Downside Pressure In Check The analysis is based on XRP’s recent price action, which has lost the $2 price level after days of consistent bearish price action in December. Brandt framed the setup as a matter of accepting what the chart is showing rather than arguing against it, bluntly stating that market participants need to deal with the implications instead of dismissing them. His remarks were also directed at persistent XRP optimists, making it clear that his stance is not driven by bias against the asset but by adherence to classical chart principles. Until price action invalidates the pattern, the risk profile is tilted to the downside, and XRP might continue pushing downwards in the near term. “Love it or not — you need to deal with it,” Brandt said. The chart accompanying Brandt’s post shows XRP falling below the support of a flag pattern a few months ago. This breakdown has continued to the lower boundary around $1.80 to $2.00, which has acted as an important support pair against a resistance around $3.5. This support level has acted as a critical support region two times already this year. However, XRP looks like it might be losing this level now at the third time of asking. The weekly moving averages on the chart also appear to be flattening, a sign that upside strength has weakened compared to earlier phases of the cycle. What Would Change The Bearish Outlook A double top pattern is a bearish reversal signal, meaning an uptrend is likely ending and a downtrend is beginning. However, despite his firm tone, Brandt was careful to note that the pattern is conditional, not absolute. “This is a potential double top. Sure, it may fail, and I will deal with this if it does,” he said. Related Reading: XRP Price Falls To Critical Support Level, Is It Time To Panic? A sustained move back above the support at $2 would delay any breakdown into the $1 range. A further sustained reclaim of highs around $2.2, $2.5, $2.7, and $3 would invalidate the double top and force a reassessment of the broader trend. However, until such happens, Brandt’s technical structure continues to favor caution that many XRP proponents might not agree with. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Peter Brandt|Ripple|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56065049,
    "published": 1766196046000,
    "title": "Ethereum Exchange Outflows Soar To $978M: Sign Of Dip Buying?",
    "body": "On-chain data shows the Ethereum exchange netflow has witnessed a negative spike during the past week, a potential sign that investors have been accumulating. Ethereum Exchange Netflow Has Been Red For The Past Week As pointed out by institutional DeFi solutions provider Sentora in a new post on X, Ethereum has seen net outflows from exchanges in the past week. The indicator of relevance here is the “Exchange Netflow,” which measures the net amount of ETH that’s moving into or out of wallets connected with centralized exchanges. When the value of this metric is positive, it means the investors are depositing a net number of tokens to these platforms. As one of the main reasons why holders deposit their coins to exchanges is for selling-related purposes, this kind of trend can be bearish for the asset’s price. Related Reading: Bitcoin & Ethereum Diverge: Longs Dominate BTC, While ETH Shorts Rise On the other hand, the indicator being below zero suggests outflows are dominating the inflows on exchanges. Such a trend can be a sign that investors are in a phase of accumulation, which can naturally be bullish for the cryptocurrency. As the data shared by Sentora shows, Ethereum has seen a weekly Exchange Netflow value of -$978.45 million, indicating that traders have made a massive amount of net withdrawals. The significant outflows have come as Ethereum has witnessed a decline during the past week. As Sentora explains: This signals aggressive accumulation where investors are likely “buying the dip” and withdrawing assets to cold storage or on-chain environments, tightening the liquid supply despite the negative price momentum. Related Reading: Ethereum Risks Slide To $2,000 If December Closes Below This Level: Analyst The price drawdown in the past week has also accompanied a drop in the total transaction fees on the network, meaning that transfer activity has gone down. The blockchain saw about $2.64 million in fees over the last week, which is more than 15% down week-over-week. ETH Saw A Brief Visit Under $2,800 Before Rebounding Ethereum observed a decline to $2,780 on Thursday, but the asset was able to bounce back as it’s now floating just under $3,000. Interestingly, ETH’s bottom was around the same level as a major on-chain supply cluster, as a chart shared by analyst Ali Martinez in an X post shows. In the graph, Martinez has attached the data of the Ethereum UTXO Realized Price Distribution (URPD) from on-chain analytics firm Glassnode. This metric basically tells us how much ETH supply was last transacted at the various price levels that the coin has visited in its history. There is a huge supply zone located at $2,772 on the URPD, suggesting a large amount of investors have their cost basis at it. Generally, such levels act as a support boundary during downtrends, as traders who purchased there buy the dip to defend it. Featured image from Dall-E, Sentora.com, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ethereum|Ethereum dip|Ethereum Dip Buying|Ethereum exchange outflows|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56066278,
    "published": 1766198520000,
    "title": "Bitcoin rallies thwarted by fading Fed rate cut odds, softening US macro",
    "body": "Bitcoin continued to sell near $90,000 as investors reacted to weak US jobs data and slowing economic growth by shifting into safer assets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56066815,
    "published": 1766199650000,
    "title": "Analysts Warn Strategy Could Be Dropped From Multiple Indexes, Potential $9 Billion Loss Predicted",
    "body": "Over the past few months, Strategy (formerly known as MicroStrategy), the largest publicly traded Bitcoin (BTC) treasury company, has found itself at the center of a pressing issue that could lead to its exclusion from the Morgan Stanley Capital International (MSCI) index. This potential move not only poses significant financial risks for the firm but could also have broader implications for the cryptocurrency sector, with analysts estimating that it could result in losses up to $9 billion in demand for its shares. Industry-Wide Consequences The MSCI proposed in October that companies holding digital assets comprising 50% or more of their total assets should be removed from its global benchmarks, arguing that such companies resemble investment funds, which are excluded from its indexes. However, many firms, including Strategy, assert that they are operational companies creating innovative products and argue that MSCI’s proposal is biased against the cryptocurrency industry. Related Reading: Solana (SOL) Support Shattered, Potential $100 Test Looms, Says Analyst MSCI is currently conducting a public consultation, and analysts warn that if it decides to exclude Digital Asset Treasury (DAT) companies, it could prompt other index providers to follow suit. “The conversation already extends beyond just MSCI… to the eligibility of DATs in equity indexes in general,” said Kaasha Saini, head of index strategy at Jefferies, who anticipates that most equity indexes will align with MSCI’s decisions. Asset managers are believed to hold as much as 30% of a large-cap company’s free float, leading to potentially significant outflows if these companies are dropped from major indexes. This situation is particularly precarious for the DAT sector, which often finances its token purchases by selling stock. The company’s CEO, Phong Le, and co-founder Michael Saylor addressed the potential MSCI exclusion in a public letter. They estimated that such a move could lead to $2.8 billion worth of the company’s stock being liquidated and may “chill” the entire industry. In their letter, they explained that excluding DATs could shut them out from the roughly $15 trillion passive investment market, drastically undermining their competitive standing. Major Outflows Predicted For Strategy Analysts at TD Cowen estimated in November that around $2.5 billion of Strategy’s market value is linked to MSCI, with an additional $5.5 billion reliant on other indexes. JPMorgan’s analysis suggested that if MSCI were to exclude Strategy, the company could see $2.8 billion in outflows, a figure that could rise to $8.8 billion if it faced exclusion from other indexes, such as the Nasdaq 100, the CRSP US Total Market Index, and various Russell indexes owned by LSEG. In addition to Strategy, MSCI’s preliminary list identifies 38 companies at risk of exclusion, with a combined issuer market cap of $46.7 billion as of September 30, including French firm Capital B, which is also investing in Bitcoin. Related Reading: Crypto Payments Firm MoonPay Set For $5 Billion Valuation With NYSE Owner’s Backing Alexandre Laizet, Capital B’s director of Bitcoin strategy, remarked that while the current holdings of passive funds in their shares are limited, having access to passive flows is crucial for future adoption. Matt Cole, CEO of US-based Bitcoin buyer Strive—which is not at risk of exclusion—notes that the proposals have largely been factored into market valuations. He added, “On a longer-term basis, I think it raises the cost of capital for all Bitcoin treasury companies.” At the time of writing, the firm’s stock, which trades on the Nasdaq under the ticker symbol MSTR, was trading at $165, marking gains of almost 4% ahead of the close of trading this week. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|crypto|crypto news|Digital Asset Treasury|Michael Saylor|Microstrategy|MicroStrategy news|MSCI index|MSTR|Strategy|Strategy MSCI index|Strategy news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56072108,
    "published": 1766208064000,
    "title": "Adam Back slams Bitcoiner VC for ‘uninformed noise’ about quantum risk",
    "body": "Blockstream CEO Adam Back said that Castle Island Ventures founding partner Nic Carter is “not helping” the ongoing quantum-Bitcoin narrative for Bitcoiners.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 56077692,
    "published": 1766216316000,
    "title": "Fundstrat’s circulating 2026 crypto outlook warns of pullback, contrasting Tom Lee",
    "body": "A circulating report attributed to Fundstrat warns of a potential crypto drawdown in early 2026, setting downside targets for Bitcoin, Ether and Solana.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56083673,
    "published": 1766224808000,
    "title": "Here’s Why The XRP Price Keeps Crashing",
    "body": "On-chain analytics platform CryptoQuant has revealed why the XRP price keeps crashing, recently dropping below the psychological $2 level. The platform noted that the XRP ETF approval has failed to stop the selling pressure but instead looks to have escalated it. Why The XRP Price Is Crashing Despite ETF Success In a CryptoQuant report, analyst PelinayPA revealed that the XRP price is facing significant selling pressure from whales holding between $100,000 and 1m XRP and those holding above 1m. These XRP whales are said to account for the majority of inflows into the crypto exchange Binance. Related Reading: Peter Brandt Highlights Bearish XRP Price Chart, ‘You Need To Deal With It’ These transfers indicate that these whales are typically looking to offload these coins, which is putting selling pressure on the XRP price. PelinayPA noted that after each major inflow spike on the chart, the XRP price forms a lower high and lower low structure, suggesting that supply is overwhelming demand at the moment. The CryptoQuant report noted that this happens because there is no strong new spot buyer in the market. The continuous increase in available supply is also said to keep pushing the XRP lower, even though the whales are not aggressively dumping. Meanwhile, PelinayPA highlighted key price levels to watch out for as the price continues to crash. The analyst stated that, based on the inflow intensity and price reactions, the first major support zone stands between $1.82 and $1.87. She noted that this range marked where the price briefly stabilized and where small buyers appeared. However, XRP still risks crashing to the $1.50 and $1.66 range if the large outflows continue. The chart does not indicate that the altcoin could rally anytime soon with this selling pressure. Whales Took Advantage Of The ETF Narrative The CryptoQuant report stated that, in theory, the XRP ETF process was expected to create institutional demand and push the price higher through spot buying. However, that hasn’t been the case, as there have instead been high-volume XRP inflows to Binance. PelinayPA explained that whales were the first to act as ETF approval expectations increased. Related Reading: XRP Hasn’t Entered A Bear Market Yet; Analyst Shares Why The analyst further revealed that XRP accumulated in advance for the ETF narrative was transferred to exchanges and used as sell-side liquidity. Basically, whales sold the ETF approval story to retail investors. As a result, the XRP price faces significant selling pressure every time it approaches the $1.95 level. PelinayPA reiterated that expecting a bullish move before exchange inflows decline would be an unrealistic assumption. However, it is worth noting that the XRP ETFs have been successful so far, accumulating over $1 billion in net assets in just over a month since their launch. At the time of writing, the XRP price is trading at around $1.90, up almost 4% in the last 24 hours, according to data from CoinMarketCap. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|altcoin|Binance|CoinMarketCap|cryptoquant|PelinayPA|Ripple|Spot XRP ETFs|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]