[
  {
    "id": 54428997,
    "published": 1763197253000,
    "title": "Crypto ‘Pig-Butchering’ Scam Escalating Into A National Security Risk— Study",
    "body": "Chain analysts and law enforcement are sounding the alarm about a type of fraud known as “pig-butchering,” in which criminals groom victims online and push them into fake crypto investments. Related Reading: XRP Earns Academic Praise: University Study Calls It ‘Gold In Your Hands’ According to Chainalysis, crypto scams sent close to $10 billion on-chain in 2024, with pig-butchering revenue growing almost 40% year-over-year and the number of deposits into those scams rising more than 200% — even as the average deposit size fell roughly 55%. These shifts point to a model that now relies on many more victims paying smaller amounts, making the operation both lucrative and hard to trace. Organized Networks Behind The Scams Investigators say these are not lone fraudsters. Reports have disclosed that scam networks operate like organized criminal enterprises, sometimes using trafficked workers in compounds to call, message and manage victims. Victim grooming can span weeks or months, turning emotional manipulation into a steady revenue stream for the gangs. Research and reporting have tied some of these operations to regions in Southeast Asia and to groups that move money through concentrated crypto wallets. AI And Marketplaces Help Scammers Scale Law enforcement and analysts warn that generative AI and service markets are making the pig butchering scams cheaper and faster to run. According to Chainalysis and multiple news outlets, AI tools are being used to create convincing chatbots, voice clones and fake profiles, while online marketplaces sell domain services and hosting that let scammers spin up lifelike investment sites. That combination has helped fraud operators widen their reach and target more people at once. Infrastructure And Sanctions Authorities have started to hit the infrastructure that supports the scams. The US Treasury’s OFAC sanctioned a Philippines-based firm, Funnull Technology Inc., and its alleged administrator for supplying internet infrastructure and tools used by fraud networks. Chainalysis and other researchers tied Funnull’s services to sites used in pig-butchering, and US losses linked to those operations were said to exceed $200 million in some investigations. Sanctions aim to cut off access to the web services scammers use to appear legitimate. Related Reading: Dogecoin Alert! Price Could Explode Over 2,800%, Analyst Says Exchanges And Stablecoin Issuers Help Freeze Illicit Funds Private companies have been part of the response. In a coordinated effort with APAC law enforcement, Chainalysis, exchanges and stablecoin issuers helped trace and block nearly $47 million in USDT that had been consolidated by scammers into a few wallets. Earlier actions involving other cases led to much larger freezes. Those moves show how industry cooperation can stop some cash-outs before criminals convert crypto into fiat. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|btc|chainalysis|crypto|crypto scam|Funnul|pig butchering",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54431670,
    "published": 1763202566000,
    "title": "Robert Kiyosaki says cash crunch driving crash, stays bullish on Bitcoin, gold",
    "body": "Robert Kiyosaki argues a global cash shortage is driving the market crash and says he’s holding Bitcoin and gold, adding he’ll buy more BTC once the downturn ends.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 182,
        "NAME": "BTG",
        "CATEGORY": "BTG"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54432432,
    "published": 1763204421000,
    "title": "Bitcoin Price Won’t Crash To $92,000, Here’s Why",
    "body": "The recent Bitcoin price crash below the $100,000 psychological level has fueled a new wave of bearish predictions, yet not everyone is convinced that a deeper decline is imminent. While many traders expect a correction to $92,000, one analyst has rejected the idea of a price breakdown, insisting that Bitcoin still has unfinished upside potential before any significant retracement Why The Bitcoin Price Won’t Decline To $92,000 Crypto analyst @YazanXBT has become one of the loudest voices negating the increasingly popular $92,000 crash target for Bitcoin. The analyst took to X social media on November 13 to inform the crypto community that, rather than a drop to $92,000, BTC is gearing up for a new all-time high of $145,000. Related Reading: Here’s When The Next Bitcoin Parabolic Phase To $297,092 Will Begin The analyst backed up his bullish projection by pointing to a similar moment during BTC’s previous bear market bottom. He stated that at the time, many people were certain that the Bitcoin price would fall to $12,000 or even $10,000. But instead, the cryptocurrency bottomed at $15,800 before staging one of its strongest price recoveries ever. Essentially, @YazanXBT’s message implies that mass bearish consensus is often a signal that the opposite outcome is more likely. In response to his X post, a crypto community member argued that Bitcoin still has an unfilled Chicago Mercantile Exchange (CME) gap at $92,000. They noted that, based on historical behavior, BTC tends to fill CME gaps before making new highs, implying that a crash is imminent. @YazanXBT dismissed the bearish outlook, reiterating that Bitcoin is much more likely to rally to $145,000 before any pullback to fill the $92,000 CME gap. Notably, a surge to $145,000 would require Bitcoin to break out of its current bearish pressures and climb roughly 50% from where it stands. After seeing weeks of capitulation and massive price declines, BTC is now trading slightly above $96,000, showing no apparent signs of a rebound. Analyst Claims BTC Crash Looks Like Manipulation Crypto market expert @CottonXBT shared a detailed price chart, which highlighted Bitcoin’s drop below $97,000 this week. The chart layout, featuring sharp sell-offs and rapid wicks, has led him to call the recent price dip a possible sign of manipulation rather than a genuine trend reversal. The analyst stressed that this type of price action often occurs when large players attempt to shake out retail investors before driving the market higher again. He urges investors to ignore the Fear, Uncertainty, and Doubt (FUD) and buy more BTC. Related Reading: Popular Crypto Trader Reveals Why Bitcoin Price Is Still Crashing Similarly, other market watchers are interpreting Bitcoin’s pullback as a rare opportunity to accumulate below the $100,000 mark. Simon Dixon, the CEO and co-founder of the online investment platform BnkToTheFuture, urged investors to take advantage of current low levels, noting that they will be getting more BTC for their “fiat shitcoin.” Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|@CottonXBT|@YazanXBT|bitcoin|Bitcoin news|bitcoin price|bnktothefuture|btc|BTC news|btc price|btcusd|BTCUSDT|Chicago Mercantile Exchange|CME|fear|Fear Uncertainty And Doubt|FUD|simon dixon|uncertainty",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54435025,
    "published": 1763209816000,
    "title": "Bitcoin Market Top May Be In As Analyst Shares 1,064-Day Bull Cycle Pattern – Details",
    "body": "In the last week, Bitcoin lost the $100,000 support zone, marking another drastic turn in an extensive correction phase. Since then, prices have traded as low as $94,700 as the premier cryptocurrency strives to find market stability. Amid rising speculations on the current status of the crypto bull run, market expert Ali Martinez shares a technical analysis that may yet confirm many investors’ fears. Related Reading: Massive Bitcoin Bid Walls Spotted On Binance: Bulls Step In With 2,800 BTC Cluster 1,064-Day Cycle Hints Bitcoin Bull Rally May Be Over Since hitting a new all-time high of $126,000 in early October, Bitcoin slipped into a heavy correction phase, losing 24.66% of its market value in the last five weeks. The cryptocurrency has also decisively fallen below the $100,000 psychological support zone, driving a surge of negative sentiments as short-term investors now sit in losses. Interestingly, renowned market pundit Ali Martinez shares historical data that supports most negative postulations of a budding crypto winter. The analyst explains that the Bitcoin bull market has maintained a fixed number of 1,064 days across the last two market cycles. For example, after reaching a cycle bottom of $166 in January 2015, Bitcoin embarked on a 1,064-day bull rally before registering a market top around $20,000 in December 2017. In the following cycle, the premier cryptocurrency picked up from $3,120 in December 2018 and surged to nearly $69,000 in November 2021 to complete another 1,064-day cycle. Following Bitcoin’s cycle low of $15,500 in November 2022, Martinez observes that the asset reached its most recent all-time high of $126,198 exactly 1,064 days later. Based on this timing pattern, he suggests that Bitcoin may have already topped and recent corrections could mark the early stages of a market winter. Related Reading: This Analyst Called The Bitcoin Crash Below $20,000 In 2021, He’s Back With A Shocking Prediction For Solana A Bullish Revival Hope? While Martinez’s prediction is grounded in strong historical patterns, investors should recognize that the current market cycle is fundamentally different from previous ones. Institutional participation is significantly higher, highlighted by the rise of Bitcoin spot ETFs and the growth of Bitcoin-holding treasury companies. At the same time, clearer regulatory frameworks across Asia, Europe, and the United States continue to strengthen credibility and accelerate mainstream adoption. These structural changes suggest that Bitcoin may not follow past cycle behavior as closely as before. At press time, Bitcoin trades at $94,650 following a 5.59% price fall in the last day. In the last month, the premier cryptocurrency has been down by 14.61% underscoring the significant selling pressure in the present market. Featured image from iStock, chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|1064-day cycle|Ali Martinez|Bitcoin bull market|Bitcoin market cycle|btcusd|BTCUSDT|crypto bull run",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54437796,
    "published": 1763215238000,
    "title": "Bitcoin Price Correction Could Last Until Mid-2026 — Here’s How",
    "body": "The Bitcoin price has continued its horrendous run of form in the final quarter of 2025, ending the year pretty much as it began. Having lost the psychological $100,000 level on Thursday, November 13, the premier cryptocurrency appears to be free-falling under significant bearish pressure. Theories and debates continue to swirl around whether the Bitcoin price is merely feeling the effect of a naturally volatile crypto market or the bear season is slowly kicking in. A specific hypothesis explains that a loss of a certain technical level could spell a longer period of correction for BTC. Factors Behind The Bitcoin Price Collapse In a Quicktake post on the CryptoQuant platform, XWIN Research hypothesized and proposed how long the current Bitcoin price downturn could last. Before diving into its theory, the digital asset research firm first highlighted some of the factors behind the current decline in BTC’s price. Related Reading: How Low Can Bitcoin Price Go? JPMorgan Points To A Key Threshold XWIN Research revealed that the decreased expectations for a December rate cut are one of the reasons behind the recent decline. The shift in the Federal Reserve’s stance dragged the Bitcoin price below the key $100,000 level. Secondly, the crypto analytics firm noted that capital flows into spot exchange-traded funds (ETFs) have reversed sharply, with the investment products seeing nearly $1.1 billion in outflows in recent days. These massive withdrawals signal a waning institutional demand and general market sentiment. Finally, XWIN Research revealed that the excessive leverage in the market unwound violently. “Once major supports broke, cascading liquidations triggered more than 600 million USD in forced long closures within hours. Added to this were exchange-related rumors and DeFi security incidents, pushing sentiment into extreme fear,” the analytics firm wrote. How Long Could This Decline Continue? After outlining the factors behind this Bitcoin price decline, XWIN Research put forward a theory and a potential timeline for the future trajectory of the flagship cryptocurrency. With the $92,000 – $94,000 region being pinpointed as the next critical support, a breach of this zone could see the price of BTC fall to around $85,000. XWIN Research wrote in its Quicktake post that this $92,000 breakdown could see the Bitcoin price correction linger until early or mid-2026. However, the DeFi analytics firm noted that recent on-chain data offers a more optimistic outlook for the market leader. For instance, the cost basis of 6-to-12-month holders stands around $94,000, serving as a strong structural support. So long as the Bitcoin price stays above this band, the long-term bullish case for the premier cryptocurrency remains intact. XWIN Research added: Several catalysts could drive the next recovery. The most important is an improvement in macro conditions: a shift toward rate cuts or broader liquidity expansion in 2026 would draw capital back into risk assets. As of this writing, the price of BTC stands at around $94,930, reflecting a nearly 4% decline in the past 24 hours. Featured image from iStock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|btc price|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54439630,
    "published": 1763218800000,
    "title": "Crypto Liquidity Still Hollow After October Crash, Risking Sharp Price Swings",
    "body": "Despite calmer prices after October’s brutal leverage wipeout, bitcoin and ether market depth remains structurally thin, creating a more fragile trading environment.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Liquidity|Leverage|Order Books|market analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54439948,
    "published": 1763219267000,
    "title": "Harvard Triples Its Bitcoin Position as Emory Expands BTC ETF Holdings",
    "body": "Harvard University and Emory both increased their Bitcoin exposure in the third quarter via ETF holdings, new filings show.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54440634,
    "published": 1763220615000,
    "title": "Bullish Signal On Binance: BTC/ETH Outflows Counter Surging Stablecoin Inflows",
    "body": "Exciting data from an on-chain analysis has recently surfaced, revealing accumulation patterns in Bitcoin and Ethereum on the Binance exchange that have historically preceded renewed bullish momentum. Related Reading: Massive Bitcoin Bid Walls Spotted On Binance: Bulls Step In With 2,800 BTC Cluster Binance Sees $1.77B BTC/ETH In Outflows As $1.58B In Stablecoins Enter In a QuickTake post on November 14, pseudonymous market analyst CryptoOnchain shares insights into the crypto market direction, based on Binance activity. This post revolves around the Binance 7-Day Asset Netflow By Network metric, which shows if more volumes of an asset on specific networks are being deposited into Binance (net inflow), or being withdrawn (net outflow) over the past seven days, revealing the underlying activity across different asset types. According to CryptoOnchain, a net outflow of $1.77 billion in Bitcoin and Ethereum assets has been recorded from the Binance network. Specifically, the analyst reports outflows of $1.1 billion in Bitcoin (BTC_Native) and $670 million in Ethereum (ETH_Native) occurring over the past week. Typically, a large movement of assets out of exchanges such as of this magnitude reflects a growing ‘HODL’ sentiment among investors, as these coins are usually transferred into private wallets for holding. As an extension, an increasing hoarding appetite among holders signals a reduction in sell-side pressure, as there is less liquidity on standby, betting against price. Simultaneously, Binance records an almost similar amount, $1.58 billion, in stablecoin inflows. About $900 million of these came in as USDT, while $680 million was in USDC. Usually, a large inflow of stablecoins indicates an active increment by ‘smart money’ of their buying power. As short-term holders or retailers sell, thereby adding to sell pressure, the long-term holders in this scenario stand ready to absorb sell pressure with their liquidity. Related Reading: Bitcoin Rejection Was No Accident — Now The Battle Shifts To $93,000–$97,000 Survival Zone Clear Accumulation In Play Amid Market Uncertainty Historically, this divergence in on-chain activity (a significant amount in BTC/ETH outflows vs a large amount in stablecoin inflows) has preceded price recoveries to the upside. As such, it qualifies as one of the strongest indicators to show that the market is in an accumulation phase. Despite the predominant market sentiment being one that depicts fear, CryptoOnchain posits that major market participants are currently “buying the dip,” thus putting in what may come to be a strong price bottom in the near future. In the grand scheme, the market still appears to hold a bullish outlook. As of this writing, Bitcoin is worth around $96,133, losing more than 1.33% of its value since the last day. Ethereum, on the other hand, holds a valuation of $3,153, reflecting a 24-hour loss of 1.53% per CoinMarketCap data. Featured image from iStock, Chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Binance|Accumulation Zone|BTCUSDT|buy the dip|CryptoOnchain|cryptoquant|ethereum|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54442611,
    "published": 1763224357000,
    "title": "Tether Eyes $1B Investment in German Robotics Startup Neura: FT",
    "body": "Neura aims to produce 5 million robots by 2030 and has already booked €1 billion in orders.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Tether|robotics|AI|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54443531,
    "published": 1763226062000,
    "title": "Running Your Own Local Open-Source AI Model Is Easy—Here's How",
    "body": "Local AI models offer privacy and zero subscription costs, letting you run powerful models completely offline. Here's how to start.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54443446,
    "published": 1763226020000,
    "title": "How Did The Dogecoin Price React To Elon Musk’s Latest Dog Post?",
    "body": "The world’s richest man, Elon Musk, recently posted a picture of a Shiba Inu, Dogecoin’s mascot. However, the Dogecoin price failed to react positively to the post, as it has most times done in the past when Musk made similar posts. Dogecoin Price Fails To React to Elon Musk’s Shiba Inu Post The Dogecoin price failed to surge on the back of Elon Musk’s X post, in which he posted a meme of a Shiba Inu playing a banjo. DOGE has in the past rallied on the back of such posts because the Japanese dog breed is the meme coin’s mascot. Notably, the post comes amid a crypto market downturn, which has sparked bearish sentiment toward DOGE. Related Reading: Analyst Predicts Dogecoin Price “Historic Mega Run” – Here’s The Target As such, this may explain why the Dogecoin price failed to rally on the back of Elon Musk’s X post. DOGE is currently struggling below the psychological $0.2 price level amid concerns that the crypto market may be in a bear market. The foremost meme coin and other altcoins have declined alongside Bitcoin, which is now way below the psychological $100,000 level. However, amid speculations that the Dogecoin price may already be in a bear market, a positive for the foremost meme coin is Elon Musk’s announcement that X Money will launch soon. There has been a lot of speculation that DOGE could be included as a payment option in the social media platform’s payment system. This remains a possibility, considering Elon Musk’s affinity for Dogecoin, even going as far as referring to himself as the ‘Dogefather.’ DOGE’s potential inclusion as a payment option on X Money could serve as a bullish catalyst for the Dogecoin price, as it would boost the meme coin’s utility What’s Next For DOGE Amid Bear Market Concerns Crypto analyst CryptoCeek provided insights into what is next for the Dogecoin price as it continues to decline. In an X post, he noted that DOGE is drifting toward $0.14 again and that a breakdown below this level could put a further drop to $0.10 in sight. This puts the foremost meme coin at risk of losing its bull market structure. Related Reading: Analyst Says Dogecoin Price Is About To Burst, Here’s The Target However, CryptoCeek added that a flip of the 20-day EMA can lead the Dogecoin price to reclaim $0.21. In the meantime, he declared that the range traders are still running the show. Meanwhile, crypto analyst Ali Martinez raised the possibility that Dogecoin’s price could drop to as low as $0.07. He stated that below $0.16, support for DOGE disappears quickly, with the next real demand zone at $0.07. At the time of writing, the Dogecoin price is trading at $0.16, down in the last 24 hours, according to data from CoinMarketCap. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Dogecoin|altcoins|CoinMarketCap|CryptoCeek|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|Dogefather|dogeusd|dogeusdt|elon musk|EMA|meme coin|SHIB|Shiba Inu|X Money",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 44,
        "NAME": "SHIB",
        "CATEGORY": "SHIB"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54444044,
    "published": 1763227050000,
    "title": "Crypto Market Slips Into ‘Extreme Fear’ After Bitcoin Fails to Hold $100,000 Level",
    "body": "The sell-off is attributed to a combination of factors, including profit-taking, institutional outflows, macro uncertainty, and low liquidity.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Fear and greed|Top Stories|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54445688,
    "published": 1763229885000,
    "title": "Crypto treasuries and blockchain are paving the way for decentralized science",
    "body": "Crypto treasury companies and blockchain technology are creating alternative pathways to fund early-stage scientific and medical research.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 54449355,
    "published": 1763236830000,
    "title": "Alibaba to Use JPMorgan’s Blockchain for Tokenized Dollar and Euro Payments: CNBC",
    "body": "The technology aims to expedite transactions and eliminate intermediaries, enabling the direct transfer of digital currencies over a blockchain-based system.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Alibaba|JPMorgan Chase|Tokenization|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      }
    ]
  },
  {
    "id": 54451277,
    "published": 1763240420000,
    "title": "Harvard Endowment Takes Rare Leap Into Bitcoin With $443M Bet on BlackRock's IBIT",
    "body": "The investment, which accounts for 20% of Harvard's reported U.S.-listed public equity holdings, is notable.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Harvard University|Bitcoin ETF|BlackRock|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54451364,
    "published": 1763240463000,
    "title": "Prediction Markets Are Coming for Your Favorite Sport, Says NBA Star Tristan Thompson",
    "body": "Prediction markets dominated politics last year, but now they’re making a notable splash in the big leagues, NBA star Tristan Thompson said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54452281,
    "published": 1763242229000,
    "title": "Bitcoin In Bullish Confluence: Death Cross And Key Support Signal Upside",
    "body": "Bitcoin’s technical structure is flashing a rare and powerful signal. Despite a recent price dip, a bearish-sounding Death Cross has just triggered precisely at a major structural support, the lower boundary of a long-term pattern. This bullish confluence, where historical market bottoms align with key technical support, suggests that the correction is complete and a significant upward bounce is imminent in the short term. $100,460 Range Low Now Flipped Into Key Resistance BTC has officially lost the range low and slipped to the $96,000 area, according to Lennaert Snyder, who outlined a clear game plan for the days ahead. He noted that the former range low of $100,460 has now flipped into a key resistance level, shaping the next phase of market behavior. Related Reading: Bitcoin Rejection Was No Accident — Now The Battle Shifts To $93,000–$97,000 Survival Zone Snyder explained that if Bitcoin retests the $100,460 mark, the reaction will determine the next move. A rejection at that level would favor short setups, while a successful reclaim would open the door for bullish opportunities. Should BTC reclaim the range low, Snyder expects bullish momentum to kick in, with the first target sitting near the $103,460 resistance area. A push into that zone would signal that buyers are regaining meaningful control over the market. Despite the recent drop, Snyder emphasized that there’s still plenty of liquidity and support below current prices while watching for deeper tests that could provide long entries once reversal signals begin to form. Overall, the market remains technically clean, and price action continues to respect every level with precision. Death Cross Triggers At Megaphone Support — Timing Could Be Perfect For Bitcoin According to a recent post by Colin Talks Crypto, Bitcoin has just flashed a major signal, the Death Cross, which has historically aligned with market bottoms rather than tops despite its ominous name. What makes this even more compelling is its perfect timing: the setup triggered at the exact moment BTC touched the lower boundary of its expanding megaphone pattern. Related Reading: Bitcoin Crashes To $98,000 As HODLer Selling Accelerates The expert noted that this scenario was projected weeks in advance, with mid-November marked as the window to watch. Right on schedule, Bitcoin has landed precisely where the analysis suggested it would. Colin explained that death crosses often act as bottom markers at the tail end of downtrends. Pairing that with BTC hitting a major structural support gives the setup even stronger bullish undertones. It’s not just a technical coincidence – it’s a confluence backed by pattern behavior. With these elements lining up, he believes the probability of an upward reaction from here is high. The chart structure now favors a short-term bounce, suggesting that Bitcoin could soon shift away from weakness and begin carving out a recovery move. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|Bullish Megaphone Pattern|Colin Talks Crypto|death cross|Lennaert Snyder",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54455270,
    "published": 1763247646000,
    "title": "Bitcoin Price In Trouble As Sell-Side Momentum Spikes — $92,000 Next?",
    "body": "The Bitcoin price has ostensibly continued down in its bearish direction, which started in the second week of October. After slipping beneath the psychological $100,000 support, worries have surfaced among Bitcoin market participants regarding the broader market structure. Interestingly, the latest on-chain evaluation justifies this worry, as the downside bias for the Bitcoin price seems to be on the rise. Binance Taker Imbalance Falls Into Negative Territory In a Quicktake post on the CryptoQuant platform, on-chain research firm Arab Chain revealed an increase in sell-side momentum for Bitcoin on Binance, the world’s largest exchange by trading volume. This revelation revolves around the BTC Taker Imbalance % metric, which tracks whether the market is dominated by aggressive buyers or sellers. Narrowing it down, this metric offers insights into taker activity on Binance. Related Reading: Bitcoin Moves Beyond Retail — Institutional Ownership Now Defines The Market Because the metric works by revealing the percentage difference between taker buy volume and taker sell volume, readings with positive values suggest the dominance of buyers in the market. On the contrary, negative readings reveal a seller-dominated market. As Arab Chain reported, there has been an evident spike in the amount of selling pressure in recent hours. A Taker Imbalance % reading of -0.17%, which typically reflects continued bearish action, supports this observation. Moreover, the research firm pointed out that there has been an evident difference between the selling and buying volumes recently. The Quicktake post revealed a record of $1.517 billion in selling volume against $1.058 billion dedicated to buying power, making it clear what party is currently winning this Bitcoin price tussle. Is $92,000 The Next Bitcoin Price Target? What’s interesting is, the current seller-dominated market has caused the BTC price to continuously hover around the key $94,000 level. Arab Chain noted that each attempt by the Bitcoin price to rise has faced an even greater amount of sell resistance, dousing any serious bullish momentum. The grey bars in the above chart suggest that this increasing bearish pressure might not just be a market correction; instead, it reflects a recurrent injection of sell-pressure, one which Arab Chain implied would eventually defeat the weaker buy-side liquidity at the current support. In the likely scenario where more bearish momentum is injected to push the market to the downside, the next level, which could act as a cushion for price, lies around $92,000. If a significant amount of liquidity is not introduced to neutralize the dominance of Bitcoin’s sellers, the Bitcoin price could see an even deeper bearish correction. At press time, Bitcoin is valued at $96,241, reflecting a nearly 2% loss in the past day. Related Reading: Bitcoin Crashes To $98,000 As HODLer Selling Accelerates Featured image from iStock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|Bitcoin Taker Imbalance %|btc|BTC news|btc price|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54460857,
    "published": 1763257529000,
    "title": "Crypto index ETFs will be the next wave of adoption — WisdomTree exec",
    "body": "WisdomTree’s Will Peck said that crypto index ETFs will solve the need for those who don’t want to take on “idiosyncratic risk.”",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54472227,
    "published": 1763278694000,
    "title": "XRP Falls 4.3% Even After XRPC ETF Launch on Bitcoin Weakness, Finds Buyers Near $2.22",
    "body": "The market remains bearish with XRP struggling to break above the $2.23–$2.24 resistance zone.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|XRP News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]