[
  {
    "id": 54502127,
    "published": 1763336532000,
    "title": "Bitcoin briefly erases 2025 gains as crypto bleeds over weekend",
    "body": "Bitcoin’s latest tumble pushed it below the $93,507 price it entered the year at, despite the year mostly seeing positive industry developments from corporations and governments.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54502348,
    "published": 1763337178000,
    "title": "Arca CIO Jeff Dorman Rejects Claims Saylor’s Strategy (MSTR) Faces Forced Bitcoin-Sale Risk",
    "body": "Dorman says fears that Strategy will be forced to sell bitcoin are misplaced, citing the firm’s balance sheet, governance and cash flow.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|btc|Peter Schiff|Jeff Dorman|Strategy|MSTR|Michael Saylor|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54506167,
    "published": 1763344405000,
    "title": "Harvard University triples stake in BlackRock’s Bitcoin ETF, filing shows",
    "body": "The Ivy League university held 6.8 million shares in BlackRock’s Bitcoin ETF as of Sept. 30, 2025, and has also boosted its exposure to gold.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54507819,
    "published": 1763347772000,
    "title": "Bitcoin Slides Deeper Into Red, Extending Decline Toward Key Support Zones",
    "body": "Bitcoin price failed to recover above $96,500. BTC is down over 3% and there are chances of more downsides below $92,000. Bitcoin started a fresh decline below $95,000 and $94,500. The price is trading below $98,000 and the 100 hourly Simple moving average. There is a bearish trend line forming with resistance at $96,600 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move down if it settles below the $92,500 zone. Bitcoin Price Dips Further Bitcoin price failed to stay in a positive zone above the $95,500 pivot level. BTC bears remained active below $95,500 and pushed the price lower. The bears gained strength and were able to push the price below the $94,000 zone. A low was formed at $92,890 and the price is now consolidating losses near the 23.6% Fib retracement level of the recent decline from the $103,998 swing high to the $92,890 low. Bitcoin is now trading below $95,000 and the 100 hourly Simple moving average . Besides, there is a bearish trend line forming with resistance at $96,600 on the hourly chart of the BTC/USD pair. If the bulls attempt another recovery wave, the price could face resistance near the $95,500 level. The first key resistance is near the $96,500 level and the trend line. The next resistance could be $97,200. A close above the $97,200 resistance might send the price further higher. In the stated case, the price could rise and test the $98,500 resistance. Any more gains might send the price toward the $99,500 level. The next barrier for the bulls could be $100,000 and $100,500. More Losses In BTC? If Bitcoin fails to rise above the $96,600 resistance zone, it could start another decline. Immediate support is near the $93,500 level. The first major support is near the $92,500 level. The next support is now near the $91,500 zone. Any more losses might send the price toward the $90,000 support in the near term. The main support sits at $88,500, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $92,500, followed by $90,000. Major Resistance Levels – $95,500 and $96,600.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54508384,
    "published": 1763348882000,
    "title": "Ethereum Slips to $3K, Highlighting Weakness After Recent Failed Rebound",
    "body": "Ethereum price failed to stay above $3,250 and extended losses. ETH is down over 5% and might struggle to recover above $3,250 in the near term. Ethereum started a fresh decline after it failed to stay above $3,200. The price is trading below $3,200 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance at $3,160 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move down if it settles below the $3,000 zone. Ethereum Price Dips Further Ethereum price failed to continue higher above $3,350 and started a fresh decline, like Bitcoin . ETH price dipped below $3,200 and entered a bearish zone. The decline gathered pace below $3,150 and the price dipped below $3,050. A low was formed at $3,003 and the price is now correcting some losses. There was a move toward the 23.6% Fib retracement level of the recent decline from the $3,560 swing high to the $3,003 low. Ethereum price is now trading below $3,200 and the 100-hourly Simple Moving Average. If there is another recovery wave, the price could face resistance near the $3,160 level. There is also a key bearish trend line forming with resistance at $3,160 on the hourly chart of ETH/USD. The next key resistance is near the $3,280 level and the 50% Fib retracement level of the recent decline from the $3,560 swing high to the $3,003 low. The first major resistance is near the $3,350 level. A clear move above the $3,350 resistance might send the price toward the $3,450 resistance. An upside break above the $3,450 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $3,500 resistance zone or even $3,550 in the near term. More Losses In ETH? If Ethereum fails to clear the $3,280 resistance, it could start a fresh decline. Initial support on the downside is near the $3,050 level. The first major support sits near the $3,000 zone. A clear move below the $3,000 support might push the price toward the $2,880 support. Any more losses might send the price toward the $2,750 region in the near term. The next key support sits at $2,640 and $2,620. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI – The RSI for ETH/USD is now below the 50 zone. Major Support Level – $3,050 Major Resistance Level – $3,280",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54509284,
    "published": 1763350370000,
    "title": "Tether mulls $1.15B deal with AI robotics startup Neura: Report",
    "body": "Tether is reportedly considering a $1.15 billion bet on robotics startup Neura, which could see its valuation rise to over $10 billion should a deal be made.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54509758,
    "published": 1763351389000,
    "title": "Arcade tokens are a ‘critical building block’ in crypto’s evolution: a16z",
    "body": "Venture capital firm a16z argues ecosystem-locked tokens, akin to airline miles, could be key for builders to create stable, spendable digital economies without the noise of speculation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54510236,
    "published": 1763352493000,
    "title": "XRP Price Continues Lower as Sellers Tighten Grip on Intraday Structure",
    "body": "XRP price started a fresh decline from $2.350. The price is now showing bearish signs and might extend losses if it dips below $2.150. XRP price started a fresh decline below the $2.320 zone. The price is now trading below $2.30 and the 100-hourly Simple Moving Average. There is a short-term bearish trend line forming with resistance at $2.2550 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move down if it settles below $2.150. XRP Price Dips Again XRP price attempted a recovery wave above $2.320 but failed to continue higher, like Bitcoin and Ethereum . The price started a fresh decline below $2.30 and $2.250. There was a move below the $2.20 pivot level. A low was formed at $2.155, and the price is now consolidating losses with a bearish angle. There was a minor move above the 23.6% Fib retracement level of the recent decline from the $2.525 swing high to the $2.155 low. The price is now trading below $2.30 and the 100-hourly Simple Moving Average. If there is a fresh upward move, the price might face resistance near the $2.2550 level. There is also a short-term bearish trend line forming with resistance at $2.2550 on the hourly chart of the XRP/USD pair. The first major resistance is near the $2.30 level, above which the price could rise and test $2.350 or the 50% Fib retracement level of the recent decline from the $2.525 swing high to the $2.155 low. A clear move above the $2.350 resistance might send the price toward the $2.440 resistance. Any more gains might send the price toward the $2.50 resistance. The next major hurdle for the bulls might be near $2.550. Another Decline? If XRP fails to clear the $2.350 resistance zone, it could start a fresh decline. Initial support on the downside is near the $2.20 level. The next major support is near the $2.150 level. If there is a downside break and a close below the $2.150 level, the price might continue to decline toward $2.050. The next major support sits near the $2.020 zone, below which the price could continue lower toward $1.880. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $2.20 and $2.150. Major Resistance Levels – $2.30 and $2.350.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54512094,
    "published": 1763356123000,
    "title": "Dogecoin (DOGE) Weak Rebound Attempts, Signaling Struggle to Mount Recovery",
    "body": "Dogecoin started a fresh decline below the $0.180 zone against the US Dollar. DOGE is now correcting some losses and might face hurdles near $0.1650. DOGE price started a fresh decline below the $0.180 level. The price is trading below the $0.170 level and the 100-hourly simple moving average. There is a bearish trend line forming with resistance at $0.1650 on the hourly chart of the DOGE/USD pair (data source from Kraken). The price could extend losses if it stays below $0.1650 and $0.170. Dogecoin Price Attempts Recovery Dogecoin price started a fresh decline after it closed below $0.20, like Bitcoin and Ethereum . DOGE declined below the $0.180 and $0.1720 support levels. The price even traded below $0.1650. A low was formed near $0.1535, and the price recently attempted a recovery wave. There was a move above the 23.6% Fib retracement level of the downward move from the $0.1776 swing high to the $0.1535 low. However, the bears were active near the $0.1620 resistance. Besides, there is a bearish trend line forming with resistance at $0.1650 on the hourly chart of the DOGE/USD pair. It is close to the 50% Fib retracement level of the downward move from the $0.1776 swing high to the $0.1535 low. Dogecoin price is now trading below the $0.1620 level and the 100-hourly simple moving average. If there is a recovery wave, immediate resistance on the upside is near the $0.1640 level. The first major resistance for the bulls could be near the $0.1650 level. The next major resistance is near the $0.170 level. A close above the $0.170 resistance might send the price toward the $0.180 resistance. Any more gains might send the price toward the $0.1840 level. The next major stop for the bulls might be $0.20. More Losses In DOGE? If DOGE’s price fails to climb above the $0.1650 level, it could continue to move down. Initial support on the downside is near the $0.1550 level. The next major support is near the $0.150 level. The main support sits at $0.1380. If there is a downside break below the $0.1380 support, the price could decline further. In the stated case, the price might slide toward the $0.120 level or even $0.1050 in the near term. Technical Indicators Hourly MACD – The MACD for DOGE/USD is now gaining momentum in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for DOGE/USD is now above the 50 level. Major Support Levels – $0.1550 and $0.1380. Major Resistance Levels – $0.1650 and $0.1700.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "DOGE|DOGE news|Doge price|DOGE USD|DOGE/BTC|DOGE/USDT|Dogecoin|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54514992,
    "published": 1763360383000,
    "title": "'Fat-Finger' Fail? Cardano Whale Torches $6M After Hitting Illiquid USDA Pool",
    "body": "The decision to route through an illiquid micro-cap stablecoin might go down as one of the year’s most costly errors.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Cardano|Trading|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54515484,
    "published": 1763362821000,
    "title": "Dogecoin Price Could Bounce Very Quickly If This Happens At $0.166",
    "body": "The Dogecoin price has generally followed the trajectory of other altcoins relative to Bitcoin and has seen deeper declines compared to the pioneer cryptocurrency. These declines have left the leading meme coin by market cap in the red, pushing it back down to levels not seen since 2023. As a result, the Dogecoin price is now in a precarious position where it needs to make a major move or DOGE investors risk more decline as the altcoin struggles to find support. Next Trajectory For The Dogecoin Price Bitguru, in an analysis on X, outlined where the Dogecoin price is and what could determine the next move for the cryptocurrency. This all comes back to a critical level that would send the price in either direction, making it the point where both bulls and bears are now fighting for dominance, and this level is at 0.166. Related Reading: Analyst Breaks Down Why There Can’t Be 7 Million XRP Holders As the crypto analyst explains, the Dogecoin price has been in a clear downtrend already, and there has been no indication that it will actually pull out of this soon. If anything, sideways movement has been the order of the day, and catalysts that could trigger another rally have not been forthcoming. It so happens that the Dogecoin price ended up being rejected at $0.1823, which has been established to be a major high for the digital asset. Hence, it puts the sellers in control once again as the price moves toward $0.166. This $0.166 level lies above the major support at $0.16, meaning that it is imperative for bulls to actually reclaim and hold it. Another problem that the digital asset is facing at this point is that it continues to form lower highs. Naturally, this is a bearish development for any cryptocurrency as it means that buyers are weakening and sellers are gaining control in the market. If these lower highs continue, then it could see further decline for the Dogecoin price as opposed to a possible recovery. Related Reading: Is Bitcoin Falling Because Of Strategy Sell-Offs? On-Chain Data Fuels Debate The Dogecoin price did try to rebound over the weekend, but was ultimately pushed back down as the Bitcoin price struggled at $95,000. Now, reclaiming the $0.166 is the next major task for bulls if the meme coin is to continue its ascent. In the event of a failure to reclaim $0.166 with momentum, then the Dogecoin price could correct lower. As the decline deepens, the next major support level lies firmly at $0.15, where there could be a wave of buying to trigger a short-term rise. Featured image from Dall.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54518191,
    "published": 1763368037000,
    "title": "Tether’s $1B Neura Bet Puts AI Tokens In Focus As SUBBD Presale Heats Up",
    "body": "What to Know: Tether’s potential $1B+ funding role in Neura highlights aggressively crypto profits flows into real-world AI and robotics infrastructure. Neura’s humanoid robots target industrial and home use, while SUBBD Token focuses on ‘digital labor’ for creators through AI assistants and on-chain tools. Price predictions for $SUBBD map possible highs of $0.438 in 2025 and $0.668 in 2026. This implies about 7–12x upside from presale levels. SUBBD Token’s AI-powered creator platform, 20% staking rewards and large pre-built audience offer a way to play the AI-creator economy narrative. Tether is reportedly weighing a funding commitment of around $1.15B into German robotics firm Neura Robotics. The deal could value the startup between roughly $9.3B and $11.6B. That is a serious escalation in the crossover between crypto profits and real-world AI hardware. Neura builds humanoid robots designed for industrial and home use, and recent models like 4NE-1 handle tasks from sorting objects to cooking prep and box lifting. The systems lean heavily on AI for perception and continuous learning. Neura is also working with major chip providers to push that edge further. For Tether, this move fits a broader pattern. The $USDT issuer has generated more than $10B in profit this year and has started to redeploy capital into AI, data centers, energy infrastructure and Bitcoin mining. A potential billion-dollar ticket into humanoid robotics shows how aggressively crypto balance sheets now chase AI leverage. That kind of capital rotation matters well beyond Neura. It reinforces a simple message for the market: AI agents, whether they live in metal bodies or browser tabs, are the next big productivity layer. For an AI-driven Web3 project like SUBBD Token ($SUBBD), building a creator-focused AI agent ecosystem, that backdrop is the perfect macro narrative tailwind traders look for. With the $SUBBD presale already above $1.3M raised, a live token price at $0.05695 and fixed 20% staking rewards, the project sits at the intersection of AI tooling and the $85B creator economy. The question is how that combo might translate into upside if AI flows keep accelerating after headlines like Tether’s Neura bet. AI Robots, Digital Agents And The SUBBD Creator Stack Tether circling Neura is a signal that big crypto cash is comfortable owning core AI infrastructure, not just tokens with ‘AI’ in the ticker. Neura’s goal is simple: deploy autonomous, learning robots that handle repetitive labor in factories and homes. On the other side of the spectrum sits SUBBD Token ($SUBBD), which targets digital labor. Specifically, the time creators burn on DMs, admin, content planning and fan management. Instead of humanoid hardware, $SUBBD ships a stack of AI tools that sit between creators and their audiences. The SUBBD platform already anchors itself in a network of 2K+ top-earning creators with a combined following above 250M fans. The pain point is obvious for that crowd. Legacy platforms take high fees, fragment monetization between subscriptions, tips and sponsorships, and offer limited direct ownership of audience relationships. SUBBD Token’s answer is an AI-driven, tokenized subscription layer. The $SUBBD token functions as the unit of account for subscriptions, pay-per-view content, tips and gated access. Holders unlock discounts on content, exclusive drops, and ‘XP multipliers’ that reward deeper engagement. The roadmap leans heavily on AI ‘agents’ for creators. Upcoming features include AI profile generation, AI voice notes, AI video tools and AI livestreams that let creators automate parts of their presence without losing personality. Fans also get more benefits, while creators offload low-value work to AI and focus on content and brand deals. All of this targets an estimated $85B subscription-based content market. Many creators say they are actively hunting for better economics and more flexible tools. And if humanoid robots promise to reshape physical workflows, $SUBBD aims to do the same for digital creator workflows. For anyone tracking how AI narratives evolve from hardware (Neura) to consumer-facing apps, $SUBBD sits right in the ‘AI + creator economy’ sweet spot. Check how SUBBD lines up with your AI thesis. 💥 Join the $SUBBD presale on the official website. AI Crypto Project of the Future? $SUBBD Presale Roars On the numbers side, $SUBBD is still in presale with more than $1.3M raised so far. The current token price sits at $0.05695, with presale participants able to stake immediately for a fixed 20% APY, paid out after the presale concludes. ➡️ Here’s how to buy $SUBBD right now. Price-projection work from independent analysts sketches a base roadmap for what upside might look like if the platform executes. Our $SUBBD price prediction sees $SUBBD potentially reaching a high of $0.438 by the end of 2025 and up to $0.668 in 2026 if user traction, creator onboarding and exchange listings land as planned. Against today’s ~$0.05695 price, a move to $0.438 would mean ~7.7x, or ~670% gains on paper. A push to $0.668 would imply around 11.7x, in line with estimates that frame the 2026 upside at just over 1,070%. Run your own numbers, but if AI + creator economy is part of your 2025 thesis, you should give SUBBD Token a closer look. Get your $SUBBD for just $0.05695 right now. Authored by Aaron Walker, NewsBTC – https://www.newsbtc.com/news/tether-1-billion-neura-ai-investment-subbd-token-presale-roars This content is informational only, not financial advice. Crypto and presale investments are volatile; never risk capital you cannot afford to lose.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54518796,
    "published": 1763368463000,
    "title": "Crypto’s Riskiest Coins Plummet to Lows Not Seen Since Pandemic",
    "body": "The crypto market selloff shows no signs of abating, and the smallest, riskiest tokens are bearing the brunt of it.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54519176,
    "published": 1763369659000,
    "title": "Stablecoin panic could upend ECB policy, Dutch central bank governor warns",
    "body": "Dutch central bank governor Olaf Sleijpen warned that if stablecoins falter, issuers may be forced to liquidate their reserves, thereby magnifying stress across markets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 54519605,
    "published": 1763370504000,
    "title": "Bitcoin ETFs bleed $1.1B as analysts warn of ‘mini’ bear market at pivotal moment",
    "body": "Bitcoin’s price is now at a “pivotal juncture” as the fate of the market cycle depends on incoming macro signals and maintaining key technical price levels.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54520092,
    "published": 1763371332000,
    "title": "Alibaba’s Blockchain Payment Pivot Puts Best Wallet Token In Play",
    "body": "What to Know: Alibaba and JPMorgan are rolling out tokenized deposit rails for global B2B payments, compressing transaction settlement times from days to near-instant. Deposit tokens keep money inside the banking perimeter while using blockchain for speed, putting more pressure on wallet infrastructure to handle multiple forms of digital cash. Best Wallet combines a non-custodial, multi-chain wallet with a DEX aggregator, presale launchpad and planned card and analytics stack inside one mobile app. Best Wallet Token lets holders tap into that ecosystem through lower fees, boosted staking yields and early deal flow rather than pure price speculation. Alibaba’s global B2B arm is about to move serious money on-chain. The company will plug into JPMorgan’s JPMD infrastructure and Kinexys tokenization stack to settle cross-border trade using tokenized deposits backed by fiat currencies like the US dollar and the euro. These deposits behave a lot like stablecoins on the surface. But under the hood, they sit on regulated bank balance sheets. That keeps regulators comfortable and gives Alibaba near-instant settlements for global buyers and suppliers who currently wait 2–3 days and pass through multiple correspondent banks for a single payment. Alibaba plans to roll out its ‘Agentic Pay’ by December 2025. This will pair tokenized money with AI that can turn buyer–seller chats into executable smart contracts. The first phase will use bank-issued digital tokens to keep things clean from a policy and compliance standpoint, especially given Beijing’s hard line on stablecoins. For everyday users and smaller businesses, this shift has a simple implication. If big B2B platforms start settling value natively on-chain, wallets become the key interface to tokenized dollars, euros and everything in-between. Non-custodial, multi-chain wallets that can route value between deposit tokens, stablecoins and DeFi will sit right in the flow of this new money. That’s exactly the world Best Wallet is building for. And its in-app crypto wallet token, Best Wallet Token ($BEST), is designed to capture a share of that flow. Read more about Best Wallet Token in our review. Tokenized Deposits Put Wallet Infrastructure In The Spotlight Alibaba and JPMorgan are not experimenting with a meme coin. They’re wiring real-world payments where tokenized bank money moves across borders on a permissioned blockchain. All while plugging into familiar banking compliance checks. Deposit tokens effectively give institutions the UX of stablecoins without stepping outside the banking perimeter. That model is likely to spread because global trade runs on razor-thin margins and brutal settlement frictions. If one of the largest B2B platforms proves that a deposit-token rail can deliver near-instant settlement, lower FX and correspondent costs, and better transparency, competitors are not going to sit on the sidelines. In that environment, the ‘front end’ that users actually touch is the wallet, not the bank core. That’s where retail infrastructure meets institutional solutions. Tokenized deposits will mostly live in compliant, bank-linked environments. But users still need tools to route value into stablecoins, L2s, DeFi strategies and even early-stage token sales. Infrastructure that only does one chain, or only handles basic send-and-receive flows, starts to look dated fast. Best Wallet leans into that shift with a mobile-first, non-custodial design that already supports thousands of assets across 6+ chains and integrates a DEX aggregator for both same-chain and cross-chain swaps. Its whitepaper sets an aggressive goal: capture 40% of the crypto wallet market by the end of 2026, using Fireblocks MPC tech, a presale launchpad, and upcoming features like MEV protection, advanced order types and market analytics. If tokenized bank money becomes the norm for large-ticket payments, flexible wallets that can speak both ‘TradFi token’ and ‘DeFi native’ stand to win the most volume. Best Wallet is positioning itself as that hub, and the $BEST token is the mechanism that lets users share in the wallet’s growth through lower fees, boosted yields and governance. Here’s why. Best Wallet Token Turns A Non-Custodial App Into An Asset The Best Wallet Token ($BEST) token is wired directly into the wallet’s economics. Holding and staking $BEST unlocks reduced swap and card fees. It also unlocks higher staking rewards through an upcoming staking aggregator, priority access to some of the best crypto presales, governance rights, and boosted cashback on the forthcoming Best Card. Data from the live sale shows investors are already voting with their wallets. The presale has raised more than $17.1M, with the current token price at $0.025955 and the sale scheduled to end in 11 days. Whales are already acting, with one buying $32K yesterday. Staking is live during the presale, with dynamic rewards currently around 76% APY for early participants, funded from a dedicated 8% allocation of the total 10B token supply. 🤑 Here’s how to buy $BEST before the presale ends. Our Best Wallet Token price prediction places potential 2026 highs for $BEST at $0.05106175 or an ~100% upside , depending on how the presale closes, how quickly listings roll out and how strong the next altcoin rotation is. Crucially, those numbers are tied to real wallet usage, not just hype. Best Wallet already runs on Ethereum and is built to plug directly into the kind of regulated, tokenized rails Alibaba is helping normalize. It also gives users self-custody, no mandatory KYC in-app, and Fireblocks-grade security. For traders and long-term holders alike, $BEST effectively tokenizes that wallet business model. It’s a must-watch for anyone building a diversified bag around the emerging tokenized-payments narrative lit up by Alibaba and JPMorgan. Consider accumulating $BEST before listings. This article is informational only, not financial advice. Crypto assets are volatile and speculative; always do independent research before investing. Authored by Aaron Walker, NewsBTC – https://www.newsbtc.com/news/alibaba-jpmorgan-blockchain–tokenization-best-wallet-token-benefits",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 205,
        "NAME": "TOKEN SALE",
        "CATEGORY": "TOKEN SALE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54519826,
    "published": 1763371200000,
    "title": "SGX Derivatives Debuts Bitcoin, Ether Perpetual Futures Tied to iEdge CoinDesk Crypto Indices",
    "body": "New contracts will be available for trading from Nov. 24.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin Futures|Ether|Markets|Singapore|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54520952,
    "published": 1763373388000,
    "title": "Best Wallet Token Presale Enters Final Stretch For DeFi",
    "body": "What to Know: Web3 wallets are becoming DeFi control centers, and Best Wallet targets that role with a multi-chain, MPC-secured, mobile-first app. $BEST powers fee discounts, staking boosts, early presale access, and governance, as well as card and iGaming perks inside the Best Wallet ecosystem. The $BEST presale ends in 11 days, on November 28, with $17M+ already raised and $BEST valued at $0.025955. Investors are already FOMO-diving into the presale, with a recent whale buy of $30,744 setting the pace for the remainder of the presale stage. Self custody is back in fashion. As regulation tightens and exchange blowups fade yet never quite disappear from memory, more users are parking assets in Web3 wallets. And they’re doing everything from swapping to staking without handing over their keys. That shift has put a spotlight on wallet-native tokens. Assets like Trust Wallet Token have shown that fee discounts, early access, and governance can give a wallet coin real staying power when the market turns risk on. This is the backdrop for Best Wallet Token ($BEST), the utility asset behind the Best Wallet ecosystem. The $BEST presale has already raised more than $17M, with the current token price at $0.025955 and headline staking yields in the high double digits, at 76% APY. The sale will reach its final conclusion on November 28, which leaves less than two weeks before the next phase of the project begins. Crucially, much of Best Wallet’s roadmap is still ahead of it. Features like a staking aggregator, Best Card, advanced trading tools, and gas-free transactions are mapped out but not fully live. That makes this final stretch of the presale effectively a bet on whether Best Wallet can turn its existing app into a full DeFi ecosystem over the next couple of years. ➡️ Discover more about the Best Wallet Token ($BEST) in our full review. Best Wallet Aims To Become A DeFi Control Center The Best Wallet app is already live as a non-custodial mobile crypto wallet with coming support for thousands of assets across more than 60 chains. 🔐 It uses Fireblocks’ MPC security, biometric login, and decentralized recovery rather than seed phrases, which is the kind of UX upgrade that helps new users stay on chain without sweating over losing a 12-word backup. The roadmap pushes that idea much further. Phase 3 will bring a portfolio management suite, browser extension, NFT gallery, derivatives trading, and a dedicated staking aggregator that promises higher yields with no extra wallet fees. Phase 4 will add market analytics, limit and stop loss orders, dollar cost averaging, MEV protection, and gas-free transactions, effectively turning the wallet into a full trading terminal. On top of this, Best Wallet hooks into iGaming partnerships and a planned Best Card debit product. 🏆 $BEST holders can earn higher cashback, better bonuses and reduced card fees, which pulls the token into real-world spending and gaming flows rather than leaving it as a pure governance chip. All of that utility revolves around $BEST. The token unlocks reduced swap and purchase fees, higher staking rewards, access to the best crypto presales in the in-app launchpad, and governance rights over future upgrades. If Best Wallet makes good on its plan to grow into a DeFi control center, that value should accrue first to long-term $BEST holders. ➡️ Check out our guide to buying $BEST. Final BEST Presale Phase Targets Yield And Upside The $BEST presale began in November 2024 and has moved through a long ladder of incremental price steps. 💰 After passing the $17M mark and climbing to $0.025955, the token now sits in its final stage, with the presale due to end on November 28. The global crypto wallet market, currently valued at around $15.5B, is forecast to have a hefty CAGR of 26.3%, reaching $110.7B by 2033. Best Wallet plans to dominate 40% of that market by the end of next year, which is why a fully funded roadmap is key. That’s where $BEST’s capital raise matters. Its tokenomics are relatively simple. There is a fixed supply of 10B $BEST. One-quarter is earmarked for product development, more than a third for marketing, and 8% for staking rewards, with the rest split between airdrops, exchange liquidity, community incentives and treasury. That mix leans heavily into growth and user acquisition, which makes sense for a wallet trying to win that 40% share in a crowded market. 🚀 Given Best Wallet’s ecosystem utility and long-term goals, our price prediction for $BEST sees it potentially reaching $0.05106175 by the end of 2026, once the implementation phase kicks off. Using the current presale price of $0.025955, that implies potential upside of close to 97% to the 2026 high, although actual performance will depend on adoption, listings and macro conditions. This performance and price projection makes $BEST one of the best crypto presales of 2025. Investors continue to tune in, with a recent $30,744 whale buy setting the pace for the rest of the remaining 11 days. Ready to jump in? Buy $BEST before the presale ends. Disclaimer: This isn’t financial advice. Always do your own research and invest wisely. Authored by Aaron Walker, NewsBTC – https://www.newsbtc.com/news/best-wallet-token-defi-ecosystem-presale-finale/",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 190,
        "NAME": "TWT",
        "CATEGORY": "TWT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54521443,
    "published": 1763374284000,
    "title": "XRP Stands Out With 89% Gain as BTC, ETH, CD20 Fall to Muted Returns Over 365 Days",
    "body": "Despite recent price losses, XRP is still up 89% on a 365-day basis.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|XRP News|Markets|Bitcoin News|Ether|CoinDesk 20|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54522046,
    "published": 1763375437000,
    "title": "Trump Drops 500% Tariff Shockwave, Crypto Trembles — Bitcoin Breakdown Ahead?",
    "body": "US President Donald Trump on Friday voiced support for a Senate measure that would let the US impose tariffs of up to 500% on imports from nations still buying Russian energy. “It would be okay with me,” he said. Related Reading: From Dotcom To Crypto: Veteran Analyst Says The Bull Run Isn’t Over Based on reports, the proposal names oil, natural gas, petroleum products and uranium as covered goods and highlights major buyers such as India and China. The move is described as a tool meant to squeeze Russia’s export revenues, but the measure remains proposed and has not become law. Tariffs Up To 500% On Energy Imports Reports have disclosed that the bill would give the President authority to slap punitive duties — as high as 500% — on goods coming from any country judged to be materially trading in Russian energy. JUST IN: 🇺🇸🇷🇺 President Trump approves bill allowing 500% tariffs on countries trading with Russia. pic.twitter.com/qaBKVUMwTN — BRICS News (@BRICSinfo) November 17, 2025 Lawmakers behind the text say the measure targets energy purchases that help fund Moscow. How the tariff would be applied, and the exact list of goods and exceptions, is still being worked out in committee. Legal experts warn that a 500% duty would raise immediate questions about trade rules and possible retaliation. Immediate Shock To Risk Assets Markets reacted fast. Crypto traders moved to the exits in the first hours after the news, pushing volatility up across major tokens. Nearly $620 million in crypto positions were liquidated in 24 hours, forcing over 152,000 traders out, with a single $30 million BTC-USD order on Hyperliquid being the largest hit. Major altcoins like XRP, Solana, and Cardano saw sharp swings, and Ethereum dropped toward the $3,000 level. Bitcoin took a 1% hit following the news. In the last week, BTC has lost close to 10% of its value since hitting an all-time high of $126k on October 6, 2025. The crypto market is highly sensitive to geopolitical trade shocks. Analysts warn that a proposed 500% tariff on countries trading with Russia—significantly higher than past rates that caused a $200 billion wipeout—could trigger severe panic selling. Analysts believe that if the large-scale tariff is brought into effect, its short-term effect could decrease Bitcoin and major altcoins’ prices by 10% to 20% due to increased economic uncertainty and panic. Related Reading: Forget The Obituaries—Cardano Is Alive, Says Bitcoin Analyst Wider Economic Ripples And Energy Prices If the tariffs were ever applied, energy flows would be disrupted. That could push crude and gas prices higher, and higher energy costs usually feed into inflation. Central banks might respond by holding rates higher for longer, which can hurt risk assets including crypto. Yet, history shows that once a new price regime takes hold, people sometimes seek alternatives to cash and bank deposits. That dynamic is part of why crypto markets are watching this proposal so closely. Featured image from David Hume Kennerly/Getty Images, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|altcoins|bitcoin|btc|crypto|russia|stocks|tariff|Trump",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54523933,
    "published": 1763379000000,
    "title": "Crypto Markets Today: Bitcoin, Ether Sink to Multimonth Lows as Liquidity Dries Up",
    "body": "A bruising weekend confirmed a broader downtrend across major tokens, with shifting Fed rate-cut expectations and thin liquidity accelerating declines.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54523754,
    "published": 1763378573000,
    "title": "UBS and Ant bet on blockchain to break bottleneck in global treasury flows",
    "body": "UBS and Ant International will test tokenized deposits for real-time cross-border payments and liquidity management in one of Singapore’s largest blockchain pilots.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 54524379,
    "published": 1763379620000,
    "title": "BTC price bull market lost? 5 things to know in Bitcoin this week",
    "body": "Bitcoin erased all its 2025 gains and gave up key bull-market trendlines as traders' BTC price outlooks include a return to $76,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54524887,
    "published": 1763380847000,
    "title": "Bitcoin Price Just Flashed A Death Cross, But It’s Not What You Think",
    "body": "Crypto analyst Colin has revealed that the Bitcoin price has flashed a death cross, which he noted was bullish for the flagship crypto. This comes amid BTC’s recent decline, which has erased all its year-to-date (YTD) gains. Bitcoin Price Flashes Death Cross, Marking Potential Bottom In an X post, Colin stated that a death cross just flashed for the Bitcoin price, with the “ironically” bullish indicator triggering at the same time that BTC tagged the lower boundary of its megaphone pattern. The analyst noted that this is a bullish setup from this point forward, as the death cross often marks bottoms. He indicated that this is likely the bottom, as BTC has ended at the lower end of the megaphone pattern channel. Related Reading: Bitcoin Price Won’t Crash To $92,000, Here’s Why Colin remarked that these factors combined indicate a high likelihood of a move up for the Bitcoin price from its current level. He added that a bounce is likely in the short term. However, the analyst noted that the bigger question is whether this would be a bounce to new all-time highs (ATHs) or just a relief rally on the way down in a bear market. Regardless of what happens, he is optimistic that an upward move will occur in the short term. Colin also alluded to the fact that the Federal Reserve will end quantitative tightening (QT) by December, a move which he described as another bullish catalyst for the Bitcoin price. This move is expected to inject more liquidity into the BTC and possibly spark higher prices for the flagship crypto. The Fed could also cut rates again at the December FOMC meeting, which would be a bullish catalyst for Bitcoin. Another Analyst Confirms Death Cross Popular crypto analyst Benjamin Cowen also confirmed that the Bitcoin price just had a death cross. He noted that prior death crosses have marked local lows in the market. However, he added that the death cross rally fails when the cycle is over, which could be the case this time if the bull market is over. Related Reading: Why Are The Bitcoin, Ethereum, And Dogecoin Prices Down Again? Cowen stated that the time for the Bitcoin price to bounce if the cycle is not over would start within the next week. The analyst further remarked that if no bounce occurs within one week, another dump is likely before a larger rally back to the 200D SMA, which he claimed would mark a macro lower high. Meanwhile, market analyst Subu Trade shared data on how BTC has reacted after historical death crosses. The last death cross occurred in April this year, and the flagship crypto recorded a 22% gain following it. At the time of writing, the Bitcoin price is trading at around $95,100, down in the last 24 hours, according to data from CoinMarketCap. Featured image from Pngtree, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|Benjamin Cowen|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|CoinMarketCap|Colin|death cross|federal reserve|FOMC Meeting|QT|quantitative tightening",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54524828,
    "published": 1763380800000,
    "title": "Africa Embraces Stablecoins Via IOTA to Unlock $70B Pan-Continent Trade Tech",
    "body": "Formed in partnership with the Tony Blair Institute and the WEF, the initiative aims to overhaul trade with USDT payments across 55 African nations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Africa|Stablecoins|Trade Finance|IOTA|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 166,
        "NAME": "IOTA",
        "CATEGORY": "IOTA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54524803,
    "published": 1763380617000,
    "title": "Bitcoin’s Weekend Dip to $93K Sparks Volatility, ‘Extreme Fear’: What’s Next?",
    "body": "Experts forecast volatile consolidation after Bitcoin dropped to $93K Sunday, triggering 'Extreme Fear' and a Death Cross signal.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54525647,
    "published": 1763381928000,
    "title": "Singapore’s SGX to launch Bitcoin and Ether perps as institutional demand climbs",
    "body": "SGX is aiming to capture rising institutional crypto demand by launching the second set of Bitcoin and Ether perpetual futures products in Singapore.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54526487,
    "published": 1763383674000,
    "title": "Crypto ETPs see biggest weekly outflows since February as investors pull $2B",
    "body": "Investors retreat from crypto ETPs across major regions, resulting in a 27% decline in AUM from October’s peak as uncertainty drives a shift toward safer products.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54527252,
    "published": 1763384400000,
    "title": "Crypto Firm LevelField Secures Illinois Approval to Buy Bank",
    "body": "LevelField Financial Inc. said it secured an approval by the Illinois Department of Financial and Professional Regulation to buy Chicago-based Burling Bank and turn it into a full-service bank providing cryptocurrency services.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54527778,
    "published": 1763386251000,
    "title": "Here’s Why The Ethereum Price Is Crashing Again, Can It Breach $3,000?",
    "body": "The Ethereum price has slipped deeper into a bearish structure that has intensified over the past week. A combination of weakening momentum, strong ETF outflows, and selling from long-term holders has dragged the price of Ethereum lower at a pace that has led to concerns about whether the cryptocurrency is preparing for a deeper correction. The latest decline has now placed the $3,000 region back into view and it opens up the question of whether the momentum behind this downturn is strong enough to force another breakdown below $3,000. Ethereum Price Slips Below Moving Averages As ETF Outflows Deepen New data from 10x Research reveals that Ethereum is now trading firmly below both the 7-day and 30-day moving averages, confirming a clean shift toward bearish momentum. The latest one-week change shows a decline of -6.6%, with the price failing to regain the short-term trendline at any point during the sell-off. Related Reading: This Analyst Called The Bitcoin Crash Below $20,000 In 2021, He’s Back With A Shocking Prediction For Solana The chart provided by the research firm illustrates how ETH-USD rolled over throughout early November as both moving averages curved downward, indicating that market structure has fully weakened. This technical deterioration is unfolding at the same time the Ethereum ETF market is experiencing one of its heaviest redemptions on record. According to data from SoSoValue, spot ETH ETFs have now seen more than $1.4 billion in net outflows since the beginning of November, a change that shows the decisive shift in institutional appetite. The combination of sustained selling pressure and shrinking ETF demand has created a feedback loop that continues to pull ETH lower whenever each price support level fails. XRP Price Chart. Source: 10X Research On X Long-Term Holders Selling Fastest Since 2021, But Whales Are Accumulating On-chain flows paint a picture of an ecosystem under strain. Data shows that long-term ETH holders, wallets that have held their coins for three to ten years, are now selling at their fastest rate since 2021. This group is known to be dormant during most phases of the market, so their recent activity has introduced a strong supply wave that exchanges have struggled to absorb. Related Reading: What Will Trigger The XRP 1,300% Break To $36 This Bull Cycle? However, the dynamic is not entirely one-directional. On-chain data shows that a few large whale wallets have stepped in aggressively during the downturn and bought hundreds of thousands of ETH worth over $1 billion. Meanwhile, the scale of accumulation has not been large enough to counteract the broader selling from long-term holders or the ETF outflows, leaving the price of Ethereum trapped inside a downward-tilting trend channel. Ethereum is now trading around $3,182, but its intraday low has stretched as far as $3,023. This leaves very little margin between the current level and the support zone at $3,000. If sellers continue to dominate and push the price below the $3,150 to $3,200 range, a direct slide to $3,000 becomes increasingly likely during the new week. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54527466,
    "published": 1763385264000,
    "title": "Chat Control stumbles again as EU retreats from mandatory scanning",
    "body": "EU lawmakers stripped out mandatory client-side message scanning from the latest Chat Control draft, but invasive age checks and voluntary scanning remain.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54528242,
    "published": 1763386836000,
    "title": "Trump Organization to tokenize Maldives resort development for early investors",
    "body": "The tokenized luxury resort development plan may set a “new benchmark” for tokenized real estate investment, said Eric Trump.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 54528620,
    "published": 1763387714000,
    "title": "Bitcoin Hyper and the Hunt for the Next 1000x Crypto in 2025",
    "body": "What to Know: Bitcoin volatility and extreme fear push investors toward infrastructure narratives like Bitcoin Layer-2s that can benefit if the macro bull case plays out. Bitcoin Hyper ($HYPER) uses an SVM-based Layer-2, canonical bridge, and ZK-secured rollup design to bring fast, low-fee $BTC transactions and DeFi. The $HYPER presale has raised over $27.8M with whale participation, creating a sizable runway for development and liquidity programs. Forecasts suggest potential 6.5x upside from today’s token price by 2026 if Bitcoin Hyper executes its roadmap and Layer-2 demand grows. Bitcoin’s latest cycle is in full drama mode. After ripping to six-figure territory earlier this year, it has since slipped back under $100K, with recent moves below $93K triggering a fear and greed reading near ‘ extreme panic ’. Zoom out, though, and the big picture still leans bullish. Several major research desks and high-profile analysts continue to float targets between $200K and beyond for this cycle, with Hayes even hinting at a $1M $BTC by 2028 as institutional adoption ramps and treasuries continue to accumulate. That mix of macro optimism and short-term volatility pushes more capital away from pure ‘number go up’ bets and into infrastructure plays. One of the loudest narratives for 2025 is Bitcoin scaling: Layer-2 solutions, rollups, and sidechains built to handle the fees and congestion created by Ordinals, Runes, and the first wave of Bitcoin DeFi. Bitcoin Hyper ($HYPER) fits straight into this setup. It is a Bitcoin Layer-2 that uses Solana’s Virtual Machine (SVM) to bring high-throughput and low-fee execution to $BTC, with a canonical bridge and rollup design that settles back to Bitcoin for security. Its presale has already attracted over $27.8M, with a token price of $0.013285 and massive post-launch potential. With a projected official launch window set for Q4 2025 – Q1 2026, $HYPER could become the next 1000x crypto in 2026 and beyond. Buy your $HYPER today before the presale window closes. Bitcoin Hyper Aims To Turn Bitcoin Into A High-Speed DeFi Rail Bitcoin Hyper’s ($HYPER) thesis is simple: keep Bitcoin’s base-layer security while offloading activity to a dedicated execution environment. Users deposit $BTC to a monitored address on Layer-1, a canonical bridge verifies the transaction, then equivalent $BTC is minted on the Bitcoin Hyper Layer-2. From there, transfers and interactions happen in an SVM environment designed for near-instant finality and high throughput, before batched state updates and zero-knowledge proofs are committed back to Bitcoin. In practice, that means cheap $BTC payments, on-chain order books, staking, and even meme coins that are still anchored to Bitcoin’s settlement layer. Developers who already understand Solana’s tooling get a familiar stack while tapping into Bitcoin liquidity, which is exactly the combo many builders have been waiting for. If Bitcoin DeFi volume continues to grow and programmable $BTC takes off, a performant Layer-2 designed for that flow is well-positioned to capture fees and user attention. That is the core utility bet behind $HYPER. If you want to support that utility, buy your $HYPER today. The $HYPER Presale and ROI Scenarios For 2025–2026 On the numbers side, the Bitcoin Hyper presale has already crossed $27.8M, helped by at least one $502K whale ticket and consistent daily inflows despite the broader market wobble. Based on the community hype, investor participation, and the project’s express utility, our price prediction for $HYPER suggests a high of $0.08625 in 2026, assuming the roadmap stays on track. Against a $0.013285 entry, this implies roughly a 6.5x return in a 2026 scenario where the DAO is live, node incentives are working, and Bitcoin Layer-2 adoption continues to compound. These are not moonshots compared with meme-coin pumps, but they are realistic multiples for an infrastructure token that actually has to run a chain. With a clear-cut roadmap , a narrative aligned with Bitcoin’s technical development, and an influx of investors, we can rank $HYPER among the best presales of 2025. This makes it a great investment opportunity for $BTC holders who want scaling exposure rather than another meme. If you’re sold, read our guide on how to buy $HYPER beforehand. Buy your $HYPER today before the presale ends. This isn’t financial advice. DYOR before investing. Authored by Aaron Walker, NewsBTC: www.newsbtc.com/news/next-1000x-crypto-bitcoin-is-hyper-2025-best-crypto-presale",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54529353,
    "published": 1763388900000,
    "title": "Meta (Facebook) Ushers In The AI Audit Era. Can Blockchain Verify?",
    "body": "Meta (Facebook) starts AI audits to track employee results. This could spark a wider shift to verify AI performance and blockchain \"trust verification\" could help.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|Business|/business|Innovation Rx: Technologies|/feature/innovation-rx/technologies|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 54530094,
    "published": 1763390378000,
    "title": "DeFi Lender Aave to Roll Out Retail Crypto Yield App on Apple’s App Store",
    "body": "With the Aave App, users will be able to earn over 5% annual yield on their deposits, higher than money market funds, the protocol said in a blog post.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|DeFi|Apple|Yield|Aave|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54530694,
    "published": 1763391609000,
    "title": "Crypto Carnage Continues — Tom Lee Exposes What’s Really Going On",
    "body": "The global crypto market pulled back to about $3.23 trillion on Monday, down close to a percent from recent levels, and signs of weakness were visible across most top tokens. Related Reading: From Dotcom To Crypto: Veteran Analyst Says The Bull Run Isn’t Over According to market trackers, investor mood is chilled — the Fear and Greed Index sits at 18, labeled extreme fear — and the average Relative Strength Index for major coins hovers near 41, a reading that leans toward oversold conditions. Bitcoin was trading around $95,400 while Ethereum hovered near $3,155, with many large-cap assets showing only small daily moves. Tom Lee Issues Long-Term Take According to Tom Lee, BitMine chairman and an early Bitcoin bull at Fundstrat, the current pullback does not wipe out the potential for much larger gains down the road. Lee noted that Bitcoin rose roughly 100x from his first recommendation back in 2017, when the price was near $1,000, and he suggested Ethereum may be at the start of a similar long-term run. BitMine Chairman Tom Lee suggested that the recent crypto market weakness may be due to one or more market makers having a “hole” in their balance sheets, with “sharks” circling to trigger liquidations and push BTC lower. He emphasized that this is short-term pain and does not… — Wu Blockchain (@WuBlockchain) November 16, 2025 He cautioned that investors who benefited from past rallies had to endure extreme drops — some as deep as 75% — and said present volatility could be the market “discounting a massive future.” Short-Term Signals Point To Oversold Conditions Market technicians and on-chain analysts are pointing to clear short-term stress. The Fear and Greed Index at 18 is one headline figure. Average RSI readings near 41 imply more selling than buying momentum right now. To me, the weakness in crypto has the all the signs – of a market maker (or two) with a major “hole” in their balance sheet Sharks circling to trigger a liquidation / dumping of prices $BTC Is this pain short-term? Yes Does this change the $ETH supercycle of Wall Street… pic.twitter.com/0jfkXYnfv9 — Thomas (Tom) Lee (not drummer) FSInsight.com (@fundstrat) November 15, 2025 Based on reports from CryptoQuant, Ether trading around $3,150 sits roughly $200 above the mean cost basis held by long-term accumulators — a level that could act as support if those holders remain patient. Bitcoin, by comparison, has pulled back about 20% from its recent peak, while Ethereum has fallen more than 30% from its high. Bitcoin is a volatile asset. We first recommended Bitcoin to Fundstrat clients in 2017 (1%-2% allocation) – Bitcoin 2017 ~$1,000 Since then (past 8.5 years), $BTC: – 6 declines > -50% – 3 declines > – 75% 2025, Bitcoin 100x from our first recommendation TAKEAWAY: To have… pic.twitter.com/xtIRGLdnWM — Thomas (Tom) Lee (not drummer) FSInsight.com (@fundstrat) November 16, 2025 Ether Holder Levels Close To Historic Peaks Ethereum’s path this year diverged from Bitcoin for a while: ETH topped out at $4,940 in August, while Bitcoin pushed to a peak above $126,000 in October. That gap left Ether lagging for months even as Bitcoin made fresh highs. Now, with ETH nearer to where long-term holders bought in, some analysts see a potential floor forming. Reports have disclosed that these accumulators have been “patiently stacking,” and their cost positions matter for near-term price action. Altcoins Show Little Momentum Smaller large-cap coins are holding weaker ground. XRP was trading near $2.20, BNB around $932 and Solana close to $138, with most of last week’s gains fading. Other popular tokens — Tron, Dogecoin, Cardano, Chainlink, Hyperliquid and Zcash — are under light selling pressure and low net movement, suggesting market-wide caution rather than a single-asset sell-off. Related Reading: Trump Drops 500% Tariff Shockwave, Crypto Trembles — Bitcoin Breakdown Ahead? Bigger Players, Liquidations And The Outlook Lee added that he expects signs of recovery and stability within six to eight weeks. He advised against using borrowed funds now, warning that forced sell-offs can accelerate losses. According to his remarks, aggressive positions designed to trigger liquidations by large firms can amplify price swings. He cautioned that some of the sharper moves may be tied to stress among big market makers. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|Bear market|bitcoin|btc|btcusd|crypto|ETH|ethereum|ethusd|Tom Lee|whales",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54530827,
    "published": 1763391659000,
    "title": "How the new US crypto bill could finally define commodities and securities",
    "body": "The new US crypto bill could settle the commodity-versus-security debate and reshape compliance, trading and innovation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54531575,
    "published": 1763393459000,
    "title": "Figment, OpenTrade and Crypto.com Offer 15% Stablecoin Yield Product for Institutions",
    "body": "The new offering uses SOL staking and futures to deliver returns without price exposure, targeting compliance-minded investors.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Staking|Figment|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54532011,
    "published": 1763382895000,
    "title": "BONK Retreats as Resistance Rejection and Rising Volume Stall Uptrend",
    "body": "BONK slipped back into its lower range after multiple failed pushes toward $0.00001090, with elevated trading activity underscoring consolidation.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Technical Analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 113,
        "NAME": "BONK",
        "CATEGORY": "BONK"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54532281,
    "published": 1763394833000,
    "title": "Bitcoin Accumulation Amid Market Weakness? Sharp Rise in 1K BTC Holders Suggests So",
    "body": "Rising whale activity hints at strategic positioning during bitcoin’s downturn.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Glassnode|Whales|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54532632,
    "published": 1763395376000,
    "title": "Republic raises $100M for ETH purchases under unusual zero-interest deal",
    "body": "Republic Technologies secured a zero-interest convertible loan to expand its Ether holdings, a structure that could limit shareholder dilution.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54533070,
    "published": 1763396359000,
    "title": "Strategy steps up Bitcoin buys with 8,178 BTC purchase",
    "body": "After weeks of reporting Bitcoin purchases hovering around 400 to 500 BTC, Michael Saylor’s company announced a massive crypto investment on Monday.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54533655,
    "published": 1763397510000,
    "title": "High-Stakes Gambler Liquidated for $168M After Shorting the Bottom of Crypto Plunge",
    "body": "A high-stakes crypto trader was wiped out on HyperLiquid before immediately piling back into massive leveraged shorts on GMX — echoing past blow-ups from reckless market punters.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|liquidation|short liquidation|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54533585,
    "published": 1763397468000,
    "title": "Money’s Too Tight To Mention: How The Fed Is Keeping Things Afloat",
    "body": "Right now, money has gotten tight. The Fed has been shrinking its balance sheet for ages, trying at least to make it look less titanic while also draining excess cash.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54533470,
    "published": 1763397172000,
    "title": "BlackRock's Bitcoin ETF Sheds Record $463M as Crypto Funds See Worst Week Since February",
    "body": "Digital asset investment products shed $2 billion last week amid monetary-policy uncertainty and accelerating risk-off sentiment.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54534529,
    "published": 1763399476000,
    "title": "Cboe to Debut Bitcoin, Ether ‘Perpetual-Style’ Crypto Futures on Dec. 15",
    "body": "The contracts will offer long-term crypto exposure without rollovers, tailored for institutions avoiding offshore risk.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|CBOE|perpetual contracts|Derivatives|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54534408,
    "published": 1763399148000,
    "title": "DappRadar's token price plummets after platform announces shutdown",
    "body": "The platform’s founders reached out through social media and email to say DappRadar would soon stop tracking blockchains and DApps.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54535115,
    "published": 1763400564000,
    "title": "Global Probe Finds Illicit Crypto Moving in Patterns Across Major Exchanges",
    "body": "The ICIJ has outlined how criminals blend on-exchange activity with brokers and storefronts that remain difficult for regulators to monitor.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54534868,
    "published": 1763399994000,
    "title": "Figment, OpenTrade debut Solana-based stablecoin product targeting 15% APR",
    "body": "A hedged SOL staking model underpins the new yield product, debuting amid rising institutional demand for regulated access to Solana’s network rewards.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54535543,
    "published": 1763401176000,
    "title": "Figure Stock Jumps as Druckenmiller Invests $77M, Analysts Raise Price Targets",
    "body": "Analysts cited Figure’s shift to ‘capital-light’ model and stablecoin launch on the Provenance blockchain.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Figure|Stanley Druckenmiller|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54535368,
    "published": 1763401082000,
    "title": "Almost Perpetual? CBOE to Offer 'Continuous' Bitcoin, Ethereum Futures",
    "body": "The products are expected to debut next month.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54535325,
    "published": 1763336532000,
    "title": "Bitcoin briefly erases 2025 gains as crypto bleeds over weekend",
    "body": "Bitcoin’s latest tumble pushed it below the $93,507 price it entered the year at, despite the year mostly seeing positive industry developments from corporations and governments.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54535369,
    "published": 1763336532000,
    "title": "Bitcoin briefly erases 2025 gains as crypto bleeds over weekend",
    "body": "Bitcoin’s latest tumble pushed it below the $93,507 price it entered the year at, despite the year mostly seeing positive industry developments from corporations and governments.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54535533,
    "published": 1763336532000,
    "title": "Bitcoin briefly erases 2025 gains as crypto bleeds over weekend",
    "body": "Bitcoin’s latest tumble pushed it below the $93,507 price it entered the year at, despite the year mostly seeing positive industry developments from corporations and governments.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54535471,
    "published": 1763336532000,
    "title": "Bitcoin briefly erases 2025 gains as crypto bleeds over weekend",
    "body": "Bitcoin’s latest tumble pushed it below the $93,507 price it entered the year at, despite the year mostly seeing positive industry developments from corporations and governments.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54535228,
    "published": 1763336532000,
    "title": "Bitcoin briefly erases 2025 gains as crypto bleeds over weekend",
    "body": "Bitcoin’s latest tumble pushed it below the $93,507 price it entered the year at, despite the year mostly seeing positive industry developments from corporations and governments.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54535572,
    "published": 1763336532000,
    "title": "Bitcoin briefly erases 2025 gains as crypto bleeds over weekend",
    "body": "Bitcoin’s latest tumble pushed it below the $93,507 price it entered the year at, despite the year mostly seeing positive industry developments from corporations and governments.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54535265,
    "published": 1763336532000,
    "title": "Bitcoin briefly erases 2025 gains as crypto bleeds over weekend",
    "body": "Bitcoin’s latest tumble pushed it below the $93,507 price it entered the year at, despite the year mostly seeing positive industry developments from corporations and governments.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54535949,
    "published": 1763402447000,
    "title": "BlackRock XRP ETF Speculation Hit New Highs As XRPC Performance Shocks Markets",
    "body": "The speculation surrounding a potential BlackRock XRP ETF has surged to new heights. This surge is a direct consequence of the astonishing market debut of the Canary XRPC ETF. Canary XRP ETF’s launch has painted a clear picture of robust institutional and retail demand for a regulated XRP investment product. Why XRPC’s Success Fuels BlackRock Rumors As the speculation around a potential BlackRock XRP ETF is heating up again, the Canary XRPC ETF has delivered one of the strongest launches of the year. An analyst known as Skipper_xrp has noted on X that the newly listed fund stunned the market with over $58 million in first-day trading volume and $245 million in net inflows, outperforming hundreds of ETF debuts of 2025. Related Reading: XRP ETF Completes First Full Day Of Trading, Here’s Why The Community Is Shocked Skipper_xrp mentioned that many supporters in the XRP community still believe that BlackRock might already be quietly experimenting with or even testing the idea of an XRP trust behind closed doors. The momentum has increased further after Ripple CEO Brad Garlinghouse made a statement at the company’s Swell event, highlighting that Ripple’s ongoing collaboration with major traditional financial firms will bring digital asset adoption into regulated global markets. However, with the ETF inflows accelerating and XRP gaining more visibility among institutions, many investors are now arguing that it’s only a matter of time before a heavyweight firm like BlackRock will consider stepping into the XRP space. Understanding XRP’s Long-Term Growth Trajectory Crypto trader Adam_Xrp has also offered some insight on why XRP didn’t moon when the first ETF was launched. According to the expert, the XRP ETF launch was never going to be a flip-the-switch moment. Even with the first XRP ETF going live, price action was building slowly, and the institutional money did not pour in all at once. Rather, it scales over time as confidence and liquidity grow. Related Reading: New XRP ETF Just Dropped, But Will Anything Be Different This Time? Furthermore, the altcoin is still early in the rollout, and more XRP ETFs are scheduled to begin trading. Each new product will increase exposure, volume, and demand. This is how true institutional adoption is slowly progressing. BlackRock has stated that the company is not launching an XRP ETF right now, but this isn’t something they would ignore forever. However, once the regulatory path is fully cleared and institutional demand strengthens, it’s only a matter of time before the biggest players, like BlackRock, will step into the arena. Adam_Xrp concluded that the altcoin wasn’t supposed to skyrocket overnight. This phase is a gradual process of foundation building as the ecosystem, liquidity expansion, and the institutional framework grow. The expert added that if you expect to get rich overnight, without understanding the long-term game plan, then XRP might not be the right investment for you. Featured image from Pxfuel, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|Adam_XRP|BlackRock|Brad Garlinghouse|Canary XRPC ETF|Ripple|Skipper_xrp|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54536038,
    "published": 1763336532000,
    "title": "Bitcoin briefly erases 2025 gains as crypto bleeds over weekend",
    "body": "Bitcoin’s latest tumble pushed it below the $93,507 price it entered the year at, despite the year mostly seeing positive industry developments from corporations and governments.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54536343,
    "published": 1763336532000,
    "title": "Bitcoin briefly erases 2025 gains as crypto bleeds over weekend",
    "body": "Bitcoin’s latest tumble pushed it below the $93,507 price it entered the year at, despite the year mostly seeing positive industry developments from corporations and governments.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54536509,
    "published": 1763403522000,
    "title": "Kindly MD Delays Earnings Report Filing as Merger Losses Mount; Shares Drop",
    "body": "Complex post-merger accounting prompts a late filing while losses mount and the shares slip further.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Nakamoto|Bitcoin News|Earnings|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54537079,
    "published": 1763404661000,
    "title": "UK Man Who Hacked Musk, Obama Accounts for Bitcoin Scam Ordered to Pay Back $5 Million",
    "body": "A man convicted of hijacking celebrity and brand Twitter accounts in 2020 to perpetrate a Bitcoin scam has to pay back over $5 million.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 54536910,
    "published": 1763404243000,
    "title": "Serious $1 Trillion Crypto Price Crash Warning Sparks Panic As Bitcoin Drop Suddenly Accelerates",
    "body": "Analysts are warning the crypto market could be about to lose another $1 trillion...",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54537514,
    "published": 1763405648000,
    "title": "What Next For Dogecoin as Bitcoin 'Death Cross' Puts Major Memecoin in Crosshairs",
    "body": "Bitcoin's Death Cross, a bearish signal, occurred as the 50-day moving average fell below the 200-day moving average.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Dogecoin|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54538594,
    "published": 1763407730000,
    "title": "Bitcoin Just Erased All of Its 2025 Gains—And the 'Picture Remains Fragile', Says Analyst",
    "body": "Bitcoin dropped below $93,000 on Monday, wiping out 2025 gains as analysts warn of breaking key support levels amid delayed cycle concerns.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54538956,
    "published": 1763408279000,
    "title": "Cboe to launch perpetual-style Bitcoin and Ether futures in US",
    "body": "The exchange's 10-year Bitcoin and Ether contracts mimic perpetuals through daily cash adjustments, giving users a regulated way to trade crypto futures in the US.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54538999,
    "published": 1763350370000,
    "title": "Tether mulls $1.15B deal with AI robotics startup Neura: Report",
    "body": "Tether is reportedly considering a $1.15 billion bet on robotics startup Neura, which could see its valuation rise to over $10 billion should a deal be made.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54539896,
    "published": 1763410453000,
    "title": "Trump International Maldives Hotel Will Offer Tokenized Real Estate Investments",
    "body": "The Trump Organization is tokenizing the development of its latest real estate venture, a collection of luxury villas in the Maldives.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 54540689,
    "published": 1763412000000,
    "title": "XRP traders hope fresh wave of ETF launches will restore the bull trend",
    "body": "A handful of XRP ETFs could launch this week, leading traders to predict the start of a new rally, but the desired bullish momentum is dependent on the altcoin holding above $2.20.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54541025,
    "published": 1763413248000,
    "title": "The ‘Insanely Bullish’ Dogecoin Setup That Will Trigger A 600% Rally To $1",
    "body": "Dogecoin has spent the past few days struggling to regain momentum after a series of pullbacks dragged the price back toward the mid-$0.16 region. The broader market has also been unstable, adding pressure to Dogecoin. Despite this stretch of bearish price action, a deeper look at the higher-timeframe chart shows a structure that has not been invalidated by the recent decline. This is where a technical analysis from XForceGlobal comes in, as he argues that Dogecoin is sitting inside an “insanely bullish” long-term formation that is unfolding beneath the surface. The 5-Wave Structure Behind Dogecoin’s Bullish Setup A detailed technical analysis shared by XForceGlobal on the social media platform X argues that Dogecoin is nearing the final stages of an Elliott Wave formation. His interpretation points to cycle targets well above $1 and frames the ongoing price action as part of a developing fifth impulse wave. Related Reading: Top Meme Coins Besides Dogecoin And Shiba Inu With Potential Still Seeing Major Interest The chart shared by XForceGlobal outlines an idealized Elliott Wave cycle that stretches back almost a decade. Dogecoin has already completed the first four major waves on the macro level. The technical analysis shows the fifth wave technically began months ago, with the fourth wave bottom forming sometime between late 2023 and early 2024. However, the prolonged pullbacks of the past few months introduce the possibility that the fourth wave may still be playing out, instead of the fifth wave. Despite the choppy price action, the analysis shows that the fourth wave low is protected, and the current price action is still the fifth wave. The chart also shows how Dogecoin has been distributing within a narrowing structure, but the lows have consistently held. Both of the scenarios visualized on Dogecoin’s price chart still lead to a new all-time high once the rally resumes for another strong push. Why The Next Dogecoin Wave Points Toward $1 XForceGlobal noted that “cycle targets are still $1+,” a projection supported by the geometry of the fifth wave. The structure resembles the same formations that highlighted Dogecoin’s massive expansions in earlier bull cycles, particularly in 2017 and 2021. Nonetheless, it’s important to note that there’s still room for more distribution. Related Reading: Analyst Predicts Dogecoin Price “Historic Mega Run” – Here’s The Target The current resistance zones sit far below his projected fifth-wave target zone, and the broader market structure shows no violation of the wave-4 levels that must hold for the setup to still be valid. The chart highlights a potential path that first moves through the $0.33-$0.47 zone before clearing the psychological $0.50 threshold and finally breaking above its current all-time highs at $0.731 and further up into the $1 region. A full extension of the fifth wave from present levels implies a price target around $1.768. At the time of writing, Dogecoin is trading at $0.1618. Featured image from Peakpx, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt|Elliott Wave Formation|meme coin|XForceGlobal",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 44,
        "NAME": "SHIB",
        "CATEGORY": "SHIB"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54540938,
    "published": 1763412895000,
    "title": "Grayscale Poised to Debut Dogecoin ETF as VanEck's Solana Fund Starts Trading",
    "body": "A Grayscale ETF tracking popular meme coin Dogecoin could list next next week, while a VanEck Solana fund debuted Monday.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "dogecoin||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54542345,
    "published": 1763415802000,
    "title": "Bitcoin Treasury KindlyMD Extends Stock Collapse After Earnings Delay",
    "body": "KindlyMD shares dropped another 10% after missing its Q3 earnings deadline, with the company citing merger accounting complexity and warning of major losses ahead.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54542145,
    "published": 1763415378000,
    "title": "Aave launches retail savings app with up to 9% APY to compete with banks",
    "body": "With higher yields and flexible deposits, Aave’s new app marks a deeper move into the consumer banking terrain as inflation drives demand for better savings tools.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54542828,
    "published": 1763416847000,
    "title": "Ethereum Flashes Rare Oversold Signal As Price Hits Demand Zone — Major Rebound Loading?",
    "body": "Ethereum (ETH) is flashing a rare technical warning sign for bears. According to the analysis, the daily chart has hit a historically oversold MACD reading not seen in years, aligning with a deeply oversold RSI. This confluence of extreme momentum signals suggests that the price has entered a major demand zone, dramatically increasing the likelihood of a powerful relief rally and setting the stage for a significant short-term rebound. MACD Hits Rare Historical Lows — A Zone Linked To Major ETH Bottoms According to a recent post from More Crypto Online, Ethereum is currently flashing one of its most extreme MACD readings seen in years on the daily timeframe. While the MACD technically has no fixed oversold threshold, comparing past cycles gives valuable context. Historically, ETH has often formed significant market bottoms whenever the MACD enters the -210 to -220 region, a zone it has dipped below a few times, but not often. Related Reading: Ethereum Slips to $3K, Highlighting Weakness After Recent Failed Rebound This puts the current MACD position into what can be considered a historically oversold zone, signaling increased potential for a relief bounce. Adding to this confluence, the RSI has also slipped deep into oversold territory, reinforcing the idea that sell pressure may be nearing exhaustion. Together, both indicators suggest that momentum could soon shift away from the bears. However, the analyst cautions that these signals alone do not confirm a major trend reversal. Oversold conditions can persist longer than expected, particularly in strong downtrends. Even so, such extreme readings are often early clues that a temporary recovery or a corrective move to the upside may be approaching. Overall, the current market structure gives the bears something to think about. Early Signs Of Relief: Ethereum Finds Stability In Key Demand Zone In a 3D market update, CryptoPulse reported that Ethereum has now cleanly tapped the identified Demand Zone, showing early signs that the aggressive downside may be easing. This reaction suggests sellers are losing momentum, creating the conditions for a potential short-term rebound if buyers step back in. Should bullish strength return, a retest of the $3,500 region is likely in the coming sessions. Related Reading: Ethereum Approaches Critical Resistance — Bullish Breakout Or Trap In The Making? However, CryptoPulse emphasized that confirmation is still required before calling any meaningful reversal. A strong bounce paired with a reclaim of key short-term levels would be the first signal that buyers are regaining control. Meanwhile, if bearish pressure persists, Ethereum may drift deeper into the chart structure, where the next significant demand sits between $2,400 and $2,600. This zone could act as the major support zone for ETH if the current support fails to hold. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|CryptoPulse|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|ethusd|ETHUSDT|MACD|More Crypto Online|RSI",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54542724,
    "published": 1763416567000,
    "title": "DappRadar Shuts Down, Citing ‘Financially Unsustainable’ Market",
    "body": "Launched in 2018, the platform had grown into one of the most prominent analytics hubs for on-chain activity.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|DappRadar|Shutdown|NFT|Top Stories|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54542450,
    "published": 1763415908000,
    "title": "ETH falls to 4-month low under $3K: Is the bull market over?",
    "body": "ETH price fell below $3,000 for the first time since July. Cointelegraph explains what is required for a trend reversal.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54537666,
    "published": 1763405948000,
    "title": "Bitcoin Slips Below $93K as Crypto Weakness Worsens, but Local Bottom Could Be Near, Analysts Say",
    "body": "BTC has erased all year-to-date gains with the Monday decline, while crypto-related stocks like COIN, CRCL, MSTR, GLXY also plunged.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Market Wrap|Bitfinex|Breaking News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]