[
  {
    "id": 57192758,
    "published": 1768501362000,
    "title": "DeFi sees ‘bad’ crypto bill’s collapse as win, not setback",
    "body": "The latest push to establish a comprehensive U.S. crypto market structure framework hit a snag this week, but leaders in DeFi don’t seem alarmed by the collapse.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Coinbase|crypto market|Congress|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57192726,
    "published": 1768501180000,
    "title": "House Democrats slam SEC for dropping crypto cases with  Trump ties",
    "body": "In a letter on Thursday, lawmakers accused the SEC of enabling a \"pay-to-play\" dynamic after dropping cases against Binance, Coinbase, Kraken and Justin Sun.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Policy|SEC|Paul Atkins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57192972,
    "published": 1768501852000,
    "title": "US lawmakers demand action from SEC on Justin Sun enforcement case",
    "body": "Three House Democrats warned that leaving the SEC's case against the Tron founder unresolved could ”undermine investors’ confidence” in the financial regulator.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 57193311,
    "published": 1768502937000,
    "title": "Bitcoin whale balances see 21% bounce after fastest sell-off since 2023 ends",
    "body": "Increasing Bitcoin whale balances highlight reaccumulation, aligning with renewed spot BTC ETF inflows. Will $100,000 become support soon?",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57193740,
    "published": 1768504534000,
    "title": "XRP Will Skyrocket Beyond $18: Analyst Suggests 800% Growth Potential In 2026",
    "body": "Market expert Bird has recently issued a bold forecast for XRP, the fifth-largest cryptocurrency, suggesting that it could experience a major upside of 800% within this year. If this prediction holds true, XRP could reach a new all-time high of $18.40 per coin. Forecast Indicates XRP Might Rival Ethereum Bird’s forecast hinges on the XRP/BTC ratio, which he predicts will reach 1:5,000 by the end of 2026. This means that 5,000 XRP would be equivalent to 1 Bitcoin (BTC). Currently, the XRP/BTC ratio trades at approximately 0.00002235. Related Reading: Crypto Market Bill Draft Criticized For Allowing Continued Developer Prosecution For Bird’s envisioned target to materialize, the ratio must increase to 0.0002 BTC per token, representing a substantial gain of around 794% from current levels. With a total supply of 100 billion coins, this price projection implies an overall valuation of approximately $1.84 trillion for XRP. Such a figure would place the cryptocurrency in close competition with Ethereum—and striking distance of Bitcoin’s market cap. Additional Price Scenarios For The Altcoin Market expert Sam Daodu also outlined alternative scenarios for XRP’s future performance. In a base case, where the altcoin garners continued institutional support but doesn’t close the gap with Bitcoin’s market capitalization, the price could range between $3 and $4. This outcome would depend on exchange traded funds (ETFs) attracting a “few billion in assets” while Bitcoin’s dominance falls to the 40–50% range during a broader altcoin rotation. Related Reading: Zcash Foundation Investigation Closed: SEC Decision Sparks 12% Jump In ZEC Price Conversely, there exists a bear case where macroeconomic challenges or obstacles within the crypto ecosystem could hinder XRP’s price growth. Factors such as geopolitical instability could redirect capital back to Bitcoin and gold, while banks might opt for private ledgers and established stablecoins instead of adopting XRP. Monthly escrow releases from Ripple of 1 billion coins, accompanied by a potential diminishing exchange-traded fund demand, might cap any potential upside action for the cryptocurrency, leaving it to trade around its current trading prices of $2. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|bitcoin|crypto|crypto news|ethereum|Ripple|xrp|xrp news|XRP Price Analysis|XRP Price Forecast|XRP price forecasts|XRP price news|XRP/BTC ratio|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57193994,
    "published": 1768505407000,
    "title": "Ethereum Chart Turns Bullish: New Cycle Energy Points To $5,000",
    "body": "Ethereum is back to trading just above $3,300 per ETH in a slow bullish extension over the past week. After months of wide swings and failed follow-throughs above $3,000, the structure on the monthly timeframe chart is beginning to look bullish in a way that traders should take seriously. A recent technical breakdown shared by Merlijn The Trader on X shows that Ethereum is approaching a moment where consolidation could give way to forceful expansion, with $5,000 as the most important inflection point. Bullish Pennant Says Bullish Momentum About To Be Unlocked The chart showing the technical analysis from Merlijn shows a bullish pennant forming on Ethereum’s monthly timeframe. This bullish pennant shows that price action has been compressing between a rising support line and a descending resistance line, and this has created a narrowing structure since 2021. Related Reading: Here’s Why The Bitcoin, Ethereum, And Dogecoin Prices Are Surging Today Ethereum briefly pushed above the upper boundary of this pennant in 2025, rallying to just under the $5,000 mark before momentum faded and corrective moves followed. Since then, price action appears to be gravitating back toward the former resistance line, now acting as a key area of interest. As it stands, Ethereum is now retesting the upper trendline of this bullish pennant for a final upward move. Based on this projection, the first major barrier for Ethereum to break is around $3,300. A clean break above that level would likely open a path toward $3,600, an area that previously acted as a turning point during past rallies. The most consequential zone, however, is around the August 2025 all-time high of $5,000. A break above this zone would unlock bullish momentum based on the bullish pennant and play out in the majority of 2026. How Can This Breakout Play Out? Merlijn’s chart doesn’t stop at the breakout trigger once it breaks above the upper trendline of the pennant. It sketches a full road map for how the move could unfold once Ethereum leaves the pennant. The first step in that projection is a push above $3,600 before a more meaningful test around $5,000. Once Ethereum is able to break above $5,000, then the door is open for new price highs. Related Reading: Why The Ethereum Price Could Bounce Above $3,500 Soon However, the breakout is expected to come with volatility and retests, not a straight line upward, but still resolves higher if the pennant thesis holds. From $5,000, the projection turns into a two-stage expansion. The first stage shows a force move, where Ethereum goes on a rally to as high as $6,000, then chops through another sharp dip to $4,000 and another recovery sequence before the larger leg higher. The larger leg, higher projected on the chart, points to $8,400 as the final price target zone for Ethereum. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|Bullish Pennant Pattern|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|ethusd|ETHUSDT|Merlijn The Trader|Upper Trendline",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57194165,
    "published": 1768505796000,
    "title": "After Coinbase Reversal Forces Delay on Crypto Bill, Is There a Path Forward?",
    "body": "Crypto industry leaders scrambled Thursday to salvage the market structure bill—but some conceded the bill now has lower chances of passage.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57194702,
    "published": 1768507554000,
    "title": "Lightning Strikes Twice as Solo Bitcoin Miners Beat the Odds, Each Earning $300K",
    "body": "Two solo Bitcoin miners struck rare wins this week, each earning nearly $300,000 as U.S. mining dominance continues to slip.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57194984,
    "published": 1768508456000,
    "title": "Bank of America CEO warns interest-bearing stablecoins could pull $6T from US banks",
    "body": "In an earnings call transcript shared on X, BofA CEO Brian Moynihan pointed to studies suggesting yield-bearing stablecoins could draw trillions from the banking system.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 57195309,
    "published": 1768509669000,
    "title": "DTCC aiming to make all 1.4 million securities in its custody digitally eligible",
    "body": "The company's Brian Steele suggests the industry giant aims to redefine the limits of tokenization in capital markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|DTCC|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57195299,
    "published": 1768509465000,
    "title": "Baidu's ERNIE 5 AI Model Rises Up the Rankings—A Math Wiz That Beats OpenAI's GPT 5.1",
    "body": "Baidu's ERNIE-5.0-0110 ranks #8 globally on LMArena, becoming the only Chinese model in the top 10 while outperforming GPT-5.1-High.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57195698,
    "published": 1768510859000,
    "title": "Bitcoin Breaks Free From The Current Range — $107,000 Now The Level To Watch",
    "body": "Bitcoin is starting to emerge from its consolidation phase, suggesting that a decisive move may be underway. After holding above the former resistance, the market is starting to show early signs of confidence returning. The spotlight now shifts to the $107,000 level, where the strength of this breakout will be truly tested. Holds Firm Despite A Weak Start To The Session Bitcoin Meraklsi, in a recent BTC market update, outlined a largely positive outlook despite the day beginning with some downside pressure. While early trading showed red across the board, the analyst emphasized that the broader structure remains healthy, with Bitcoin still trading comfortably above the $96,000 region. Related Reading: BTC Breaks Higher as Record Bitcoin ETF Inflows Trigger Wave of Bearish Liquidations A major technical development highlighted in the update is Bitcoin’s breakout above the long-watched $94,800 resistance level, which previously capped upside moves, and is now acting as support. So far, price action suggests that buyers are stepping in on pullbacks, reinforcing the strength of this level and reducing the risk of an immediate reversal. As long as BTC continues to hold above $94,800, the bullish roadmap remains unchanged. The next clear upside target sits at $107,300, a level that could mark the next phase of expansion if momentum continues to build. The analyst also addressed why altcoins have yet to respond meaningfully to Bitcoin’s strength. In the view, the wider market is still waiting for confirmation and confidence from BTC itself. That confidence is more likely to emerge once Bitcoin reaches the $107,300 region. At that point, improved sentiment and risk appetite could spill over into altcoins, setting the stage for a stronger, more synchronized market move. Bitcoin Tests The Upper Boundary Of A Long-Standing Range According to Crypto Candy, Bitcoin appears to be transitioning out of a prolonged consolidation phase after spending considerable time moving sideways. At the time of the post, price was challenging the upper boundary of the $94,000–$96,000 range, signaling a potential shift in market momentum as buyers attempt to regain control. Related Reading: Wall Street Analyst Is Still Bullish On Bitcoin, Predicts Price Recovery BTC is now trading above it, but it must continue to hold above the range, which serves as a crucial validation zone. Sustained strength above this area would confirm bullish intent and increase the probability of a continued advance, with the $107,000 region standing out as the next major upside objective in the weeks ahead. However, the setup is not without risk. If Bitcoin fails to maintain its position above $94,000, the current move could quickly lose traction and be labeled a false breakout. Such a development invites renewed selling pressure, potentially dragging the price back toward lower support zones as the market reassesses direction. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin Meraklsi|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|Crypto Candy",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57196219,
    "published": 1768512187000,
    "title": "West Virginia lawmaker introduces bill to allow state crypto investments",
    "body": "The legislation would allow the state‘s treasury to hold digital assets with a market capitalization of more than $750 billion, which applied only to Bitcoin as of January.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57196890,
    "published": 1768514417000,
    "title": "Zcash Surges Post-SEC Probe: Is a Fresh Yearly High on the Horizon?",
    "body": "Zcash (ZEC) is back on investors’ radar after U.S. regulators ended a long-running investigation into the Zcash Foundation without enforcement. The decision removes a key source of uncertainty that had followed the privacy-focused cryptocurrency since 2023. Related Reading: XRP Price Is Approaching A Key Decision Zone, But Structure Is Still Firmly Bullish Markets reacted quickly, with ZEC posting double-digit gains in some sessions and stabilizing above the $400 level. While regulatory clarity has helped improve sentiment, questions around governance and long-term development remain. ZEC's price trends sideways after a violent move upwards on the daily chart. Source: ZECUSD on Tradingview SEC Closes Two-Year Zcash Investigation The U.S. Securities and Exchange Commission confirmed it has concluded its review of the Zcash Foundation, which began with a subpoena issued on August 31, 2023. The inquiry focused on potential securities law concerns tied to Zcash’s funding model, governance structure, and token distribution. According to the foundation, the SEC does not intend to recommend enforcement action, fines, or operational changes. This outcome marks a notable shift for privacy-focused cryptocurrencies, which have often faced heightened regulatory scrutiny due to concerns about illicit use. The decision suggests that Zcash’s privacy features alone were not deemed sufficient grounds for action under existing securities laws. The closure also aligns with a broader trend of the SEC withdrawing from several high-profile crypto investigations in recent months under new leadership. For Zcash, the end of the probe removes a regulatory overhang that had weighed on investor confidence for nearly two years. Market Reaction and Price Projections Following the announcement, ZEC surged between 5% and 14% across major exchanges, briefly testing the $440–$450 resistance zone. Currently, the token is trading around $427–$442, holding above the $400 psychological support level. Technically, ZEC remains in a consolidation phase after falling from its January high near $535. Resistance is clustered around $450–$470, while support sits near $400, with a deeper floor around $350 if sentiment weakens. Some analysts point to a symmetrical triangle pattern on longer timeframes, often viewed as a continuation structure after strong rallies. A confirmed breakout above the upper trendline could open the door toward higher levels, including a potential retest of the $1,000 mark later in 2026. Governance Uncertainty Clouds the Outlook Despite the regulatory win, internal challenges persist. Earlier this month, the full development team at Electric Coin Company (ECC), which has led core Zcash development, resigned following a dispute with its nonprofit board. Former ECC leaders cited deteriorating working conditions and have since announced plans to launch a new privacy-focused wallet, cashZ, based on Zcash technology. Related Reading: Arthur Hayes Bets On MSTR, Metaplanet And Zcash As Bitcoin Liquidity Turns The Zcash Foundation has stated that network operations and protocol stability remain unaffected by the personnel changes. Still, the departures have raised concerns about governance stability, development continuity, and long-term coordination within the ecosystem. Cover image from ChatGPT, ZECUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Zcash Zec|ZCash|ZEC|ZEC Price|zecusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57196956,
    "published": 1768514432000,
    "title": "Brian Armstrong’s Crypto Bill Diatribe Was Only the Beginning",
    "body": "Emily Masonand Olga Kharif sum up just about everything the crypto industry disliked in a bill that was postponed by the Senate Banking Committee just before it was about to go to markup.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NMS:COIN",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57197561,
    "published": 1768516200000,
    "title": "Bitcoin rally collapses at $97K as funding rate stalls, retail traders sit out",
    "body": "Bitcoin failed to hold $97,000 as its funding rate stalled and retail traders watched from the sidelines. Will TradFi reignite the rally to $100,000?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57197854,
    "published": 1768517204000,
    "title": "Democrats Blast SEC Over Crypto Retreat, Justin Sun’s Alleged China Ties",
    "body": "House Democrats have accused the SEC of selectively enforcing laws against crypto firms, while spotlighting Tron founder Justin Sun.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57198107,
    "published": 1768518027000,
    "title": "Sui Restores Service After Major 6-Hour Outage Shook Network",
    "body": "Sui’s blockchain resumed normal activity after a network stall that halted transactions for roughly six hours on January 14, 2026. According to reports, validators identified the problem in the mid-afternoon and worked to roll out a fix that restored block creation and transaction processing later that evening. Related Reading: Bitcoin’s New Power Buyers: Companies Bought 3 Times What Miners Produced Outage Timeline And Recovery Based on reports, Sui’s team first flagged the issue at about 2:52 pm UTC when block production and checkpoint creation stopped. Validators applied changes and began bringing nodes back into sync. Service was reported as restored at about 8:44 pm UTC, a span of roughly five hours and 52 minutes from detection to recovery. During that interval, no new blocks were finalized and user activity stopped across wallets and decentralized apps. The Sui network is now back and fully operational. Transactions are flowing normally. If you are still seeing issues, please refresh your app or browser window. Thanks for your patience. We will share a full incident review in the coming days. Please check… — Sui (@SuiNetwork) January 14, 2026 Transactions Halted And Value Frozen The halt left a large amount of on-chain value inactive while the network was stalled. Reports indicate more than $1 billion in value was effectively frozen during the outage, though there were no signs of funds being stolen or altered. Users and apps that rely on the chain saw failed or queued transactions, and many dApps displayed errors until validators finished their updates. Cause, Response And Market Reaction Reports have disclosed that the problem was recorded as a consensus outage, meaning the mechanism used to agree on new blocks stopped finalizing. A full technical root-cause writeup has not yet been published. The Sui Foundation said an incident report will appear later with more detail. The SUI token showed modest movement during the event, trading around $1.80–$1.85 in the hours after the network came back, with a brief spike recorded on some exchanges as the news circulated. Past Interruptions And Context Sui launched mainnet in May 2023, and this outage follows previous incidents that raised similar questions about validator coordination and uptime. One earlier major disruption occurred in November 2024, which also involved issues around consensus and validator operation. Developers who build on Sui said many of their services experienced interrupted user flows while the chain was stalled. Related Reading: Russia Drafts Bill That Could Change Who Can Buy Crypto Questions About Network Reliability Some community members and outside observers have asked how often such consensus stalls can happen and what measures will reduce future occurrences. Validators and the Sui team said they were focused on patching the immediate bug and improving monitoring so problems are detected faster. Based on reports, the foundation plans to share specific steps for validators and node operators in the upcoming post-mortem. Sui’s team has said transactions are flowing again and advised users to refresh wallets or apps if they still see problems. The network’s operators have promised more transparency with a formal incident report, which will be watched closely by developers, exchanges, and investors who depend on the chain’s steady operation. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|altcoins|blockchain|crypto|DeFi|memecoins|SUI",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 96,
        "NAME": "SUI",
        "CATEGORY": "SUI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57199003,
    "published": 1768520756000,
    "title": "BitMine expects $400 million income on ether holdings, bet on MrBeast could '10x'",
    "body": "BitMine Chair Tom Lee told investors that the company could generate over $400 million income on its $13 billion worth of ether holdings, primarily via staking.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Bitmine|Ethereum Treasury|Digital Asset Treasury|Ethereum News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      }
    ]
  },
  {
    "id": 57199296,
    "published": 1768521608000,
    "title": "Dogecoin Price Is Following This Bullish Signal With A Major Target",
    "body": "Crypto analyst Trader Tardigrade has revealed that the Dogecoin price is following a bullish signal, which could lead to a rally above the $0.15 level. This comes as the crypto market rebounds, with Bitcoin rallying to a new yearly above $97,000. Dogecoin Price Eyes Rally Above $0.15 With This Bullish Signal In an X post, Trader Tardigrade hinted that the Dogecoin price could rally above $0.15 after rebounding from the Kumo support, which was exactly what the bullish signal flagged. The rebound comes amid the broader crypto market rally, with major crypto assets also recording significant gains as Bitcoin rallies above $97,000, with the psychological $100,000 level now in sight. Related Reading: Dogecoin Rapid Accumulation Suggests Sharp Upward Sweep Is Coming In another X post, Trader Tardigrade revealed that the Dogecoin price has formed a bull flag on the weekly chart and is now targeting the $0.195 price level. This will bring the leading meme coin close to the psychological $0.2 level, with a break above it paving the way for new local highs. Crypto analyst Crypto Tony highlighted the $0.154 level as being critical for the next leg up for the Dogecoin price. His accompanying chart showed that reclaiming this level would spark a rally above $0.16. One factor that could contribute to this bullish run for the foremost meme coin is renewed inflows into the Dogecoin ETFs. SoSoValue data shows that these Dogecoin ETFs still recorded zero flows on January 14 despite the rebound in the Dogecoin price. However, this could change soon, as these funds notably saw increased demand at the start of the year, when DOGE rallied to as high as $0.15, making it one of the best-performing crypto assets among the top 10 coins by market cap. What’s Next For DOGE As It Targets New Highs In an X post, crypto analyst Kevin Capital stated that a successful retest followed by a new local high will be further evidence that the corrective phase for the Dogecoin price has ended. This came as he noted that DOGE, like BTC and many other altcoins, has since come back and successfully tested its key 4-hour MAs after breaking out of them, attempting to end its major corrective phase. The analyst added that a new high would be a break of $0.157. Related Reading: Here’s Why The Bitcoin, Ethereum, And Dogecoin Prices Are Surging Today Meanwhile, crypto analyst Bitcoinsensus has suggested that the Dogecoin price could rally to as high as $4.5 if DOGE is repeating its macro cycle pattern. The analyst noted that so far this cycle, the meme coin has maintained its ground and has mainly been moving sideways. As such, it remains to be seen if this cycle can be as explosive as the last ones. At the time of writing, the Dogecoin price is trading at around $0.143, down in the last 24 hours, according to data from CoinMarketCap. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|altcoins|bitcoin|Bitcoinsensus|btc|CoinMarketCap|Crypto Tony|doge|DOGE news|Doge price|Dogecoin ETFs|Dogecoin news|dogecoin price|dogeusd|dogeusdt|Kevin Capital|SoSoValue|Trader Tardigrade",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57200057,
    "published": 1768523750000,
    "title": "Viral ‘Stranger Things’ AI Videos Raise New Concerns Over Deepfakes",
    "body": "Excerpts warn how the demos using Kling’s Motion Control AI spotlight new risks as full-body identity swaps flood social media.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57200501,
    "published": 1768525208000,
    "title": "Bitcoin Rally Accompanied By ‘Very Bullish’ Whale-Retail Behavior, Santiment Says",
    "body": "On-chain analytics firm Santiment has revealed how Bitcoin is currently in a bullish zone based on the behavior of whale and retail investors. Bitcoin Major & Retail Entities Have Shown Opposite Trajectories Recently In a new post on X, Santiment has talked about how Bitcoin investor behavior currently compares between the top and low ends. Sharks and whales make up for the former category, while retail investors represent the latter. Formally, the wallet ranges of the two sides of the market are defined as 10 to 10,000 BTC and less than 0.01 BTC. Below is the chart shared by Santiment that shows the trend in the Bitcoin supply held by each of these cohorts over the last few months. Related Reading: Bitcoin Fear & Greed Index Turns ‘Neutral’ For First Time Since October As is visible in the graph, the Bitcoin sharks and whales have seen their combined supply rise during the last few days, indicating that the large investors have been accumulating. Meanwhile, the retail investors have sold instead. This could imply that the big-money hands are backing the latest price rally, while small holders don’t believe the run will last, so they are exiting with their profits. If history is to go by, this may actually be a positive signal. According to the analytics firm, whale and retail behavior diverging in this manner puts the market in what it defines as the “Very Bullish” zone. “This is the ideal setup for a bull run,” noted Santiment. In the chart, the analytics firm has also highlighted four other zones for BTC based on the trajectories followed by the whale and retail supplies. “Very Bearish” (colored in red) follows the same contrarian logic as the Very Bullish region, with the zone appearing when large entities are selling, and retail is accumulating. Bearish (orange), Neutral (yellow), and Bullish (blue) map out the spectrum between the two extreme regions. Bitcoin’s latest venture into the green Very Bullish zone has come as sharks and whales have loaded up on 32,693 BTC (worth about $3.1 billion) since January 10th, corresponding to a supply increase of 0.24%. Retail investors have sold 149 BTC ($14.4 million) in this window instead, equivalent to a drop of 0.30%. Related Reading: Litecoin Whale Activity Spikes To 5-Week High: Reversal Or Continuation Signal? It now remains to be seen whether BTC will stay in this region for long or if another shift in investor behavior will take place. “How long it lasts depends on how long retail doubts the mini rally that has formed,” explains Santiment. BTC Price Bitcoin witnessed a break beyond the $97,000 level on Wednesday, but the bullish momentum has since cooled, with the BTC price returning to the $96,900 mark. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin rally|Bitcoin retail|Bitcoin whales|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57200566,
    "published": 1768525200000,
    "title": "Uniswap lands on OKX’s X Layer as exchange deepens DeFi strategy",
    "body": "The integration marks a key step in the crypto exchange's second-phase rollout, bringing Uniswap’s markets directly to its layer-2 network.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 53,
        "NAME": "UNI",
        "CATEGORY": "UNI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57200768,
    "published": 1768525767000,
    "title": "Kaito winds down crypto-backed ‘Yaps’ as X bans payments for ‘AI slop’",
    "body": "The Kaito.ai and Cookie DAO tokens fell over 15% after X’s ban, a move X’s head of product Nikita Bier said should improve user experience on the social media platform.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57201713,
    "published": 1768528766000,
    "title": "Nexo to pay $500K fine to California regulator over ‘risky loans’",
    "body": "California’s finance watchdog claims Nexo made nearly 5,500 loans to Californians without a valid license and did not properly assess their ability to repay.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57201622,
    "published": 1768528426000,
    "title": "Iran’s crypto ecosystem spikes to $7.8B amid mass protests: Chainalysis",
    "body": "Bitcoin has become an “element of resistance\" in Iran, providing liquidity in an increasingly restricted economic environment, says Chainalysis.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57202837,
    "published": 1768532447000,
    "title": "Keyrock Flags 12 Crypto Charts You Need To Watch This Year",
    "body": "Keyrock and Dune have published a “12 Charts to Watch in 2026” dashboard that tries to pin next year’s crypto narrative to measurable market structure, where liquidity is forming, where value is being returned, and which rails are quietly becoming systemically important. The report’s premise is straightforward: each chart pairs a live dataset with an explicit 2026 prediction. Taken together, the set reads like a checklist of whether crypto’s core primitives: trading, issuance, payments, and funding are becoming deeper and more institutional in their behavior. 12 Crypto Metrics To Watch This Year Keyrock puts prediction markets near the top of the stack after a 2025 run that saw weekly volume rise 9.2x to just under $5 billion, with Kalshi, Polymarket and Opinion controlling a combined 98.4% share at the time of writing. For 2026, it forecasts a 5x jump versus the 2025 run-rate to $25 billion in weekly volume, and a matching 5x rise in open interest as markets deepen and positions persist longer. Related Reading: Crypto Market Bill Draft Criticized For Allowing Continued Developer Prosecution On tokenization, the chart tracks non-stablecoin onchain RWA AUM, explicitly excluding stablecoins to isolate whether capital markets assets are moving onchain. Keyrock says non-stablecoin RWA AUM grew 3.4x in 2025 and projects more than 4x growth in 2026, led by tokenized cash-like products (T-bills and money market funds) and private credit, with early signs of equities and ETFs as market structure and regulation mature. A third adoption vector is x402, which Keyrock describes as an open payments protocol pioneered by Coinbase in 2025 to let software, including AI agents pay for digital services using stablecoins. Its measurable call: weekly x402 volume exceeding $100 million in 2026, framed as a proxy for “machine-native commerce” showing up in production. For onchain asset management, Keyrock tracks vault AUM across major providers and argues 2025 was about product maturity; 2026 is positioned as distribution. Its headline forecast is vault AUM tripling to $36 billion before year-end, alongside a prediction that at least one major broker-dealer offers an onchain vault “yield shelf.” Related Reading: New Hope For Crypto: Senators Introduce Blockchain Regulatory Certainty Act Derivatives are treated as the clearest stress test for depth. Keyrock highlights how the DEX-to-CEX futures trading ratio grew more than 3x in 2025, from 6.34% to 21%, and says open interest—not volume—is the key signal for whether venues can “hold risk in size” as new asset classes migrate onchain. The 2026 target: onchain perp OI exceeding $50 billion. Value return is monitored via buybacks. The report notes multi-million-dollar programs in 2025 from Hyperliquid, Raydium and Pump.fun, and predicts weekly buyback spend reaches at least 2x 2025 levels, plus a shift away from “fixed percentage of fees” models toward “value-aware” execution (pacing bands, triggers, disciplined accumulation). Solana MEV is framed as a distribution problem as much as a trading one. Keyrock notes tip-based MEV (validator + Jito tips) fell from a peak of 100,000 SOL (about $25 million at the time) to a low of 1,000 SOL (about $139,000), then points to the Block Assembly Marketplace (BAM) as the mechanism that could reshape where MEV is captured, away from reflexive tip spikes and toward explicit execution pricing set by apps and venues. Moreover, Keyrock uses “shielded ZEC” as a privacy proxy and forecasts shielded deposits rising from 4.9 million to more than 7 million by end-2026. On Ethereum, it tracks whether blobs develop a meaningful fee floor and predicts a median hourly blob cost of at least $0.05 per blob on a full-year basis. Payments show up in consumer form via crypto card spend, with the report forecasting a $500 million monthly spend print at least once in 2026. TradFi integration is tracked via spot BTC ETF AUM, with Keyrock projecting holdings surpass 2.5 million BTC in 2026 and net inflows positive in at least eight months. Finally, the stablecoin funding chart anchors on Aave’s USDC variable borrow APY on Ethereum, which it says ranged from 2.4% to 9.8% in 2025. The forward-looking claim is about rate stability rather than level: a drop in 30-day rolling volatility of USDC borrow APY to an average below 0.25 versus roughly 0.40 in 2025—positioned as a prerequisite for longer-duration, institution-style strategies. At press time, the total crypto market cap stood at $3.25 trillion. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto|Crypto Charts|crypto news|ethereum|Keyrock|Solana",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57202891,
    "published": 1768532513000,
    "title": "DeadLock ransomware hides using exploited Polygon smart contracts",
    "body": "Group-IB found a ransomware dubbed DeadLock that is exploiting Polygon smart contracts to rotate proxy addresses to evade takedowns.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 38,
        "NAME": "MATIC",
        "CATEGORY": "MATIC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57203281,
    "published": 1768533656000,
    "title": "Utah Man Gets Three Years for $2.9M Fraud Tied to Crypto Cash Scheme",
    "body": "The sentencing of a Utah man links investor fraud and unlicensed cash-to-crypto activity under the same prosecution.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 57204006,
    "published": 1768536039000,
    "title": "Bitcoin Bull Score Hits Level Seen Only 7 Times In 6 Years – A Rare Historical Signal",
    "body": "Bitcoin has shown renewed bullish momentum in recent sessions, pushing price back toward the $97,000 level after weeks of persistent selling pressure. For much of the recent consolidation, the market struggled under distribution from short-term participants and cautious positioning from traders who remained uncertain about the broader trend. That dynamic now appears to be shifting. While price action alone does not confirm a full trend reversal, the latest rebound suggests that downside pressure is easing and that buyers are becoming more willing to absorb available supply. Related Reading: Bitcoin Bulls Take Control: Futures Positioning Turns Bullish for First Time Since October This improvement in price behavior is supported by on-chain context rather than pure speculation. A quick insight from a CryptoQuant analyst highlights a rare development in market sentiment: the Bitcoin Bull Score Index has dropped to 20, a level that has historically appeared only a handful of times over the past several years. Such readings typically reflect deeply pessimistic conditions, when bullish signals across multiple indicators are scarce. Paradoxically, these environments often coincide with transitional phases rather than sustained declines. When bearish sentiment becomes widespread and measurable optimism disappears, markets tend to become increasingly sensitive to even modest improvements in demand. Bitcoin Bull Score Hits A Rare Historical Level Over the past six years, the Bitcoin Bull Score Index has fallen to levels of 20 or lower only seven times. The market is now experiencing the seventh occurrence, placing the current environment among the rarest sentiment regimes in Bitcoin’s history. This index aggregates multiple on-chain and market indicators to assess whether conditions favor bullish continuation or reflect broad-based weakness. Readings near 20 indicate that very few bullish signals are active at the same time, highlighting a market dominated by caution rather than optimism. Historically, such extremes have tended to appear during transitional phases. They often emerge late in corrections, when selling pressure has largely played out, but confidence has not yet returned. This does not guarantee an immediate reversal. However, it does suggest that downside momentum is becoming increasingly fragile, as most participants who wanted to de-risk have already done so. The timing of this signal is particularly relevant as Bitcoin approaches a critical psychological zone near $100,000. This level represents both a major round-number resistance and a key reference point for short-term and long-term holders. The coming weeks will be decisive. A sustained push toward and above $100K, accompanied by improving breadth in on-chain indicators, would likely mark a shift away from defensive positioning. Conversely, failure at this level could reinforce consolidation and prolong uncertainty. Related Reading: OG Bitcoin Selling Slows Sharply: Long-Dormant Coins Go Quiet Weekly Chart Shows Recovery Attempt Below Resistance Bitcoin’s weekly chart shows a market attempting to reassert strength after a prolonged corrective phase, with price now trading around the $96,000–$97,000 zone. This area is technically important, as it aligns with a former consolidation range that acted as support during mid-2025 and later flipped into resistance after the November breakdown. The recent rebound suggests buyers are willing to defend higher lows, but confirmation remains incomplete. From a trend perspective, Bitcoin is still trading below the declining 50-week moving average, which currently caps upside attempts. This level has acted as dynamic resistance during previous bear-to-neutral transitions. And will be a critical area to reclaim for trend continuation. Below the price, the 100-week moving average continues to slope upward and has provided structural support during the recent pullbacks. Reinforcing the idea that the broader market structure remains intact despite short-term weakness. Related Reading: Bitcoin Short-Term Holders Near A Profit Flip: A Key Level Comes Into Focus Volume behavior is also notable. The rebound toward $97,000 occurred without a major expansion in volume, revealing that the move may still lack strong conviction. This supports the view that the current advance could be a recovery leg within a larger consolidation rather than the start of an impulse. If Bitcoin can consolidate above $95,000 and eventually reclaim the 50-week moving average, the probability of a continuation toward the $105,000–$110,000 region increases. Failure to hold this zone would expose the market to renewed downside tests toward the mid-$80,000s. Keeping the broader consolidation unresolved. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|Bitcoin Bull Score|Bitcoin Bull Score Index|Bitcoin Indicator|Bitcoin news|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57204581,
    "published": 1768537552000,
    "title": "Crypto sentiment drops amid unease over US market structure bill",
    "body": "The Crypto Fear & Greed Index slipped by 12 points to “neutral” on Friday amid heightened anxiety over the future of a long-awaited crypto bill in the US.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57204366,
    "published": 1768537107000,
    "title": "XRP Price Loses Most Gains, Next Support Now in the Crosshairs",
    "body": "XRP price extended losses and traded below $2.10. The price is now consolidating and might decline further if it trades below $2.020. XRP price started a fresh decline below the $2.120 zone. The price is now trading below $2.10 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance at $2.0850 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move down if it stays below $2.10. XRP Price Dips Again XRP price failed to stay above $2.150 and started a fresh decline, like Bitcoin and Ethereum . The price declined below $2.120 and $2.10 to enter a short-term bearish zone. The price even spiked below $2.080. A low was formed at $2.052, and the price is now consolidating losses. There was an attempt to clear $2.080 and the 23.6% Fib retracement level of the downward move from the $2.193 swing high to the $2.052 low, but the bears remained active. There is also a key bearish trend line forming with resistance at $2.0850 on the hourly chart of the XRP/USD pair. The price is now trading below $2.10 and the 100-hourly Simple Moving Average. If there is a fresh upward move, the price might face resistance near the $2.0850 level and the trend line. The first major resistance is near the $2.120 level. It is close to 50% Fib retracement level of the downward move from the $2.193 swing high to the $2.052 low. A close above $2.120 could send the price to $2.1395. The next hurdle sits at $2.20. A clear move above the $2.20 resistance might send the price toward the $2.250 resistance. Any more gains might send the price toward the $2.320 resistance. The next major hurdle for the bulls might be near $2.350. More Losses? If XRP fails to clear the $2.120 resistance zone, it could start a fresh decline. Initial support on the downside is near the $2.050 level. The next major support is near the $2.020 level. If there is a downside break and a close below the $2.020 level, the price might continue to decline toward $1.950. The next major support sits near the $1.920 zone, below which the price could continue lower toward $1.880. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $2.050 and $2.020. Major Resistance Levels – $2.0850 and $2.120.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57205252,
    "published": 1768539669000,
    "title": "California Fines Crypto Wealth Platform Nexo $500K Over 'Unlicensed' Loans",
    "body": "Nexo faces fresh headwinds as California regulators take action against the digital assets platform for the second time in three years.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57205197,
    "published": 1768539653000,
    "title": "Ethereum Staking Hits Record Levels As Buterin Urges Builders To Deliver Real Apps",
    "body": "According to ValidatorQueue data, staked Ethereum has climbed to close to 36 million, equal to nearly 30% of the circulating supply. That figure now represents more than $119 billion at current prices. Staking rose from 35.5 million to almost 36 million since early January, even though ETH has fallen more than 30% since August. Related Reading: Futures Frenzy Pushed Crypto Exchange Volume To Nearly $80 Trillion In 2025 The unstaking queue is zero, while the staking queue topped 2.5 million ETH — its highest level since August 2023. Based on reports, those moves point to strong long-term bets on the network. Ethereum Staking Shows Strong Conviction Institutional interest helped push the numbers higher. Publicly listed Digital Asset Treasuries and big staking services are said to be among the active participants. Some of the latest increases came during a stretch that had been mostly flat since last August. Market watchers say that rising stakes add to the protocol’s security profile, and the large queue suggests demand for on-chain commitments remains high even with price weakness. Buterin Says Infrastructure Is Ready Meanwhile, reports have disclosed that Ethereum’s founder, Vitalik Buterin, has urged builders to stop experimenting only in theory and start shipping real products. He has argued that the technical pieces are finally functional: the chain runs on proof of stake, transaction costs are lower, and scaling through ZK-EVMs and Layer 2s is working. Messaging that began with Whisper has been adapted into Waku, and apps such as Status and Railway were cited as examples that already use these systems. In 2014, there was a vision: you can have permissionless, decentralized applications that could support finance, social media, ride sharing, governing organizations, crowdfunding, potentially create an entire alternative web, all on the backs of a suite of technologies.… pic.twitter.com/ihU9qOrXfG — vitalik.eth (@VitalikButerin) January 14, 2026 He used the term “walkaway test” to describe a simple check: if a decentralized app’s operator disappears, can the data and functionality remain available to users? Fileverse, a decentralized document editor, was pointed to as a case where documents would survive even if the team behind it vanished. Builders Urged To Ship Practical Apps Buterin also criticized the trend toward overly centralized consumer devices and services that lock users into accounts and subscriptions. He warned against appliances that require registration and that may collect data on routine tasks. He contrasted those products with tools that a person truly owns and controls. The message was clear: now that infrastructure is in place, developers should focus on practical software people will actually use, not just experiments that live on testnets. What This Means Going Forward The split between the technical optimism and the market reality is visible. On one side, nearly 36 million ETH staked and a swollen staking queue show investor conviction in the protocol’s future. Related Reading: Bitcoin’s New Power Buyers: Companies Bought 3 Times What Miners Produced On the other, price pressure since August has been real and is still being felt. Reports emphasize that the climb in staked ETH strengthens the network’s security, but the call to build usable, user-friendly apps remains loud. If developers respond by shipping useful products that meet everyday needs, the combination of a secure chain and working applications could push broader adoption. For now, the numbers and the rhetoric are both sending a clear signal: the ingredients exist, and attention is shifting toward turning them into tools people rely on. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|bitcoin|crypto|ETH|ethereum|ethusd|Staking|Vitalik Buterin",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57205112,
    "published": 1768539221000,
    "title": "Ethereum activity doubles with influx of new users: Glassnode",
    "body": "Ethereum saw activity retention nearly double to 8 million addresses in a month while daily transactions hit an all-time high of 2.8 million amid soaring stablecoin use.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57205364,
    "published": 1768540137000,
    "title": "Solana (SOL) Slips Back to Support, Setting Up a High-Tension Test",
    "body": "Solana failed to stay above $146 and corrected gains. SOL price is now trading below $145 and might find bids near the $140 zone. SOL price started a downside correction below $145 against the US Dollar. The price is now trading below $145 and the 100-hourly simple moving average. There is a bullish trend line forming with support at $141 on the hourly chart of the SOL/USD pair (data source from Kraken). The pair could extend losses if it dips below the $140 zone. Solana Price Starts Downside Correction Solana price failed to surpass $150 and started a downside correction, like Bitcoin and Ethereum . SOL dipped below $146 and $145 to enter a short-term bearish zone. There was a move below the 61.8% Fib retracement level of the upward wave from the $138 swing low to the $149 high. However, the bulls are active above $140. Besides, there is a bullish trend line forming with support at $141 on the hourly chart of the SOL/USD pair. Solana is now trading below $145 and the 100-hourly simple moving average. On the upside, the price is facing resistance near the $144 level. The next major resistance is near the $146 level. The main resistance could be $148. A successful close above the $148 resistance zone could set the pace for another steady increase. The next key resistance is $155. Any more gains might send the price toward the $162 level. More Losses In SOL? If SOL fails to rise above the $146 resistance, it could start another decline. Initial support on the downside is near the $141 zone and the trend line. The first major support is near the $140 level and the 76.4% Fib retracement level of the upward wave from the $138 swing low to the $149 high. A break below the $140 level might send the price toward the $132 support zone. If there is a close below the $132 support, the price could decline toward the $124 support in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is gaining pace in the bearish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is below the 50 level. Major Support Levels – $141 and $140. Major Resistance Levels – $146 and $148.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Technical analysis|Sol|Solana|solbtc|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57205815,
    "published": 1768541125000,
    "title": "Crypto plumbing, policy improved in 2025, but prices ‘did not cooperate’: Binance",
    "body": "Regulated investment vehicles such as exchange-traded funds expanded in 2025, and corporations added crypto to their balance sheets, opening up more pathways for user access.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57206638,
    "published": 1768543476000,
    "title": "State Street rolls out new crypto tokenization tools",
    "body": "State Street said its new crypto platform would help clients build tokenized money market funds, exchange-traded funds, and products such as tokenized deposits and stablecoins.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57206835,
    "published": 1768544065000,
    "title": "US housebuilder to launch crypto rewards after SEC ‘no-action’ letter",
    "body": "Megatel Homes says it’s launching a program where renters could receive rewards for paying their rent using a crypto token.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57208554,
    "published": 1768549665000,
    "title": "CME Group to offer cardano, chainlink, stellar futures as institutions seek regulated risk-management tools",
    "body": "The new futures contracts, available in micro and standard sizes, are set to launch on Feb. 9, pending regulatory approval.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57208821,
    "published": 1768550446000,
    "title": "CME Group To Launch Cardano, Chainlink, Stellar Futures Amid Crypto Lineup Expansion – Details",
    "body": "Leading derivatives exchange CME plans to add futures contracts tied to Cardano (ADA), Chainlink (LINK), and Stellar (XLM) to continue growing its roster of regulated crypto derivatives. Related Reading: Analyst Says It’s Time For Ethereum’s ‘Big Test’ – Is ETH Season Loading? CME Adds New Altcoins To Crypto Derivatives Lineup On Thursday, Chicago-based derivatives exchange CME Group announced a new expansion of its lineup of regulated crypto derivatives with the upcoming inclusion of Cardano, Chainlink, and Stellar futures. According to the announcement, the new crypto additions are expected to launch on February 9, 2026, although they are still pending regulatory review. In addition, they will offer both micro-sized and larger-sized contracts for the three cryptocurrencies. For the standard Cardano futures, the contract will cover 100,000 ADA, while the micro-sized ADA futures will consist of 10,000 tokens. In addition, the Chainlink and Stellar’s large-sized futures will be set at 5,000 LINK and 250,000 XLM, respectively, while the small-sized contracts will cover 250 LINK and 12,500 XLM. The upcoming Cardano, Chainlink, and Stellar futures contracts build on the derivatives exchange’s existing crypto suite, which includes four of the largest cryptocurrencies by market capitalization. In 2017, CME first launched Bitcoin (BTC) futures, followed by the introduction of Ethereum (ETH) futures in 2021. In the first half of 2025, the Chicago-based exchange added Solana (SOL) and XRP futures to its lineup, introducing options for both cryptocurrencies later in the year. Giovanni Vicioso, CME Group Global Head of Cryptocurrency Products, highlighted the industry’s expansion and development over the past few years, affirming that “given crypto’s record growth over the last year, clients are looking for trusted, regulated products to manage price risk as well as additional tools to gain exposure to this dynamic market.” “With these new micro- and larger-size Cardano, Chainlink and Stellar futures contracts, market participants will now have greater choice with enhanced flexibility and more capital-efficiencies,” he added. Cardano, Chainlink, Stellar Price Reaction Despite the positive development, the trajectory of ADA, LINK, and XLM remained mostly unchanged, with the three altcoins continuing their intraday correction. Chainlink and Stellar both saw 4% declines from their Thursday highs, falling to the $13.60 and $0.225 levels. LINK has momentarily lost the $13.80 level as support and is attempting to hold the current area to prevent further bleeding. Similarly, XLM was also rejected from the Wednesday highs and bounced from the $0.230 before continuing its descent toward its two-day low. Related Reading: Bitcoin Nears ‘Historic’ Technical Test As Price Eyes $93,500 Barrier – What’s Next? Meanwhile, ADA was attempting to reclaim the $0.41 area ahead of the announcement, briefly bouncing from the recent pullback. Notably, Cardano surged over 10% from the recent lows toward the crucial $0.42-$0.43 area. However, the altcoin was rejected from this zone on Wednesday, retracing nearly 9% from the local highs to retest the $0.40 level. On Thursday morning, the cryptocurrency bounced from this area, but ultimately resumed its correction as the day progressed. As a result, Cardano has retraced most of this week’s gains, currently trading around the $0.391 mark. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|ADA|ADAUSDT|Cardano|Cardano CME futures|Cardano futures|Cardano price|chainlink|Chainlink CME futures|CME futures|Link|Stellar CME Futures|Stellar Lumen|XLM",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 56,
        "NAME": "XLM",
        "CATEGORY": "XLM"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57209996,
    "published": 1768554038000,
    "title": "Altcoin Rallies Are Getting Shorter, And Wintermute Has The Data",
    "body": "According to Wintermute’s 2025 Digital Asset OTC Markets report, altcoin rallies last year were much shorter than traders expected, averaging about 19–20 days. That is a steep drop from the roughly 60-day runs seen in 2024. Market flows tightened, and many smaller tokens saw gains vanish faster than before. The result: capital moved back into the big names — Bitcoin and Ethereum — where liquidity is deeper. Related Reading: Bitcoin’s New Power Buyers: Companies Bought 3 Times What Miners Produced Altcoin Open Interest Drops Based on reports, one key trigger was a sharp deleveraging on October 10, 2025, which pushed retail traders to reduce risk and rotate out of smaller tokens. Open interest in many altcoin futures contracts fell, with some coverage noting about a 55% decline in altcoin futures open interest since October. Trading desks said lower liquidity made it harder for rallies to keep going beyond a few weeks, turning what used to be multi-month moves into short bursts. Major Coins Reclaimed Center Stage Institutional flows and product structures played a role. Reports have disclosed that ETFs and other institutional channels helped funnel funds toward Bitcoin and Ethereum. As a result, the market’s attention narrowed. Where narratives once pushed dozens of tokens into rallies, more capital was now concentrated in the top tier. Traders say they preferred assets where orders could be filled without dramatically moving the price. Short, Intense Moves Replaced Long Trends Wintermute’s analysis points to a change in how momentum forms. Rally drivers became more tactical and less about broad, lasting narratives. In practice, that meant memecoin pumps and exchange-themed rallies burned out quickly. Some traders described these moves as hair-trigger events: quick upswings followed by equally rapid retracements. Liquidity bands tightened and stops were hit sooner than in past cycles. What Traders And Firms Are Watching Market participants say the path to a sustained altcoin season now requires a few things aligning. Reports indicate renewed retail interest, clearer institutional support for smaller tokens, and calmer macro markets could help. Otherwise, rallies are likely to remain short. Execution desks reported that when big buyers reappeared for a token, it could run fast, but keeping that momentum proved difficult without deeper market participation. Related Reading: Futures Frenzy Pushed Crypto Exchange Volume To Nearly $80 Trillion In 2025 Outlook For 2026 Based on the report and market commentary, a broader crypto rebound in 2026 depends on several moving parts: interest from institutions, shifts in macro rates, and retail returning to risk-on strategies. If those elements arrive, rallies might last longer than the 19–20 day average seen in 2025. If not, traders say the pattern of quick, sharp moves into the majors will continue. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|altcoin|bitcoin|crypto|DeFi|ethereum|Stablecoins|Wintermute",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57210281,
    "published": 1768554606000,
    "title": "KBC Bank to launch Bitcoin and Ether trading in Belgium under MiCA",
    "body": "Belgian bank KBC will launch bitcoin and ether trading for retail investors via its Bolero platform as Belgium’s MiCA regime comes into force.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57211170,
    "published": 1768557612000,
    "title": "Bitcoin Tailwind: Cathie Wood Sees ‘Reaganomics On Steroids’ Ahead",
    "body": "Cathie Wood is arguing that the next phase of US policy and macro could recreate an early-1980s style risk-on regime, one that, in her telling, strengthens the case for bitcoin as a portfolio diversifier even as it complicates the “digital gold” narrative. In a post on X, the ARK Invest CEO said “the next three years could be Reaganomics on steroids,” pointing to deregulation, tax cuts, “sound monetary policy,” and “peace through strength” as ingredients for a stronger dollar and capped gold prices. Her January 15 “New Year letter,” titled Cathie Wood’s 2026 Outlook: The US Economy Is A Coiled Spring, lays out the mechanics behind that analogy and places crypto explicitly inside the policy and productivity story. A “Coiled Spring” Macro Thesis Wood’s central claim is that the US has looked sturdier than it really is because weakness has rotated through rate-sensitive pockets rather than hitting the whole economy at once. “Despite sustained real gross domestic product (GDP) growth during the past three years, the underlying US economy has suffered a rolling recession and has evolved into a coiled spring that could bounce back powerfully during the next few years. In response to COVID-related supply shocks, the record-breaking 22-fold surge in the Fed funds rate from 0.25% in March 2022 to 5.5% in the sixteen months ended July 2023 pushed housing, manufacturing, non-AI capital spending, and low-to-middle income America into recession.” Related Reading: Bitcoin Rally Accompanied By ‘Very Bullish’ Whale-Retail Behavior, Santiment Says She anchors the housing leg with a specific trough: existing home sales fell 40% from a 5.9 million annual rate in January 2021 to 3.5 million in October 2023, which she notes is “a level last seen in November 2010.” From there, Wood pivots to policy impulse and cash-flow relief. “Thanks to the confluence of deregulation and lower taxes (including tariffs), inflation, and interest rates, the rolling recession which has characterized the last few years in the US could turn quickly and sharply during the next year and beyond. Deregulation is unleashing innovation in every sector, led by the first AI and Crypto Czar, David Sacks, in the AI and digital assets space. Meanwhile, lower taxes on tips, overtime, and social security should hand US consumers significant refunds this quarter, potentially driving real disposable income growth up from ~2% at an annual rate during the second half of 2025 to ~8.3% this quarter.” She also argues corporate cash flows could be boosted by accelerated depreciation, writing that it could push the effective corporate tax rate “down toward 10%,” with 100% first-year depreciation for equipment, software and domestic R&D made permanent and retroactive to January 1, 2025. Gold, Bitcoin, And The Dollar Wood’s inflation case is concrete and component-driven. She points to oil falling from about $124 on March 8, 2022 to a level that’s roughly 53% lower, and down about 22% year-over-year as of ARK’s January 12 data cut. She adds that single-family home sale prices are down about 15% from the October 2022 peak, while existing home price inflation (three-month moving average) decelerated from roughly 24% YoY in June 2021 to about 1.3%. On labor, she cites non-farm productivity up 1.9% YoY (third quarter), compensation per man-hour up 3.2%, and unit labor cost inflation at 1.2%. She then pushes a real-time check: Truflation at 1.7% YoY as of January 7, nearly 100 bps below CPI-based inflation. The crypto hook comes through her attempt to split gold’s recent run from bitcoin’s role in portfolios. “During 2025, the gold price appreciated 65% as the price of bitcoin slipped 6%. While many observers have attributed the 166% surge in the gold price from $1,600 to $4,300 since the end of the US equity bear market in October 2022 to the risk of inflation, another interpretation is that global wealth creation… has outpaced the ~1.8% annualized increase in the gold supply globally.” Related Reading: Glassnode: Bitcoin Is Back At $96K, Hitting The Same Sell Ceiling Again Wood then leans on supply schedules and correlations. She notes bitcoin’s supply is “mathematically metered” to rise about 0.82% per year for the next two years before slowing to ~0.41%, and argues that diversification — not “digital gold” rhetoric — is the cleaner allocator lens. In ARK’s correlation matrix using weekly returns from 1/1/2020 through 1/6/2026, bitcoin’s correlation is 0.14 to gold, 0.06 to bonds, and 0.28 to the S&P 500; the S&P 500–bonds correlation is shown at 0.27. Finally, she brings it back to FX: after a year in which the trade-weighted dollar (DXY) fell 11% in the first half and 9% for the full year, Wood argues that higher US returns on invested capital, driven by fiscal, deregulation, and US-led technological breakthroughs, could push the dollar higher, echoing the early Reagan period when “the dollar nearly doubled.” If Wood’s “Reaganomics on steroids” framing gains traction, the near-term market implication is less about a single bitcoin price target and more about positioning: a regime she expects to feature falling inflation, lower rates, and heavy AI capex (data-center systems investment up 47% to nearly $500 billion in 2025, with a further 20% to roughly $600 billion expected in 2026) is one where allocators may revisit where bitcoin sits on the risk spectrum, and whether its low cross-asset correlation is the more durable thesis than any one-line comparison to gold. While Wood’s 2026 outlook does not publish a specific Bitcoin price target, ARK has previously outlined 2030 scenarios for BTC of roughly $300,000 (bear), $710,000 (base), and $1.2 million (bull). At press time, BTC traded at $95,685. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|ark invest|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|Cathie Wood",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57211089,
    "published": 1768557251000,
    "title": "Polygon trims workforce amid $250M stablecoin payments pivot",
    "body": "The restructuring comes as the company integrates new payments assets and narrows its mandate, with several employees saying on X that they were affected by the layoffs.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 38,
        "NAME": "MATIC",
        "CATEGORY": "MATIC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57211730,
    "published": 1768559288000,
    "title": "Bitcoin traders predict ‘strong run-up’ as classic chart targets $113K",
    "body": "The recovery could continue as long as Bitcoin achieved a daily close above $98,000, with the technical setup projecting 18% gains ahead.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57211959,
    "published": 1768560100000,
    "title": "Southern Utah man sentenced to 3 years in prison for crypto-linked wire fraud scheme",
    "body": "Federal prosecutors said Brian Garry Sewell defrauded investors of nearly $3 million and ran an unlicensed cash-to-crypto business that moved more than $5 million.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Crypto Fraud|United States|US|Crime|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 57211951,
    "published": 1768559940000,
    "title": "Crypto exchanges face ban in South Korea as Google Play updates rules",
    "body": "Google will require proof of FIU registration acceptance for crypto apps, raising compliance hurdles for offshore exchanges serving South Korean users.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57212297,
    "published": 1768561247000,
    "title": "Ethereum On Fire: User Growth Sparks Massive Activity Spike",
    "body": "Ethereum’s on-chain activity has jumped sharply, driven by a wave of first-time users and heavier transaction flow across the network. According to Glassnode, new activity retention roughly doubled this month — rising from about 4 million to around 8 million addresses — a move that points to a fresh cohort of wallets interacting with Ethereum rather than just repeat users. Related Reading: Bitcoin’s New Power Buyers: Companies Bought 3 Times What Miners Produced Surge In New Users Daily transactions hit a record high of 2.8 million on Thursday, a figure that is up 125% from the same period last year. Based on reports from Etherscan, active addresses have more than doubled year-over-year, moving from roughly 410,000 accounts to over 1 million as of Jan. 15. Those numbers suggest real, broad-based engagement is increasing, not merely short-lived spikes. Ethereum’s Month-over-Month Activity Retention shows a sharp spike in the “New” cohort, indicating a surge in first-time interacting addresses over the past 30 days. This reflects a notable influx of new wallets engaging with the Ethereum network, rather than activity being… pic.twitter.com/h8Zw7hXOSX — glassnode (@glassnode) January 15, 2026 Transaction Boom And L2 Effects Observers link the transaction growth in part to rising stablecoin activity and lower fees. Reports have disclosed that many transfers are migrating execution to Layer 2 networks while settlement stays on Ethereum’s main chain, which keeps finality secure and helps push down gas costs. Staking has also climbed, reaching nearly 36 million ETH, adding another layer to the network’s tightening supply dynamics. At the same time, market behavior remains careful. Strength in US equities has helped stabilize crypto prices, yet money flowing into Ethereum looks selective rather than broad. It seems that positioning is rather conservative; traders prefer waiting for more accurate signals regarding ETH prices instead of attempting to predict a breakout. In turn, ETH is consolidating around a correction, but there is not enough momentum-driven buying. Analyst Views & Price Movement There were also those who cited optimism based on improvements to on-chain fundamentals. For instance, LVRG Research reported that the increasing number of transactions and staking activities encouraged a positive network. Some traders argue the compression in price action could precede a breakout. Ether traded near a two-month high of $3,400 on Wednesday and was around $3,300 in early trading on Friday, reflecting the tug of war between renewed demand and persistent caution. Despite the stronger metrics, technical hurdles remain. Reports and recent analysis suggest the market is in a repair phase, not a confirmed uptrend. Overhead supply still constrains sustained advances, and many market participants want to see ETH reclaim key long-term resistance levels, such as the 200-day EMA, before committing large-scale capital. That explains why short-term traders operate inside a defined range while longer-term players hold back. Related Reading: Ethereum Staking Hits Record Levels As Buterin Urges Builders To Deliver Real Apps What This Means For Traders And Investors Network health has improved materially — more users, more transactions, and higher staking — but price action has not yet matched those gains. Based on the data presented, cautious optimism is reasonable. Traders may find chance to trade the range, while investors looking for conviction should wait for cleaner technical confirmation before assuming a sustained rally. Featured image from Blockzeit/EthBurn, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|altcoin|bitcoin|crypto|ETH|Ether|ethereum",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57212232,
    "published": 1768554273000,
    "title": "Jefferies’ Wood Drops Bitcoin on Threat From Quantum Computing",
    "body": "The once-distant threat of quantum computing has prompted one of the most closely followed market strategists to walk away from Bitcoin, underscoring how doubts over the token’s security are creeping into mainstream portfolio thinking.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57212440,
    "published": 1768561602000,
    "title": "Book Publishers Seek Entry Into Google AI Copyright Fight",
    "body": "Hachette and Cengage allege Google bypassed licensing to train Gemini, calling it “historic copyright infringement.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57212905,
    "published": 1768563057000,
    "title": "Belarus creates legal framework for ‘cryptobanks’ in new presidential decree",
    "body": "The new rules allow banks to combine token activity with payments and financial services under central bank and tech park oversight.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 57213997,
    "published": 1768566631000,
    "title": "Dogecoin Flirts With An Inverse Head And Shoulders: $0.15 Break Is The Trigger",
    "body": "Dogecoin (DOGE) is trying to base on higher timeframes as Cantonese Cat points to a potential inverse head-and-shoulders on the daily, with price compressing just beneath a defined resistance shelf while holding a nearby demand zone. Dogecoin Breakout Could Target $0.19 In a daily chart (DOGE/USD, Binance) shared via X on Jan. 16, Cantonese Cat overlays an inverse head-and-shoulders schematic: a left shoulder in early December, a deeper “head” into late December near the mid-$0.11s, and a developing right shoulder as price rotates lower after the early-January spike. The key feature on that daily view is a highlighted “Buy order block” spanning roughly $0.1250 to $0.1350. Price is shown pulling back toward the top of that block after failing to hold the most recent push higher, which places the current trade location in a classic “right shoulder” area if the pattern is going to remain constructive. Above the current spot price, the chart marks a horizontal grey resistance (“the shoulder”) band at roughly $0.149–$0.152. This is the area DOGE needs to reclaim for the inverse H&S thesis to transition from “forming” to “triggering,” because it has acted as supply on recent tests. Related Reading: Dogecoin Price Is Following This Bullish Signal With A Major Target Using Cantonese Cat’s daily inverse head-and-shoulders chart, the measured move is the neckline minus the head low, projected upward from the neckline: the neckline is the grey supply band centered near $0.151 (label on the axis), while the head prints at roughly $0.116. That gives a height of about $0.035, implying a pattern target near $0.186. Notably, that objective runs directly into the chart’s overhead red supply zone, which begins around $0.175 and extends up toward $0.19, making that area the first obvious region where a confirmed breakout would be expected to meet meaningful resistance. DOGE 2-Day Bollinger Bands Signal Momentum Notably, the Bollinger Bands on the 2-day chart support the mid-term bullish thesis. On Tuesday, Cantonese Cat highlighted that DOGE is trading above the Bollinger basis around $0.1343, while the upper band is near $0.1526 and the lower band near $0.1160. Cantonese Cat summarized the idea succinctly: “Price wanting to hang out at the top part of the Bollinger band? We have a chance here?” In practice, the “top part” framing matters because it’s a momentum tell. After an extended decline, sustained closes above the basis and into the upper half of the bands can signal that sellers are no longer controlling the volatility profile, even before price clears the obvious horizontal resistance. Related Reading: Dogecoin Bulls Don’t Celebrate Too Early: This Level Still Must Fall That said, the 2D view also makes the immediate problem clear: the upper band sits close to the same zone highlighted on the daily as resistance. In other words, the bullish thesis is not just “hold support,” but “prove it” with acceptance above the $0.15–$0.152 region. If DOGE continues to defend the $0.1250–$0.1350 buy-side block and reclaims the $0.149–$0.152 supply band, the inverse head-and-shoulders thesis gains credibility. The next areas the chart itself flags are the higher supply zones around $0.175 and the upper-$0.18s region, where prior selling pressure was visible. If price loses the buy order block, the pattern read weakens materially. In that case, the Bollinger structure on the 2D chart points attention back toward the lower band region near $0.1160 and the late-December lows. At press time, DOGE traded at $0.139. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|doge|DOGE news|Doge price|Dogecoin|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57214173,
    "published": 1768566903000,
    "title": "Jefferies’ ‘Greed & Fear’ strategist cuts Bitcoin allocation to zero on quantum risk",
    "body": "Jefferies’ Greed & Fear strategist Christopher Wood has slashed a 10% Bitcoin allocation from his portfolio and moved into gold, citing the quantum risk to BTC, Bloomberg reports.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57214632,
    "published": 1768568400000,
    "title": "Trump moves on the Fed, Italy warns ‘fin-fluencers’: Global Express",
    "body": "US President Donald Trump is bringing criminal charges against the head of the Fed in what many see as a political move motivated by a desire for lower interest rates.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 57214473,
    "published": 1768568039000,
    "title": "Jefferies strategist Christopher Wood swaps bitcoin for gold on quantum computing concern",
    "body": "Christopher Wood, Jefferies' global head of equity strategy, swapped a 10% bitcoin allocation with gold on concern quantum computing could weaken bitcoin’s security case.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|quantum computing|Investing|Jefferies|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57215754,
    "published": 1768572057000,
    "title": "Crypto Chill: Sentiment Drops As US Lawmakers Stir Market Fears",
    "body": "The market mood in crypto cooled sharply after a quick spike in optimism. According to the Crypto Fear & Greed Index, the reading fell by 12 points on Friday, dropping from 61 to 49. Related Reading: Altcoin Rallies Are Getting Shorter, And Wintermute Has The Data That swing moved the gauge from “greed” into a “neutral” zone in a single session. Bitcoin had jumped about 4.5% earlier in the week to roughly $97,700, which helped push sentiment higher, but the focus shifted toward politics and lawmaking in Washington. Regulatory Concerns Shake Markets Based on reports, the main trigger was debate over a Senate version of a long-awaited crypto market structure bill. The measure would set out how US regulators oversee digital assets and includes language that would tighten rules around stablecoin yields. Several lobbyists and executives raised alarms about those provisions. Brian Armstrong, the CEO of Coinbase, withdrew his backing, saying the proposal would be worse than the current setup and that a bad law would be harmful. After the backlash, the Senate Banking Committee cancelled its planned markup and the Senate Agriculture Committee moved its session to late January while lawmakers seek more support. Social Media Sentiment Shifts As Traders React According to crypto analytics firm Santiment, the market activity had two different trends at once: larger holders were building positions while smaller, retail traders were selling. Social chatter began to reflect worry after the regulatory news, even as on-chain data showed accumulation by more experienced wallets. The index’s peak earlier in the week was the highest since it reached 64 on October 10, the same day a market crash triggered over $19 billion in liquidations. Those past losses still hang in investors’ memories. Smart Money Buys While Retail Sells Reports have disclosed that smart money accumulation can support prices, but headlines shape short-term moods. Bitcoin was trading at about $95,642 at the time of publication, down around 0.02% over the past 24 hours, according to CoinGecko. That small move shows market resilience, yet the sentiment measure’s drop demonstrates how fragile confidence can be when policy doubts emerge. Many traders watch Washington closely, sometimes even more closely than charts. Related Reading: Bitcoin’s New Power Buyers: Companies Bought 3 Times What Miners Produced Delay Seen As Chance By Some Industry Players A segment of the industry read the postponements as constructive. David Sacks, who advises on crypto matters at the White House, said the pause could help close gaps between stakeholders and bring the bill closer to something workable. Brad Garlinghouse, CEO of Ripple, kept engaging with lawmakers and described the delay as an opening to improve the text. Those views contrast with more alarmed voices and help explain the mixed market reaction. Featured image from The Drive, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|btcusd|coinbase|crypto|fear and greed|stablecoin",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57215737,
    "published": 1768571895000,
    "title": "Ethereum ETF buying outpaces new supply: Will it push ETH price to $4.5K?",
    "body": "Renewed spot Ethereum ETF inflows topped $474 million this week while network metrics smashed records, positioning ETH for a rally to $4,500 in the coming weeks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57215505,
    "published": 1768571194000,
    "title": "Huione-linked Tudou Guarantee winds down amid $130M USDT refunds: Bitrace",
    "body": "The apparent shutdown follows years of scrutiny of one of crypto’s largest fraud marketplaces.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57216970,
    "published": 1768575600000,
    "title": "Who gets the yield? CLARITY Act becomes fight over onchain dollars",
    "body": "The CLARITY Act is becoming a fight over who controls yield as rules split DeFi companies and incumbents and risk pushing onchain US dollar yield offshore.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57216739,
    "published": 1768573120000,
    "title": "Early 2026 tailwinds for bitcoin miners as hashrate falls, profitability improves: JPMorgan",
    "body": "U.S.-listed bitcoin miners entered 2026 with rising revenues, improving margins and recovering valuations, setting a more constructive near-term backdrop.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin Mining|Bitcoin News|Hashrate|Iren|JPMorgan|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57216737,
    "published": 1768572935000,
    "title": "CoinDesk 20 Performance Update: Bitcoin Cash (BCH) Gains 3.1%, Leading Index Higher",
    "body": "Aave (AAVE) was also a top performer, rising 1.4% from Thursday.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "CoinDesk Indices|CoinDesk Indices|CoinDesk 20|charts|Prices|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 2,
        "NAME": "AAVE",
        "CATEGORY": "AAVE"
      },
      {
        "TYPE": "122",
        "ID": 12,
        "NAME": "BCH",
        "CATEGORY": "BCH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57216735,
    "published": 1768570775000,
    "title": "BitMine’s $200 million MrBeast investment seen as strategic diversification: B. Riley",
    "body": "The investment gives BitMine exposure to consumer media and potential DeFi revenue streams, strengthening its treasury strategy beyond ether accumulation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitmine|Ethereum Treasury|B. Riley|Analysts|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 57217498,
    "published": 1768577414000,
    "title": "Iranians Turn to Crypto as Economic Crisis and Sanctions Deepen",
    "body": "As Iran’s economy continues to strain under heavy sanctions, high inflation, and a weakening currency, many citizens are turning to crypto as an alternative financial lifeline. Related Reading: Bitcoin Tailwind: Cathie Wood Sees ‘Reaganomics On Steroids’ Ahead Recent blockchain data shows a sharp rise in Bitcoin withdrawals and transfers to personal wallets, particularly during periods of unrest and internet restrictions. For many Iranians, digital assets now serve both as a hedge against currency collapse and a way to move funds beyond government-controlled systems. The Iranian rial has lost around 90% of its value against the U.S. dollar since 2018, while inflation has hovered between 40% and 50%. In response, crypto usage has grown steadily, with Iran’s total cryptocurrency activity reaching an estimated $7.78 billion in 2025, according to Chainalysis. BTC's price trends sideways on the daily chart. Source: BTCUSD on Tradingview Bitcoin Use Rises During Protests and Internet Blackouts Crypto activity surged during mass protests that began in late December 2025, triggered by rising living costs and currency devaluation. As demonstrations spread, authorities imposed internet shutdowns and tightened financial controls. During this period, blockchain data showed higher average daily transaction values and a notable increase in transfers from Iranian exchanges to self-custodied Bitcoin wallets. Smaller withdrawals, often associated with individual users, recorded some of the strongest growth. Medium and large transfers also increased, suggesting that both households and businesses were seeking to move funds out of local platforms. Bitcoin’s appeal lies in its ability to be stored and transferred without relying on domestic banks or state oversight. For Iranians facing restrictions on access to cash, foreign currency, or international transfers, crypto offers a way to preserve value and maintain some financial mobility. Crypto’s Dual Role: Citizens and State Actors While ordinary Iranians are using cryptocurrencies to protect savings, state-linked actors are also active in the digital asset space. Wallets associated with Iran’s Islamic Revolutionary Guard Corps (IRGC) accounted for more than half of the country’s crypto transaction value in the final quarter of 2025. These wallets received over $3 billion during the year, up from around $2 billion in 2024. Western authorities believe the IRGC uses cryptocurrencies to bypass sanctions, move funds across borders, and support regional operations. Chainalysis notes that these figures likely underestimate the true scale, as many affiliated wallets and networks remain unidentified. At the same time, spikes in Iranian crypto activity have closely followed major political and security events, including the Kerman bombings in 2024, missile strikes in October 2024, and a 12-day conflict in June 2025 that disrupted Iran’s largest crypto exchange and a major state bank. A Growing Dependence on Digital Assets For many Iranians, cryptos have become more than a speculative asset. They are increasingly used as a tool for financial survival in an economy marked by inflation, sanctions, and limited access to global markets. Bitcoin’s censorship resistance and portability make it especially attractive during periods of unrest or capital controls. Related Reading: XRP In A ‘Super Cycle’? SuperTrend Suggests Another Story As economic pressures persist and geopolitical tensions remain high, blockchain analysts expect crypto usage in Iran to continue rising. Whether as a means of preserving personal wealth or navigating sanctions, digital assets are now a central part of Iran’s financial landscape. Cover image from ChatGPT, BTCUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|btc|btcusd|crypto|ETH|ethereum|ethusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57217389,
    "published": 1768577013000,
    "title": "Wikipedia Reveals Multiple Deals with AI Giants to Use Its Content",
    "body": "The Wikimedia Foundation said it has inked agreements with Microsoft, Google, Amazon and Meta to use its content for training LLMs.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57217631,
    "published": 1768576695000,
    "title": "Crypto card spending hits $18 billion annualized as stablecoin use shifts to everyday payments",
    "body": "Artemis research shows crypto credit and debit card spending is now rivaling peer-to-peer stablecoin transfers, with Visa capturing most on-chain volume through early infrastructure partnerships.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Visa|Crypto card|Stablecoins|cryptocurrency payments|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57217629,
    "published": 1768576343000,
    "title": "Riot Platforms surges 11%  as lease deal with AMD marks major AI infrastructure pivot",
    "body": "The company sold nearly $100 million of bitcoin to fund the purchase of its 200-acre Rockdale site and signed a leasing agreement with Advanced Micro Devices that could deliver $1 billion in revenue.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin Mining|Riot platforms|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57218277,
    "published": 1768579784000,
    "title": "South Korea Tightens Crypto Access as Google Play Blocks Unregistered Exchanges",
    "body": "A new app store crackdown has landed in South Korea as lawmakers formalize a framework for tokenized securities.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 57218189,
    "published": 1768579636000,
    "title": "Bitcoin pulls back to $94,300 as U.S. stocks sink, precious metals tumble",
    "body": "A selloff in precious metals and lower U.S. stocks appeared to be denting crypto sentiment.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57218768,
    "published": 1768579819000,
    "title": "HR services provider Gusto taps Zerohash to speed up global payouts with stablecoins",
    "body": "Payroll and HR platform Gusto is piloting stablecoin payouts powered by Zerohash, aiming to cut cross-border payment times.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Zero Hash|Stablecoins|Exclusive|Cross-Border Payments|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57219136,
    "published": 1768582821000,
    "title": "XRP Whale Inflows To Binance Hit Their Lowest Level Since 2021: Accumulation Behavior?",
    "body": "XRP is consolidating above the $2 mark after a volatile stretch, as the market begins to wake up and traders watch for the next directional move. While price action remains relatively stable, on-chain data suggests that selling pressure from large holders may be easing, creating a more constructive short-term backdrop for bulls. Related Reading: Bitcoin Bull Score Hits Level Seen Only 7 Times In 6 Years – A Rare Historical Signal A report from Arab Chain on CryptoQuant highlights a sharp decline in whale transfers to Binance over the past few days. Data from the XRP Ledger shows that the Whale Transfer Flow (30DMA) dropped to 48 million XRP before rebounding slightly to 56.1 million XRP, marking the lowest levels recorded since 2021. This metric tracks the average volume of large wallet transfers moving into exchanges, and it is often used as a proxy for whale distribution and sell-side intent. Historically, when whale inflows surge, it tends to signal that large investors are positioning to offload holdings, adding supply to the market and increasing downside risk. However, when these flows compress to unusually low levels, it typically reflects reduced urgency to sell, which can help stabilize price during consolidation phases. With XRP holding above $2, this shift in exchange-bound whale activity suggests the market may be entering a quieter accumulation window, where any breakout will likely depend on fresh demand rather than panic-driven liquidity. Whale Inflows Cool Off as XRP Holds Key Support What makes this reading especially notable is that it comes while XRP remains relatively stable on the price chart. Averaging around $2.15 during the same period. Instead of seeing whales rush to exchanges into strength, the data suggests large holders are choosing to stay positioned. Investors may prefer to hold XRP rather than actively distribute it into the market. This type of behavior is often associated with “quiet” market phases. Where price compresses and liquidity thins out, setting the stage for a larger move once demand returns. When exchange-bound whale transfers fade, it typically means fewer coins are immediately available for sale. This can reduce resistance on small upside pushes and keep downside moves more contained. Historical context adds weight to the signal. In 2021, the last time whale inflows to exchanges reached similarly low levels, XRP was entering periods that later developed into stronger upward trends. Back then, supply on exchanges stayed constrained while demand gradually built, allowing price to respond more efficiently once momentum shifted. For now, the current decline in whale inflows is easing short-term sell pressure and improving the supply setup. If buyers step in with stronger volume, XRP may be better positioned to break out of consolidation without facing heavy distribution from large wallets. Related Reading: Bitcoin Reclaims $97K As Long-Term Holders Supply Stays Locked XRP Momentum Stalls Under Key Averages XRP is trading near $2.06 on the daily chart after weeks of choppy consolidation. Showing a market that is stabilizing but still lacks strong trend conviction. Price has held above the psychological $2 level, which has served as a short-term floor following the late-2025 selloff that dragged XRP toward the $1.80–$1.90 zone. However, the rebound remains technically fragile, as XRP is still trading below key moving averages that continue to slope downward. The blue and green trend lines, which represent medium-term resistance, sit above the price and highlight how sellers have defended rallies since November. XRP’s recent push higher was met with rejection near the $2.30–$2.35 area. Reinforcing that demand has not yet been strong enough to reclaim higher levels and shift the market structure bullish. Related Reading: Bitcoin Bulls Take Control: Futures Positioning Turns Bullish for First Time Since October Volume has also remained relatively muted outside of isolated spikes, suggesting the market is not seeing aggressive expansion in participation. For bulls, the immediate objective is building acceptance above $2.20 and flipping the descending averages into support. If XRP loses $2, downside pressure could quickly return toward the $1.90 area. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|Binance XRP|xrp|XRP Accumulation|xrp news|XRP Whale|XRP Whale Activity|XRP Whale Binance Inflow|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57219321,
    "published": 1768583268000,
    "title": "Bitcoin is now most undervalued versus gold: Will BTC price rebound?",
    "body": "BTC price surged nearly 150% after a similar BTC–gold undervaluation signal in late 2022, highlighting how extreme discounts have preceded major rallies.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57219718,
    "published": 1768584680000,
    "title": "Nasdaq Warns Bitcoin Hardware Maker Canaan About Delisting",
    "body": "Bitcoin miner Canaan faces Nasdaq delisting deadline as shares languish below $1 despite major hardware order and brief October rally.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57220396,
    "published": 1768586955000,
    "title": "Despite the Dip, Bitcoin Just Flashed Its Most Reliable Bullish Signal: Analysis",
    "body": "The price of Bitcoin is down today, but BTC also just flashed its most-watched bullish signal. Is a recovery rally on the way?",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]