[
  {
    "id": 54557106,
    "published": 1763445626000,
    "title": "Crypto Market Wipes Out $1 Trillion Since October: Analyzing The Forces Behind The Crash",
    "body": "Since October 6, the crypto market has lost over $1.1 trillion in value. Analysts from The Bull Theory examined the underlying causes of this behavior and identified significant issues causing such poor performance in what was expected to be a bullish fourth quarter for the industry. Market Liquidity Stumbles Post-October 10 Sell-Off One of the primary factors cited is the severe damage inflicted on market liquidity following the dramatic sell-off on October 10, which resulted in more than $20 billion liquidated from traders in a matter of minutes. This particularly impacted altcoins, with many seeing losses of 70% to 80%. With liquidity diminished, the current market environment allows prices to fluctuate easily, meaning even minor sell-offs can lead to rapid price drops. The analysts noted that the liquidity has failed to recover since this initial dump, resulting in the order books for major cryptocurrencies such as Bitcoin (BTC) and Ethereum (ETH) becoming increasingly sparse. Related Reading: The ‘Insanely Bullish’ Dogecoin Setup That Will Trigger A 600% Rally To $1 The consequences of this thin liquidity are stark; a small volume of selling can generate significant downward price movements. This observation matches the reality of recent market activity, where price declines appear more pronounced than the actual selling volume. Another contributing factor to the downturn, as pointed out by market analyst Tom Lee, is the behavior of major market makers. According to Lee, the ongoing correction may stem from one or two large entities facing considerable losses. Layered upon these issues is the excessive leverage in the market. Despite the unprecedented liquidations, many traders have reportedly returned to the market with increased leverage. The Bull Theory analysts contend that this high leverage, coupled with thin markets, enables market makers to trigger substantial liquidations with minimal price movement, making the sell-offs appear more aggressive. Crypto Fear Index Hits Lowest Level In Over 3 Years Compounding these issues, market sentiment has been plagued by fear, uncertainty, and doubt (FUD). Current narratives circulating, such as speculation regarding Strategy (previously MicroStrategy) facing forced liquidations if Bitcoin falls below $74,000, further exacerbate panic. It is worth noting that during the 2020-2021 cycle, Strategy’s cost basis hovered around $30,000 to $32,000. Even when Bitcoin dipped to $16,000—almost 50% below their cost—the company did not sell any coins. The Fear Index has also plummeted to 10, a level not seen in over three and a half years. The analysts belive that such extreme fear suggests two potential scenarios: either the market has reached its bottom, or it is approaching it. Related Reading: Here’s Why The Ethereum Price Is Crashing Again, Can It Breach $3,000? In conjunction with these sentiment measures, the Relative Strength Index (RSI) for Bitcoin has returned to levels comparable to those of January 2023, when Bitcoin was valued around $20,000. The analysts suggest that this signals a stretched market on the downside, particularly within altcoins, where speculative activity has diminished and retail interest is waning. Despite the current turmoil, the Bull Theory analysts find that fundamentally, little has changed within the crypto market. They highlighted that Bitcoin’s network remains robust, with increasing hashrate, ongoing institutional interest, and a supportive stance from the US government regarding regulated crypto. However, it remains to be seen what the eventual direction of the digital asset market will be, as neither negative nor bullish cycles follow straight lines. This suggests that despite the downtrend, a new recovery and future dips may occur, and vice versa. At the time of writing, Bitcoin was leading Monday’s crypto market drop, trading at $91,940—a 3% drop within 24 hours and a 13% drop within a week. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|altcoins|bitcoin|bitcoin price|btc|BTCUSDT|crypto|crypto market|crypto news|cryptocurrency|ETH|ethereum",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54557098,
    "published": 1763445597000,
    "title": "Mt. Gox Moves $956M Worth of BTC As Prices Tank",
    "body": "The latest on-chain move comes as BTC's spot price continues to slide.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Mt. Gox|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54556885,
    "published": 1763445063000,
    "title": "Bitcoin whales switch to buying as retail dumps on ‘extreme fear’",
    "body": "On-chain data reveals Bitcoin whales are aggressively accumulating during the crash while smaller wallets capitulate.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54557588,
    "published": 1763446565000,
    "title": "Efforts underway to digitize trade in Africa with blockchain, stablecoins",
    "body": "Chido Munyati, head of Africa at the World Economic Forum, said in a statement that outdated payments and documents are a significant obstacle for African trade, one that he hopes digitization can solve.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      }
    ]
  },
  {
    "id": 54558027,
    "published": 1763445063000,
    "title": "Bitcoin whales switch to buying as retail dumps on ‘extreme fear’",
    "body": "On-chain data reveals the number of Bitcoin whales have been increasing since the start of October while the number of smaller wallets have reduced.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54559841,
    "published": 1763451012000,
    "title": "Dogecoin Cup And Handle Pattern Is Returning, What Happens To Price If It’s Completed?",
    "body": "A Dogecoin cup and handle pattern has returned to the chart, which could be pointing to another recovery trend. The chart pattern was highlighted by crypto analyst Melikatrader on a TradingView post, showing that there could be a reversal coming for Dogecoin soon. The analysis further explains how the formation came about and what this could mean for the meme coin’s price as another week of trading gets underway in the current bearish environment. Understand The Dogecoin Macro Cup And Handle Pattern Interestingly, the formation of the macro cup and handle pattern didn’t just start recently, as is usually the case. The crypto analyst explains that this formation had begun years ago, back in 2021, when the Dogecoin price had staged its legendary 36,000% rally that pushed it to new all-time highs. Related Reading: Analyst Breaks Down Why There Can’t Be 7 Million XRP Holders It comes after what was perhaps the strongest pole and flag rally in the Dogecoin price history, pushing it to new heights in the process. However, this led to the formation of a multi-year-long cup and handle pattern, with the cup portion of the pattern being in formation since 2021. This large cup formation points to long-term accumulation for the Dogecoin price. Now, according to the analyst, the cup has been completed, leaving the handle pattern that is now underway. As part of this, the Dogecoin price is now trading inside of a descending handle, and this is where the bullish part comes in. This is because a descending bullish handle has often appeared as a precursor to a bullish price breakout. Why DOGE Price Could Hit $4 With the formation of the handle pattern already starting, it now remains for the completion of the bullish trend. As long as the Dogecoin price is able to break out of the descending handle, then it would set the tone for the upward reversal for the meme coin. Related Reading: Is Bitcoin Falling Because Of Strategy Sell-Offs? On-Chain Data Fuels Debate The major thing about this bullish handle is the fact that the breakout could last into multiple years. This multi-year expansion phase could see the continuous increase of the price as Dogecoin makes its way back toward its $0.74 all-time highs that were set back in 2021. However, this would not be the end of the uptrend, as the crypto analyst explains that the completion of the cup and handle pattern puts the price much higher. The target puts the lower and more conservative end at $2.8. But a 2,400% expansion is still possible, pushing the price as high as $4 before the trend is complete. Featured image from Dall.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54560457,
    "published": 1763451812000,
    "title": "Average Bitcoin ETF investor now underwater as BTC falls below $89.6K",
    "body": "Bitcoin and Ether ETFs saw another day of heavy withdrawals, while Solana ETFs maintained an uninterrupted inflow streak since launch.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54560929,
    "published": 1763445063000,
    "title": "Bitcoin whales switch to buying amid ‘extreme fear’",
    "body": "On-chain data reveals the number of Bitcoin whales have been increasing since the start of October.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54562973,
    "published": 1763456459000,
    "title": "Why Is Bitcoin Price Crashing? Arthur Hayes Isn’t Surprised",
    "body": "In his latest Substack essay “Snow Forecast,” published November 17, 2025, Arthur Hayes argues that Bitcoin’s sharp drawdown from its October all-time high is a straightforward consequence of tightening dollar liquidity once derivative-driven “fake flows” into Bitcoin have dried up. For Hayes, Bitcoin is “the free-market weathervane of global fiat liquidity” that trades on expectations of future money supply rather than day-to-day headlines. Why Is The Bitcoin Price Down? He looks back to the “US Liberation Day” turmoil on April 2, 2025, when aggressive tariff moves from the Trump administration initially sparked fears of a depression. After Trump “TACO’d” — his word for calling a truce on tariffs — on April 9, Hayes called for “Up Only!” Bitcoin rallied about 21%, Ether and other “selected shitcoins” followed, and Bitcoin dominance slipped from 63% to 59%. Yet even as his proprietary USD Liquidity Index fell roughly 10% from April 9, Bitcoin still rose 12%. Hayes says that divergence was not some structural decoupling, but a temporary distortion created by ETF basis trades and Digital Asset Treasury (DAT) vehicles. He is particularly blunt about the spot Bitcoin ETF flows that many commentators branded as proof of “institutional adoption.” Looking at BlackRock’s IBIT, Hayes notes that the five largest holders are hedge funds and prop trading desks, which mainly used the ETF as a leg in a basis trade: “They short a CME-listed Bitcoin futures contract vs. buying the ETF to earn the spread between the two.” Related Reading: Bitcoin Social Dominance Hits 4-Month High: What It Means When the annualized basis stands “markedly above the Fed Funds rate, hedge funds will pile into the trade,” generating “large and persistent net inflows into the ETF.” That, he argues, “creates the impression, to those who don’t understand the market microstructure, that there is massive interest from institutional investors for Bitcoin exposure when in reality they don’t give a fuck about Bitcoin, they only play in our sandbox for a few extra points over Fed Funds.” As the basis collapsed, those same players “quickly dump their positions,” producing “massive net outflows” and a negative feedback loop with retail. DATs provided a similar optical illusion. Hayes highlights Strategy (MSTR), which can acquire more Bitcoin when its stock trades at a premium to its underlying holdings, a metric called mNAV. As that premium turned into a discount, its ability to grow BTC holdings cheaply diminished. Together, ETF basis flows and DAT issuance “allowed Bitcoin to rise even though dollar liquidity contracted,” he writes. “But this state of play is over Without these flows obscuring the negative liquidity picture, Bitcoin must fall to reflect the current short-term worry that dollar liquidity will contract or not grow as fast as the politicians promised.” This Will End The Bitcoin Downtrend From there, Hayes goes back to his core premise that “money is politics.” He says it is now time for President Trump and Treasury Secretary “Buffalo Bill” Bessent “to put up or shut up”: either they deploy the Treasury to “run roughshod over the Fed, create another housing bubble, hand out more stimulus checks,” or they are “a bunch of limp-dick charlatans.” He draws a direct parallel to 2022, when President Biden and Treasury Secretary Janet Yellen engineered a huge drawdown of the Fed’s reverse repo balances. “Yellen issued more Treasury bills than notes or bonds, which sucked $2.5 trillion out of the Fed’s Reverse Repo Program from 3Q2022 until 1Q2025, which pumped stonks, housing, gold, and crypto.” Hayes says, “I have 100% confidence that [Bessent] will engineer a similar outcome.” In the near term, however, he is cautious. Hayes acknowledges the bull argument that as the US government normalizes operations after the shutdown, the Treasury General Account can be reduced by $100–150 billion and that the Fed will end quantitative tightening on December 1. Related Reading: Can Strategy Survive A 90% Bitcoin Crash? Saylor Says Yes But he points out that “since July approximately $1 trillion of dollar liquidity evaporated based on my index.” Against that backdrop, a $150 billion boost is marginal, and talk of renewed QE remains “just talk” until “Fed whisperer Nick Timiraos” signals otherwise. “The bulls are correct; over time, money printer go Brrrrrr. But first, the markets must retrace the gains since April to better align with the liquidity fundamentals.” How Hayes Positions His Company Hayes says he has already adjusted Maelstrom’s positioning. “Over the weekend, I raised our USD stables position in anticipation of lower crypto prices,” even though the fund is still “long as fuck.” The only token he thinks can “outrun the negative dollar liquidity situation in the short-term” is Zcash (ZEC). “With AI, big tech, and big government, privacy across most sectors of the internet is dead. Zcash and other privacy cryptos using zero-knowledge proof cryptography are humanity’s only chance to fight this new reality.” He argues that it “should offend our sensibilities as disciples of Satoshi” that the third, fourth and fifth largest coins are “a USD-derivative, a do-nothing coin on a do-nothing chain, and CZ’s centralized computer,” and insists “Zcash or a similar type of privacy crypto belongs right below Ethereum.” The current Bitcoin correction, in Hayes’s reading, is also a warning. “The Bitcoin dive from $125,000 to the low $90,000s whilst the S&P 500 and Nasdaq 100 indices hover around all-time highs tells me that a credit event is brewing.” He sees scope for a 10–20% equity drawdown and a 10-year US yield near 5%. In that stress, “Bitcoin could absolutely drop to $80,000 to $85,000.” But if that forces the Fed and Treasury to “accelerate their money printing capers,” he believes Bitcoin “could zoom towards $200,000 or $250,000 at year end.” Hayes also expects China to join the next wave of easing once the US clearly accelerates dollar creation. He cites the People’s Bank of China’s recent purchase of government bonds as “the beginning of China QE” and notes Beijing’s anger at the US “stealing” Bitcoin from the Chinese pig butchering scam operator as evidence that Xi Jinping views Bitcoin as a strategic asset. “If both Trump and Xi, leaders of the two largest economies globally, believe that Bitcoin is valuable, why are you not bullish long term?” he asks. At press time, BTC traded at $90,477. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|Why Is Bitcoin Down Today|Why Is Bitcoin Price Down Today",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54563327,
    "published": 1763457179000,
    "title": "Dogecoin ETF Launches Next Week as Maxi Doge Presale Breaks $4M",
    "body": "What to Know: Grayscale’s Dogecoin ETF is likely to launch on November 24, marking a significant step for Dogecoin’s institutional acceptance. While not 100% confirmed, Eric Balchunas believes the chances of a November launch are very high, based on the Grayscale’s S-1 SEC filing. The upcoming Dogecoin ETF could further boost the potential value of tokens like Maxi Doge. Maxi Doge ($MAXI) has already raised over $4M in its presale, with staking rewards of 76% and a token price of $0.0002685. The surge of cryptocurrency exchange-traded funds (ETFs) is dominating the market, with major launches set to take place next week. One of the most anticipated moves is the launch of Grayscale’s Dogecoin ETF, expected to hit the market on November 24, following an amended regulatory filing earlier this month. This marks an exciting new era for Dogecoin ($DOGE) as it is set to gain institutional traction and mainstream visibility. As ETFs flood the market, investors are rushing to position themselves ahead of what could be a major moment in crypto’s broader acceptance, despite Bitcoin’s recent crash below $90K. But alongside the spotlight on ETFs, a new project is also gaining significant momentum in the presale market. 🧨 Maxi Doge ($MAXI) is positioned to make a significant splash in the crypto world. With over $4M raised and staking rewards of 76%, this presale meme coin could be one of the smartest buys in the shifting crypto landscape. This growing momentum reflects the overall trend of increasing investor interest in crypto, particularly in tokens related to large-scale movements like Dogecoin. Maxi Doge is riding this wave, offering a promising opportunity to those looking to capitalize on the ongoing crypto surge. With its compelling value proposition and attractive presale offer, it stands out as one of the best crypto presales of the year. Maxi Doge: A Token Built for the Future Maxi Doge ($MAXI) isn’t just another meme coin – it plans to dethrone $DOGE as the alpha dog of all meme coins. Positioned as the next logical step in the evolution of Dogecoin-related tokens, Maxi Doge seeks to amplify $DOGE’s growing influence by bringing raw degen energy to the table and offering an enhanced staking mechanism. With staking rewards reaching an impressive 76%, Maxi Doge is attracting attention from investors seeking passive returns while benefiting from the rise of Dogecoin’s market prominence. 🧨 But it’s the coin’s meme potential that really drives it home. Maxi is everything Dogecoin didn’t dare become: unhinged, obsessed, and degenerate. Maxi promotes 1000x leverage trading and green candle buys with one goal in mind: retire by 22 and make it look easy. This focus on rewards aligns perfectly with the broader trend in the crypto market, where holders are looking for sustainable, value-driven investments. At a price point of $0.0002685 per token, Maxi Doge is a highly affordable entry point into the expanding Dogecoin-related market. With the presale now having raised over $4M, the project has shown strong early demand, which could signal its potential for growth once it enters the public market. 📖 Read our guide to buying $MAXI to learn more about the project and how to join the presale. Maxi Doge Presale: A Rare Opportunity for Investors The Maxi Doge ($MAXI) presale is one of the hottest opportunities in the market right now. The presale is fast gaining traction, and this early momentum suggests that the project will be one to watch when it officially launches. Investors who join the Maxi Doge presale now will not only benefit from attractive staking rewards but will also be positioning themselves ahead of a potential bull run in the Dogecoin market. 🧨 The upcoming launch of Grayscale’s Dogecoin ETF could further catalyze the value of tokens like $MAXI, positioning it to ride the wave of Dogecoin’s growing mainstream acceptance. With Maxi Doge continuing to attract attention and funds, its presale represents a rare opportunity to get involved early in a project with significant growth potential. If you’re looking for a high-potential token that aligns with the current market trends, Maxi Doge is a presale that deserves attention. 🚀 Secure your $MAXI tokens before the next price increase. Disclaimer: This isn’t financial advice. Always do your own research before making any investment decision. Authored by Aaron Walker, NewsBTC – https://www.newsbtc.com/news/dogecoin-etf-maxi-doge-presale",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54563216,
    "published": 1763456952000,
    "title": "Is SOL Undervalued? $BEST Token and Its Web3 Wallet Could Be the Next 10x Opportunity",
    "body": "What to Know: Solana’s ecosystem growth and institutional integrations highlight rising demand for tools that match its speed, security, and expanding real-world utility. Rising developer activity and on-chain innovation reinforce the view that Solana remains undervalued, increasing the need for wallets that fully support its ecosystem. Best Wallet’s MPC security and integrated DEXes deliver a unified, high-security experience tailored to users engaging with fast-growing networks like Solana. The $BEST token powers a mobile-first, no-KYC wallet ecosystem built to simplify Web3 access while giving users full control and utility-driven rewards. As the crypto market matures, investors are constantly searching for the next big opportunity. This has led to a renewed focus on assets that may be flying under the radar, sparking debates around whether major players like Solana are undervalued. Even as $SOL’s ecosystem continues to mature, some traders believe this crypto is yet to show its full potential. Right now, $SOL is holding firm at a key technical support zone – around $128–$130, with $SOL now back above $130 ). This could form the foundation for a strong rebound if the price reclaims higher levels. Behind this stability lies a thriving ecosystem: hackathons and developer events are flourishing, signaling deep and sustained innovation on the chain. Institutional and retail adoption are also scaling up rapidly. Cash App plans to support USDC payments on Solana in 2026, and SoFi has enabled $SOL trading directly from checking accounts. On-chain use cases are broadening beyond DeFi: real-world projects are tapping into Solana for credit instruments, lending, and other financial applications. Meanwhile, record-breaking fundraising and product launches, from prediction markets to native hardware wallets, demonstrate that Solana’s ecosystem isn’t just growing, it’s evolving. This strong fundamental backdrop of technical resilience, growing adoption, and real utility suggests that $SOL’s current valuation may not fully reflect its potential. And that’s where Best Wallet Token ($BEST) comes in: as users look for more secure, accessible, and powerful ways to interact with high-potential blockchains like Solana, $BEST’s next-gen wallet ecosystem is uniquely positioned to capture this momentum and turn this utility token into a 10x opportunity. That’s because the new conversation isn’t just about price charts; it reflects a deeper trend of users seeking more efficient, secure, and feature-rich ways to interact with crypto. This demand for innovation has exposed cracks in the offerings of established wallet providers. Many are either centralized, creating potential points of failure, or decentralized but lack the mobile-first, user-friendly interface needed for mainstream adoption. They offer basic functions but little else, failing to provide the added benefits and utility that today’s crypto users expect. This gap in the market creates a significant opportunity for a new solution to emerge, one that combines top-tier security with a comprehensive suite of tools designed for both new and experienced investors. Best Wallet and $BEST Redefine On-Chain Security and Access In a landscape where security is paramount, Best Wallet sets a new standard. It is the first fully integrated wallet to use Fireblocks’ advanced MPC-CMP technology , providing institutional-grade security that protects users from common threats like private key theft. This technology removes the single point of failure associated with traditional seed phrases, offering peace of mind. This focus on security is paired with a commitment to accessibility. The platform features a unique ‘Upcoming Tokens’ launchpad, which simplifies the often-complex process of participating in presales. It provides users with vetted, early-stage opportunities, removing barriers for those looking to get in on the ground floor of new projects. This feature is crucial for investors searching for the next breakout token, whether it’s a Solana meme coin or an emerging ecosystem project. Find out more about this wallet ecosystem in our Best Wallet token review . The project’s momentum is undeniable. The Best Wallet Token presale has already raised an impressive $17M+, with $BEST currently priced at $0.025965. This strong early performance signals significant investor confidence in its vision to create the easiest and safest crypto wallet on the market. Check the live $BEST presale. A Multi-Chain Future Demands More Than Basic Swaps Today’s crypto landscape is a multi-chain universe, and Best Wallet is built for it. The platform features the Best DEX aggregator, powered by Rubic, which connects to over 50 chains, 200+ DEXs, and 20 cross-chain bridges. This ensures users always get the best rates for swaps with minimal fees, all within a single, intuitive interface. The $BEST token presale is seeing serious attention thanks to this powerful utility. On-chain data shows whale wallets accumulated $30K+ in single transactions, with the largest recent purchase hitting $30.2K on November 17. This follows several older large transactions, like a $70.2K whale buy back in September. This ‘smart money’ movement suggests big retail investors see long-term potential in the project’s comprehensive approach. For those wondering if Solana is undervalued, the activity around innovative infrastructure like Best Wallet provides a compelling narrative. And beyond its trading capabilities, the $BEST token offers tangible benefits within the ecosystem. Holders gain access to reduced transaction fees and can participate in staking immediately during the presale. With 800M tokens allocated for dynamic APY rewards (now at 76%), early backers can start earning returns on their investment from day one, creating a powerful incentive to join the growing community. The project’s robust features make a strong case for its $BEST’s price potential , with our forecast putting the token at a $0.05 high in 2026 – a 1.9x growth from today’s price of $0.025965. For those ready to participate, the process is straightforward; learn how to buy the Best Wallet token and secure your position in this innovative ecosystem. Join the $BEST presale today. This article is for informational purposes only and does not constitute financial advice. Please conduct your own research before investing in any cryptocurrency. Authored by Aaron Walker, NewsBTC — https://www.newsbtc.com/news/solana-undervalued-proof-best-wallet-token-presale-10x-opportunity/",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54564080,
    "published": 1763458182000,
    "title": "Grab deepens stablecoin push with StraitsX Web3 wallet and settlements",
    "body": "Southeast Asian super app Grab’s MOU with StraitsX shifts its Web3 efforts from pilots to infrastructure, exploring a unified stablecoin settlement layer across Asia.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      }
    ]
  },
  {
    "id": 54563870,
    "published": 1763458080000,
    "title": "ARK Invest scoops $10M in Bullish as it hits record low amid crypto stock rout",
    "body": "Crypto stocks plunged on Monday, with Coinbase, Marathon Digital, Riot, CleanSpark, Circle and Strategy all sliding sharply.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54563644,
    "published": 1763457745000,
    "title": "Record $1.26B Outflow Hits BlackRock Bitcoin ETF as Bearish Options Cost Soars",
    "body": "The price of IBIT has dropped 16% to $52, a level last seen in April.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|BlackRock|Bitcoin News|ETF|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54565378,
    "published": 1763460038000,
    "title": "Bitcoin’s Drop Under $90K Sparks Bold Claims from Crypto Execs: ‘This Is A Generational Opportunity’",
    "body": "Bitcoin slipped below $90,000 this week, a level it had not touched in seven months, according to data. Traders watched nervously as the flagship token moved around $90,700, leaving it roughly 25% beneath its recent all-time high of just over $126,000 reached on Oct. 6. Markets noted that a big liquidation event on Oct. 10 still echoes through trading desks. Related Reading: From Dotcom To Crypto: Veteran Analyst Says The Bull Run Isn’t Over Analysts See A Near-Term Bottom According to an interview on CNBC, BitMine chairman Tom Lee said the Oct. 10 liquidations and ongoing uncertainty about whether the US Federal Reserve will cut rates in December have kept pressure on crypto. He described signs of exhaustion among sellers and cited technical work suggesting a bottom could appear soon. Tom Lee and Matt Hougan both say crypto prices are getting close to forming a bottom. Source: YouTube Bitwise Asset Management chief investment officer Matt Hougan shared a similar line of thinking, calling current pricing a “generational opportunity” and urging longer-term investors to take notice. He added that traders are jittery about the economy, high AI valuations, and US President Donald Trump’s tariffs, which may have added to selling. Selling Fueled Mostly By Short-Term Holders According To XWIN Research, a review of on-chain measures showed short-term holders did much of the heavy lifting in the recent decline. The Short-Term Holder Spent Output Profit Ratio fell below 1 on multiple occasions, which signals many short-term owners sold at a loss. XWIN also said coins younger than three months made up most of the spent volume during the worst of the drop. That pattern points to panic-driven exits by recent buyers rather than mass, late-cycle distribution by longtime holders. At the same time, metrics such as Coin Days Destroyed, Realized Profit, and Long-Term Holder Net Position Change registered increased distribution by long-term holders since September, but XWIN argued this behavior matches routine profit-taking during a bull run rather than blow-off top selling. Flow From ETFs And Whales Adds Pressure Reports have disclosed that exchange-traded fund outflows and large sales by whales also contributed to the weakness, while rising geopolitical tensions added a further layer of risk. Market participants described Bitcoin as an early mover that started to weaken before other risk assets, which some investors took as a warning signal for broader markets. Related Reading: Crypto Carnage Continues — Tom Lee Exposes What’s Really Going On Outlook Hinges On Stocks And Policy Lee expects a rebound if equities rally later this year, saying a stronger stock market would likely lift Bitcoin back to fresh highs before year-end. Hougan agreed that a recovery could come quickly and that the current window offers an attractive entry for investors planning to hold for 12 months or more. Yet traders remain split; a few see the recent data as clear exhaustion, while others warn macro events and policy decisions could push prices lower before confidence returns. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|Bear market|bitcoin|BitMine|btc|btcusd|crypto|Matt Hougan|Tom Lee",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54566682,
    "published": 1763462803000,
    "title": "Deutsche Börse to Add SocGen’s MiCA Stablecoins to Core Market Systems",
    "body": "Move brings regulated euro and dollar stablecoins into Deutsche Börse’s settlement and collateral tools.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|SocGen|Deutsche Börse|Stablecoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54567117,
    "published": 1763463578000,
    "title": "Bitcoin Drops to Seven-Month Low Under $90K",
    "body": "Bitcoin ETFs have bled hundreds of millions as the market outlook deteriorates, driven by profit-taking and portfolio rebalancing.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54566791,
    "published": 1763462818000,
    "title": "Wallets tied to Libra scandal pull $4M and bet big on Solana",
    "body": "Wallets tied to the Libra memecoin scandal continue to draw liquidity and have purchased $61.5 million in Solana, despite asset freezes and fraud probes.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54567438,
    "published": 1763463843000,
    "title": "Mastercard taps Polygon to turn clunky crypto addresses into simple usernames",
    "body": "Mastercard is rolling out verified, human-readable crypto aliases to self-custody wallets, using Polygon for onchain support and Mercuryo for identity verification.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 38,
        "NAME": "MATIC",
        "CATEGORY": "MATIC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54567626,
    "published": 1763462818000,
    "title": "Libra memecoin-linked wallets pull $4M and bet big on Solana",
    "body": "Wallets tied to the Libra memecoin continue to draw liquidity and have purchased $61.5 million in Solana, despite asset freezes and fraud probes.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54567685,
    "published": 1763462818000,
    "title": "Libra token-linked wallets pull $4M and bet big on Solana",
    "body": "Wallets tied to the Libra token continue to draw liquidity and have purchased $61.5 million in Solana, despite asset freezes and fraud probes.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54568205,
    "published": 1763465400000,
    "title": "Crypto Markets Today: Fear Grips Market as BTC Tests Support, Volatility Spikes",
    "body": "Bitcoin hovered near $91,000 as sentiment hit \"extreme fear,\" volatility jumped and leveraged traders absorbed over $1 billion in liquidations while altcoins fell further.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54567771,
    "published": 1763464706000,
    "title": "Best Crypto Under $1 to Watch as Whales Buy Bitcoin ETF Dip",
    "body": "What to Know: Bitcoin ETFs have seen significant outflows, yet whales are purchasing, signaling long-term demand. Projects like Bitcoin Hyper and Maxi Doge show strong presale activity and innovative features. TRON continues to stand out with real-world utility and a well-established market presence. The market is ripe for undervalued cryptos, with many positioned for potential gains post-selloff. The crypto market is currently in a state of flux, with major shifts in investor sentiment as Bitcoin ETFs experience notable outflows. In conversation with MarketWatch, Julio Moreno, CryptoQuant’s head of research, discussed how holdings in Bitcoin ETFs have seen a drastic drop, from 441K $BTC in October to 271K $BTC in November. And data now shows four consecutive days of outflows . Retail investors seem to be avoiding this downturn; however, whales are stepping in with significant purchases. For example, a recent $31.16M Ethereum purchase in a single day has captured the market’s attention. Meanwhile, CryptoQuant posted about the ‘ Biggest $BTC Accumulation… in the Middle of a Selloff ,’ signaling long-term demand for the asset. This shift in market dynamics presents a unique opportunity for investors to keep an eye on undervalued cryptos, especially the best crypto under $1 , which may offer substantial growth potential once the market recovers. With whale activity and strong long-term demand driving the market, certain crypto projects are poised to deliver impressive gains. Bitcoin Hyper ($HYPER) , Maxi Doge ($MAXI) , and TRON ($TRX) are three promising cryptocurrencies under $1 that could benefit from the upcoming market rebound. 1. Bitcoin Hyper ($HYPER): Hyper-Speed Bitcoin is Here Tired of Bitcoin’s slow speeds and high fees? Bitcoin Hyper ($HYPER) is the next-generation Layer-2 solution designed to transform the world’s most secure asset from a static store of value into a dynamic, programmable ecosystem. By integrating the high-throughput Solana Virtual Machine (SVM) , $HYPER unleashes Bitcoin’s true potential, enabling near-instant transactions and minimal fees. This breakthrough paves the way for a fully functional Bitcoin DeFi world, supporting smart contracts, staking, and dApps without sacrificing Bitcoin’s legendary security. With over $27M raised in a wildly successful presale, the market has clearly signaled its demand for faster, cheaper $BTC utility. $HYPER is not competing with Bitcoin; it’s upgrading it, offering the speed of a modern blockchain while settling securely on the original L1. Position yourself at the forefront of the new Bitcoin economy; the future is hyper-fast. Still want more info though, check out our ‘ What is Bitcoin Hyper ’ guide for a full project run down. With Bitcoin ETFs in the news, Bitcoin Hyper stands to benefit from the growing interest in Bitcoin-related investments. The project’s alignment with the ongoing market trends makes it a prime candidate for those looking to invest in a project with both short-term potential and long-term growth. Invest in Bitcoin Hyper now for $0.013295 and don’t miss the 41% staking rewards. 2. Maxi Doge ($MAXI): The 1000X Leverage Lifestyle Token Forget the quiet, wholesome meme coins, Maxi Doge ($MAXI) is the crypto market’s new gym-bro degen mascot, embodying the relentless hustle and high-leverage energy of the bull market. $MAXI is not just a token; it’s a lifestyle rooted in green candles, gym reps, and the pursuit of maximal gains. This meme-powered coin provides more than hype. It features a live staking mechanism offering attractive APYs (currently 76%) to early investors, locking up supply and rewarding long-term conviction. Furthermore, the roadmap includes integration into futures trading platforms and weekly trading competitions, giving $MAXI a utility edge that elevates it above traditional meme coins. Sounds good and want in? Check out our ‘ How to Buy Maxi Doge ’ guide for all the details on getting started. With its presale raising over $4M, Maxi Doge is rallying a community ready to dominate the charts. It’s a high-octane blend of viral appeal and practical utility, built for traders who embrace the ‘never skip leg-day, never skip a pump’ mentality. Get your reps in $MAXI is set to pump! Buy $MAXI today for $0.0002685. 3. TRON ($TRX): The High-Speed Engine for Global Web3 Adoption TRON ($TRX) is the powerhouse layer-1 blockchain dedicated to building a truly decentralized internet. Born from the vision of empowering content creators and challenging centralized web monopolies, TRON has evolved into a global settlement layer known for its blazing speed and near-zero transaction fees. Leveraging a Delegated Proof-of-Stake (DPoS) consensus, the TRON network handles thousands of transactions per second, making it significantly faster and cheaper than many legacy blockchains. This performance has fueled its dominance in the global stablecoin market, hosting the largest circulating supply of $USDT, and making it the top choice for daily payments and remittances worldwide. $TRX is the fuel for this massive ecosystem, used for governance, staking, and interacting with thousands of dApps spanning DeFi, GameFi, and NFTs. By prioritizing accessibility and high throughput, TRON is actively bridging the gap between traditional finance and the decentralized web, welcoming the next billion users into the crypto space. Buy $TRX on major exchanges like Binance. Recap: As Bitcoin ETFs experience a dip, whales are stepping in, and now is the time to look for undervalued cryptos with high potential. Projects like Bitcoin Hyper , Maxi Doge , and TRON are well-positioned to capitalize on the market’s recovery, each offering unique opportunities for long-term growth. Remember, this isn’t intended as financial advice, and you should always do your own research before investing. Authored by Aaron Walker, NewsBTC — https://www.newsbtc.com/news/best-crypto-under-1-to-buy-now-as-whales-buy-bitcoin-etf-dip",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 51,
        "NAME": "TRX",
        "CATEGORY": "TRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54568474,
    "published": 1763465226000,
    "title": "Bitcoin Correction Mirrors April Drop As 2025 Buyers Fall Into The Red",
    "body": "Market drawdown pushes bitcoin below 2025 key cost basis levels.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Glassnode|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54570938,
    "published": 1763471362000,
    "title": "Fidelity Introduces FSOL ETF, Bringing Major Wall Street Name to Solana Funds",
    "body": "The firm’s staking-enabled Solana fund debuts as inflows into early SOL products accelerate.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Fidelity|ETFs|Solana News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54570867,
    "published": 1763471159000,
    "title": "Tether Invests in Ledn to Expand Bitcoin-Backed Lending Amid Surging Demand",
    "body": "The stablecoin issuer's investment comes as BTC-backed lending scales rapidly, with Ledn surpassing $1 billion in originations this year and positioning for global expansion.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Tether|Ledn|Lending|Crypto-Backed Lending|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54571205,
    "published": 1763471993000,
    "title": "How Pi Network’s 50M nodes could reshape the future of decentralized AI",
    "body": "Pi is turning its giant mobile community into a distributed compute grid, testing whether AI can run on a global crowd instead of the cloud.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54571616,
    "published": 1763473613000,
    "title": "Bitcoin Hashprice Falls to Five-Year Low",
    "body": "Falling revenue and record difficulty could tighten the squeeze on bitcoin miners, though many are more driven by their AI infrastructure initiatives.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Hash Power|Luxor & Hashrate Index|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54571896,
    "published": 1763474605000,
    "title": "Top Altcoins Heat Up as $BTC Trends Down – Bitcoin Hyper Could Pump Next",
    "body": "What to Know: The altcoin market is showing a distinct preference for projects with strong technological fundamentals and clear utility over purely speculative assets. Recent price predictions suggest a 300% pump for $SHIB if the token reaches two critical levels, which would set it up for an aggressive rally. Bitcoin Hyper introduces a Layer 2 solution that brings high-speed smart contracts to the Bitcoin ecosystem via a Solana Virtual Machine integration. The $HYPER presale raised over $27.8M so far with a token price of $0.013295 and staking rewards currently at 41%. The altcoin market is at a fascinating crossroads. While speculative assets have dominated cycles past, a clear trend toward utility is emerging. Investors are looking past fleeting hype, demanding projects with sustainable technology and real-world use cases. This shift in sentiment is reshaping the altcoin market outlook for 2025, forcing a re-evaluation of long-term value. Take top altcoins like Shiba Inu, for instance, which is currently at a crossroads, showing clear-cut signs of consolidation and momentum buildup. Trader’s expectation of a 300% $SHIB pump long-term is no longer unrealistic, provided $SHIB can hold two critical levels. Bitcoin, on the other hand, is currently at the opposite end of the spectrum, after crashing below $90K today. The reasons are multiple, from bulk whale sells to dwindling investor participation and increased fear. But there’s another problem worth talking about. Bitcoin, the original cryptocurrency, offers unparalleled security and trust but its slow transaction speeds, high fees, and lack of native smart contract capabilities, have hindered its investor appeal. Right now, Bitcoin ranks 30th in terms of TPS . A new contender, Bitcoin Hyper ($HYPER) aims to solve this trilemma directly. As the newest Bitcoin Layer 2 solution integrating the Solana Virtual Machine (SVM), Hyper promises to unlock Bitcoin’s dormant potential. By creating a high-speed execution layer on top of Bitcoin’s secure settlement, Bitcoin Hyper introduces the programmability and performance needed for modern dApps. This approach could fundamentally alter the competitive dynamics of the blockchain space, bringing high-performance applications to the industry’s most trusted network. Bitcoin Hyper Redefines Speed and Programmability Bitcoin Hyper ($HYPER) tackles Bitcoin’s core limitations head-on. Its modular architecture uses Bitcoin’s Layer 1 for ultimate security and settlement while a real-time SVM-based Layer 2 handles transaction execution. This allows for extremely low-latency processing and high-speed, low-cost transactions. The project’s decentralized Canonical Bridge facilitates seamless and secure cross-minting of $BTC into its L2 environment. By integrating the Solana Virtual Machine, Bitcoin Hyper brings fast, scalable smart contracts to the Bitcoin ecosystem. This move enables developers to build sophisticated DeFi applications, NFT platforms, and gaming dApps using familiar tools like the Rust programming language. This innovative approach is capturing significant attention. The ongoing presale for its native token, $HYPER, has already raised an impressive $27.8M+ at the time of writing, with $HYPER sitting at $0.013295. This strong demand signals major investor confidence in the project’s vision. If this type of hype continues, $HYPER could explode post release. Our price prediction for $HYPER , based on the project’s utility and community support, puts the token at $0.08625 by the end of 2026. In terms of ROI, we’re talking about potential profits of 548%. This is enough of an incentive for any crypto hunter looking for portfolio diversification. If this sounds like you, make sure you read our guide on how to buy $HYPER today. Check $HYPER’s live presale today. A New Ecosystem for DeFi, Gaming, and Payments The implications of bringing high-performance smart contracts to Bitcoin are massive. Bitcoin Hyper ($HYPER) unlocks a wide range of use cases previously impossible on the network, creating a new ecosystem for developers and users alike. Developers can build swaps, lending platforms, and staking protocols that leverage Bitcoin’s liquidity with the speed of an SVM chain. For everyday traders, use cases range from high-speed payments in wrapped $BTC with minimal fees to comprehensive DeFi protocols. With presale tokens currently priced at $0.013295, early participants are getting in at the ground floor – an opportunity which won’t last long anymore. The project has a projected release window between Q4 2025 and Q1 2026 so, if you want to invest, invest today. Secure your $HYPER today. This isn’t financial advice. DYOR and manage risks wisely before investing. Crypto is a high-risk market and presales have no success guarantee. Authored by Aaron Walker, NewsBTC: http://newsbtc.com/news/top-altcoins-optimistic-while-btc-crashes-bitcoin-hyper-next-outbreak",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 44,
        "NAME": "SHIB",
        "CATEGORY": "SHIB"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54571721,
    "published": 1763473696000,
    "title": "Crypto private key theft is now big business: Here’s what to know",
    "body": "Private key theft has become an automated, industrialized threat, highlighting the need for crypto users to remain vigilant, according to a report by GK8, a subsidiary of Galaxy Digital.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54572238,
    "published": 1763475704000,
    "title": "Stablecoins and “Skinny” Payment Accounts for Fintechs at the Fed",
    "body": "Skinny\" Payment Accounts for Fintechs at the Fed Will Support Stablecoin Issuance",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54572212,
    "published": 1763475593000,
    "title": "CoinDesk 20 Performance Update: Solana (SOL) Rises 5.8%, Leading Index Higher",
    "body": "Aptos (APT) was also a top performer, gaining 5.3% from Monday.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "CoinDesk Indices|CoinDesk Indices|CoinDesk 20|charts|Prices|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 70,
        "NAME": "APT",
        "CATEGORY": "APT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54573226,
    "published": 1763477487000,
    "title": "Cloudflare outage hits multiple crypto websites, social media channels",
    "body": "Many users reported not having access to websites, including Coinbase and Blockchain.com, and social media platforms after Cloudflare reported an “internal service degradation.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574036,
    "published": 1763478940000,
    "title": "Morning Minute: Aave Takes Aim at Banks, Fintechs with New Aave App",
    "body": "Aave's latest Neobank app will have TradFi sweating, with more yield and more insurance protection than ever offered before.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Opinion",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574300,
    "published": 1763496059000,
    "title": "HYPE Defies Market Carnage: Hyperliquid Price Rebounds After $96M Liquidation Shock",
    "body": "Hyperliquid’s native token, HYPE, is staging a surprisingly strong recovery just hours after the platform recorded one of the largest liquidation events in crypto history. Related Reading: 4 Bitcoin Indicators That Led To Market Rallies In The Last 2 Years Have Returned According to CoinGlass data, a massive $96.5 million BTC-USD perpetual contract liquidation hit Hyperliquid late Monday, part of a broader market washout that wiped out over 164,000 traders and triggered $814 million in total liquidations across exchanges. HYPE's price records some gains on the daily chart. Source: HYPEUSD on Tradingview Despite the carnage, Hyperliquid price has surged by 6% in the past 24 hours, climbing back above $41 on Tuesday and extending the rebound that began after defending the critical $36.51 support level last week. Whale Accumulation, Rising OI, and Strengthening On-Chain Metrics A wave of bullish catalysts is supporting the Hypeliquid price rebound. CryptoQuant data shows increasing whale activity, with large wallets steadily accumulating during recent dips. Exchange outflows have increased, active large addresses are expanding, and the average transaction size continues to rise. On the derivatives side, sentiment has clearly flipped. Coinglass reports that HYPE’s OI-weighted funding rate turned positive, hitting 0.026%, signaling that long traders are now paying shorts, an indication of bullish conviction. Open interest has also increased from $1.52B to $1.71B, indicating new capital entering the market and reinforcing upward momentum. Across pairs, HYPE is outperforming majors including BTC, ETH, SOL, and BNB, with analysts noting strong higher-lows structures developing on multiple charts. This relative strength suggests capital rotation is leaning toward Hyperliquid even as the broader crypto market cools. Technical Structure Points Hyperliquid Price Breakout Target at $48–$54 From a technical standpoint, the Hyperliquid price is consolidating within a symmetrical triangle, with the price being squeezed between rising support and descending resistance. Each compression cycle has produced higher lows, evidence that buyers are quietly gaining control. Momentum indicators echo this shift. The RSI has climbed to 48 and is turning upward toward neutral territory, while MACD histogram bars are shrinking, indicating fading bearish pressure. If the Hyperliquid price breaks above the $40–$41 diagonal resistance, analysts see a clear path toward the $44.48 zone. A confirmed breakout from the symmetrical triangle could then open the door to mid-range targets at $48 and $54, aligning with predictions from multiple market analysts tracking the ongoing consolidation. Related Reading: Bitcoin’s Drop Under $90K Sparks Bold Claims From Crypto Execs: ‘This Is A Generational Opportunity’ With whale accumulation rising, market structure tightening, and community sentiment firmly bullish, HYPE stands out as one of the few assets maintaining coordinated strength during a period of market-wide uncertainty. Cover image from ChatGPT, HYPEUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|Hype|HYPE price|Hype price anaysis|Hyperliquid|HYPEUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574299,
    "published": 1763494007000,
    "title": "Bitcoin ATM Company Founder Charged in Alleged $10 Million Money Laundering Scheme",
    "body": "Federal prosecutors in Chicago said the operator of a Bitcoin ATM network took in illicit funds and moved them through digital wallets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574298,
    "published": 1763492933000,
    "title": "Treasury Dept. Says Banks Can Keep Crypto On Their Balance Sheets in Certain Cases",
    "body": "National banks can now officially hold crypto to pay for network gas fees and engage in other crypto-related experiments, the OCC said Tuesday.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574293,
    "published": 1763492410000,
    "title": "Galaxy Digital Dumps 2,800 BTC as Bitcoin Crashes Below $90K",
    "body": "Bitcoin has officially slipped into dangerous territory after losing the $90,000 level for the first time since early spring, triggering widespread fear across the market. The drop has intensified concerns that BTC may be transitioning into a full bear market, as momentum weakens and buyers struggle to absorb the aggressive waves of sell pressure. Related Reading: Ethereum Approaches Historical Accumulation Level – Just 8% Away From LTH Cost Basis According to top analyst Darkfost, one of the driving forces behind the latest downturn is persistent selling from major institutional players. Data shows that Galaxy Digital has been offloading significant amounts of BTC. This steady stream of institutional selling has added weight to an already fragile market structure, likely accelerating last night’s drop. While sentiment is undeniably fearful, the combination of forced liquidations, institutional selling, and panic-driven exits may be creating the final stage of a broader reset — one that historically precedes major cycle reversals. Galaxy Digital’s Selling Accelerates Market Downside Darkfost reports that Galaxy Digital has been exceptionally active over the past several hours, adding considerable pressure to an already fragile Bitcoin market. According to the data, the firm moved more than 2,800 BTC, a sizeable amount given the current environment of fear and declining liquidity. A particularly notable portion of this activity is the 1,474 BTC transferred to Coinbase Prime, equivalent to roughly $135 million at recent prices. Such large inflows to an institutional exchange are typically interpreted as preparation to sell, and this wave of supply appears to have coincided with Bitcoin’s accelerated move below the $90,000 level. This type of selling activity from a major player like Galaxy Digital carries significant market implications. When large, sophisticated entities reduce exposure during a period of heightened volatility, it often intensifies fear among retail traders and shorter-term participants. The timing of these transfers — occurring as Bitcoin was already slipping through critical support zones — likely amplified the downside impact, contributing to the sharp overnight drop. However, while the immediate effect is clearly negative, analysts like Darkfost emphasize that such phases of heavy selling and forced repositioning are also characteristic of late-stage corrections. Once large sellers finish distributing, markets often stabilize and rebuild from stronger hands. Related Reading: $14B In Stablecoins Minted Since October Crash: Liquidity Returning To Crypto BTC Price Analysis: Testing Key MA as Fear Peaks Bitcoin’s price action on the 3-day chart shows a decisive breakdown, with BTC now trading around $90,400, sitting directly on top of the 200 moving average (red line) — a level that has historically acted as a final line of defense during major corrections. The rejection from the $110K–$115K zone triggered a cascade of lower highs, shifting market structure firmly into a short-term downtrend. Momentum has deteriorated quickly, and the clean break below both the 20-day (blue) and 50-day (green) moving averages confirms bearish control. Related Reading: Massive Bitcoin Bid Walls Spotted On Binance: Bulls Step In With 2,800 BTC Cluster Volume has spiked noticeably during the most recent candles, indicating forced selling and liquidation-driven moves rather than organic distribution. This aligns with the broader fear-driven environment and recent data showing large entities, including Galaxy Digital, offloading significant amounts of BTC. The high-volume flush suggests capitulation behavior, especially as Bitcoin revisits levels not tested since early 2025. If buyers defend this level and the price stabilizes, it could mark the beginning of a base formation. However, a clean breakdown below the 200 MA would expose the next major support near $82K–$85K, signaling deeper downside risk. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|Bitcoin breakdown|Bitcoin Galaxy Digital|Bitcoin news|Bitcoin Selling|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574255,
    "published": 1763490972000,
    "title": "Canada Approves Budget That Advances Policy for Stablecoins",
    "body": "The Canadian government narrowly won favor in Parliament for its budget push that includes a new policy governing stablecoins.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Canada|Bank of Canada|Stablecoins|Regulation|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 54574297,
    "published": 1763490601000,
    "title": "Crypto Selloff, REKT Dip, Monad Launch, & DAT trades!",
    "body": "Crypto majors are very red as btc briefly fell below $90k; btc -4% at $91,300; eth -5% at $3,050, bnb -2% at $915, sol -3% at $137. Icp (+9%), aster (+7%) and hype (+5%) led top movers. Crypto fear & greed remained in extreme fear at 11, now in that range for 6 straight days. Bitcoin wiped out its 2025 gains after falling below $92k (briefly sub-$90k), now down 2% on the ytd. The cboe unveiled “continuous” bitcoin and ethereum futures with 10-year terms as a perps-like alternative. The white house is considering to allow the irs to track and tax crypto holdings on foreign exchanges. Vitalik buterin and the ethereum foundation launched kohaku as a new initiative to bake privacy and security into ethereum wallets instead of treating them as add-ons. Trump international maldives announced tokenized real-estate stakes, letting investors buy blockchain-based shares in its 80-villa luxury resort. Hive stock jumped after posting record q2 revenue and landing new ai-infra deals, as investors rotated into miners despite broader crypto weakness. Japan is changing its crypto tax rules, dropping cap gains from 55% to 20%. Coinbase ventures announced an investment in usd ai.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574254,
    "published": 1763489882000,
    "title": "Chainlink's LINK Bounces 4% to Near $14 as Cryptos Rebound",
    "body": "LINK could target $14.50 if momentum sustains, CoinDesk Research's analysis tool suggested.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Chainlink|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574251,
    "published": 1763489751000,
    "title": "Bitcoin Backwardation Returns, a Pattern That Often Marks Market Bottoms",
    "body": "Futures prices for BTC are trading below spot prices, signaling \"extreme fear,\" which can sometimes be read as a contrarian buy signal.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Backwardation|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574249,
    "published": 1763489666000,
    "title": "Sen. Warren Keeps Pressure on Trump Crypto Ties as Market Structure Bill Negotiated",
    "body": "Senator Elizabeth Warren is maintaining political heat on President Trump's World Liberty Financial business interests in a letter to the Treasury and DOJ.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Elizabeth Warren|Jack Reed|Donald Trump|World Liberty Financial|crypto legislation|U.S. Senate|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574294,
    "published": 1763487656000,
    "title": "BTC Dipped to $90K! BTC wipes out 2025 Gains! Monad CoFounder Interview!",
    "body": "Crypto majors are very red as btc briefly fell below $90k; btc -4% at $91,300; eth -5% at $3,050, bnb -2% at $915, sol -3% at $137. Icp (+9%), aster (+7%) and hype (+5%) led top movers. Crypto fear & greed remained in extreme fear at 11, now in that range for 6 straight days. Bitcoin wiped out its 2025 gains after falling below $92k (briefly sub-$90k), now down 2% on the ytd. The cboe unveiled “continuous” bitcoin and ethereum futures with 10-year terms as a perps-like alternative. The white house is considering to allow the irs to track and tax crypto holdings on foreign exchanges. Vitalik buterin and the ethereum foundation launched kohaku as a new initiative to bake privacy and security into ethereum wallets instead of treating them as add-ons. Trump international maldives announced tokenized real-estate stakes, letting investors buy blockchain-based shares in its 80-villa luxury resort. Hive stock jumped after posting record q2 revenue and landing new ai-infra deals, as investors rotated into miners despite broader crypto weakness. Japan is changing its crypto tax rules, dropping cap gains from 55% to 20%. Coinbase ventures announced an investment in usd ai.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574291,
    "published": 1763487059000,
    "title": "Model Shows How XRP Could Hit $24 After ETFs Go Live",
    "body": "A new pricing model from Diana, a crypto analyst on X, projects that XRP could climb into the $7–$24 range within 60 days of the ETF launch, driven strictly by inflow pressure and the asset’s constrained liquid supply. The model reportedly relies on supply-absorption math, revealing how ETF-driven demand could shift XRP’s market pricing once XRP ETFs go live. New XRP ETF Inflow Model Maps A Direct Route To $24 Diana’s newly released “XRP ETF Launch Impact Model” outlines a clear, data-driven view on how ETF inflows alone could reprice XRP. Her framework tests multiple launch scenarios involving five to twenty ETFs, each seeded with $10 million to $45 million. Depending on the scale, total inflows range from $50 million to $900 million, absorbing between 0.08% and 1.50% of XRP’s estimated 60-billion-unit liquid supply. Related Reading: Here’s Why The Ethereum Price Is Crashing Again, Can It Breach $3,000? According to Diana’s projections, this level of liquidity absorption pushes XRP into a thirty-day range of $3.00 to $15.00, with the sixty-day window stretching from $3.80 up to $24.00. The top end of the model—where XRP approaches $24—emerges when twenty ETFs launch with maximum seed capital and nearly a billion dollars in early inflows. Diana argues that as issuers acquire XRP to build underlying exposure, the available float tightens, and the resulting supply squeeze forces a natural repricing cycle. However, XRP’s real-time price action tells a different story. Despite the successful debut of the Canary XRP ETF, XRP has failed to respond positively. The latest market data shows the asset trading near $2.14, posting a 13.5% decline over the week. Even so, Diana maintains that early price weakness is typical during ETF rollout phases and believes the projected inflow dynamics still position XRP for a sharp upward revaluation once institutional allocations begin to materialize. The Market Structure Delaying XRP’s Next Major Rally In a separate post, Diana outlined the market pattern she believes has been driving XRP’s recent price behavior. According to her, traders typically buy ahead of an ETF launch to front-run expected demand, creating a pre-launch rally driven by speculation rather than institutional activity. Once the ETF goes live, those early buyers take profit, producing the sharp launch-day dip that often surprises retail investors. Related Reading: What Will Trigger The XRP 1,300% Break To $36 This Bull Cycle? Diana noted that institutional inflows never arrive on day one. Wealth managers move through compliance checks, committee approvals, and allocation cycles, meaning real capital enters the market weeks later. She pointed to Bitcoin’s January 2024 ETF rollout as the clearest example, where the asset fell at launch but later surged to new highs as regulated inflows matured. She argues that XRP is showing the same early-stage pattern now: a weak market following the Canary ETF launch, profit-taking, and a temporary cooling phase. When these delayed inflows eventually begin to accumulate, Diana maintains that they will reinforce an upward pricing dynamic for XRP’s next major climb. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Ripple|ripple news|xrp|XRP ETF|XRP ETF News|XRP ETFs|XRP ETFs news|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574292,
    "published": 1763485262000,
    "title": "Prediction Market Myriad Partners With Walrus Decentralized Data Storage Layer",
    "body": "The partnership will see Myriad media stored on the developer platform, creating an immutable record with applications in DeFi and AI.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Our Company",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54574245,
    "published": 1763484135000,
    "title": "Bitcoin Gains Tuesday as Traditional Markets Slump in Rare Occurrence of Crypto Outperformance",
    "body": "After plunging below $90,000 overnight, BTC has regained the $93,000 level in U.S. morning action.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Breaking News|Market Wrap|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574243,
    "published": 1763483910000,
    "title": "U.S. Regulator OCC Clarifies How Banks Can Handle Network 'Gas Fees'",
    "body": "The U.S. Office of the Comptroller of the Currency explained to the national banks it oversees how they can hold crypto for paying gas fees.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Office of the Comptroller of the Currency|gas fees|crypto banking|Regulation|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574241,
    "published": 1763483156000,
    "title": "Société Générale’s SG-FORGE Issues First Tokenized Bond in U.S.",
    "body": "The bond uses Broadridge Financial Solutions' tokenization technology and runs on the Canton Network, a privacy-enabled blockchain infrastructure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Société Générale|Bond Markets|Tokenization|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      }
    ]
  },
  {
    "id": 54574239,
    "published": 1763482193000,
    "title": "Bitcoin Sell-Off Likely 'Complete', Rally Into Year-End Still in Play: StanChart Analyst",
    "body": "Standard Chartered’s Geoffrey Kendrick says bitcoin’s steep decline is part of a recurring pattern, with a rebound into year-end in his base case.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Standard Chartered Bank|MicroStrategy|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574286,
    "published": 1763481662000,
    "title": "European Bank Revolut Taps Ethereum Network Polygon for Remittances, Stablecoin Payments",
    "body": "Revolut is teaming with Ethereum scaling network Polygon to power crypto remittances and stablecoin payments.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "matic-network|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 38,
        "NAME": "MATIC",
        "CATEGORY": "MATIC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574289,
    "published": 1763481625000,
    "title": "With 42% Of XRP Holders Underwater, Analysts Say The Altcoin Could Crash Even Further",
    "body": "According to on-chain data and market reports, XRP is under fresh selling pressure because a large share of holders are now showing losses. Related Reading: Kiyosaki Stands His Ground—No Selling, More Bitcoin Buys Ahead Glassnode reports that 41.5% of XRP supply — or close to 27 billion tokens — sits in loss, the lowest profitability level since November 2024 when XRP traded near $0.53. At today’s levels, about four times higher than that November figure, a big share of holders bought above current prices and are now exposed. Holder Concentration Raises Selling Risk Market analysts say this positioning has changed trader behavior. Tony Sycamore, a market analyst at IG Australia, disclosed that many wallets likely picked up XRP when it was above $3.00 during months including January, July, August, September, and early October. That means a sizable group is now holding paper losses after the 40%+ slide from the July $3.65 peak. The scale of unrealized losses can encourage some investors to exit if prices keep drifting lower, which would add selling pressure. The share of XRP supply in profit has fallen to 58.5%, the lowest since Nov 2024, when price was $0.53. Today, despite trading ~4× higher ($2.15), 41.5% of supply (~26.5B XRP) sits in loss — a clear sign of a top-heavy and structurally fragile market dominated by late buyers. 📉… https://t.co/CBXPzDalxV pic.twitter.com/UpLNKV7LqD — glassnode (@glassnode) November 17, 2025 ETFs Could Bring Fresh Demand Or Little Impact Reports have disclosed a wave of exchange-traded funds tied to XRP that may alter flows. Canary Capital launched the first spot-XRP ETF on November 13 and posted the strongest first-day result for US ETFs in 2025. Franklin Templeton’s EZRP is scheduled to begin trading on November 18, with funds from Bitwise, 21Shares and CoinShares close behind. Traders hope these products will attract new money into XRP, but history shows initial demand can vary widely and depends on broader market liquidity and risk appetite. Key Foothold At the time of reporting, XRP trades around $2.19, down more than 10% in the last seven days. Analysts are watching the $2.16 area as a key foothold. 💥 JUST IN: FRANKLIN TEMPLETON’S SPOT $XRP ETF (EZRP) LAUNCHES TOMORROW. BULLISH 🚀 pic.twitter.com/rmGN1rdVGI — Amonyx (@amonbuy) November 17, 2025 If that level is defended, a bounce toward the $2.35–$2.60 band could be possible. If it fails, further retracement towards lower levels is a realistic outcome, in particular with a large portion of holders underwater and stop orders possibly clustered beneath current support. On-Chain Signals Paint A Top-Heavy Picture According to data from blockchain trackers, the market looks “top-heavy,” meaning that many of those who entered recently paid high prices for their coins and are thus more vulnerable. That pattern often makes rallies less stable until profit-taking pressure eases or fresh buyers step in. Related Reading: From Dotcom To Crypto: Veteran Analyst Says The Bull Run Isn’t Over At the same time, activity on the XRP Ledger has been rising, and renewed clarity around rules for digital assets in some jurisdictions has helped sentiment a bit. In the near term, price action will likely correlate with ETF inflows and whether buyers can defend the $2.15 level. A clear break above $2.60 could relieve selling pressure, while a break below support might trigger further selling by holders trying to limit losses. For now, XRP is stuck in a battle between the pressure of unrealized losses and new potential flows of capital from ETFs. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|altcoins|bitcoin|crypto|etf|xrp|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574233,
    "published": 1763481600000,
    "title": "Obex Raises $37M to Build 'Y Combinator' for RWA-Backed Stablecoins, Led by Framework, Sky",
    "body": "The incubator aims to fund stablecoin projects backed by compute, energy and fintech credit using Sky's up to $2.5 billion commitment, Framework Ventures' Vance Spencer said in an interview.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Stablecoin|Framework Ventures|MakerDAO|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 40,
        "NAME": "MKR",
        "CATEGORY": "MKR"
      }
    ]
  },
  {
    "id": 54574284,
    "published": 1763481521000,
    "title": "New Wave of Solana ETFs Hits the Markets as Fidelity, Canary, and VanEck Roll Out",
    "body": "Several Solana ETFs are launching across U.S. exchanges this week as asset managers test demand for products tied to altcoins and staking.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574283,
    "published": 1763465248000,
    "title": "How Tom Lee is Preparing For Ethereum’s Future",
    "body": "Fundstrat Global Advisors’ Head of Research Tom Lee, who is chairman of BitMine Immersion Technologies, shares his perspective on Ethereum. He explains how the asset is being leveraged by crypto treasury firms, as well as a growing number of financial institutions.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574593,
    "published": 1763496202000,
    "title": "Paxos debuts USDG0 to extend its regulated stablecoin across multiple blockchains",
    "body": "The new omnichain token brings fully backed dollar liquidity to Hyperliquid, Plume and Aptos while keeping a single regulated supply across networks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 70,
        "NAME": "APT",
        "CATEGORY": "APT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574379,
    "published": 1763494200000,
    "title": "Bitcoin charts flag $75K bottom, but analysts predict 40% rally before 2025 ends",
    "body": "Bitcoin whales are accelerating their purchasing despite BTC’s short-term bearish outlook. Meanwhile, Wall Street analysts expect BTC to hit new all-time highs before the end of 2025.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574377,
    "published": 1763493326000,
    "title": "Regulator clarifies US banks can handle gas fees using crypto holdings",
    "body": "The OCC said authorized national banks could hold crypto under specific circumstances, citing examples under the recently passed GENIUS act.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574371,
    "published": 1763486100000,
    "title": "Stablecoin giant Tether backs Ledn, targets global crypto lending",
    "body": "The investment from the stablecoin giant coincides with accelerating institutional interest and Wall Street participation in the crypto-backed loans sector.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574368,
    "published": 1763485200000,
    "title": "'Crypto Winter Is Here' — Mark Yusko Explains What May Come Next",
    "body": "In a recent Cointelegraph interview, Mark Yusko outlined the indicators pointing to a Bitcoin bear market and the forces shaping the road ahead.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54574366,
    "published": 1763480741000,
    "title": "Institutions lean into crypto despite Bitcoin price slump",
    "body": "Institutions across the globe are adopting cryptocurrency, offering new services and buying into blockchain tech, despite slumping Bitcoin price.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54576535,
    "published": 1763499631000,
    "title": "Forget XRP, DFDV Exec Predicts Solana Price Is Headed For $10,000",
    "body": "A senior executive at DeFi Development Corp. (DFDV) has delivered one of the most aggressive long-term forecasts for the Solana price yet. According to him, Solana could see its value catapult to $10,000, leaving much of the market in the dust. This outlook, shaped by recent market turbulence and years of crypto experience, has drawn attention from industry experts as the DFDV executive outlines how SOL can reach this target by capturing a significant share of the global digital value. Solana Price To Reach $10,000 In 10 Years DFDV COO and CIO Parker White recently shared his long-term thesis on Solana following a rough week for risk assets in the market. White argued that Solana is poised for significant growth over the next decade, as digital value transfer becomes a core pillar of the global economy. Related Reading: Institutions Have Been Buying Solana Every Day For 2 Weeks, Is $300 Possible? In his view, the pressures of the past week only strengthen the case for Solana’s explosive upside potential. He emphasized that SOL is ideally positioned to capture an outsized portion of the global digital value, which he believes could propel the altcoin’s price toward the $10,000 mark. With SOL currently trading at $137 after declining by more than 25% in the past month, a surge to $10,000 would represent a massive gain of over 7,000%. As a Solana-focused treasury company, DFDV offers a different path of exposure. White has explained that he prefers building his position through the firm rather than purchasing SOL or a Solana ETF. He described the structure of DFDV as a Digital Asset Trust (DAT) controlled by him and a group of long-time colleagues, who collectively own more than 20% of the common stock. Furthermore, he stated that this concentrated level of ownership enables DFDV to aggressively grow its Solana per share much faster than a passive ETF could achieve. Responding to a comment questioning the purpose of such a structure, White emphasized that DFDV’s performance has already outpaced ETF alternatives. He pointed to a 32% annualized increase in Solana per share over the past three months, after accounting for operating costs, compared to the roughly 6% growth provided by ETFs after fees. For him, the long-term bet rests on achieving one SPS by late 2028—a milestone he believes could generate substantial wealth for both executives and token holders willing to endure ensuing market volatility. Why Volatility Is Central To DFDV’s Long-Term Outlook White made it clear in his X post that volatility is not a threat to DFDV’s model but a necessary factor. He highlighted that between now and 2028, he expects maximum volatility to flood the Solana market. He described DFDV as a volatility reactor designed to convert extreme market swings into long-term shareholder value, insisting that the firm can generate gains in both upward and downward market conditions. Related Reading: Solana To Dethrone Bitcoin And Ethereum? Here’s How The First SOL ETFs Are Faring For short-term traders, White advises that sharp price swings may provide opportunities to profit from rapid movements in SOL. He also stressed that long-term investors should prioritize accumulating and holding their investments, even during periods of high volatility. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Solana|DAT|DeFi Development Corp|DFDV|Digital Asset Trust|Parker White|Sol|SOL news|SOL Price|Solana ETF|Solana news|Solana Price|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54576295,
    "published": 1763499152000,
    "title": "Hawk Tuah Girl Added to Solana Meme Coin Lawsuit—After She Cooperated With Law Firm",
    "body": "After initially being left out, Haliey “Hawk Tuah” Welch has been named in a class action suit against the creators of the meme coin she promoted.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54576294,
    "published": 1763499151000,
    "title": "Man Who Went By 'Shrek' Pleads Guilty to Helping Steal $263 Million in Crypto",
    "body": "Authorities say stolen money was spent on luxury goods and exotic cars.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54577823,
    "published": 1763501689000,
    "title": "'Permissionless Assets’: Robinhood’s 3-Phase Tokenization Plan to Disrupt TradFi",
    "body": "Robinhood is working on infrastructure developments, said Offchain Labs' A.J. Warner, including 24/7 trading, and leveraging technologies like Arbitrum Stylus for compatibility.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Robinhood|Offchain labs|TradFi|Exclusive|Tokenization|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 71,
        "NAME": "ARB",
        "CATEGORY": "ARB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54577801,
    "published": 1763501510000,
    "title": "New Toku–PDAX partnership lets Filipino workers receive pay in stablecoins",
    "body": "The integration links token-based payroll with regulated cash-out rails, giving Filipino workers a way to receive stablecoin wages and convert them instantly to pesos.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54578772,
    "published": 1763503212000,
    "title": "XRP Supply In Profit Falls to 58.5% – Lowest Since 2024 Despite Higher Price",
    "body": "XRP is facing one of its most challenging moments in recent months as selling pressure accelerates and the broader crypto market slips into a risk-off environment. Bitcoin’s collapse below key psychological levels has dragged altcoins with it, and XRP has not been spared. Analysts are increasingly warning that the market may be entering a bear phase, pointing to tightening liquidity conditions, rising global economic uncertainty, and a sharp decline in investor appetite for risk assets. Related Reading: Ethereum Approaches Historical Accumulation Level – Just 8% Away From LTH Cost Basis What makes XRP’s situation more fragile is the growing number of holders sitting on unrealized losses. On-chain data reveals that many late buyers — particularly those who entered after the ETF announcement and during the previous rally — are now underwater as the price continues to slide. This top-heavy market structure is creating pressure on holders, amplifying sell-side momentum as fear spreads. The macro backdrop is adding fuel to the fire. With global markets adjusting to rate volatility, geopolitical tensions, and tightening dollar liquidity, capital is flowing out of speculative assets. XRP’s price is now caught at a crossroads: either it stabilizes at key support zones and absorbs the panic selling, or a deeper correction unfolds. XRP Supply in Profit Signals Structural Fragility According to new data from Glassnode, XRP’s market structure is weakening significantly as the latest sell-off unfolds. The share of XRP supply currently in profit has fallen to 58.5%, marking its lowest reading since November 2024, when XRP traded at just $0.53. Despite today’s far higher price — around $2.15, nearly four times last year’s level — an alarming 41.5% of the circulating supply remains at a loss. That represents roughly 26.5 billion XRP sitting underwater. This divergence highlights a critical issue: the market has become top-heavy, dominated by investors who entered late into the rally and bought at elevated price levels. These holders are now feeling acute pressure as prices retrace. Making the XRP supply distribution more fragile and increasing the probability of panic-driven selling. Historically, such setups often lead to accelerated downside movement unless strong demand steps in. The fact that so much supply is in the red even at current elevated prices suggests that speculative flows, rather than long-term conviction, fueled the previous surge. As these late buyers face losses, sell pressure can intensify, feeding into a vicious cycle of liquidation. Related Reading: $14B In Stablecoins Minted Since October Crash: Liquidity Returning To Crypto XRP Price Analysis: Testing Critical Support Levels XRP continues to struggle as selling pressure intensifies, with the chart showing a clear downtrend forming since early October. The price is now trading around $2.18, hovering just above a key horizontal support zone that has been tested multiple times throughout the year. Each bounce from this region has grown weaker, suggesting diminishing buyer strength and rising vulnerability to a deeper breakdown. The moving averages reinforce this weakening structure. XRP is trading below the 50-day, 100-day, and 200-day MAs, with all three beginning to curl downward. A classic sign of trend deterioration. The failed attempt to reclaim the 50-day MA in early November marked a significant shift, as sellers quickly regained control and pushed the price lower. Volume spikes during downswings further confirm that distribution is ongoing. Related Reading: Ethereum Whale Expands Position By 36,437 ETH – Bringing Total To $1.34B Additionally, the lower highs forming since the September peak signal that bulls are losing momentum. Each rally attempt is being sold into faster, and the wick rejections near the $2.50–$2.60 region highlight strong overhead resistance. If XRP loses the current support band, the next liquidity pocket sits near $1.70–$1.80, where buyers previously defended aggressively. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|xrp|XRP analysis|XRP Correction|xrp news|XRP Price|XRP supply|XRP Supply In Profit|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54578755,
    "published": 1763503131000,
    "title": "3 SOL data points suggest $130 was the bottom: Is it time for a return to range highs?",
    "body": "Charts and onchain data suggest that SOL might have bottomed at $130. Should traders anticipate a rally back to $200?",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54578893,
    "published": 1763503239000,
    "title": "When a Digital Dollar Isn’t Worth a Dollar Anymore Again",
    "body": "Muyao Shenwrites on how some of the initial damage from the tumble in crypto prices was first seen in the often opaque world of decentralized finance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54579888,
    "published": 1763504839000,
    "title": "Crypto Exchange Kraken Raises $800 Million at a $20 Billion Valuation",
    "body": "Kraken just raised $800 million, including $200 million from Ken Griffin’s Citadel Securities, ahead of a potential IPO.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54581060,
    "published": 1763506804000,
    "title": "Cardano on the Edge: Whale Loss Sparks Sell-Off as ADA Risks Drop to $0.43–$0.30 Range",
    "body": "Cardano (ADA) is once again under heavy market pressure after a series of whale-driven shocks and broken support levels sent the asset spiraling toward multi-month lows. Related Reading: Why Is Bitcoin Price Crashing? Arthur Hayes Isn’t Surprised Trading around $0.46–$0.49, ADA has slipped beneath several key zones that protected the price structure throughout 2024 and early 2025. Analysts now warn that the sell-off could deepen toward the $0.43 – $0.30 range if downward momentum continues. ADA's price trends to the downside on the daily chart. Source: ADAUSD on Tradingview ADA Slides as Whale Loss and Support Break Intensify Selling Pressure Much of the latest volatility stems from a dramatic whale incident. A dormant wallet holding 14.45 million ADA, inactive for five years, executed a swap into USDA, a pool so thin that the wallet absorbed devastating slippage. The whale walked away with only $847,000, realizing a staggering $6.2 million loss. The market’s response was immediate, confidence cracked, liquidity thinned, and sellers accelerated their exit. On-chain data shows broader whale activity amplifying the impact. More than 440 million ADA has been offloaded by large holders over the last month, further weakening the structure. ADA’s breakdown below $0.52, a level untouched since 2024, confirmed a bearish market regime dominated by lower highs, lower lows, and widening volatility bands. Technical Outlook Points Toward $0.43… or Even $0.30 Traders monitoring ADA’s trajectory highlight a crucial zone at $0.43, a technical target that aligns with the expanding bearish momentum reflected in indicators such as the MACD, RSI, and Bollinger Bands. The MACD’s deepening bearish crossover signals intensifying sell pressure, while the RSI hovering near oversold territory around 37 suggests weakness without confirming a recovery. Market analysts like Ali Martinez and Mr. Brownstone warn that failure to reclaim broken levels could expose ADA to a broader decline. Martinez identifies $0.30 as a long-term structural support, a cycle reset area that historically attracts accumulation during deep corrections. Analysts note that while capitulation metrics such as MVRV point to undervaluation, they do not eliminate the risk of further downside before any recovery materializes. Midnight’s NIGHT Token Launch Could Shift Sentiment, but Uncertainty Remains Even as ADA struggles, Cardano’s broader ecosystem is gearing up for a major milestone: the launch of Midnight’s NIGHT token on December 8, 2025. Midnight introduces privacy-focused smart contracts with selective disclosure, aiming to balance confidentiality with regulatory compliance. Analysts believe the NIGHT rollout could eventually inject positive momentum if adoption accelerates. Still, traders caution that ADA’s immediate outlook remains tied to technical fragility, liquidity challenges, and overall market sentiment. Related Reading: Dogecoin Cup And Handle Pattern Is Returning, What Happens To Price If It’s Completed? For now, ADA sits on a razor’s edge, stabilizing near support, but vulnerable to a deeper drop toward $0.43 and potentially $0.30 if sellers keep control. Cover image from ChatGPT, ADAUSD chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cardano|ADA|ADA price|adausd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54580991,
    "published": 1763506705000,
    "title": "Kraken Scores $800M Raise Backed by $200M Citadel Investment",
    "body": "The funding, which values Kraken at $20B, accelerates plans to integrate traditional markets with crypto infrastructure across multiple regions.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Kraken|Citadel Securities|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54581218,
    "published": 1763506800000,
    "title": "Bitcoin recovery expected as liquidity conditions change, but US macro remains a threat",
    "body": "Bitcoin’s recent weakness reflects broader economic stress, but improving liquidity and investors’ positive outlook for 2026 could set the stage for a strong rebound.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54584309,
    "published": 1763512093000,
    "title": "Trump Congressional Ally Discloses Latest Six-Figure Bitcoin Purchase",
    "body": "Brandon Gill has purchased up to $2.6 million in Bitcoin this year, according to House transaction reports.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54584144,
    "published": 1763511584000,
    "title": "Bitfury pivots to launch $1B tech fund after 14 years of mining Bitcoin",
    "body": "Bitcoin miner Bitfury started up in 2011, but has now pivoted to tech investing and will pour $1 billion into ethical AI and crypto startups.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54587469,
    "published": 1763517633000,
    "title": "XRP, Bitcoin Now In “Good Buy Zone,” Says Analytics Firm",
    "body": "On-chain analytics firm Santiment has revealed how Bitcoin, XRP, and other cryptocurrencies have dropped into a “buy zone” on a popular metric. MVRV Ratio Shows High Degree Of Short-Term Pain In Bitcoin & Altcoins In a new post on X, Santiment has discussed how the various assets in the cryptocurrency sector are looking based on the 30-day MVRV Ratio. The Market Value to Realized Value (MVRV) Ratio is an on-chain indicator that measures the ratio between the market cap and Realized Cap for a given coin. Related Reading: Bitcoin SSR Flashes Buy Signal: Rebound Incoming? The Realized Cap here refers to a capitalization model that calculates the asset’s total value by assuming the value of each individual token is equal to the price at which it was last transacted on the blockchain. In short, what this model captures is an estimation for the amount of capital that BTC investors as a whole have invested into the cryptocurrency. The usual market cap, on the other hand, represents the amount holders are carrying today. When the value of the MVRV Ratio is greater than 1, it means the market cap is greater than the Realized Cap. In other words, the overall network is in a state of profit. On the other hand, an indicator below this threshold implies the dominance of losses among investors. In the context of the current topic, the version of the MVRV Ratio that’s of interest is the 30-day one, tracking the profit-loss balance of the traders who purchased their coins within the past month. Below is the chart for the metric shared by Santiment that shows the trend in its value for five major cryptocurrencies: Bitcoin, XRP, Ethereum, Chainlink, and Cardano: As is visible in the graph, the 30-day MVRV Ratio has witnessed a plunge recently as the sector has gone through a bearish shift. Recent Bitcoin buyers are now about 11.5% underwater, while XRP ones are around 10.2%. Both of these are beyond the threshold that the analytics firm classifies as the boundary for a “good buy zone.” The 30-day investors have suffered even worse losses in the case of Ethereum, Cardano, and Chainlink, being down 15.4%, 19.7%, and 16.8%, respectively. All of these fall inside Santiment’s “extreme buy zone.” “In a zero sum game, buy assets when average trade returns of your peers are in extreme negatives,” noted the analytics firm. “The lower MVRV’s go, the higher the probability is of a rapid recovery.” Related Reading: Bitcoin Social Dominance Hits 4-Month High: What It Means It now remains to be seen whether market pain has been enough for XRP and others to cause a market rebound, or if more drawdown is coming. XRP Price At the time of writing, XRP is floating around $2.18, down more than 11% over the last week. Featured image from Dall-E, Santiment.net, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|bitcoin|Bitcoin MVRV|btc|xrp|XRP MVRV|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54588301,
    "published": 1763518983000,
    "title": "Canaan stock surges as Q3 revenue doubles on Bitcoin miner demand",
    "body": "Shares in Canaan jumped 20% on Tuesday as the Bitcoin mining hardware maker reported its third-quarter revenues doubled from last year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54588983,
    "published": 1763520094000,
    "title": "Kraken bags $800M for expansion plans at $20B valuation",
    "body": "Crypto exchange Kraken has raised $800 million across two funding rounds, which boosted its valuation to $20 billion.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54591589,
    "published": 1763524823000,
    "title": "Ethereum Price Will Bottom This Week, Predicts Tom Lee",
    "body": "Fundstrat co-founder Tom Lee says Ethereum is nearing a cyclical low, arguing that on-chain fundamentals and relative valuation versus Bitcoin indicate that ETH is “pretty close to bottoming this week.” “Personally, I think that we’re pretty close to bottoming this week,” Lee told CNBC, linking the current drawdown to a broader crypto correction that began after a sharp liquidation event on October 10. Despite that shock, he insisted that Ethereum’s core investment story remains intact. Will Ethereum Bottom This Week? For Lee, that story centers on Ethereum as neutral infrastructure for tokenization and stablecoins, increasingly relevant as Wall Street intensifies its on-chain ambitions. “There are stablecoin creations. Larry Fink and BlackRock and Wall Street want to tokenize assets, bring stocks, bonds, real estate onto the blockchain. And they have to find a neutral 100% uptime blockchain. That’s Ethereum. And that’s the fundamental story,” he said. Related Reading: Ethereum Approaches Historical Accumulation Level – Just 8% Away From LTH Cost Basis Lee framed crypto’s extreme volatility as structurally tied to how the market values long-term innovation rather than as a sign of fundamental weakness. “The price, of course, for Ethereum will fluctuate because crypto is hyper volatile. In fact, it’s kind of a… it’s sort of a feature of the blockchain itself,” he noted. “Crypto suffered from that liquidation event on October 10th, but because the fundamental story is intact and crypto discounts the future, that’s why it’s volatile, but it still looks pretty attractive here.” He placed the current move in the context of a broader risk-off environment and a continuing correction across digital assets. According to Lee, macro data remains a crucial driver of crypto cycles, particularly for Bitcoin. “The most correlated factor to Bitcoin prices when you see it… at a peak actually is the ISM,” he said, referring to US activity surveys. “So I think we’re still in a correction phase of crypto.” Asked specifically what underpins his bullish view on Ethereum now, Lee pointed to two structural “floor” mechanisms. First, he cited the value of assets locked on the Ethereum blockchain. “Ethereum kind of has several ways that it establishes a floor. One is the value of all the assets locked onto the blockchain, and that number is growing,” he said. “Historically, Ethereum bottoms when that ratio is about 50%. So I’d say we’re pretty close to that level. That’s why I think Ethereum is probably bottoming this week.” Related Reading: Ethereum Flashes Rare Oversold Signal As Price Hits Demand Zone — Major Rebound Loading? Second, he highlighted Ethereum’s valuation relative to Bitcoin, using both price and network value. “The other way to look at Ethereum is really its price ratio or even its network value ratio to Bitcoin. It currently sits at 0.032,” Lee said. “The long-term average, like the eight-year average, if we were just to trade to that eight-year average, would put Ethereum at around $12,000.” On that basis, Lee characterized Ethereum as undervalued versus its historical relationship with Bitcoin. “So I think Ethereum is undervalued because number one, the story is gaining relative to Bitcoin this year. But two, we’re getting this sort of intrinsic floor because of the value that the assets locked onto the Ethereum blockchain,” he argued. Summarizing Lee’s stance, the CNBC host concluded: “Tom Lee saying that Ethereum is bottoming this week.” Lee did not offer a specific price target or an exact day, but his message was clear: in his view, Ethereum is close to completing its correction as on-chain value and relative valuation metrics converge toward levels that have historically marked major bottoms. At press time, ETH traded at $3,018. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|BitMine|ETH|ETH news|eth price|Ether|ethereum|ethereum news|ethereum price|Tom Lee",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54593832,
    "published": 1763528427000,
    "title": "Global crypto rules for banks need reworking, says Basel chair",
    "body": "US and UK refuse to implement requirements for a risk weighting of 1,250 per cent for stablecoins",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54555322,
    "published": 1763476713000,
    "title": "Crypto market sheds $1.2tn as traders shun speculative assets",
    "body": "Bitcoin drops 28% in six weeks amid concerns about lofty tech valuations and US interest rates",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]