[
  {
    "id": 57659297,
    "published": 1770015380000,
    "title": "Bitcoin's crash exposes painful truth – crypto market still dances to BTC's tune",
    "body": "Despite thousands of alternative tokens and institutional adoption, crypto markets in 2026 still largely move in lockstep with bitcoin, offering little real diversification.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 205,
        "NAME": "TOKEN SALE",
        "CATEGORY": "TOKEN SALE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57661592,
    "published": 1770022700000,
    "title": "Bitcoin ETF holders, sitting on paper losses, may throw in the towel",
    "body": "Spot ETF investors are now sitting on paper losses, which sets the stage for potential large redemptions.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|ETFs|Bitcoin ETF|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57661436,
    "published": 1770021317000,
    "title": "Russia’s Top Crypto Miner Owner Arrested on Tax Evasion Charges",
    "body": "Igor Runets, the founder of Russia’s biggest crypto mining firm BitRiver, has been put under house arrest on tax evasion charges, according to documents published on the Moscow court website.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57662073,
    "published": 1770024273000,
    "title": "Binance moves 1,315 bitcoin into SAFU fund as it prepares to buy $1 billion BTC",
    "body": "The move follows Binance’s Jan. 30 announcement that it would shift the $1 billion SAFU fund toward bitcoin over a 30-day period.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57662708,
    "published": 1770026297000,
    "title": "No Relief For Crypto Investors As India Retains Current Crypto Tax In Budget 2026",
    "body": "India's crypto tax regime remains unchanged, dashing industry hopes for relief from the framework that drove trading offshore.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|||Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57663010,
    "published": 1770024650000,
    "title": "Crypto Hacks Explode: $370 Million Stolen In January Alone: Researchers",
    "body": "The start of this year brought a hard reminder: people remain the weakest link. Reports note that roughly $370 million in crypto were taken in January, a sharp climb from earlier months. Related Reading: Crypto Funds Bleed $1.80 Billion As Metals Rally Heats Up That surge was driven mostly by one massive social-engineering con that emptied a single victim of about $284 million. Simple lies and well-crafted messages beat code this time. Phishing Dominates Losses According to CertiK, phishing-style scams grabbed about $311 million of the January haul. That means most losses came from attackers tricking users and insiders rather than breaking cryptographic systems. Social pressure, fake links, and impersonation were used to push victims into moving funds. People clicked. Money moved. Accounts were drained. A Bigger Picture Of Monthly Swings Based on reports, January’s total is nearly four times the $98 million stolen in January 2025 and more than triple December’s close to $118 million. The month is the largest since February 2025, when roughly $1.5 billion was taken, most of that tied to the huge Bybit heist. Those big events show how a single breach or scam can tilt an entire month’s tally. Numbers can look calm one month and explosive the next. That unpredictability keeps wallets and treasuries on edge. #CertiKStatsAlert 🚨 Combining all the incidents in January we’ve confirmed ~$370.3M lost to exploits. ~$311.3M of the total is attributed to phishing with one victim losing ~$284M due to a social engineering scam. More details below 👇 pic.twitter.com/uXhi0P6dl5 — CertiK Alert (@CertiKAlert) January 31, 2026 Major Technical Exploits Hit Treasuries PeckShield flagged several large protocol attacks. Step Finance lost nearly $29 million after treasury wallets were compromised and over 261,000 SOL vanished. Truebit suffered a $26.4 million hit when a smart contract flaw allowed near-free minting, which also crushed its token price. SwapNet and Saga were among other victims, with losses around $13.3 million and $7 million respectively. Those hacks were technical, aggressive, and fast. #PeckShieldAlert In Jan. 2026, the crypto space saw 16 hacks totaling $86.01M in losses, representing a slight 1.42% YoY decrease compared to Jan. 2025 ($87.25M) but a notable 13.25% MoM surge from Dec. 2025 ($75.95M). Meanwhile, #phishing remains staggering with losses… pic.twitter.com/pxugbsPcZ7 — PeckShieldAlert (@PeckShieldAlert) February 1, 2026 Why This Matters Now Reports say there were 40 exploit and scam incidents over January, though the bulk of value lost was concentrated in a few cases. That pattern means the raw count of incidents doesn’t tell the whole story; a single, well-executed con can dwarf many smaller breaches combined. Some months will show many small thefts. Other months will be defined by one enormous fraud. What Needs To Change Security teams and project treasuries must tighten both human and technical safeguards. More rigorous wallet controls, staged approvals, and stronger identity checks would blunt social-engineering strikes. At the same time, independent code audits and quicker response plans can limit damage from smart contract bugs. Education programs for staff and users are cheap compared with the cost of a single large loss. Related Reading: Gold Vs. XRP: One Asset Just Added 20x The Other’s Market Value The recent spike is a clear message: attackers are mixing social skill with technical know-how. The playbook now often starts with a message in a chat app or an email, then turns into code-level theft. Patching software helps. Teaching people how to spot scams will stop many attacks before they ever reach the code. Featured image from Shutterstock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|bitcoin|certik|crypto|digital currency|hacking|hacks",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57663092,
    "published": 1770027477000,
    "title": "Hong Kong to grant first stablecoin issuer licenses in March: Report",
    "body": "Hong Kong's monetary authority said only a small number of stablecoin issuers will be approved initially, as application reviews near completion.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      }
    ]
  },
  {
    "id": 57663104,
    "published": 1770027447000,
    "title": "Justin Sun swoops to buy $100 million of bitcoin as rest of the market bleeds",
    "body": "Justin Sun plans to add between $50 million and $100 million worth of bitcoin (BTC) to the blockchain's holdings, the Tron founder told CoinDesk.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Justin Sun|Tron|Bitcoin Treasury Reserve Asset|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57663495,
    "published": 1770028857000,
    "title": "Crypto funds post second week of outflows at $1.7B: CoinShares",
    "body": "Crypto ETPs posted two consecutive weeks of outflows, totaling $3.43 billion and driving $1 billion in year-to-date losses, according to CoinShares.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57663390,
    "published": 1770028676000,
    "title": "Ripple secures full EU e-money license in Luxembourg",
    "body": "The payments firm said Luxembourg’s CSSF has granted final Electronic Money Institution approval, moving it from “in-principle” status to a license it can use to expand Ripple Payments across the bloc.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57663763,
    "published": 1770030031000,
    "title": "XRP Price Falls Below $1.6: You Won’t Believe What Institutions Are Doing Amid The Crash",
    "body": "Crypto pundit X Finance Bull has highlighted how institutions are accumulating XRP amid the crypto market crash. His comment comes amid the XRP price drop below the psychological $1.6 level, which has further sparked bearish sentiments among retail investors. Institutions Are Still Accumulating Amid XRP Price Crash In an X post, X Finance Bull noted that while retail investors are panicking over the XRP price crash, institutional investors continue to accumulate the Ripple-linked token. The crypto pundit pointed to inflows into XRP ETFs, while Bitcoin and Ethereum ETFs continue to see outflows. Based on this, he stated that the rotation is starting, with institutional investors moving from BTC and ETH to XRP. Related Reading: XRP Price At $10,000 Is Not A Prophecy: Analyst Shares Simple Framework That Points Higher SoSoValue data show that Bitcoin and Ethereum ETFs recorded outflows of $1.61 billion and $353 million, respectively, on January 30. Meanwhile, the XRP ETFs recorded a net inflow of $15.6 million. X Finance Bull noted that these inflows might be small now, but that direction matters. He further remarked that institutions don’t chase hype in choppy markets but rather position for fundamentals. The crypto pundit also noted that inflows into XRP ETFs, while Bitcoin and Ethereum ETFs are bleeding, aren’t random. He highlighted fundamentals that are bullish for the XRP price despite the current market crash. This includes the token’s cross-border payments utility, which he noted solves a “Quadrillion-dollar problem.” He added that regulatory clarity is coming and that infrastructure is already in place. X Finance Bull expects the XRP price to be among the first to recover when the market rebounds, noting that capital flows to utility. He added that the smart money is already front-running that shift. The crypto pundit also believes that those investing in XRP now are still early, given that the XRP ETFs have just recorded $1.18 billion cumulative inflows in three months. Two Potential Paths For The Altcoin At The Moment Crypto analyst Egrag Crypto has highlighted two paths for the XRP price following its drop below $1.60. He stated that the first path is a double liquidity grab, whereby a relief bounce happens from here, followed by a second liquidity sweep and then an expansion. His accompanying chart showed that the second liquidity sweep could happen around $1.3. Meanwhile, the second path of the XRP price is a direct expansion, which aligns with the cycle fractal. Egrag Crypto stated that if history rhymes, the altcoin could record a 340% gain, similar to the 2021 bull cycle, or a larger 1,600% gain, similar to the 2017 bull cycle. A 340% surge and a 1,600% surge would put XRP at $7 and $27, respectively. Related Reading: Rising Above The Ashes: XRP ETFs Set New Record Despite Market Crash At the time of writing, the XRP price is trading at around $1.54, down over 7% in the last 24 hours, according to data from CoinMarketCap. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|altcoin|Bitcoin ETFs|btc|CoinMarketCap|Egrag Crypto|ETH|Ethereum ETFs|Ripple|SoSoValue|X Finance Bull|xrp|XRP ETFs|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57664256,
    "published": 1770031800000,
    "title": "Weekend selloff wipes out $290 billion before bitcoin steadies: Crypto Markets Today",
    "body": "Crypto markets stabilized after a thinly traded weekend rout wiped out nearly $290 billion of total market capitalization.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57664646,
    "published": 1770032676000,
    "title": "BitMine nears $7B paper loss as market crash pressures ETH treasuries",
    "body": "Ether treasury firms are pressured by the crypto market downturn, as Trend Research was forced to sell $77 million in Ether at a loss, while others are holding through paper losses.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57665508,
    "published": 1770035454000,
    "title": "Bitcoin Price Crash To $76,000: Why This Analyst Is Warning Against Buying",
    "body": "Since the recent Bitcoin price crash to $76,000, the broader crypto market has been on high alert, with sentiment shifting to extreme fear levels. A crypto analyst who has shared insights on Bitcoin’s latest market movements predicts more pain for the leading cryptocurrency. He has also warned investors against taking advantage of the decline and buying BTC during this highly volatile and unpredictable period. Analyst Warns Not To Go Long After Bitcoin Price Crash Crypto analyst Tyrex has warned investors against going long on Bitcoin following the recent price crash. Over the weekend, BTC experienced another devastating decline, dropping by more than 14% according to CoinMarketCap. For some investors, this drop may appear as an opportunity to buy the dip and go long on the leading cryptocurrency. However, Tyrex advises against making such a move. Related Reading: XRP Prints Bullish Divergence On The Weekly Chart, But Is ATHs Still Possible? The analyst stated in an X post on February 1, 2026, that Bitcoin had crashed to a new low around $76,000 on January 31, confirming a bearish breakout. He noted that, based on past market movements in which similar setups occurred, excluding fakeouts, Bitcoin is highly unlikely to stage a full recovery back to $85,000. Instead, he said the price is more likely to keep dumping until it completes its downside move and reaches a price discovery at lower levels. Tyrex cited Bitcoin’s price action in May 2021, May 2022, and June 22, noting that massive price crashes occurred during these periods after similar breaks in market structure. He said Bitcoin failed to recover quickly in each case and actually continued to crash on the daily chart after the main red candle was printed. The analyst’s accompanying Bitcoin chart shows the cryptocurrency trading above $79,000 at the time of his analysis, after it initiated a slight recovery from its previous low near $76,000. He projected on the chart that Bitcoin could soon resume its decline and fall toward the $75,400 region, representing a more than 4.5% decline. Tyrex added that a major support level sits around the $74,000 level on the weekly chart, which could temporarily hold off further downside. According to Tyrex, this level is equivalent to a key support near $2,100 for Ethereum. Related Reading: Analyst Says Chainlink Price Could Crash 50% If This Level Fails Analyst Shares Highly Likely BTC Decline In his analysis, Tyrex stated that, given Bitcoin’s latest price crash, structural weakness, and past cycle trends, he expects the cryptocurrency to retest recent lows once again. Considering his view that a recovery is unlikely, the analyst suggests that the near-term outlook for BTC is predominantly bearish. He noted that the $74,000 support is the main area for potential long positions. However, he expressed caution, noting that this level may not be particularly strong since it is relatively distant on the weekly chart and could be broken if Bitcoin continues its downward trend. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57665523,
    "published": 1770035400000,
    "title": "No, the UK hasn’t completely flopped on crypto",
    "body": "Popular opinion is missing the sea change in the UK’s crypto operating environment. Beneath regulatory criticism, the UK is accelerating its crypto evolution",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57665764,
    "published": 1770036141000,
    "title": "Nomura to tighten risk controls at Laser Digital after crypto-related losses",
    "body": "Nomura CEO Hiroyuki Moriuchi said that the company introduced stricter position management to reduce risk exposure and limit earnings fluctuations from crypto market swings.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Nomura|Cryptocurrency|Laser Digital|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57665708,
    "published": 1770035352000,
    "title": "Crypto Exchanges Buckle as Stock Losses Top 55% on Retail Exodus",
    "body": "Crypto’s latest downturn looks different on the surface. There are no spectacular scandals, no bankrupt exchange, no regulatory crackdown. Yet for the industry’s biggest trading platforms, the damage is starting to look uncomfortably familiar.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 57666206,
    "published": 1770037493000,
    "title": "Death of the Premium: Strategy’s Discount to NAV Breaks the $BTC Buying Machine, Helping $HYPER Soar",
    "body": "For years, Strategy (MSTR), formerly MicroStrategy, has traded as the market’s go-to high-beta Bitcoin proxy, commanding a massive premium (the Syalor Premium) over its Net Asset Value (NAV). Investors happily paid $2.00, sometimes even $2.50, for every $1.00 of Bitcoin on the balance sheet. They treated the stock like a leveraged ETF without the management fees. But that dynamic is breaking. Recent trading data suggests the famous ‘Saylor Premium’ isn’t just eroding; it’s occasionally flipping into a discount . Source Saylor Tracker That premium wasn’t just a vanity metric. It was the fuel for the entire engine. Strategy’s playbook relies heavily on ‘At-The-Market’ (ATM) equity offerings, effectively selling overvalued stock to acquire Bitcoin. When the stock trades at 2x NAV, issuing shares is mathematically beautiful; it increases the Bitcoin per share for existing holders. But if MSTR trades at a discount (sub-1.0 NAV ), that math turns punitive. Issuing undervalued stock to buy Bitcoin at market price actually dilutes the Bitcoin-per-share metric. Frankly, the panic here isn’t about solvency; Michael Saylor has structured the debt to avoid liquidation cascades, it’s about velocity. A discount throws sand in the gears of the accumulation machine, effectively neutralizing one of the market’s biggest, persistent buyers. As this corporate arbitrage trade dries up, capital is starting to rotate toward protocol-level innovations that offer yield without the friction of traditional equity markets. Innovations like Bitcoin Hyper ($HYPER). Bitcoin Hyper Brings SVM Speed to Replace Corporate Proxies As the ‘paper Bitcoin’ trade faces structural headwinds, the narrative is shifting toward on-chain scalability. The market’s appetite for Bitcoin exposure hasn’t waned, but the mechanism is evolving. It’s moving from passive corporate holding companies to active Layer 2 infrastructure. Bitcoin Hyper ($HYPER) is catching this rotation, positioning itself as the first Bitcoin Layer 2 to integrate the Solana Virtual Machine (SVM) . Source: Bitcoin Hyper While Strategy offers passive exposure, Bitcoin Hyper tackles Bitcoin’s ‘dinosaur’ problem: slow transactions and zero programmability. By using the SVM for execution while anchoring to Bitcoin L1 for settlement, Bitcoin Hyper unlocks sub-second finality. If Bitcoin remains solely a store of value, it competes only with gold. If it gains the programmable velocity of Solana through layers like Bitcoin Hyper, it competes with the global financial system. The setup fixes the bottleneck that has historically pushed developers to Ethereum or Solana. Through a decentralized Canonical Bridge and Rust-based developer SDKs, Bitcoin Hyper allows DeFi applications, swaps, lending, and gaming to exist directly on top of Bitcoin liquidity. If you’re watching the MSTR premium evaporate, this represents a fundamental shift. It’s no longer about betting on a CEO’s buying strategy; it’s about betting on the expansion of the network itself. Find out more in our ‘What is Bitcoin Hyper’ guide. Whales Accumulate $HYPER as Smart Contract Utility Grows Smart money is already hedging against the stagnation of traditional Bitcoin proxies by moving into early-stage infrastructure. Whales are signaling high-conviction positioning before the public mainnet launch, with $HYPER purchases as high as $500K . Our ‘ Bitcoin Hyper Price Prediction ‘ also shows we think it’s got good legs. Our experts predict that by the end of 2026 it could reach prices as high as $0.02595. That’s a potential ROI of 89% this year alone. The presale shows that $HYPER is doing well, having already raised over $31M , with tokens currently priced at $0.013675. Unlike the Strategy model, which relies on capital markets to generate accretion, Bitcoin Hyper uses a direct staking model. The protocol offers a high APY currently standing at 38%. Source: X This creates a sharp divergence. MSTR shareholders rely on stock issuance premiums, a variable they can’t control. Conversely, on-chain staking offers programmatic yield derived from network activity. With Bitcoin Hyper ($HYPER) offering immediate staking after TGE (subject to a 7-day vesting period for presale participants), the incentives look much closer to DeFi standards than Wall Street equities. As the discount to NAV makes corporate accumulation harder, the ‘real yield’ in the Bitcoin ecosystem is likely to migrate toward these functional Layer 2s. Join the Bitcoin Hyper Presale This article is for informational purposes only and does not constitute financial advice. Cryptocurrencies and presales are high-risk investments. Always perform your own due diligence before investing.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57666570,
    "published": 1770038496000,
    "title": "UAE Investment in Trump’s WLF: Will Aggressive Change Bring the Hype for Best Crypto like $MAXI?",
    "body": "The intersection of sovereign wealth and decentralized finance has shifted from theory to hard negotiation. Reports of UAE investment flowing into Donald Trump’s World Liberty Financial (WLF) signal a major pivot in how political crypto projects operate. This isn’t just about campaign financing or political branding. It represents a structural shift. Source: X Nation-state capital, specifically from hubs like Dubai and Abu Dhabi, is poised to validate this speculative asset class on a global stage. When analysts talk about ‘aggressive change,’ they are referring to WLF’s rumored restructuring to court Middle Eastern institutional players. If sealed, that deal injects massive liquidity into the ecosystem. And history is clear here: when sovereign entities enter the chat, markets don’t accumulate gradually. They reprice violently. The downstream effect is predictable. Retail traders, priced out of institutional rounds, scramble for high-beta assets that match this aggressive sentiment. The market splits. While the UAE and Trump negotiate infrastructure, the retail cohort hunts for volatility. It’s the perfect storm for ‘leverage culture’ projects, tokens embodying the high-risk, high-reward mentality of the bull run. As institutional money anchors the top, liquidity spills into aggressive contenders like Maxi Doge ($MAXI) , positioned to capture that speculative overflow. Leveraging Gym Culture And Aggressive Tokenomics While WLF targets the suit-and-tie crowd, Maxi Doge ($MAXI) corners the ‘degens’ driving actual on-chain volume. Frankly, the dog-coin market is saturated. $MAXI differentiates itself by pivoting away from kawaii aesthetics toward a ‘gym bro’ culture equating physical gains with portfolio growth. Think of it as a 240-lb canine juggernaut built for the 1000x leverage mentality. Source: Maxi Doge In a bull run, narrative fit often beats technical novelty. Maxi Doge capitalizes on this by baking utility into its meme structure. We’re talking planned holder-only trading competitions and a ‘Maxi Fund’ treasury dedicated to liquidity partnerships. Instead of passive holding, the ecosystem encourages active participation through leaderboard rewards, appealing to the exact demographic currently bored by low-volatility infrastructure coins. Running on Ethereum, the protocol uses smart contracts to govern supply, preventing the inflationary spirals typical of lower-cap assets. By branding itself around ‘never skipping leg day,’ the project signals a commitment to the grind of the bull market, a stark contrast to the passive income promises of previous cycles. If you’re watching the Trump-UAE headlines, $MAXI represents the retail answer: a tool designed to lift, trade, and repeat until it dominates the charts. Explore the official Maxi Doge presale here. Whale Accumulation Signals Confidence In Maxi Doge Smart money appears to be front-running the broader retail crowd, likely anticipating that the aggressive shift in market sentiment will benefit high-octane meme tokens. On-chain data shows the largest $MAXI purchases at $314K and $314K . Clearly, high-net-worth individuals are looking beyond the top 10 for yield. Maxi Doge has already raised over $4.5M, with tokens currently sitting at $0.0002802. That steady capital inflow suggests the ‘Leverage King’ narrative is sticking (and backed by a staking model rewarding conviction). The project offers a dynamic APY currently at 68%. This incentivizes you to lock supply for up to a year, reducing sell pressure during price discovery. When whales lock that much capital, it usually signals an expectation of post-launch momentum, a sharp contrast to the ‘pump and dump’ mechanics of some launches. Want in? Check out our ‘How to Buy Maxi Doge’ guide. The content provided in this article is for informational purposes only and does not constitute financial advice. Cryptocurrency markets are highly volatile, and presale investments carry significant risk. Always perform your own due diligence before making investment decisions.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57666614,
    "published": 1770038438000,
    "title": "South Korean watchdog expands AI systems to track crypto manipulation",
    "body": "The Financial Supervisory Service said automated models now scan crypto trading activity across timeframes, reducing reliance on manual investigations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57667395,
    "published": 1770040822000,
    "title": "SUI Slides Into Key Fib Support — Is the Downtrend Far From Over?",
    "body": "SUI is back under pressure after sliding into a key Fibonacci support zone, raising fresh concerns about whether the recent pullback is only a pause or the start of a deeper downside move. With bearish momentum still in play and no clear reversal signal yet, the market is now at a critical decision point that could shape SUI’s next major move. Fibonacci Support Comes Into Focus Crypto analyst More Crypto Online, in a recent update, revealed that SUI has now reached its next Fibonacci-based support levels, bringing key downside zones into focus. The 61.8% retracement sits near $1.20, while a broader support region extends between $0.91 and $1.70. These areas are defined using different analytical methods, with the orange zone representing retracement-based support and the blue zone derived from a measured comparison between the initial A-wave decline bottoming in April last year and the current C-wave. Related Reading: SUI At The Smart Money Zone: Big Moves Brewing Above $2 From a structural perspective, SUI continues to display relative weakness when compared to Bitcoin, Ethereum, and Solana, all of which remain above their April 2025 lows. SUI has already broken below that level, reinforcing the view that downside pressure remains dominant. According to the analysis, the breakdown aligns with either a fifth wave to the downside unfolding within circle wave C, or with price moving through circle wave 3 of a larger bearish sequence. At this stage, no technical signs confirm that a local bottom has formed. Both the yellow and white scenarios outlined in the analysis continue to allow for further downside. As long as price action fails to show clear reversal signals, additional weakness cannot be ruled out. White Scenario: SUI Third Wave Down Remains In Play The analyst further highlighted that under the white scenario, the market is considered to be in a third wave to the downside within a broader bearish structure. In this case, circle wave 3 is expected to reach at least the $0.915 level and could extend even lower. The more directly price continues to decline, the greater the likelihood that this bearish interpretation remains in play. Related Reading: SUI Reclaims Smart Money Zone, While Weekly Structure Signals Big Move Ahead In contrast, the yellow scenario still leaves room for a future recovery. This outlook allows for a rally that could lead to new highs as part of a broader C-wave advance. However, for this bullish case to gain credibility, the market would need to deliver a clear five-wave move to the upside. Without such confirmation, any upward movement is more likely to develop as a corrective wave 4 within the white scenario rather than the start of a new impulsive rally. In that context, rebounds would be expected to face resistance, with the standard resistance zone currently defined between $1.81 and $2.55. Featured image from YouTube, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "SUI|bitcoin|ethereum|Fibonacci Levels|More Crypto Online|Solana|SUI price|SUIUSD|SUIUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 96,
        "NAME": "SUI",
        "CATEGORY": "SUI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57667609,
    "published": 1770041301000,
    "title": "Morning Minute: Bitcoin Hit $75k After Weekend Washout",
    "body": "Trump's Warsh nomination seemingly set off a sell cascade for crypto majors, starting Thursday and running all weekend.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|||Opinion",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57667453,
    "published": 1770040862000,
    "title": "$41M in Losses as Crypto Wrench Attacks Hit Record High in 2025",
    "body": "Crypto wrench attacks soared by 75% year-on-year, with France at the epicenter of the crime wave, according to a new report from CertiK.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57668025,
    "published": 1770042684000,
    "title": "MSTR Price Dwindles as Strategy’s $BTC Holdings Show $900M in Unrealized Losses",
    "body": "MicroStrategy (MSTR) has long acted as a high-beta proxy for Bitcoin. But that leverage is a double-edged sword. As Bitcoin faces resistance, the valuation of corporate treasuries is suddenly under the microscope. Reports suggest the firm’s aggressive accumulation strategy temporarily left a chunk of holdings underwater, with some metrics pointing to $900M in unrealized losses during local lows. That volatility isn’t just a headline number; it’s a signal to institutional risk managers that the era of simply ‘parking’ Bitcoin is getting harder to justify without yield. The correlation between MSTR stock and spot Bitcoin prices remains tight, yet the divergence in volatility is widening. While Michael Saylor’s “buy and hold” thesis relies on infinite time horizons, Wall Street lives and dies by quarterly results. When the underlying asset sits idle, generating zero yield while subjecting the balance sheet to massive drawdowns, investors start questioning capital efficiency. Frankly, the market is demanding that Bitcoin do more than just collect dust in cold storage. This sentiment shift is forcing a migration of capital toward infrastructure that makes the asset productive. While traditional equity investors sweat over MSTR’s unrealized PnL, on-chain liquidity is moving aggressively into Layer 2 solutions that solve Bitcoin’s dormancy problem. The focus is shifting from companies that hoard Bitcoin to protocols that activate it. Leading this pivot is Bitcoin Hyper, a project utilizing the Solana Virtual Machine (SVM) to bring high-speed execution to the Bitcoin network. Bitcoin Hyper Activates Idle Capital With SVM Integration The main knock against the MicroStrategy model is capital inefficiency. Bitcoin stored in a corporate treasury is secure, sure, but it’s effectively dead capital until sold. Bitcoin Hyper addresses this by introducing the first Bitcoin Layer 2 integrated with the Solana Virtual Machine (SVM). This architecture allows Bitcoin to move with the speed of Solana, sub-second finality and negligible fees, while keeping the security guarantees of the Bitcoin network intact. For developers and DeFi users, this is a game changer. Previous scaling attempts like the Lightning Network or Stacks often struggled with latency or complexity. By adopting the SVM, Bitcoin Hyper lets developers write smart contracts in Rust and deploy high-performance dApps that leverage native Bitcoin liquidity. This unlocks use cases previously reserved for Ethereum or Solana: high-frequency trading, real-time gaming, and complex lending markets, all denominated in $BTC. The technical implications are significant. Bitcoin Hyper uses a modular blockchain structure where Bitcoin L1 handles settlement and the SVM L2 handles execution. A decentralized canonical bridge ensures trustless transfers, meaning users can bridge their $BTC to access high-yield DeFi opportunities without relying on centralized custodians. In a market where holding creates ‘unrealized losses,’ the ability to stake and utilize Bitcoin changes the equation entirely. Buy your $HYPER on the official page. Whales Accumulate $31M as Smart Money Targets L2 Infrastructure While traditional finance focuses on MSTR’s daily chart, on-chain data suggests a different narrative is playing out in the presale market. Smart money is clearly positioning itself for a ‘Bitcoin DeFi’ summer. According to the official presale page, Bitcoin Hyper has raised over $31M signaling robust demand for infrastructure that unlocks Bitcoin’s programmable potential. The accumulation patterns are distinct. Smart money is moving. Etherscan data reveals three high-net-worth wallets accumulated over $1M in the most recent buys, with the largest single buy hitting $500K . This isn’t retail behavior. These ‘whale’ wallets appear to be securing allocation in the infrastructure layer before the wider market catches on. Currently priced at $0.013675, the $HYPER token serves as the fuel for this new ecosystem, handling gas fees and governance within the L2. The tokenomics include a high-APY staking mechanism immediately available after TGE, designed to incentivize long-term security. For investors watching MicroStrategy’s volatility with concern, the rotation into a protocol that offers yield and utility represents a logical hedge. The market is voting with its wallet, and the vote is for a programmable Bitcoin. Visit the official Bitcoin Hyper site. The content provided in this article is for informational purposes only and does not constitute financial advice. Cryptocurrency markets, including presales and stocks like MSTR, are highly volatile. Always perform your own due diligence before investing.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57668273,
    "published": 1770043218000,
    "title": "The $ETH Exodus: $ETH Slides to 68th as ‘Blue Chip’ Crypto Underperforms in the Market",
    "body": "The ‘ultrasound money’ narrative has gone quiet. While Bitcoin corrected a manageable 11% amid macro headwinds, Ether took a violent 14.5% hit, a divergence that has rattled the confidence of long-term holders. That price action pushed Ethereum’s market capitalization down to roughly $300B. It now sits at 68th in global asset rankings , trailing behind traditional ‘boomer’ equities like Coca-Cola and Cisco. Source: 8marketcap This isn’t just a dip; it’s an identity crisis. The $ETH/$BTC ratio has bled to multi-year lows, suggesting that institutional capital views Bitcoin as the sole safe haven. Meanwhile, retail liquidity is bypassing Ethereum entirely for faster, higher-beta ecosystems. The reality? Ethereum is currently trading more like a leveraged play on the Nasdaq than the decentralized computer of the future. But liquidity in crypto rarely vanishes; it rotates. As the ‘blue chip’ premium evaporates from Ether, sophisticated traders are moving down the risk curve. They’re hunting for assets that offer the volatility and community-driven upside Ethereum has temporarily lost. This rotation is fueling a surge in specialized trading tokens like Maxi Doge ($MAXI) , which prioritize high-leverage culture and gamified returns over slow-moving infrastructure roadmaps. Volatility Hunters Rotate Into Maxi Doge ($MAXI) While the broader market stagnates, smart money is positioning for the aggressive leg of the bull cycle. Maxi Doge ($MAXI) has emerged as a key beneficiary of this rotation. It pitches itself not just as a meme token, but as a ‘Leverage King’ ecosystem for the high-octane retail trader. Unlike the passive holding strategy currently punishing $ETH investors, $MAXI is built on active participation: ‘lift, trade, repeat.’ Source: Maxi Doge The appetite for this approach is clear. According to the official presale page, Maxi Doge has raised over $4.5M, signaling strong conviction despite the macro downturn. Priced at just $0.0002802, the token lowers the barrier to entry for retail traders who have been priced out of meaningful gains in major caps. What separates Maxi Doge from standard speculative assets? A utility layer tailored for the “degen” economy. The ecosystem plans to feature holder-only trading competitions with leaderboard rewards, directly incentivizing the volume and engagement currently fleeing the Ethereum mainnet. Plus, the project implements a Maxi Fund treasury to sustain liquidity and back partnerships with futures platforms. This structure suggests the team is building a sticky ecosystem for traders who find traditional spot holding too slow for the current cycle. Want in already? We’ve got you covered. Check out our ‘ How to Buy Maxi Doge ‘ guide. Whale Accumulation Signals Shift to High-Beta Assets The thesis that capital is fleeing ‘unproductive’ blue chips for new entrants is supported by on-chain forensics. While Ethereum whales have been net distributors recently, substantial buy orders are hitting the Maxi Doge contract. It looks like high-net-worth players are front-running the public launch. On-chain data from Etherscan shows two whale wallets accumulated $628K. The individual amounts, $314K , and $314K a signal of ‘smart money’ positioning. It suggests insiders expect the token to outperform sluggish majors once it hits public markets. Beyond buy pressure, the protocol’s staking mechanics offer shelter from market chop. The smart contract governs a dynamic APY system currently at 38%. However this is subject to change. If you’re fatigued by Ethereum’s slide, earning yield on a high-leverage asset offers a compelling alternative to holding a depreciating ‘blue chip.’ As Ethereum struggles to reclaim its narrative, the ‘gym bro’ energy of Maxi Doge, embodied by its 1000x leverage mentality, is capturing a market hungry for gains. Visit the Maxi Doge community. This article is for informational purposes only and does not constitute financial advice. Cryptocurrencies, particularly presale tokens and meme assets, are highly volatile and carry significant risk. Always perform your own due diligence.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57668119,
    "published": 1770042821000,
    "title": "Crypto crime is getting violent: ‘wrench attacks’ jumped 75% in 2026",
    "body": "Europe now accounts for over 40% of global incidents, with France leading at 19 reported attacks, involving home invasions, kidnappings, and targeted personal threats.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|security standard|CertiK|Crime|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57668547,
    "published": 1770044014000,
    "title": "Hyperliquid's HYPE higher by 10% on plans to add prediction markets and options",
    "body": "The exchange said it has added support for outcome-based trading in a move to compete with prediction markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Hyperliquid|Breaking News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57668422,
    "published": 1770043601000,
    "title": "Russia’s Largest Crypto Miner BitRiver Faces Bankruptcy as CEO Under House Arrest: Report",
    "body": "Court filings show insolvency proceedings against BitRiver’s main owner after years of financial strain and sanctions pressure.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 57669519,
    "published": 1770046760000,
    "title": "Why India wants the e-rupee to move beyond borders",
    "body": "India is exploring cross-border use of the e-rupee to reduce payment costs, improve trade settlement efficiency and expand the rupee’s global role.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57670731,
    "published": 1770050719000,
    "title": "Jeffrey Epstein Was an Early Investor in Coinbase, Emails Reveal",
    "body": "Coinbase co-founder Fred Ehrsam appears to have been personally aware and supportive of the convicted sex offender’s early investment in the company.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57670638,
    "published": 1770050262000,
    "title": "NY prosecutors raise alarm over GENIUS Act on fraud: Report",
    "body": "Five New York officials reportedly said Tether and Circle had been incentivized to not work with law enforcement, allowing them to profit off crimes involving stablecoins.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57670933,
    "published": 1770051230000,
    "title": "Bed Bath & Beyond stock jumps on deal to tokenize real estate with Tokens.com buy",
    "body": "The new platform, planned to debut by July, will use tools from tZERO and integrate with blockchain firm Figure to offer services such as mortgages and renovation loans.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Tokenization|Figure|Tzero|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 57670574,
    "published": 1770050296000,
    "title": "Bitcoin can still fall further. Historical data shows $60,000 will be the bottom",
    "body": "Historical data show that bitcoin has always found support in bear markets at the 200-week moving average.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|moving average|Ichimoku cloud|Technical Analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57671212,
    "published": 1770052021000,
    "title": "Bitcoin, Ethereum ETF Investments Flip Negative for 2026 as Crypto Funds Shed $1.7B",
    "body": "U.S.-listed crypto funds led withdrawals as Bitcoin and Ethereum prices slid after Donald Trump’s nomination of Kevin Warsh for Fed chair.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57671153,
    "published": 1770051957000,
    "title": "Bitcoin bounces 7% from lows, but crypto remains under pressure in U.S. trade",
    "body": "Crypto-related stocks like Robinhood, Coinbase, and Strategy continued to sport sizable losses on Monday.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57671169,
    "published": 1770051946000,
    "title": "Bed Bath & Beyond to acquire Tokens.com in tokenized real estate push",
    "body": "The retailer plans to build a platform for tokenized real-world assets, expanding beyond e-commerce after its 2023 bankruptcy.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57671579,
    "published": 1770051838000,
    "title": "Bitcoin ETF Buyers Sit on Losses as Crypto Conviction Fades",
    "body": "At the heart of Bitcoin’s slow-motion selloff lies a simple problem: the investors meant to be its most reliable new base aren’t buying.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57674507,
    "published": 1770060517000,
    "title": "ParaFi Capital makes $35M investment in Solana-based Jupiter",
    "body": "Jupiter said the deal marks its first outside capital and was structured as a market-priced token purchase with extended lockups.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57675170,
    "published": 1770062433000,
    "title": "Analyst Highlights What People Are Missing In The XRP Price Chart",
    "body": "An XRP analyst is pushing back against the growing sense of boredom surrounding XRP’s price action, with the outlook that people are misreading what is actually happening on the higher timeframes. Taking to the social media platform X, an analyst known as XRP QUEEN said traders are overlooking a typical setup that has always preceded some of XRP’s most notable rallies. Her view is based on XRP’s weekly price structure and a comparison with how previous long consolidation phases eventually resolved. Why XRP $1.50 To $3 Range Matters More Than It Looks A look at the weekly candlestick timeframe chart shows that XRP’s price action over multiple months has been largely confined between support at $1.5 and resistance just above $3. Interestingly, according to the analysis from XRP Queen, XRP’s price action being pinned between roughly $1.50 and $3 is not a sign of weakness but a repeat of earlier accumulation zones. Related Reading: Pundit Says XRP Price Is Not A ‘Crypto’ Question, But A Systemically Important Liquidity Asset The chart shows how the token has previously spent long stretches moving sideways for hundreds of days, highlighted on the chart as 200-day, 800-day, and even 1,000-day consolidation phases. In each case, price compression eventually gave way to a vertical move higher, labeled as MOON on the chart. The key point being made is that these flat, frustrating periods tend to drain interest and attention from the market. That drop in engagement, according to the analyst, has always aligned with smart accumulation. The longer the range holds, the more pressure builds beneath the surface. $2.72 And The Projection Of A Teleport Move A notable level on the chart is the $2.72 zone, which is sitting around the 0.786 Fibonacci extension level projected from XRP price lows in 2018. Breaking and holding above $2.72 would be important to how XRP rallies to new all-time highs. As noted by XRP Queen, if $2.72 holds, then the next outlook is looking at $9-$15. Related Reading: Pundit Explains Why The XRP Price Hitting $100 Isn’t Delusional Once XRP leaves this range, it teleports. No pullbacks and no second chances. The projection on the chart shows Fibonacci extensions stretching far above the current price. These extensions include 0.786 at $2.71, the 1.0 extension around $3.40, followed by 1.618 at $5.47, 2.818 at $8.78, and the most extreme 4.764 extension around $15.89, all pointing to price targets to be broken once the current range is broken. However, the altcoin is currently trading far below the $2.72 level needed to confirm the price teleportation to interesting highs. At the time of writing, XRP is trading around $1.60, meaning the price would need to climb by about 69% just to retest $2.72. Until that happens, XRP is in consolidation mode, and it is unclear how long it will keep trading sideways in the current range. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Fibonacci Extension level|moon|Ripple|xrp|xrp news|XRP Price|XRP Queen|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57675021,
    "published": 1770061707000,
    "title": "Wrench attacks increased by 75% in 2025, resulting in $41M losses: CertiK",
    "body": "The blockchain security auditor said violence against wallet holders was a ”core threat vector in the crypto ecosystem,” reporting a significant increase from 2024 to 2025.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57675305,
    "published": 1770062771000,
    "title": "Bed Bath & Beyond Makes Real World Asset Tokenization Move, Acquiring Tokens.com",
    "body": "Shares in publicly traded consumer brand Bed Bath and Beyond (BBBY) are up as the firm expands its blockchain push.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 57676126,
    "published": 1770064970000,
    "title": "Family offices shun crypto despite hype, with 89% holding no digital assets: JPMorgan Private Bank",
    "body": "The appetite for traditional and emerging hedges remains limited among wealthy families, according to JPMorgan Private Bank’s 2026 Global Family Office Report.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|CoinDesk Wealth|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57676716,
    "published": 1770066407000,
    "title": "Russia's biggest bitcoin mining firm's founder arrested for tax evasion while his company faces bankruptcy",
    "body": "An En+ subsidiary has filed an insolvency claim against the crypto mining firm, adding to pressure from energy debts, regulatory curbs and internal turmoil.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Russia|Bitriver|Crypto-Mining|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57676631,
    "published": 1770066172000,
    "title": "Opera Shares Jump After MiniPay Wallet Adds Support for Tether's USDT",
    "body": "Browser firm Opera's stock climbed Monday after the company said its MiniPay wallet now supports USDT and Tether Gold.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 164,
        "NAME": "XAUT",
        "CATEGORY": "XAUT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57678076,
    "published": 1770069922000,
    "title": "Elon Musk merges AI company xAI with rocket company SpaceX to build AI in space",
    "body": "The combined company is expected to price its IPO at a valuation of $1.25 trillion, according to Bloomberg.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Artificial Intelligence|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 57679305,
    "published": 1770073212000,
    "title": "Solana Price Forecast Turns Bearish After $100 Breakdown, Can Next Support Stop the Slide?",
    "body": "The Solana price has entered the new month under pressure after losing a level that had acted as a psychological anchor for much of the past year. The token’s drop below $100 shifted market attention from recovery narratives to damage control. Related Reading: Crypto Hacks Explode: $370 Million Stolen In January Alone: Researchers Traders are now closely watching whether upcoming support levels can halt a decline that has accelerated amid overall weakness in the crypto market. Although network activity and institutional interest continue to draw attention, short-term price movements have clearly shifted into a bearish trend. SOL's price trends to the downside on the daily chart. Source: SOLUSD on Tradingview Solana Price Breaks $100 as Selling Pressure Builds Before bouncing back to the current $102 level, the Solana price dipped to around $98, marking its lowest point in nearly ten months and extending losses to nearly 20% over the past week and approximately 25% over the last month. Trading activity has thinned as prices fell, with spot volume and derivatives participation both declining. Data from CoinGlass shows falling open interest, suggesting long positions are being unwound rather than a surge in aggressive short selling. The move has not occurred in isolation. A wave of market-wide liquidations over the weekend, combined with thin liquidity, amplified downside moves across major cryptocurrencies. Macroeconomic concerns have also weighed on sentiment after renewed expectations of tighter U.S. monetary policy following President Trump’s nomination of Kevin Warsh as the next Federal Reserve chair, a choice viewed as hawkish by markets. Technical Outlook Points to Lower Support Levels From a technical perspective, Solana’s structure has weakened. The break below $100 confirmed a pattern of lower highs and lower lows, with the Solana price hovering well beneath its declining short-term moving averages. Bollinger Bands are widening, and Solana price action remains near the lower band, suggesting downward momentum remains dominant rather than stabilizing. Momentum indicators underline the pressure. The daily relative strength index is hovering near 25, placing SOL deep in oversold territory. While this increases the probability of short-term bounces, it does not, on its own, signal a trend reversal. On the downside, traders are watching the $95 area closely, followed by a broader $92–90 zone. Below that, $85 and $80 stand out as larger historical support levels. Some on-chain and pattern analyses suggest that if selling accelerates, thinner support could expose deeper zones later in the year. Fundamentals Remain Active Despite Weak Price Action Despite the bearish price forecast, Solana’s underlying network metrics remain comparatively strong. January transaction counts rose sharply, and recent data shows continued growth in on-chain activity and stablecoin usage. Institutional interest has been mixed but not absent, with earlier January inflows offset by more recent Solana ETF outflows. Related Reading: Is The Bitcoin Bottom In? CMT Reveals What Traders Need To See Now Currently, the technical picture dominates. Solana would need to reclaim $110 and hold above key moving averages to ease bearish pressure. Until that happens, rallies are likely to be viewed as corrective moves within a broader downtrend, leaving the next support levels as the market’s immediate test. Cover image from ChatGPT, SOLUSD chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Solana|Sol|SOL Price|SOLUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57681514,
    "published": 1770078631000,
    "title": "XRP Market Structure “Very Similar” To April 2022, Glassnode Says",
    "body": "As XRP slides below $1.60, on-chain analytics firm Glassnode has highlighted how the current structure is looking similar to that of April 2022. XRP Is Fast Approaching Its Realized Price In a new post on X, Glassnode has talked about where XRP is currently trading with respect to its Realized Price. This on-chain indicator measures the cost basis or acquisition price of the average address on the blockchain. When the spot price of the cryptocurrency is trading above this metric, it means the investors as a whole can be assumed to be in a state of profit. On the other hand, it being below the indicator suggests the majority of the supply is underwater. Related Reading: Bitcoin Death Cross That Last Preceded A 66% Drop Is Back Now, here is the chart shared by Glassnode that shows the trend in the XRP Realized Price over the last several years: As is visible in the above graph, the XRP spot price has been above the Realized Price since 2024, indicating that holders have been enjoying net unrealized gains. The degree of profitability, however, hasn’t been constant in this period. The asset’s price had the largest gap over the metric back in late 2024, owing to a fast bull rally. Then, over the first three quarters of 2025, profitability gradually dropped as tokens changed hands at higher levels, leading to an increase in the Realized Price. The indicator hit a plateau in the last quarter of the year, but the bearish shift in the asset meant that it was now the price’s turn to approach the line, cutting back on average investor profits further. This trend has deepened recently. Following the sector-wide crash during the past week, XRP has come dangerously close to the Realized Price, which now sits at $1.48. “The current market structure is very similar to that of April 2022,” noted the analytics firm. Back then, the asset was transitioning to a bear market and its price fell to the Realized Price. That retest failed, and what followed was a steep move down that eventually led to the cycle low. Given the proximity that the current XRP price has to the indicator, it now remains to be seen whether a retest will occur in the near future and if it would lead to further bearish action like in 2022. Related Reading: Bitcoin Supply In Loss Turns Upward—Early Bear Market Signal? In the scenario that the cryptocurrency’s decline continues, technical support levels pointed out by analyst Ali Martinez may come into play. As displayed in the chart, Martinez has drawn levels based on a parallel channel pattern. “For XRP, resistance sits at $1.86, while support is at $1.38 and $1.02,” noted the analyst. XRP Price At the time of writing, XRP is trading around $1.60, down nearly 15% over the last week. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP News|glassnode|xrp|XRP Bear Market|XRP Realized Price|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57683556,
    "published": 1770084013000,
    "title": "Ethereum Faces High-Stakes Moment at $2,200 as Whale Longs Clash With Bearish Flow Data",
    "body": "Ethereum (ETH) has entered a decisive phase after a sharp sell-off erased much of its recent gains and pushed the price toward the closely watched $2,200 level. The move followed repeated failures to break above the $2,500–$2,550 zone, triggering liquidations. Related Reading: Crypto Hacks Explode: $370 Million Stolen In January Alone: Researchers With large holders taking opposing positions and on-chain data flashing caution, ETH is now at a point where both downside risk and rebound potential remain firmly in play. ETH's price records major losses across the board. Source: ETHUSD on Tradingview Ethereum Price Structure Weakens as $2,200 Comes Into Focus Ethereum (ETH) has fallen more than 20% from recent highs, briefly trading below $2,220 before stabilizing. The drop pushed ETH below the $2,300–$2,400 range and under key short-term moving averages, shifting near-term control toward sellers. Technical data shows a developing bearish trend line around $2,400–$2,420, an area that would need to be reclaimed to ease downside pressure. The $2,200 zone is now acting as the main support. A sustained break below this level could expose deeper downside toward $2,050 or psychological $2,000 mark. Momentum indicators remain cautious, with the hourly RSI below 50 and MACD still aligned with bearish momentum, suggesting buyers have yet to regain control. Exchange Inflows and Liquidations Signal Distribution Risk On-chain data has added to concerns. Exchange inflows surged ahead of the breakdown, with roughly 600,000 ETH moving onto major exchanges in a single day, including a sharp spike into Binance. Such inflows are often associated with selling, hedging, or risk reduction rather than accumulation. At the same time, derivatives markets saw heavy stress. ETH-related liquidations reached about $280 million over 24 hours, surpassing Bitcoin and confirming that long positions were crowded near recent highs. The unwind’s speed suggests structural weakness, as spot demand failed to absorb forced selling once support levels gave way. Whale Longs Add a Bullish Counterweight Despite bearish flow data, whale activity tells a more mixed story. According to on-chain analysts, dormant wallets reactivated after five years and posted over 45,000 ETH as collateral to open a large coin-margined long, borrowing roughly $100 million. This move highlights growing divergence at current levels, with some institutions deleveraging while certain large holders add exposure. Related Reading: Is The Bitcoin Bottom In? CMT Reveals What Traders Need To See Now This clash between whale longs and bearish exchange flows shows the uncertainty around $2,200. A rebound above $2,420 could shift momentum back toward buyers, while failure to hold current support may confirm that distribution pressure remains dominant. Cover image from ChatGPT, ETHUSD on Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ethereum|ethusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57684191,
    "published": 1770085493000,
    "title": "Here is why Ethereum's ‘brutal stumble’ looks exactly like the start of the last bull run: Asia Morning Briefing",
    "body": "Crypto could be getting ready to gallop as the year of the horse sets up a fresh run higher across ETH, BTC, and other digital assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|btc|btc price|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57685040,
    "published": 1770087640000,
    "title": "Bitcoin ETF Investors Pull Nearly $3 Billion, Pushing Average Buy Below Water",
    "body": "Bitcoin slid hard over the weekend and stayed low into Monday, leaving traders on edge and pushing many to reduce risk. Prices slipped from roughly $84,000 to about $74,600 in a matter of days, a drop that erased a chunk of recent gains and forced quick reassessments across markets. Nervousness around Federal Reserve leadership, rising job worries, and fresh geopolitical flashpoints all piled up at once. Related Reading: Gold Vs. XRP: One Asset Just Added 20x The Other’s Market Value Average ETF Price Above Market According to Coinglass, the combined assets of US spot Bitcoin ETFs sit near $113 billion, while reports note they hold around 1.28 million BTC. Based on those figures, the typical ETF buying price works out to an average of roughly $87,830 per coin — well above current trading levels. That gap means many ETF positions are showing losses on paper right now. Some funds kept buying earlier and are holding positions that are underwater. BTC is trading below the U.S. ETFs avg cost basis after the 2nd & 3rd biggest outflow weeks ever (last week and week before) (and last week’s outflow will increase after IBIT reports friday’s numbers tomorrow) this means the average bitcoin ETF purchase is underwater pic.twitter.com/XowzrnBaSM — Alex Thorn (@intangiblecoins) February 2, 2026 Outflows Pick Up Over the last two weeks, investors pulled close to $3 billion from the 11 spot ETFs, with one week seeing $1.50 billion leave and the prior week $1.30 billion, according to CoinGlass. Those moves suggest some market participants are locking in gains or cutting exposure after the recent run-up. At the same time, cumulative ETF inflows remain materially lower than earlier peaks; buying has not fully come back even as some holders remain steady. Technical Signals And Bear Fears Reports note that spot BTC is down roughly 40% from its October peak while ETF AUM has fallen by about 31%. That divergence has analysts warning that sustained weak demand could push Bitcoin into a deeper downtrend. Technical charts show longer-term sell pressure building in certain measures. If demand fails to reappear, momentum could carry prices lower and extend selling across crypto markets. Policy, Politics, And Market Mood Market watchers point to extra uncertainty around monetary policy and geopolitics as fuel for the recent moves. Reports have disclosed that the proposed US Clarity Act stalled in Washington. At the same time, headlines about tensions in the Middle East and trade friction added to a rush for traditional safe havens like gold and the dollar. Even a hint of policy change matters: US President Donald Trump’s choice for the next Fed chair was discussed by investors as another factor shaping expectations. Related Reading: Crypto Funds Bleed $1.80 Billion As Metals Rally Heats Up Liquidity And The Road Ahead Institutional holders have not all capitulated. Many have been described as holding on, which can cushion sharp drops. But when the average cost basis for major ETF holders is above the current market price, confidence can be fragile. Liquidity has thinned in certain windows, and that makes price swings larger. A recovery requires renewed buying from both retail and big investors, otherwise sellers may dictate direction for longer. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|CLARITY Act|crypto|digital currency|ETFs|fed",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57684736,
    "published": 1770086782000,
    "title": "FTX users, Fenwick agree to settle lawsuit over firm's role in FTX",
    "body": "The plaintiffs filed the lawsuit in 2023, accusing the law firm of playing “a key and crucial role\" in \"how the FTX fraud was accomplished.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 57685403,
    "published": 1770088694000,
    "title": "Ethereum Price Struggles At Resistance, Opening Door To Renewed Losses",
    "body": "Ethereum price extended its decline below $2,420 and $2,300. ETH is now attempting to recover from $2,150 but faces many hurdles near $2,365. Ethereum failed to stay above $2,350 and started a fresh decline. The price is trading below $2,350 and the 100-hourly Simple Moving Average. There is a major bearish trend line forming with resistance at $2,350 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh decline if it stays below the $2,400 zone. Ethereum Price Eyes Another Decline Ethereum price failed to remain stable above $2,500 and extended losses, like Bitcoin . ETH price traded below $2,420 to enter a bearish zone. The bears even pushed the price below $2,200. A low was formed at $2,155 and the price is now attempting to recover. There was a move above $2,250. The price tested the 23.6% Fib retracement level of the recent decline from the $3,040 swing high to the $2,155 low. However, the bears are active near $2,365. There is also a major bearish trend line forming with resistance at $2,350 on the hourly chart of ETH/USD. Ethereum price is now trading below $2,350 and the 100-hourly Simple Moving Average. If the bulls remain in action above $2,250, the price could attempt another increase. Immediate resistance is seen near the $2,350 level. The first key resistance is near the $2,365 level. The next major resistance is near the $2,450 level. A clear move above the $2,450 resistance might send the price toward the $2,600 resistance or the 50% Fib retracement level of the recent decline from the $3,040 swing high to the $2,155 low. An upside break above the $2,600 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $2,700 resistance zone or even $2,720 in the near term. Another Decline In ETH? If Ethereum fails to clear the $2,365 resistance, it could start a fresh decline. Initial support on the downside is near the $2,250 level. The first major support sits near the $2,220 zone. A clear move below the $2,220 support might push the price toward the $2,150 support. Any more losses might send the price toward the $2,120 region. The main support could be $2,000. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI – The RSI for ETH/USD is now below the 50 zone. Major Support Level – $2,220 Major Resistance Level – $2,365",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57685975,
    "published": 1770089932000,
    "title": "Tom Lee tips lack of leverage and gold ‘vortex’ for Ether's 21% slump",
    "body": "Ether has fallen despite strong fundamentals as leverage remained absent and precious metals diverted risk appetite, according to Fundstrat's research head.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      }
    ]
  },
  {
    "id": 57686402,
    "published": 1770091234000,
    "title": "70% Bitcoin Crash Incoming? CryptoQuant CEO Says It Depends On This",
    "body": "Bitcoin’s latest drawdown is being framed less as a technical breakdown and more as a liquidity problem, with Ki Young Ju arguing that the key inputs that sustained the rally fresh capital inflows have stalled. In that setup, he says, calls for a full-cycle, -70% style capitulation hinge on a single variable: whether Strategy turns from buyer to meaningful seller. Will Bitcoin Experience Another -70% Bear Market? In a Feb. 1 post, Ki said “Bitcoin is dropping as selling pressure persists, with no fresh capital coming in.” He pointed to a flatlining Realized Cap as evidence that incremental money is no longer entering the market, and tied that directly to market structure. “Realized Cap” has flatlined, meaning no fresh capital. When market cap falls in that environment, it’s not a bull market.” His read is that the profit-taking has been there for a while, it was simply absorbed. Early holders, he wrote, were “sitting on big unrealized gains thanks to ETFs and MSTR buying,” and “have been taking profits since early last year, but strong inflows kept Bitcoin near 100K.” The change now, in his telling, is that the bid that mattered most has faded: “Now those inflows have dried up.” Related Reading: Bitcoin LTH Supply Rises Again Amid Bearish Market Dynamics That’s where the crash math changes. Ki described Strategy (MSTR) as “a major driver of this rally,” but argued the reflexive downside seen in prior cycles is unlikely without a decisive reversal from the company’s balance sheet strategy. “Unless Saylor significantly dumps his stack, we won’t see a -70% crash like previous cycles,” he wrote, carving out an explicit condition rather than presenting the drawdown as inevitable. Even so, he didn’t claim the market has found a floor. “Selling pressure is still ongoing, so the bottom isn’t clear yet,” Ki said, adding that the more probable path is time, not a straight-line liquidation. His base case is “a wide-ranging sideways consolidation,” a regime where volatility can persist but direction becomes harder to sustain without new marginal buyers. Stablecoin Liquidity Dries Up CryptoQuant contributor Darkfost added color on what “no fresh capital” looks like in the plumbing. He argued stablecoin activity, often treated as a near-term proxy for deployable crypto liquidity, has rolled over sharply as uncertainty stays elevated. Related Reading: Is The Bitcoin Bottom In? CMT Reveals What Investors Need To See Now “The crypto market is currently going through a delicate phase, marked by a structural lack of liquidity in a context of persistently high uncertainty,” he wrote, calling it an environment “not conducive to risk taking,” especially relative to assets like precious metals and equities that are still drawing flows. Darkfost said the stablecoin market had expanded by more than $140 billion since 2023, but that total stablecoin market capitalization began declining in December, “putting an end to this sustained growth trend.” The more actionable signal, he argued, is exchange flows: “Strong inflows generally indicate a willingness to gain exposure to the market, while outflows instead suggest capital preservation and a reduction in risk.” He highlighted October as the last clear liquidity-heavy month, when “average monthly stablecoin netflows exceeded $9.7B,” with nearly $8.8B concentrated on Binance alone—conditions that “supported Bitcoin’s rally toward a new all time high.” Since November, he said, those inflows have been “largely wiped out,” with an initial $9.6 billion drop, then a brief stabilization, followed by renewed net outflows of more than $4 billion, including $3.1 billion from Binance. At press time, BTC traded at $78,280. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57686810,
    "published": 1770092292000,
    "title": "XRP Price Weakness Persists With Bears Eyeing A New Leg Lower",
    "body": "XRP price extended losses and traded below $1.550. The price is now attempting to recover but faces hurdles near $1.650 and $1.70. XRP price started a recovery wave from the $1.50 zone. The price is now trading below $1.620 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance at $1.6150 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move down if it stays below $1.650. XRP Price Faces Resistance XRP price failed to stay above $1.650 and extended its decline, like Bitcoin and Ethereum . The price declined below $1.620 and $1.60 to enter a short-term bearish zone. The price even spiked below $1.520. A low was formed at $1.50, and the price is now attempting to recover. There was a move above the $1.5750 level. The price surpassed the 23.6% Fib retracement level of the downward move from the $1.9388 swing high to the $1.50 low. The price is now trading below $1.620 and the 100-hourly Simple Moving Average. If there is a fresh upward move, the price might face resistance near the $1.620 level. There is also a key bearish trend line forming with resistance at $1.6150 on the hourly chart of the XRP/USD pair. The first major resistance is near the $1.650 level. A close above $1.650 could send the price to $1.720 or the 50% Fib retracement level of the downward move from the $1.9388 swing high to the $1.50 low. The next hurdle sits at $1.750. A clear move above the $1.750 resistance might send the price toward the $1.780 resistance. Any more gains might send the price toward the $1.80 resistance. The next major hurdle for the bulls might be near $1.825. Another Drop? If XRP fails to clear the $1.650 resistance zone, it could start a fresh decline. Initial support on the downside is near the $1.5760 level. The next major support is near the $1.550 level. If there is a downside break and a close below the $1.550 level, the price might continue to decline toward $1.5250. The next major support sits near the $1.50 zone, below which the price could continue lower toward $1.4650. Technical Indicators Hourly MACD – The MACD for XRP/USD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $1.5760 and $1.550. Major Resistance Levels – $1.6150 and $1.650.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57687466,
    "published": 1770093705000,
    "title": "Tether expands support for USDT, Tether Gold in Opera’s MiniPay wallet",
    "body": "Stablecoin issuer Tether said the initiative will help millions of users from emerging markets such as Africa, Latin America and Southeast Asia with global financial inclusion.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 164,
        "NAME": "XAUT",
        "CATEGORY": "XAUT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57687380,
    "published": 1770093691000,
    "title": "Bitcoin, ether and major tokens stage relief rally after weekend bloodbath",
    "body": "Bitcoin rebounded toward $79,000 after dipping below $75,000 over the weekend, as traders weighed heavy liquidation-driven selling against macro tailwinds and a potential inflection point for crypto markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57687867,
    "published": 1770094826000,
    "title": "Bitcoin Bear Market Signal Emerges: Supply in Loss Rises Above 40%",
    "body": "Bitcoin slipped below the $80,000 level over the weekend as selling pressure intensified across global markets. Reinforcing a climate of uncertainty that has weighed heavily on risk assets in recent weeks. The move came amid broad weakness in equities, elevated volatility, and declining liquidity conditions, pushing many investors into a defensive posture. While the price action alone may resemble prior corrective phases, on-chain data suggest that the underlying market structure is beginning to change. A recent analysis from CryptoQuant indicates that Bitcoin is starting to exhibit characteristics historically associated with the early stages of bear markets. One of the clearest signals comes from the Supply in Loss (%) metric, which has climbed sharply to around 44% and continues to trend higher. This means a growing share of circulating BTC is now held at an unrealized loss. Reflecting increasing stress across market participants. Related Reading: Bitcoin Miner Fees Remain Near Cycle Lows: What Does This Signal? Importantly, Bitcoin is still trading above its Realized Price, suggesting the market has not yet reached full capitulation. However, the combination of rising losses and weakening price structure raises the risk that the current phase represents the transition into a broader bear market, rather than a temporary correction within an ongoing uptrend. Supply in Loss Signals Structural Shift Toward a Bear Market The report explains that Bitcoin’s current on-chain structure closely mirrors conditions observed at the onset of previous bear markets. Historically, several signals have tended to appear together at the start of prolonged downside phases rather than at the end of routine corrections. These include Supply in Loss expanding above roughly 40%, a simultaneous decline in Supply in Profit, and price remaining elevated relative to realized value. When these conditions align, they have typically marked the beginning of structural weakening, not a reset before another leg higher. The present setup fits this historical pattern. Supply in Loss has moved decisively above the 40% threshold, while profitable supply is gradually contracting. This shift is occurring without widespread panic or capitulation. Indicating that losses are spreading across the supply in a controlled but persistent manner. This dynamic suggests a slow deterioration in market health, as more participants hold BTC at a loss while price struggles to recover meaningfully. Related Reading: Ethereum Trades At A Historical Accumulation Level: Can Bulls Hold $2,600 In past cycles, durable market bottoms only formed after Supply in Loss expanded further, usually alongside deeper price compression and a clearer capitulation phase. At current levels, those conditions have not yet been fully met. As a result, the data implies that the market is still in a transitional phase. This no longer resembles a mid-cycle dip. On-chain signals point to Bitcoin entering a bear market structure, with downside risk remaining unresolved until stronger signs of capitulation or structural stabilization emerge. Bitcoin Higher Timeframe Confirms Bearish Market Structure Bitcoin’s price structure has deteriorated sharply on the higher time frame, as shown by the 3-day chart. After months of consolidation below the prior all-time highs, BTC has now broken decisively below the $80K psychological level, with the latest close around $77,500. This move confirms a loss of medium-term support and marks a clear transition from distribution into downside continuation. From a trend perspective, price has slipped below the 50-period and 100-period moving averages, both of which are now rolling over. The 200-period moving average, still rising but flattening near the mid-$80K area, failed to act as durable support and now represents a major overhead resistance zone. Historically, sustained trading below these averages signals weakening trend strength and reduced probability of immediate trend recovery. Related Reading: XRP Risk-Adjusted Returns Signal Consolidation Rather Than Trend Formation – Details The recent sell-off also stands out for its impulsive character. Large bearish candles with limited lower wicks suggest aggressive selling pressure rather than orderly consolidation. Volume expanded on the breakdown, reinforcing the validity of the move and indicating forced exits rather than passive rebalancing. Structurally, the market is now forming lower highs and lower lows on this timeframe. Unless BTC can quickly reclaim the $80K–$85K region, downside risk remains dominant. In this context, the chart supports a bearish continuation. At best, a prolonged basing phase precedes any meaningful recovery attempt. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|bitcoin bear market|Bitcoin breakdown|Bitcoin Crashes|Bitcoin news|Bitcoin Supply In Loss|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57687758,
    "published": 1770094416000,
    "title": "Musk's SpaceX–xAI mega deal sharpens focus on bitcoin accounting ahead of IPO",
    "body": "The move concentrates crypto exposure across Musk’s businesses, with energy company Tesla’s among the top public holders of the asset.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57687685,
    "published": 1770094330000,
    "title": "HYPE pops 20% after Hyperliquid team nods prediction markets plan",
    "body": "Hyperliquid said the outcome trading feature would function like a form of derivatives trading without leverage, liquidations or margin calls.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57687583,
    "published": 1770093514000,
    "title": "Bitcoin Stalls After Weak Rebound as Options Signal Caution",
    "body": "Bitcoin remained under pressure Tuesday, stalling after a brief rebound from a 10-month low as trader caution persisted in options activity.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57688606,
    "published": 1770096633000,
    "title": "Just as bitcoin tries to steady, the dollar index wakes up",
    "body": "A resurgent U.S. dollar index, which has logged its strongest two-day gain in nine months, could arrest potential bitcoin recovery.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Dollar index|btc|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57688574,
    "published": 1770096518000,
    "title": "Arizona Attorney General Issues Warning as Crypto ATM Scams Hit Older Adults",
    "body": "Arizona has launched a fraud reporting tool as crypto ATM scams surge and losses mount, especially among older consumers.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57686237,
    "published": 1770090494000,
    "title": "Tether releases open-source operating system for Bitcoin mining",
    "body": "Tether first announced plans for an open-source mining OS in June last year, aiming to let Bitcoin miners “enter the game” without relying on expensive third-party vendors.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57689316,
    "published": 1770098447000,
    "title": "XRP Tops All Assets On Risk/Reward, Analyst Says",
    "body": "XRP sits at a crossroads. Trading around the $1.6 area after a steep run higher and a later pullback, the token now rests on a weekly support band that traders are watching closely. According to crypto analyst Scott Melker, this is one of the cleaner risk/reward setups in crypto right now — a small stop can limit losses while a bounce could offer meaningful gains. Related Reading: Crypto Funds Bleed $1.80 Billion As Metals Rally Heats Up Support Zone Holds The Key Based on reports, the zone around $1.55 to $1.60 is important. It lines up with the midpoint of the breakout that began in November 2024 and has acted as resistance before flipping to support. When price briefly dipped toward $1.50 and then closed January above the $1.60 mark, some traders read that as a liquidity sweep that cleared short orders. That kind of action can presage either a bounce or a deeper move, depending on whether fresh buying shows up. What History Shows XRP moved sideways in 2023 and much of 2024 before breaking out from roughly $0.50 to $0.60 in November 2024. A fast advance followed, carrying price toward the $2.00 area and then higher into the $3.66 peak in July 2025. $XRP Crazy chart. Trading exactly at the last meaningful support on the chart before a huge air pocket. For traders, this is about the best risk/reward you get on an asset. Easy to cut loose with a small loss if support fails. pic.twitter.com/wySapwsnT0 — The Wolf Of All Streets (@scottmelker) January 31, 2026 Those gains set a higher structure, but they also left large pockets of profit taking above current levels. Reports say that repeated failed attempts above $3.50 marked weakening demand, which helped trigger the current drop back to the $1.6 region. Tight Downside, Open Upside According to Scott Melker, a.k.a. “Wolf of All Streets”, traders can manage risk with a stop between $1.45 and $1.50. That makes the downside measured. On the flip side, a recovery would likely test $2.00 first, then run into supply around $2.50–$2.60, before facing heavier resistance near $3.00 and the old highs. That path is straightforward on paper, but market context changes outcomes. Volume confirmation is absent from many of the bullish takes; a support hold without visible buying on the tape is fragile. Broader liquidity in US markets and risk appetite for crypto will also play a major role in whether the bounce can sustain itself. Related Reading: Crypto Hacks Explode: $370 Million Stolen In January Alone: Researchers XRP’s Sweet Spot: Small Risk, Big Upside For Melker, setups like XRP’s current level are rare in crypto right now — a defined support, a tight stop, and clear upside targets create a scenario where the potential reward outweighs the risk. He emphasizes that traders don’t need to predict every twist in the market; instead, focusing on trades with controlled losses and meaningful gains can be the difference between surviving and thriving in volatile conditions. In XRP’s case, the near-term risk is small relative to the possible rebound, making it a setup many are watching closely. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoin|crypto|digital currency|xrp|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57688984,
    "published": 1770097611000,
    "title": "Bitcoin miners get an open-source alternative as Tether launches MiningOS",
    "body": "Stablecoin issuer Tether said its new MiningOS is a modular, self-hosted software stack built to run mining operations from small home rigs to multi-site industrial setups.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57689811,
    "published": 1770099619000,
    "title": "Cathie Wood’s ARK boosts crypto shares amid stock pullback",
    "body": "ARK Invest increased exposure to Robinhood, Circle, BitMine, Bullish and other crypto-linked firms within several innovation and fintech-focused ETFs this week.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57689724,
    "published": 1770099264000,
    "title": "Bitcoin may fall to $56K as reasons for gains ‘remain hard to find’: Galaxy",
    "body": "Galaxy’s Alex Thorn says Bitcoin’s realized price is currently $56,000, a level it is likely to fall to without clear drivers to spark a rally.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57689771,
    "published": 1770099034000,
    "title": "Germans can now buy bitcoin, ether, solana products directly from their ING accounts",
    "body": "These crypto products receive the same German tax treatment as directly held bitcoin.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Ethereum News|Solana News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]