[
  {
    "id": 56095999,
    "published": 1766243598000,
    "title": "Bitcoin Has Entered a Bear Market, Say Analysts—Here's Why",
    "body": "As Bitcoin continues to languish below the $90,000 mark, CryptoQuant analysts are ready to call it: BTC has entered a bear market.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56097789,
    "published": 1766246454000,
    "title": "Bitcoin’s Cost Base Resets As New Whales Take The Lead",
    "body": "According to onchain data, Bitcoin may be moving into a different phase of market participation rather than simply hitting a classic cycle top or bottom. Related Reading: Bitcoin Feels The Weight Of Quantum Risk Concerns, Industry Leaders Warn New, large entrants are paying higher prices and holding on, and that change is reshaping where the network’s cost base sits. This is not just a short blip; the pattern has several clear data points behind it. New Whales Rewrite The Network Cost Base According to CryptoQuant figures, addresses classified as new whales now account for almost 50% of Bitcoin’s realized cap. Before 2025, that share rarely rose above 22%. Realized cap tracks the value of BTC at the price each coin last moved, so this shift shows where capital entered the system, not just who currently holds the most coins. Reports say the realized cap share from new whales continued to climb even during pullbacks, which suggests the network’s aggregate cost basis is being re-anchored at higher levels. Short-Term Demand Surges As Larger Players Buy Dips Short-term holder supply expanded by roughly 100,000 BTC over a 30-day span, reaching an all-time high, according to analysts. That jump in STH supply points to intense demand at the near-term level. Based on exchange flows, about 37% of BTC sent to Binance came from whale-size wallets, defined in the data set as holdings between 1,000–10,000 BTC. Reports from Hyblock show the cumulative volume delta for whale wallets — those in the $100,000–$10 million range — posted a positive $135 million delta this week. In contrast, retail wallets ($0–$10,000) and mid-size traders ($10,000–$100,000) logged negative deltas of $84 million and $172 million, respectively. In short: larger players absorbed selling pressure while smaller holders reduced their exposure. Related Reading: XRP ETFs Grow Past $60M As Price Struggles To Respond Derivatives Point To Short-Term Risk Price action was sharp. Bitcoin rose to $88,000 from $85,100 in about five hours after the Bank of Japan raised rates, a move that many investors had tracked as a potential macro trigger. Open interest climbed faster than the price, and funding rates turned positive, which indicates fresh margin-driven long positions were being added rather than a simple cover of shorts. That kind of flows pattern raises the chance of volatile reversals if sentiment shifts, even when spot demand looks healthy. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|whales",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56101698,
    "published": 1766252601000,
    "title": "Crypto user loses $50 million in 'address poisoning' scam",
    "body": "The scammer sent a small \"dust\" amount to the victim's transaction history, causing the victim to copy the address and send $50M to the scammer's address.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Web3|scam|Security|Onchain Transactions|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 56102427,
    "published": 1766253662000,
    "title": "OpenAI, Microsoft Sued Over ChatGPT's Alleged Role in Connecticut Murder-Suicide",
    "body": "The lawsuit alleges that OpenAI's ChatGPT reinforced delusions that preceded a fatal attack on a user’s mother.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 56102337,
    "published": 1766253607000,
    "title": "Bitcoin Coinbase Premium Gap Enters Deep Red Territory — What’s Happening?",
    "body": "Since the market-wide crash in early October, the Bitcoin price has struggled to resume any significant movement to the upside. The flagship cryptocurrency has continued to fall even deeper into bearish territory, breaching multiple support zones in the process. With the crypto market’s situation painting a bleak picture, the prevailing sentiment around its leader can hardly be said to be bullish. Interestingly, a recent on-chain evaluation puts into perspective the key players behind Bitcoin’s weakness. BTC Coinbase Premium Gap Reads –$57 In a recent post on the social media platform X, on-chain analyst Maartunn shared that a substantial portion of sell pressure seen in the Bitcoin market might be from the activities of US investors. This on-chain observation is based on the Coinbase Premium Gap metric, which measures whether US based investors are buying or selling Bitcoin more aggressively than the rest of the global market. Related Reading: Bitcoin Recent Dips Reveal Market Structure Issue Not Coming From Selling Pressure For context, the metric tracks the price gap between Bitcoin on Coinbase and Bitcoin on major offshore exchanges (for example, Binance). A positive reading typically indicates that Bitcoin is more expensive on Coinbase, meaning that US traders are buying aggressively. On the other hand, negative readings are interpreted as increased sales or reduced interest among investors in the United States. According to the analyst, the Coinbase Premium Gap recently dropped to a -$57 reading. As has been earlier implied, this deep negative value reveals that traders from the US are actively offloading, rather than accumulating Bitcoin. Interestingly, this heightened selling activity accompanies Bitcoin’s price momentum towards lower levels. Thus, it becomes clear that the sell-pressure reflected on Bitcoin’s price is due mainly to the absence of US demand. BTC Market Outlook According to historical data, Bitcoin’s direction in the long-term could go either way. While a negative Coinbase Premium Gap reading is usually indicative of a bearish phase in the short term, the long-term perspective is a little less straightforward. In past cycles, prolonged periods of negative readings have preceded the formations of market bottoms, after which prices saw recoveries to the upside. This often happens when sell-side pressure dwindles, and fresh demand enters the Bitcoin market. Related Reading: Ethereum Exchange Supply Just Crashed To New Lows, Why This Is Bullish For Price Hence, if this negative reading deepens and there is no fresh demand in the market, the Bitcoin price could follow suit and continue south. However, a reversal of the Coinbase Premium Gap to the upside — pushing it towards neutral or positive levels — could prove pivotal for the world’s leading cryptocurrency. As of this writing, Bitcoin holds a valuation of $88,260, reflecting no significant price movement in the past day. Featured image from Dall-E, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin Coinbase Premium Gap|Bitcoin news|bitcoin price|btc|btc price|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56104787,
    "published": 1766257702000,
    "title": "VanEck's new Avalanche ETF filing to include staking rewards for AVAX investors",
    "body": "The fund will use Coinbase Crypto Services as its initial staking provider and pay a 4% service fee, with rewards accruing to the fund and reflected in its net asset value.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|VanEck|Avalanche|AVAX|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 8,
        "NAME": "AVAX",
        "CATEGORY": "AVAX"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56105268,
    "published": 1766254129000,
    "title": "House Plan Seeks Tax Safe Harbor for Stablecoins, Crypto Staking",
    "body": "A bipartisan House duo is drawing up a cryptocurrency tax framework that would provide a safe harbor for some stablecoin transactions and delay taxation of rewards earned by verifying blockchain transactions.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56106713,
    "published": 1766260862000,
    "title": "Marshall Islands Test Crypto for Universal Basic Income as Cash and Banks Fall Short",
    "body": "The Marshall Islands recently used Stellar to pay universal basic income, testing whether crypto can stand in for basic banking",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|DeFi",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56106906,
    "published": 1766261253000,
    "title": "Uniswap’s UNI Jumps 19% as governance vote to activate protocol fees opens",
    "body": "UNI jumped after voting began on a proposal to activate Uniswap protocol fees, while broader crypto markets traded quietly.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Uniswap|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 53,
        "NAME": "UNI",
        "CATEGORY": "UNI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56110134,
    "published": 1766266769000,
    "title": "Bitcoin's apparent demand shrinks, signals new bear market: Analysts",
    "body": "Multiple factors, including ETF outflows, contracting demand, and price falling below key support levels, indicate the start of a BTC bear market.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56111717,
    "published": 1766269851000,
    "title": "Major Ethereum Metric Just Hit A New All-Time High – Can Price Reclaim $3,000?",
    "body": "Ethereum’s derivatives market is showing signs of a decisive shift beneath the surface, and price action is about to return above the $3,000 mark. On-chain data suggests trader behavior on major exchanges is shifting into a more accumulative phase. Even as ETH continues to linger below the psychologically important $3,000 price level, this metric indicates that market participants are already preparing for a bullish move and a test of direction in the days ahead. Related Reading: XRP ETFs Grow Past $60M As Price Struggles To Respond Ethereum Leverage Ratio Prints New All-Time High Data from on-chain analytics platform CryptoQuant shows that Ethereum’s Estimated Leverage Ratio on Binance has climbed to 0.611, the highest level ever recorded for this metric. The Estimated Leverage Ratio compares open interest to exchange reserves, and this offers insight into how much borrowed capital traders are deploying relative to available liquidity. Sustained increases in this ratio are a reflection of an increase in risk appetite from investors. It means that traders are committing larger leveraged positions in anticipation of favorable price movement. The current reading surpasses previous cycle peaks, and this environment can amplify price moves, since even modest spot price changes can trigger large liquidations when leverage is elevated. Ethereum: Estimated Leverage Ratio – Binance: CryptoQuant Another important metric points to an increase in Ethereum demand alongside record leverage. This metric is in the form of the Taker Buy Sell Ratio, which recently spiked to 1.13 on Binance. This is interesting because this level was last observed in September 2023. A reading above 1 indicates that market participants are executing more buy orders than sell orders. This combination of strong taker demand and rising leverage reveals optimism is now dominating short-term sentiment. The chart below shows the spikes in the Taker Buy Sell Ratio have more often than not coincided with periods of increased volatility. This buying pressure is now notable, with Ethereum trading around $2,900 in the past few hours, and this means that many traders are positioning ahead of a potential attempt to reclaim $3,000. Ethereum: Taker Buy Sell Ratio – Binance. Source: CryptoQuant Analyst Maps Out Ethereum’s Path Back Above $3,000 Adding a price-based perspective to the on-chain signals, crypto analyst Ted Pillows has outlined a clear technical roadmap for Ethereum’s next move. According to his analysis, ETH recently tapped into an important demand zone between $2,700 and $2,800 and has started to rebound from that area. This move occurred when Ethereum broke below $3,000 again this week to reach a low of $2,781 on December 18, which is highlighted on the chart below as a major support band. Ethereum Price Chart. Source: @TedPillows On X Pillows noted that holding this support zone keeps the bullish structure intact. If buyers continue to defend the $2,700-$2,800 range, Ethereum could build enough momentum for a push to the $3,100 to $3,200 region. That zone also sits just above the psychologically important $3,000 level. Related Reading: Bitcoin Feels The Weight Of Quantum Risk Concerns, Industry Leaders Warn The downside scenario is equally clear. A failure to hold the current support would expose Ethereum to a deeper pullback, with the chart pointing toward a potential retest of the $2,500 level. Featured image from Pexels, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|blockchain|crypto|crypto market|crypto news|cryptocurrency|digital currency|ETH|ethereum|ethusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56123817,
    "published": 1766294163000,
    "title": "Crypto community ‘very sorry’ over Senator Lummis' reelection decision",
    "body": "Industry supporters said crypto \"would not be where it is today\" without US Senator Cynthia Lummis, who announced she would not seek reelection next year.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56126314,
    "published": 1766300715000,
    "title": "US lawmakers propose tax break for small stablecoin payments, staking rewards",
    "body": "US lawmakers are proposing a $200 tax exemption for stablecoin payments and a multi-year deferral option for crypto staking and mining rewards.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56128163,
    "published": 1766305034000,
    "title": "Crypto activity in Brazil rises 43% with average investment surpassing $1,000: Report",
    "body": "Brazil’s crypto market showed signs of maturity in 2025, with higher transaction volumes, larger per-user investments and growing demand for low-risk products.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56130842,
    "published": 1766307615000,
    "title": "Bitcoin Remains In Bearish State Despite Recent Surge — Here’s Why",
    "body": "Although the Bitcoin price has recently displayed swift recovery to the upside, the broader picture still mirrors a bleak future for the flagship cryptocurrency. A new on-chain evaluation has surfaced, which suggests that Bitcoin’s recent price recovery could be happening within a broader, weak trend, with macroeconomic factors acting as the major influences. Related Reading: Bitcoin Could Drop To $70K As Bank Of Japan Rate Move Approaches—Analysts Weak Japanese Yen Fails To Ignite Crypto Risk Appetite In a QuickTake post on CryptoQuant, education group XWIN Research Japan explains reasons to believe that the Bitcoin market is merely at a “post-rebound adjustment” phase, rather than being underway to a full-scale price recovery. The research and education institution begins by pointing out the rate increment to 0.75% by the Bank of Japan. Since the move has been largely priced in, this rate hike did not give strength to the Japanese yen. Instead, a directly opposite result is the reality: the yen remains weak. Historically, a weak Yen has been a catalyst for ‘yen-funded carry trades’, where Japanese investors borrow Yen for the purpose of investing in other assets like cryptocurrencies for profits. However, XWIN Research Japan reveals that the current scenario deviates from historical trends. This conjecture depends on readings obtained from the Bitcoin: Estimated Leverage Ratio metric, which tracks how much leverage traders are using in the futures market, in relation to the amount of Bitcoin held on exchanges. Per the research group, there has been an ostensible decline in the estimated leverage ratio across exchanges. Also worth noting is the observation that there has been no leverage recovery, even during Bitcoin’s recent price fluctuations. Hence, it becomes clear that “yen-funded carry trade-driven risk-taking remains contained rather than expanding.” Related Reading: Bitcoin In Standby Mode: Weekend Ranges Rule Before Holiday ‘Chop’ Coinbase Premium Index Reveals Absent Spot Demand — Implications For Price At the same time, a very critical sign of a sustained bull market is nowhere to be found. This is monitored by the Coinbase Premium Index metric, which measures the difference between Bitcoin’s price on Coinbase (based in the U.S), and global exchange averages. Notably, the index has recovered from deep negative territory to moderate levels. However, this only indicates that selling pressure is easing, rather than intensifying. On the other hand, it also reveals that U.S spot investors are still uninterested in entering the market. XWIN Research Japan therefore concludes that, while the yen stays weak, “the lack of sustained spot buying implies that the current recovery does not yet reflect a structural uptrend.” Nonetheless, a possible scenario could also change the present narrative. This involves the Coinbase Premium Index regaining ground within positive territory, and price rising, without renewed heightened leverage. If these occur at the same time, XWIN Research Japan explains that it would be the perfect sign of an ongoing demand-driven accumulation. At press time, Bitcoin stands valued at $88,034, with CoinMarketCap data reflecting a minor 0.84% loss in the last 24 hours. Featured image from Pixabay, chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|Bank of Japan|Bear manrket|bitcoin|btcusd|BTCUSDT|Coinbase Premium|japanese yen",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56135900,
    "published": 1766300425000,
    "title": "Citi Projects $143,000 Base Case For Bitcoin In 12-Month Outlook",
    "body": "Bitcoin is back in focus after an outlook from Citigroup, where analysts mapped out a wide price range for the next year that captures both upside momentum and lingering downside risks. The bank’s latest projections point to a base-case target of $143,000 over the next 12 months, anchored in expectations around a growth in ETF participation and clearer regulatory frameworks. Furthermore, Citi outlined an optimistic path that stretches to $189,000, alongside a bearish scenario that projects a downward move to $78,500. Related Reading: Banks Could Favor A Higher XRP Price, Finance Expert Says ETF Adoption And Institutional Demand Citi’s base and bullish scenarios are built around the same core thesis: the growing role of regulated investment vehicles in shaping Bitcoin’s market structure. Crypto analysts are always noting that Spot Bitcoin ETFs have lowered barriers for institutional investors, making it easier for large pools of capital to gain exposure without direct custody concerns. Analysts at Citi are leaning into this school of thought and are projecting bullish price levels for Bitcoin. With the expectations of ETF interest and regulatory clarity in mind, Citi sees Bitcoin trending toward $143,000 under its base case within the next 12 months. Interestingly, the outlook of a bullish scenario from the analysts projected that Bitcoin will be trading somewhere around $189,000 within the next 12 months. These projections are notable considering the current state of Bitcoin’s price action, which is currently struggling near $90,000. They are also contingent on a turnaround in the state of flows surrounding Spot Bitcoin ETFs. LATEST: 📈 Citi analysts put Bitcoin’s 12-month price base case at $143,000, driven by anticipated ETF interest and regulatory clarity, with a bullish scenario of $189,000 and a bearish one of $78,500. pic.twitter.com/jAukEDkXQe — CoinMarketCap (@CoinMarketCap) December 20, 2025 Despite its constructive outlook, Citi also flagged downside risks that could derail bullish momentum. A bearish framework by Citi analysts projects the Bitcoin price sliding to $78,500 within the next 12 months. Fundstrat’s Internal View Contrasts With Citi’s Optimism Citi’s bullish projections are in contrast to a more cautious internal outlook recently reported by Fundstrat Global Advisors. Internal discussions within the firm are warning of a possible drawdown of the Bitcoin price toward the $60,000 to $65,000 range. According to an internal note circulated to clients, Fundstrat’s head of digital asset strategy, Sean Farrell, cautioned that a further correction may unfold during the first half of 2026 as macroeconomic pressures and tightening financial conditions weigh on risk assets. According to @_FORAB, Tom Lee’s fund, Fundstrat, stated in its latest 2026 cryptocurrency strategy advice to internal clients that a significant correction is expected in the first half of the year, completely contradicting Tom Lee’s public statements. The internal report sets… pic.twitter.com/HbRoNzr85z — Wu Blockchain (@WuBlockchain) December 20, 2025 The report outlined downside targets that place Bitcoin in the $60,000 to $65,000 range, a level that would represent a 30% decrease from its current price range. The same internal framework also projected Ethereum retreating downwards to $1,800 to $2,000, alongside Solana falling into a $50 to $75 range. Related Reading: Bitcoin Feels The Weight Of Quantum Risk Concerns, Industry Leaders Warn This goes against the public stance of Fundstrat co-founder Tom Lee, who has publicly maintained a bullish stance on the long-term trajectory and new all-time highs for Ethereum and Bitcoin. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|altcoins|bitcoin|bitcoin price|btc|citi|crypto market|crypto news|cryptocurrency",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]