[
  {
    "id": 54682688,
    "published": 1763690456000,
    "title": "Bitcoin OG Owen Gunden Deposits Final 2,499 BTC ($228M) to Kraken – Details",
    "body": "Bitcoin is currently trading below $92,000, and the market is showing clear signs of exhaustion as selling pressure intensifies. Fear has pushed sentiment toward the bearish end of the spectrum, with many analysts now arguing that BTC may be entering a new bear market. The loss of key support levels and the rapid acceleration of downside volatility have only fueled these concerns, especially as short-term holders continue to capitulate at scale. Related Reading: Bitcoin Capitulation Deepens Around $90K Level: Classic Late-Stage Fear Structure Emerging However, not all perspectives are bearish. Some analysts believe that Bitcoin may be forming a local bottom, as the current correction resembles previous mid-cycle retracements seen during strong bull markets. They argue that the broader macro environment remains supportive and that long-term holders have not shown signs of structural weakness. As selling pressure concentrates among weak hands, the possibility of a reversal increases — especially once forced sellers exhaust themselves. Adding to the uncertainty, new on-chain data from Lookonchain revealed that Bitcoin OG Owen Gunden just deposited all his remaining 2,499 BTC into Kraken roughly an hour ago. Moves like this often trigger speculation, as exchange deposits from early holders can signal potential selling. Yet historically, similar events have also occurred near cycle bottoms when panic is at its peak. A Massive BTC Transfer Sparks Market Speculation According to fresh data from Lookonchain, Bitcoin OG Owen Gunden has just deposited his remaining 2,499 BTC (worth $228 million) into Kraken roughly an hour ago. This move has immediately raised questions across the market, as large exchange deposits from early whales often signal potential selling pressure. What makes this development even more notable is the context: just two weeks ago, Lookonchain reported that Gunden appeared ready to offload his entire 11,000 BTC stash — a position worth over $1.12 billion at the time. Now, with this final deposit, it appears he has officially completed the move. For many traders, this confirms that one of the oldest and largest long-term holders has fully exited or is preparing to exit the market. Such whale behavior can amplify fear during corrective phases, especially as Bitcoin continues to struggle below $92K. Moves of this scale not only contribute to short-term volatility but also influence sentiment by signaling that even early accumulators may be reducing exposure. However, historically, capitulation events from long-term holders have often coincided with or preceded major turning points. If this massive transfer marks the end of Gunden’s sell-off, the market may soon absorb the pressure — potentially clearing the path for a recovery once the fear subsides. Related Reading: Nearly 7M Bitcoin Now Sitting At A Loss: Highest Unrealized Pain Since January 2024 Short-Term Trend Still Under Pressure Bitcoin’s 4-hour chart reveals a market that remains firmly under short-term selling pressure, despite occasional relief bounces. The price is struggling to reclaim $92,000, a level that previously acted as support but is now working as resistance. The series of lower highs and lower lows highlights a persistent downtrend that has shaped BTC’s trajectory since early October. All major moving averages—the 50 SMA, 100 SMA, and 200 SMA—are positioned above current price action and pointing downward. This alignment confirms a clear short-term bearish structure. Each time BTC attempts to recover, it meets strong resistance at these declining MAs, signaling that sellers remain in control. The most recent bounce barely reached the 50 SMA before being rejected again, reinforcing the weakness of buyer momentum. Related Reading: XRP Supply In Profit Falls to 58.5% – Lowest Since 2024 Despite Higher Price Volume remains elevated on downswings, which indicates that sell-offs continue to be driven by conviction rather than random volatility. Buyers are stepping in around the $89,000–$91,000 zone, but so far, this support has only produced temporary pauses rather than meaningful reversals. For a structural shift, BTC would need to reclaim at least the $95,000 area and break above the 100 SMA. Until then, the trend remains tilted toward further downside or continued consolidation near current levels. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin analysts|Bitcoin news|Bitcoin OG|Bitcoin Whale Activity|btc|BTCUSDT|Owen Gunden",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54685107,
    "published": 1763695045000,
    "title": "Bitcoin Price Crashes Under $90K, Triggering Fresh Fears of Deeper Weakness",
    "body": "Bitcoin price started another decline below $90,000. BTC is now showing bearish signs and might struggle to recover above $88,5000. Bitcoin started a fresh decline below $92,000 and $90,000. The price is trading below $90,000 and the 100 hourly Simple moving average. There is a bearish trend line forming with resistance at $91,000 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move down if it settles below the $90,000 zone. Bitcoin Price Dips Further Bitcoin price failed to stay in a positive zone above the $90,000 level . BTC bears remained active below $88,800 and pushed the price lower. The bears gained strength and were able to push the price below the $87,500 zone. A low was formed at $85,276, and the price is now consolidating losses below the 23.6% Fib retracement level of the recent decline from the $92,872 swing high to the $85,276 low. Bitcoin is now trading below $90,000 and the 100 hourly Simple moving average . Besides, there is a bearish trend line forming with resistance at $91,500 on the hourly chart of the BTC/USD pair. If the bulls attempt another recovery wave, the price could face resistance near the $87,000 level. The first key resistance is near the $89,000 level and the 50% Fib retracement level of the recent decline from the $92,872 swing high to the $85,276 low. The next resistance could be $91,000 and the trend line. A close above the $91,000 resistance might send the price further higher. In the stated case, the price could rise and test the $92,500 resistance. Any more gains might send the price toward the $93,200 level. The next barrier for the bulls could be $94,500 and $95,000. More Losses In BTC? If Bitcoin fails to rise above the $90,000 resistance zone, it could start another decline. Immediate support is near the $85,500 level. The first major support is near the $85,000 level. The next support is now near the $83,200 zone. Any more losses might send the price toward the $82,500 support in the near term. The main support sits at $80,000, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $85,500, followed by $85,000. Major Resistance Levels – $87,000 and $89,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54684706,
    "published": 1763694029000,
    "title": "Bitcoin implodes as volatility from Big Tech, AI bubble fears, spreads to crypto",
    "body": "Bitcoin price corrected alongside major US equities as a tech-led sell-off and investor concerns over AI spending and a Federal Reserve policy shift hit markets hard.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54685557,
    "published": 1763695838000,
    "title": "BTC Falls Toward Mid-$80Ks as Market Structure Weakens Into Year-End",
    "body": "FlowDesk flags sustained sell pressure from old wallets, QCP notes a sudden hawkish Fed repricing, and Deribit data shows downside positioning now dominating.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|btc|btc price|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54686557,
    "published": 1763697659000,
    "title": "Trump’s WLFI Moves To Contain Wallet Breach While Federal Inquiry Looms",
    "body": "World Liberty Financial (WLFI) said it is reallocating funds and confirming user identities after several wallets were compromised ahead of its platform launch. Related Reading: XRP Supply Shock Ahead? ETFs Could Consume It All, Analyst Predicts According to WLFI’s post on X, the company froze the affected addresses in September and has been verifying ownership before moving assets back to users who pass the checks. Wallet Breaches And Response Reports have disclosed that the breaches came from either phishing attacks or exposed seed phrases, not from WLFI’s own platform or smart contracts, the company said. WLFI described the problem as linked to third-party security failures and said only a “small subset” of users were hit — though it did not give exact figures on how many accounts or how much crypto was involved. 1/ Prior to WLFI’s launch, a relatively small subset of user wallets were compromised via phishing attacks or exposed seed phrases. Since then, we’ve tested new smart contract logic to safely reallocate user funds and verified users’ identity via KYC checks. Shortly, users who… — WLFI (@worldlibertyfi) November 19, 2025 On-chain data cited by analyst Emmett Gallic of Arkham shows WLFI executed an emergency action that burned 166.67 million WLFI tokens, a move valued at $22.14 million from a compromised address, and then shifted tokens to a recovery address. That firewall step appears intended to limit further loss while the company sorts ownership questions. World Liberty Fi executed an emergency function burning 166.667M $WLFI ($22.14M) from compromised address, reallocating to a recovery address. Function designed for two scenarios: An investor loses wallet access before vesting OR malicious account acquires WLFI via exploit pic.twitter.com/VSUDWhDPCR — Emmett Gallic (@emmettgallic) November 19, 2025 Regulatory Spotlight Grows The timing of the security disclosure has drawn extra attention. Based on reports, Senators Elizabeth Warren and Jack Reed asked the DOJ and Treasury to review alleged WLFI token sales tied to sanctioned parties. Their letter referenced a watchdog report from Accountable.US that linked transactions to the Lazarus Group — a North Korea-linked actor on sanctions lists — and to an Iranian crypto exchange. It remains unclear whether the wallet compromises are related to the transactions lawmakers flagged. Experts Question On-Chain Findings Security researchers have pushed back on some of the watchdog’s claims. Taylor Moynahan of MetaMask and Nick Bax of Ump.eth said the Accountable.US analysis misread certain on-chain activity. Another day in crypto with wild allegations. Today, it’s that a North Korea-linked address invested in WLFI. I do a some DPRK crypto research myself, so I decided to take a look at their findings. They’re bad and an innocent user is out $100k because of it🧵 pic.twitter.com/yJKEH04nup — Nick Bax.eth (@bax1337) November 18, 2025 Related Reading: With 42% Of XRP Holders Underwater, Analysts Say The Altcoin Could Crash Even Further Bax argued that the report mistakenly connected a wallet tied to an individual known as “Shryder” with DPRK-linked activity, which led to the freezing of roughly $95,000 in WLFI tokens. WLFI has responded by emphasizing user protection and compliance. The company said it prioritized freezing vulnerable wallets and verifying rightful owners before any transfers. It also announced tests of revised smart contract logic meant to reduce the chance of similar breaches in future rollouts. Featured image from Gemini, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|bitcoin|crypto|North Korea|Trump|WLFI",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 205,
        "NAME": "TOKEN SALE",
        "CATEGORY": "TOKEN SALE"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54687157,
    "published": 1763698699000,
    "title": "Ethereum Price Declines Again, Consolidates Below $3K After Latest Breakdown",
    "body": "Ethereum price failed to stay above $3,000 and tested $2,770. ETH is now attempting to recover but faces resistance near $2,880. Ethereum started a fresh decline after it failed to stay above $3,000. The price is trading below $3,000 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance at $3,050 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move down if it settles below the $2,800 zone. Ethereum Price Dips Further Ethereum price failed to continue higher above $3,050 and started a fresh decline, like Bitcoin . ETH price dipped below $3,000 and entered a bearish zone. The decline gathered pace below $2,880 and the price dipped below $2,800. A low was formed at $2,770 and the price is now consolidating losses below the 23.6% Fib retracement level of the recent decline from the $3,058 swing high to the $2,770 low. Ethereum price is now trading below $3,000 and the 100-hourly Simple Moving Average . If there is another recovery wave, the price could face resistance near the $2,920 level and the 50% Fib retracement level of the recent decline from the $3,058 swing high to the $2,770 low. The next key resistance is near the $2,950 level. The first major resistance is near the $3,050 level. There is also a key bearish trend line forming with resistance at $3,050 on the hourly chart of ETH/USD. A clear move above the $3,050 resistance might send the price toward the $3,120 resistance. An upside break above the $3,120 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $3,220 resistance zone or even $3,250 in the near term. Another Drop In ETH? If Ethereum fails to clear the $2,920 resistance, it could start a fresh decline. Initial support on the downside is near the $2,770 level. The first major support sits near the $2,740 zone. A clear move below the $2,740 support might push the price toward the $2,680 support. Any more losses might send the price toward the $2,620 region in the near term. The next key support sits at $2,550 and $2,500. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI – The RSI for ETH/USD is now below the 50 zone. Major Support Level – $2,770 Major Resistance Level – $3,050",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54688132,
    "published": 1763700481000,
    "title": "XRP Price Extends Losses, Deepens Move Below $2.0 Amid Softer Sentiment",
    "body": "XRP price started a fresh decline below $2.050. The price is now struggling and faces resistance near the $2.050 pivot level. XRP price started a fresh decline below the $2.050 zone. The price is now trading below $2.050 and the 100-hourly Simple Moving Average. There is a bearish trend line forming with resistance at $2.080 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move down if it settles below $2.00. XRP Price Dips Further XRP price attempted a recovery wave above $2.120 but failed to continue higher, like Bitcoin and Ethereum . The price started a fresh decline below $2.050 and $2.020. There was a move below the $2.00 support level. A low was formed at $1.957, and the price is now consolidating losses below the 23.6% Fib retracement level of the downward move from the $2.141 swing high to the $1.9575 low. The price is now trading below $2.050 and the 100-hourly Simple Moving Average. If there is a fresh upward move, the price might face resistance near the $2.050 level and the 50% Fib retracement level of the downward move from the $2.141 swing high to the $1.9575 low. The first major resistance is near the $2.080 level. There is also a bearish trend line forming with resistance at $2.080 on the hourly chart of the XRP/USD pair. A close above $2.080 could send the price to $2.120. The next hurdle sits at $2.150. A clear move above the $2.150 resistance might send the price toward the $2.20 resistance. Any more gains might send the price toward the $2.250 resistance. The next major hurdle for the bulls might be near $2.320. More Losses? If XRP fails to clear the $2.080 resistance zone, it could start a fresh decline. Initial support on the downside is near the $1.950 level. The next major support is near the $1.920 level. If there is a downside break and a close below the $1.920 level, the price might continue to decline toward $1.880. The next major support sits near the $1.8450 zone, below which the price could continue lower toward $1.80. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $1.950 and $1.920. Major Resistance Levels – $2.050 and $2.080.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54688156,
    "published": 1763700359000,
    "title": "Crypto Sentiment Hits 'Extreme Fear' Amid $2.7 Trillion S&P 500 Wipeout",
    "body": "Widening U.S. credit spreads, overextended market gains, and an uncertain macro landscape are being blamed for Thursday's wipeout.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54688560,
    "published": 1763701211000,
    "title": "Why Bitwise Thinks Bitcoin Still Hits $200,000 In 2026",
    "body": "Ryan Rasmussen, Head of Research at Bitwise, used a Yahoo Finance appearance to restate Bitwise’s view that Bitcoin is headed to $200,000 in 2026, while simultaneously characterizing the current sell-off as a maturing-market shakeout rather than a trend break. Is The Bottom In For Bitcoin? He opened with a near-term assessment that “we’re closer to the bottom here today than we have been for the past few weeks,” linking the drawdown to sharply risk-off conditions and to ETF-era flow dynamics. In his framing, Bitcoin “really was a leader of this risk-off move starting in mid-October,” and he expects it to “be a leader to the upside once things start to turn around,” adding that the market feels nearer to that inflection than it did “a week or two weeks ago.” When asked whether spot Bitcoin ETFs have become a double-edged sword, Rasmussen agreed, describing a market that now has deeper liquidity but more cross-currents. “Bitcoin, in our view, is one of the biggest technological developments of the past 15 years,” he said, before explaining that institutionalization brings “new investors and adds more liquidity to the market,” yet also means “we’re seeing a lot more choppiness in times where risk-off moves happen.” He pointed to hedge funds rotating in and out via basis trades and emphasized that “you just have more market participants.” Over time, he expects that shift to damp volatility, but not in a straight line: “throughout that journey, we’re going to see some choppiness, and certainly over the past month, we’ve seen that.” Related Reading: Will Bitcoin Bottom At $56,000? CryptoQuant CEO Presents The Data Pressed on why volatility still looks elevated, Rasmussen separated short-horizon spikes from long-run trend. “If you look at the trend over the past 10 years, volatility has certainly been falling,” he said, but conceded that “over this short-term period, you do see spikes in volatility.” The composition of buyers is, in his view, changing in a stabilizing direction. “The buyers for Bitcoin that we’re seeing come into the market today are more long-term buyers than we’ve seen in the past,” he said, naming wealth managers and financial advisors who “are adding Bitcoin to model portfolios” and “rebalancing on a standard basis.” That institutional style of demand “should all reduce volatility, add more long-term demand,” though he also noted a counterweight: corporate treasury buying that was strong earlier in the year has faded. “The corporate treasuries that are purchasing Bitcoin were coming in in size earlier this year, and that’s really dried up,” he said, arguing that this demand pause is “in part due to this sell-off that we’ve seen in October.” Bitcoin Still Set for $200,000 By 2026 Rasmussen acknowledged the pain of lower prices for recent buyers, but insisted the medium-term path remains higher. “Lower prices are a gift and a curse, of course,” he said. “A lot of investors are feeling pain right now who bought Bitcoin above $100,000 or closer to the $125,000 mark, but we believe that Bitcoin’s going to end the year higher than it is today.” He reiterated that the short-term bottoming process is likely advanced, and then pivoted to his structural thesis: “Institutions are finally here.” He stressed that adoption is gradual rather than instantaneous: “That doesn’t mean that right away they deploy all of their capital.” Even so, he cited early signals such as endowment participation: “even Harvard, we saw with their recent filing, is buying Bitcoin in their endowment.” Related Reading: Bitcoin Capitulation Deepens Around $90K Level: Classic Late-Stage Fear Structure Emerging On macro, Rasmussen conceded an irony that an asset marketed as sovereign and untethered now reacts to central-bank expectations. Post-COVID, he said, Bitcoin has traded in a “fiscally-dominated environment where rate cuts and other macro elements do play more of a role,” and correlations to equities have “spike[d] or raise[d].” Still, he argued correlations are drifting back toward historical lows, and he emphasized Bitcoin’s tendency to do well in “low rate environments and risk on environments.” Regarding the December Fed meeting, he said “no cut in December is largely priced into the market,” and suggested investors have “already started to turn to 2026.” The price target itself was stated unambiguously. “So this year, we had a price target of $200,000. And I think it’s safe to say that come December, that’s not going to happen. But we do believe that in 2026, Bitcoin will hit $200,000,” Rasmussen said. He attributed that forecast to institutional inflows arriving “in waves,” spanning “wealth managers or endowments or pensions or corporations or governments,” which he believes are creating “a systemic imbalance of demand versus supply.” At press time, BTC traded at $91,205. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|bitcoin price prediction|bitwise|btc|BTC news|btc price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54688647,
    "published": 1763701151000,
    "title": "Bitcoiners lose their mind after Scott Bessent walks into a Bitcoin bar",
    "body": "Bitcoiners viewed US Treasury Secretary Scott Bessent’s appearance at the opening night of the Bitcoin-themed bar as “a sign” for Bitcoin.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54688646,
    "published": 1763701041000,
    "title": "Grok fan-girling Elon Musk shows why AI must be decentralized",
    "body": "Grok couldn’t stop singing Elon Musk’s praises, arguing he could beat Mike Tyson in a fight and was fitter than NBA superstar LeBron James.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54689535,
    "published": 1763702903000,
    "title": "Dogecoin (DOGE) Falls Again as Trader Sentiment Turns Increasingly Bearish",
    "body": "Dogecoin started a fresh decline below the $0.1550 zone against the US Dollar. DOGE is now consolidating losses and might face hurdles near $0.1560. DOGE price started a fresh decline below the $0.150 level. The price is trading below the $0.150 level and the 100-hourly simple moving average. There is a bearish trend line forming with resistance at $0.1550 on the hourly chart of the DOGE/USD pair (data source from Kraken). The price could extend losses if it stays below $0.1550 and $0.1620. Dogecoin Price Dips Further Dogecoin price started a fresh decline after it closed below $0.1620, like Bitcoin and Ethereum . DOGE declined below the $0.160 and $0.1550 support levels. The price even traded below $0.150. A low was formed near $0.1448, and the price is now showing bearish signs below the 23.6% Fib retracement level of the downward move from the $0.1593 swing high to the $0.1448 low. There is also a bearish trend line forming with resistance at $0.1550 on the hourly chart of the DOGE/USD pair. Dogecoin price is now trading below the $0.1550 level and the 100-hourly simple moving average. If there is a recovery wave, immediate resistance on the upside is near the $0.1520 level. The first major resistance for the bulls could be near the $0.1550 level, the trend line, and the 76.4% Fib retracement level of the downward move from the $0.1593 swing high to the $0.1448 low. The next major resistance is near the $0.1620 level. A close above the $0.1620 resistance might send the price toward the $0.170 resistance. Any more gains might send the price toward the $0.1740 level. The next major stop for the bulls might be $0.1880. More Losses In DOGE? If DOGE’s price fails to climb above the $0.1550 level, it could continue to move down. Initial support on the downside is near the $0.1450 level. The next major support is near the $0.1320 level. The main support sits at $0.1250. If there is a downside break below the $0.1250 support, the price could decline further. In the stated case, the price might slide toward the $0.120 level or even $0.1120 in the near term. Technical Indicators Hourly MACD – The MACD for DOGE/USD is now gaining momentum in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for DOGE/USD is now below the 50 level. Major Support Levels – $0.1450 and $0.1380. Major Resistance Levels – $0.1550 and $0.1620.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "DOGE|DOGE news|Doge price|DOGE USD|DOGE/BTC|DOGE/USDT|Dogecoin|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54689996,
    "published": 1763703437000,
    "title": "MSCI index likely to kick out crypto treasuries, exec warns",
    "body": "If the MSCI decides to exclude digital asset treasuries, index-tracking funds would need to sell, and that alone “creates meaningful pressure on the affected names.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54690658,
    "published": 1763704839000,
    "title": "Bitcoin Crash Dominated By US Selling, CryptoQuant Data Shows",
    "body": "On-chain analytics firm CryptoQuant has revealed how selling from US Bitcoin investors has dominated during the recent market downturn. Bitcoin Coinbase Premium Gap Points To US Selloff In a new thread on X, CryptoQuant has talked about some key pieces of data related to the US-dominated Bitcoin selloff. The first indicator that CryptoQuant has shared is the “Coinbase Premium Gap,” which keeps track of the difference between the BTC price listed on Coinbase (USD pair) and that on Binance (USDT pair). Related Reading: Dogecoin’s Strongest Support Zone Revealed—Here’s The Level As the below chart shows, the 30-hour moving average (MA) value of this metric has plummeted into the red territory recently. A negative value on the Coinbase Premium Gap indicates that the asset is trading at a price lower on Coinbase as compared to Binance. The former exchange is the preferred platform of the American investors, especially large institutional entities, while the latter one hosts a global traffic. As such, a red premium can be a sign that US-based whales are selling more than world investors. “The Coinbase Premium Gap dropped as low as -$90, which is a sign of strong U.S. selling pressure,” explained the analytics firm. Another metric that points toward extraordinary selling pressure from the American traders during the recent price decline is the cumulative return for the different trading sessions. From the above chart, it’s visible that both European and Asia-Pacific trading hours have seen an almost neutral return in Bitcoin over the past month. The American session, on the other hand, has witnessed a deep negative value. Another major way institutional entities invest in Bitcoin is through the spot exchange-traded funds (ETFs), investment vehicles that hold BTC on behalf of their investors, and allow them to gain off-chain exposure to the coin’s price movements. These funds have also witnessed outflows during the selloff in the last few weeks. ETFs have seen net outflows for three straight weeks now, which is a departure from last year’s Q4 trend, where 194,000 BTC flowed into the wallets connected with these funds, but in Q4 2025 so far, 8,000 BTC has flowed out instead. “ETF outflows continue to weigh on the BTC spot market,” noted CryptoQuant. Related Reading: Bitcoin Short-Term Holders Panic: 65,200 BTC Sent To Exchanges At Loss As for what could be next for Bitcoin, the cost basis of the spot ETFs may be worth watching for, which is located at $86,566. If the cryptocurrency breaches below this mark, holdings of the spot ETFs will go underwater. BTC Price At the time of writing, Bitcoin is floating around $92,000, down more than 10% over the last seven days. Featured image from Dall-E, CryptoQuant.com, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin Coinbase Premium Gap|bitcoin crash|Bitcoin ETFs|Bitcoin Selling|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54691430,
    "published": 1763706131000,
    "title": "Plume CEO tips RWA to grow 3-5x in 2026 as it grows past crypto natives",
    "body": "Plume announced on Wednesday that Securitize, a tokenization platform backed by BlackRock and Morgan Stanley, had inked a deal to deploy institutional-grade assets on Plume’s Nest staking protocol.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54692722,
    "published": 1763708427000,
    "title": "BitMine’s Unrealized Losses Hit $3.7B As Ethereum (ETH) Price Struggles Below $3,000",
    "body": "A recent report discussed how Digital Asset Treasury (DAT) companies like BitMine and Strategy are sitting on billions of dollars of unrealized profits as Ethereum (ETH) and Bitcoin (BTC) lose crucial support levels. Related Reading: This Altcoin Soars 20% In One Day Following Major Saudi Arabia Partnership DATs To Face ‘Increasing Scrutiny’ On Thursday, crypto insights company 10x Research reported that the largest Ethereum Treasury company, BitMine Immersion Technologies, has a multi-billion-dollar paper loss after the ongoing market correction, which has sent ETH to multi-month lows. “Bitmine is now down more than $1,000 per ETH, implying about $3.7 billion in unrealized losses before even accounting for the hefty NAV [net asset value] premium public-market investors paid on top,” the report highlighted. 10x Research believes that treasury companies will struggle to attract new retail investors amid the current market environment, where existing shareholders are sitting on billions of dollars in losses. When NAV rises, “old” shareholders benefit; when it falls, the damage compounds, a dynamic DAT investors often underestimate. When the premium inevitably shrinks to zero, as it is doing now, investors find themselves trapped in the structure, unable to get out without significant damage, a true Hotel California scenario. Unlike Exchange-Traded Funds (ETFs), Digital Asset Treasuries “layer on complex, opaque, and often hedge-fund-like fee structures that can quietly erode returns,” the report added, noting that many investors are unaware that DATs embedded costs “far exceed” the management fee charged by asset managers like BlackRock on its Bitcoin (BTC) and ETH ETFs. Moreover, 10x Research argued that with the potential introduction of a staked Ethereum ETF by BlackRock, “the economics of DATs are likely to face increasing scrutiny” as retail investors reallocate to a low-cost source of yield. BitMine Remains Confident On Ethereum Despite DAT challenges and ETH’s price action, BitMine has continued to bet on the King of Altcoins. According to Lookonchain data, a new wallet suspected to be linked to the Ethereum-focused treasury company purchased 21,054 ETH, worth around $66.57 million at the time, on Tuesday night. In its November Chairman’s Message, Thomas ‘Tom’ Lee, noted that the crypto market prices have not recovered from the October 10 liquidation event, and “the lingering weakness has the hallmarks of a market maker (or two) suffering from a crippled balance sheet.” BitMine does not believe crypto prices have peaked for this cycle, he added, suggesting that “a crypto cycle top is likely 12-36 months away.” On the contrary, Lee told CNBC News on Monday that the market is “pretty close” to bottoming this week. Crypto suffered from that liquidation event on October 10th, but because the fundamental story is intact and crypto discounts the future, that’s why it’s volatile, but it still looks pretty attractive here. Related Reading: Solana Reclaims $140 As Second Wave Of SOL ETFs Debut – Is A Rebound Coming? Notably, ETH has lost the $3,000 support for the first time since July, retesting the $2,800 area on Thursday morning. However, Lee has affirmed that “Ethereum is undervalued because number one, the story is gaining relative to Bitcoin this year. But two, we’re getting this sort of intrinsic floor because of the value that the assets locked onto the Ethereum blockchain.” As of this writing, Ethereum is trading at $2,840, a 29% decline in the monthly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|10x Research|BitMine|BlackRock|crypto market correction|DATs|ETH|ETH DATS|ethereum|Ethereum ETFs|ethereum price|Ethereum treasury|ETHUSDT|Strategy|Tom Lee",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54692775,
    "published": 1763706131000,
    "title": "Plume CEO tips RWA to grow 3-5x in 2026 as it grows past crypto natives",
    "body": "Plume says that Securitize, a tokenization platform backed by BlackRock and Morgan Stanley, has inked a deal to deploy institutional-grade assets on Plume’s Nest staking protocol.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54694171,
    "published": 1763711018000,
    "title": "Bitcoin ETFs Have Bled a Record $3.79B in November",
    "body": "U.S.-listed spot BTC and ETH ETFs see record outflows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Ethereum News|Solana News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54694740,
    "published": 1763712030000,
    "title": "Bitcoin Bear Market Confirmed? Expert Predicts Price Target Of $40,000 By Late 2026",
    "body": "Bitcoin (BTC) experienced a slight rebound after reaching a near eight-month low of $87,500 on Wednesday. By Thursday, the leading crypto surged back toward $90,000. However, market expert Leshka warns that this brief increase may signal only the start of a new distribution phase for Bitcoin, as selling pressure continues to build. Possible Bottom Between $40,700 And $47,500 In a recent post on X (formerly Twitter), Leshka assessed Bitcoin’s position on the weekly chart, identifying critical demand zones between $40,700 and $47,500 that could take shape throughout 2026. She suggested that these levels might represent the bottom for Bitcoin during the anticipated bear market. If such forecasts materialize, this could indicate price drops of 47% to 54% from current values. Related Reading: CEO Cuts Cardano Founder’s Bitcoin Price Forecast, Warns Bear Market Just Starting Despite these potential lows, Leshka remains optimistic about Bitcoin’s long-term trajectory. She mentioned that if these price targets are met, Bitcoin could rebound dramatically, reaching new all-time highs of around $150,000 by 2027. In the immediate time, however, bears appear to have the upper hand in the market. Analyst Ali Martinez recently noted that the TD Sequential indicator, which is designed to signal potential market reversals, has flashed a sell signal for Bitcoin. Historically, this indicator has been a reliable predictor of price corrections, with past occurrences resulting in drops of 78% and 32%. A median correction based on these previous downturns would indicate a possible price target of $40,000, aligning with Leshka’s forecasts for Bitcoin. Analyst Predicts Temporary Rally For Bitcoin Technical analysis from Crypto Feras also contributes to this bearish sentiment. He pointed out that Bitcoin has breached its 50-day moving average (MA50) placed above $102,000, suggesting that a period of reflection is in order. Feras indicated that the exponential moving averages (EMA89-99) could provide initial support at $88,500, typically facilitating a short-term “bearish retest” of the MA50 after a breakdown. The analyst noted that this potential rally usually lasts for two to five weeks and may see both Bitcoin and altcoins behave positively, even though investors might misinterpret it as a return to a bull market. Related Reading: BlackRock’s Bitcoin ETF Bleeds Over $500 Million In Its Biggest One-Day Outflow Additional support is noted at $84,000, which could be briefly retested. Feras suggested that this scenario might represent a final bear trap before a more prolonged downturn, a historical trend that could repeat itself. He also addressed the question of when the market might shift back into “bull mode.” According to Feras, Bitcoin will remain in a bear market as long as it trades below its weekly MA50. Once Bitcoin reclaims this important moving average, discussions regarding a potential bull market or continuation of a bull trend could resume. Until that happens, he emphasized that it is premature to label Bitcoin’s current phase as anything but bearish. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|bitcoin technical analysis|btc|BTC news|btc price|BTCUSDT|crypto|crypto news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54696363,
    "published": 1763714930000,
    "title": "Crypto Bulls See $1.7B Liquidations as Bitcoin Swiftly Nears $80K",
    "body": "The Crypto Fear & Greed Index fell to 11 on Monday — deep within “extreme fear” territory and its lowest reading since late 2022.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54697203,
    "published": 1763716510000,
    "title": "SoftBank’s PayPay changes the game for Binance Japan users",
    "body": "Operated by SoftBank, the backer of one of the world’s top 10 public Bitcoin holders, PayPay is integrating with Binance Japan ahead of its expected US IPO in December.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54696866,
    "published": 1763715915000,
    "title": "BlackRock Bitcoin ETF sheds $2.47B in November as outflows hit record $3.79B",
    "body": "BlackRock’s IBIT drives November’s record ETF outflows, bleeding $2.47 billion and accounting for 63% of the $3.79 billion withdrawn from US spot Bitcoin ETFs.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54697382,
    "published": 1763716993000,
    "title": "DOGE Chart Turns Fully Bearish After Multi-Level Support Failure",
    "body": "Technical indicators show Dogecoin is deeply oversold, trading below its 50-day and 200-day moving averages, signaling continued trend weakness.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54697942,
    "published": 1763718074000,
    "title": "Bitcoin Suffers Flash Crash to $80K on Hyperliquid Amid Market Volatility",
    "body": "BTC dropped by $3K within a minute on Hyperliquid.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54698628,
    "published": 1763719241000,
    "title": "Permabull Tom Lee Sees Bitcoin as High as $200,000 by January’s End",
    "body": "The always optimistic co-founder of Fundstrat Global Advisors believes in the long-term power of retail investors.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54698574,
    "published": 1763719240000,
    "title": "Saylor’s Strategy Under Threat: Index Status At Risk With $8 Billion On The Line",
    "body": "Michael Saylor’s Strategy, formerly known as MicroStrategy, has found itself significantly exposed to the ongoing downturn in the cryptocurrency market, which has seen more than $1 trillion in total market capitalization wiped out over the past month. As the largest public holder of Bitcoin, with over 650,000 coins, the company is now facing the real threat of being removed from major benchmark indices, which have been crucial for its visibility in mainstream portfolios. Analysts Predict Major Impact On Strategy According to a recent Bloomberg report, analysts at JPMorgan Chase have issued a warning that Saylor’s firm may lose its standing in key indices such as MSCI USA and the Nasdaq 100. Related Reading: CEO Cuts Cardano Founder’s Bitcoin Price Forecast, Warns Bear Market Just Starting The analysts assert that this could result in passive outflows estimated between $2.8 billion and $8.8 billion if MSCI proceeds with a decision expected by January 15. Passive funds connected to the company currently account for nearly $9 billion in market exposure, making any index exclusion a substantial blow. Strategy’s business model has relied on a cyclical strategy of selling stock to buy Bitcoin, capitalizing on price rallies, and repeating this process. At its zenith, Saylor’s company’s market capitalization far exceeded the value of its Bitcoin holdings. However, that premium has evaporated, and the company’s valuation now aligns closely with its crypto reserves—a stark indication that investor confidence is fading rapidly. “While active managers are not bound to adhere to index changes, exclusion from major indices would undoubtedly be viewed negatively by market participants,” noted JPMorgan analysts, led by Nikolaos Panigirtzoglou. Such a shift could affect liquidity, increase funding costs, and diminish overall investor appeal. MSCI Contemplates New Index Inclusion Rules In its ongoing consultations with stakeholders, MSCI indicated that some market players believe digital asset treasury firms (DATs) may function more like investment funds, which are ineligible for index inclusion. In accordance with these perspectives, MSCI has proposed excluding companies whose holdings in digital assets constitute 50% or more of their total assets from its global investment market indexes. Related Reading: BlackRock’s Bitcoin ETF Bleeds Over $500 Million In Its Biggest One-Day Outflow Since peaking last November, Saylor’s firm has seen its shares (MSTR) decline by over 60%, causing a collapse in the premium that once attracted momentum and crypto-focused investors. Despite this slump, Saylor’s company remains up over 1,300% since he first began purchasing Bitcoin in August 2020, outperforming major equity indices throughout this period. The selloff has extended its reach into the company’s newer funding structures, as well. The prices of its perpetual preferred shares—an essential part of Saylor’s recent strategies—have seen sharp declines. Additionally, yields on securities issued in March have risen to 11.5%, up from a previous 10.5%. A recent euro-denominated preferred stock offering has already dropped below its discounted offering price in under two weeks. Michael Youngworth, head of global convertible bond strategy at Bank of America Global Research, remarked, “That premium has collapsed in recent weeks,” adding that the present situation makes capital raising increasingly challenging. Feature image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|btc|BTC news|crypto|crypto news|Micheal Saylor|Microstrategy|MicroStrategy news|MSTR|Strategy|Strategy news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54699062,
    "published": 1763719935000,
    "title": "Nearly $1B Liquidated In an Hour as Bitcoin Plunges Below $82K",
    "body": "A leverage-driven crash liquidated nearly $1B in an hour as Bitcoin continued its slide, pushing the total crypto market cap under $3T.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54698744,
    "published": 1763719239000,
    "title": "Chinese Maker Behind Most of World’s Bitcoin Miners Has Been Focus of US National Security Probe",
    "body": "Investigators have sought to assess whether Bitmain Technologies’ products pose risks of espionage or sabotage, according to people familiar with the matter. The company says they don’t.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NCM:ABTC",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54699736,
    "published": 1763721216000,
    "title": "Ark Invest Adds Nearly $40M of Crypto Equities for Second Day as Sell-Off Continues",
    "body": "The St. Petersburg, Florida-based investment manager added to its holdings in Coinbase, Bitmine Immersion Technologies, Circle Internet and Bullish.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|ARK Invest|Cathie Wood|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54701055,
    "published": 1763723509000,
    "title": "Snipers Made $1.3M on Jesse Pollak’s Creator-Coin Debut on Base",
    "body": "Two traders captured more than $1.3 million in profits by exploiting Base’s new “flashblocks” system during the debut of the network founder’s creator coin.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Base|Creator Economy|Jesse pollak|layer 2|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54701595,
    "published": 1763724613000,
    "title": "Ethereum Dead Cat Bounce Puts Price At $3,400, But What’s The Ultimate Target?",
    "body": "Ethereum is still struggling after the initial market crash on October 10 that rocked the market. The subsequent market declines have pushed the largest altcoin by market cap toward $3,000, breaking below it for the first time at the start of the week. With the price looking to find support, there is the possibility of a dead count bounce happening that could see the price rise by more than 10%. However, with a dead count bounce being ultimately bearish, the target remains much lower. Why Ethereum Could Be Headed Lower Crypto analyst TradingShot, in a recent analysis, outlined how the Ethereum price looks to be caught in a bearish trend since early October. This had first begun after the altcoin put in a new all-time high just above $4,900 before being hit hard in the October 10 market-wide crash. Related Reading: Dogecoin Price Could Surge Above $1 As It Repeats This Trend From 2023-2024 Since then, the digital asset has been caught within a Channel Down. This Channel Down is what triggered the double-digit decline that has been recorded for the altcoin since then. As the crypto analyst explains, the Ethereum price has seen a 27.50% decline on both of its bearish legs since this trend was established. Recently, though, there has been a small turn in the tide after the price dropped below $3,000, and this happened after Ethereum formed higher lows on the 1-Day RSI. Mostly, this is bullish for the cryptocurrency’s price, but the catch is that it is likely only going to be so for the short term. If the bullish divergence does play out as expected, then the Ethereum price is definitely set for some recovery. TradingShot believes that this recovery could bring the ETH price up by 10%, pushing it up to $3,400 before the bears step back in again. However, the overall trend still remains bearish, and this could act as a hindrance to this recovery. Once the bears mount enough resistance to stop the rally in its tracks, it is expected that the decline will resume. If this plays out, then it could mean that the recovery was only a dead cat bounce. Related Reading: Here’s Why The Bitcoin Price Keeps Crashing- Is $80,000 Next? This $3,400 level lies at the 1-Day MA50, which is important because it was the point of rejection back on October 27. Last time, it led to a 27.50% crash for the Ethereum price. This time, once the sell-offs begin again, the crypto analyst believes that this could trigger a sharp crash below $3,000. The timeframe for this ranges from the end of November to the start of December, giving it only a couple of weeks to play out. The crash is expected to push Ethereum down to $2,650 before finding a bottom, marking a new lower low. Featured image from Dall.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54701621,
    "published": 1763724580000,
    "title": "Indonesia Detains Hacker Tied to Markets.com Crypto Theft After $398K Loss",
    "body": "Authorities say the suspect exploited weak backend validation to manipulate USDT balances on the trading platform.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54701592,
    "published": 1763721730000,
    "title": "Crypto Markets Today: Bitcoin, Ether Slide as Liquidity Crisis Fuels Heavy Sell-Off",
    "body": "Crypto markets plunged toward April lows on Friday as a lingering liquidity crunch amplified price swings. Bitcoin and ether fell more than 10%.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|Derivatives|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54703262,
    "published": 1763727441000,
    "title": "Tom Lee Knows Why the Crypto Market Crashed: $BEST May Be the Safest Investment Now",
    "body": "The October 10 crypto crash wasn’t just another violent wick on the chart. According to Tom Lee, chairman of Ether-focused treasury and market-making firm BitMine, the selloff exposed “structural weaknesses” within major liquidity providers that only become visible when volatility hits hard. Speaking with CNBC , Lee said the record liquidation cascade, nearly $20B wiped out in hours, forced over-leveraged market makers to rapidly unwind positions as collateral values sank. That derisking drained liquidity from order books, widened spreads, and accelerated the crash in a classic feedback loop. For regular users, that kind of liquidity vacuum isn’t just macro noise. It’s when swaps fail, fees spike, and centralized wallet pipelines become bottlenecks precisely when you need them most. When the infrastructure you rely on cracks under pressure, you’re effectively outsourcing your survival to someone else’s balance sheet. That’s why many investors are now shifting their focus from price action to tools that hold up during stress. Best Wallet is positioning its presale around that exact narrative: a mobile-first, non-custodial ecosystem built to keep users in control even when market plumbing breaks elsewhere. In a post-crash environment where structural fragility is once again front and center, that message is resonating. How a Market-Maker Liquidity Crunch Spills Into Everyday Crypto Use Lee’s point is simple but uncomfortable: when major market makers run aggressively leveraged books, a shock like the October 10, 2025, crash can flip a liquidity provider into a forced seller almost instantly. Once those books start unwinding, liquidity doesn’t just thin, it evaporates. Slippage spikes, execution quality drops, and long-tail tokens or smaller venues become structurally untradeable for hours. We’ve seen versions of this story before. Centralized exchanges and brokerages often look stable right up until volatility reveals mismatched liabilities or overextended positions. For everyday users, the question is painfully practical: How do you trade, route liquidity, or rebalance portfolios without being dependent on a single entity’s balance sheet or uptime when markets are blowing up? Different wallets are attempting their own solutions. MetaMask is leaning hard into smarter routing and institutional integrations. Trust Wallet focuses on simplicity and broad asset support for casual users. Phantom expanded from Solana to EVM chains to capture multichain retail flow. Best Wallet Token , currently in presale, aims to join this field from a different angle, pairing a consumer-grade mobile UX with a security-centric backend built on Fireblocks’ MPC-CMP infrastructure. In a cycle where liquidity reliability is suddenly front-page news again, that positioning stands out. Why Best Wallet Is Positioning Itself as “Crash-Resistant” Infrastructure Most wallets still act as thin front-ends. Best Wallet is taking a different route, building a full-stack, volatility-aware ecosystem that assumes turbulence is the norm, not the exception. The team is openly targeting 40% of the global wallet market by the end of 2026, aiming at users who want institutional-grade security packaged inside a mobile-first interface. At its core is what the team calls the first fully integrated Fireblocks MPC-CMP wallet, housed within a retail app. Instead of relying on a single private key, multi-party computation splits signing across independent shards, eliminating a single-point-of-failure while keeping transactions fast enough for everyday trading. The app’s multi-wallet portfolio system lets users cleanly separate long-term holdings, active trading, and experimental positions without juggling addresses. Beyond storage, the product places a strong emphasis on access. The Upcoming Tokens portal curates early-stage presales and embeds a streamlined purchase flow, allowing users to participate in vetted launches without jumping through third-party sites. The Best DEX aggregator , powered by Rubic, pulls routes from multiple chains, DEXs, and cross-chain bridges, optimizing trades for both price and execution in real-time. On the token side, $BEST is designed to tie utility directly to user activity. Holders receive reduced in-app fees and can stake into a dedicated 800M-token rewards pool (8% of supply). Payouts scale proportionally with each staker’s share of the pool, and staking is live during the presale, giving early buyers a head start on compounding. That pitch appears to be resonating. The presale has already raised over $17.2M with tokens priced at $0.025975 and just 7 days remaining. Whale-tracking data shows two recent large purchases totaling $136k, including a confirmed $56K buy on September 2, 2025, a signal that some larger players are willing to take early directional exposure. For anyone recalibrating after the October 2025 crypto crash, tools like Best Wallet offer a more constructive response than trying to time the exact bottom. Rather than betting on perfect entries, you can build a stack that remains flexible, fee-efficient, and self-custodial the next time liquidity disappears without warning. Join the $BEST presale today. This article is for informational purposes only and should not be considered financial, investment, or trading advice. Authored by Aaron Walker, NewsBTC – https://www.newsbtc.com/news/crypto-market-crash-october-10-2025-best-wallet-presale",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54703021,
    "published": 1763726981000,
    "title": "Philippines Bets on Sui's Move Language as Education System Struggles With Basics",
    "body": "A crypto industry-backed developer program is giving students in a remote province their first exposure to on-chain building.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54702975,
    "published": 1763726739000,
    "title": "Winklevoss twins bet on Zcash, privacy to combat AI threat",
    "body": "Cameron and Tyler Winklevoss are betting on privacy protocols gaining major traction as AI continues to grow at an exponential rate.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      }
    ]
  },
  {
    "id": 54704308,
    "published": 1763729173000,
    "title": "Here's How Digital Asset Treasuries are Holding Up as Prices Trend South",
    "body": "Major crypto treasuries face billions in paper losses amid a sustained market slump, raising concerns of forced selling.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|||||Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54704806,
    "published": 1763730000000,
    "title": "Why The Bitcoin Crash To $85,000 Is Actually Good News: Jeff Park",
    "body": "With Bitcoin trading around $85,000, Jeff Park, Partner and CIO at ProCap BTC, used his Nov. 20 conversation with Anthony Pompliano to argue that the drop may be valuable for reasons that have little to do with short-term “dip buying” and everything to do with narrative regime change. His central claim is that the classic halving-anchored rhythm is losing its foundation. Why The Bitcoin Crash Is Necessary “The four year cycle is almost definitively over,” Park said, because what it was “based off of historically, which is the halving, is just irrelevant from the additional marginal demand that comes from other channels that have opened up.” In his framing, the market is being pulled into a different cadence: “logically and fundamentally the four-year cycle should no longer exist and a new cycle should emerge that is more in sync with institutional risk capital appetite.” Related Reading: Is The Bitcoin Bottom In? Fidelity Research Lead Weighs The Odds Park is careful not to treat that as a clean break, because beliefs still move prices. He stressed that a large legacy cohort continues to trade as if the four-year script is real. “There is still a big group of investors that believe it should exist,” he said, describing them as early adopters with “characteristics that almost feel like the occult where they have prophecies.” The key, in his view, is their supply control: “the biggest Bitcoin holders in wallets that are 10,000 [BTC] and plus in size still control a good chunk of the market they are still a third of the Bitcoin market.” That concentration makes the cycle potentially reflexive: “if a third of the Bitcoin holders believe the four-year cycle is true and they act like the four-year cycle is true, well then it doesn’t really matter because they’re the price setters […] these things can be self-fulfilling.” From there, Park pivots to why weakness into year-end could be constructive. He noted that Bitcoin is now “below year to date […] in 2025,” raising the prospect of a red close. In a deliberately sharp line, he joked that if 2025 ends negative, “that breaks the four-year cycle because now we have a red [yearly candle] and so it’s a three-year cycle.” Related Reading: Why Bitwise Thinks Bitcoin Still Hits $200,000 In 2026 The humor masks a strategic preference: “maybe we do need this red [candle] right now so we could have the ability to unleash the super cycle for Bitcoin to come without ever having to talk about the four-year cycle again.” Park framed a marginally green close as the worst of both worlds. “The last thing I want honestly is […] an up 5% year to 2025 where we close at like $98K or $99K or $100K and that counts as a green year,” he said, because then “the next year everyone’s going to talk about […] this is the down year now,” leaving 2026 under the “harrowing weight over your head that we’re actually going to have another down year.” Pompliano pressed the obvious counter-scenario: “Is there a world where it could just kind of rip right back […] and go to $140,000 or something?” Park didn’t rule it out. “It’s absolutely possible. Anything can happen,” he replied. But he summarized the trade-off starkly: “we either have to hope for […] that it either goes up a lot to make the year count or we just try to notch in a small loss here for the year so we can just wipe out the four-year cycle altogether.” For Park, Bitcoin at $85,000 is “good news” only insofar as it increases the odds of breaking a self-reinforcing calendar myth, clearing the way for a market driven less by halving folklore and more by institutional risk cycles. At press time, BTC traded at $84,469. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54705043,
    "published": 1763730274000,
    "title": "Prediction Market Kalshi’s Valuation Jumps to $11B After Reported $1B Raise",
    "body": "The surge follows months of rapid trading growth and key regulatory shifts reshaping the U.S. prediction market space.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54705647,
    "published": 1763730986000,
    "title": "ETF altseason? Solana, XRP funds buck crypto’s market sell-off",
    "body": "SOL and XRP ETFs have attracted nearly $900 million in combined inflows, highlighting rare investor conviction amid an ongoing market rout.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54705511,
    "published": 1763730986000,
    "title": "ETF altseason? Solana, XRP ETFs defy broader crypto sell-offs",
    "body": "SOL and XRP ETFs have attracted nearly $900 million in combined inflows, highlighting rare investor conviction amid an ongoing market rout.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54706073,
    "published": 1763732088000,
    "title": "Bitcoin Bounces Above $84K as Fed's Williams Puts December Rate Cut Back on Table",
    "body": "Previously having essentially written off chances of further monetary ease in 2025, interest rate traders are now pricing more than a 70% chance of a rate cut at the Federal Reserve's December meeting.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|New York Federal Reserve|John Williams|Federal Reserve|Interest Rates|Breaking News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54706298,
    "published": 1763731991000,
    "title": "Saylor’s Preferreds Boom Comes Into Question as Bitcoin Slumps",
    "body": "The plunging value of Bitcoin is piling pressure on the securities Strategy Inc. has been issuing in bulk to buy the asset, raising questions about the financing model of the world’s largest crypto treasury firm.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NMS:MSTR",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54706932,
    "published": 1763733616000,
    "title": "Scott Bessent Stirs Headlines With Surprise Visit To Bitcoin Bar",
    "body": "A surprise appearance by US Treasury Secretary Scott Bessent at the opening of a Bitcoin-themed bar in Washington, DC, has drawn sharp attention from both crypto supporters and cautious observers. Related Reading: Trump’s WLFI Moves To Contain Wallet Breach While Federal Inquiry Looms According to reports, Bessent stopped by Pubkey during its launch event, a move that many in the Bitcoin community read as a visible sign of warmer relations between parts of government and the crypto sector. Pubkey Visit Raises Eyebrows And Cheers Pubkey, a venue that bills itself as Bitcoin-friendly, has grown from a New York outpost into a small chain. Reports have disclosed that the New York location once hosted US President Donald Trump, who reportedly paid in Bitcoin during a previous visit. The Washington opening, where Bessent appeared unannounced, triggered a flurry of online reaction. Some community figures called the moment historic. Others urged caution, saying public appearances do not automatically translate into policy shifts. Had to do a second buy today using my “it was so obvious” framework. Having the Secretary of the Treasury at the Pubkey DC launch seems like a moment I could easily look back on and say “wow, it was all so obvious”. Stack Sats and chill. https://t.co/8uPWEqLJ9y pic.twitter.com/Dew1A4gkFZ — Ben Werkman (@BenWerkman) November 21, 2025 Policy Signals And Concrete Talk Based on reports, Bessent has been public about ideas that place Bitcoin on the government agenda. He has spoken about the GENIUS Act and has discussed ways the Treasury could use seized Bitcoin to seed a Strategic Bitcoin Reserve in a budget-neutral manner. In an interview dated March 7, 2025, he suggested the Treasury was exploring options that would avoid immediate sales of seized crypto and instead look for ways to keep BTC on the books. That shift in tone is being watched closely by traders and policy watchers alike. Community Reaction Was Fast Ben Werkman, a crypto fund CIO, said the event felt like a “moment” for the industry. Another industry figure, Steven Lubka, called it the sign many had been waiting for. At the same time, analysts warned about reading too much into a single photo op. One trader noted that market moves are driven by many forces, and that symbolic gestures often take time to matter for prices. Short-term traders may ignore signals like this, while longer-term holders may file them away. What This Means For Markets And Lawmakers If the Treasury takes steps to pause sales of seized BTC and to test ways of holding coins, the move could change how institutional players view the asset class. But reports also remind readers that policy ideas meet legal and budget tests before they become real. Lawmakers and regulators will have to weigh the proposal. The public nature of Bessent’s visit, though, makes the discussion harder to treat as private or theoretical. Related Reading: XRP Supply Shock Ahead? ETFs Could Consume It All, Analyst Predicts A Moment, Not A Promise The image of a cabinet official mingling at a Bitcoin bar is powerful. It gives the community talking points. Yet, officials and experts say more formal steps are required before the visit becomes policy. For now, the appearance stands as a public sign of interest, backed by statements and proposals that are still in play. Bitcoin’s supporters will note the visibility. Critics will watch for the paperwork. Photo illustration by Slate. Photos by vvelda@ymail.com/Flickr and Wavebreakmedia/iStock/Getty Images Plus, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|Pubkey|Scott Bessent",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54706929,
    "published": 1763733542000,
    "title": "GSR Expands Institutional Platform to Raise Transparency, Control in Crypto Trading",
    "body": "GSR upgraded GSR One, unifying market making, over-the-counter trading and treasury services as demand for institutional-grade crypto infrastructure increases.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|GSR|Market Makers|Institutions|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54708037,
    "published": 1763735425000,
    "title": "Coinbase to Snap up Solana-Based DEX Vector as Acquisition Spree Continues",
    "body": "The exchange’s latest deal folds Solana-native Vector into its consumer trading arm, extending a rapid M&A streak.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Coinbase|M&A|Solana News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54708372,
    "published": 1763735907000,
    "title": "Blockchain Is Key To Improving Carbon Credit Markets",
    "body": "Blockchain adoption continues to accelerate, even as crypto reminds investors that volatility is feature of the market",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54709132,
    "published": 1763737237000,
    "title": "Who’s Selling? Here’s The Demographic Driving The Bitcoin, Ethereum, And Dogecoin Price Crash",
    "body": "Recent data has revealed the demographics of sellers driving the Bitcoin, Ethereum, and Dogecoin crash. The Coinbase BTC premium index also continues to drop further in the red, which strengthens the case of where exactly the sell pressure is coming from. The Demographic Behind The Bitcoin, Ethereum, And Dogecoin Price Crash In an X post, crypto pundit Crypto Rover noted that the U.S. session has been the weakest trading session so far this month. The pundit further shared an accompanying chart, which showed that BTC has suffered a loss of around 12% in the U.S. session since the start of November, also leading to the Ethereum and Dogecoin crash. Related Reading: Why Are The Bitcoin, Ethereum, And Dogecoin Prices Down Again? Meanwhile, the EU has had the second-weakest session after the U.S., with Bitcoin dropping around 12% in this session since the start of this month. The Asian session has been the least volatile, with BTC trading sideways, recording a drawdown of only about 2% since the start of November. Ethereum, Dogecoin, and altcoins have also been stable during the Asian trading session. Crypto pundit Bossman also indicated that the U.S. was responsible for most of the sell pressure that is driving the Bitcoin, Ethereum, and Dogecoin crash. In an X post, he noted that every single American session is marked by relentless selling for hours. Meanwhile, the Asians wake up, buy it all back, and then the Americans wake up, and the selling begins again. Notably, the Bitcoin, Ethereum, and Dogecoin prices record increased volatility whenever the U.S. stock market opens, with market commentator Zerohedge attributing it to the ‘10 am slam’ by market algos. This indicates that institutional investors are heavily contributing to the market crash. This is evident in the significant outflows recorded by Bitcoin ETFs in recent times. These funds have recorded five daily net outflows over the last seven days, according to SoSoValue data. Coinbase BTC Premium Index In The Red CoinGlass data shows that the Coinbase Bitcoin premium index is in the red, further confirming that most of the sell pressure driving the BTC, Ethereum, and Dogecoin crash is coming from the U.S. Typically, a negative premium indicates that the BTC price on Coinbase is lower than the average global price, which signals weak demand from U.S. investors. Related Reading: Analyst Who Predicted Bitcoin Price October Top Is Back With A New Prediction Crypto researcher Kyle Soska noted that Bitcoin and Ethereum are roughly 10 days into a derisking event by U.S.-based entities, likely a combination of ETF users and large private, ultra-high-net-worth individuals. He further remarked that this places the market near the end of the selling episode based on historical data. Soska opined that the first of a near-term bottom would be a mean reversion of the Coinbase-Binance spot discount from its current level of around -$110 back to a more normal level range of around $40. At the time of writing, the Bitcoin price is trading at around $85,000, down over 6% in the last 24 hours, according to data from CoinMarketCap. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|Bitcoin Spot ETFs|Bossman|btc|BTC news|btc price|btcusd|BTCUSDT|Coinbase-Binance Spot Discount|Coinglass|CoinMarketCap|Crypto Rover|Dogecoin|ethereum|Kyle Soska|SoSoValue|ZeroHedge",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54709055,
    "published": 1763737097000,
    "title": "Just One Week Left Before Best Wallet Token’s Explosive $17M Presale Ends",
    "body": "What to Know: Many crypto wallets remain either centralized with single points of failure or decentralized yet fragmented and challenging to use on mobile. Users now expect a secure, cross-chain, yield-enabled wallet experience rather than a simple send-and-receive tool. The Best Wallet targets a 40% share of the global wallet market by end-2026 with a mobile-first, benefit-rich, non-custodial design. Fireblocks’ MPC, Rubic’s DEX aggregator, and curated presale access position the Best Wallet’s $BEST presale as a full DeFi command center. Crypto is in another risk-on phase, and you can see it in where capital is flowing. While meme coins still grab headlines, more money is rotating into infrastructure plays that actually solve user pain points, especially around self-custody, security, and cross-chain access. Wallets sit at the center of that shift. If you have used multiple apps, chains, and DEXs, you know the problem. Most of the best crypto wallet contenders are either custodial with clear single points of failure, or non-custodial but clunky on mobile and fragmented across chains. You get basic send and swap options, but not real advantages like curated presales, better yields, or integrated fee discounts. That gap is where Best Wallet is moving fast. Positioning itself as a next-gen crypto wallet, it combines institutional-grade MPC security and a mobile-first design. And now, thanks to its Best Wallet Token ($BEST), it’s adding a benefits layer that goes far beyond just holding tokens. 💡 The idea is simple: make self-custody feel as easy as a fintech app, but with deep DeFi hooks. With the $BEST presale already raising more than $17.2M and only a week left on the clock, Best Wallet Token is pushing to become a serious contender for users searching for the best crypto wallet experience, not just another token punt. ➡️ Learn more about the project’s fundamentals in our Best Wallet Token review, and explore detailed $BEST price forecasts to understand the full token outlook. Best Wallet Presale Targets Mass Adoption with Real User Benefits At its core, Best Wallet wants to be the wallet you actually use every day, not just another app in a folder. It is a non-custodial, no-KYC mobile wallet with multi-chain support, while integrating staking, DEX aggregation, and presale access into one streamlined interface via the Upcoming Tokens portal. The security story is anchored by a fully integrated Fireblocks’ MPC-CMP setup, so you get institutional-grade key management without seed phrases being your single point of failure. For users, the pitch is straightforward. Hold and use $BEST to reduce fees across the Best Wallet ecosystem, unlock higher APY opportunities through a staking aggregator, and get earlier, simpler access to new presales that have passed an internal vetting process. That’s in addition to governance rights. 💰 The presale has already raised over $17.2M, underscoring clear demand for a more feature-rich, mobile-first wallet stack. $BEST currently costs $0.025975 and you can stake it for 76% APY. Can $BEST Be More Than Just Another Presale Token? If Best Wallet captures even a small slice of the broader wallet market, $BEST could potentially reach levels that deliver multiple returns from the current presale price of $0.025975. 🐳 Momentum is already showing on-chain, with smart money moving in. High-net-worth wallets snapped up $BEST tokens in chunks with whale buys of $70.2K and $50K. Combine staking incentives, reduced ecosystem fees, and exclusive presale access, and you get a clear utility loop where active users are rewarded for staying inside the Best Wallet ecosystem rather than hopping between random apps or meme coins. If you are looking beyond hype-driven narratives and toward durable wallet infrastructure, this is one presale you may want on your radar. 🚨 A heads up, though. The Best Wallet Token presale is entering its final stretch with just one week before it ends. November 28 is D-day, so the clock is ticking if you want to join the presale. With a mobile-first non-custodial wallet, Fireblocks MPC security, DEX aggregation, and presale access built in, Best Wallet and its native $BEST token offer a more stable and utility-driven alternative to purely speculative plays. If you are searching for the best crypto wallet experience that bundles security, access, and rewards into one app, $BEST is positioning itself as a potential core holding rather than a side bet. 🚀 Secure $BEST before the presale ends next week. Disclaimer: This article is for informational purposes only and should not be considered financial or investment advice. Always do your own research. Authored by Aaron Walker for NewsBTC – https://www.newsbtc.com/news/best-crypto-wallet-17m-presale-ends-soon",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54709119,
    "published": 1763736946000,
    "title": "Bitcoin ASIC producer Bitmain faces US probe over national security risks: Report",
    "body": "US authorities are investigating Chinese Bitcoin mining hardware giant Bitmain over potential national security risks tied to alleged remote capabilities, according to Bloomberg.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54710091,
    "published": 1763738749000,
    "title": "Fanatics Enters Prediction Markets via Crypto.com Partnership",
    "body": "The product is set to launch in the next couple weeks, Fanatics CEO Michael Rubin said on CNBC.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Prediction Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54709943,
    "published": 1763736946000,
    "title": "Bitcoin ASIC producer Bitmain under US investigation over national security risks: Report",
    "body": "US authorities are investigating Chinese Bitcoin mining hardware giant Bitmain over potential national security risks tied to alleged remote capabilities, according to Bloomberg.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54710395,
    "published": 1763739234000,
    "title": "Bitcoin, XRP and Dogecoin Pummeled as Crypto Liquidations Top $2.2 Billion",
    "body": "Bitcoin is starting to recover after sliding to $81,000 earlier Friday, while coins like Ethereum and XRP have fallen harder on the day.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54711393,
    "published": 1763740839000,
    "title": "Only An Asteroid Can Sink MSTR’s Bitcoin Bet, CryptoQuant CEO Says",
    "body": "CryptoQuant founder and CEO Ki Young Ju pushed back on a renewed wave of forced Bitcoin liquidation and bankruptcy chatter around Strategy (formerly MicroStrategy, MSTR), arguing that the bearish thesis misreads the company’s capital structure and shareholder incentives. In a Nov. 20, 2025 post on X, Ju wrote, “MSTR only goes bankrupt if an asteroid hits Earth,” adding that critics should “bring a single piece of evidence” before claiming Michael Saylor would be liquidated. The comments came as Bitcoin and high-beta crypto proxies retraced into late November, reviving legacy narratives that Strategy’s debt stack could compel BTC sales. Why Strategy Will Never Sell Bitcoin Ju’s central claim is that Strategy is not structurally set up like a margin trader. Addressing the most common fear—that convertible notes “missing” their conversion price forces liquidation—he stated: “Convertible debt not reaching the conversion price is not liquidation. It simply means the notes get repaid in cash Failing to convert is not a bankruptcy trigger. It is just normal debt maturity.” Related Reading: Is The Bitcoin Bottom In? Fidelity Research Lead Weighs The Odds In his view, the repayment pathways are conventional corporate finance tools: refinancing, rolling into new notes, secured borrowing, or operating cash flow. That framing aligns with how convertibles function in practice; if equity is below strike at maturity, the embedded option expires and the instrument reverts to straight debt rather than a forced-sale event. He also grounded his argument in governance and identity. “Saylor would never sell Bitcoin unless shareholders want it,” Ju wrote, warning that “selling even a single BTC would destroy MSTR’s identity as a Bitcoin treasury company and trigger a death spiral for both Bitcoin and MSTR.” Strategy has repeatedly defined itself as a BTC-treasury vehicle, and its shareholder base largely bought into that mandate, making voluntary divestment politically and strategically improbable absent a radical shift in investor preference. Balance-sheet data underpins Ju’s confidence. Strategy reported 640,808 BTC as of Oct. 30, 2025, acquired for about $47.44 billion; subsequent filings cited major November additions taking holdings to roughly 649,870 BTC. Even after accounting for the growing convertible and preferred layers, the BTC treasury remains the dominant asset, meaning solvency stress would require an extreme, prolonged Bitcoin collapse rather than a cyclical drawdown. Related Reading: Why Bitwise Thinks Bitcoin Still Hits $200,000 In 2026 Ju did not claim the equity is risk-free. “This does not mean MSTR’s stock price will always stay high,” he wrote, but called the idea that Strategy would sell BTC to support the stock or face imminent bankruptcy “completely absurd.” He added that even at a price of $10,000 per coin, Strategy would face “a debt restructuring, nothing more.” On preferred shares, he acknowledged dividend obligations, noting payments have not been missed and can be covered via new share issuance—dilutive, but not a liquidation vector. Posting BTC as collateral, he said, would be a last resort because that would introduce real margin risk. In short, Ju’s rebuttal draws a hard line between volatility and insolvency: Strategy may trade like leveraged Bitcoin, but its liabilities do not mechanically force BTC sales. The “Saylor liquidation” narrative, he argues, is a Twitter myth unless the world ends—by asteroid. At press time, BTC traded at $82,050. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|cryptoquant|ki young ju|Microstrategy|MSTR|Strategy",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54711117,
    "published": 1763740429000,
    "title": "U.S. House Bill Would Allow Federal Taxes in BTC While Aiding U.S. Reserve",
    "body": "Rep. Warren Davidson introduced legislation that allows bitcoin tax payments without incurring capital gains to beef up the U.S. Strategic Bitcoin Reserve.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Bitcoin News|Warren Davidson|crypto legislation|U.S. House of Representatives|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54711925,
    "published": 1763741588000,
    "title": "Crypto Biz: Is this what a bear market looks like? (Spoiler: No)",
    "body": "Bitcoin's price dips below $90,000, yet Republic and Kraken ink nine-figure deals. If this is a bear market, someone forgot to tell big money.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54711537,
    "published": 1763741164000,
    "title": "Best Altcoins to Buy as Cycle Is Turning & Promises Alt Season Soon",
    "body": "What to Know: Bitcoin Hyper’s modular Bitcoin L1 + SVM L2 architecture enables low-latency smart contracts and DeFi to run natively within the BTC ecosystem. With more than $28 million raised in its presale, $HYPER is positioning itself as a high-conviction Bitcoin infrastructure play ahead of a potential altcoin rotation. Best Wallet Presale blends institutional-grade MPC security with presale discovery tools and a robust DEX aggregator, aligning its growth with rising on-chain activity. Aster offers a MEV-free perp DEX with extreme leverage and yield-bearing margin mechanics, creating direct exposure to resurging derivatives volatility. Altcoin season indicators are starting to flicker even while most portfolios still feel like a bear market hangover. Only around 5% of the altcoin supply is in profit, a level that historically lines up with capitulation, forced selling and exhaustion among weaker hands. That kind of reset is usually where new cycles begin to form underneath the surface. And keen eyes are already starting to point out the potential for big moves. Bitcoin’s dominance has marched higher during this phase, with capital crowding into $BTC as a safe haven while high‑beta assets bleed out. As Bitcoin volatility compresses and price action stabilizes, analysts expect the early rotation phase of an altcoin season to develop. Liquidity typically leaks first into higher‑quality infrastructure and trading venues before it reaches meme coins. You can already see that playbook in motion. On‑chain flows and presale data show capital quietly rotating into Bitcoin Layer 2 infrastructure, next‑generation wallet stacks and execution‑focused decentralized exchanges. These are the rails that will need to scale if a new wave of users and speculative flows really hit the market. Below are three of the best altcoins to invest in 2025 if you are positioning ahead of a potential cycle flip: Bitcoin Hyper , Best Wallet Token , and Aster. Together they cover settlement, custody and trading, the three pillars of a functioning on‑chain market structure. 1. Bitcoin Hyper ($HYPER) — First Bitcoin Layer 2 With SVM Speed Bitcoin Hyper ($HYPER) is pitched as the first ever Bitcoin Layer 2 with SVM integration, aiming to give Bitcoin the kind of high‑throughput execution environment traders currently associate with Solana. Instead of trying to replace $BTC, Bitcoin Hyper uses Bitcoin L1 purely as a settlement and security layer while shifting all real‑time activity to a Solana Virtual Machine Layer 2. That architecture matters if altcoin season really does return. DeFi, NFT activity and high‑frequency perp trading cannot live on 10‑minute blocks and inconsistent fees. Bitcoin Hyper’s SVM Layer 2 targets sub‑second confirmation and low‑single‑cent fees, which is crucial for wrapped $BTC payments, DEX routing and gaming dApps where users will not tolerate latency. On the application side, Bitcoin Hyper leans into SPL‑compatible tokens, fast smart contracts and an SDK in Rust so existing Solana developers can port over almost instantly. The roadmap calls for $BTC‑backed stable payments, lending markets, staking protocols and NFT platforms that settle back to Bitcoin but operate at L2 speed. The token metrics tell you this is already on trader radar: The presale has raised $28.2M $HYPER priced at $0.013305 Major whale buys, including $502K and $379K That combination of broad retail participation plus clear ‘smart money’ entries is the pattern you usually see before a main exchange listing; learn how to buy $HYPER before the presale ends and the token goes live. In a market hunting for the best altcoins to invest as the cycle turns, Bitcoin Hyper stands out as a direct play on bringing Solana‑style throughput to Bitcoin’s security base layer. Learn more and join the $HYPER presale. 2. Best Wallet Token ($BEST) — Aggregating the Next Cycle’s Flow If Bitcoin Hyper is the execution layer for BTC liquidity, Best Wallet Token ($BEST) positions itself as the front door where that liquidity is actually stored, routed and deployed. The project’s ambition is aggressive, targeting up to 40% of the crypto wallet market by the end of 2026 by being the easiest and safest option with the most integrated features. Its core differentiator is a Fireblocks MPC‑CMP stack under the hood, which is the same class of infrastructure used by large institutions for secure key management. On top of that, Best Wallet lets you build custom multi‑wallet portfolios, so you can segment long‑term holdings, trading stacks and DeFi experiments with granular risk controls instead of juggling a dozen browser extensions. Where this starts to intersect directly with altcoin season is the Upcoming Tokens portal. The wallet integrates a curated presale and early‑stage token flow so users can access vetted opportunities without leaving the interface. For traders hunting the best altcoins to invest in 2025 before they hit centralized exchanges, integrated discovery and purchase rails are a real edge. The Best DEX aggregator, powered by Rubic, then connects to more than 50 chains, 200 DEXs and 20 cross‑chain bridges to execute at competitive rates. On the token side, the $BEST presale has already raised $17.2M, with tokens priced at $0.025975, supported by a dynamic staking APY model that adjusts with demand and protocol revenue. Whale buys include purchases of $70K and $50K ; learn how to join them . If inflows into infrastructure and presales accelerate with a new cycle, Best Wallet’s position as one of the best crypto wallets is structurally tied to that growth. Check the $BEST presale details. 3. Aster ($ASTER) — High‑Leverage Perp DEX Positioned for Volatility The third piece of the puzzle is where traders will actually express high‑beta views if altcoin season kicks in. Aster is a next‑generation decentralized exchange for spot and perpetual trading, designed to operate as a one‑stop on‑chain venue for global crypto traders. It competes in the same lane as GMX, Hyperliquid and MUX, but leans heavily into performance plus capital efficiency. Aster’s headline features are eye‑catching: MEV‑free execution, support for leverage up to 1001x and the ability to use yield‑bearing assets as margin collateral. In practice, that means a trader can deploy staked stablecoins or liquid staking tokens, keep yield flowing and still open directional positions, which is particularly attractive when volatility spikes. Multi‑chain compatibility across BNB Chain, Ethereum, Solana and Arbitrum keeps Aster accessible wherever users currently hold their collateral. Recent activity has been strong. Aster rolled out its Rocket Launch campaign with APRO, allocating a $200K ASTER reward pool and broader trading incentives to bootstrap depth and activity. During peak periods, reported volumes have pushed Aster into the upper ranks of perpetual DEXs, at times surpassing Hyperliquid. For traders rotating out of centralized venues and looking for high‑leverage, MEV‑resistant execution, Aster is positioned squarely in the slipstream of any renewed speculative mania. Explore Aster on its official site. With altcoin season signals flickering while most supply sits deeply underwater, positioning into infrastructure makes sense. Bitcoin Hyper , Best Wallet Token and Aster each target critical layers of the next cycle’s stack, with Bitcoin Hyper offering the most asymmetric way to play a Bitcoin Layer 2 resurgence. This article is for informational purposes only and does not constitute financial, investment or trading advice of any kind. Authored by Aaron Walker for NewsBTC — https://www.newsbtc.com/news/best-altcoins-2025-bitcoin-hyper-presales",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54712554,
    "published": 1763742662000,
    "title": "Borrowing Against Your Tesla Stock to Buy a Car Is the Future of DeFi: Robert Leshner",
    "body": "Tokenizing stocks and physical assets could let investors self-custody, borrow in DeFi, and easily transfer ownership, says Superstate CEO.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54712269,
    "published": 1763742239000,
    "title": "Coinbase Acquires Solana Meme Coin Social Trading App Vector",
    "body": "Crypto exchange Coinbase is acquiring Solana meme coin application Vector to improve its on-chain trading experience.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54712910,
    "published": 1763742187000,
    "title": "Bitcoin Plummets 11%! Crypto in Free-Fall! Guests: OSF & Wizard Of SoHo",
    "body": "Btc: 81.6k (-11%) | btc.D: 58.8% (-0.5%). Eth: 2665 (-12%) | bnb: 800 (-11%) | sol: 123 (-13%). Bitcoin and Ethereum ETFs saw significant outflows, with broader crypto markets falling sharply as strong jobs data reduced expectations for interest-rate cuts. Bitcoin’s technicals weakened, with RSI hitting a three-year low and the price hovering only slightly above a major strategy’s average entry level. Major holders were reported to be selling, including a long-term wallet unloading $1.4 billion in BTC and another entity selling 10,000 ETH to support a share buyback. Institutions faced pressure as well, with concerns that certain digital-asset-related companies could be removed from major indexes, while one prominent mining-related firm carried billions in unrealized losses. Some attributed part of the sell-off to a software glitch. Meanwhile, policy and corporate developments continued: a U.S. representative introduced new crypto legislation, Metaplanet announced plans to purchase $95 million in BTC, Coinbase launched ETH-backed loans through Morpho, and Securitize partnered with Plume to expand real-world-asset offerings. India also signaled plans to launch an ARC stablecoin.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54713598,
    "published": 1763744444000,
    "title": "Data Rings Alarm: Bitcoin Hits 2-Year Bearish Extreme — Historically Bullish?",
    "body": "According to CryptoQuant data, Bitcoin has moved into what analysts are calling the most bearish phase of the last two years, sending prices down sharply and weighing on the broader crypto market. Related Reading: XRP Supply Shock Ahead? ETFs Could Consume It All, Analyst Predicts The coin slid from a peak above $126,000 on Oct. 6 to $83,790, a drop of around 34% that erased roughly $715 billion in market value. Bull Conditions Have Weakened Rapidly Reports have disclosed that CryptoQuant’s Bull Score Index fell to 20 out of 100 last week, driven by weak spot buying, negative price momentum, and a slowdown in stablecoin liquidity. Bitcoin also closed below its 365-day moving average, a long-run trendline that had held during earlier pullbacks in the current cycle that began in January 2023. Based on these signs, CryptoQuant views the market as clearly more bearish than it was in prior corrections. Trading desks and corporate treasuries have shifted behavior. Treasury companies that once supported prices have seen market values drop by 70% to more than 90% in recent months, limiting their ability to issue shares and buy more Bitcoin. Reports show Michael Saylor’s Strategy bought 8,178 BTC earlier this week but has slowed purchases as its stock market cap fell closer to the value of its holdings. ETF flows have also turned negative, with outflows totaling close to $3 billion so far this month, a dynamic that can force some institutions to sell spot holdings if spread trades are unwound. Technical Levels And Short-Term Signals Based on on-chain indicators, there are mixed signals for buyers. Glassnode reported the Mayer Multiple moving toward the bottom of its long-term range, which often signals a value-driven phase where buyers re-enter. Bitcoin’s Mayer Multiple has retraced toward the lower bound of its long-term range, signalling a slowdown in momentum. Historically, such compressions have aligned with value-driven phases where price consolidates and demand begins to step in. 📈https://t.co/QWQCUxgUoA pic.twitter.com/qufyp0opnr — glassnode (@glassnode) November 20, 2025 Some technical traders see oversold readings on daily and weekly RSI, a setup that could allow a bounce. Some analysts expect at least a short-term recovery, with price tests above $100,000 possible if buying returns. Still, the breakdown under the 365-day average changes the picture. CryptoQuant suggested resistance near $102,600 could prove heavy, and the support band between $90,000 and $92,000 will be closely watched. Historically, Bitcoin has produced rallies of 40% to 50% inside broader downtrends, so rapid reversals are not out of the question even in a bearish phase. Market Shock And Macro Factors Based on reports, the sharp sell-off that triggered the recent crash began on October 10 when a large leverage flush-out forced many positions to close. Market makers reduced liquidity and selling pressure intensified. A software fault tied to the Athena USDE stablecoin on Binance briefly pushed its peg to $0.65, triggering automated liquidations across platforms and accelerating losses. Related Reading: Trump’s WLFI Moves To Contain Wallet Breach While Federal Inquiry Looms Macro worries, including tighter liquidity and political uncertainty, added pressure and sent more traders to the exits. Some observers have linked parts of the 2024 and 2025 rallies to specific events. In 2024, US President Donald Trump’s election was one factor cited for pushing BTC above $100,000, and in 2025, a wave of corporate treasuries bought Bitcoin, helping lift prices above $120,000 in summer months. According to CryptoQuant, those catalysts have largely played out, and any new triggers may be priced in already. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|Bear market|bitcoin|btc|btcusd|crypto|digital currency",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54713450,
    "published": 1763744148000,
    "title": "Japanese Bitcoin Treasury Firms Keep Beating BTC. Tax Policy Makes Outperforming U.S. Peers the Easy Part",
    "body": "While U.S.-listed bitcoin treasury firms struggle to outperform ETFs, Japan’s harsh crypto tax code sends investors into DAT stocks, making outperformance easy.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|BTC Treasuries Theme Month|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54714832,
    "published": 1763746280000,
    "title": "UK Operation to Hit Russian Sanctions Evasion Arrests 128, Seizes $32.6M in Crypto and Cash",
    "body": "Operation Destabilise has established that one money laundering network operating in the UK was involved in buying a bank in Kyrgyzstan.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 54665922,
    "published": 1763726231000,
    "title": "Serious Fed Warning Triggers Sudden Bitcoin Price Drop— Sparks Fresh Crash Fears",
    "body": "Bitcoin and the wider crypto market have dropped sharply, reigniting bitcoin crash fears...",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54715552,
    "published": 1763747658000,
    "title": "Nvidia's Stellar Quarter Fails to Quell Bears as AI Valuation Fears Deepen on Wall Street",
    "body": "The chipmaker’s blockbuster earnings offered a brief reprieve, but a rapid reversal in trading cemented investor worries about the sustainability of the AI boom.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54716422,
    "published": 1763749086000,
    "title": "Cathie Wood Buys the Dip as Ark Invest Loads Up on Coinbase, BitMine and Circle Stock",
    "body": "Cathie Wood's investment firm continues to buy the dip on crypto related equities, adding shares in Coinbase, BitMine, and Circle.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54716009,
    "published": 1763748411000,
    "title": "BitMine Immersion Sitting on $4B Loss on Ether Bet as Analyst Warns of Structural issues",
    "body": "Tom Lee's company could trap shareholders amid low staking yields, hefty embedded fees and vanishing NAV premium, 10x Research founder Markus Thielen warns.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Ethereum News|Digital Asset Treasury|Ethereum Treasury|Markus thielen|10x research|CoinDesk Wealth|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      }
    ]
  },
  {
    "id": 54716527,
    "published": 1763749283000,
    "title": "ICP Breaks Major Support as Volume Spike Confirms Accelerated Downtrend",
    "body": "A steep selloff pushed ICP below the $4.33 floor, with exceptional volume marking the session’s decisive breakdown.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Technical Analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 82,
        "NAME": "ICP",
        "CATEGORY": "ICP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54717930,
    "published": 1763751600000,
    "title": "Bitcoin rout continues as crypto treasuries face reckoning: Finance Redefined",
    "body": "Growing unrealized losses and falling NAV levels are threatening corporate crypto treasuries, making it difficult to raise capital for future digital asset investments.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54717800,
    "published": 1763751337000,
    "title": "Bitcoin’s ‘fastest bear market’ hides potentially positive year-end outcome for BTC",
    "body": "Bitcoin’s abrupt drop to $80,000 shocked traders, but back-tested data on 105 indicators suggests the market washout is preparing BTC for a longer-term rally to new highs.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54718719,
    "published": 1763752625000,
    "title": "Bitcoin Plunge Hits Market Makers in a Fragile Trading Landscape",
    "body": "Bitcoin is crashing into dangerous territory — and options-fueled selling is adding to the volatility.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54719349,
    "published": 1763753569000,
    "title": "Wall Street’s Crypto Engine Loses Power as ETFs Shed Millions",
    "body": "For a market that treats Bitcoin ETF flows as an indicator of demand for the underlying token, recent outflows from these funds are stoking fears that the decline in crypto prices has further to go.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54719989,
    "published": 1763755238000,
    "title": "STH Panic Emerges as Bitcoin Crashes To $81K: Realized P/L Turns Negative For The First Time This Cycle",
    "body": "Bitcoin is struggling to find support after losing the $85,000 level and plunging to $81,000, marking its weakest point since early spring. Bulls have clearly lost control of the trend, and fear now dominates the market, with sentiment rapidly shifting from caution to outright panic. Many traders are calling for a confirmed bear market, while others argue the move is an orchestrated shakeout designed to flush out weak hands before the next macro leg. Related Reading: Bitcoin OG Owen Gunden Deposits Final 2,499 BTC ($228M) to Kraken – Details Amid the chaos, top analyst Axel Adler shared new insights that highlight a structural shift beneath the surface. Until just yesterday, short-term holders (STHs) appeared relatively stable despite the correction. However, the situation has now changed dramatically. The Realized P/L component — which measures whether investors are selling at a profit or loss — has fallen to –1, signaling broad loss realization across the STH cohort. This metric turning negative for the first time in weeks confirms that capitulation among recent buyers is accelerating, a dynamic that historically increases pressure on the spot market. Although the sell-off is severe, some analysts argue that these conditions resemble previous manipulation-driven liquidity grabs, where deep corrections eventually set the foundation for sharp rebounds. STH Panic Mirrors Past Cyclical Bottom Signals Adler explains that the latest spike in short-term holder (STH) panic is not an isolated event — it closely resembles patterns seen during previous market bottoms. The chart clearly shows that similar surges in STH loss realization occurred in July 2021 and again throughout the 2022–2023 bear market, each time leading to accelerated selling, liquidity stress, and deeper short-term corrections. These phases were marked by fear-driven capitulation, where recent buyers dumped coins rapidly, often exaggerating the downside but ultimately exhausting available sell pressure. Today, that same structure is reappearing. With STH Realized P/L dropping sharply and the STH-MVRV ratio sitting below 1, fear has pushed many recent entrants into loss, triggering panic moves. Adler notes that this kind of forced selling tends to cluster near the end of corrections, not the beginning. Once STHs capitulate, the market often shifts into a period of stabilization as long-term holders absorb supply. Despite extreme sentiment across social and derivative markets, several analysts argue that this setup could create the conditions for a recovery. Historically, when STH panic peaks and long-term holders remain steady, Bitcoin has often staged strong rebounds in the weeks that follow. Related Reading: Bitcoin Mean Reversion Oscillator Prints First Green Oversold Bar in Months – A Classic Bull-Market Bottom Signal BTC Testing Key Demand Levels Bitcoin has entered a steep downtrend, and the chart clearly reflects the intensity of the current sell-off. BTC has dropped to the $83K–$84K range, marking one of the sharpest declines of this cycle. The breakdown accelerated once price lost the $92K and $90K supports, and the chart now shows a near-vertical move to the downside — a classic sign of capitulation-driven selling. On the daily timeframe, BTC is trading well below the 50-day, 100-day, and 200-day moving averages. All three have begun sloping downward, forming a full bearish alignment that signals weakening momentum across multiple time horizons. Price is currently attempting to stabilize around the 200-day moving average (red line), one of the last major trend supports in a macro bull structure. A clean close below this level could open the door to deeper downside. Related Reading: Bitcoin Capitulation Deepens Around $90K Level: Classic Late-Stage Fear Structure Emerging Volume has spiked aggressively over the past sessions, confirming panic participation. Unlike earlier corrections, this one shows sustained distribution without meaningful bounces, suggesting forced selling from short-term holders and large entities. However, the chart also shows early signs of selling exhaustion. Candles are printing long lower wicks, and intraday volatility has increased — conditions that often precede a temporary bottom. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|Bitcoin news|Bitcoin STH|Bitcoin STH realized losses|Bitcoin sth Realized PrIce|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54719727,
    "published": 1763754565000,
    "title": "Bitcoin’s death cross confirmation could mean BTC is officially in a bear market",
    "body": "A rare death cross has been confirmed on Bitcoin’s price chart, suggesting that the bear market has just started. Will dip buyers be able to defy the trend?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54720936,
    "published": 1763756680000,
    "title": "Coinbase ’doubles down’ on Solana with latest DEX acquisition",
    "body": "The crypto exchange purchased Vector for an undisclosed amount, the latest acquisition by Coinbase in 2025 after Deribit, Echo and others.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54720935,
    "published": 1763754565000,
    "title": "Bitcoin’s death cross confirmation may mean BTC is officially in a bear market",
    "body": "A rare death cross has been confirmed on Bitcoin’s price chart, suggesting that the bear market has just started. Will dip buyers be able to defy the trend?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54722061,
    "published": 1763758803000,
    "title": "XRP Price Has Surged 15% Anytime This Metric Appeared In The Past",
    "body": "Analysts note that the XRP price is showing unusual resilience, as a key metric previously seen before short-term rebounds reappears on its chart. In a new technical analysis, crypto market expert Dom points out that the latest market setup mirrors conditions that have led to at least a 10% surge each time this pattern emerges. Recurring Metric Signals 10% XRP Price Surge In an X post released while XRP was still trading around $2.19, Dom highlighted a familiar technical signal, noting that past appearances of a bid-skew metric on the chart have consistently led to sharp price recoveries. As a reflection of its previous stability, the analyst stated the XRP had displayed incredible strength over the last several days, trading above the $2 level. Related Reading: Analyst Claims XRP Price Will Surge To $220 Due To ETFs, But Is This Possible? Even as the Bitcoin price plummeted by more than $15,000 in the past few days, the analyst pointed out that XRP had maintained its local low from November 5. The accompanying chart highlights this divergence between XRP and BTC, where the altcoin’s structure holds its range despite the widespread market downturn. Historically, when XRP has shown such strength during periods of Bitcoin weakness, Dom notes that it has signaled countless price reversals. The analyst further highlighted that over the past three months, every time the recurring bid-skew pattern appeared, XRP followed with an upswing of at least 10%. If the historical metric holds, Dom’s analysis suggests there could be a continuation of XRP’s recent resilience, potentially driving its price up by 10% to at least $2.09. At the time of the analyst’s post, this target may have been higher, since XRP was still trading above $2. However, the cryptocurrency has since fallen below that threshold, reaching $1.9 at the time of writing. XRP CVD Data Reveals Controlled Selling Pressure In a subsequent update, Dom shared a second chart, showing that XRP’s price had declined from its previous level of $2.19 to $2.01. He highlighted that this negative price action serves as a reminder that market dynamics don’t always follow textbook patterns. The recent decline in XRP also falls into roughly 15% of cases where typical orderbook signals fail to predict short-term moves. Related Reading: Here’s How High The XRP Price Needs To Be To Flip Bitcoin In the Binance spot market, Dom points out evidence of “controlled” selling rather than forced liquidations. Unlike earlier periods where strong bids consistently led to upward price momentum, XRP’s Spot Cumulative Volume Delta (CVD) curves on Binance, Coinbase, Bybit, and other exchanges are sloping downwards. Moreover, among all the crypto exchanges, Binance has recorded the most decline. Dom notes that controlled selling can be seen clearly in the smoothed cumulative volume lines on the chart. He warns that these developments are tricky to time. Moreover, without a sudden climax or sharp liquidation, bottoming could form slowly, making entries based on traditional reversal signals more challenging. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|altcoin|Binance|bybit|coinbase|CVD|Dom|Ripple|xrp|xrp news|XRP Price|XRP’s Spot Cumulative Volume Delta|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54721969,
    "published": 1763758475000,
    "title": "How low can XRP price go after falling under $2?",
    "body": "XRP price crumples toward new lows as Bitcoin and ETH liquidations surge. Is the altcoin’s next stop $0.88?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54722801,
    "published": 1763760023000,
    "title": "The Best Green Blockchain Initiatives To Watch In 2026",
    "body": "Green blockchain is transforming crypto. Explore energy-efficient networks, ESG-driven innovation, and the sustainability trends shaping 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54726422,
    "published": 1763766276000,
    "title": "Solo Bitcoin Miner Hits the Jackpot, Winning $266K BTC Reward",
    "body": "A solo miner earned a Bitcoin bounty for mining the network’s 924,569th block, securing $266,000 worth of the asset against incredible odds.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54727583,
    "published": 1763768348000,
    "title": "Cardano Network Disrupted by 'Poisoned' Transaction Attack",
    "body": "A validation mismatch sparked an unexpected Cardano network fork as a user publicly apologized for sending the bad transaction.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54728255,
    "published": 1763769626000,
    "title": "$400 Million XRP Offloaded in Just 48 Hours, What’s Behind the Massive Sell Pressure?",
    "body": "XRP has been hit by one of its most aggressive sell waves this year, with on-chain data revealing that major whale wallets offloaded nearly 200 million XRP, roughly $400 million, within just 48 hours. Related Reading: Ethereum Dead Cat Bounce Puts Price At $3,400, But What’s The Ultimate Target? According to Santiment analytics, wallets holding between one million and ten million tokens were the primary contributors, adding significant sell-side liquidity to an already fragile market. This sudden influx of supply arrived at a time when XRP was already battling bearish sentiment across the broader crypto space. The asset slipped 10.32% in 24 hours, falling below the key $2 psychological level, touching lows near $1.85, and posting double-digit losses within a single day. XRP's price trends to the downside on the daily chart. Source: XRPUSD on Tradingview Extreme Fear Grips the Market Market indicators paint a grim picture. XRP is trading below both its 50-day and 200-day Simple Moving Averages, signalling sustained downward momentum. The Fear & Greed Index sits at 14, firmly in “extreme fear” territory, while selling volume surged past $7.2 billion in 24 hours. Analysts warn that a failure to reclaim resistance near $2.30 could open the door to deeper losses, with short-term projections suggesting a potential drop toward $1.50 if bearish pressure continues. The weakness is not isolated to XRP. Bitcoin’s retreat below the $85,000 zone and Ethereum’s slide below $3,000 have triggered market-wide liquidations, with macro uncertainty adding fuel. Concerns over a possible delay in Federal Reserve rate cuts, driven by soft U.S. jobs data and rising unemployment, have dented investor appetite for risk assets across the board. Will XRP Stabilize or Sink Further? The big question now is whether whales will continue distributing or pause their offloading. If no new wave of large-scale selling emerges, analysts believe XRP could stabilize and attempt to reclaim the $2 mark in the coming sessions. Recovery projections place the short-term target between $2.50 and $2.70, though this would require a decisive break above long-standing resistance. Medium-term predictions remain cautiously optimistic but restrained. Many experts expect XRP to trade between $1.96 and $2.27 into the end of 2025, with stronger upside momentum unlikely until regulatory clarity and upcoming ETF activity begin shaping demand heading into 2026. Related Reading: Saylor’s Strategy Under Threat: Index Status At Risk With $8 Billion On The Line For now, XRP faces a heavy supply overhang, and whether the bleeding stops depends on what the whales do next. Cover image from ChatGPT, XRPUSD chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|xrp|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54728533,
    "published": 1763770073000,
    "title": "Bitcoin Falls To Almost $80,000 As Bloodbath Continues",
    "body": "Bitcoin prices dropped to almost $80,000 on November 21 as what one analyst described as a “perfect storm” of macro factors fueled additional bloodletting.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54728426,
    "published": 1763769667000,
    "title": "Bitcoiners perk up as odds of a December Fed rate cut almost double",
    "body": "Some Bitcoiners are speculating that the significant surge in the odds of a Fed rate cut in December may lead to Bitcoin finding a price “bottom here for now.”",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]