[
  {
    "id": 56971233,
    "published": 1767866403000,
    "title": "Bitcoin Bounce A Bull Trap? Analyst Sees 2022-Style Bear Flag",
    "body": "A cryptocurrency analyst has pointed out how the recent Bitcoin price action could echo the bear flag formation from the 2021-22 period. Bitcoin May Be Inside A Bear Flag Right Now In a new post on X, analyst Ali Martinez has highlighted a similarity that has been emerging between the Bitcoin price trend from 2021-22 and that from 2025-26. Related Reading: Bitcoin Fear & Greed Index Nears Neutral As Price Recovers Below is the chart shared by Martinez that puts the two periods side-by-side. As is visible in the graph, Bitcoin saw a 54% drawdown during the first half of 2021, before witnessing another leg of the bull run to a new all-time high (ATH) above $69,000 later in the year. This high was followed by a bearish shift, with the price quickly sliding off as 2022 arrived. In 2022, the cryptocurrency observed consolidation inside a technical analysis (TA) pattern known as a Bear Flag. As the name suggests, Flag patterns look like a flag on a pole. In the case of a Bear Flag, the setup is oriented in the reverse direction; an initial sharp downward move represents the “pole,” while a parallel consolidation channel makes up for the “flag.” When the asset is trading inside the flag, it finds support at the lower level of the channel and resistance at the upper one. A break out of either of these bounds can signal a sustained move in that direction. Flags are considered to be continuation patterns, meaning that breakouts from them are likely to lead into the same direction as the preceding price trend. That is, a breakout could occur in the same direction as the pole. From the chart, it’s apparent that this appears to be what happened with Bitcoin back in 2022, with the price escaping downward from the Bear Flag with a sharp crash. Jumping to the recent Bitcoin price action, the cryptocurrency saw a similar trajectory in 2025 as in 2021, with an initial leg of the bull run leading to a second one that resulted in a new ATH (this time above $126,000). One difference, however, was that the legs of this bull market were separated by a price decline of just 30%. Since the latest record, BTC has once again faced a bearish transition, with its price plummeting to a low in November and beginning a period of consolidation. The analyst thinks that the latest phase of sideways movement could be occurring inside a Bear Flag, similar to the one from 2022. Related Reading: Bitcoin Funding Rates Improve, But Signal Still Not Decisive: Glassnode It now remains to be seen whether the cryptocurrency’s trajectory is indeed similar this time around as well or if the two cycles will diverge. BTC Price Bitcoin has seen a setback in its recovery as its price has dropped back to $91,000. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin Bear Flag|Bitcoin Bull Trap|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56972461,
    "published": 1767869131000,
    "title": "India's Tax Department Echoes Reserve Bank's Concerns on Crypto",
    "body": "Tax authorities flagged enforcement challenges with virtual digital assets ahead of the Union Budget presentation.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56972840,
    "published": 1767870026000,
    "title": "XRP Whales Wake Up: $100,000+ Transfers Hit 3-Month High",
    "body": "XRP Ledger whale activity spiked sharply at the start of the week, with on-chain data provider Santiment flagging a surge in large-value transfers that pushed the network to its highest $100,000+ transaction count in roughly three months, a setup the firm says typically coincides with elevated volatility. XRP Whales Are Waking Up Again “XRP Ledger has seen a major increase in whale transactions (moved valued at $100K or more on the network),” Santiment wrote in a post on Wednesday via X alongside a Sanbase chart. “Monday saw 2,170 of them, and yesterday shot all the way up to 2,802 (a 3-month high). Volatility should be higher than usual.” The chart, labeled “XRP $1M+ & $100K+ Whale Transactions Per Day,” highlights two specific data points for the $100K+ threshold: 2,170 transactions on Jan. 5, 2026 and 2,802 transactions on Jan. 6, 2026. The Jan. 6 print is marked as the local peak and, per Santiment’s commentary, the strongest reading in approximately three months, the highest shown since the infamous October 10 liquidation event. Related Reading: XRP Rally Reopens The $8–$12 Zone Debate, Says Will Taylor While Santiment’s post spotlights $100K+ transfers, the chart also tracks $1 million-plus whale transactions. That series suggests large-holder activity picked up across multiple size bands into the early-January move, with $1 million transactions pushing to a one-month high, the strongest reading since early December. The jump stands out because $1 million-plus activity appears to have been comparatively muted through most of December, especially when set against the mid-October to November stretch, when the chart shows more frequent days with higher counts. Related Reading: XRP Sees Back-to-Back Liquidation Waves: Binance Absorbs Majority Of Liquidations In practical market terms, traders tend to watch bursts in large on-chain transfers for what they might represent rather than treating the raw counts as a directional signal. Spikes can reflect accumulation or distribution, internal treasury movements by large entities, exchange-related transfers, or positioning around liquidity events. What they often share is mechanical impact: when large holders move size, the probability of sharper intraday swings tends to increase, particularly if that activity persists over multiple sessions. XRP Also Re-Enters The Social ‘Trending’ Set The whale-transaction alert landed alongside a separate Santiment update that placed XRP among the assets seeing the biggest jumps in discussion across social channels. In that post, Santiment grouped XRP with Solana, Ethereum, Bitcoin, MicroStrategy, and Litecoin as the day’s top “trending” tickers by changes in conversation volume for Wednesday. For XRP specifically, Santiment said the discussion mix leaned heavily institutional in tone: ETF flows, “record-breaking net assets,” and the idea of XRP as a high-beta trade into 2025–2026 narratives while also referencing perceived regulatory clarity after the SEC case resolution and use cases such as bridge activity for stablecoins and tokenized real-world assets. Those claims were presented as themes circulating in social chatter rather than as independently verified developments in the post itself. At press time, XRP traded at $2.127. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|Santiment|xrp|xrp news|XRP Price|XRP Whales",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56972947,
    "published": 1767870209000,
    "title": "Zcash developer team behind ECC quits after governance clash with Bootstrap board",
    "body": "ECC's CEO, Josh Swihart, claims the team was forced to leave because of changes that made their work untenable.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Tech|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      }
    ]
  },
  {
    "id": 56973743,
    "published": 1767871700000,
    "title": "Bitcoin falls to $90,000 as altcoins slide in thin trading: Crypto Markets Today",
    "body": "Bitcoin retreated to five-day lows during as repeated failures to break through $94,500 reinforced a tight trading range.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|Derivatives|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56973464,
    "published": 1767871268000,
    "title": "Fireblocks Expands Into Crypto Accounting With TRES Finance Acquisition",
    "body": "The deal links custody infrastructure with audit-ready reporting as firms face regulatory and capital markets pressure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 56974535,
    "published": 1767872820000,
    "title": "October's crypto crash left market makers stuffed with coins, slowing trading: BitMEX",
    "body": "BitMEX's annual report details the impact of the Oct crash on market liquidity, basis trades and other key issues.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|BitMEX|Cryptocurrency|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56975393,
    "published": 1767875400000,
    "title": "Bitcoin Absorbs The Flush: Quantum Structure Signals Wave (3) Toward $104,000",
    "body": "Bitcoin has absorbed a sharp sell-off and stabilized at key support, signaling that buyers are firmly in control. With the market holding its structure, insights from Quantum Models suggest that Wave (3) is underway, pointing toward a near-term target around $104,000. Q-Structure Confluence Holds Firm, Keeping The Bullish Bias Alive Elliott Chart, in a recent update, highlighted that Bitcoin remains firmly supported around the Q-Structure λ₅ confluence zone, a level that continues to underpin the broader bullish outlook. This support area has absorbed selling pressure, suggesting that larger participants are still defending key levels despite recent volatility. Related Reading: Bitcoin Price Dips Further, Setting Up a High-Stakes Support Moment Upon closer examination of market structure, the recent pullback is now being classified as a complex corrective phase rather than the beginning of a larger downtrend. Specifically, the correction is interpreted as Intermediate Wave (2), unfolding through a Zigzag W | Zigzag X | Triangle Y setup. With this corrective pattern largely resolved, Elliott Chart highlights that Intermediate Wave (3) is now in progress, with Minor Waves 1 and 2 already taking shape. This suggests the market is building the foundation for a more decisive move higher. The critical piece still developing is an impulsive Minor Wave 3. Historically, this wave tends to be the strongest and most aggressive part of an advance. If it unfolds as expected, the model points to a near-term Q-Target around $104,444, generated using the Q-Structure λᵣ projection. This bullish scenario is derived from insights within the Quantum Models framework and is not based on short-term noise. Notably, this potential trend reversal was first projected back on November 15, during Bitcoin’s decline. Sharp Flush Finds Strong Demand At Key Levels Delving into current price actions, CyrilXBT disclosed that Bitcoin experienced a sharp flush but found buyers precisely at a critical support level, allowing the price to stabilize and gradually grind higher. This reaction indicates that the recent sell-off was absorbed by strong demand rather than driven by panic selling, reflecting healthy market participation from buyers at key zones. Related Reading: Bitcoin’s Recovery Extends Into 2026 as Charts Hint at Another Leg Higher This type of price action highlights absorption, not fear. What stands out most is the higher-low structure that has emerged following the drop. This formation is important because it signals that downside pressure is weakening. As long as Bitcoin continues to hold within this reclaimed range, the risk of a deeper sell-off diminishes, and the market maintains the potential for further upward moves. Sideways or consolidating price action at these levels is constructive for the overall crypto market. Maintaining this structure sets the stage for a healthier, more sustainable advance for Bitcoin rather than a rushed or volatile rebound. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|CyrilXBT|Elliott Chart|Q-Structure λ₅ Confluence Zone|Quantum Models|Zigzag W | Zigzag X | Triangle Y",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56975788,
    "published": 1767876380000,
    "title": "BNB falls below $885 as broader market pulls back and treasury tensions emerge",
    "body": "The token's performance is likely impacted by a civil war within a major BNB treasury firm, where a shareholder is challenging the company's leadership.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|BNB|Technical Analysis",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56975566,
    "published": 1767875568000,
    "title": "Binance expands into precious metals with gold, silver futures settled in USDT",
    "body": "Binance launched gold and silver perpetual futures settled in USDT, expanding onchain access to traditional safe-haven assets amid rising metals demand.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56975518,
    "published": 1767875400000,
    "title": "Banks must upgrade their blockchain infrastructure",
    "body": "Banks risk falling behind if they cling to private blockchains. Upgrading to public, permissioned layer-2 infrastructure with ZK-proofs is essential for modern finance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      }
    ]
  },
  {
    "id": 56976279,
    "published": 1767877218000,
    "title": "Zcash Plunges Double Digits After ECC Team ‘Constructively Discharged’",
    "body": "In a statement, the board said that the disagreements stemmed from recent proposals to privatize the Zashi mobile wallet.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "zcash|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      }
    ]
  },
  {
    "id": 56976786,
    "published": 1767878380000,
    "title": "Crypto Liquidations Top $477M as Bitcoin Slips Below $90K",
    "body": "Bitcoin’s dip below $90,000 has triggered a liquidation spree as bullish momentum fades amid ETF outflows and thin liquidity.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|bonk||pepe||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56977889,
    "published": 1767880800000,
    "title": "Tokenized Brazilian credit card debt offers 13% yield through BlackOpal's GemStone platform",
    "body": "The initiative leverages the Plume Network to tokenize credit card receivables, while giving merchants immediate access to cash.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Brazil|Markets|Tokenization|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 56977892,
    "published": 1767880800000,
    "title": "Stand With Crypto advocacy group sees nearly 700,000 new members ahead of 2026 election",
    "body": "The organization established by Coinbase to mobilize crypto enthusiasts has built up a 2.6-million-member base across 50 state chapters as U.S. elections loom.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Stand With Crypto|crypto legislation|U.S. Political Elections|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56977887,
    "published": 1767880757000,
    "title": "Digital assets to move from speculation to infrastructure in 2026, B. Riley says",
    "body": "Regulatory clarity, tokenization and bank adoption will push crypto firms from balance-sheet accumulation toward real operations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Digital Asset Treasury|Bitmine|B. Riley|Analysts|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56977769,
    "published": 1767880377000,
    "title": "China’s interest-bearing digital yuan piles pressure on US stablecoin rules",
    "body": "China’s move to pay interest on the digital yuan is colliding with the GENIUS Act’s ban on stablecoin yield, intensifying questions over whether US digital dollars can stay competitive.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      }
    ]
  },
  {
    "id": 56979002,
    "published": 1767883079000,
    "title": "Zcash backer Bootstrap says split due to clash over nonprofit rules, Zashi future",
    "body": "Zcash’s nonprofit backer Bootstrap said governance tensions stem from nonprofit limits on outside investment, following a split with Electric Coin Company.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      }
    ]
  },
  {
    "id": 56979457,
    "published": 1767883844000,
    "title": "Polymarket user who won $400K on Maduro ouster bet quietly disappears",
    "body": "The Polymarket account that profited on Nicholas Maduro's capture and ouster as president is inaccessible, adding to concerns over insider trading allegations on prediction markets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 56980003,
    "published": 1767885300000,
    "title": "Optimism proposes OP token buybacks using 50% of superchain revenue",
    "body": "Under the proposal, which is set to move to a governance vote on January 22, Optimism would begin monthly buybacks starting in February.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Optimism|Optimism foundation|Token Governance|Ethereum News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 92,
        "NAME": "OP",
        "CATEGORY": "OP"
      }
    ]
  },
  {
    "id": 56979894,
    "published": 1767885060000,
    "title": "JPMorgan says the crypto selloff may be nearing a bottom as ETF outflows ease",
    "body": "Flow and positioning data suggest the recent crypto market correction may be running out of steam, with early signs of stabilization across ETFs and derivatives.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Ether|ETFs|JPMorgan|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56980442,
    "published": 1767885992000,
    "title": "Bitcoin trader maintains $76K BTC price target as 2026 comeback fizzles",
    "body": "Bearish BTC price takes are back in full force as Bitcoin gave back the majority of its 2026 recovery, when bulls failed to overcome $95,000 resistance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56981314,
    "published": 1767888000000,
    "title": "Polygon Labs unveils ‘Open Money Stack’ to power borderless stablecoin payments",
    "body": "The system will bring together various elements of the payment stack, including liquidity, orchestration, and regulatory controls.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Polygon|Polygon labs|Ethereum News|Stablecoin|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 38,
        "NAME": "MATIC",
        "CATEGORY": "MATIC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56981189,
    "published": 1767887583000,
    "title": "Zcash governance in turmoil: How low can ZEC price go?",
    "body": "Zcash's technical and fundamental catalysts raise the odds of ZEC price declining to as low as $200 in the coming weeks after core developers exited the project.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      }
    ]
  },
  {
    "id": 56981597,
    "published": 1767888591000,
    "title": "Ethereum is the Linux of blockchain, says co-founder Vitalik Buterin",
    "body": "The Ethereum co-founder made the case that Ethereum occupies a role similar to the Linux operating system, but for shifting value and risk on the internet.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56981594,
    "published": 1767888588000,
    "title": "Bitcoin on Exchanges Can Be Legally Seized in South Korea, Supreme Court Affirms",
    "body": "The South Korean Supreme Court confirmed that Bitcoin stored on crypto exchanges can be seized under criminal law, rejecting an appeal.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56982482,
    "published": 1767890555000,
    "title": "XRP ETFs see $40M of outflows after eight-week run of inflows",
    "body": "The outflow was primarily due to a $47.25 million redemption from 21Shares’ TOXR, while other funds remained stable or positive.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|XRP News|ETFs|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56982974,
    "published": 1767891601000,
    "title": "Ethereum Validators Face Multi-Week Wait As Staking Participation Rises",
    "body": "The Ethereum staking ecosystem is showing clear signs of tightening as demand for validators continues to rise. Participants now face a multi-week wait to enter the network. This growing staking queue reflects a structural shift in how ETH is being held and deployed less as a liquid supply and more as long-term productive capital. As more ETH becomes locked in validation, the dynamics of supply, yield, and network security are quietly being reshaped. Why Validator Delays Add Friction To Supply Re-Entry The current state of Ethereum staking highlights a growing problem with predictability. Crypto expert Dave has pointed out on X that the ETH staking entry queue is now showing an estimated wait of 25 days and 4 hours to enter. Previously, the wait time was around 7.55 days, which is a more than threefold increase in wait time over a relatively short period. Related Reading: Ethereum Staking Deposits Just Surpassed Withdrawals, Why This Could Send ETH Price Above $4,000 At the same time, the exit queue is reporting a wait time of 14 minutes, which previously sat for 44.25 days, representing a reduction of well over 4,000 times, from weeks to minutes. According to Dave, staking on a blockchain with this level of variance between entry and exit requirements is uncertain. Waiting weeks to enter while exit clears almost instantly makes staking behavior highly state-dependent and unpredictable. This contract is exactly why the expert prefers staking on Cardano, because there is no entry queue. Also, delegation is reflected on-chain immediately, and stake changes are transparent and deterministic. The only delay is a fixed active stake period of two epochs, which is 10 days before delegation changes take effect. This consistency is the difference because there are no dynamic queues, no sudden shifts, and no surprises driven by changing network states. If demand to stake on Cardano increases rapidly, it will make absolutely no difference, because predictability matters especially with monetary investments. Why Throughput Without Context Is Meaningless The headline claim of $8 trillion in stablecoin transfers on Ethereum sounds impressive, but it’s a completely meaningless metric. Crypto analyst DBCrypto noted that a single entity can move $1 billion back and forth between two wallets ten times, creating a sudden $10 billion in volume, but generating zero economic activity. Related Reading: Big Bet On Ethereum: CEO Sees 10X TVL Growth In 2026 This is why banks don’t advertise transfer volume as a growth metric, as volume without context tells nothing about utility or growth. However, crypto continues to elevate these numbers as milestones because big figures pump bags. What’s being measured here is motion and activity, not progress or value. DBCrypto concluded that until the industry stops celebrating vanity metrics, it will continue to confuse noise for signal. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum|Cardano|Crypto expert Dave|DBCrypto|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|Ethereum Staking Ecosystem|Ethereum Staking Entry Queue|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56982655,
    "published": 1767890879000,
    "title": "Bank of America Upgrades Coinbase to 'Buy' on Base Prospects, Tokenization Tailwinds",
    "body": "Binance’s U.S. expansion could be a threat, the bank warned while upgrading Coinbase to a \"Buy\" rating.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56983338,
    "published": 1767892361000,
    "title": "Google Just Overhauled Gmail With Gemini 3, Turning It Into an AI Assistant",
    "body": "Google integrated Gemini 3 into Gmail, transforming the inbox into an assistant with summaries, drafting tools, and new privacy controls.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 56983071,
    "published": 1767891640000,
    "title": "Drake Lawsuit Exposes $38 Billion Illegal Crypto Casino Market",
    "body": "Drake faces RICO lawsuit as new data reveals illegal gambling captured $38.7 billion of US online market in 2025—74% of volume goes to unlicensed operators.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 56983060,
    "published": 1767891519000,
    "title": "Stand With Crypto: Primary goal for 2026 is crypto market structure",
    "body": "The organization reported more than 2.6 million advocates in the US ahead of the midterm elections that could change the political party in control of Congress.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56985043,
    "published": 1767896049000,
    "title": "Coincheck to acquire digital asset manager 3iQ in $112M stock deal",
    "body": "The transaction would give the Japanese exchange operator control of the Canadian asset manager, expanding its presence in regulated investment products.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56984811,
    "published": 1767895500000,
    "title": "BlackRock adds $900M BTC as Bitcoin long-term selling falls to 2017 lows",
    "body": "BlackRock adds $900 million in Bitcoin as long-term holder selling drops to 2017 lows, pointing to early signs of BTC accumulation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56985389,
    "published": 1767897009000,
    "title": "Dogecoin Rapid Accumulation Suggests Sharp Upward Sweep Is Coming",
    "body": "Dogecoin (DOGE) is rebounding strongly alongside the broader meme coin market, which has experienced a notable uptick in Q1 2026. As sentiment surrounding meme coins continues to improve, a crypto analyst suggests that Dogecoin could be positioning for more gains. The analyst notes that Dogecoin’s rapid accumulation signals the potential for a sharp upward sweep in the near term. Dogecoin Accumulation Signals Upward Sweep Crypto market expert Bitguru recently shared a fresh technical outlook on Dogecoin, highlighting how its price structure has consistently changed after months of corrective movement. According to him, a completed liquidity sweep followed by an extended consolidation phase suggests that the market has reset and may be setting up for a bullish continuation. Related Reading: Catalysts That Suggests The Dogecoin Price Rally Could Continue Bitguru explained that Dogecoin’s chart shows price stability after clearing sell-side liquidity between November and December 2025, which pushed out weak holders and created a base for accumulation. The consolidation that continued into 2026 shows lower volatility and steady base building, two conditions the analyst believes are needed before Dogecoin’s next major price move. The chart also illustrates bullish patterns, such as a rounded H cup formation and a continuation phase in the middle of 2025, which helped establish higher price levels before the broader market pullback. Bitguru added that Dogecoin’s recent move back above the key support near $0.14 suggests accumulation is likely completed, as price now starts to tighten and move upward from its base level. He noted that as long as Dogecoin stays above this reclaimed support, the chances of an upward sweep toward higher supply zones increase. The chart also points to potential gains reaching the highlighted green target area between $0.188 and $0.194, which lines up with past resistance levels that have previously limited price movement during the decline. Area That Could Invalidate Upward Sweep Bitguru’s chart also shows the possibility of a price decline despite the rapid increase in accumulation. The red zone on the chart represents a stop-loss or risk area. If Dogecoin falls below the support area around $0.148, it could initiate a drop toward new lows within this risk zone. Related Reading: The Dogecoin Cycle Fractal That Shows Where The Price Is Headed Next If the meme coin’s price dips below the consolidation zone between $0.146 and $0.148, then the analyst’s bullish setup and potential upward sweep could be invalidated. The chart projects a potential decline to the $0.13-$0.11 range, reflecting a decrease of more than 9% from current levels. At the time of writing, the Dogecoin price is trading at $0.143, up more than 18% this week, according to CoinMarketCap data. Although the meme coin is showing clear signs of a recovery from former downtrends, its trading volume is still down by more than 30%. Moreover, DOGE’s price has been unexpectedly volatile recently, dropping by 5% over the past 24 hours. Featured image from Pngtree, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|Bitguru|CoinMarketCap|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt|meme coin",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56985341,
    "published": 1767896765000,
    "title": "JPMorgan expands blockchain goals, plans to build ‘interoperable digital money’",
    "body": "As Siemens uses JPMorgan's blockchain for FX transfers, the bank plans to scale JPM Coin across privacy-focused and public networks",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Exclusive|JP Morgan|Interoperability|JPM Coin|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 56986474,
    "published": 1767899630000,
    "title": "Crypto Market Cools as Bitcoin Stays Within Death Cross: Analysis",
    "body": "The post-New Year rally fizzled fast. Bitcoin is back in death cross territory, and the charts aren't giving bulls much to celebrate.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56986709,
    "published": 1767900377000,
    "title": "VanEck Predicts Bitcoin Could Reach $2.9 Million In New Long-Term Capital Report",
    "body": "According to an ambitious research study published by asset manager and cryptocurrency exchange-traded fund (ETF) issuer VanEck, Bitcoin (BTC) could potentially reach a staggering price of $2.9 million per coin by 2050. The insights come from Matthew Sigel, the firm’s Head of Digital Assets Research, and Senior Investment Analyst Patrick Bush, who have employed a valuation framework based on Bitcoin’s role in two primary total addressable markets: as a medium of exchange (MoE) and as a reserve asset for central banks. VanEck Projects 15% CAGR For Bitcoin In their analysis, Sigel and Bush project a 15% compound annual growth rate (CAGR) from Bitcoin’s current levels, which would position the cryptocurrency as a significant player in the global economy. Related Reading: Did Morgan Stanley Orchestrate Bitcoin October Crash? Analysts Draw Correlations The report outlines two structural shifts that they believe will be pivotal for Bitcoin’s appreciation. The first, dubbed the Settlement Pivot, predicts that by 2050, Bitcoin will be responsible for settling between 5% and 10% of global international trade, as well as 5% of domestic trade transactions. The second crucial aspect, referred to as the Reserve Pivot, connects Bitcoin’s potential growth to waning trust in G7 sovereign debt. As confidence in these currencies diminishes, the authors anticipate that central banks might allocate resources toward Bitcoin as a hedge against fiscal instability. Yet, the VanEck report does not stop at a mere base case; it also explores a more optimistic scenario termed the Bull Case. ‘Hyper-Bitcoinization’ In this scenario, known as “hyper-bitcoinization,” if Bitcoin captures 20% of international trade and 10% of domestic GDP, its value could skyrocket to $53.4 million per coin, representing a major 29% CAGR. Achieving this would require Bitcoin to either equal or surpass gold’s status as a primary global reserve asset, making up nearly 30% of financial assets worldwide. Related Reading: GENIUS Act Key Provisions In Spotlight: XRP Attorney Deaton Alerts To Bankers’ Role For context, the report uses a baseline current price of approximately $88,000 when projecting these values. Interestingly, it incorporates a Bear Case target of $130,000, reflecting a modest 2% CAGR. In terms of correlation, VanEck anticipates that Bitcoin will exhibit low to moderate correlation with global equities, bonds, and gold over various market cycles. Notably, they emphasize a persistent negative correlation with the US Dollar (DXY), reinforcing Bitcoin’s potential role as a hedge against monetary debasement. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|bitcoin|Bitcoin news|bitcoin price|Bitcoin Price Forecast|bitcoin price prediction|bitcoin technical analysis|btc|BTC news|btc price|BTCUSDT|crypto|crypto market|crypto news|VanEck Bitcoin|VanEck news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56986634,
    "published": 1767900146000,
    "title": "‘Deeply undervalued’ bitcoin faces continued bear market with no clear upside catalyst",
    "body": "Experts say the next major rally may come only when long-term holders are exhausted, and true institutional capital enters the market.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|market analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56987543,
    "published": 1767902457000,
    "title": "Bearish Signal Emerges For Ethereum As US Spot Demand Fades",
    "body": "Ethereum has once again failed to hold above a critical resistance zone, retracing from the $3,300 level back toward the $3,100 area. The pullback highlights the market’s ongoing struggle to establish a sustainable recovery, as bullish momentum continues to fade near key technical thresholds. While buyers have managed to prevent a deeper correction for now, the inability to reclaim higher levels has reinforced a cautious tone across the market. Related Reading: Bitcoin Tests Key Resistance While $4.7B In Sell-Side Liquidity Builds Beyond price action, on-chain data adds an important layer to this weakness. According to data from CryptoQuant, Ethereum’s Coinbase Premium Gap has dropped sharply into negative territory. This metric, often used as a proxy for US institutional demand, reflects the price difference between Coinbase and offshore exchanges. A negative reading suggests that buying interest from US-based investors is lagging behind global activity, reducing the probability of a strong upside continuation. Historically, sustained Ethereum rallies have coincided with a positive Coinbase Premium, signaling consistent institutional accumulation. The current divergence between price attempts to stabilize and weakening US demand creates a structural headwind for bulls. As long as this premium remains negative, reclaiming the $3,300 level becomes increasingly difficult. For now, Ethereum appears trapped in a fragile range, where price stability depends less on aggressive buying and more on the absence of renewed selling pressure. The coming sessions will be decisive in determining whether this consolidation evolves into a recovery or resolves to the downside. Coinbase Premium Weakness Undermines Recovery Attempt A new on-chain signal is reinforcing the cautious outlook for Ethereum as it trades below key resistance. Analysis shared by CryptoQuant and highlighted by CryptoOnchain shows that the Coinbase Premium Gap has deteriorated sharply, reaching its most negative level in nearly a year. The 14-day moving average of the metric has fallen to around -2.3, indicating that ETH prices on Coinbase are trading at a notable discount compared to Binance. This divergence matters because Coinbase activity is often used as a proxy for US institutional demand. When the premium turns deeply negative, it typically signals that buyers in the US spot market are either stepping aside or actively distributing rather than accumulating. That dynamic is unfolding as Ethereum remains capped below the $3,300 resistance zone, following its sharp correction from the October peak near $4,700. The combination of weak price follow-through and declining Coinbase demand creates a bearish divergence. While ETH attempts to stabilize, the lack of institutional participation reduces the probability of a sustained breakout. Historically, strong Ethereum rallies have required a positive Coinbase Premium, reflecting consistent inflows from US-based investors. Until this gap narrows and flips back into positive territory, Ethereum’s upside appears constrained. For now, the data suggests caution is warranted, as the persistence of weak US demand increases the risk that recent consolidation resolves into another leg lower rather than a confirmed recovery. Related Reading: XRP Sees Back-to-Back Liquidation Waves: Binance Absorbs Majority Of Liquidations Ethereum Struggles As Recovery Lacks Confirmation Ethereum’s price action remains fragile after failing to reclaim the $3,300 resistance zone. On the daily chart, ETH is trading near the $3,100–$3,150 area, a level that has acted as a short-term pivot but has not yet attracted strong follow-through from buyers. The broader structure still reflects a corrective phase rather than a confirmed trend reversal. From a technical perspective, ETH remains below its key moving averages. The 50-day moving average is sloping downward and continues to cap upside attempts, while the 100-day and 200-day moving averages sit higher, reinforcing a heavy overhead supply zone between roughly $3,300 and $3,600. Each rally into this region over recent weeks has been met with renewed selling pressure, highlighting persistent distribution. Related Reading: Bitcoin Enters Accumulation Regime: Market Supported By Seller Exhaustion, Not Buying Surge The sequence of lower highs since the October peak near $4,700 remains intact. Although price has stabilized compared to the sharp November sell-off, the rebound so far resembles consolidation within a bearish structure rather than a new impulsive move. Volume has also moderated during recent advances, suggesting limited conviction behind the bounce. On the downside, the $2,900–$3,000 range stands out as a critical support area. A sustained break below this zone would expose Ethereum to a deeper retracement toward the mid-$2,600s. For bullish momentum to regain credibility, ETH must reclaim $3,300 with strength and hold above the declining moving averages. Until then, the chart argues for caution, with downside risks still present despite short-term stabilization. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum News|ETH|ethereum|Ethereum CoinBase|ethereum news|Ethereum spot demabd|Ethereum spot premium|Ethereum US|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56987526,
    "published": 1767902289000,
    "title": "Morgan Stanley to launch digital asset wallet as part of crypto product expansion",
    "body": "The wallet, expected to launch this year, will support cryptocurrencies and RWAs as the financial services company adds to its suite of crypto investment products.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56987833,
    "published": 1767903157000,
    "title": "New York Lawmakers Target Prediction Markets as NHL's Rangers Ink Polymarket Deal",
    "body": "A New York assemblyman reintroduced a bill that would restrict prediction markets, barring bets on individual sports matches, war, and more.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 56987806,
    "published": 1767903104000,
    "title": "Bank of America upgrades Coinbase to 'buy' as exchange moves beyond crypto",
    "body": "Bank of America said it recommended investors buy Coinbase's stock, pointing to its new products including weekday equities trading and prediction markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Coinbase|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56988003,
    "published": 1767903516000,
    "title": "Truebit token price falls 99% after reports of $26M exploit",
    "body": "The TRU price fell to $0.0000000029 from $0.16 after the protocol reported a security incident and crypto sleuths tracked stolen Ether.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 56988888,
    "published": 1767905759000,
    "title": "Bitcoin bulls chase $91K as early 2026 rally finds sustained volume",
    "body": "Bitcoin bulls are making a run on $91,000 as start-of-the-year trading volumes highlight the market’s expectation of a positive Q1.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56989565,
    "published": 1767907853000,
    "title": "Here’s How High The Dogecoin Price Would If It Repeats Previous Parabolic Runs",
    "body": "Dogecoin’s price action has a habit of compressing quietly before going on a massive rally, and the late-2024 rally is one of the clearest examples of that behavior. After spending weeks grinding sideways around $0.10, the meme coin transitioned into a parabolic phase that carried the price to about $0.45 in a matter of two to three months. Now, how high would the Dogecoin price go if it were to repeat that same parabolic structure? How Dogecoin’s Late-2024 Parabolic Run Played Out The 2024 rally began from a base that had formed just above $0.10, right where Dogecoin spent a long time absorbing sell pressure. Once buyers regained control, Dogecoin cleared intermediate resistance around $0.15 and $0.20 with minimal pullbacks, then entered a vertical phase that pushed it through $0.30 and to $0.45. Related Reading: Dogecoin 50% Crash: Q4 Set To End In Red As All Supports Fail The key takeaway from that period is not just the magnitude of the move, but its speed, as Dogecoin delivered a roughly 4.5x increase in a very short time window of less than four weeks. That move unfolded rapidly, with little warning, and was characterized by expanding volume, strong bullish candles on the 4-hour candlestick timeframe, and momentum indicators pressing into overheated territory. As shown in the chart below, this period was characterized by high RSI readings that pushed into the 70 to 80 range. Applying The Same Parabolic Structure Parabolic rallies often catch many investors off guard. Particularly, one of the defining features of Dogecoin’s strongest rallies is that they rarely announce themselves clearly. Since Dogecoin has performed like that before, then it is not out of proportion to expect similar performance, especially considering that it is now back to trading close to the lows that it rebounded from in late 2024. Related Reading: Can Dogecoin Price Reach $1 In 2026? Analysts Reveal What To Expect If Dogecoin were to produce a similar percentage expansion from a higher base, the arithmetic would also be straightforward. Using $0.15 as a reference level, a move equivalent to the late-2024 rally would project the price to around $0.60 to $0.67. That scenario assumes the same kind of rally seen previously, where the consolidation finally gives way to a parabolic rally, not a gradual grind higher. In practical terms, a trader holding 1,000 DOGE at $0.15 would have a position valued near $150 at entry, while a move to anywhere between $0.60 and $0.67 would lift that same holding into the $600 to $675 range. These figures do not come with any suggested timeline. Instead, they serve to show how Dogecoin’s past parabolic moves would translate if the same price behavior were applied to current levels. Even under that framework, the projected move is below Dogecoin’s existing all-time high of $0.76. At the same time, separate outlooks are already pointing to a push beyond that peak, with one notable prediction expecting a move to $0.80 very soon. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt|RSI",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56989909,
    "published": 1767908569000,
    "title": "CFTC issues no-action letter to Bitnomial, clearing way for event contracts",
    "body": "The no-action letter comes amid growing acceptance by US regulators of prediction-style markets and event contracts during an election year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 56989718,
    "published": 1767908228000,
    "title": "Bitnomial wins U.S. regulator's nod on prediction markets push, joins growing crowd",
    "body": "U.S. derivatives platform and clearinghouse is focusing on prediction contracts targeted at digital assets movements and economic indicators.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Bitnomial|U.S. Commodity Futures Trading Commission|Prediction Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56990266,
    "published": 1767909615000,
    "title": "Stablecoins Live Up To Their Billing During Venezuela Turmoil",
    "body": "Maria Clara Cobo writes on how Venezuelans increasing depend on cryptocurrencies to navigate the uncertainty that has engulfed the nation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56991468,
    "published": 1767913211000,
    "title": "Analyst Predicts Strongest XRP Price Rally In History Is Coming, Here’s Why",
    "body": "Crypto analyst Bird has indicated that the XRP price may be on course to record its greatest rally ever. The analyst alluded to the falling Bitcoin dominance as the reason why the altcoin could surge soon enough, noting how this development has preceded previous XRP rallies. Analyst Predicts Huge XRP Price Rally On The Horizon In an X post, Bird predicted that the XRP price is set to record its strongest rally yet based on the breakdown in Bitcoin’s dominance. This came as he noted that BTC.D dropped hard the last three times when XRP went truly parabolic, in 2018, 2021, and 2024. The 2018 run was when XRP rallied to its previous all-time high (ATH). Related Reading: Why XRP Is About To Experience A Legendary Next 3 Months Bird stated that after that first XRP price ATH between 2018 and 2021, the Bitcoin dominance began to trend back up. The BTC.D then backtested the trend and rebuilt strength before eventually rolling over. Once that rollover occurred, XRP went parabolic again in 2021. A similar scenario is said to have played out in 2024, as Bitcoin’s dominance dropped sharply through the trendline, briefly breaking down and triggering the surge. The analyst noted that the move in 2024 didn’t fully commit as Bitcoin’s dominance recovered and the breakdown failed. However, the attempt was enough to send the XRP price flying, reaching all-time highs. Bird reiterated that XRP is sensitive to a breakdown in Bitcoin’s dominance, even temporarily. Now, a similar move could be playing out again, which could send the XRP price to new highs. Bird stated that between 2023 and 2025, the Bitcoin dominance has trended up once more, broke down through the trend, backtested it from underneath, and is now chopping and rolling over. The analyst added that this is the same historical area where XRP has gone parabolic before, but that this time the setup is even bigger. The Altcoin Could Rally To Double Digits The analyst again alluded to the 2024 run. He stated that if a brief uncommitted breakdown in Bitcoin’s dominance was enough to send the XRP price surging, then a confirmed breakdown would be exponentially stronger. In line with this, Bird remarked that the next move is the one that sends XRP into double digits and beyond. Related Reading: Analyst Updates XRP Price Prediction: Why $16 Is Still On The Table Bird stated that the key difference is what comes next, as this next move isn’t just a fake-out or a shallow drop. Instead, it is the one where the Bitcoin dominance finally loses the trend for good and breaks down hard toward the lower boundary, around the 44 to 40% region. He added that when that happens officially, the XRP price doesn’t just run but enters true price discovery. At the time of writing, the XRP price is trading at around $2.14, down almost 5% in the last 24 hours, according to data from CoinMarketCap. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|altcoin|bitcoin dominance|btc.d|CoinMarketCap|Crypto analyst Bird|Ripple|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56992250,
    "published": 1767915474000,
    "title": "Wall Street, Crypto Leaders Make 'Progress' on Crypto Bill in Private Meeting: Sources",
    "body": "Leaders of a major Wall Street trade group and DeFi-focused crypto leaders are trying to hash out key disagreements before the market structure bill faces a do-or-die Senate vote next week.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56992693,
    "published": 1767916800000,
    "title": "Bitcoin Remains In A High-Risk Zone As Short-Term Holders Stay Underwater",
    "body": "Bitcoin is struggling to maintain the $90,000 level after a sharp rejection from the $94,000 resistance zone, keeping market sentiment sharply divided. While some analysts argue that BTC is entering a deeper corrective phase, others believe the pullback is a necessary reset before a renewed upside attempt. The current price action reflects this uncertainty, with volatility rising as buyers and sellers battle for short-term control. Related Reading: Bitcoin Tests Key Resistance While $4.7B In Sell-Side Liquidity Builds According to an analysis shared by Axel Adler, Bitcoin’s short-term risk structure remains fragile. His short-term risk chart places BTC below the Short-Term Holder (STH) Cost Basis, currently estimated near $100,200. Price is also trading beneath all major moving averages, including the 128-day, 200-day, and 365-day SMAs, reinforcing the view that the broader structure is still bearish. At current levels around $91,000, Bitcoin sits in a moderate risk zone, positioned between the STH Cost Basis and the -15% downside boundary. This positioning suggests that recent rebounds should be treated cautiously. Until BTC reclaims the STH Cost Basis, upside moves are more likely to represent technical bounces within a downward trend rather than a confirmed reversal. Conversely, a breakdown below the moderate risk boundary would signal rising downside risk and could accelerate selling pressure. As a result, the $90K–$100K range remains a critical battleground for Bitcoin’s next directional move. STH Losses Continue To Cap Bitcoin’s Upside Adler’s analysis also highlights a second critical framework: the chart tracking Bitcoin’s all-time highs alongside euphoria zones and the Short-Term Holder Market Value to Realized Value (STH MVRV) indicator. This metric measures the ratio between Bitcoin’s current market price and the average realized price of coins held by short-term investors, offering a direct view into the profitability—and behavior—of this highly reactive cohort. At present, STH MVRV sits near 0.92, well below its historical mean of roughly 1.09 and decisively under the neutral level of 1.0. In practical terms, this implies that the average short-term holder is holding an unrealized loss of about 8%. Historically, periods where STH MVRV remains below 1.0 have tended to coincide with either capitulation phases or extended consolidation ranges, rather than sustained bullish expansions. The last clear euphoria zone on this chart appeared during the all-time high update in October 2025, underscoring how far current conditions are from a speculative extreme. As long as STH MVRV remains below breakeven, short-term holders are incentivized to sell into rallies as the price approaches their cost basis. This behavior creates persistent overhead supply and reinforces structural resistance near the STH Cost Basis, close to the $100,000 level. Consequently, reclaiming that zone is not just a psychological milestone but a necessary condition for any meaningful regime shift back to a bullish market structure. Related Reading: XRP Sees Back-to-Back Liquidation Waves: Binance Absorbs Majority Of Liquidations Bitcoin Price Recovery Lacks Confirmation Bitcoin’s price action on the daily chart reflects a market still trapped in a fragile recovery attempt after a sharp rejection from higher levels. Following the failed breakout above the $94,000–$95,000 area, BTC experienced a decisive sell-off that pushed the price back toward the $85,000 zone, where buyers stepped in aggressively. This reaction marked a short-term bottom, but the subsequent rebound has so far lacked structural strength. At present, Bitcoin is trading near the $90,000–$91,000 region, a former support that has now turned into a key pivot. Price remains below the 200-day and 365-day moving averages, both of which are sloping downward and acting as dynamic resistance. The 128-day moving average has also capped recent upside attempts, reinforcing the idea that the broader trend remains corrective rather than impulsively bullish. Related Reading: Bitcoin Enters Accumulation Regime: Market Supported By Seller Exhaustion, Not Buying Surge From a structure standpoint, the chart shows a sequence of lower highs since the October peak, suggesting that sellers continue to control the macro trend. Volume expanded notably during the November–December sell-off, while the current bounce is unfolding on comparatively lighter participation. This divergence implies that the move higher may be more short-covering driven than supported by strong spot demand. Unless Bitcoin can reclaim and hold above the $94,000–$95,000 resistance zone with increasing volume, the risk of another rejection remains elevated. Failure to do so could reopen the path toward the $85,000 support, where the market would once again be forced to prove its underlying strength. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|Bitcoin news|bitcoin price|Bitcoin short-term holders|Bitcoin STH cost basis|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56995082,
    "published": 1767922406000,
    "title": "Coinbase lands 2nd ‘buy’ rating in a week, with BofA seeing 38% upside",
    "body": "Bank of America has upgraded Coinbase's rating on reversing short interest and tax-loss harvesting, while the exchange is broadening its vision to put the financial system onchain.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56994953,
    "published": 1767922247000,
    "title": "Revived NY bill targets sports, politics and death prediction markets",
    "body": "New York lawmakers will soon review a bill that seeks to ban certain sports and political event contracts in the state, among others.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 56995675,
    "published": 1767924028000,
    "title": "Iran’s Internet Traffic Drops to 'Near Zero' as Protests Intensify",
    "body": "Cloudflare data shows a near-total blackout as demonstrations calling for regime change spread and authorities tighten control.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      }
    ]
  },
  {
    "id": 56995650,
    "published": 1767924012000,
    "title": "Cardano Nears End Of 2020-Style Correction: Is $5 To $10 Next?",
    "body": "Cardano (ADA) may be nearing the end of a multi-month corrective phase that closely resembles its 2020 setup, according to a new technical analysis video posted Wednesday by crypto analyst Quantum Ascend. The analyst argues that a similar “lower trendline reset” preceded ADA’s prior breakout cycle, and that several weekly indicators are now starting to turn. Cardano’s 2020 Fractal Is Back In a Jan. 7 video shared on X, Quantum Ascend said he is looking at ADA’s weekly chart through a macro, multi-leg corrective framework. “On a macro count for ADA, you’re looking at an A, B, C, D, and right now waiting on an E,” he said, framing the current market structure as the late stage of a broader consolidation rather than a fresh downtrend. That “E” leg matters in their model because it effectively marks the final phase of a wedge-like compression. Quantum Ascend pointed to an upper trendline, Fibonacci levels, and prior work published in a mid-December video to justify upside targets once the structure completes. “Essentially you have upper trendline, you have some Fib stuff in play, I have a conservative of five bucks, primary up there at $10,” he said. “And then after that, I think it gets ugly for crypto for a little while, so still a believer that alt season is ahead of us.” Related Reading: Is Cardano Entering a New Phase? Technical Strength, ETF Watch, and Ecosystem Direction Align The core of the argument, however, wasn’t the targets themselves, it was the claimed resemblance to an earlier Cardano correction. Quantum Ascend overlaid a historical “fractal” to highlight comparable price behavior: a move up to a similar level, a pullback, another push into resistance, and then a wick that tagged roughly the same area on the overlay. “This correction right here that I just took this from, look at how similar it is to that correction that we just had,” he said. “Obviously it’s not perfect, but if you tried to get it close from a price structure standpoint… look where that wick on 10.10 went, exactly right there.” In the analyst’s telling, that prior pattern was the market’s way of forcing ADA down to establish a lower trendline before the next expansion. “So this is the same exact move that Cardano had to come down to set the lower trendline,” he said. “So right now setting the lower trendline, before it went on a blast off.” He then referenced the scale of Cardano’s last major run as a reminder of what altcoin cycles have historically looked like when momentum turns. “And how far did it end up running? Well, it ended up going 170X from that point in time, from a penny all the way up to $3,” Quantum Ascend said, using that move as context for why double-digit targets don’t automatically fall into the “impossible” bucket during late-cycle expansions. Related Reading: Cardano Founder Addresses ADA Dump Rumors, Is He Behind The 80% Price Crash? The more immediate claim is that the upside implied by a $10 target is not unprecedented in percentage terms compared with prior alt cycles. “When you’re looking at how far that $10 mark is from where we’re at right now, I mean 22X, right? 25X,” he said. “What was this alt season back here? This alt season was just 2021… That was a 21X… So it’s not unreasonable to be looking for 24X there. And then even on the conservative side, more of a 12X.” On indicators, Quantum Ascend highlighted early signs of a weekly momentum shift rather than a confirmed breakout. “You have a completed ABC. This thing’s ready to turn back around,” he said, adding that broader market conditions looked supportive of a bounce. The analyst also pointed to the weekly RSI beginning to lift after an extended period near lows. “Look at the RSI here on the weekly, finally starting to curl up off the floor. We’ve been down on the floor since October 27th that week, finally getting a little juice.” The analyst described negative momentum as “been decreasing,” and referenced an “ABC” structure on MACD as another piece of the same turning narrative. “A lot of these major moves happen when the weekly RSI goes from low to high,” Quantum Ascend said, arguing that higher timeframes can be slower but more reliable when they finally rotate. Quantum Ascend closed by saying he remains constructive on the project even without a current position. “I am a big believer in this project. I don’t hold any right now. It’s just the way that my portfolio has worked out,” he said. “But I do believe that there’s going to be some massive upside coming to Cardano.” At press time, ADA traded at $0.3925. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cardano|ADA|ADA news|ADA price|Cardano news|Cardano price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56996082,
    "published": 1767924935000,
    "title": "Bitcoin to hit $2.9M by 2050 as it muscles into global trade: VanEck",
    "body": "VanEck analysts said Bitcoin could handle 5–10% of global trade and make up 2.5% of central bank reserves by 2050, driving its strategic role as a monetary hedge.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56996364,
    "published": 1767925547000,
    "title": "Global sanctions fuel record flow to illicit crypto addresses",
    "body": "The Global Sanctions Inflation Index estimated there were just under 80,000 total sanctioned entities and persons globally as of May 2025.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56997125,
    "published": 1767927341000,
    "title": "Optimism floats OP buyback proposal using Superchain revenue",
    "body": "A new plan would tie OP token value to network performance by using half of all Superchain fee revenue for systematic repurchases.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 92,
        "NAME": "OP",
        "CATEGORY": "OP"
      }
    ]
  },
  {
    "id": 56998724,
    "published": 1767931240000,
    "title": "$460M Crypto Longs Squeezed As Bitcoin Slips Below $90,000",
    "body": "Data shows the crypto derivatives market has faced a fresh wave of liquidations as Bitcoin and other assets have gone through a retrace. Crypto Market Has Seen Liquidations Of More Than $462 Million According to data from CoinGlass, a notable amount of liquidations have occurred in the crypto derivatives market over the past day. “Liquidation” refers to the forceful closure that any open contract undergoes after it has amassed losses of a certain percentage specified by the platform. Related Reading: CryptoQuant CEO Expects Boring Bitcoin Action, Not Major Crash A mass amount of simultaneous liquidations can occur when the asset’s price observes a sharp price swing, not allowing investors the time to close their positions. The risk of this happening can increase depending on how much leverage traders are opting for. The trigger for the derivatives flush in the past day has been a downward move across tokens in the digital asset sector, which took Bitcoin to a low under $89,600. Below is a table that shows the numbers involved in this liquidation event. In total, the crypto market has witnessed over $462 million in liquidations during the last 24 hours, with longs dominating most of the flush. More specifically, bullish bets made up for $418 million of the positions involved, representing more than 90% of the total. The large amount of liquidations could indicate that the recovery in Bitcoin above $94,000 lured traders into opening fresh longs, which then ended up getting caught out by the price plunge. In terms of the symbols, the largest contributor to the liquidation event has been BTC with $132 million in positions involved, while Ethereum hasn’t been too far behind with a flush of $116 million. Interestingly, while the top two have been predictable, the third place hasn’t been occupied by the usual suspects this time. As the above heatmap displays, contracts related to Zcash (ZEC) have been caught up in liquidations of $24 million. The asset managing higher liquidations than the likes of XRP and Solana could be down to the fact that it has seen a notably sharper drop over the last 24 hours. Related Reading: Bitcoin Bounce A Bull Trap? Analyst Sees 2022-Style Bear Flag The latest liquidation squeeze has come as the futures market has been witnessing a re-expansion of Open Interest, as highlighted by Glassnode in its latest weekly report. The bearish price action between October and November had caused a massive amount of liquidations and forced traders to pull back on risk, resulting in the Open Interest taking a significant hit. Recently, the metric has seen a turnaround, implying investors have gradually been building up positions again. BTC Price At the time of writing, Bitcoin is trading around $89,500, down 2% over the past day. Featured image from Dall-E, Glassnode.com, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin derivatives|bitcoin liquidations|btc|BTCUSDT|crypto liquidations",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56998384,
    "published": 1767930407000,
    "title": "US Bitcoin ETFs Clock Three-Day Outflow Streak as Risk Appetite Cools",
    "body": "Tactical de-risking and declining investor sentiment are the reasons behind the recent spot U.S. ETF outflows, Decrypt was told.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56998973,
    "published": 1767931574000,
    "title": "Bitcoin is now 56.7% green: Here’s how it could get even cleaner",
    "body": "Bitcoin mining is accelerating renewable energy deployment, replacing fossil-fuel heating, expanding energy access and cutting methane emissions at scale.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57000246,
    "published": 1767934845000,
    "title": "Dogecoin Prepares For Major Recovery As Bullish Momentum Builds – Here’s The Target",
    "body": "Dogecoin (DOGE) is attempting to hold a crucial area as support after recording a 3.2% drop in the daily timeframe. Despite this, an analyst suggests that the leading memecoin is preparing to reclaim a key resistance level lost during the Q4 2025 pullbacks. Related Reading: XRP Named The ‘New Cryptocurrency Darling’ After Strong Start Of The Year Dogecoin Q1 Momentum Builds Dogecoin has seen a remarkable start to the year, recording a 21% jump from its yearly opening price of $0.117. Amid the recent market recovery, the cryptocurrency reclaimed a crucial price area and hit an eight-week high of $0.156 this Tuesday. Notably, the largest memecoin by market capitalization had retraced more than 50% from its Q2 2025 highs and was in a downtrend until last week’s price breakout. Amid this performance, market observer Trader Tardigrade highlighted a pair of Tweezer candlesticks on the monthly chart, which could suggest a bullish reversal is taking place. DOGE “has nearly recovered last month’s losses in just 8 days,” he explained, which signals that “clearly, bullish momentum is building up.” Notably, the analyst recently noted that DOGE has broken out of a bullish pattern, “showing strong upward momentum.” According to the chart, the cryptocurrency displayed a three-month falling wedge in the three-day chart. Following the recent price surge, Dogecoin was able to breach the pattern’s upper boundary, signaling an initial jump to the $0.140-$0.150 area. The trader highlighted that the memecoin displayed a similar performance during his 2024 rally, moving within a multi-month falling wedge before breaking out and kicking off a remarkable performance. If DOGE repeats its previous performance, the price could retrace briefly to retest the breakout area as support before the next major surge, the market watcher added. He also pointed out that after breaking out of the daily trendline, the cryptocurrency appears to be forming a bullish pennant in the one-day chart. A breakout from this pattern would lead to a 40% move toward the $0.20 area, lost during the early Q4 pullbacks. However, DOGE’s price needs to close the day above the $0.142 area to hold the formation. DOGE’s Rally In Danger? Despite the bullish outlooks, analyst Ali Martinez affirmed that Dogecoin is “hanging by a thread.” In a Thursday post, the market watcher emphasized that the cryptocurrency is trading within a crucial support zone between the local lows of $0.118 and the recent highs. If the memecoin’s momentum doesn’t hold and the price loses this key zone, it could risk a more than 40% retrace. According to the UTXO Realized Price Distribution (URPD) metric cited by Martinez, the next major support is around $0.073, where over 28 billion DOGE tokens were previously exchanged. Related Reading: Bitcoin At A Crossroads: $93,500 Reclaim Holds The Key For Next Move The analyst has recently pointed out that cryptocurrency’s price is seemingly on track to retest the $0.08 level after breaking out of a multi-year ascending channel. The chart shows that Dogecoin traded within an ascending channel on the three-day chart since 2023. However, the late 2025 corrections saw the memecoin lose the lower boundary of the ascending channel, potentially painting a concerning picture for its price if long-term bearish momentum continues. As of this writing, Dogecoin is trading at $0.142, a 14.55 increase in the weekly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto analyst|crypto market correction|Crypto Market Recovery|Crypto trader|doge|DOGE prediction|Doge price|Dogecoin|Dogecoin Ascending Channel|Dogecoin breakout|dogeusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57000673,
    "published": 1767935684000,
    "title": "Masked Gunmen Tie Up Woman in France, Steal Crypto USB",
    "body": "France is becoming a European hotspot for crypto wrench attacks, with over 14 crypto-related attacks documented last year.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57000696,
    "published": 1767935377000,
    "title": "Truebit token crashes 99.9% after hacker drains $26.6 million in ether",
    "body": "The attack exploited a flaw in an older smart contract, allowing the attacker to buy TRU at no cost and sell it back to extract ether.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|blockchain contracts|Hack|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 57000468,
    "published": 1767935339000,
    "title": "Solana (SOL) Picks Up Speed, Raising Talk of a New Upside Run",
    "body": "Solana started a fresh increase above the $136 zone. SOL price is now consolidating above $138 and might aim for more gains above the $142 zone. SOL price started a fresh upward move above the $136 and $138 levels against the US Dollar. The price is now trading above $138 and the 100-hourly simple moving average. There was a break above a bearish trend line with resistance at $137 on the hourly chart of the SOL/USD pair (data source from Kraken). The pair could extend gains if it clears the $142 resistance zone. Solana Price Regains Traction Solana price corrected gains from the $144 zone but remained stable above the $130 zone, beating Bitcoin and Ethereum . SOL formed a low near $132 and started a fresh upward move. The price climbed above the $135 level to enter a short-term positive zone. It surpassed the 50% Fib retracement level of the downward move from the $143 swing high to the $132 low. Besides, there was a break above a bearish trend line with resistance at $137 on the hourly chart of the SOL/USD pair. Solana is now trading above $138 and the 100-hourly simple moving average. On the upside, the price is facing resistance near $140 and the 76.4% Fib retracement level of the downward move from the $143 swing high to the $132 low. The next major resistance is near the $142 level. The main resistance could be $145. A successful close above the $145 resistance zone could set the pace for another steady increase. The next key resistance is $150. Any more gains might send the price toward the $155 level. Another Decline In SOL? If SOL fails to rise above the $140 resistance, it could start another decline. Initial support on the downside is near the $138 zone. The first major support is near the $135 level. A break below the $135 level might send the price toward the $132 support zone. If there is a close below the $132 support, the price could decline toward the $124 support in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is gaining pace in the bullish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is above the 50 level. Major Support Levels – $138 and $135. Major Resistance Levels – $140 and $142.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Technical analysis|Sol|Solana|solbtc|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57001268,
    "published": 1767936576000,
    "title": "Builders behind popular Zcash wallet Zashi to launch new startup 'cashZ'",
    "body": "The Zcash protocol remains unaffected despite the governance clash and restructuring with Bootstrap.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Zcash|ZEC|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      }
    ]
  },
  {
    "id": 57001591,
    "published": 1767938150000,
    "title": "Australian Regulator Flags Grok in Rising AI Image Abuse Complaints",
    "body": "Reports of non-consensual AI-generated sexual images doubled since late 2025, with some involving children, the Commissioner said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57001750,
    "published": 1767938602000,
    "title": "Crypto market crash in October marked end of ‘easy yield’ era: BitMEX",
    "body": "BitMEX says the era of easy money via arbitrage trades likely died in the October crash, as a liquidation spiral left many market makers naked.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57002584,
    "published": 1767941539000,
    "title": "Bitcoin ETF optimism fades as three-day outflows streak erases early-month gains",
    "body": "Bitcoin ETFs have registered a net outflow of over $1 billion in three days.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin ETF|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57004773,
    "published": 1767946532000,
    "title": "Bitcoin Indicator With 84% Hit Rate Flashes Again: Is A Price Rally Next?",
    "body": "The Bitcoin hash ribbons indicator has recently flipped back to a buy signal on the weekly timeframe, according to a Jan. 8 video analysis from crypto analyst Kevin (@Kev Capital TA). The setup matters, he argued, because the model has historically been associated with higher prices after corrective periods, even if its record is no longer spotless. In the video, Kev Capital walked viewers through the weekly Bitcoin chart with the hash ribbons overlay, describing it as one of the higher “hit rate” signals in crypto’s technical playbook. “There have been 19 buy signals on the weekly time frame throughout all of Bitcoin’s history and it has an 84% hit rate of playing out,” he said, adding that such consistency is rare for any single indicator. Hash ribbons attempt to infer miner stress and recovery by comparing short- and longer-term moving averages of network hash rate. Kev Capital framed it less as a simple “buy/sell” tool and more as a proxy for network health, where miner behavior can precede shifts in market structure. “It’s not just a buy and sell indicator. It’s tracking mining hash rate,” he said. “And what that basically means is it’s tracking the overall power and network health on the Bitcoin blockchain.” Related Reading: Bitcoin Fear & Greed Index Nears Neutral As Price Recovers The mechanics, as he explained them, hinge on the 30-day moving average of hash rate (his chart showed this as a green line) versus the 60-day moving average (a gray line). When the 30-day crosses below the 60-day, the model labels it capitulation, which he described as aligning with bearish price action and a weaker network backdrop. When the 30-day crosses back above the 60-day, the indicator prints a buy signal (shown as blue dots on his chart), which he interprets as miners “rebounding” after weaker operators have been forced out. “Anytime that 30-day crosses below the 60, it marks a capitulation phase, which shows that there’s been bearish price action in a weaker network,” Kev Capital said. “Now, when it crosses back above is when you get the blue dots, and that is a buy signal. That’s when the 30-day moving average of hash rate crosses back above the 60-day moving average of hash rate.” Bitcoin Hash Ribbons Buy Signal Returns The near-term catalyst for his update was a fresh signal sequence around the end of December. Kev Capital said the hash ribbons flashed capitulation in the second-to-last week of December, followed by a buy signal in the last week of December. He noted the indicator was again “flashing a capitulation signal” during the current week, not yet confirmed which could set up another buy signal if the moving averages continue to “mingle” and then resolve higher. Related Reading: Why Morgan Stanley’s Bitcoin ETF Is The ‘Most Bullish Thing Ever’: Jeff Park He also spent time qualifying the model’s reputation. While he cited an 84% historical hit rate for the weekly buy signals, he said that earlier in the current cycle the indicator printed two buy signals: in May and July that did not deliver the kind of follow-through that has defined prior successful instances. “We did go up from the original buy signal, but it really wasn’t a lot,” he said, contrasting that with prior hash ribbons episodes that “typically produce a 30 to 100% move.” In his telling, those underwhelming outcomes were enough to break what he described as a prior “100% hit rate” framing. https://t.co/vfZFXTAN77 #BTC Weekly Hash Ribbons buy signal and what it means. #Crypto #Altcoins — Kevin (@Kev_Capital_TA) January 8, 2026 Still, Kev Capital argues the context is now different because the latest signal comes after a drawdown. He referenced a 36% decline in Bitcoin during the recent corrective period and suggested the early signs of miner recovery, reflected in the moving averages stabilizing and attempting to turn up, are the conditions where the indicator has historically performed best. However, he cautioned that timing is variable, saying the setup can take “two to four to six weeks” to play out, or move sooner. At press time, Bitcoin traded at $91,009. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin hash ribbons|Bitcoin news|bitcoin price|btc|BTC news|btc price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57005796,
    "published": 1767948596000,
    "title": "South Korea’s top court says exchange‑held Bitcoin can be seized",
    "body": "The ruling confirms that Bitcoin in Korean exchange accounts is an “object of seizure” under criminal law, aligning Seoul with US and EU enforcement practices.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57005816,
    "published": 1767948281000,
    "title": "A ruble stablecoin outpaced market leaders last year despite international sanctions",
    "body": "A7A5, a ruble-linked stablecoin few outside Russia had heard of a year ago grew the most of any stablecoin, outpacing both USDT and USDC over the past 12 months.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Russia|ruble|Stablecoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]