[
  {
    "id": 57254092,
    "published": 1768684586000,
    "title": "Coinbase refutes rumors of White House's threat to pull support for crypto bill",
    "body": "\"The White House has been super constructive here,\" said CEO Brian Armstrong.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Top Stories|Coinbase|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57257115,
    "published": 1768694412000,
    "title": "Ethereum Maintains Structural Strength Despite Resistance Near $3,400",
    "body": "Ethereum continues to show resilience, holding its ground above key support levels even as price faces firm resistance near the $3,400 zone. The ability to sustain strength after recent gains highlights improving market structure, suggesting that buyers remain in control. As long as ETH stays supported above its critical trend levels, the broader upside narrative remains intact despite near-term hesitation. Daily Bull Market Support Band Holds As Key Reversal Zone Luca, in a recent ETH update shared on X, pointed out that Ethereum’s market structure has strengthened considerably over the past several days. The price has been able to hold above the 1D Bull Market Support Band, a level that has acted as a reliable reversal zone multiple times over the last couple of months. This sustained hold suggests improving market confidence and a reduction in immediate downside risk. Related Reading: Ethereum Price Pushes Toward Breakout Levels, Bulls Smell Opportunity Alongside this structural improvement, ETH successfully reclaimed the 0.618 Fibonacci point of interest around the $3,100 region. This level is often viewed as a critical threshold in corrective phases, and holding above it typically signals that buyers are gaining the upper hand. Despite the positive developments, Ethereum has not moved higher without hesitation. ETH’s price recently faced rejection near the 0.5 Fibonacci level around $3,400, an outcome Luca noted was largely expected. Historically, this area has acted as a significant decision point, often attracting selling pressure and temporary pullbacks before the market decides on its next direction. Looking forward, Luca believes the overall outlook remains constructive as long as ETH continues to trade above the 1D Bull Market Support Band and the 0.618 Fibonacci level. Maintaining these supports would keep the path open for renewed upside attempts, even if short-term consolidations occur, and the analyst’s positioning remains unchanged. ETH Above Daily 200MA, Structure Remains Constructive According to a recent post by Daan Crypto Trades, Ethereum is still advancing gradually while respecting the Daily 200-day moving average against Bitcoin. This type of slow, methodical grind often signals strength beneath the surface, suggesting that buyers remain in control even without aggressive momentum. Related Reading: Ethereum’s Q1 Outlook: Analyst Shares Historical Setup As Price Nears Key Resistance The analyst explained that prolonged consolidations and steady climbs like this typically resolve with an acceleration phase. Should ETH break out with stronger upside momentum, it could serve as a trigger for renewed interest across the altcoin market, helping lift sentiment and price action. However, the structure remains conditional. Holding the Daily 200MA, highlighted in purple, is critical to maintaining this constructive setup. In parallel, Bitcoin must stay above the $94,000 level to maintain the broader low-timeframe bullish structure. As long as these conditions are met, the path of least resistance continues to favor further upside. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|1D Bull Market Support Band|200ma|bitcoin|Daan Crypto Trades|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|ethusd|ETHUSDT|Fibonacci Point of Interest|Luca",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57259058,
    "published": 1768699842000,
    "title": "Analyst Reveals How Far Bitcoin Price Will Crash If The Uptrend Doesn’t Continue",
    "body": "A warning signal is flashing on the charts, with market analysts predicting that the Bitcoin price could collapse again soon. According to technical analysis, if BTC fails to continue its uptrend, it could repeat the bear-market crash from past cycles, potentially dragging its price down by double-digit percentages. Bitcoin Price To Repeat 2022 Bear Market Crash? Crypto analyst Tyrex believes that Bitcoin may be approaching a critical turning point if the current uptrend fails to hold. In his latest BTC price outlook on X, he compares the current market structure to the April 2022 cycle, when Bitcoin made an ATH and then crashed hard for weeks. Related Reading: Ethereum On Fire: User Growth Sparks Massive Activity Spike Tyrex disclosed that Bitcoin dropped roughly 45% from its all-time high in 2022 before entering an extended consolidation phase that lasted nearly four months. The accompanying chart shows that during that period, prices respected clear horizontal boundaries, creating a false sense of strength and stability, all while underlying weakness continued to build. That consolidation eventually led to an upside fakeout, with the Bitcoin price briefly breaking resistance before reversing sharply. Unfortunately, the rejection triggered a continuation of the broader downtrend that year, resulting in another aggressive price crash that wiped out remaining bullish confidence. According to Tyrex, BTC’s current chart structure closely mirrors the same historical setup from 2022. Bitcoin has once again pulled back sharply after reaching an all-time high of over $126,000. Additionally, the cryptocurrency has spent roughly two months consolidating within a defined range, repeatedly stalling at resistance levels. Tyrex warns that Bitcoin is barely holding above $95,000, which aligns with the resistance zone shown on the chart. If price fails to recover and continues to stall near this level, the move higher could turn out to be a fakeout, potentially leading to another sharp dump— just as it did in 2022. The red-shaded area on the chart shows how far BTC could crash if the uptrend breaks, with the analyst projecting an 11.04% drop to the $86,000-$84,000 range. Bitcoin Set For March ATH And May Flash Crash Another forecast from market expert CryptoXLarge outlines where Bitcoin could be headed over the next four months. The analyst bases the outlook on historical market behavior, suggesting the current cycle may be replicating past cycle peaks. CryptoXLarge points to January 2026 as a phase of quiet accumulation with controlled price action and muted volatility. February is expected to bring a powerful rally as momentum builds rapidly and buyers push the BTC price higher. This surge could set the stage for Bitcoin to reach a new all-time high around $240,000 in March. Related Reading: Ethereum Staking Hits Record Levels As Buterin Urges Builders To Deliver Real Apps After this projected peak, April will likely be a bull trap where the price appears strong but fails to sustain upward momentum. The forecast concludes with a warning of a flash crash in May 2026, during which prices could pull back to fresh lows. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|altcoins|bitcoin|Bitcoin news|bitcoin price|crypto market|crypto news|cryptocurrency",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57261044,
    "published": 1768712415000,
    "title": "Crypto industry turns against US bill it had pushed to regulate digital assets",
    "body": "Lobbyists want to see legislation passed while Republicans still have control of Congress",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57260790,
    "published": 1768711787000,
    "title": "Ethereum validator exit queue falls to zero as staking demand soars",
    "body": "The massive staking inflows are strengthening ETH’s supply-demand dynamic, potentially setting the stage for upward price momentum this year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57267099,
    "published": 1768728312000,
    "title": "80% of hacked crypto projects never ‘fully recover,’ expert warns",
    "body": "Security failures don’t just drain funds, they often destroy trust, leaving most hacked crypto projects unable to recover despite fixing the technical flaws.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 57268511,
    "published": 1768726841000,
    "title": "Bitcoin Records Large Exchange Inflows As Price Climbs — What Next For BTC?",
    "body": "Bitcoin recently failed to overcome the $97,000 resistance following its price surge seen in mid-January. At the moment, the leading cryptocurrency has taken on a state of inertia, with no significant movement in either direction seen. However, an investigation of on-chain dynamics has recently revealed that trouble might be looming for the flagship cryptocurrency. Related Reading: Bitcoin Holds Key Support As Weekend Liquidity Sets In — $98,200 And $107,500 In Focus Sudden Inflows: Caution Or Opportunity? In a QuickTake post on CryptoQuant, key opinion leader CryptoZeno shares a potentially foreboding observation on Bitcoin’s market dynamics, saying the premier cryptocurrency could be facing a risk of distribution in the near-term. This conjecture is based on the Bitcoin: Exchange Inflow (Total) – All Exchanges metric, which serves the basic function of tracking the total amount of BTC transferred into centralized exchanges over a certain period. CryptoZeno highlights in the post that exchange inflows have seen sharp surges through Bitcoin’s most-recent trading sessions, which represent one of the most significant spikes seen in the month of January. Typically, large inflows of BTC into exchanges act as a telltale sign that investors are preparing to distribute their holdings. This is contrary to any inclination towards long-term holding. Interestingly, the sign of distribution-readiness is more typical if the event were to occur just after a strong advance of the BTC price. Also citing historical occurrences, CryptoZeno explains that such behavior, where BTC holders increasingly send their tokens to exchanges, suggests that investors are venturing out of Bitcoin and to more “liquid venues.” Expectedly, such a massive dispersal of their holdings would translate into price as increased sell-side pressure, especially in the short-term. Notably, the analyst makes it clear that inflows alone do not tell a sure story of an immediate reversal. More accurately, spikes in exchange inflows often come before heightened volatility periods or corrective price action. Related Reading: Are XRP ETFs About To Act Like Banks? Expert Thinks So Analyst Highlights Mid- To Large-Size Bands As Main BTC ‘Movers’ CryptoZeno provides more context by merging the Spent Output Value Bands with the Exchange Inflow metric. This shows which investor cohort was more involved in creating the distribution signal seen. On inspection of the blended metric, it becomes apparent that the spike in exchange inflows was largely induced by mid-to-large size bands (10-100 BTC, and 100-1,000BTC). These size bands, according to the crypto expert, are associated with whales, long-term investors who are repositioning, or even ETFs. These investor classes do not merely act without strategic reasons. As a result, their activity is usually more important compared to retail activity. A simultaneous increment to exchange inflows, alongside large investor distribution, is another sign that the Bitcoin market is on the brink of a fragile phase. In the event that inflows remain high as price struggles to reclaim past highs, the world’s leading cryptocurrency could be entering a phase of trouble, as it would suggest the predominance of supply over demand. As of this writing, Bitcoin is worth $95,250, recording almost no growth since the past day. Featured image from Flickr, chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin Exchange Inflows|Bitcoin large holders|Bitcoin whales|btcusd|BTCUSDT|cryptoquant",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57269112,
    "published": 1768734034000,
    "title": "SUI Price Breakout Next? Analyst Sets $2.3 Short-Term Target",
    "body": "The SUI price struggled to replicate its early-year momentum over the past week despite the general market seeing renewed optimism. The altcoin’s price mostly moved sideways, oscillating between the $1.70 – $1.90 levels. According to a popular analyst on the social media platform X, this slight inactivity might be a bullish signal of what is to come over the next few weeks. Is SUI On The Verge Of A 30% Surge? In a January 18 post on the X platform, crypto analyst Ali Martinez shared an interesting chart setup for the SUI price. According to the market pundit, a break out of the current chart setup could see the altcoin reach the $2.29 level over the coming weeks. Related Reading: Dogecoin RSI Just Entered Historical Oversold Levels Again, Will It Repeat 2021? The rationale behind this positive prediction is the formation of a bull flag pattern on the 4-hour timeframe of the Bitcoin price chart. The bull flag is a technical analysis pattern characterized by a period of steep upward movement (the flagpole) typically followed by sideways or slightly downward price action. Typically, the bull flag functions as a prevailing continuation pattern for an existing upward trend, suggesting a potential move to a higher price point. While this chart is often a bullish signal, it is crucial to wait for a successful breach of the upper boundary of the consolidation range; this increases the odds that the price will continue in its upward trajectory. As shown in the chart above, the price level that needs to be broken to confirm the uptrend continuation lies around the $1.84 mark. Meanwhile, the target for this chart pattern is usually calculated by adding the vertical height of the flagpole to the potential breakout point from the flag. According to Martinez, a sustained break above this level could see the SUI price run up to as $2.29, representing an almost 30% surge from the current price point. SUI Price Overview As of this writing, the price of SUI stands at around $1.78, reflecting a mere 0.9% dip in the past 24 hours. This tame daily action highlights the indecisiveness currently affecting this altcoin market, as the SUI bulls and bears battled for dominance over the past week. According to CoinGecko data, the altcoin’s value is down by 1.7% in the last seven days. However, this past week’s struggles have not been enough to wipe out SUI’s recent success, especially on broader timeframes. For instance, the altcoin’s value has increased by more than 28% on the monthly timeframe. With this positive performance, the token has maintained a position within the top 30 largest cryptocurrencies by market cap. Related Reading: XRP Wave C Push On The Way: What Could Send Price Below $2? Featured image from iStock, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "SUI|altcoin|bull flag|crypto news|SUI price|SUIUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 96,
        "NAME": "SUI",
        "CATEGORY": "SUI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57269214,
    "published": 1768734000000,
    "title": "Crypto’s decentralization promise breaks at interoperability",
    "body": "Crypto’s interoperability layer reveals a gap between the industry’s decentralization narrative and how value actually moves across blockchains.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57271778,
    "published": 1768741239000,
    "title": "What’s Driving The $1.42 Billion Comeback In Spot Bitcoin ETFs?",
    "body": "Fresh money poured back into US spot Bitcoin ETFs this week, giving the market a clear jolt after a quiet month. The inflows totaled about $1.42 billion, the biggest weekly pickup since early October. That rush pushed prices higher for a time and pulled a lot of attention back to these regulated funds. Related Reading: Saylor Defends Bitcoin Treasury Firms Amid Rising Criticism Institutional Demand Comes Back Reports say big, familiar investors are rejoining these funds. Managers with large pools of capital are using ETFs to get Bitcoin exposure in a way that fits standard rules and reporting. Some of the buying came through a tight set of funds that have wide reach with big clients. The move is being read as a return of steady, long-term money rather than quick speculative bets. Reports from the Bitcoin macro newsletter Ecoinometrics note that recent jumps in spot Bitcoin ETF inflows usually lead to brief price gains, which often disappear when the inflows ease. Based on data from SoSoValue, spot Bitcoin ETFs saw their biggest inflows midweek, with Wednesday bringing in more than $840 million in a single day and Tuesday following with roughly $754 million. Bitcoin doesn’t need a few good days. It needs a few good weeks. We’ve seen this pattern repeatedly: a short burst of ETF inflows, a quick price bounce, and then momentum fades. That tells us demand still exists, but it’s not persistent enough to change the trend. The chart… pic.twitter.com/6mkv7ye9fW — ecoinometrics (@ecoinometrics) January 16, 2026 BlackRock’s IBIT Tops Flows BlackRock’s iShares Bitcoin Trust drew the largest share of the gains. On several days it led all spot ETF flows, with one report showing IBIT accounted for roughly $1.03 billion of the weekly total. A single day during the run saw IBIT pull in amounts measured in the hundreds of millions, underlining how dominant the fund has become in the US market. When big, regulated vehicles buy a lot of Bitcoin, the effect is not just on paper. These ETFs must either create new shares by buying coins or choose to source supply elsewhere. That process removes coins from the pool available to regular traders. At the same time, some data show that large holders eased off selling in recent days, which tightened the coins ready to trade even more. The mix of fresh demand and less selling can lift price quickly. Short Gains, Or The Start Of Something Longer? Some market watchers point out that a single week of big inflows is only part of the picture. Patterns matter. If monthly flows stay strong, then the story is clearer. If the money fades, prices can fall back just as fast. Still, the sudden inflow shows that at least a group of big investors prefers regulated ETF exposure right now. That matters for how traditional funds think about Bitcoin in balanced portfolios. Related Reading: Ethereum Staking Hits Record Levels As Buterin Urges Builders To Deliver Real Apps Bitcon Price Action Bitcoin has been hovering around $95,000 this week, moving up and down slightly as buyers and sellers test the market. Reports say the price steadied after a small bounce from recent lows. Some updates show Bitcoin briefly rising above $96,800, shaking out short-term traders. Analysts note the swings reflect mixed sentiment, with the market unsure of the next clear direction. Featured image from Getty Images, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|digital currency|etf",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57271774,
    "published": 1768741200000,
    "title": "Bitcoin to $180,000, stablecoins to soar in 2026, investor Dan Tapiero predicts",
    "body": "From macro tailwinds to trillion-dollar rails, the 50T Funds founder sees real-world adoption reshaping the crypto landscape.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57273079,
    "published": 1768744800000,
    "title": "Here's why Coinbase and other companies soured on major crypto bill",
    "body": "Provisions addressing decentralized finance, SEC jurisdiction and authorities and — of course — stablecoin yield all alarmed industry participants.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "News Analysis|Market Structure Legislation|crypto legislation|Senate Banking Committee|Coinbase|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57274430,
    "published": 1768748440000,
    "title": "Bitcoin Long Signal That Preceded 370% Move Is About To Go Off Again — What To Know",
    "body": "Going into the weekend, the price of Bitcoin was unable to sustain the bullish momentum it displayed earlier in the past week. Since Friday, January 16th, the world’s leading cryptocurrency, repudiated by the price resistance above, now trades in a tight consolidatory bracket. Interestingly, this period of silence has been deemed transient, as recent on-chain data suggests an exciting time ahead for the BTC price. Kimchi Premium Flips Positive As Local Demand Sees Buildup In a January 17 post on the X platform, DeFi asset management platform XWIN Finance released an on-chain report, which suggests that Bitcoin might be closer to reaching a turning point than is apparent in its price action. Related Reading: Bitcoin Price To $100K: Why All Eyes Are On The Short-Term Holders This hypothesis is based on the Bitcoin Kimchi Premium indicator. This measures the percentage difference between a cryptocurrency’s price (in this case, Bitcoin) on South Korean exchanges and its price on global exchanges. Simply put, it shows how much more Korean traders are willing to pay for Bitcoin. When the Kimchi Premium transitions steadily from low or negative levels to cross above historically significant levels, this is typically viewed as a long signal from the metric. This interpretation is because a rising Kimchi Premium reflects growing local demand in South Korea, usually often influenced by retail buyers. In essence, Korean buyers are willing to pay more for Bitcoin, hence overwhelming the available supply and consequently pushing prices upwards. In the post on X, XWIN Finance highlighted that this long signal had been sighted on the indicator. History also attests to the bullish significance of this signal; there have been major price moves to the upside following sustained increases in the Kimchi Premium. An example is the last sighting of the long signal in October 2023, where the index rose above a major threshold, as shown in the chart above. The price of Bitcoin witnessed a 370% rally after this signal went off in 2023. According to XWIN Research, this same pattern seems to be playing out again in 2026. Hence, if the Kimchi Premium completes its long-signal formation, it could be a sign that buyers are occupying favourable positions for a bullish ride. If history does repeat itself, the Bitcoin price could be on track to witness another exciting voyage, with the flagship cryptocurrency possibly putting in a more than 300% surge in the next cycle. However, it is worth noting that macro conditions, institutional demand, and derivatives activity would be playing their roles to augment the pattern’s plausibility, as it should not be viewed as a standalone bullish sign. Bitcoin Price At A Glance As of this writing, the price of BTC stands at around $95,280, reflecting no significant change in the past 24 hours. Related Reading: Bitcoin Net Taker Volume Finally Flips Positive — Why This Shift Matters Featured image from iStock, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin kimchi premium|Bitcoin news|bitcoin price|btc|btc price|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57274424,
    "published": 1768748400000,
    "title": "Wall Street integration will power crypto’s next phase, says Fidelity",
    "body": "Infrastructure, institutions and advisors are laying the groundwork for a structural shift in global finance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Fidelity Digital Assets|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57275875,
    "published": 1768752450000,
    "title": "Here is why $1.2 billion Bitcoin ETF inflow is a new bullish signal",
    "body": "Institutions are increasingly betting on bitcoin's bullish moves and moving away from sophisticated 'arbitrage' bets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Bitcoin ETF|Markets|ETFs|market analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57276970,
    "published": 1768755600000,
    "title": "Large bitcoin holders buy the most coins since the FTX collapse of 2022",
    "body": "The so-called Fish-to-Shark cohort added 110,000 BTC over the past 30 days, according to Glassnode.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Glassnode|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57277112,
    "published": 1768755651000,
    "title": "Ethereum Network Activity Explodes, Market Structure Points To Upside Continuation",
    "body": "Ethereum is showing signs of strength on two critical fronts at the same time. On-chain activity has climbed to record levels, reflecting heavier real usage across the network, while long-term technical structure is leaning towards upside continuation. Together, these signals suggest that Ethereum’s current phase may be more than just sideways movement, as underlying data points to sustained demand and constructive price behavior. Related Reading: Saylor Defends Bitcoin Treasury Firms Amid Rising Criticism Ethereum Daily Transactions Reach New High Ethereum’s price action is turning bullish with a steady increase in recent days. Notably, on-chain data shows that this increase is on top of steady on-chain activity in recent days. Data from Ethereum’s on-chain activity shows that daily transactions recently climbed to approximately 2.8 million, setting a new all-time high for the network. Interestingly, this figure stands out not just as a record, but because it is roughly 64% higher than the daily transaction levels observed during the peak of the 2021 bull market. The chart data from Sentora illustrates a progression showing Ethereum’s transaction count rising steadily over the years and spiking up in early 2026. Comparing the transaction activity to 2021 adds more context considering the intense amount of activity that the Ethereum network was witnessing at the time. Back then, Ethereum was at the center of an altcoin season and NFT boom, all of which contributed to a spike in transaction activity and a push to new price highs. The fact that Ethereum is now processing significantly more transactions per day compared to 2021 shows that its network usage has grown above speculative behavior. The steady climb in transaction activity shows the sheer amount of usage across decentralized finance and stablecoin settlement, among many others. Ethereum Daily Transactions Chart. Source: @SentoraHQ On X Ethereum Reaccumulation Within A Macro Uptrend Technical analysis of Ethereum’s market capitalization on the three-week candlestick timeframe shows the cryptocurrency is still trading in a zone of stability. Particularly, technical analysis done by crypto analyst Egrag Crypto suggests that Ethereum is in reaccumulation within a macro uptrend. A look at the 3-week timeframe shows that ETH’s market cap is holding above the 21 EMA, respecting the rising macro trendline, printing higher highs & higher lows, and compressing under historical resistance. That is constructive behavior, not weakness. History shows that periods where Ethereum’s market cap held above the 21 EMA on this timeframe have led to expansion phases, whereas sustained moves below it have marked bear market conditions. Related Reading: What’s Driving The $1.42 Billion Comeback In Spot Bitcoin ETFs? At present, the structure indicates the EMA support is being defended. From a probabilistic standpoint, the current setup leans toward continuation rather than breakdown. A move through the overhead resistance band would likely confirm an expansion phase and allow Ethereum to go on a 70% to 75% bullish continuation. Market Cap ETH. Source: @egragcrypto On X On the other hand, a bearish outcome will become possible if the price action loses the 21 EMA on the three-week chart. This could validate a deeper 25% to 30% correction toward the lower trendline, but this scenario carries a lower probability. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|altcoins|bitcoin|crypto|ETH|Ether|ethereum|ethusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57278820,
    "published": 1768761027000,
    "title": "More XRP Than Cash? “You’re A Genius”, Analyst Says",
    "body": "A sharp comment from a well-known XRP Ledger developer has sparked fresh debate around savings, inflation, and what smart money looks like today. Related Reading: What’s Driving The $1.42 Billion Comeback In Spot Bitcoin ETFs? Bird, the developer behind the XRPL-based meme coin DROP, drew attention after saying that anyone holding more value in XRP than in their bank account is a “genius.” The word choice was bold, and it quickly spread across social media, pulling in both supporters and critics. Genius Or Gamble In An Inflation Era According to Bird, the label has less to do with bragging rights and more to do with awareness. He argues that many people trust banks by default, assuming savings accounts protect their future. The problem, he says, is math. Savings rates around 4–6% often fail to keep pace with rising prices. Groceries, rent, transport, and healthcare keep climbing. Over time, money sitting still can quietly lose strength. In that light, Bird frames holding XRP as a sign of foresight rather than recklessness. If you have more money in $XRP than in your bank account, you’re a genius. — Bird (@Bird_XRPL) January 11, 2026 Risk Still Has A Price XRP prices can swing hard in short periods, something banks are built to avoid. A savings account may feel boring, but it offers stability and fast access when bills arrive or emergencies hit. That difference matters. Long-term holders respond that XRP was never meant to act like a checking account. It is treated as an asset tied to future payment rails and global transfers, not day-to-day spending money. The “genius” remark, they say, speaks to time horizon, not short-term comfort. Utility Gains After Years Of Pressure XRP spent years weighed down by legal uncertainty while its network continued to expand behind the scenes. With parts of that pressure easing, attention has shifted back to usage. Cross-border payments remain a core focus. Stablecoin activity, including RLUSD, has increased. Tokenization of real-world assets is also being explored on the XRP Ledger. Supporters believe this growing use gives XRP value beyond price charts. “ What’s the right amount of $XRP to hold? “ The truth is… it’s completely subjective. We all live in different countries, have different costs, jobs, savings, families, goals. Some people chase money, some chase freedom. Some need security for health, travel, retirement,… https://t.co/A5g5Oa4f7c — Bird (@Bird_XRPL) January 10, 2026 How Much Is Enough Depends On You Bird has also raised a question that keeps coming up online: what amount of XRP is “right.” Reports note he often mentions 10,000 XRP as a rough reference, not a target. His thinking is simple. If XRP ever trades in double digits, that holding turns into a six-figure sum in US dollars. For some people, that could mean freedom. For others, it might only ease pressure. Living costs, family size, health needs, and location all shape what “enough” really means. Related Reading: Saylor Defends Bitcoin Treasury Firms Amid Rising Criticism Calling someone a genius makes for catchy headlines, but real life sits in the middle. Keeping some money in banks helps cover daily needs. Holding assets like XRP is a bet on future systems and long-term growth. Featured image from Gemini, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoin|banks|bitcoin|crypto|Ripple|xrp|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57278603,
    "published": 1768760091000,
    "title": "The CLARITY Act stalling is positive for the crypto industry: Analyst",
    "body": "Overregulation of the crypto industry would negatively impact markets and gut decentralized finance (DeFi), according to Michaël van de Poppe.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57281717,
    "published": 1768769589000,
    "title": "Scaramucci says stablecoin yield prohibition undermines US dollar",
    "body": "The expanded prohibition on stablecoin yield in the CLARITY Act makes the US dollar less competitive than the Digital Yuan, Scaramucci said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  }
]