[
  {
    "id": 57935686,
    "published": 1770829245000,
    "title": "Bitcoin Moves With Tech, Not Precious Metals, Analysts Find",
    "body": "Bitcoin’s image as a steady store of value is being tested. What once was talked about as a hedge against uncertainty now moves more like a high-upside, high-risk bet. Related Reading: Jim Cramer Suggests US Government Could Buy Bitcoin Near $60K Signals Of A Growth Asset According to Grayscale, recent trading patterns show Bitcoin tracking closely with shares of software companies rather than with gold or silver. That change in behavior has been noticeable since early 2024, when institutional flows and exchange-traded products pushed crypto into more mainstream hands. Reports say investors who chase growth — many drawn by the AI story — have been selling software names hard, and Bitcoin has followed some of that pressure. Institutional Links And Market Forces Reports note that deeper ties to traditional markets explain part of this shift. Large firms, ETF mechanics and growing institutional holdings mean movements in stock markets can spill into crypto. There has also been active selling from US-based accounts that left Bitcoin trading at a discount on some platforms. That selling happened after a string of big liquidations late in the year and again in recent weeks, which amplified losses for traders who used leverage. Where Price Stands Now Bitcoin is changing hands around $66,900, with clear resistance near $69,900 and support levels slipping under $66,600. The swings are sharp and intraday moves can be wide, reflecting a mood that is cautious and reactive. From its peak above $126,000 in October, the market has pulled back by roughly 50% in several waves, which shows how quickly sentiment can turn against even the most talked-about crypto. Gold, Geopolitics And Risk Appetite Reports point out that bullion has climbed to fresh highs while Bitcoin has failed to mirror those safe-haven flows. Rising geopolitical friction has driven some money into metals and away from riskier bets, including tech shares and crypto. Traders who expected Bitcoin to act like a fortress against turmoil have found that, for now, it behaves more like an asset whose value rises on hope and falls when fear returns. A return of fresh capital would likely be needed to steady prices. ETF inflows could help, and a renewed wave of retail buyers would too. Research suggests that retail interest is currently focused on AI stories and growth narratives, which leaves crypto out of favor for many individual investors. That concentration of attention matters: capital flows are what lift or sink these markets. Related Reading: After Predicting XRP’s Drop, Analyst Says The Bottom May Be In Bitcoin Tracks Tech, But Long-Term Value Still Intact Grayscale says Bitcoin’s recent moves mirror tech stocks, not gold, but its long-term potential as a store of value remains. Short-term swings reflect market integration and investor activity, while future performance will depend on capital flows and broader economic trends. Featured image from ETF Trends, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|AI|bitcoin|btc|btcusd|digital currency|gold|safe haven asset|Tech|tech stocks",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57935768,
    "published": 1770829199000,
    "title": "Malaysia's central bank announces stablecoin and tokenization sandbox",
    "body": "The pilot programs explore wholesale settlement between institutions and real-world use cases, along with stablecoin development and tokenized bank deposits.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 57935591,
    "published": 1770829040000,
    "title": "Uniswap Token Jumps Following BlackRock Investment as BUIDL Goes DeFi",
    "body": "Uniswap’s governance token jumped after the decentralized exchange’s creators announced an integration with BlackRock's tokenized fund.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "uniswap|DeFi",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 53,
        "NAME": "UNI",
        "CATEGORY": "UNI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57934249,
    "published": 1770825610000,
    "title": "XRP ‘Looks Different’ This Cycle, Targets No. 2 Spot: Crypto Analyst",
    "body": "Crypto Insight UK director Will Taylor argued in a new video that XRP is “trading different” this cycle and said he sees a credible path for it to challenge Ethereum’s long-held No. 2 position, with an outside chance of even pressuring bitcoin if the right mix of narrative and market structure lands. The “XRP Curveball” Theory Taylor anchored his thesis to a comment he highlighted from Mark Yusko, a well-known bitcoin-focused investor, who warned of a potential “curveball” tied to XRP and a future where policymakers clamp down on private stablecoins. Yusko, in Taylor’s telling, speculated that a “CBDC version” could emerge where authorities effectively steer users away from assets like USDT and USDC, a framing Taylor said resonated with what parts of the XRP community have anticipated for years. Mark Yusko says he’s watching for a potential policy curveball, including a future CBDC framework that could restrict private stablecoins like USDT and USDC, while noting $XRP activity may be happening more behind the scenes. 🤯 https://t.co/ba4aqu2dLN pic.twitter.com/bpWBw7lGX2 — Xaif Crypto🇮🇳|🇺🇸 (@Xaif_Crypto) February 9, 2026 “Now, what have I been saying about XRP this cycle? I’ve said that it looks different,” Taylor told viewers. “I’ve said that I think it will challenge ETH for spot number two. And I also think that there’s a potential that it challenges Bitcoin for the number one spot this cycle. And I know that a lot of people don’t agree… but that’s actually what I think.” Related Reading: Glassnode: XRP Is Back In Its 2021-2022 Playbook As SOPR Drops Sub 1 Taylor was careful to frame the idea as a non-base-case scenario while emphasizing why he believes XRP is uniquely positioned if US policy and institutional incentives shift in its favor. He pointed to Ripple’s US footprint, its endurance through regulatory “trials and tribulations,” and what he characterized as proximity to political power in Washington. In his view, those factors could matter if the next phase of crypto adoption is shaped as much by compliance architecture as by ideology. He also cited comments from Ray Dalio, referenced via an interview Taylor said aired “yesterday,” where Dalio discussed a future of reduced transactional privacy and the risk of being “shut off” if politically disfavored, a scenario Taylor linked to broader CBDC discourse. Taylor emphasized that his point was not whether such an outcome is desirable, but that traders should position for what they think is most likely to happen, not what they want to happen. “If I could change the way that I thought the world was going to be, I would put my capital somewhere else and I’d make the world a different place,” Taylor said. “But I’m not born in a world that I get to choose what happens in the future. But I am born into a world where I get to see what I think is going to happen and place my bets accordingly. It’s just like trading. You don’t trade or place an investment on something you want to happen. You place it on something that you think is going to happen.” XRP Vs. ETH Vs. BTC On the market-structure side, Taylor focused on bitcoin dominance, arguing it is “really, really tight” on Bollinger Bands, a condition he reads as a volatility setup. He revisited a historical example where an 11% bitcoin pullback preceded what he described as a 490% XRP surge, and argued that, historically, drops in bitcoin dominance have tended to coincide with sharp XRP outperformance. Taylor’s core claim is that the compression in dominance has persisted for roughly six months and is now at levels he compared to an earlier era, “before ETH and ICOs”, when dominance dynamics looked structurally different. He allowed for the opposite outcome, where dominance squeezes higher and bitcoin “sucks the liquidity in,” but said he increasingly favors a downside dominance break that would mechanically strengthen the case for altcoin beta, with XRP as a candidate beneficiary if narrative catalysts arrive alongside the move. Related Reading: XRP Price To $1 Or $10? Analyst Warns Investors Of Possible Crash Taylor also leaned on Binance volume comparisons across three-day candles, arguing XRP’s recovery volume looked more aggressive than the preceding selloff, while he said sellers appeared more dominant in ETH and BTC over the same framing. He tied that relative read to XRP cross charts versus ETH and BTC, describing repeated attempts at range resistance and suggesting a “positive price action” trigger could accelerate XRP’s relative breakout. He flagged near-term calendar items, including yesterday’s Clarity Act meeting and the XRP Community Day today, while cautioning against assuming a reflexive pump. Still, Taylor’s broader point was about positioning into a regime shift he believes could arrive quickly, pointing to visible liquidity concentrated above spot levels on his charts, extending from roughly $1.50 up toward $4.30, with comparatively less liquidity stacked below. “I think people are going to be shocked when we start to reverse and we reverse quickly,” Taylor said, arguing that a fast upside move could force traders out of short-term positioning. He then mapped his most bullish path: bitcoin returning to new highs – he floated 150K and “180-ishk plus” as targets – while bitcoin dominance “nukes,” setting up what he called “crazy price action” for XRP if it captures share of that dominance unwind. At press time, XRP traded at $1.3594. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|ETH|ethereum|xrp|XRP analysis|xrp news|XRP Price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57934219,
    "published": 1770825484000,
    "title": "Cryptos crumble, bitcoin falls through $66,000, as Friday's bounce fades",
    "body": "With so many other asset markets in rally mode, investors for the moment appear to have moved on from crypto.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57933948,
    "published": 1770824626000,
    "title": "Inside The 'Clipping Farms' Driving Fintech's Marketing Boom",
    "body": "Fintech and crypto firms are paying freelance editors as little as $1 per thousand views to flood social feeds with branded clips. Regulators are scrambling.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57933186,
    "published": 1770822123000,
    "title": "Susquehanna-backed crypto lender BlockFills halts client withdrawals",
    "body": "Move comes during period of sustained volatility in digital asset markets",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57933089,
    "published": 1770822026000,
    "title": "Ethereum ETF ‘Diamond Hands’ Face Their Harshest Test At $2,000",
    "body": "Ethereum ETF investors are sitting on a far uglier entry point than their bitcoin counterparts, according to Bloomberg Intelligence analyst James Seyffart, with spot ETH funds now absorbing a drawdown that has left many buyers deep underwater. “Ethereum ETF holders are sitting in a worse position than their Bitcoin ETF brethren,” Seyffart wrote on X late Tuesday. “The current ETH price of $2,000 is way below their average cost basis of ETF holders at about ~$3,500. It’s a painful proposition. But it’s one that Eth ETF holders have experienced already.” Seyffart added that the most recent ETH ETF trough pushed the drawdown “beyond 60%,” roughly matching the percentage decline ETH saw at its April 2025 low, framing the move as severe but not unprecedented for ether’s investor base. Related Reading: Ethereum Holders Shift To Self-Custody As Market Consolidates Near $2K Even so, he argued the investor response has been more stoic than the price action implies. “Still, the vast majority of buyers have stayed put,” he wrote, pointing to net inflows across the ETH ETF complex falling from roughly $15 billion to below $12 billion — a materially larger deterioration than bitcoin ETFs “on a relative basis,” but, in his words, “still fairly decent diamond hands in grand scheme (for now).” Fresh flow data suggests the bleeding has slowed, but not flipped decisively. SoSoValue data shows US spot ether ETFs took in about $13.82 million in net inflows on Feb. 10. That followed a week of net redemptions totaling roughly $166 million, extending a multi-week outflow streak. On a monthly basis, SoSoValue figures peg last month’s net flow at about $350 million in outflows. Cumulatively, total net assets are at $11.76 billion as of Feb.10. Goldman Sachs Is Bullish On Ethereum Against that backdrop, Goldman Sachs’ latest 13F disclosure added a different kind of signal: traditional finance’s exposure is increasingly visible, and not confined to bitcoin. On Tuesday, Goldman disclosed about $2.36 billion in crypto-related positions, including roughly $1.06 billion tied to spot bitcoin ETFs and about $1.0 billion to spot ether ETFs, alongside smaller exposures of about $153 million in XRP and $108 million in Solana — a roughly 0.33% allocation in the context of its broader holdings. Related Reading: Can Ethereum Price Still Hit $7,600 In 2026? Here Are The Odds The reactions on X leaned into the optics. Binance founder Changpeng “CZ” Zhao framed the filing as a positioning gap between crypto natives and banks: “Crypto is probably the only place you had an earlier start than the banks. But if you sold your crypto last quarter, while the banks are buying, then…” MoonRock Capital founder Simon Dedic focused on the ETH sizing itself: “Very interesting to see them holding almost as much ETH as Bitcoin. For a conservative investment bank that typically sticks to standard portfolio structures like market cap weighting, this speaks volumes on how they’re significantly more bullish on Ethereum than Bitcoin, which would normally be 4–6x larger in such portfolios. This is the institutional supercycle, and ETH is clearly the institutional darling.” At press time, ETH traded at $1,949. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ETH news|eth price|ethereum|ethereum etf|ethereum news|Goldman sachs",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57933012,
    "published": 1770821830000,
    "title": "BlackRock takes first DeFi step, lists BUIDL on Uniswap as UNI jumps 25%",
    "body": "BlackRock will make shares of its $2.2 billion tokenized U.S. Treasury fund tradable on the decentralized exchange Uniswap.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|BlackRock|Tokenization|Securitize|Uniswap|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 53,
        "NAME": "UNI",
        "CATEGORY": "UNI"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57932693,
    "published": 1770820997000,
    "title": "Analysts react as Robinhood slumps 10%, with slowdown in crypto trading weighing on results",
    "body": "JPMorgan and Compass Point were among the sell-side teams trimming price targets on HOOD.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Robinhood|Quarterly Earnings|JPMorgan|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57932709,
    "published": 1770820988000,
    "title": "EU seeks to close Russia crypto loopholes in new sanctions",
    "body": "The EU plans to ban crypto transactions with Russia by shutting down all related channels, but analysts question whether the measure is fully enforceable.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57932377,
    "published": 1770819746000,
    "title": "Denmark’s Danske Bank allows clients to buy Bitcoin and Ether ETPs",
    "body": "Danske Bank said it is opening access to Bitcoin and Ether ETPs for self-directed clients after years of caution on crypto, citing rising customer demand and clearer EU rules.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57932190,
    "published": 1770819192000,
    "title": "Bithumb admits to ‘serious flaws’ that left internal systems vulnerable to potential sabotage",
    "body": "The South Korean crypto exchange’s CEO Le Jae-won said the lack of proper controls led to the erroneous transfer of bitcoin worth more than $40 billion to customers. Most has been recovered.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bithumb|South Korea|Bitcoin (Currency)|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57931923,
    "published": 1770818457000,
    "title": "Blockchain Meets Gold: Tokenized Commodities Hit $6 Billion",
    "body": "Markets have put more gold on blockchains, And the shift has been rapid. Reports say the tokenized commodities sector grew about 53% in under six weeks, pushing its size to just over $6 billion. That jump has been led by a small group of gold tokens, and the move has traders and some big banks watching closely. Related Reading: Cardano May Be At A Prime Buying Point, Analyst Says Gold Tokens Drive The Rally According to on-chain data, most of the fresh value is sitting in Tether’s XAU₮ and Paxos’s PAXG. Together they hold close to $6 billion of the sector’s market worth. Investors are treating these tokens as a quick way to own a claim on bullion without needing to move bars or deal with vault paperwork. Some buyers want a safe haven that moves easily across borders. Others want to trade fractions of an ounce in online markets. Tether Moves Toward Physical Integration Reports say Tether has not stopped at issuing a token. The firm took a $150 million stake in Gold.com with plans to fold XAU₮ into that platform and to let customers pay for actual gold with stablecoins. This is a step toward tying token balances more directly to physical holdings and sales channels. If it works, retail buyers could use familiar crypto tools to buy and collect real metal, which would change how ordinary people access bullion. Analysts See Big Upside Based on reports, Geoffrey Kendrick of Standard Chartered has sketched a huge growth path: from roughly $35 billion in tokenized real-world assets today to as much as $2 trillion by 2028. Alvin Foo, a crypto analyst, has argued that tokenized commodities — gold on public chains in particular — could scale to trillion-dollar values someday, as markets adopt fractional ownership and new trading rails. Those projections require many pieces to fall into place: clear rules, reliable custody proofs, and wide demand from non-crypto investors. Ambitious goals are being set, but they rest on a chain of technical and legal fixes that are still in progress. How The System Works And Why It Matters Stablecoin liquidity and decentralized finance plumbing are being pointed to as the plumbing that can support larger markets. Reports note that having quick settlement, low minimums, and easy custody opens bullion to smaller investors and traders who were locked out before. Related Reading: After Predicting XRP’s Drop, Analyst Says The Bottom May Be In Fractional ownership is already possible, which means someone can own a slice of a bar without ever visiting a vault. Yet trust must be earned. Custodial audits, insured storage, and transparent minting and redemption rules will shape whether token holders feel secure. Featured image from Private Banker International, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto|gold|precious metal|RWA|stablecoin|tokenized commodities|USDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57931994,
    "published": 1770818400000,
    "title": "Lombard looks to link institutional custody to onchain finance",
    "body": "The product will let institutions use custodied Bitcoin as onchain collateral without moving assets or transferring control, with Morpho set as the initial liquidity partner.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57931875,
    "published": 1770818340000,
    "title": "Ethena-backed suiUSDe stablecoin goes live on Sui with $10 million yield vault launch",
    "body": "The synthetic dollar debuts on Sui Mainnet alongside a permissionless vault seeded by SUI Group and integration with DeepBook’s new margin system.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Stablecoins|Sui|Ethena|Exclusive|Vault|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 96,
        "NAME": "SUI",
        "CATEGORY": "SUI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57931615,
    "published": 1770817406000,
    "title": "Why blockchain TPS numbers often collapse in the real world",
    "body": "High TPS figures promise scale, but every additional transaction increases the burden on the very nodes meant to keep networks decentralized.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      }
    ]
  },
  {
    "id": 57931302,
    "published": 1770816884000,
    "title": "U.S. added stronger than expected 130,000 jobs in January, with unemployment rate falling to 4.3%",
    "body": "Down sizably ahead of the jobs data, bitcoin rose modestly to $67,500 following the news.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Breaking News|top news|Employment|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57931308,
    "published": 1770816761000,
    "title": "XRP analysts explain why price drop below $1 ‘remains possible’",
    "body": "XRP looked increasingly bearish at $1.40, with a key indicator suggesting that a downward move below $1 was possible in the coming weeks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57931172,
    "published": 1770816492000,
    "title": "Morning Minute: Layer Zero Debuts Most Impressive Blockchain Tech Upgrade in Years",
    "body": "They're promising speeds 500x Solana and 100,000x that of Ethereum, and some of the biggest financial players in the world have taken note.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Opinion",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57930850,
    "published": 1770815425000,
    "title": "UK Regulator Launches Enforcement Action Against HTX Over Illegal Financial Promotions",
    "body": "The FCA has begun legal proceedings against the exchange for “illegally promoting crypto asset services to UK consumers.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57930591,
    "published": 1770814850000,
    "title": "XRP Positioned For Major Structure Shift As Price Tests Critical Level",
    "body": "After recovering from last week’s lows, XRP has been moving sideways, hovering between $1.40 and $1.45 during the past four days. As the price attempts to hold its local range lows, a market observer has affirmed that the cryptocurrency could be preparing for a potential recovery if its critical level holds. Related Reading: Bitcoin Could See New Drop To $60,000 Despite Bounce – Here’s The Level To Defend XRP At Critical Inflection Point On Tuesday, crypto analyst ChartNerd highlighted XRP’s performance over the past six months, suggesting that the altcoin could be ‘Positioned for a Major Bullish Structure Shift.” He explained that the cryptocurrency has seen “6 months of downside with virtually no relief,” while showing key signals, such as the MACD and RSI reaching historical oversold levels. Moreover, the analyst highlighted the simultaneous retests of the 50-Month Exponential Moving Average (EMA), a prior eight-year resistance line, and the Fibonacci demand zone. “This marks the first 50EMA backtest since November 2024, and doing so, we have a wick marked on the 0.618/0.5 FIB demand zone. A popular reversal pocket,” he noted. In a video analysis, ChartNerd also emphasized that XRP is currently at a “critical inflection point,” pointing to its 200-week EMA, a level that had not been tested since 2024 until now, and where the price is currently sitting. The analyst detailed that “this is one of the most important times for XRP because if it holds the line above this moving average, this could set the pace for new all-time highs and continuation of the trend to higher targets.” For his bullish case, he pointed out XRP’s 2023-2024 performance, when it consolidated above the indicator and held it as support for over a year, leading to the breakout in November 2024. To him, the important part is to “hold the 200W EMA, defend it, and create a higher low base. This is where XRP could push to new all-time highs if it respects this long-term structure moving average.” Analyst Warns Of New 50% Correction The analyst also shared a bearish outlook for XRP, noting that losing the 200W EMA in the weekly timeframe and, more importantly, confirming it as resistance could signal a major drop ahead. Per ChartNerd’s analysis, if the altcoin starts closing below the 200W EMA, located around the $1.41 area, it risks descending toward the $0.70 mark. This is where the previous local highs that have not been retested since the late 2024 breakout are. He explained that in 2022, after reaching a local high of around $1.97, XRP “came back down for a retest on its 200-week EMA. It then placed a lower high, lost the 200-week, and corrected even further to its bear market lows.” Related Reading: An ‘Inverted Alt Season’? Analyst Explains How The Altcoins Market Has Changed In past cycles, when XRP failed to hold this critical inflection level, it entered a deep corrective period, crashing by around 50% toward the bear market bottom. “So technically speaking, if XRP lost right now, for example, the 200-week EMA and we crashed another sort of 49% roughly, you’re bringing XRP back down to 70, which is again those highs that I spoke about in the past that we haven’t actually back tested for support since breaking out,” he warned. As of this writing, XRP trades at $1.39, a 3% decline on the daily timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto analyst|Crypto bear market|crypto market correction|Crypto Market Recovery|Crypto trader|xrp|XRP bearish prediction|XRP breakdown|XRP Bullish Signal|XRP Price|XRP Recovery|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57930644,
    "published": 1770814838000,
    "title": "Arkham Exchange pivoting to fully decentralized platform, CEO says",
    "body": "Arkham CEO denies shutdown reports as the exchange pivots from a CEX to a fully decentralized model amid record DEX derivatives growth.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 199,
        "NAME": "ARKM",
        "CATEGORY": "ARKM"
      }
    ]
  },
  {
    "id": 57930508,
    "published": 1770814587000,
    "title": "Recapping day 1 of Consensus Hong Kong",
    "body": "Hong Kong is looking to build its digital assets economy, its leaders said on stage.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Consensus Hong Kong 2026|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57929938,
    "published": 1770813112000,
    "title": "Danske Bank Offers Bitcoin, Ethereum ETPs to Investors, Ending Eight-Year Crypto 'Ban'",
    "body": "Denmark’s largest bank is ending an eight-year ‘ban’ on crypto services in response to growing customer demand and improved regulation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57929750,
    "published": 1770812564000,
    "title": "Google Cloud flags North Korea-linked crypto malware campaign",
    "body": "Mandiant, which operates under Google Cloud, has tracked the suspected North Korean scammers since 2018, and AI has helped scale up malicious attacks since November 2025.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57929488,
    "published": 1770811852000,
    "title": "Bitcoin Whales Quietly Scoop Up $4.7B in BTC, Pushing Bitcoin Hyper Into the Spotlight",
    "body": "What to Know: Bitcoin whales have added over $4.7B in $BTC, signaling deep conviction despite a flat market. This buying trend highlights a shift in Bitcoin’s narrative from just a store of value to a productive asset, increasing demand for L2 solutions. Bitcoin Hyper is tackling this demand by using the Solana Virtual Machine to bring fast, cheap smart contracts to Bitcoin. This large-scale whale accumulation could trigger a major supply squeeze when retail interest eventually returns. While the crypto market is treading water, giving everyone that ‘crypto winter’ feeling, on-chain data tells a totally different story. Below the surface of flat price charts, the smart money is making big moves. Crypto intelligence firms are reporting that Bitcoin whales, wallets with huge $BTC holdings, have quietly added over $4.7B worth of Bitcoin during the recent dips. That isn’t the behavior of a market gripped by fear. It’s the signature of cold, hard conviction. This accumulation phase isn’t about short-term price pops; it’s a signal about where the market is headed. When institutions buy into weakness, they aren’t just betting on a bounce. They’re positioning for a fundamental shift. For years, Bitcoin was pitched simply as digital gold, a safe place to park value. But that story is getting bigger. This buying pressure suggests a bet on Bitcoin’s next evolution: from a passive asset into a dynamic, productive financial layer. The only thing holding it back has always been the network’s built-in limitations. Slow transactions and no real support for complex apps. What good is a trillion-dollar asset if you can’t build anything on it? This is the exact problem a new class of projects, led by ambitious platforms like Bitcoin Hyper ($HYPER) , is racing to solve. Read more about $HYPER here. Unlocking Bitcoin’s Trillion-Dollar Ecosystem Bitcoin’s core protocol is a fortress of security, but that security comes at a cost: speed. The trade-off means high fees and a network that’s hostile to the complex smart contracts that make DeFi and NFTs possible on chains like Ethereum and Solana. The demand for a fix is obvious, and the Layer 2 (L2) race is on. So, how does Bitcoin Hyper ($HYPER) plan to win it? It’s entering the race with a genuinely disruptive approach. As the first-ever Bitcoin L2 integrated with the Solana Virtual Machine (SVM), it tackles Bitcoin’s limitations head-on. By using the SVM, known for its lightning-fast, low-cost processing, Bitcoin Hyper aims to deliver performance that could even outpace Solana itself, all while borrowing its security from the Bitcoin network. Frankly, it’s a clever architecture. It lets Bitcoin remain the ultimate settlement layer for value while the L2 handles the kind of rapid-fire transactions needed for modern dApps. For developers, this means building high-speed DeFi and NFT markets with familiar tools. For users, it means finally being able to use their $BTC for more than just HODLing. Get your $HYPER today. Smart Money Is Already Moving into the $HYPER Presale The market seems to agree. Bitcoin Hyper’s presale has already pulled in a massive $31.3M from early backers, with the $HYPER token currently priced at $0.0136754. This isn’t just retail enthusiasm, either. The on-chain data mirrors the whale activity on Bitcoin itself. Etherscan records show three whale wallets have already scooped up $1M+ in $HYPER, with one of those making a single $500K purchase on January 15th, 2026. This kind of activity suggests sophisticated investors see a project that offers more than just a small upgrade, it’s a potential step-change for what Bitcoin can do. The risk, of course, lies in execution and beating out a crowded L2 field. But the unique SVM integration gives it a compelling edge. With high-APY staking set to go live right after launch, the project is clearly designed to reward early believers who help secure the network. Buy $HYPER here. This article is for informational purposes only and should not be considered financial advice. Cryptocurrency investments are high-risk, and you should conduct your own research.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57929363,
    "published": 1770811343000,
    "title": "Aviva Investors to tokenize funds on XRP Ledger in Ripple partnership",
    "body": "The U.K. asset manager teamed up with Ripple to bring traditional fund structures onchain in its first tokenization push.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Ripple|Tokenization|Asset Management|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57929320,
    "published": 1770811249000,
    "title": "Strategy Unfazed By Bitcoin Crash, Michael Saylor Vows Quarterly Purchases",
    "body": "Michael Saylor, the outspoken Bitcoin (BTC) advocate and Strategy (previously MicroStrategy) co-founder, said on Tuesday that the company remains firmly committed to its long‑standing Bitcoin strategy, despite growing concerns about its financial risks. Strategy Will Buy Bitcoin Every Quarter Speaking in an interview with CNBC, Saylor said Strategy plans to continue buying Bitcoin on a regular basis, regardless of price swings or skepticism from market observers. He said the company intends to add to its Bitcoin holdings every quarter and has no plans to reverse course. “I expect we’ll be buying bitcoin every quarter forever,” Saylor said. Related Reading: Strategy Expands Bitcoin Holdings With $90M Purchase, Bitmine Follows With ETH Addressing concerns about the company’s debt load, Saylor was dismissive of the idea that a prolonged Bitcoin downturn could threaten Strategy’s finances. He said that even in a severe scenario, the company would manage its obligations through refinancing. “If Bitcoin falls 90% for the next four years, we’ll refinance the debt,” he said. “We’ll just roll it forward.” Strategy currently carries more than $8 billion in total debt, much of it tied to convertible notes the company issued to fund Bitcoin purchases. Despite this leverage, Saylor said he believes lenders will continue to support the company even if Bitcoin prices decline sharply. Asked whether banks would still be willing to lend under those circumstances, he replied that Bitcoin’s inherent volatility does not undermine its long‑term value. “Yeah,” he said, “because the volatility of Bitcoin is such that it’s always going to be a value.” Saylor also rejected any suggestion that Strategy might be forced to sell its Bitcoin holdings to shore up its balance sheet. He emphasized that liquidation is not part of the company’s plan and reiterated his belief in Bitcoin as a long‑term asset. Short Sellers Increase Bets Market sentiment around Strategy, however, has grown more cautious. Short interest in the company’s stock has risen sharply, increasing about 40% from a low point in September 2025, according to an analysis published by Barron’s. Roughly 30.5 million shares are now sold short, representing about 10% of the company’s public float. At the same time, long‑term investors have pulled back, with Strategy’s shares, MSTR, falling around 70% to current trading prices of $134. Related Reading: Bernstein Calls Bitcoin Crash A ‘Crisis Of Confidence,’ Maintains $150,000 Target Despite the pressure on its stock, Strategy remains the largest corporate holder of Bitcoin. According to figures published on the company’s website, it holds 714,644 BTC, valued at approximately $49 billion at the time of writing. Saylor also noted that the company has sufficient liquidity to support its obligations, stating that Strategy has roughly two and a half years’ worth of cash on its balance sheet to cover dividend payments. At the time of writing, Bitcoin was trading at around $69,192, registering losses of nearly 8% over the past seven days and 3% over the past 24 hours. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin price|bitcoin strategy|btc|BTC news|btc price|BTCUSDT|crypto|crypto news|Michael Saylor|Michael Saylor news|Microstrategy|MicroStrategy Bitcoin|MicroStrategy bitcoin holdings|MicroStrategy news|MSTR|Strategy news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57928911,
    "published": 1770809789000,
    "title": "Bearish sentiment prevails as bitcoin falls below $67,000, ether drops",
    "body": "Bitcoin and ether extended declines, dragging down crypto-related stocks, even as gold and silver rallied.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|Derivatives|Altcoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57928721,
    "published": 1770808819000,
    "title": "European Parliament throws support behind digital euro",
    "body": "European lawmakers endorsed the ECB’s digital euro plans as a way to shore up the bloc’s monetary sovereignty, while reiterating that the central bank must remain independent.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 57928194,
    "published": 1770807568000,
    "title": "Regulation, derivatives helping drive TradFi institutions into crypto, panellists say",
    "body": "Non-participation in decentralized finance is becoming a career risk for traditional finance professionals, panellists said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Consensus Hong Kong 2026|Regulation|Policy|Derivatives|Institutions|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57927872,
    "published": 1770806552000,
    "title": "Zcash, BNB, Sui Lead Altcoin Losses As Crypto Market Slides",
    "body": "Leading altcoins dropped, as analysts cite capital flight to gold, ETF outflows, and cascading liquidations for draining market liquidity.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|||zcash|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57927391,
    "published": 1770805354000,
    "title": "Russia Tightens Grip on Telegram, Highlighting Urgent Need for Decentralized Infrastructure",
    "body": "What to Know: Russia’s move to restrict Telegram underscores the vulnerabilities of centralized platforms and strengthens the case for decentralized infrastructure. Bitcoin’s long-standing limits on speed and programmability have created a significant opportunity for Layer 2 solutions to expand its utility. Bitcoin Hyper aims to solve these issues by integrating the Solana Virtual Machine (SVM) to bring high-speed smart contracts to the Bitcoin ecosystem. A successful presale and notable whale buys suggest strong market confidence in the growth of Bitcoin-based DeFi and dApps. Russian authorities are reportedly tightening their grip on Telegram. Citing alleged breaches of local laws , it’s another move in the global trend of governments flexing control over the digital platforms we use every day. But this isn’t just a regional political headline, it’s a stark reminder of the web’s built-in vulnerabilities. For a crypto market founded on decentralization, this development isn’t a surprise. It’s validation. When communication and finance can be throttled by regulators, the case for censorship-resistant alternatives becomes impossible to ignore. Why does this matter? Because crypto’s ultimate promise is a parallel digital world free from these exact chokepoints. Bitcoin is the bedrock of that vision. For years, though, its utility has been hamstrung by slow speeds, high fees, and an almost total inability to support complex apps. It’s been a pristine settlement layer with no scalable way to actually do things on top of it. This long-standing limitation has created a massive opportunity. As geopolitical pressure mounts, the market is aggressively pivoting toward solutions that can finally unlock Bitcoin’s full potential, infrastructure that’s robust, programmable, and fast. Think Bitcoin Hyper ($HYPER) , currently in a $31.3M presale. $HYPER is available here. Unlocking Bitcoin’s True Potential with High-Speed Execution Bitcoin’s core challenge has always been a deliberate trade-off: unmatched security for sluggish speed and limited programmability. Sound familiar? This is where a new generation of projects comes in. Bitcoin Hyper ($HYPER) is a direct answer to this dilemma, introducing what it calls the first-ever Bitcoin Layer 2 integrated with the Solana Virtual Machine (SVM). This isn’t just an incremental upgrade; it’s a fundamental reimagining of what you can build on Bitcoin. By using a modular architecture, Bitcoin’s L1 for settlement and a real-time SVM L2 for execution, the project aims for performance that rivals Solana itself. The team even claims it will surpass it. This setup allows developers to build high-speed DeFi, NFT platforms, and complex dApps using wrapped $BTC, all while inheriting the rock-solid security of the main Bitcoin network. The key innovation is simple but powerful: bringing fast, scalable smart contracts to an ecosystem that’s been desperate for them. Through its Decentralized Canonical Bridge, users can port $BTC to the L2 to power high-speed payments, lending, and gaming with the kind of low-cost execution developers love on chains like Solana. Buy $HYPER here. Presale Momentum Signals Strong Market Conviction The market is listening. The Bitcoin Hyper presale has already pulled in a staggering $31.3M to date, with tokens currently priced at $0.0136754. That kind of raise reflects a groundswell of belief in the Bitcoin ecosystem’s future. But what most coverage misses is that this isn’t just retail enthusiasm. Onchain data shows smart money is paying very close attention. Etherscan records show three whale wallets have already scooped up $1M+ in $HYPER ( $500K , $379.9K , $274K ). This level of early, high-conviction buying often signals that broader market awareness is just around the corner. Of course, the risk is all in the execution. The Bitcoin L2 space is getting crowded, and delivering on such an ambitious roadmap is everything. Still, the project’s high-APY staking, available right after the token launch, is designed to lock in long-term participation and build a resilient network from day one. Buy $HYPER here now. This article is for informational purposes only and should not be considered financial advice. All investments carry risk, and readers should conduct their own research.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57926512,
    "published": 1770802766000,
    "title": "Hong Kong ready to issue first stablecoin licenses in March, Financial Secretary says",
    "body": "Hong Kong will begin issuing a small number of stablecoin licenses to companies with credible business models and strong compliance, Paul Chan Mo-po said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Consensus Hong Kong 2026|Hong Kong|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 57926513,
    "published": 1770802734000,
    "title": "Uniswap Vindicated in Patent Lawsuit, Highlighting LiquidChain’s Booming Presale",
    "body": "What to Know: Uniswap’s legal victory over Bancor in a patent infringement case is a significant win for open-source innovation in DeFi. The ruling shifts the industry’s focus from intra-chain capital efficiency to the larger, unresolved issue of cross-chain liquidity fragmentation. LiquidChain is emerging as a Layer 3 protocol designed to unify native liquidity from the Bitcoin, Ethereum, and Solana ecosystems. Solving cross-chain interoperability is one of the next major growth frontiers for the entire decentralized economy. In a landmark decision for open-source finance, a New York federal court has dismissed a patent infringement lawsuit brought by Bancor against Uniswap Labs. The ruling, centered on Uniswap’s Concentrated Liquidity Market Maker (CPAMM) technology, marks a decisive victory for collaborative innovation in an industry built on shared code. A clear win. While the crypto world celebrates this outcome, the legal battle also spotlights a more profound, unresolved challenge: the deep fragmentation of liquidity across major blockchains. The lawsuit, filed in 2022, alleged that Uniswap’s v3 protocol infringed on a Bancor patent related to automated market maker (AMM) technology. The court’s dismissal, as reported by Cointelegraph, is more than a legal footnote; it’s a philosophical statement. It pushes back against attempts to wall off foundational DeFi concepts, ensuring that the building blocks of decentralized finance remain accessible to all. That matters for preserving the composable, open-source ethos that allowed DeFi to flourish in the first place. But the AMM wars are a battle of the last cycle. The victory is crucial, yet it solves a problem within a single ecosystem. The second-order effect is that the industry’s smartest minds can now refocus on the bigger prize: unifying the isolated oceans of capital on Bitcoin, Ethereum, and Solana. This is no longer a question of making one liquidity pool more efficient. It’s about building the infrastructure to connect them all. And frankly, the timing couldn’t be better. This is the precise challenge being tackled by a new generation of protocols, with Layer 3 solution LiquidChain ($LIQUID) emerging at the forefront. Learn more about LiquidChain here. Beyond the AMM Wars: Solving the Liquidity Silo Problem The dispute between Uniswap and Bancor was fundamentally about optimizing capital efficiency on Ethereum. An internal debate. Today’s reality is that DeFi’s most significant friction point is external, the clunky, high-risk process of moving assets between blockchains. Wrapped assets introduce smart contract risk, bridges remain prime targets for hackers, and the user experience is a tangled mess of swaps, signatures, and fees. This is where infrastructure like LiquidChain changes the narrative. As a Layer 3 protocol, it’s designed not to compete with Ethereum or Solana but to unify them. Its core proposition is a Unified Liquidity Layer, creating a single execution environment that fuses the liquidity of Bitcoin, Ethereum, and Solana. For the user, this means native cross-chain swaps without the need for vulnerable wrapped assets. For developers, it means deploying an application once to access the entire addressable market of the three largest crypto ecosystems. Clean and direct. What most coverage misses is that this isn’t just another bridge. It’s a fundamental architectural shift. Features like Single-Step Execution aim to abstract away the complexity of cross-chain transactions, making interoperability feel seamless. By creating a verifiable settlement layer above these base chains, LiquidChain directly addresses the security vulnerabilities that have cost the industry billions. The market is evolving from optimizing isolated pools to creating a single, composable liquidity super-highway. But can it knit them together safely? Explore the LiquidChain ecosystem. A New Infrastructure Play Attracts Early Capital With the legal overhang on AMM innovation now cleared, smart money is searching for the next foundational pillar of DeFi. In past cycles, we’ve seen legal clarity act as an accelerant for builders and capital alike. The data points to a growing interest in protocols that solve systemic, cross-chain challenges. This market sentiment is reflected in the early momentum of the LiquidChain presale. According to its official site , the project has already secured $535K in early funding, with its $LIQUID token priced at $0.0136. This initial traction suggests that investors recognize the value in tackling liquidity fragmentation. And let’s not forget the 1,939% staking rewards. While optimizing a DEX on a single chain is a multi-billion-dollar opportunity, creating the connective tissue for the entire crypto economy is an order of magnitude larger. The prize is bigger. The risk, of course, lies in execution. Building a robust and secure L3 that can handle the scale of three major blockchains is a monumental technical undertaking (no small feat). However, the project’s focus on a Deploy-Once Architecture presents a compelling incentive for developers. By drastically lowering the barrier to building cross-chain applications, LiquidChain could catalyze a new wave of innovation that was previously too complex or capital-intensive to attempt. History suggests that the platforms that best empower builders are the ones that ultimately win. Get your $LIQUID here. Disclaimer: This article is for informational purposes only and should not be considered financial advice. Investing in cryptocurrencies and presales involves a high degree of risk.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 53,
        "NAME": "UNI",
        "CATEGORY": "UNI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57926422,
    "published": 1770802310000,
    "title": "Uniswap scores early win as US judge dismisses Bancor patent suit",
    "body": "The court granted Uniswap’s motion to dismiss without prejudice, allowing plaintiffs 21 days to amend before the dismissal becomes final.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 53,
        "NAME": "UNI",
        "CATEGORY": "UNI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57926223,
    "published": 1770802077000,
    "title": "Stripe’s New X402 Protocol for AI Agents Spotlights a Booming Trend, Fueling SUBBD Token’s Presale",
    "body": "What to Know: Stripe is testing a new crypto protocol (X402) on Base to let AI agents pay each other, validating the machine-to-machine (M2M) economy. This move is a major endorsement for Layer-2 blockchains, showing they’re ready for real-world enterprise use, not just speculation. SUBBD Token is tapping into this trend by building an AI-powered platform for the creator economy that merges AI with Web3 payments. Creators are moving away from platforms with high fees and censorship, seeking decentralized alternatives that give them more control and better earnings. The digital economy is on the verge of a massive shift, and payments giant Stripe just fired the starting gun. The company is exploring a new payment protocol, X402 , built on Coinbase’s Layer-2 network, Base. Its purpose is specific and futuristic: to let AI agents pay each other. This isn’t just some minor update. It’s a foundational piece of infrastructure for the coming wave of machine-to-machine (M2M) commerce, an economy where autonomous software programs transact for data, services, and computation without any human oversight. But what most of the coverage is missing is the sheer scale of this validation. When a Web2 titan like Stripe builds a core piece of its future strategy on a public blockchain, it’s a massive signal that crypto infrastructure is finally ready for the big leagues. The choice of Base, an Ethereum L2, confirms what many already knew: scalability and low fees aren’t just nice-to-haves; they’re non-negotiable. The ripple effect? A surge of interest in projects building practical applications where AI and crypto payments meet. This macro tailwind is creating fertile ground for specialized platforms, especially in high-value industries like the $191B content creator market, a sector practically begging for disruption. SUBBD Token ($SUBBD) is that disruption that the industry sorely needs. Learn more about $SUBBD here. A New Economy for AI-Powered Creators The creator economy has a glaring problem. Sound familiar? Platforms connecting creators with fans often act as extractive middlemen, charging fees as high as 70% while imposing arbitrary rules and payment restrictions. For creators using AI, the landscape is even more fractured, forcing them to juggle separate tools for chatbots, voice synthesis, and content generation. It’s exactly this friction that decentralized, AI-integrated platforms are built to solve. Enter SUBBD Token ($SUBBD) , an Ethereum-based project that merges Web3 infrastructure with a suite of powerful AI tools. The platform is designed to put power back in creators’ hands, giving them the technology to build and monetize their brands directly. But this isn’t just about lower fees; it’s about enabling entirely new forms of interaction. Key features include an AI Personal Assistant for automating fan chats, AI Voice Cloning, and even the ability to launch fully autonomous AI Influencers. It provides a transparent Web3 ecosystem where creators control their content and, frankly, keep more of what they earn. This matters because it takes the abstract concept of an ‘AI agent economy’ and makes it tangible. While Stripe builds the global payment rails, SUBBD is building the specialized apps that will actually run on them. On the SUBBD platform, an AI influencer isn’t just a gimmick, it’s an economic entity capable of generating token-gated content, interacting with fans, and earning revenue via the native $SUBBD token. It’s a perfect microcosm of the M2M economy, tailored for one of the internet’s most dynamic industries. Explore the SUBBD Token presale here. Presale Crosses $1.4M as Investors Back AI Utility And the market is taking notice. In a cycle dominated by the AI narrative, sophisticated investors are hunting for projects with clear utility, and capital is flowing accordingly. The SUBBD Token presale has already turned heads, raising an impressive $1.47M from early backers. With tokens currently priced at just $0.057495, the momentum points to a strong belief in the project’s vision. This isn’t just speculative hype. The $SUBBD token is woven directly into the platform’s ecosystem. It’s the primary medium for transactions, from fan subscriptions and pay-per-view content to tipping and NFT sales. For holders, the token unlocks governance rights, letting the community vote on platform features and creator onboarding. Plus, an aggressive staking program offers a fixed 20% APY in the first year, providing a powerful incentive for long-term participation. The goal is simple: reward early supporters while securing the network. The risk, as with any new platform, comes down to adoption. Can it attract a critical mass of creators and fans away from the Web2 giants? That’s the billion-dollar question. However, by solving real pain points, brutal fees, lack of control, and fragmented tools, and aligning with the powerful AI-crypto trend validated by players like Stripe, SUBBD is positioning itself as a compelling alternative in a market that’s changing by the day. Buy $SUBBD here. This article is for informational purposes only and should not be considered financial advice. All investments, including cryptocurrencies, carry significant risk.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57925893,
    "published": 1770801374000,
    "title": "Tokenized Commodities Swell Past $6B as Gold Shines and New Contender $MAXI Builds Momentum",
    "body": "What to Know: The market for tokenized commodities has blown past $6B, mostly thanks to demand for gold-backed tokens in an uncertain economy. This trend shows a split market: money is flowing to both safe havens and high-risk, high-reward speculative plays. Maxi Doge ($MAXI) is tapping into a unique, high-energy trading culture to build its community with gamified competitions. Whale wallets are accumulating and the presale has pulled in over $4.5M, signaling strong early interest in the project. With Bitcoin trading sideways, a different kind of digital asset is quietly booming. The market for tokenized commodities has surged past $6B in total value , according to recent industry data. This growth is predominantly fueled by gold-backed tokens like Tether Gold (XAUT) and Pax Gold (PAXG), which together command the lion’s share of this growing sector. As gold itself tests new highs, investors are increasingly turning to its on-chain counterparts for exposure, seeking the stability of a millennia-old store of value combined with the efficiency of blockchain technology. Why does this matter? It signals a profound shift in market psychology. In a climate of macroeconomic uncertainty and ranging crypto prices, capital is flowing toward assets with perceived safety and tangible value. Tokenized gold offers just that, the ability to hold a claim on physical gold without the custody headaches, settled on-chain with near-instant finality. But that’s only half the story. While one cohort of investors hedges with digital gold, another is hunting for alpha at the opposite end of the risk spectrum. Those same market conditions also fuel an appetite for high-octane, speculative plays capable of delivering outsized returns. What most coverage misses is that these trends aren’t contradictory. In a market desperate for direction, they’re two sides of the same coin. This environment has become the perfect breeding ground for a new class of meme tokens built not just on humor, but on a culture of aggressive market participation. Enter Maxi Doge ($MAXI) , an Ethereum-based meme token that embodies the high-leverage, ‘1000x’ trading mentality. Read more about $MAXI here. From Safe Havens to High-Leverage Culture Where tokenized gold offers stability, a new project channels the market’s raw, unfiltered energy. It’s a direct response to a market where retail traders often feel outgunned by whales. Frankly, Maxi Doge ($MAXI) isn’t just another canine-themed coin. It’s a cultural statement built around strength, discipline, and the relentless grind of the bull market. The project’s ecosystem is designed to foster a community of active traders. Its core features include holder-only trading competitions with leaderboards and rewards, creating a gamified environment for profit-and-loss hunters (a clever move, really). This transforms passive holding into active engagement. Plus, the ‘Maxi Fund’ treasury is designated for securing liquidity, funding partnerships with futures platforms, and amplifying its viral, gym-bro marketing narrative. The second-order effect is the creation of a self-reinforcing community. By building its identity around the ‘Lift, trade, repeat’ mantra, Maxi Doge taps into a powerful subculture that equates financial ambition with physical strength. Is it unconventional? Absolutely. But in the attention economy of crypto, a unique and resonant narrative is often the difference between obscurity and viral adoption. $MAXI is available here. On-Chain Data Signals Early Strength And that narrative is translating into tangible results. According to its official site, the Maxi Doge presale has already attracted significant capital, pulling in an impressive $4.59M with tokens priced at $0.0002803. That level of funding suggests the project’s high-energy message is resonating with a market segment hungry for the next big meme-driven rally. But can it last? As with any meme coin, the real risk is sustaining momentum after the launch, a challenge that hinges entirely on community execution. Digging deeper, on-chain data reveals that smart money is taking notice. Etherscan records show two whale wallets have scooped up a combined $628,000 in $MAXI tokens. The biggest buy was a single quarter-million-dollar ( $314K ) transaction on October 11, a clear signal of high conviction from at least one major player. For market observers, such movements are often a leading indicator of a project’s potential. To further incentivize its community, the project incorporates a dynamic staking APY. Rewards are distributed automatically via smart contract from a dedicated 5% allocation pool, providing a yield-bearing component for holders. Looking ahead, the critical test for Maxi Doge will be its ability to integrate with trading platforms and deliver on its promise of gamified tournaments. That’s what will truly bring its high-leverage culture to life. It’s a project to watch closely. Join the Maxi Doge presale and experience the next wave of community-driven crypto innovation. Buy your $MAXI here. This article is for informational purposes only and should not be considered financial advice. Cryptocurrency investments are inherently volatile and risky.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 16,
        "NAME": "COMMODITY",
        "CATEGORY": "COMMODITY"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57925558,
    "published": 1770800597000,
    "title": "Tom Lee says stop timing the bottom and start buying the dip",
    "body": "Thomas Lee, speaking on stage at Hong Kong Consensus 2026, said investors should be looking at opportunities as crypto is in the midst of a \"mini winter.\"",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Ethereum News|Market Wrap|Consensus Hong Kong 2026|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57925513,
    "published": 1770800587000,
    "title": "Ark Invest’s AI Thesis Sparks CapEx Boom Prediction, Spotlighting a New Wave of AI-Crypto Tokens",
    "body": "What to Know: Ark Invest predicts a massive, multi-year capital spending boom from tech giants building out AI’s foundational infrastructure. This infrastructure surge is set to enable a new generation of specialized apps, with the creator economy being a prime beneficiary. SUBBD Token aims to solve creator problems like high fees and censorship by integrating AI tools with Web3 monetization. The market is showing strong early interest, with the SUBBD presale raising over $1.4M from investors. Cathie Wood’s Ark Invest is once again sounding the alarm on a technological revolution, this time forecasting a multi-year capital expenditure (CapEx) boom driven by artificial intelligence. The thesis is simple but profound: the world’s largest tech companies, from Amazon and Google to Meta and Microsoft, are just beginning an unprecedented investment cycle into the core infrastructure that powers AI. This isn’t just about buying more servers. It’s a fundamental re-architecting of the digital world, with hundreds of billions pouring into data centers, custom silicon, and GPU fleets. But what does most coverage miss? The second-order effects. This massive infrastructure build-out isn’t just for enterprise cloud services; it’s the foundation for a new generation of consumer-facing AI applications. As compute power gets more accessible and models more sophisticated, the benefits will cascade down to specialized industries. One of the first and most fertile grounds for this disruption is the $191B content creator economy. Sound familiar? For years, creators have been at the mercy of centralized platforms, battling exorbitant fees, opaque algorithms, and sudden de-platforming. This is the exact environment where decentralized, AI-powered solutions are poised to thrive. This macroeconomic tailwind is drawing smart money toward niche tokens that integrate AI directly into their utility. The data points to a growing appetite for platforms that don’t just use AI as a buzzword but as a core functional component. In this environment, projects designed to empower individual users and creators are gaining serious traction, SUBBD Token ($SUBBD) being the most prominent and promising of them. Read more about SUBBD Token here. SUBBD Harnesses AI to Empower the Next Wave of Creators Let’s be honest: the creator economy is fundamentally broken. Platforms can skim up to 70% of a creator’s earnings, enforce arbitrary content policies, and offer a fragmented, inefficient toolkit. SUBBD Token ($SUBBD) tackles this head-on by merging a Web3 framework with a powerful, integrated AI suite. It’s designed as the all-in-one ecosystem that Ark’s CapEx prediction implicitly enables. This matters because creators need more than just a place to post content; they need tools to scale. SUBBD provides this through features that were, until recently, the domain of large studios. Its AI Personal Assistant can automate fan interactions and manage communities, while AI Voice Cloning and AI Influencer Creation open up entirely new monetization avenues. Imagine a creator generating promotional content in their own voice without ever stepping into a studio, or launching a virtual counterpart to engage with fans 24/7. This is the exact application layer the AI infrastructure boom is being built for. Beyond the AI tools, SUBBD leverages a decentralized Web3 architecture. This means lower fees, censorship resistance, and direct creator-to-fan payment channels via crypto. By using token-gated access and NFT sales, creators regain full control over their content and revenue streams. The risk, of course, is in execution and user adoption, but the model itself directly answers the industry’s most pressing pain points. Explore the SUBBD Token presale here. Early Backers Fuel SUBBD’s Vision as Presale Crosses $1.4M Frankly, the market appears to be validating SUBBD’s approach. The project’s presale has already attracted significant early-stage interest, raising $1.47M with tokens currently priced at $0.057495. This level of fundraising suggests strong confidence in the team’s vision to fix the creator economy’s inefficiencies. For participants, the value proposition extends beyond the platform’s utility. SUBBD is offering a staking program with a fixed 20% APY for the first year. This mechanism isn’t just about rewarding early supporters; it’s designed to foster a stable and engaged community from day one. Stakers get access to exclusive content, behind-the-scenes drops, and other VIP benefits, creating a self-reinforcing ecosystem of creators and their most dedicated fans. History suggests that during major technological shifts, the projects providing tangible tools for real problems tend to outperform. While the macro narrative is focused on the giants building the infrastructure, the real opportunity may lie in the application-layer protocols positioned to use it. If Ark’s prediction of a prolonged CapEx surge proves correct, SUBBD Token ($SUBBD) is building the exact kind of platform that stands to benefit directly from the explosion in AI accessibility. Buy $SUBBD here. Disclaimer: This article does not constitute financial advice. The cryptocurrency market is highly volatile, and you should always conduct your own research before investing.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57925463,
    "published": 1770800422000,
    "title": "These Three Catalysts Could Spark Bitcoin’s Next Rally, According To Wintermute",
    "body": "Crypto market maker Wintermute published a detailed market update on Tuesday via X (previously Twitter), offering a comprehensive breakdown of Bitcoin’s (BTC) recent collapse, who was behind the selling pressure, and what conditions must change for a meaningful recovery to take hold. Wintermute Details Brutal Bitcoin Crash The firm described the past week as exceptionally severe for Bitcoin. Prices fell below $80,000 for the first time since April 2025 and continued sliding to around $60,000 before stabilizing in the low $70,000 range by the weekend. According to Wintermute, the decline erased all of Bitcoin’s gains that followed Donald Trump’s election victory in November 2024, accompanied by widespread liquidations. Related Reading: Bernstein Calls Bitcoin Crash A ‘Crisis Of Confidence,’ Maintains $150,000 Target More than $2.7 billion in leveraged positions were wiped out as months of range‑bound trading encouraged excessive leverage that ultimately unraveled. Wintermute also pointed to the growing influence of Bitcoin exchange‑traded funds (ETFs) on price action, noting that BlackRock’s IBIT ETF alone saw more than $10 billion in notional trading volume on Thursday. Wintermute identified three major catalysts that struck the market at the same time. The first was the January 30 nomination of Kevin Warsh as Federal Reserve (Fed) Chair, which altered expectations around monetary policy. The second was a wave of disappointing earnings from large technology firms, highlighted by Microsoft shares dropping 10%. The third was a dramatic reversal in precious metals, where silver plunged 40% in just three days after briefly reaching $121. The Key Conditions For BTC’s Next Recovery Data from spot markets suggest that selling pressure was structural rather than isolated. The Coinbase premium remained in negative territory throughout the decline, a pattern that has persisted since December and signals sustained selling by US investors. Wintermute said its internal over‑the‑counter (OTC) flow data confirmed that US counterparties were heavy sellers throughout the week, a trend that was reinforced by ongoing ETF redemptions. Institutional demand, which had supported prices earlier in the cycle, has largely faded. Since November, spot Bitcoin ETFs have recorded approximately $6.2 billion in cumulative net outflows, representing the longest continuous stretch of redemptions since these products launched. Wintermute explained that when ETF sponsors are forced to sell spot Bitcoin into falling markets, it creates a negative feedback loop that amplifies downside pressure. The firm also highlighted growing fragility in derivatives markets. IBIT and Deribit together now account for half of the crypto options market. Wintermute said the sharp sell‑off reflected investor complacency after periods of low volatility and sideways trading, which left positioning vulnerable once prices began to move. Related Reading: Strategy Expands Bitcoin Holdings With $90M Purchase, Bitmine Follows With ETH Beyond crypto‑specific factors, Wintermute argued that the broader investment landscape has been dominated by artificial intelligence. The firm pointed to a viral chart showing Bitcoin’s performance closely mirroring software stocks in the S&P 500. According to Wintermute, the more important takeaway is that AI has been absorbing a disproportionate share of global capital, often at the expense of other asset classes, including crypto. Looking ahead, Wintermute expects a period of uneven and volatile price discovery. The firm said it is difficult to envision a sustained rally unless several conditions align: the Coinbase premium turning positive, ETF flows reversing back into inflows, and basis rates in derivatives markets stabilizing. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin chart|Bitcoin news|bitcoin price|bitcoin technical analysis|btc|BTC news|btc price|BTCUSDT|crypto|crypto market|crypto news|cryptocurrency|Wintermute",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57925146,
    "published": 1770799747000,
    "title": "MrBeast's finance bet could become the new generation's Schwab, Robinhood, Tom Lee says",
    "body": "The BitMine chairman said at Hong Kong Consensus 2026 that MrBeast acquiring neobank Step could win over a new generation of investors to crypto.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Thomas Lee|Consensus Hong Kong 2026|Bitmine|Bitcoin News|Ethereum News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57924399,
    "published": 1770798182000,
    "title": "SUBBD Token’s AI Ambition: A Potential Revolution for the $191B Creator Economy?",
    "body": "What to Know: The creator economy is plagued by challenges from centralized platforms, including fees as high as 70% and the risk of de-platforming. SUBBD Token aims to solve these issues by combining Web3’s decentralized ownership with integrated AI content creation tools. Core features like an AI Personal Assistant, AI Voice Cloning, and token-gated content give creators more control and revenue. The project’s presale shows strong early momentum, raising over $1.47 million and offering a 20% APY staking incentive to early backers. The digital content landscape is in the middle of a tectonic shift. What started as a niche hobby has ballooned into an $191B creator economy, an industry Goldman Sachs projected will approach half a trillion dollars by 2027. Yet, the very platforms that enabled this growth (YouTube, Twitch, Patreon) are now seen by many creators as restrictive, centralized gatekeepers. The issues are well-documented: steep platform fees that can slash earnings by up to 70%, opaque algorithms that dictate reach, and the ever-present threat of arbitrary demonetization. This friction has created a power vacuum. At the same time, a second revolution is underway: generative AI. Tools that create text, images, and even video aren’t science fiction anymore; they’re becoming integral to the creative process. For creators, this presents both a massive opportunity and a challenge, how do you integrate these powerful but fragmented AI tools into a workflow that also secures your earnings and digital sovereignty? This is the critical intersection where Web3 and AI are poised to offer a new path forward. The market is signaling a clear demand for a solution that returns power, control, and revenue back to creators themselves. It’s a complex problem requiring a multifaceted solution. Enter SUBBD Token ($SUBBD), an Ethereum-based project positioning itself as a direct answer to this industry-wide challenge. It’s merging the transparent, decentralized architecture of Web3 with a suite of integrated, cutting-edge AI tools. The project’s thesis is simple but potent: empower creators to keep more of their earnings, automate workflows, and engage with their communities without fear of a central authority changing the rules. Sound familiar? It’s a fundamental rethinking of the creator-platform relationship. Read more about SUBBD Token here. Beyond the Algorithm: How SUBBD Integrates AI With Web3 Ownership What most coverage of the creator economy misses is that the problem isn’t just about fees; it’s about workflow and control. SUBBD Token’s design targets this directly by embedding AI into its core infrastructure. The platform isn’t just a crypto payment rail, it’s a production studio. Features like an AI Personal Assistant are designed to automate fan interactions and community management, saving creators countless hours. Plus, its AI Voice Cloning and AI Influencer Creation tools tap into one of the most futuristic and rapidly growing segments of the market. This matters because it allows creators to scale their presence in ways previously unimaginable, creating new forms of content and engagement without diluting their brand. The second-order effect is the potential for entirely new revenue streams built around AI-generated, exclusive content. This is all underpinned by a Web3 foundation. By using token-gated access for exclusive content, creators can cultivate and monetize their communities directly. Subscriptions, pay-per-view (PPV) content, and digital collectibles become peer-to-peer transactions, not platform-brokered arrangements. This structure fundamentally disintermediates the legacy platforms, shifting the economic power dynamic decisively back in favor of the individual. Explore the SUBBD Token presale here. Presale Momentum Signals Strong Demand for Creator-First Solutions The market appears to be responding to this creator-centric vision. According to the project’s official site, the SUBBD Token presale has already attracted significant early-stage capital, raising over $1.47M. With tokens currently priced at $0.057495, the momentum points to a strong appetite for solutions that address the creator economy’s deepest pain points. Beyond the capital raised, the project’s tokenomics offer a glimpse into its strategy for long-term community building. Early supporters are incentivized through a staking program that offers a fixed 20% APY during the first year. It’s a smart mechanism designed not only to reward early belief but also to reduce initial sell pressure and foster a stable ecosystem from launch. Stakers also gain access to exclusive content and other platform benefits, creating a utility-driven feedback loop. The risk, as with any emerging crypto project, lies in execution and user adoption. Building a platform that can rival the user experience of Web2 giants is a monumental task. But can it actually deliver? The strong presale performance indicates that both creators and crypto-savvy users are actively seeking alternatives and are willing to invest in projects that promise a fairer, more transparent digital future. The data suggests the demand is real. Buy $SUBBD here. This article is for informational purposes only and should not be considered financial advice. All investments, especially in presale crypto assets, carry significant risk.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57924338,
    "published": 1770797577000,
    "title": "Spark’s new lending suite tests institutional appetite for onchain stablecoins",
    "body": "Spark is rolling out Spark Prime and Spark Institutional Lending, aiming to turn its DeFi stablecoin stack into institutional margin and credit lines.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57923993,
    "published": 1770797296000,
    "title": "As Meme Coin Dynasties Shift, Could Maxi Doge Become the New King in 2026?",
    "body": "What to Know: The meme coin market is evolving, rewarding projects with strong cultural identities and engaged communities over simple humorous concepts. Maxi Doge is building a community around a ‘Leverage King Culture,’ targeting high-conviction traders with features like trading competitions. The project’s presale shows significant momentum, having raised over $4.5M and attracting whale investments totaling $628K. History suggests that each crypto cycle crowns a new meme coin leader, and Maxi Doge’s unique positioning makes it a contender for 2026. The crypto market is in a state of tense but calculated volatility. Bitcoin is hovering below its all-time high, consolidating after a period of intense ETF-driven inflows, while Ethereum tackles the complexities of post-Dencun scaling. Yet, beneath the surface of these blue-chip movements, a familiar, chaotic energy is cooking up in the meme coin sector. The reign of Dogecoin, the original meme king, isn’t undisputed anymore. Every cycle, new challengers emerge, capturing the market’s imagination not just with humor, but with potent cultural narratives. But here’s what most coverage misses: the formula for a ‘meme king’ has evolved. A cute animal just isn’t enough anymore. To achieve dominance in 2026 and beyond, a token needs a fanatical, tribe-like community, a distinct cultural identity, and a way to sustain momentum beyond the initial hype. The market is saturated with fleeting jokes, but it starves for projects with an actual ethos. This is the environment where a new contender, Maxi Doge ($MAXI) , is building its foundation by fusing the high-octane world of leverage trading with the viral appeal of gym-bro culture. It’s a surprisingly potent combination. While Dogecoin represents passive, friendly fun, Maxi Doge embodies the aggressive, disciplined grind of a bull market trader, a narrative that resonates deeply with a generation of retail investors who see the market as a competitive sport. Learn more about Maxi Doge. From Mascot to Movement: The Power of a Trading Culture A meme coin’s longevity is directly tied to its ability to build a self-sustaining ecosystem. Maxi Doge approaches this not with complex DeFi mechanics, but by leaning into a powerful subculture: high-leverage trading. Its tagline, ‘Never skip leg-day, never skip a pump,’ isn’t just a catchy phrase; it’s a mission statement for a very specific demographic. And that’s the point, this isn’t for everyone. It targets traders who thrive on high stakes and see outsized returns as a result of conviction and effort.This culture is baked directly into its utility. The project plans to host Holder-Only Trading Competitions, complete with leaderboards and rewards for traders who generate the highest ROI. This gamified approach transforms passive holding into active participation, creating a colosseum for talent and fostering a sticky community where members share strategies and celebrate wins. The second-order effect is powerful: it creates a self-perpetuating hype loop where the token becomes the symbol of a successful trading tribe. A treasury, the Maxi Fund, is also being established to fund liquidity, partnerships with futures platforms, and meme-first marketing campaigns, ensuring the project has the capital to dominate social feeds and charts. Staking rewards, distributed automatically from a dedicated pool, provide an incentive for long-term alignment. Get your $MAXI today. Smart Money Signals a Potential Breakout A strong narrative is essential, but can it actually deliver? The Maxi Doge presale is showing signs that it has the raw power to back it up. The project has already pulled in a formidable $4.5M, with its $MAXI token currently priced at $0.0002803. Raising over $4.5 million in an early funding stage suggests a level of interest that transcends typical meme coin speculation. Frankly, it points to a belief in the project’s unique cultural positioning. The risk here, of course, is the inherent volatility of any meme-driven asset. The very high-leverage culture Maxi Doge champions is synonymous with high risk. However, on-chain data reveals that it’s not just small-time traders taking a position. A look at Etherscan records shows two whale wallets have already snapped up a combined $628K in tokens. The largest single transaction, worth a staggering $314K , occurred on October 11, 2025. This kind of early, concentrated buying from high-net-worth wallets is often a leading indicator. Smart money isn’t chasing a joke; it’s investing in a cultural narrative with the potential for explosive growth. It’s a bet that in the next bull cycle, the crown won’t go to the funniest dog, but the strongest one. Buy your $MAXI here. Disclaimer: This article does not constitute financial advice. All investments, especially in speculative assets like meme coins, carry significant risk.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57923899,
    "published": 1770796808000,
    "title": "Bitcoin price drops 3% as analyst warns bulls lack ‘momentum’ to flip $69K",
    "body": "Bitcoin analysis warned the $69,000 mark may end up as long-term resistance again, thanks to its significance in BTC price history.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57923757,
    "published": 1770796752000,
    "title": "BNB Price Prediction: Bulls Defend $600 as Next Major Leg Up Looms",
    "body": "What to Know: BNB is showing impressive strength by holding the $600 support level, hinting at an accumulation phase before its next leg up. A breakout above $630 could pave the way for BNB to challenge its all-time high near $700, backed by solid ecosystem fundamentals. The main risk to this bullish outlook is a drop below $580 support, which could trigger a much deeper correction. At the same time, emerging Layer 3 projects like LiquidChain are capturing attention by tackling DeFi’s persistent liquidity fragmentation problem. BNB is holding a critical line in the sand at $600. While the broader crypto market treads water, Bitcoin trading sideways, altcoins flashing mixed signals, Binance Coin ($BNB) has carved out a solid floor. This resilience isn’t just a number on a chart; it’s a powerful signal of underlying strength in the Binance ecosystem, suggesting a period of accumulation before a potential run at all-time highs. And that’s a big deal, because BNB’s performance is often a bellwether for the entire altcoin market and the DeFi world it powers. Everyone’s waiting for a catalyst, a macro shift from the Fed, perhaps, or a fresh wave of institutional cash, but in the meantime, analysts are glued to BNB’s technicals. Its consolidation above the 50-day moving average points to sustained buyer interest. So, the question isn’t if BNB can hold $600. It’s what will it take to propel it toward the $700 barrier? As savvy traders position themselves for that next move, a parallel trend is emerging: capital is quietly flowing into the next generation of infrastructure projects. LiquidChain ($LIQUID) is the most prominent name in this respect. Read more about $LIQUID here. A Technical and Fundamental Path to $700 From a technical standpoint, BNB’s price structure looks compelling for bulls. The $590-$600 zone, once a stubborn ceiling, has convincingly flipped into solid support. A daily close above the immediate resistance at $625 would likely open the door for a swift run toward the $690-$700 range, putting its previous all-time high within striking distance. But what most market commentary misses is the on-chain story. Data shows the supply of BNB on exchanges continues to dwindle, a classic sign of accumulation as holders move tokens into self-custody or staking, which naturally reduces selling pressure. The fundamental narrative remains robust. The Binance Launchpad and Launchpool continue to be primary venues for high-profile token launches, driving consistent demand for BNB. The second-order effect is a self-reinforcing ecosystem where new projects bring in new users, who in turn need BNB to participate, further strengthening the token’s utility. Bull Case: A clean break above $630, driven by positive market sentiment or a big ecosystem announcement, could send BNB toward $725+ by Q3’s end. Some analysts, like those at Coinpedia, are even calling for a potential run to $1,000 in a sustained bull market. Base Case: BNB chops around in the $580-$650 range for a few more weeks, building a base for a breakout later in the year. Bear Case: If the $580 support floor gives way, a correction toward the $520-$530 zone is likely. That would invalidate the current bullish setup and probably signal a wider market downturn. $LIQUID is available here. While BNB Consolidates, LiquidChain Turns Heads While BNB offers a relatively stable large-cap opportunity, some investors are rotating a portion of their capital into higher-risk, higher-reward presales. They’re seeking exponential growth by targeting next-generation infrastructure before it hits the mainstream. That’s where projects like LiquidChain ($LIQUID) come into play. So what is LiquidChain? It’s positioning itself as a Layer 3 protocol built to solve one of DeFi’s oldest headaches: fragmented liquidity. Think about the walled-off value on Bitcoin, Ethereum, and Solana. Instead of forcing users through clunky bridges and risky wrapped assets, LiquidChain wants to create a single, unified environment to access it all. For developers, the pitch is simple: deploy an app once and tap into the liquidity and users of all three giants. The project is already gaining traction in its presale. So far, early backers have poured in over $535K, with the $LIQUID token priced at just $0.0136. Frankly, the appeal is its moonshot goal of merging the three largest crypto economies into one fluid market. But can it deliver? Investing in a presale is a high-stakes game. The technology is unproven, regulations are a moving target, and the market can turn on a dime. It’s a speculative bet on a team’s ability to pull off a very complex vision. Buy $LIQUID here. This article is for informational purposes only and should not be considered financial advice. All investments carry risks, and readers should conduct their own thorough research before making any decisions.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57923483,
    "published": 1770796063000,
    "title": "Bitcoin Price Prediction: Why Analysts See a Drop to $55,000 as ETF Outflows Continue",
    "body": "What to Know: Bitcoin faces significant downward pressure, with analysts targeting the $55,000–$58,000 range due to sustained ETF outflows. A technical breakdown below the 50-day moving average and a hawkish macro environment support the bearish case. To invalidate the bearish trend, Bitcoin must reclaim $68,000 and see ETF inflows turn positive again. As Bitcoin struggles, capital is rotating to Layer 2 solutions like Bitcoin Hyper, which aim to solve its core scalability problems. Bitcoin’s at a crossroads. After weeks of sideways consolidation, it’s showing real signs of weakness and struggling to hold the crucial $65,000 support level. The initial euphoria from the spot ETF approvals? Gone. It’s been replaced by a steady drumbeat of net outflows and a hawkish macroeconomic backdrop. This isn’t just a minor dip; it’s a gut-check for the entire bull market. The data tells a clear story: institutional demand is cooling. U.S. spot Bitcoin ETFs have recorded persistent net outflows (over $1B in just three days), draining hundreds of millions from the market and putting sustained selling pressure on the price. That’s a huge problem, because the ETF narrative (the primary driver of the Q1 rally) is now working in reverse. With that engine sputtering, Bitcoin is vulnerable to technical breakdowns. Analysts are now eyeing key support zones, with some models pointing toward a potential slide to the $55K–$58K range if this keeps up. We’re also seeing a market-wide deleveraging event, a fancy way of saying over-leveraged longs are getting flushed out. As Bitcoin weathers this storm, some capital is starting to rotate, seeking alpha in projects designed to solve the very network congestion issues plaguing the main chain. Think emerging Layer 2 presales like Bitcoin Hyper ($HYPER) . Read more about $HYPER here. Bitcoin’s Path to $55K Looks Increasingly Plausible On the charts, Bitcoin’s setup is looking increasingly shaky. The price is now trading below its 50-day moving average, a classic bearish signal. While immediate support is around $64.5K, a clean break below could open the floodgates for a move toward the 100-day moving average, which sits near the $60K mark. According to analysis from 10x Research, a failure to hold that zone could trigger a much deeper correction toward the $52K–$55K region, a level we haven’t seen since February. This technical weakness is compounded by serious fundamental headwinds. But what most coverage misses is that this isn’t just profit-taking. It’s a direct reaction to a ‘higher for longer’ interest rate world where boring old government bonds are suddenly competing with crypto for capital. Smart money is watching the Fed closely, and any delay in rate cuts could pour more cold water on the market. Bear Case: A daily close below $64K validates the bearish trend, with $58,000 as the next logical target. A major risk-off event in traditional markets could easily accelerate a drop to $55K or lower. Base Case: Bitcoin chops between $64K and $67K for a few more weeks, absorbing ETF selling while long-term holders quietly accumulate. Bullish Invalidation: To kill the bearish thesis, Bitcoin needs to powerfully reclaim the $68K level, supported by at least three straight days of positive ETF inflows. $HYPER is available here. As Bitcoin Stalls, Capital Rotates to High-Speed Layer 2s Ironically, Bitcoin’s stagnation, driven by its own limitations in speed and programmability, is creating the perfect narrative for its own evolution. Every time a user gets hit with high fees or slow confirmations, the case for scalable Layer 2 solutions gets stronger. This has created a fertile ground for projects aiming to bring DeFi, NFTs, and high-speed transactions to the world’s most secure blockchain. It’s no surprise that investors looking for higher-risk, higher-reward plays are digging into this infrastructure build-out. One project capturing attention is Bitcoin Hyper ($HYPER) . It’s aiming to become the first Bitcoin Layer 2 that integrates the Solana Virtual Machine (SVM), a technology famous for its parallel processing and raw speed. The goal is nothing short of ambitious: deliver performance faster than Solana itself, all while settling on the Bitcoin network. The project’s presale has already drawn significant capital, raising $31.3M with tokens currently priced at $0.0136754. On-chain data suggests some big players are getting positioned. A look at Etherscan reveals that a couple of whale wallets have already scooped up $1m+ in tokens, with the largest single purchase of $500K recorded on January 15, 2026. But it’s not without risk. Presales are highly speculative, the L2 space is getting crowded, and both regulatory and technical hurdles are very real. Frankly, projects like Bitcoin Hyper are a high-risk, high-reward bet on the future of the Bitcoin ecosystem. For a deeper analysis, research Bitcoin Hyper yourself. Get your $HYPER today. This article is for informational purposes only and should not be considered financial advice. The cryptocurrency market is highly volatile, and readers should conduct their own independent research before making any investment decisions.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57922187,
    "published": 1770793253000,
    "title": "Bitcoin Drop Wipes Billions From Recent Buyers: New Whale Cost Basis Falls Toward $90K",
    "body": "Bitcoin is attempting to reclaim the $70,000 level after weeks of volatility. Yet repeated failures to hold that threshold with confirmation suggest that demand remains fragile. Each push above this psychological barrier has been met with renewed selling pressure. Reinforcing the view that the market is still navigating a corrective phase rather than establishing a sustained recovery. Sentiment remains cautious as liquidity conditions tighten and traders look for clearer signs of stabilization. Related Reading: Ethereum Supply on Exchanges Mirrors 2016 Levels: What Happens Next? Recent data shared by top on-chain analyst Maartunn highlights a notable shift among large holders. According to the analysis, many whales who entered the market near the $96,000 region are now sitting on significant unrealized losses following the subsequent price decline. After briefly testing those higher levels, Bitcoin reversed sharply, leaving late-cycle entrants exposed to downside pressure. This dynamic suggests that some large investors may be reassessing risk, either reducing exposure or repositioning portfolios amid uncertain macro and crypto-specific conditions. Such behavior often contributes to heightened volatility, particularly when leveraged positions unwind. Whale Capitulation Signals Market Redistribution Phase Recent data shared by on-chain analyst Maartunn highlights a sharp wave of realized losses among large Bitcoin holders, pointing to an evolving market structure rather than a static downturn. According to the figures, realized losses reached approximately $944 million on Feb. 3, $431 million on Feb. 4, $1.46 billion on Feb. 5, and $915 million on Feb. 6. These numbers reflect significant selling activity from investors who accumulated BTC near higher price levels and are now exiting positions under pressure. Such realized losses typically indicate capitulation among late-cycle entrants. When whales sell at a loss, it often means that conviction has weakened or that risk management considerations are taking priority. However, this process also implies redistribution. Coins do not disappear; they transfer from weaker hands to buyers willing to absorb supply at lower prices. Maartunn notes that the estimated cost basis for the newest cohort of large holders is now around $90,000. This suggests that a substantial portion of recent accumulation occurred near that level, creating a potential overhead resistance zone if the price attempts to recover. Markets often evolve through these phases of redistribution. While short-term sentiment may remain fragile, shifts in cost basis and ownership structure can eventually lay the groundwork for stabilization and future trend development. Related Reading: Ethereum Crash Below $2,000 Triggers Record Token Movement: Hinting At Capitulation Bitcoin Price Structure Signals Continued Distribution Phase Bitcoin’s recent price structure reflects a market still dominated by distribution pressure rather than sustained demand recovery. After failing multiple times to consolidate above the $90K–$100K region, BTC entered a persistent downtrend characterized by lower highs and increasingly aggressive selloffs. The latest decline toward the $60K–$70K zone came with a sharp expansion in volume, typically associated with forced liquidations, panic exits, or large portfolio reallocations. From a technical perspective, price now trades clearly below the major moving averages shown on the chart, all of which are trending downward. This configuration usually signals a mature corrective phase rather than a temporary pullback. The inability to reclaim those averages quickly suggests weak spot demand and continued caution among institutional participants. Related Reading: Binance SAFU Fund Adds 3,600 Bitcoin ($233M) As Market Faces Pressure The $60K–$65K region is emerging as a critical support cluster. A sustained hold above this range could stabilize sentiment and allow consolidation. However, failure to maintain this zone would likely expose deeper liquidity pockets below, potentially accelerating volatility. Short term, price action appears reactive rather than directional. Until volume stabilizes and BTC reclaims key trend indicators, rallies may remain corrective. Market structure currently reflects redistribution rather than confirmed accumulation, keeping downside risks structurally elevated. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|Bitcoin New Whales|Bitcoin news|bitcoin price|Bitcoin whales|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57922157,
    "published": 1770793135000,
    "title": "Bithumb’s Bitcoin Blunder Puts Burden on Users as Legal Case Favors Civil Recovery",
    "body": "Legal experts say civil claims offer Bithumb the clearest route to recovering Bitcoin mistakenly distributed in a $43 billion error.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57922483,
    "published": 1770792603000,
    "title": "South Koreans Bail on Crypto as Retail Traders Bemoan Losses",
    "body": "On a South Korean social-media platform last month, an anonymous trader vented their frustration about the crypto crash that began in October last year.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57921361,
    "published": 1770791057000,
    "title": "Crypto Super PAC to spend $5M on Barry Moore’s Senate bid: Report",
    "body": "Crypto political action committee Fairshake spent roughly $130 million during the 2024 US elections to support pro-crypto candidates.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 57920617,
    "published": 1770789659000,
    "title": "Bitcoin Not “Pumpable” Right Now, Says CryptoQuant Founder: Here’s Why",
    "body": "The founder of CryptoQuant has explained that Bitcoin is not “pumpable” right now based on the divergence in the Market Cap and Realized Cap. Bitcoin Market Cap Fell Even As Realized Cap Grew In a new post on X, CryptoQuant founder Ki Young Ju has talked about the difference in growth that the BTC Market Cap and Realized Cap have witnessed over the past year. The Market Cap here is just the total value of the cryptocurrency’s supply at the current spot price. The Realized Cap is also a model to calculate BTC’s total valuation, but it doesn’t take such a simple approach. This on-chain capitalization model assumes that the ‘real’ value of any coin in circulation is equal to the spot price at which it was last transacted on the blockchain. Related Reading: Ethereum Drops Under MVRV Band That Marked Last 3 Bottoms In short, what the Realized Cap signifies is the amount that the Bitcoin investors as a whole have put into the cryptocurrency. In contrast, the Market Cap represents the value that they are holding in the present. Generally, changes in the former, which can be thought of as capital inflows/outflows, result in changes in the latter. Below is a chart that tracks how the Market Cap is reacting to fluctuations in the Realized Cap. Looks like the value of the metric has been negative in recent weeks | Source: @ki_young_ju on X As displayed in the graph, the growth rate difference between the Bitcoin Market Cap and Realized Cap was positive in mid-2025, suggesting that the Market Cap was going up faster than the Realized Cap. This changed in the last quarter of the year, however, with the indicator dropping into the negative zone as the market observed a crash. 2026 has only seen the metric drop deeper as the price decline in the cryptocurrency has continued. “Bitcoin is not pumpable right now,” noted Young Ju. The CryptoQuant founder has pointed out the contrast in market dynamics between 2024 and 2025 to showcase his point. In 2024, a $10 billion increase in the Realized Cap was enough to cause a $26 billion jump in the Market Cap. Over the course of 2025, a whopping $308 billion in capital flowed into the asset, yet the Market Cap actually fell by $98 billion. “Selling pressure is too heavy for any multiplier effect,” explained the analyst. Related Reading: Bitcoin Sentiment Worst Since 2022 Bear As Price Crash Continues In some other news, New Whales on the Bitcoin network have been capitulating recently, as CryptoQuant community analyst Maartunn has pointed out in an X post. “New Whales” are the investors who entered the market within the past 155 days and are holding more than 1,000 BTC in their balance. During the recent price drawdown, this cohort took massive losses, including a loss-taking spike of $1.46 billion on February 5th. BTC Price At the time of writing, Bitcoin is floating around $68,500, down over 12% in the last seven days. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin market cap|Bitcoin Realized Cap|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57920615,
    "published": 1770789600000,
    "title": "Spark looks to build a safe bridge between onchain capital and TradFi",
    "body": "Spark is opening access to its $9 billion stablecoin liquidity pool for hedge funds and other institutions to bridge onchain capital with off-chain credit markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|DeFi|Institutional DeFi|Crypto Lending|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57919515,
    "published": 1770786798000,
    "title": "Hong Kong working to allow perpetual contracts, chief regulator says",
    "body": "Hong Kong's Securities and Futures Commission will publish a \"high-level framework\" allowing perpetual contracts, SFC CEO Julia Leung said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Hong Kong|Consensus Hong Kong 2026|Securities and Futures Commission|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      }
    ]
  },
  {
    "id": 57919400,
    "published": 1770786482000,
    "title": "Solana (SOL) Under Pressure As Downtrend Looks Ready To Resume",
    "body": "Solana failed to settle above $90 and trimmed some gains. SOL price is now facing hurdles near $88 and might decline again below $82. SOL price started a decent recovery wave above $78 and $82 against the US Dollar. The price is now trading below $85 and the 100-hourly simple moving average. There is a key bearish trend line forming with resistance at $85 on the hourly chart of the SOL/USD pair (data source from Kraken). The price could continue to move up if it clears $85 and $90. Solana Price Faces Resistance Solana price remained stable and started a decent recovery wave above $72, like Bitcoin and Ethereum . SOL was able to climb above the $80 level. There was a move above the 50% Fib retracement level of the downward move from the $106 swing high to the $68 low. However, the bears are active near $90. The price is now moving lower below $88. There is also a key bearish trend line forming with resistance at $85 on the hourly chart of the SOL/USD pair. Solana is now trading below $85 and the 100-hourly simple moving average. On the upside, immediate resistance is near the $85 level and the trend line. The next major resistance is near the $92 level and the 61.8% Fib retracement level of the downward move from the $106 swing high to the $68 low. The main resistance could be $96. A successful close above the $96 resistance zone could set the pace for another steady increase. The next key resistance is $105. Any more gains might send the price toward the $112 level. Downside Continuation In SOL? If SOL fails to rise above the $85 resistance, it could continue to move down. Initial support on the downside is near the $82 zone. The first major support is near the $80 level. A break below the $80 level might send the price toward the $75 support zone. If there is a close below the $75 support, the price could decline toward the $70 zone in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is gaining pace in the bearish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is below the 50 level. Major Support Levels – $82 and $75. Major Resistance Levels – $85 and $92.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Technical analysis|Sol|Solana|solbtc|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57936400,
    "published": 1770831260000,
    "title": "JPMorgan bullish on crypto for rest of year as institutional flows set to drive recovery",
    "body": "After bitcoin fell below its estimated production cost, the bank said stronger fundamentals and rising institutional inflows could lift crypto in 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Institutional Adoption|JPMorgan Chase|Gold|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57936381,
    "published": 1770831122000,
    "title": "Susquehanna-Backed Crypto Lender BlockFills Suspends Withdrawals as Bitcoin Sinks",
    "body": "Crypto firm BlockFills said it has temporarily halted deposits and withdrawals on its platform amid falling crypto prices and volatility.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57936769,
    "published": 1770832028000,
    "title": "BlackRock enters DeFi, taps Uniswap for institutional token trading",
    "body": "BlackRock is bringing its $2.1 billion tokenized Treasury fund to Uniswap, expanding institutional access to DeFi and deepening Wall Street’s push into onchain finance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 53,
        "NAME": "UNI",
        "CATEGORY": "UNI"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57937187,
    "published": 1770833205000,
    "title": "Gen Z 'nihilism' is fueling a $100 trillion crypto derivatives boom in response to a broken system",
    "body": "A significant increase in housing costs makes home ownership unattainable for many Gen Z individuals, leading to financial nihilism, said CoinFund's David Pakman.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Consensus Hong Kong 2026|perpetual contracts|CoinFund|Gen Z|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57937065,
    "published": 1770832960000,
    "title": "'This Is Not Good for Crypto': Lawmakers Slam SEC Chair for Easing Industry Policing",
    "body": "As the crypto market hemorrhages value, scrutiny has increased on the impact of President Trump’s crypto dealings on investor confidence.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57936999,
    "published": 1770832818000,
    "title": "Here’s Why The XRP Price Has Been In A Consistent Downtrend Since 2025",
    "body": "On-chain data from Glassnode has unveiled the reason why the XRP price has been in a persistent downtrend since 2025. Notably, the XRP price crashed from its high above $3 last year and has been falling ever since. While many in the crypto space believed XRP could eventually reclaim the $3 level, the cryptocurrency has continued to struggle, shedding more gains each month amid broader market weakness and a shift in sentiment. Why The XRP Price Has Been Declining Since 2025 Glassnode has attributed XRP’s prolonged price correction since 2025 to a shift in investor behavior driven by weakening on-chain profitability and rising losses among holders. According to the data, XRP fell below the aggregate holder cost basis, which represents the average price at which current investors acquired their tokens. Related Reading: XRP Price To $1 Or $10? Analyst Warns Investors Of Possible Crash When a cryptocurrency trades below this level, a large portion of holders are technically underwater, meaning they are holding at a loss. This condition often leads to panic selling as investors attempt to limit further losses, increasing selling pressure on the asset and reinforcing the price downtrend. A key indicator supporting this view is the Spent Output Profit Ratio (SOPR), measured using a seven-day Exponential Moving Average (EMA). The SOPR tracks whether coins being moved or sold on the blockchain are being done so at a profit or a loss. Glassnode’s chart shows that XRP’s SOPR declined from about 1.6 in July 2025 to around 0.96 recently. Notably, a value above 1 indicates that holders are selling at a profit, while a value below that signals that coins are being sold at a loss. This sustained move below the neutral level suggests that most selling activity in XRP is now occurring at a loss rather than in profit-taking conditions. As a result, on-chain profitability for XRP holders has turned negative. Such an environment usually weakens investors’ confidence in a cryptocurrency and reduces the incentive to hold it, especially among short-term traders. Negative profitability can also discourage new capital inflows, as prospective buyers see limited signs of recovery or momentum, further contributing to price decline or stagnation. XRP Structure Mirrors Bearish 2022 Setup Interestingly, Glassnode noted that XRP’s current market structure closely resembles a period between September 2021 and May 2022. During that earlier phase, XRP’s SOPR also fell below 1 and remained there for a long time. Related Reading: XRP Bounces Hard After Capitulation — Relief Rally Or Another Bull Trap? The period was also marked by prolonged consolidation and low volatility following sharp declines, before the market eventually stabilized. This comparison suggests that XRP may be experiencing a similar structural phase in which losses dominate trading activity and recovery is delayed until selling pressure eases and sentiment moves back to positive territory. As of writing, the XRP price has declined even further, now trading under $1.4. CoinMarketCap data shows that the cryptocurrency has plummeted by more than 4.3% over the past 24 hours and by well over 46% year to date. Featured Image from Freepik, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|altcoin|CoinMarketCap|EMA|Exponential Moving Average|glassnode|Ripple|SOPR|Spent Output Profit Ratio|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57937562,
    "published": 1770834249000,
    "title": "UNI Rallies 10% As BlackRock Brings Treasury‑Backed BUIDL Token To Uniswap",
    "body": "Uniswap’s native token, UNI, posted a sharp gain on Wednesday after the world’s largest asset manager, BlackRock, announced plans to bring its Treasury‑backed digital fund, BUIDL, onto the decentralized finance (DeFi) platform. The move, which also includes BlackRock’s intention to purchase UNI tokens, fueled a strong rally in the token during the trading session. BUIDL Launch On Uniswap The development was detailed in a joint press release from Uniswap Labs and Securitize. The two companies revealed a strategic integration that will allow shares of the BlackRock USD Institutional Digital Liquidity Fund (BUIDL) to be traded using UniswapX technology. Through the integration of UniswapX with Securitize’s infrastructure, investors will be able to access market quotes and swap BUIDL directly with whitelisted participants around the clock, every day of the year. Related Reading: Ripple Wins Key UAE Bank Partnership To Support Digital Asset Infrastructure The companies described the move as an important step in bridging traditional financial products with decentralized trading systems. Robert Mitchnick, BlackRock’s Global Head of Digital Assets, characterized the collaboration as a meaningful development in the convergence of tokenized assets and decentralized finance. He said integrating BUIDL into Uniswap represents significant progress in enabling interoperability between tokenized US dollar yield funds and stablecoins. UNI Outperforms Sluggish Crypto Market Following the announcement, Uniswap climbed to a weekly high of $4.50 earlier on Wednesday. However, the upward momentum eased later in the session, with the token pulling back to around $3.68 at the time of writing. Related Reading: Strategy Unfazed By Bitcoin Crash, Michael Saylor Vows Quarterly Purchases Even with the retracement, UNI stood out as one of the few cryptocurrencies recording gains during the day, as Bitcoin (BTC) and the broader digital asset market continued to face bearish pressure. From a technical perspective, Uniswap investors will need to watch the $3.14 level, which has served as support since Friday of last week. On the upside, the $4.70 level may act as short‑term resistance if renewed buying interest pushes prices higher in the coming days. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|BlackRock|BlackRock BUIDL|BlackRock news|crypto market|crypto news|cryptocurrency|UNI|UNI news|UNI price|Uniswap|Uniswap (UNI)|Uniswap news|Uniswap Price|UNIUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 53,
        "NAME": "UNI",
        "CATEGORY": "UNI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57938288,
    "published": 1770835953000,
    "title": "U.S. DOJ hits Paxful for $4 million in case tied to illegal sex work, money laundering",
    "body": "The crypto platform's penalty was sharply reduced due to its ability to pay, according to U.S. authorities.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Paxful|U.S. Department of Justice|criminal activity|Money Laundering|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]