[
  {
    "id": 57796227,
    "published": 1770403497000,
    "title": "Crypto's eligibility for 401k retirement funds is under fire after brutal market rout wipes out $2 trillion",
    "body": "\"401ks exist to help people save for a secure retirement, not gamble on speculative assets,\" said an industry observer.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|CoinDesk Wealth|401(k)|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57796574,
    "published": 1770404431000,
    "title": "What Went Wrong With Crypto? A Postmortem",
    "body": "Crypto’s latest drawdown hit the majors in size: bitcoin fell about 8.1% over the past 24 hours and is down roughly 29.5% over the past 30 days, while Ether dropped about 9.4% on the day and about 41.4% over the past month; XRP was off about 10.3% in 24 hours and roughly 42.7% over 30 days, and Solana slid about 12.3% on the day and around 42.8% over the month. While many point to the nomination of Kevin Warsh as next US Federal Reserve chair, renowned macro analyst Alex Krüger argued on X on Friday that it is the cumulative effect of narrative fatigue, weakening marginal demand, and a macro regime wake-up call that hit after the market had already started to roll over. What Went Wrong For Crypto? Krüger framed the move as a momentum break that turned into a seller’s market. In his telling, the “10/10 slaughter” — a nod to the sharpness of the unwind, with a pointed aside about whether he’d “get sued” for mentioning Binance — was less a mystery than a pileup of factors that steadily drained risk appetite and then yanked away the last hope of a liquidity tailwind. Related Reading: Bitwise CIO Warns Market Is Facing A ‘Full-Bore’ Crypto Winter, Not A Pullback He pointed first to the hangover from Digital Asset Treasuries (DATs), and then to a reversal in flows tied to criminal networks. Krüger said “major flows reversed after the DoJ indictment of the Cambodian Prince Group last October,” describing it as a material shift in demand that the market may have been underappreciating while price was still holding up. What went wrong with crypto 1. 10/10 slaughter (will I get sued if I mention Binance?). 2. Digital Asset Treasuries (DATs) hangover. 3. Reversed flows from crime syndicates: major flows reversed after the DoJ indictment of the Cambodian Prince Group last October. 4. Quantum… — Alex Krüger (@krugermacro) February 6, 2026 Two other themes in his post leaned explicitly on fear and opportunity cost. Krüger flagged “quantum fears (real)” as a psychological overhang, and then argued that the AI boom has become a direct competitor for both capital and talent. He said the pivot isn’t subtle: “capital pivoting to AI,” “talent pivoting to AI,” and even “miners pivoting to AI,” all of which tighten the loop around crypto’s ability to reaccelerate. In parallel, he suggested the market’s global bid has narrowed. Krüger cited a “perception of Bitcoin as American,” adding that there are “few Chinese buyers,” a contrast with the participation he said had been “behind the metals uptrend in large numbers.” He also described a structural shift in who “owns” the trade. “The Swamp & Institutions taking over,” he wrote, arguing the market has moved from “Cypherpunk/Rebel tech to ETF tech.” In his framing, crypto used to be “for misfits & geniuses,” but now “it’s a line item in a 401k” — a change that, in his view, crowds out the volatility-driven momentum that historically pulled in OGs and retail. Other pressure points were more familiar: political risk around Trump association (“what happens once Democrats are back?”), “minimal innovation (since Hyperliquid),” and the brutal reflexivity of the Solana memecoin cycle — “Solana casino massacre (thank Pump Fun & the Memecoin Supercycle).” He paired that with a supply critique: “There are 29.91 million cryptocurrencies tracked by CoinMarketCap,” he wrote, warning that “almost every coin in the top 200 is grossly overvalued” alongside “never ending” launches that “pump then dump to oblivion where only insiders profit.” He even declared the “dead digital gold narrative” as another drag on marginal buyers. Related Reading: Crypto Isn’t Broken, It’s A US Liquidity Squeeze, Says Raoul Pal The mechanical result, Krüger said, was straightforward: “sellers dumping more aggressively than usual on every pump,” while “buyers not showing up to buy the dips as much any longer.” Then came what he framed as the macro trigger that hardened the selloff. “And then came the Warsh nomination (beating Hassett and Rieder), and the market suddenly became deeply aware that Warsh is a strong advocate of a small balance sheet: goodbye Quantitative Easing (QE) and Yield Curve Control (YCC) dreams, hello Quantitative Tightening (QT) fears. That is what happened.” Krüger stressed he was describing the past, not forecasting the next move, arguing the damage has already been done. Still, he noted that “volume, liquidations, implied volatility and options skew indicate that a local bottom is likely in.” In replies, the conversation turned toward what crypto might still be for in an AI-led cycle. A user said the rotation “makes sense,” but argued the bigger upside is in “agent stacks” that could eventually “manage crypto liquidity,” positioning crypto rails as infrastructure for machine-to-machine value transfer. Krüger largely agreed on the asymmetry. “I don’t know. I was hoping momentum. Momentum can do magic,” he wrote. “I’m very concerned about points #3 and #4. Saylor just started a new initiative on #4, maybe that helps. Reality is crypto can’t compete with AI. It’s impossible. But it could be used by AI. That’s high quality hopium right there. Agent-to-Agent payments would be better served on crypto rails.” At press time, BTC traded at $66,029. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|crypto|Crypto bear market|crypto news|Crypto Prices|Why Is Crypto Down",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57797024,
    "published": 1770405617000,
    "title": "Lots More With Charlie McElligott on This Week's SaaSpocalypse",
    "body": "A terrible few days for software, crypto, and more.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57796997,
    "published": 1770405552000,
    "title": "Coinbase's Crypto-Backed Loans Notch Record Liquidations Amid Bitcoin, Ethereum Plunge",
    "body": "Coinbase customers faced losses in fresh ways through the exchange’s crypto-backed lending product as Bitcoin and Ethereum tumbled this week.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57798146,
    "published": 1770409327000,
    "title": "AI platform founded by Crypto.com's Kris Marszalek launches AI agents",
    "body": "Proponents of AI agents say the new technology will simplify crypto trading and other financial activities for the average user.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57798033,
    "published": 1770408904000,
    "title": "Galaxy Digital shares jump 18% after company approves $200 million buyback",
    "body": "The repurchase plan follows a volatile earnings week and signals confidence in the firm’s balance sheet.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Galaxy Digital|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57798233,
    "published": 1770409826000,
    "title": "Bitcoin Realized Loss Nears $900 Million, Highest Since FTX Crash",
    "body": "On-chain data shows the Bitcoin Realized Loss has spiked to its highest level since November 2022 as investors have capitulated after the price crash. Bitcoin Realized Loss Has Hit A Value Of $889 Million In a new post on X, on-chain analytics firm Glassnode has talked about the latest trend in the Bitcoin Realized Loss. This indicator measures, as its name suggests, the total amount of loss that investors on the network are ‘realizing’ with their transactions. Related Reading: XRP Social Sentiment Still Bullish While Bitcoin Mood Sours This metric works by going through the transaction history of each coin being sold to see at what price it changed hands before this. If the previous selling price was greater than the latest spot price for any token, then its sale is considered to be resulting in some loss realization. The exact degree of loss involved in the transaction is equal to the difference between the two prices. The Realized Loss sums up this value for all loss transfers to find the total for the network. A counterpart indicator called the Realized Profit deals with the transactions of the opposite type (that is, those with a cost basis lower than the latest selling value). Now, here is the chart shared by Glassnode that shows the trend in the 7-day moving average (MA) of the Bitcoin Realized Loss over the last few years: As displayed in the above graph, the Bitcoin Realized Loss has witnessed a sharp spike recently, implying investors have participated in a notable amount of loss-taking. Something to note is that the version of the metric used by the analytics firm here is the “entity-adjusted” one, meaning that it only tracks transactions occurring between two different entities, rather than just two addresses. Glassnode defines an “entity” to be a cluster of addresses that it has determined to belong to the same owner. In the context of the Realized Loss, the entity-adjusted indicator filters out transactions occurring between the wallets of the same investor. These naturally never involve a true realization of loss (or profit), so removing them from the data provides a more accurate representation of the market. Applying for this filtration, the 7-day MA Realized Loss hit a peak value of $889 million on Wednesday. This is the highest single-day spike in the metric since November 2022, when the market crashed to the bear market bottom following the collapse of cryptocurrency exchange FTX. Related Reading: Social Media Now Talking Sub-$60,000 Bitcoin Prices As Fear Rises The latest investor capitulation has arrived as Bitcoin has been in freefall, with its price now breaking below the $70,000 level. It now remains to be seen whether the loss-taking will sustain or if investor panic will subside in the coming days. BTC Price Bitcoin has taken a blow of more than 21% over the past week that has taken its price to the $66,700 level. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin FTX Crash|Bitcoin Realized Loss|btc|BTCUSDT|FTX crash",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57798803,
    "published": 1770411600000,
    "title": "Crypto’s stress test hits balance sheets as Bitcoin, Ether collapse",
    "body": "Crypto’s downturn is rippling through treasuries, ETFs and mining infrastructure, exposing how digital asset volatility reshapes balance sheets and operations.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57799259,
    "published": 1770413197000,
    "title": "How Bitcoin’s Volatility Is Testing Crypto’s Appeal",
    "body": "Bitcoin’s volatile start to 2026 saw the world’s largest cryptocurrency tumble at one point to its lowest level in over a year, wiping out the gains it had made since Donald Trump’s return to the Oval Office.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57799008,
    "published": 1770412320000,
    "title": "Justin Bieber Paid $1.3 Million for a Bored Ape NFT. It's Now Worth $12K",
    "body": "Back when NFTs were hot, Justin Bieber dropped $1.3 million to join the Bored Ape Yacht Club. The Ethereum NFTs now start at just $12K.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|NFTs",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57799916,
    "published": 1770415236000,
    "title": "Analyst Who Predicted XRP’s 600% Rally Forecasts The Bottom And A Target Of $10",
    "body": "XRP’s current pullback has diverted attention away from short-term volatility and back toward the bigger picture on the chart. The cryptocurrency is now down by over 60% from its July all-time high, and the decline is showing signs of more downside. As the price continues to break below support levels, one analyst whose earlier outlook preceded a major XRP rally says the cryptocurrency may be approaching a bottom for another accumulation phase. Analyst Points To A New Accumulation Phase XRP’s recent price action has seen many analysts projecting a bottom where the decline might end. However, a technical analysis of XRP’s price action on the 2-week candlestick timeframe chart, which was posted on the social media platform X, frames the current XRP price action as an entry into an accumulation zone. Related Reading: XRP Price Falls Below $1.6: You Won’t Believe What Institutions Are Doing Amid The Crash According to the analysis, XRP has now corrected roughly 58% from its recent peak, placing it directly inside what he calls the first accumulation zone between $1.50 and $1.30. The outlook by Crypto Patel is that this area is not about catching an exact bottom but about building exposure gradually as the price stabilizes. Based on this, the analyst predicted that XRP’s decline will bottom somewhere between $1.5 and $1.3, and this is a great time to start buying slowly at these levels. However, Patel’s outlook also accounts for a deeper drawdown scenario. Should XRP lose the $1.30 region, then the next focus is in a secondary accumulation band between $0.90 and $0.70. Nonetheless, a move into that lower range would still not invalidate the bullish thesis. Instead, it would represent what he describes as the best long-term accumulation opportunity for maximum profits. The $10 Target Is Still In Play XRP’s current price action is a far stretch from reaching $10, and that target seems out of reach at the moment. However, despite adopting a near-term caution, many analysts have not changed their long-term projections. Related Reading: XRP’s 173-Day Theory: What Happens If This Historical Trend Plays Out Again Patel, for example, noted that his long-term target is $10. Although the $10 target remains the same, the analyst noted that buying at $3 or $2 is not ideal since there are opportunities for entries at $1.50-$1 during hard dips for much bigger returns. To support his confidence, Patel pointed back to his previous cycle call, where he shared an XRP setup around $0.50 during the last bear market. That setup preceded a rally to $3.66, delivering gains of over 600%. XRP’s price action in the past 24 hours is characterized by a crash from an intraday high of $1.44 to an intraday low of $1.14. The cryptocurrency is now back to trading at $1.30 at the time of writing, 670% away from reaching the $10 price target. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Accumulation Band|Crypto Patel|Ripple|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57800185,
    "published": 1770416237000,
    "title": "Expert Predicts Bitcoin Price Could Fall To $45,000 By End Of 2026",
    "body": "Bitcoin (BTC) has officially entered a new bear market after suffering a steep 50% decline from its all‑time high. The leading crypto fell as low as $60,000, marking its weakest level since October 2024 and intensifying debate over how much further prices could slide before the next long‑term bottom is reached. As markets search for direction, crypto market expert NoLimit has shared a detailed framework outlining when and where he believes Bitcoin could ultimately bottom in this cycle. Rather than focusing solely on price targets, NoLimit argues that time plays an equally important role in identifying major turning points in Bitcoin’s market cycles. Potential Bitcoin Low In Oct–Nov According to his analysis, past Bitcoin bear markets show a relatively consistent pattern when measured from all‑time highs to cycle lows. Following the first Halving cycle in 2012, Bitcoin reached its bottom after 406 days. Related Reading: Bitcoin Crash Exposes Colossal Corporate Losses — Here’s Who’s Most Impacted The second Halving cycle in 2016 saw a bottom after 363 days, while the third cycle following the 2020 Halving bottomed after 376 days. The current cycle, following the 2024 Halving, has not yet completed this process. Based on these historical timeframes, NoLimit believes there is a high statistical likelihood that Bitcoin’s next major capitulation point will occur between October and November 2026. What NUPL Data Suggests In his analysis, NoLimit also highlighted an institutional‑grade on‑chain indicator known as Net Unrealized Profit/Loss, or NUPL. Historically, when NUPL enters what is referred to as the “blue zone,” Bitcoin has reached generational lows. Related Reading: Analyst Who Predicted XRP’s 600% Rally Forecasts The Bottom And A Target Of $10 This signal successfully identified the bottom during the 2018 bear market, the COVID‑19 crash, and the 2022 market low. According to NoLimit, Bitcoin has not yet entered this zone in the current cycle and remains some distance away from it. Taking all factors into account, NoLimit said he would not be surprised to see Bitcoin trading between $45,000 and $50,000 by the end of 2026. He described that range as his ultimate bottom target. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|bitcoin|Bitcoin Bottom|Bitcoin news|bitcoin price|bitcoin technical analysis|btc|BTC news|btc price|BTCUSDT|crypto|crypto market|crypto news|cryptocurrency",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57801446,
    "published": 1770420603000,
    "title": "Solana Crashes Hard — And Big Money Isn’t In A Hurry To Save It",
    "body": "Solana has suffered a sharp sell-off that’s left its chart looking fragile, with price sliding straight into a key demand zone. Despite the drop, big money remains notably cautious, signaling that institutions may be waiting for clearer direction before stepping in. Solana’s Sharp Breakdown Leaves the Weekly Chart on Edge AltCoin Việt Nam noted that Solana has already suffered a sharp sell-off, a move that is clearly reflected on the weekly chart. Price dropped aggressively from the higher range and is now trading around the $90–93 zone. The bounce so far appears weak, and volume is not signaling strong participation from large buyers stepping in to defend the move. Related Reading: Solana Accumulation Narrative Strengthens With Big Institutions, A Rally Imminent? What stood out most in the update was the behavior of institutional players. Despite the lower prices, institutional ETFs have shown little interest in accumulating SOL in this zone. This contrasts sharply with earlier phases, when they were buying aggressively at much higher levels. Addressing questions from the community about whether institutions “knew” the crash was coming, AltCoin Việt Nam explained that this is not necessarily the case. Instead, institutional behavior simply differs from that of retail traders. Their decisions are driven more by trend structure, liquidity conditions, and capital flows than by attempts to predict exact price bottoms. Firstly, ETFs typically do not dollar-cost average in the same way retail investors do. When momentum is strong and inflows are active, they are willing to buy at higher prices to maintain exposure. However, once the trend breaks and volatility rises, waiting for clarity becomes more important than trying to catch the bottom. For institutions, entering at the right time with renewed momentum matters far more than buying at the lowest possible price. Finally, AltCoin Việt Nam highlighted that ETF accumulation is also dependent on capital inflows. Without fresh money entering the funds, there is little incentive or ability for them to add positions, even at discounted prices. For retail participants, the approach may differ. Short-term traders should not expect immediate institutional support, as large players currently have no urgency to step in. Step-Down Decline Brings SOL Into Key Demand Zone According to an update by BitGuru, Solana has been moving lower in a series of step-down declines, reflecting sustained bearish pressure. Price has now reached a key demand zone between $90 and $95, an area where buyers have previously stepped in to defend the market. Related Reading: Solana To Retest November Lows After $144 Rejection, But Analysts Remain Bullish BitGurun noted that selling pressure appears to be easing as SOL trades within this range, suggesting that the market is attempting to form a short-term base. If this demand zone continues to hold, BitGuru believes a relief move toward prior structural levels becomes increasingly likely. Such a move would represent a technical rebound rather than a full trend reversal. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Solana|AltCoin Việt Nam|Bitguru|ETFs|Sol|SOL news|SOL Price|Solana news|Solana Price|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57803888,
    "published": 1770429611000,
    "title": "Bitcoin Sentiment Worst Since 2022 Bear As Price Crash Continues",
    "body": "Data shows the Bitcoin Fear & Greed Index has continued to decline recently, with its value now hitting the lowest level since the 2022 bear market. Bitcoin Fear & Greed Index Is Deep Inside Extreme Fear Zone The “Fear & Greed Index” refers to an indicator created by Alternative that tracks the average sentiment present among traders in the Bitcoin and wider cryptocurrency markets. Related Reading: Bitcoin Realized Loss Nears $900 Million, Highest Since FTX Crash The index determines the trader mentality using the data of the following five factors: trading volume, volatility, market cap dominance, social media sentiment, and Google Trends. To represent the sentiment, it makes use of a numerical scale running from zero to hundred. When the value of the indicator is above 53, it means the investors as a whole share a sentiment of greed. On the other hand, the metric being under 47 suggests the dominance of fear. Naturally, the index lying between these two cutoffs implies a neutral mentality is shared by the majority. Besides these three main zones, there are also two ‘extreme’ regions called the extreme fear (25 and below) and extreme greed (above 75). After the recent market downturn, sentiment among cryptocurrency traders has deteriorated into the former of the two. Here is how the latest value of the Bitcoin Fear & Greed Index looks: As displayed above, the Bitcoin Fear & Greed Index has a value of 9 at the moment, which is a pretty low level. In fact, this level is so deep into extreme fear that this is the first time in the current cycle that the metric has reached it. Below is a chart that shows how the current level of extreme fear lines up against the indicator’s historical data. From the graph, it’s visible that the last time the Bitcoin Fear & Greed Index reached a value this low was back in June 2022, right in the middle of that year’s bear market. The latest drop in the metric to a single-digit value is a result of the price drawdown that BTC and other cryptocurrencies have faced since the last week of January. This decline in sentiment, however, may not be such a bad thing for the sector, if history is to go by. Often, an extremely fearful market facilitates bottom formations as underwater investors capitulate and resolute hands pick up their coins. During a bear market, however, the Fear & Greed Index is usually inside the zone for a notable duration before a bottom is reached. Related Reading: XRP Social Sentiment Still Bullish While Bitcoin Mood Sours If the recent shift in the sector reflects a transition to a bear market, then it only remains to be seen how long mood will be in extreme fear before relief arrives for Bitcoin and company. BTC Price At the time of writing, Bitcoin is floating around $67,100, down 19% over the last seven days. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin bear market|Bitcoin Extreme Fear|Bitcoin Fear & Greed Index|bitcoin sentiment|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57804363,
    "published": 1770431131000,
    "title": "BlackRock bitcoin ETF options errupt in crash: Hedge fund blowup or just market madness?",
    "body": "Options trading on BlackRock's spot bitcoin ETF, IBIT, surged to a record 2.33 million contracts on Thursday as bitcoin crashed.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|BlackRock|Bitcoin ETF|Bitcoin Options|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57804899,
    "published": 1770433223000,
    "title": "Dogecoin Drops Below $0.09 as Market Weakness Outweighs Musk Hype",
    "body": "The latest slide in Dogecoin (DOGE) is a reminder of how quickly sentiment can shift in a fragile crypto market. Once known for sharp rallies driven by social media buzz, the meme coin is now struggling to find a footing amid broader selling pressure that overshadows brief bursts of optimism. Related Reading: 5 Red Months In A Row: What’s Going On With Bitcoin And The Crypto Market? Despite another round of speculation linked to Elon Musk, DOGE has fallen below $0.09, reflecting a market more focused on risk reduction than hype-driven trades. The decline follows a short-lived reaction to Musk’s comments about a potential Dogecoin-related moon mission. The token initially rose by about 4%, but the move faded within hours. By the end of the session, DOGE had erased its gains and continued to slide in the days that followed. Currently, Dogecoin is trading around $0.08–$0.09, marking a weekly drop of more than 20% and pushing it below several key support levels. DOGE's price trends to the downside on the daily chart. Source: DOGEUSD on Tradingview Dogecoin (DOGE) Selling Pressure Builds Across the Market Dogecoin’s weakness has unfolded alongside a broader crypto sell-off. Bitcoin’s breakdown, currently trading below $65,000 and major support levels, triggered widespread liquidations, pulling down high-risk assets such as meme coins. Total crypto market capitalization fell sharply, while the Fear and Greed Index dropped into “extreme fear” territory, signaling heightened caution among traders. This environment has limited the impact of Musk-related headlines. While his past remarks often sparked sustained rallies, recent reactions have been brief. Other meme tokens, including Shiba Inu, have followed a similar path, suggesting the move is less about DOGE-specific news and more about overall market stress. Technical Levels Under Pressure From a technical perspective, Dogecoin has broken below the $0.10 and $0.0950 support levels and briefly touched lows near $0.08. The price remains below key moving averages, backing the bearish trend. Analysts note resistance forming around $0.09–$0.0950, with additional barriers near $0.10 that would need to be reclaimed for any meaningful recovery. Momentum indicators continue to point lower, though some oscillators are approaching oversold levels. Trading volume has increased during the decline, indicating active participation rather than thin liquidity moves. Outlook Hinges on Macro Conditions For now, Dogecoin’s direction appears tied to broader market conditions rather than celebrity-driven catalysts. While some longer-term indicators suggest a potential basing phase could develop, short-term risks remain skewed to the downside. Related Reading: Bitcoin Edges Past Gold In Appeal, JPMorgan Says Unless selling pressure across crypto eases, DOGE may continue to test lower support zones, with market sentiment likely to remain cautious in the near term. Cover image from ChatGPT, DOGEUSD chart on Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|Doge price|dogeusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57805980,
    "published": 1770436839000,
    "title": "Bitcoin Sell-Off May Be Done, Analyst Flags Recovery Signs",
    "body": "According to Matt Hougan, chief investment officer at Bitwise Asset Management, much of the crypto complex already went through a down cycle last year even though headline coins looked steadier. Related Reading: Russia’s Biggest Exchange To Launch XRP Indices And Futures He points to heavy buying from ETFs and companies that kept Bitcoin, Ether, and XRP from showing the full brunt of those losses. Some tokens, without that same support, fell hard — in many cases by about 50%–60% — and behaved like past bear phases. Institutional Buying Accelerates Hougan Says ETF flows and corporate accumulation have shifted the balance. When institutions buy more than new supply, price pressure changes. That is what he highlights. “We ran the four-year cycle last year,” Hougan said. “We’re already at the bottom. I think we’re coming back up.” ETF purchases and corporate hoarding at times outpaced newly mined Bitcoin, creating a persistent bid under the market. Reports note the comparison to gold, where steady central bank buying first steadied prices and later helped fuel much bigger moves. “Just like gold eventually entered a parabolic move, Bitcoin will follow suit,” Hougan said. We’re just earlier in that process.” A Selective Altcoin Cycle Expected Investors are getting pickier. The next up-cycle, according to this view, will reward projects with clear use and steady activity, not every token with hype. Networks tied to stablecoins, tokenization, and real infrastructure work stand a better chance of drawing capital. Lower-quality projects that lack users or clear purpose could see little interest and remain sidelined. Bitcoin Price Action In the middle of these structural shifts, Bitcoin’s price has kept traders busy. Recently BTC slid from earlier peaks to roughly 60,000–65,000 before finding buyers and moving back above 65,000 amid a broader rebound. Geopolitical headlines pushed risk appetite up and down, and those swings helped produce one of Bitcoin’s rougher stretches in weeks. Reports say traders are watching headlines closely because news can prompt sudden outsized moves. Related Reading: Bitcoin Edges Past Gold In Appeal, JPMorgan Says A Slow Transfer From Old Hands To New Buyers Long-term holders are selling some coins while institutions move in. That hand-off can feel messy. A sale wall forms when investors who bought early decide to take profit, and large institutions step in to absorb that supply. That process has been observed in other asset classes as they mature, and it does not automatically mean demand is weakening over the long run. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|Bear market|bitcoin|btc|btcusd|crypto|crypto winter|etf",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57806886,
    "published": 1770440457000,
    "title": "Bitcoin Must Fall 90% For Years To Pressure Strategy’s Debt, CEO Says",
    "body": "Strategy’s leadership is pushing back against growing concerns that the world’s largest corporate holder of Bitcoin (BTC) could face serious financial stress as the cryptocurrency’s price continues to slide. Speaking after the company released its fourth‑quarter results, CEO Phong Le sought to reassure investors that the firm remains well-positioned, even as Bitcoin fell close to $60,000 on Thursday. Bitcoin Sell‑Off Tests Strategy’s Financial Resilience Bitcoin dropped roughly 50% since reaching all‑time highs of $126,000 in October of last year, a period during which Strategy, formerly known as MicroStrategy, was aggressively accumulating the digital asset. The sell‑off has weighed heavily on the company’s share price. Strategy’s stock, trading under the ticker MSTR, sank to about $104 on Thursday, its lowest level since August 2024, after plunging more than 17% during the session. Related Reading: Bitcoin Crash Exposes Colossal Corporate Losses — Here’s Who’s Most Impacted For now, investors are focused on two key factors: the price of Bitcoin itself and Strategy’s ability to meet its financial obligations if the downturn deepens. Those questions loomed large as founder Michael Saylor and CEO Phong Le addressed analysts during the firm’s earnings call. Much of the attention centered on how Strategy would navigate a prolonged “Bitcoin winter,” should one materialize. Saylor has already taken steps to bolster the company’s financial flexibility, including raising a $2.25 billion cash reserve to cover preferred dividend payments totaling $888 million annually. However, investors remain uneasy about the company’s $8.2 billion in low‑ and zero‑interest convertible bonds, which could begin facing early redemptions starting in September 2027, particularly now that MSTR shares have fallen sharply. Politics, Leverage, And Valuation In Focus Saylor reiterated that the company is keeping its options open, including the possibility of selling Bitcoin if market conditions require it. He also framed crypto investing as inseparable from politics, pointing to President Donald Trump’s pro‑crypto stance and noting that Trump’s nominee for Federal Reserve (Fed) chair, Kevin Warsh, is viewed as supportive of digital assets. Still, Bitcoin fell through its post‑2024 election lows on Thursday, reflecting skepticism that the federal government will actively support Bitcoin purchases. Treasury Secretary Scott Bessent reinforced those doubts this week, telling Congress he lacks the authority to rescue Bitcoin markets. On the balance‑sheet front, CEO Phong Le addressed worries about Strategy’s leverage. He said the company operates with roughly one‑third the leverage of a typical high‑yield firm. Related Reading: Bitcoin Crashes Below $67,000 As Stifel Warns Of Potential Drop To $38,000 According to Le, Bitcoin would need to decline by about 90% for Strategy’s Bitcoin reserves to merely equal the value of its convertible debt. Even in that extreme scenario, he said, the company would explore restructuring options if it could not convert the debt into equity. Strategy’s own disclosures show an enterprise value of about $49.95 billion, compared with roughly $45.33 billion worth of Bitcoin on its balance sheet. Enterprise value includes the company’s market capitalization, preferred shares, and convertible bonds, minus cash. If Bitcoin drops once again near $63,000, Strategy’s market cap of $35.57 billion would need to fall about 13% from its recent closing price of $106.99 to eliminate the valuation premium over its Bitcoin holdings. However, since Thursday’s crash, both Bitcoin and Strategy’s stock have made a significant recovery. Bitcoin, for example, has surged to around $69,256. MSTR has recovered above $130, marking a 20% increase in less than 24 hours and offering short-term relief. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin chart|Bitcoin news|btc|BTC news|BTCUSDT|crypto|crypto market|crypto news|Michael Saylor news|Microstrategy|MicroStrategy bitcoin holdings|MicroStrategy news|MSTR|Strategy|Strategy CEO|Strategy news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57807468,
    "published": 1770442254000,
    "title": "Google search volume for 'Bitcoin' skyrockets amid BTC price swings",
    "body": "The surge in Google search activity for \"Bitcoin\" led Bitwise’s head of Europe, André Dragosch, to claim that “retail is coming back.”",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57807953,
    "published": 1770444037000,
    "title": "Kevin Warsh Will Trigger Bitcoin Regime Shift, Jeff Park Says",
    "body": "Bitcoin’s roughly 50% drawdown has less to do with cycle déjà vu than a deeper break in the market’s old playbook, according to Jeff Park, partner and CIO at ProCap Financial, who argues a prospective Kevin Warsh-led Federal Reserve could catalyze a regime shift in how Bitcoin trades. In an conversation with Anthony Pompliano, Park said he believes Bitcoin has been in a bear market “for quite a bit,” and warned that the familiar reflexive framework, easier policy, more liquidity, higher BTC, has stopped doing the explanatory work it once did. What Kevin Warsh Means For Bitcoin Park’s starting point was a blunt claim: the assumed linkage between Bitcoin and global liquidity has “been broken for quite some time.” He pointed to what he described as steadily rising global liquidity through 2025, citing Michael Howell’s tracking and estimating the level at roughly $170 trillion, alongside broad-based strength in other asset classes. “Asset prices have all gone up,” Park said, referencing a “frenzied rally” in metals and corporate credit spreads near all-time lows, before adding: “there actually is a lot of reasons to think that Bitcoin should have also already participated, but it didn’t.” Related Reading: Bitcoin Crash On Feb. 5 Was Historic: The Numbers Behind The Selloff That divergence, he argued, is why investors should stop leaning on backward-looking heuristics that have become psychological crutches. In his telling, crypto markets have repeatedly assumed history would re-run—altcoin rallies after bitcoin rallies, a durable four-year cycle, and the idea that QE or lower rates reliably lift BTC. “It’s worth remembering that there’s things that are constantly changing about the world where everything looks a little bit different than the way you had modeled it before,” he said. From there, Park reframed the debate around his “negative rho” versus “positive rho” Bitcoin framework. The former is the risk-asset version most investors recognize: rates down, risk up, Bitcoin up. The latter is the endgame: Bitcoin rising as rates rise, effectively challenging the notion of a stable “risk-free” rate by calling into question the credibility of the monetary order itself. “This is the mythical elusive perfect holy grail of what Bitcoin is meant to be,” Park said of positive-rho Bitcoin. “What it’s undermining is the risk-free rate itself. In that world, what we’re saying is actually because the risk-free rate is not the risk-free rate. Because the dollar hegemony is not the dollar hegemony and we are no longer able to price the yield curve in the ways we’ve known that means we need something different… and bitcoin is that hedge.” Park suggested the market may be inching toward that worldview as US policymaking becomes more explicitly about system repair, not incremental tweaks. He described the current US administration as attempting to “wrestle control of the economy away from the Federal Reserve” via deregulation, tax cuts, tariffs, and efforts to weaken the dollar, leaving the Fed “on their back foot” amid shifting “tectonic plates” across policy channels. Absolutely enjoyed recording this, even though we of course wish prices were higher. For those who have been listening to our show (monthly going forward), the fact that we are in a bear market won’t come as a big surprise. Still, Bitcoin can survive all this! Listen below 👇 https://t.co/JSrKOw5QLY — Jeff Park (@dgt10011) February 5, 2026 That’s where Park placed Warsh, a former Fed governor and, in Park’s telling, a rare combination of institutional fluency and technological conviction, as potentially pivotal. Park recounted an interaction from 2021 or 2022 in which Warsh expressed enthusiasm for Bitcoin while criticizing “phonies” who treat tech as “magic.” Warsh, Park said, “truly believed deep in his heart that this isn’t magic… that it actually is going to solve a lot of problems and bring efficiencies and Bitcoin is a core part of that cultural fabric.” Related Reading: PlanB Lays Out Four Bitcoin Bear-Market Scenarios Crucially, Park emphasized Warsh is not an anti-institution wrecking ball. Instead, he portrayed Warsh as someone who understands why the Fed’s legitimacy has been challenged and how it might be rebuilt. One line, Park said, has “always stuck” with him: “inflation is a choice.” Park contrasted that with Fed communication that, in his view, sometimes treats inflation as something that merely happens due to tariffs or war, rather than an outcome of policy tools and mandates. For Park, a Warsh appointment matters less because it guarantees easier policy and more because it could accelerate a rethink of Fed–Treasury coordination. He said he is “optimistic about the possibility of a new Fed Treasury accord that Bessant and Warsh can rewrite,” arguing the heart of the issue is the Triffin dilemma and the tension between the dollar’s external reserve role and internal saver role. “It’s not that we need fed independence,” Park said. “We actually need Fed interdependence with the Treasury.” The irony, in Park’s framing, is that “more accommodative policies may in fact actually not be the catalyst” for Bitcoin’s next bull phase. Instead, he argued Bitcoin’s bid ultimately strengthens when the world feels less like “peacetime” and more like “wartime”, when industrial, military, and fiscal policy dominate, centralization pressures rise, and capital controls become more plausible. The people who “need Bitcoin,” he said, are not US investors with endless alternatives, but those facing constraint and censorship. If Park is right, Warsh isn’t bullish for Bitcoin because he’ll deliver a familiar liquidity wave. He’s bullish because a Warsh-era Fed, paired with a Treasury aligned on system-level reform, could push markets toward the “positive rho” regime, where Bitcoin’s value proposition is less about riding stimulus and more about challenging the architecture that made stimulus necessary in the first place. At press time, BTC traded at $66,396. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|fed|Kevin Warsh|US Federal Reserve",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57808980,
    "published": 1770447601000,
    "title": "Binance SAFU Fund Adds 3,600 Bitcoin ($233M) As Market Faces Pressure",
    "body": "Bitcoin has experienced one of its sharpest corrections in recent years, slipping below the $65,000 level and reaching its lowest price since October 2024. The decline reflects persistent selling pressure across the crypto market, accompanied by deteriorating macro sentiment, reduced liquidity, and cautious positioning among institutional participants. Recent price action suggests the market is entering a critical phase where confidence, rather than technical levels alone, may determine the next directional move. Related Reading: Bitcoin Short-Term Holders Deep In Loss: MVRV Signals Capitulation Phase Amid this uncertainty, the Binance SAFU Fund disclosed the purchase of an additional 3,600 BTC, valued at roughly $233.37 million. While such acquisitions do not guarantee a market reversal, they indicate continued strategic accumulation by major industry players even during periods of elevated volatility. Market sentiment has deteriorated markedly. Several sentiment indicators now sit near levels last observed during the 2022 bear market, when risk appetite contracted sharply and investors adopted defensive positioning. This environment typically coincides with reduced speculative activity, heightened caution among retail traders, and increased scrutiny from institutional capital. Institutional Accumulation Emerges Amid Prolonged Capitulation Phase Arkham data indicates that the Binance SAFU fund has continued accumulating Bitcoin, bringing its total recent purchases to approximately 6,230 BTC, valued near $434.5 million. While such activity signals ongoing participation from large institutional entities, it does not necessarily imply an imminent price recovery. Historically, significant purchases during corrective phases often occur alongside broader market stress rather than marking an immediate turning point. Current market conditions increasingly resemble a classic capitulation phase. Capitulation typically emerges when sustained price declines force weaker holders to exit positions, often at losses, leading to elevated exchange inflows, compressed liquidity, and sharp sentiment deterioration. These episodes can persist longer than many participants anticipate, particularly when macroeconomic uncertainty, risk-off positioning, and tightening liquidity conditions coincide. Importantly, capitulation does not follow a fixed timeline. In prior cycles, similar phases unfolded over weeks or even months before a durable bottom formed. During these periods, volatility tends to remain elevated, failed rallies are common, and confidence rebuilds gradually rather than abruptly. The key variables to monitor include exchange flows, derivatives leverage, spot demand recovery, and broader macro signals. Until those metrics stabilize, the base case remains continued market fragility. Large-scale accumulation by institutional funds may provide structural support, but it rarely prevents extended consolidation or further downside during capitulation environments. Related Reading: Ethereum Coinbase Premium Drops To 2022 Bear-Market Levels: Capitulation Or Further Downside? Weekly Structure Shows Breakdown Below Key Support Bitcoin’s weekly chart shows a clear deterioration in market structure after losing the $70K region, a level that had previously acted as both psychological and technical support. The latest candle reflects strong downside momentum, with price briefly touching the $60K zone before stabilizing near $65.9K. This move confirms a breakdown from the prior consolidation range and shifts focus toward whether this decline represents a deeper bear phase or a late-cycle correction. From a trend perspective, Bitcoin is now trading below the 50-week moving average while approaching the 100-week average. Historically, a critical dynamic support during corrective phases. The 200-week average remains far below, indicating the long-term macro trend has not fully reversed, although intermediate momentum has clearly weakened. Related Reading: Are We Near A Bitcoin Bear Market Bottom? History Offers A Framework Volume dynamics also matter here. The recent selloff shows rising participation compared with earlier consolidation periods, suggesting distribution rather than simple profit-taking. However, sustained high volume without further price acceleration downward could signal seller exhaustion. If Bitcoin fails to reclaim the $70K area, downside risk toward the $60K–$55K zone remains plausible. Conversely, stabilization above current levels would indicate absorption, a necessary precursor for any meaningful recovery. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|Binance buying BTC|Binance SAFU|bitcoin|bitcoin analysis|Bitcoin Binance|Bitcoin news|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57808958,
    "published": 1770447282000,
    "title": "Crypto-focused Erebor wins first new US bank charter of Trump’s second term: WSJ",
    "body": "Erebor doubled its valuation to $4 billion after a $350 million Lux Capital-led funding round late last year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 57811064,
    "published": 1770454631000,
    "title": "Vietnam to tax crypto like stocks with 0.1% trading levy: Report",
    "body": "Vietnam’s Finance Ministry proposes a 0.1% tax on crypto transfers, 20% corporate tax on profits and tough licensing standards for digital asset exchanges.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57813109,
    "published": 1770462025000,
    "title": "Coinbase Premium Turns Positive Since Mid-January As Bitcoin Sees Price Relief",
    "body": "Amid a recent Bitcoin price rebound, Coinbase Premium data shows that American investors are renewing their bullish interest. Notably, the latest price relief only closes a negatively volatile trading week in which Bitcoin experienced a free price fall, as 30% loss pushed prices to around $60,000. This market plunge by the premier cryptocurrency has been attributed to many factors, including collapsing leverages, high levels of ETF outflows, metals market volatility, and also investors’ expectations in line with the typical boom and bust market cycle. Related Reading: Bitcoin Sell-Off May Be Done, Analyst Flags Recovery Signs Coinbase Premium Turns Positive After Successful $60K Retest The Coinbase Premium, one of the most important Bitcoin market indicators, shows the price difference between Bitcoin on Coinbase and its price on other major exchanges. It is largely used to measure how much more or less US investors are paying to acquire Bitcoin compared to international traders. According to Julio Moreno, Head of Research at CryptoQuant, the Coinbase premium has maintained a negative value since mid-January, suggesting that US traders valued the asset lower compared to their global counterparts, leading to a weak market demand. However, since Bitcoin bounced off the $60,000 support following the recent bloodbath, the American market participants have rediscovered their market confidence as indicated by a rising demand and corresponding movement of the Coinbase Premium into a positive zone. During this time, the flagship cryptocurrency has shown moderate resilience, climbing by over 16% to presently trade around $70,000. However, it is worth noting that the positive Coinbase Premium reading does not singularly confirm an impending full-scale recovery. Other factors need to be considered, including macroeconomic developments such as Federal Reserve interest rate decisions and liquidity tightening policies, overall global market sentiment, and geopolitical stability. Related Reading: Dogecoin Drops Below $0.09 as Market Weakness Outweighs Musk Hype Bitcoin Market Overview At the time of writing, Bitcoin is trading at $68,892, representing a 6.44% gain in the past day. However, significant losses of 17.34% and 23.38% on the weekly and monthly charts, respectively, show the asset is still deep in bearish territory. According to a recent post from CryptoQuant, Bitcoin has been about 50% away from its all-time high (ATH). Notably, recent bear markets recorded price slumps as low as 70%-80% indicating, indicating that there is a high possibility of a deeper price correction. However, CryptoQuant analysts warn that the bigger concern is time capitulation, i.e., how long this market winter will stay compared to how low prices may fall. With a market cap of $1.4 trillion, Bitcoin continues to account for over 55% of the total crypto market cap and is the largest digital asset in the world. Featured image from Pexels, chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin Rebound|Coinbase Premium|cryptoquant|julio moreno|Time Capitulation",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57814980,
    "published": 1770468373000,
    "title": "Tether helps Turkey seize $544M in crypto tied to illegal betting network",
    "body": "Tether claims it has helped law enforcement in over 1,800 cases across 62 countries, freezing $3.4 billion in USDT tied to suspected illicit activity.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57816262,
    "published": 1770472800000,
    "title": "Forget the bank account: EY warns firms they must own the wallet to keep their customers",
    "body": "EY Digital Assets leaders Mark Nichols and Rebecca Carvatt argue that the wallet is no longer just a crypto tool, but the primary strategic interface for the next generation of global finance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|EY|Exclusive|Wallets|Tokenization|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57816541,
    "published": 1770473709000,
    "title": "Stablecoins Beyond The Hype: Lack Of Credit Protection For Holders",
    "body": "Stablecoin holders rank fifth in a bankruptcy distribution due to the insolvency of the issuer, contrary to the assertion in the GENIUS act.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57817084,
    "published": 1770475463000,
    "title": "What crashed Bitcoin? Three theories behind BTC's trip below $60K",
    "body": "Hong Kong hedge funds’ leveraged BTC price bets are emerging as the main trigger behind Bitcoin’s sharp month-long sell-off.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57817549,
    "published": 1770467449000,
    "title": "Breathe… XRP Is The ‘Oxygen’ Of The New Financial System, CEO Says",
    "body": "XRP is being talked about in a different way now — not just as a token to trade, but as something that could plug into real finance. Related Reading: Bitcoin Sell-Off May Be Done, Analyst Flags Recovery Signs The talk is shifting from ticker-watchers to companies that want reliable settlement rails and liquid collateral for on-chain assets. That shift shows up in moves on the ledger and in comments from people building businesses around it. XRP Seen As Financial Glue According to Jake Claver, CEO of Digital Ascension Group, XRP should be thought of as foundational collateral rather than a short-term bet. He called it “the most pristine collateral” and warned that 99% of holders “have no clue” what they actually hold. Those are strong words, and they line up with wider signals from developers and some institutional players who are testing XRPL’s features for real-world use. 99% of people that own XRP have no clue what it really is…. It’s the most pristine collateral the world has ever seen… It’s the oxygen the new financial system will need to breathe.. I do not know how to impress upon you how important XRP will be for the world moving forward. — Jake Claver, QFOP (@beyond_broke) February 4, 2026 Growing Tokenized Commodity Activity Reports say the XRPL now hosts roughly $1.14 billion in tokenized commodities. That number is important. It shows companies are putting things like energy-linked tokens and diamonds onto the ledger, and it positions XRPL just behind Ethereum in the specific area of tokenized commodity value. These assets aren’t just experiment tokens; they are intended to be tied to physical goods and cash flows, which changes how XRP might be used in settlement and collateral roles. Ripple’s Plan For Institutional DeFi Based on reports from Ripple’s roadmap, the ledger is being prepared for deeper institutional use. Permissioned domains and credentials are being highlighted as tools to let regulated firms operate with KYC and compliance baked in. XRP Price Action Market moves reacted to these developments. After a slide to about $1.11 amid broad market stress, XRP climbed back to roughly $1.53 on February 7, a move of over 35% from the recent low. Trading has since cooled off a little. Some traders point to renewed institutional flows and accumulation by large wallets, while others say global risk sentiment and macro headlines remain the main drivers of day-to-day swings. Institutional Steps Toward On-Chain Credit Meanwhile, reports note early institutional participants are preparing to put capital to work to increase yield and liquidity on XRPL. Planned features like a permissioned DEX, confidential transfers, and smarter escrow controls are meant to make the ledger easier for banks and regulated funds to plug into existing processes. Related Reading: Bitcoin Edges Past Gold In Appeal, JPMorgan Says XRP As ‘Oxygen’ If those pieces arrive and are adopted, XRP’s role as an on-ledger liquidity provider and settlement asset would be reinforced. There are good reasons to watch both the tech and the market. The ledger’s growing base of tokenized goods and the roadmap for lending give a clear use case for XRP as operational collateral. At the same time, price swings show that broader macro forces and speculation still matter a great deal, and adoption by banks and funds will be what really tests the claim that XRP can act as the “oxygen” for a new financial plumbing. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|crypto|DeFi|DEX|Oxygen|Ripple|xrp|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57817922,
    "published": 1770478229000,
    "title": "Pundit Says It’s Time To Get Your XRP Off Crypto Exchanges – Here’s Why",
    "body": "XRP’s price crash earlier this week has kept many bullish investors in the XRP community on edge, but one outspoken voice in the community believes the move is not as random as it looks. A crypto pundit known as Stellar Rippler has encouraged XRP holders to pull their cryptocurrencies off centralized exchanges immediately, with the outlook that the recent volatility is not just another routine market dip but a warning sign of what’s to come. Related Reading: Bitcoin Edges Past Gold In Appeal, JPMorgan Says Engineered XRP Crash? Stellar Rippler’s position is based on the idea that XRP is being treated differently from most digital assets behind the scenes. He pointed to past remarks from David Schwartz, co-creator of the XRP Ledger, where XRP was described as a form of pre-allocated liquidity for institutional use, as well as statements suggesting that XRP currently held in escrow can be sold to institutions but will not be circulated until NDAs are disclosed. He went further to name large financial players, including BlackRock, JPMorgan, Bank of America, and institutions linked to the BRICS, the United Arab Emirates, the United Kingdom, and European central banking structures. According to the pundit, all these institutions have bought the right to buy the XRP currently held in escrow by Ripple. At the time of writing, there are no public filings that confirm coordinated buying of XRP escrows by these entities, but the argument has found receptive ears among investors unsettled by the recent sell-off. From that angle, the pundit noted that sudden downside moves, such as the recent drop to $1.15, are engineered. By “engineered,” this means the price crash serves a strategic purpose of creating opportunity for large financial players to accumulate XRP at lower prices before any market repricing takes place. Should You Take Your XRP Off Exchanges? Another part of the warning focused on user experience at major crypto exchanges. According to the pundit, Binance and Coinbase users have reportedly been facing difficulties getting their crypto off the exchanges. This, in itself, is a warning for XRP holders to get their cryptos off crypto exchanges and into a cold wallet. That message taps into conversation in crypto about self-custody versus keeping holdings on crypto exchanges. Calls to be your own bank tend to resurface whenever price action turns volatile. The alarm was sounded against the backdrop of a Bitcoin price crash below $70,000 that pulled most cryptocurrencies lower. XRP, in particular, dipped to around $1.15 during the sell-off before rebounding. Related Reading: Bitcoin Sell-Off May Be Done, Analyst Flags Recovery Signs At the time of writing, XRP is trading near $1.42, easing some immediate pressure but not fully restoring confidence. On the subject of confidence, sentiment surrounding XRP on social media is relatively optimistic. Data shows XRP is drawing more positive commentary than other large-cap assets such as Bitcoin and Ethereum despite the recent market-wide crash. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|altcoin|crypto|crypto market|crypto news|cryptocurrency|Ripple|xrp|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57818519,
    "published": 1770480524000,
    "title": "Bitcoin falls below $70,000 after erasing post-election gains during 'sell at any price' rout",
    "body": "Crypto sentiment was hit as Gemini plans to close operations in several regions and cut staff, while spot bitcoin ETF flows turned negative.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|crypto market|crypto prices|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57819423,
    "published": 1770483621000,
    "title": "Bitcoin Crash Linked To BlackRock IBIT Hedging, Arthur Hayes Claims",
    "body": "Arthur Hayes, co‑founder of BitMEX, has pointed to hedging tied to BlackRock’s iShares Bitcoin Trust (IBIT) as a major driver behind the recent Bitcoin sell‑off. Related Reading: Bitcoin Edges Past Gold In Appeal, JPMorgan Says According to Hayes, dealer hedging related to IBIT and similar structured products can force large, mechanical selling when markets move against those positions. Reports note that such moves can amplify a price drop already set off by other pressures. Heavy Hedges Can Trigger Sudden Selling Pressure: Hayes Hayes argues that banks and dealers who underwrite structured notes and ETF‑linked products often hedge their exposure in the spot and derivatives markets. Those hedges can be heavy and fast. When a large product faces outflows or redemption triggers, hedges are adjusted quickly. That can translate into sudden selling pressure that pushes prices down further, especially if liquidity is thin. $BTC dump probably due to dealer hedging off the back of $IBIT structured products. I will be compiling a complete list of all issued notes by the banks to better understand trigger points that could cause rapid price rises and falls. As the game changes, u must as well. pic.twitter.com/9DF8VE9XBL — Arthur Hayes (@CryptoHayes) February 7, 2026 Market Moves And Liquidity Stress The market behaved like a room of people trying to leave at once. Prices plunged, then bounced. Reports say Bitcoin fell steeply from its recent highs before staging a partial recovery. Bitcoin has fallen to around $68,500 Saturday, down 16% in the last seven days, data from Coingecko shows. Trades and order books showed spikes in volume, which is one sign that hedging flows and quick rebalancing were at play. Some analysts say macro news and trader positioning also mattered. The truth likely sits in the overlap of these causes. Who Bears The Risk Dealers carry risk when they underwrite complex products. In certain moments, that risk is passed back into the market through hedging. That’s how, according to Hayes, a few large issuers can indirectly set off a chain reaction that affects many other holders and traders. The moves can be sudden and mechanical, not always driven by sentiment. A Watchful Washington Reports say the role of spot ETFs in crypto markets is now on regulators’ and policymakers’ radar. US President Donald Trump’s economic team has been monitoring big flows into and out of institutional vehicles, while market participants debate whether ETFs stabilize prices or add new stress points. Whatever the view, structured products now form a clear link between traditional finance and crypto volatility. Broader Takeaways This episode underlines how new financial plumbing can create new channels for contagion. Some see the presence of large, regulated players as a net positive for long‑term adoption. Others warn those same players introduce conventional market mechanics that can behave unpredictably when stretched. Reports note both perspectives are useful when piecing together why prices moved the way they did. Related Reading: Bitcoin Sell-Off May Be Done, Analyst Flags Recovery Signs Who Is Right, And What Next Hayes has laid out a theory that ties observable hedging flows to the crash. It is a compelling thread that fits many of the market signals seen in recent days. Still, other factors—macro shifts, concentrated profit‑taking, and liquidity gaps—likely played parts as well. Traders will watch flows closely, and structured product issuers will be asked hard questions. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|Arthur Hayes|bitcoin|BlackRock|btcusd|crypto|IBIT|liquidity",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57819422,
    "published": 1770483600000,
    "title": "SOL-focused Forward Industries has had a tough run, but CIO says it's positioned for success",
    "body": "With no debt and the largest public solana treasury, Forward Industries' CIO says it can play offense and consolidate rivals as the sector strains.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Digital Asset Treasury|Solana News|mergers and acquisitions|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 57820898,
    "published": 1770485590000,
    "title": "South Africa’s Kganyago Warns on Risk of Growing Stablecoin Use",
    "body": "South African Reserve Bank Governor Lesetja Kganyago warned about the risk of the increasing popularity of stablecoins, saying there’s a danger the cryptocurrency assets could “break apart.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]