[
  {
    "id": 57328340,
    "published": 1768911969000,
    "title": "WLFI faces backlash after ‘team wallets’ push through USD1 growth proposal",
    "body": "The top nine wallets controlled nearly 60% of voting power in WLFI’s USD1 governance vote, raising questions about insider influence as locked holders were unable to participate.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57327862,
    "published": 1768910745000,
    "title": "Polymarket hit by fresh Europe crackdowns as Hungary, Portugal block access",
    "body": "The moves highlight the growing uncertainty over whether crypto prediction markets are treated as finance or gambling.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57327771,
    "published": 1768910566000,
    "title": "Bitcoin is at risk of slide to $58,000 as 'restrictive' Fed policy and trade tensions weigh on crypto",
    "body": "The veteran trader who accurately called the 2018 bitcoin crash has tipped bitcoin to fall to $58,000. Experts said macro conditions favor a bearish bitcoin trend.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Markets|Trump|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57327681,
    "published": 1768910202000,
    "title": "Elon Musk’s X Open-Sources Grok-Powered Algorithm Driving 'For You' Feed",
    "body": "The social media platform has taken a step towards transparency amid ongoing battles over platform spam and non-consensual AI images.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57327318,
    "published": 1768909176000,
    "title": "Bitcoin slides to $91,000 as U.S. trade tensions spur selloff : Crypto Markets Today",
    "body": "Bitcoin erased last week’s rally as Asia-led selling hit crypto alongside falling U.S. equity futures.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|Derivatives|Altcoins|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57327115,
    "published": 1768908623000,
    "title": "Here’s Why The Litecoin Price May Be Getting Ready For Another Massive Rally",
    "body": "The Litecoin price has seen its fair share of volatility and corrections over the past few weeks. Despite the downtrend, a crypto analyst has forecasted that LTC could be laying the groundwork for another explosive rally. He has shared a detailed technical analysis and price chart explaining why he believes Litecoin could eventually flip into a bullish position. Litecoin may be positioning itself for another powerful rally, as its market structure remains broadly intact. According to a recent analysis from market expert The Penguin (@ThePenguinXBT), LTC’s structure continues to point toward much higher price levels, with recent volatility and declines doing little to change the overall macro outlook. Litecoin Price Gets Ready For Explosive Rally Sharing a 4-hour price chart, The Penguin gave a detailed breakdown of why he believes Litecoin is preparing for another price surge. He explained that LTC has now swept the October 10 wick, a key technical move that could signal the end of downside liquidity grabs. At the same time, the chart shows a completed five-wave move lower into what appears to be the final leg of Litecoin’s correction. Related Reading: Why The Litecoin Price Could Stage A 33% Rally To $110 The Penguin noted that LTC’s price had earlier stabilized within a clear horizontal range, then briefly dipped below it and quickly reclaimed that level. This rebound took place near the lower support zone around $70, where a sharp sell-off was met with strong buying pressure. As a result, price action formed a rounded recovery from the recent low, which the analyst identified as Litecoin’s final corrective wave. According to The Penguin, the internal structure of Litecoin’s recent move suggests two things: the final correction has been completed, or there might be one last marginal low for LTC. Either way, he emphasized that the broader setup remains strongly bullish. The Penguin has projected that once Litecoin begins its next impulsive move, it could become difficult for the price to be pushed back into previous trading ranges. From the rounded recovery line, the chart points toward a potential move to $82. The analyst has also highlighted an upper blue resistance line above $86 as an additional upside target. If the chart setup plays out as expected, Litecoin could see its price skyrocket by more than 17% from current levels around $70. Analyst Sets Ambitious $1,600 Price Target For LTC In a more recent analysis, The Penguin shared a new chart suggesting that Litecoin could be gearing up for a dramatic price rally. The chart highlights a key descending triangle pattern, traditionally known as a bearish continuation signal, especially when it forms after a downtrend. Related Reading: Litecoin 2M Bollinger Band Width Hits New Lows, CMT-Certified Analyst Reveals What It Means According to the analyst, Litecoin is attempting to break out of a multi-year descending triangle on its weekly chart, signaling the potential end of its consolidation and the start of a new bullish phase. Once this happens, The Penguin predicts that the cryptocurrency could embark on a sharp vertical rally toward $1,600. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Litecoin|Descending Triangle Pattern|Litecoin news|litecoin price|ltc|LTC news|ltc price|ltc/usd|LTCUSDT|The Penguin",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 33,
        "NAME": "LTC",
        "CATEGORY": "LTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57327111,
    "published": 1768908579000,
    "title": "BlackRock’s PFF ETF has $380 million worth of exposure to MSTR's preferred equities",
    "body": "ETF allocations to Stretch, Strife, and Stride underscore institutional appetite for MSTR income securities.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|BlackRock|MicroStrategy|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57326586,
    "published": 1768906954000,
    "title": "Portugal joins growing list of countries cracking down on Polymarket",
    "body": "Betting on political events is illegal in Portugal, and the regulator gave Polymarket 48 hours to cease operations in the country.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Polymarket|Portugal|Prediction Markets|Regulation|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 57326231,
    "published": 1768905712000,
    "title": "Bitcoin flashes buy signals as $90K becomes key support",
    "body": "Bitcoin bulls defend $90,000 as Hash Ribbons and Fear and Greed Index flash buy signals, hinting at a potential rally.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57325992,
    "published": 1768905109000,
    "title": "Tech index futures, crypto stocks drop as U.S.-Europe trade tensions rise, bitcoin falls",
    "body": "Risk assets slide amid tariff uncertainty and rising global bond yields.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Circle|Coinbase|MicroStrategy|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57325471,
    "published": 1768903423000,
    "title": "Hong Kong group warns crypto licensing rollout risks forced shutdowns",
    "body": "The warning came as Hong Kong consults on new virtual asset advisory and management licenses, expanding oversight beyond crypto trading platforms.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57325270,
    "published": 1768902911000,
    "title": "Trouble mounts for bitcoin and stocks as global benchmark for borrowing costs surges",
    "body": "The 10-year U.S. Treasury yield has climbed to 4.27 percent, a four-month high that raises borrowing costs across the global economy.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Bonds|bond yields|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57324887,
    "published": 1768901588000,
    "title": "Bitcoin price targets extend down to $58K as BTC prints new death cross",
    "body": "Bitcoin failed to break out from its macro trading range, according to analysis, with new BTC price targets including a return to sub-$60,000 levels.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57324179,
    "published": 1768899629000,
    "title": "XRP Market Structure Resembles That Of February 2022, Glassnode Warns",
    "body": "Glassnode says XRP is slipping back into a cost-basis configuration last seen in February 2022, with newer buyers accumulating at levels that leave a prior cohort “top” increasingly underwater, an on-chain setup that can shape sell pressure around key price zones. In a note shared Monday via X, the analytics firm pointed to a rotation in realized prices by age band. “The current market structure for XRP closely resembles February 2022,” Glassnode wrote. It added that “psychological pressure on top buyers builds over time,” framing the current tape as one where patience is being tested rather than rewarded. What This Means For XRP Price The firm’s core observation is that wallets active in the short-term window, roughly the 1-week to 1-month cohort, are accumulating below the cost basis of holders in the 6-month to 12-month band. In practice, that means newer demand is stepping in at prices that are cheaper than what a meaningful slice of mid-term holders paid. Related Reading: XRP Is Doing Something It Hasn’t Done Since 2021: Here’s Why It Matters That relationship matters because cohorts tend to behave differently when price revisits their cost basis. When spot trades below a cohort’s realized price, that cohort is, on average, underwater. If the market rallies back toward that level, some of that supply can become eager to de-risk into breakeven, creating overhead liquidity that can cap upside until it is absorbed. Glassnode’s “Realized Price by Age” chart (7-day moving average) visualizes this dynamic by plotting cohort realized prices against spot. The standout feature is the gap between shorter-term and 6–12 month cost bases during the most recent consolidation, echoing the firm’s February 2022 comparison. With XRP price again trading slightly below the $2 mark, a post by Glassnode from Nov. 24 2025 also comes back into focus. Glassnode quoted this old X post in which it singled out $2 as the level where this cohort stress has been most visible in flows. “The $2.0 level remains a major psychological zone for Ripple holders,” the firm said. “Since early 2025, each retest of $2 saw $0.5B–$1.2B per week in losses,” a reminder that many holders have been exiting at a loss as price revisits that handle. Related Reading: XRP Longs Get Wiped: Binance Leads $5M Liquidation Wave Those realized loss estimates are a key qualifier: they suggest that $2 is not just a chart level, but a behavior level, where spending decisions change and where capitulation (or forced de-risking) can cluster. Notably, in February 2022, XRP put in a sharp round-trip: after slipping to about $0.6034 on Feb. 2, it ripped higher to the month’s peak near $0.8758 on Feb. 8, then rolled over into the back half of the month as macro risk accelerated. Then, XRP was back around $0.70 by Feb. 23–24 (roughly 20% off the Feb. 8 high), before bouncing into month-end near $0.7856 on Feb. 28. The late-month downdraft coincided with the Russia–Ukraine escalation and the Feb. 24 invasion, which hit risk assets broadly and pushed major crypto lower intraday, consistent with the risk-off impulse seen across the entire crypto market. At press time, XRP traded at $1.9294. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP News|glassnode|xrp|xrp news|XRP On-Chain Data|XRP Price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57325748,
    "published": 1768898213000,
    "title": "Yield trading platform Pendle debuts new token to boost user capital efficiency",
    "body": "Pendle is overhauling its token economics, scrapping multi-year locks in favor of a liquid staking model and a new revenue-driven reward system.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Pendle|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 57323673,
    "published": 1768897728000,
    "title": "Bitcoin holders see first 30-day stretch of realized losses since late 2023",
    "body": "Gold hit fresh record highs on Tuesday as rising geopolitical tensions and trade-war fears continued to push investors toward safe-haven assets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57322752,
    "published": 1768895345000,
    "title": "'White Whale' memecoin slides 60% after top holder dumps $1.3 million",
    "body": "A major holder’s exit sent White Whale sharply lower on Monday, with the project calling the move a “liquidity event.\"",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57321752,
    "published": 1768892429000,
    "title": "Solana At Risk Of Breakdown After Key Rejection – Is $100 Next?",
    "body": "A year after reaching its all-time high (ATH), Solana (SOL) is trading 54.3% below its $293 2025 milestone, attempting to hold a crucial zone as support. Some analysts warned that the altcoin could risk a deeper correction if the price fails to recover the recently lost ground. Related Reading: Ethereum’s 4-Hour Chart Says A Big Dump Is Coming, Here’s The Target Solana Breaks Below Key Support On Sunday, Solana recorded an 8% pullback and hit a two-week low of $130. Since losing the $200 phycological barrier in late October, the cryptocurrency has struggled to hold bullish momentum, hovering between the $115-$145 levels over the past three months. The start-of-the-year rally saw SOL break out of its multi-month downtrend, reclaim the upper zone of its local range, and briefly breach above the key $145 resistance last week. However, Sunday’s market pullback has sent Solana back below key areas. Amid this performance, market observer BitGuru affirmed in an X analysis that the cryptocurrency “just swept liquidity into a strong demand zone after a clean structure breakdown.” He explained that the price is attempting to rebound from its local support area, which could trigger a “sharp relief move toward previous highs” if the price can hold the current levels. Meanwhile, analyst Man of Bitcoin noted that the altcoin’s price broke below its two-week ascending trendline, which had been supporting its 17% surge from its yearly opening. Moreover, it also dropped below the $136 mark, where the price had consistently bounced after the recent breakout. The market observer pointed out that Solana’s short-term support sits between the $129-$136 area, adding that a breach and sustained breakdown from this area would spell trouble for the cryptocurrency. According to the chart, if selling pressure persists and Solana fails to reclaim the recently lost ground, the price could see a scenario where it retraces deeper and potentially falls up to 25% to challenge the $100 area. Analysts Warn Of Head And Shoulder Pattern Other market watchers highlighted a macro pattern on Solana’s chart, suggesting that a breakdown to new lows could be coming. Notably, the altcoin displays a two-year Head and Shoulders formation in the weekly timeframe. According to the chart, this bearish pattern has been forming since 2024, with the left shoulder developing during the Q1-Q2 2024 rally and the neckline sitting around the $120 area. Meanwhile, the pattern’s head formed during its late 2024 and early 2025 bullish run, which led to its ATH of $293 a year ago. Lastly, the right shoulder developed after the Q3 2025 rally and Q4 correction. Based on this performance, trader Slashology affirmed that Solana is “really looking bad here,” warning that investors should “prepare for the worst” as the price trades near the pattern’s neckline. He forecasted that a breakdown from this key level could lead to a 35%-40% “bloodbath” toward the $75-$80 levels. On the contrary, market observer Crypto Curb suggested a different outcome could be possible. Related Reading: XRP To Repeat Its 2017 Playbook? Analyst Forecasts 1,250% Expansion In an X post, he compared SOL’s recent performance to the S&P 500 (SPX) price action between 2009 and 2011. Per the post, SPX displayed the same pattern as Solana, but ultimately invalidated the pattern after bouncing from the neckline and breaking above the right shoulder’s peak, eventually reaching new highs. To the analyst, the altcoin could display a similar performance if it rebounds from the current levels and starts to climb higher. As of this writing, Solana is trading at $134, a 5.6% decline in the daily timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto analyst|crypto market correction|Crypto Market Recovery|Crypto trader|Sol|SOL analysis|SOL breakdown|Solana|Solana price analysis|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57321595,
    "published": 1768891623000,
    "title": "Bitcoin institutional demand remains strong: Cryptoquant",
    "body": "Cryptoquant found that large custody wallets accumulated $53 billion in Bitcoin over 12 months, suggesting that institutional demand for Bitcoin hasn’t gone away.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57321436,
    "published": 1768891523000,
    "title": "Bitcoin falls under $91,000 as solana, xrp and cardano nurse weekly losses",
    "body": "Tuesday’s crypto tape was steadier after Monday’s tariff-driven wobble, but sentiment remains cautious with altcoins still weaker than bitcoin.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57320539,
    "published": 1768888837000,
    "title": "Ethereum Poised For $4,000 Breakout? Expert Pinpoints On-Chain Triggers For Potential Rally",
    "body": "As Ethereum (ETH) kicks off the year with a recovery past the critical $3,000 threshold amid a broader cryptocurrency market rally in early 2026, it continues to struggle against a key resistance level at $3,400. Currently, the second-largest cryptocurrency is entering a consolidation phase below this significant mark. Technical analyst Ali Martinez has suggested that should the buying momentum observed in recent weeks persist, Ethereum could soon embark on a new rally that might bring it closer to reaching all-time high levels. Ethereum Poised For Potential Price Breakout In a recent update shared on social media platform X (formerly Twitter), Martinez pointed to on-chain indicators suggesting a fresh bullish sentiment among Ethereum investors. Notably, daily active addresses on the Ethereum network have surged, doubling to exceed 800,000 in just two weeks. Related Reading: XRP Price Could Surge Another 30% If This Trend Is Confirmed Martinez’s analysis further hints at a potential correlation with the rising demand for Ethereum exchange-traded funds (ETFs). Since December 29, these investment vehicles have accumulated approximately 158,545 ETH, a sum valued at around $520 million, adding to the positive outlook for the altcoin. This heightened on-chain activity has created substantial support levels for Ethereum’s price action looking ahead, particularly between $2,772 and $3,109 that could prevent a new drop below these key marks. Martinez believes that if these support levels remain intact and buying pressure continues, a breakout above the crucial $3,400 resistance could pave the way for a significant rally toward $4,000—representing an increase of approximately 24.33% from its current trading level of around $3,217. What Lies Ahead For The Altcoin? Other analysts, such as those from BitBull, share an optimistic view of ETH’s price trajectory. The analyst has identified a potential inverse head and shoulders pattern forming in the 10-day chart, which could lead to a bullish price target of $5,000. This projection implies a remarkable 55.48% increase, exceeding last year’s record highs. However, despite these bullish forecasts, Ethereum’s price has fallen by 3% within a 24-hour period, according to CoinGecko data. The cryptocurrency has yet to demonstrate the bullish momentum necessary to meet these targets. Related Reading: Bitcoin Bulls Fired Up As Saylor Teases ‘Bigger Orange’ After Huge Buy Another encouraging factor for investors looking for upward price movement is liquidity. Market expert Ted Pillows recently noted that, following Ethereum’s latest price drop, the maximum pain point appears to lean upward. Historically, large investors and institutions have tended to “hunt” liquidity levels, which helps to reset positioning in the market and evacuate numerous retail investors. With approximately $3.4 billion in short positions at risk if Ethereum successfully breaches the $3,400 mark in the days ahead, the possibility of a significant price movement looms. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|crypto market|crypto news|ETH news|ETH price news|ethereum|ethereum news|Ethereum Price analysis|Ethereum Price chart|Ethereum Price Forecast|Ethereum price news|ETHUSDT|Latest Ethereum News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57320111,
    "published": 1768887346000,
    "title": "UK Parliamentary Panel Flags AI Oversight Gaps Could Expose Financial System to Harm",
    "body": "A parliamentary committee said regulators are struggling to keep pace as AI spreads across banks and insurers, urging clearer guidance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57319570,
    "published": 1768885699000,
    "title": "Solana (SOL) Loses Its Footing, Setting the Stage for Another Dive",
    "body": "Solana failed to settle above $145 and nosedived. SOL price is now consolidating losses below $135 and might decline further below $130. SOL price started a fresh decline below $138 and $135 against the US Dollar. The price is now trading below $135 and the 100-hourly simple moving average. There is a key bearish trend line forming with resistance at $140 on the hourly chart of the SOL/USD pair (data source from Kraken). The price could start a recovery wave if the bulls defend $132 or $130. Solana Price Dips Again Solana price failed to remain stable above $142 and started a fresh decline, like Bitcoin and Ethereum . SOL declined below the $140 and $138 support levels. The price gained bearish momentum below $135. A low was formed at $130, and the price is now consolidating losses. The price recovered a few points and climbed above the 23.6% Fib retracement level of the downward move from the $143 swing high to the $130 low. Solana is now trading below $135 and the 100-hourly simple moving average. On the upside, immediate resistance is near the $135 level. The next major resistance is near the $136 level or the 50% Fib retracement level of the downward move from the $143 swing high to the $130 low. The main resistance could be $140. There is also a key bearish trend line forming with resistance at $140 on the hourly chart of the SOL/USD pair. A successful close above the $140 resistance zone could set the pace for another steady increase. The next key resistance is $144. Any more gains might send the price toward the $150 level. Another Decline In SOL? If SOL fails to rise above the $136 resistance, it could continue to move down. Initial support on the downside is near the $132 zone. The first major support is near the $130 level. A break below the $130 level might send the price toward the $122 support zone. If there is a close below the $122 support, the price could decline toward the $115 support in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is gaining pace in the bearish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is below the 50 level. Major Support Levels – $132 and $130. Major Resistance Levels – $136 and $140.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Technical analysis|Sol|Solana|solbtc|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57319597,
    "published": 1768885633000,
    "title": "Pump.fun Unveils Market-Driven Fund for Early-Stage Crypto Projects",
    "body": "Pump.fun said it will test a market-driven funding model that replaces traditional venture capital selection with live token launches.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57319422,
    "published": 1768885229000,
    "title": "XRP slips below $2 after failed breakout triggers sharp reversal",
    "body": "Once the breakout attempt stalled, sellers pressed the tape, triggering a sharp reversal that cleared out late longs and flipped short-term structure bearish.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57319455,
    "published": 1768885154000,
    "title": "Ethereum activity surge could be linked to dusting attacks: Researcher",
    "body": "A security researcher claims Ethereum’s recent network surge could be linked to address poisoning attacks that are exploiting low gas fees on Ethereum.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57318434,
    "published": 1768882097000,
    "title": "XRP Price Hits Resistance on Recovery, Bulls Lose Momentum",
    "body": "XRP price started a recovery wave above $2.00 but failed near $2.020. The price is now showing a few bearish signs and might decline below $1.95. XRP price started a recovery wave above the $1.920 zone. The price is now trading below $2.00 and the 100-hourly Simple Moving Average. There is a new bearish trend line forming with resistance at $2.030 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move down if it settles below $1.950. XRP Price Dips Again XRP price remained supported above $1.850 and started a recovery wave, like Bitcoin and Ethereum . The price was able to climb above $1.950 and $1.980 to enter a short-term positive zone. There was also a move above the 50% Fib retracement level of the downward move from the $2.065 swing high to the $1.847 low. The price even spiked above $2.00 before the bears appeared. The bulls failed to clear the $2.020 resistance. There is also a new bearish trend line forming with resistance at $2.030 on the hourly chart of the XRP/USD pair. The price is now trading below $2.00 and the 100-hourly Simple Moving Average. If there is a fresh upward move, the price might face resistance near the $2.00 level. The first major resistance is near the $2.020 level or the 83.2% Fib retracement level of the downward move from the $2.065 swing high to the $1.847 low. A close above $2.020 could send the price to $2.0650. The next hurdle sits at $2.10. A clear move above the $2.10 resistance might send the price toward the $2.150 resistance. Any more gains might send the price toward the $2.20 resistance. The next major hurdle for the bulls might be near $2.250. Another Drop? If XRP fails to clear the $2.020 resistance zone, it could start a fresh decline. Initial support on the downside is near the $1.950 level. The next major support is near the $1.9320 level. If there is a downside break and a close below the $1.9320 level, the price might continue to decline toward $1.850. The next major support sits near the $1.820 zone, below which the price could continue lower toward $1.750. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $1.950 and $1.9320. Major Resistance Levels – $2.00 and $2.020.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57318274,
    "published": 1768881618000,
    "title": "Bitcoin Senses Risk As Trump Balks At Europe With Major Tariffs",
    "body": "According to market reports, US President Donald Trump announced a punitive tariff plan aimed at several European allies. The move sent a clear warning to traders and policy makers alike. Stocks and crypto fell as investors shifted to assets they see as safer. Gold climbed, and some currencies strengthened as a reaction to the risk. Related Reading: Bitcoin Bulls Fired Up As Saylor Teases ‘Bigger Orange’ After Huge Buy Markets Feel The Shift Trading floors showed quick reactions. Bitcoin slipped by about 3% and traded in the low-$90,000 range for a time, while equity futures weakened. Safe havens were bought up. Precious metals recorded gains. Based on reports from market outlets, liquidations hit crypto platforms hard, with roughly $750 million to $875 million of leveraged long positions closed out in the first wave of selling. That added extra downward pressure on prices and raised volatility for hours after the announcement. Tariff Timetable And Targets Trump said an extra 10% tariff would start on February 1st, 2026 for goods from eight countries that opposed his Greenland stance, with the level set to rise to 25% by June if talks do not move forward. The affected nations include Denmark, Norway, Sweden, France, Germany, the Netherlands, Finland and the UK. Governments in Europe reacted with firm language and warned of counters. Officials in Brussels hinted at possible measures that could hurt US exporters if tensions deepen. Trade policy is now back in the spotlight and crossing multiple political lines. We don’t always agree with the US government and in this case we certainly don’t. These tariffs will hurt us. If Greenland is vulnerable to malign influences, then have another look at Diego Garcia. https://t.co/z0r0IUlD6I — Nigel Farage MP (@Nigel_Farage) January 17, 2026 How This Played Out In Crypto Crypto traders saw the headlines and reacted quickly. Positions that had been built with margin were trimmed or forced closed. Some funds favored reducing exposure to volatile tokens, while others bought the dip on the theory that shocks like this are temporary. Over short stretches, Bitcoin behaved more like a risk asset, moving with stocks rather than acting as an independent store of value. Over longer stretches, some analysts argue that policy shocks which raise inflationary expectations could boost demand for scarce assets, though that view depends on many economic moves that may follow. Related Reading: What’s Driving The $1.42 Billion Comeback In Spot Bitcoin ETFs? What Traders Are Doing Reports say market makers tightened spreads and liquidity pools thinned during the worst of the volatility. Large orders were matched more slowly and price swings widened. Some institutional desks paused trading for a few moments to reassess risk models, while retail traders watched charts and reacted to alerts. A few hedge desks took the chance to rebalance toward commodity exposure. Others focused on scenario planning, mapping out how retaliatory tariffs or sanctions might affect specific sectors. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|crypto|Greenland|tariffs|Trump",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57317996,
    "published": 1768880673000,
    "title": "​​Memecoin platform Pump.fun launches investment arm ‘Pump Fund’",
    "body": "Pump Fund will kick off with a hackathon and back up to 12 projects at $250,000 each at a $10 million valuation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57317959,
    "published": 1768880533000,
    "title": "Bitcoin Price Outlook Still 'Constructive' Despite Geopolitical 'Noise'",
    "body": "Bitcoin steadied after a sharp selloff, with analysts citing ETF inflows as support for its longer-term outlook despite macro shocks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57317433,
    "published": 1768879107000,
    "title": "Ethereum Price Trapped Under $3,250, Momentum Tilts Lower",
    "body": "Ethereum price started a fresh decline from the $3,300 resistance. ETH is now consolidating losses and is at risk of more losses below $3,150. Ethereum started a sharp downside correction below $3,250. The price is trading below $3,220 and the 100-hourly Simple Moving Average. There is a short-term declining channel forming with resistance at $3,210 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase if it stays above the $3,160 zone. Ethereum Price Struggles Below Resistance Ethereum price failed to remain stable above $3,280 and started a fresh decline, like Bitcoin . ETH price declined below $3,250 and $3,220 to enter a bearish zone. The bears even pushed the price below the 61.8% Fib retracement level of the recent wave from the $3,060 swing low to the $3,402 high. The price finally tested $3,160 and is currently consolidating losses. There is also a short-term declining channel forming with resistance at $3,210 on the hourly chart of ETH/USD. Ethereum price is now trading below $3,220 and the 100-hourly Simple Moving Average. If the bulls can protect more losses below $3,160, the price could attempt another increase . Immediate resistance is seen near the $3,220 level. The first key resistance is near the $3,260 level. The next major resistance is near the $3,280 level. A clear move above the $3,280 resistance might send the price toward the $3,320 resistance. An upside break above the $3,320 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $3,400 resistance zone or even $3,450 in the near term. Downside Continuation In ETH? If Ethereum fails to clear the $3,220 resistance, it could start a fresh decline. Initial support on the downside is near the $3,160 level. The first major support sits near the $3,140 zone or the 76.4% Fib retracement level of the recent wave from the $3,060 swing low to the $3,402 high. A clear move below the $3,140 support might push the price toward the $3,080 support. Any more losses might send the price toward the $3,050 region. The main support could be $3,000. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI – The RSI for ETH/USD is now below the 50 zone. Major Support Level – $3,160 Major Resistance Level – $3,220",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57317060,
    "published": 1768878021000,
    "title": "Trade War Headlines Trigger $800M In Liquidations Overnight: Longs Get Wiped Out Across Crypto Markets",
    "body": "The crypto market faced a sharp selloff overnight as renewed trade conflict fears between the United States and the European Union shook global risk sentiment. Bitcoin and major altcoins reversed recent gains, with traders reacting to fresh tariff headlines and the possibility of escalating economic retaliation on both sides of the Atlantic. While crypto is often viewed as a separate market, this move once again showed how quickly digital assets can behave like high-beta risk trades when macro uncertainty spikes. Related Reading: Monero Triggers Retail Alert That Preceded ZEC And DASH Drops As Privacy Coin Hype Returns According to analyst Darkfost, the liquidation impact was immediate and aggressive. More than $800 million worth of leveraged positions were wiped out in a matter of hours, including roughly $768 million in long liquidations. The scale of long closures suggests that traders were positioned for continuation to the upside, but were caught offside as prices rolled over sharply. What stood out most was where the damage occurred. Darkfost noted that Hyperliquid recorded the largest share of forced liquidations, with $241 million, while Bybit followed closely with $220 million. The wave of liquidations appears partly tied to the announcement of new tariffs targeting Europe, which triggered an equally fast response from EU policymakers, reigniting the broader “trade war” narrative across markets. CME Opens the Door to Fresh Volatility Darkfost warns that the timing of this selloff matters as much as the liquidation size. As soon as CME trading opened, Bitcoin saw a sharp downside move, suggesting that institutional flows and macro-linked positioning played a direct role in the shakeout. In past risk-off episodes, the CME open has often acted like a volatility trigger, especially when markets are already fragile, and leverage is elevated across major exchanges. This is why the next few hours are critical. The same type of move could easily repeat at the opening of the US markets, where liquidity conditions and headline sensitivity tend to amplify reactions. If sellers press again, the market could see another cascade of forced closures, particularly in high-beta altcoins that remain vulnerable after the overnight wipeout. Related Reading: XRP Whale Inflows To Binance Hit Their Lowest Level Since 2021: Accumulation Behavior? The message is straightforward: stay cautious and avoid overexposure to leverage while the macro backdrop remains unstable. Liquidations can create sharp bounces, but they can also reset momentum quickly if fear spreads across risk assets. Darkfost adds that attention should remain on incoming political updates. The market is now trading the narrative, not just the chart. Further statements could arrive at any moment, and as history has shown, Trump often delivers market-moving headlines right in the middle of the weekend. Bitcoin Holds Fragile Rebound As Crypto Tests Macro Nerves Bitcoin is trading near $93,100 after a sharp rejection from the $96,000–$97,000 supply zone. The chart shows BTC still struggling below key moving averages, with momentum capped by the declining blue trendline overhead. This reinforces the idea that the latest upside attempt was more of a rebound than a clean trend reversal. Structurally, price is forming higher lows after the violent breakdown from the $110,000 area. However, the rebound remains vulnerable as long as BTC stays trapped beneath resistance and fails to reclaim the mid-$90,000s with conviction. The recent candles also highlight hesitation, with wicks suggesting aggressive selling into strength. Related Reading: Bitcoin Bull Score Hits Level Seen Only 7 Times In 6 Years – A Rare Historical Signal The red long-term moving average is rising near the low-$90,000s, acting as a potential dynamic support zone. If Bitcoin holds above that level, it keeps the recovery structure intact and prevents a deeper reset toward prior liquidity pockets. This matters for the broader crypto market. When BTC remains range-bound under resistance, altcoins usually struggle to sustain rallies and become more sensitive to liquidation-driven volatility. Risk appetite can return quickly, but it requires Bitcoin to break above resistance and hold. Until then, crypto remains in a fragile stabilization phase, not a confirmed bullish continuation. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Crypto|btc|BTCUSDT|crypto|Crypto analysis|Crypto Liquidation Data|crypto market|Crypto market data|crypto news|Trump trade war",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57316719,
    "published": 1768876999000,
    "title": "Bitcoin Price Action Turns Unsteady, Downside Threat Grow",
    "body": "Bitcoin price started a fresh decline below $94,000. BTC is consolidating losses and remains at risk of more losses if it dips below $91,500. Bitcoin started a sharp decline below $94,000 and $93,000. The price is trading below $93,000 and the 100 hourly Simple moving average. There is a bearish trend line forming with resistance at $94,600 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move down if it stays below the $94,000 zone. Bitcoin Price Turns Red Bitcoin price failed to stay above the $93,500 support and started a fresh decline . BTC declined sharply below the $93,000 and $92,500 support levels. The bears even pushed the price below $92,000. A low was formed at $91,866, and the price is now consolidating losses. There was a minor recovery wave above the 23.6% Fib retracement level of the recent decline from the $95,475 swing high to the $91,866 low. However, the bears remained active near $93,200. Besides, there is a bearish trend line forming with resistance at $94,600 on the hourly chart of the BTC/USD pair. Bitcoin is now trading below $93,000 and the 100 hourly Simple moving average. If the price remains stable above $92,000, it could attempt a fresh increase. Immediate resistance is near the $92,800 level. The first key resistance is near the $93,200 level. The next resistance could be $93,650 or the 50% Fib retracement level of the recent decline from the $95,475 swing high to the $91,866 low. A close above the $93,650 resistance might send the price further higher. In the stated case, the price could rise and test the $94,000 resistance. Any more gains might send the price toward the $94,500 level. The next barrier for the bulls could be $95,000 and $95,500. Downside Break In BTC? If Bitcoin fails to rise above the $93,650 resistance zone, it could start another decline. Immediate support is near the $92,000 level. The first major support is near the $91,800 level. The next support is now near the $91,200 zone. Any more losses might send the price toward the $90,500 support in the near term. The main support sits at $90,000, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $92,000, followed by $91,800. Major Resistance Levels – $93,650 and $94,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57316542,
    "published": 1768876247000,
    "title": "Ethereum L2 MegaETH peaks at 47K TPS ahead of ‘global stress test’",
    "body": "MegaETH will open its mainnet for several latency-sensitive apps as part of testing, targeting 11 billion transactions over a week while under load.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57316049,
    "published": 1768875018000,
    "title": "Ethereum posts record onchain activity as research points to possible spam-driven growth: Asia Morning Briefing",
    "body": "Data suggests much of the recent spike in Ethereum transactions is tied to address poisoning, a scam that relies on cheap “dust” transfers to contaminate transaction histories rather than organic user demand.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Ethereum News|ETH|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57315837,
    "published": 1768874411000,
    "title": "ETP Frenzy: Crypto Funds Attract Over $2 Billion This Week",
    "body": "Reports say global exchange-traded products tied to crypto pulled in about $2.2 billion in net inflows during the latest week, a jump that marked the strongest weekly move since October last year. Bitcoin-focused funds took the lion’s share, while Ether and a handful of altcoin products also saw fresh money enter. Related Reading: What’s Driving The $1.42 Billion Comeback In Spot Bitcoin ETFs? Rising Appetite For Bitcoin And Ether According to CoinShares, Bitcoin-led products accounted for most of the inflows, while Ether-linked ETPs grabbed a meaningful slice of new capital as well. Many investors treated these products as an easier way to get exposure to crypto without owning coins directly. The pattern points to growing comfort among big traders and funds with exchange-traded wrappers. Some Flows Came As Prices Moved The uptick in cash into ETPs coincided with a fresh push higher in prices for core tokens. Traders who had been on the sidelines made buys after recent rallies, and funds that track these assets reported higher trading volumes. That increase in trade activity helped push the headline inflow number into view. A few market watchers said the move looked like accumulation by longer-term holders, while others warned that part of the money could be short-term positioning around events and news. Ease Of Access Draws Institutional Money For many institutions, these products are more familiar than direct custody of crypto. Brokers and wealth managers can put them on client platforms with the same tools they use for stocks and bonds. Some banks and advisers have started to offer these ETPs as part of broader portfolios, which has helped open a new tap of capital. That said, differences in rules across countries still shape where the biggest flows land. Where The Money Went And What It Means Bitcoin ETPs were the main beneficiaries, taking most of the $2.2 billion. Ether funds also saw healthy inflows, and a small number of altcoin products attracted fresh cash. Related Reading: Bitcoin Bulls Fired Up As Saylor Teases ‘Bigger Orange’ After Huge Buy The data shows demand is not limited to a single corner of crypto anymore. Instead, investors are spreading bets across the biggest names while a few niche tokens get tested. This could mean more stable demand for core products, even when smaller tokens wobble. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|bitcoin|crypto|etf|ethereum|ETP",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57315167,
    "published": 1768872288000,
    "title": "Trove backlash grows after team retains $9.4M, new token drops 95% post-launch",
    "body": "Trove shocked the community last week with a last-minute decision to pivot its perps DEX from Hyperliquid to Solana, a move that upset many of its initial backers.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57328961,
    "published": 1768914011000,
    "title": "Shiba Inu Whales Are On The Move Again, 361 Billion SHIB Stuns Community",
    "body": "Shiba Inu’s on-chain data shows an interesting dynamic among SHIB holders and their relationship with crypto exchanges. Recent metrics from CryptoQuant show sustained withdrawals from exchanges alongside a noticeable increase in burn activity in the past few days, all of which are signs of tighter supply conditions. This dwindling exchange supply reflects hundreds of billions of SHIB tokens removed from exchanges in recent days in a trend that dates back up to a year. Massive Decline In SHIB Held On Exchanges According to data from on-chain analytics platform CryptoQuant, SHIB exchange reserves have declined noticeably as whale wallets withdraw large amounts of tokens from trading platforms. On January 16, the total Shiba Inu exchange reserves stood at approximately 82.6 trillion SHIB. As of January 20, that figure has fallen to about 82.23 trillion SHIB. This change means that roughly 370 billion SHIB has been removed from exchanges in just a few days. Such movements are typically attributed to whale activity, as transfers of this size are rarely caused by retail traders. When whales move SHIB off exchanges, the tokens are often sent to cold storage or long-term holding wallets, reducing the amount of supply immediately available for selling. SHIB Exchange Reserve. Source: CryptoQuant This short-term outflow also fits into a much larger trend of outflows from crypto exchanges since January 2025. CryptoQuant data shows that SHIB exchange reserves were close to 140 trillion tokens in early January 2025. Since then, however, SHIB whales have steadily reduced exchange balances, and this has pushed the reserves down to current levels around 82.2 trillion SHIB. The consistency of this decline suggests deliberate accumulation or long-term positioning by large holders. SHIB Exchange Reserve. Source: CryptoQuant Whale Activity Correlates With Increased SHIB Burn Rates Burn activity across the Shiba Inu network has intensified alongside whales withdrawing SHIB from exchanges. According to recent on-chain data, the SHIB burn rate has witnessed a jump of more than 1,200% in the past 24-hour period, with almost 29 million SHIB permanently removed from circulation. Although burns are not exclusively initiated by whales, large holders often play a role by sending large tokens to burn addresses or interacting with ecosystem mechanisms like Shibarium that lead to burns. Data from the burn tracker website Shibburn shows that the bulk of these burns were made with one single transfer of 28 million SHIB tokens sent to burn address CA. SHIB Burn Rate. Source: Shibburn.com According to CryptoQuant data, over 51.2 billion SHIB tokens have been withdrawn from crypto exchanges in the past 24 hours alone. So far, Shiba Inu’s price action has not made a decisive move in response to these changes. At the time of writing, Shiba Inu is trading at $0.00000794, up by 1% in the past 24 hours but down by 7.6% in a seven-day timeframe. SHIB Exchange Netflow. Source: CryptoQuant Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Shiba Inu|SHIB|SHIB news|SHIB price|Shiba Inu news|Shiba Inu Price|SHIBUSD|SHIBUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 44,
        "NAME": "SHIB",
        "CATEGORY": "SHIB"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57329112,
    "published": 1768914000000,
    "title": "Argentina’s Pomelo Raises $55 Million to Boost Payment Offerings",
    "body": "Argentina-based financial technology startup Pomelo has raised $55 million in a Series C round as it looks to deepen its presence in Latin America and expand globally with new products tied to stablecoins and real-time agentic payments.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      }
    ]
  },
  {
    "id": 57329433,
    "published": 1768915080000,
    "title": "Coinbase says capital access beats income in wealth creation",
    "body": "The policy paper argues that access to capital markets, rather than income or banking, now defines who can build wealth and says tokenization could widen participation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57329973,
    "published": 1768916762000,
    "title": "Morning Minute: NYSE Leans Into 24/7 Tokenized Trading Onchain",
    "body": "Crypto led the way and Wall Street is finally following, as the NYSE prepares to support 24/7 trading of tokenized stocks and ETFs.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Opinion",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 57330892,
    "published": 1768919405000,
    "title": "Slow Rug? Trump-Associated World Liberty Fi Accused Of Value Extraction",
    "body": "A governance vote at World Liberty Financial (WLFI), a DeFi project marketed around the Trump brand, is drawing allegations of “slow” value extraction after a prominent trader claimed affiliated wallets pushed through a proposal while many public holders remained unable to access or vote with their tokens. DeFi^2 (@DeFiSquared), who describes himself as the #1 ranked trader on Bybit in 2023 and 2024, wrote on X that he was “bringing up an alarming governance vote by World Liberty Fi this month that appears to be the start of a slow extraction of value from WLFI holders by the team.” World Liberty Fi Hit With ‘Rigged Vote’ Claims DeFiSquared wrote: “What you see above appears to be a rigged vote, where the majority of top voters are indicated to be team wallets or strategic partner wallets by Bubble Maps. This is in contrast to the real voters lower in the screenshot, who have all been locked from accessing their WLFI tokens since TGE, and unable to vote on an unlock until the team allows it.” Related Reading: Trump-Linked World Liberty Backs USD1 With Treasury-Fueled Expansion The proposal at the center of the thread is what he calls the “USD1 growth proposal.” He argues it reads as “fairly mundane” on its face, but says the governance sequencing is the tell: “why would the team go out of their way to force this vote through, instead of voting on the WLFI token unlock that the majority of holders are asking for?” His thesis hinges on WLFI economics. DeFiSquared claims WLFI holders “are not entitled to ANY protocol revenue at all,” and says the project’s “Gold Paper” specifies revenue routing: “75% of protocol revenue goes to the Trump family, and 25% goes to the Witkoff family.” In his framing, that creates a perverse incentive: “It’s actually as crazy as it sounds: the team is forcing a vote to sell WLFI tokens at the expense of locked holders, in order to fund protocol revenue that goes only to themselves.” Related Reading: Trump’s WLFI Moves To Contain Wallet Breach While Federal Inquiry Looms He also alleges the vote’s outcome was manufactured late in the process. “This vote was actually failing by the time it reached quorum with a majority of votes rejecting the proposal, until the team / partners forced the vote through,” he wrote, adding token allocation context: “the WLFI team is allocated 33.5% of all tokens and strategic partners another 5.85%, while the public sale was allocated only 20%.” Post-vote, he points to on-chain flows as corroboration, citing “fresh transfers such as this one of 500 million WLFI tokens to Jump Trading,” while “investor WLFI allocations remain forcibly locked.” DeFiSquared closes with a valuation and positioning call: “it’s difficult to see the intrinsic value behind a 17 billion dollar token that has no real governance power, no revenue share, and new foundation sell pressure occurring for their own benefit.” He adds he has shorted WLFI “on and off since pre-market prices above $0.34,” and expects continued downside “due to dilution, intentional extraction,” and “other factors related to Trump’s final term in office.” At press time, WLFI traded at $0.1608. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|Trump|WLFI|WLFI news|WLFI price|World Liberty Financial",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57331296,
    "published": 1768908920000,
    "title": "Makina loses $4.1 million in exploit tied to price-feed manipulation",
    "body": "An attacker used flash loans to manipulate pricing data in Makina’s DUSD/USDC Curve pool, draining more than $4 million before MEV bots captured part of the haul.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Makina|Flash Loans|cyber attacks|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 57332065,
    "published": 1768922660000,
    "title": "Bitcoin Dips Briefly Below $90,000 as Global Selloff Deepens",
    "body": "Bitcoin slid to its lowest level in more than a week on Tuesday, tracking a sharp selloff across global bond markets as investors continued to de-risk amid ongoing geopolitical tensions.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57331998,
    "published": 1768922635000,
    "title": "Bitcoin plunges below $90,000 amid global risk asset selloff",
    "body": "Ether is the worst performer among the major cryptos, down more than 6% over the past 24 hours and tumbling below $3,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Ethereum News|Market Wrap|Breaking News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57331917,
    "published": 1768922198000,
    "title": "Chainalysis bets on automation to scale onchain investigations beyond developers",
    "body": "The feature allows non-technical teams to conduct onchain investigations and compliance analyses without relying on custom code.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57332194,
    "published": 1768923080000,
    "title": "Ethereum DeFi Platform Makina Hit by Flash Loan Exploit, Loses $4M in ETH",
    "body": "The hacker used a flash loan to inflate prices on Makina’s USD-USDC liquidity pool, and then traded to make over $4 million.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|DeFi",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 57332314,
    "published": 1768921081000,
    "title": "TenX adds Tezos to its crypto treasury, targets staking revenue after buying 5.5M XTZ",
    "body": "The public blockchain infrastructure firm said it expects Tezos staking yields in the high single digits and plans to disclose rewards in its financial reporting.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Treasury|Crypto Capital|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57332781,
    "published": 1768924824000,
    "title": "XRP Price At $10 Too Low? Pundit Says That’s For Retail, Reveals Institutional Targets",
    "body": "Crypto pundit XRP Queen has described an XRP price target of $10 as being too low, claiming that this target was from a retail investor’s perspective. She also suggested how high the altcoin could go from an institutional standpoint. Pundit Claims XRP Price Target Of $10 Is Too Low In an X post, XRP Queen stated that people predicting XRP price targets of between $10 and $25 are still thinking of retail price targets. This came as she claimed that Ripple has been thinking about global infrastructures. The pundit highlighted the firm’s moves, including its acquisition of payment and custody infrastructure. Related Reading: XRP Price Could Surge Another 30% If This Trend Is Confirmed Furthermore, XRP Queen noted that Ripple has integrated with banks, funds, and institutions, which she claimed is positioning the altcoin for real-time global settlement. The pundit also believes that the crypto firm has secured regulatory clarity where it actually matters, which is bullish for the XRP price. Lastly, she mentioned that Ripple is actively pursuing a full banking license, having secured conditional approval from the Office of the Comptroller of the Currency (OCC). XRP Queen declared that Ripple’s moves are how one builds financial plumbing. “Systems don’t move in pennies. They move in orders of magnitude. Lock in,” she added. Regarding how high the XRP price could rise based on institutional targets, XRP Queen suggested the altcoin could reach $100. In an X post, she stated that people laugh at an XRP price target of $100 because they price it like a meme, but that institutions price the altcoin like infrastructure. As such, she believes the altcoin could reach these price targets based on its utility, especially as it gains traction as a token for real-time global settlement. Canary Capital CEO Makes Bullish Case For XRP In a YouTube video, crypto pundit Cheeky Crypto highlighted a statement from Canary Capital’s CEO, Steven McClurg, in which he said that an XRP price target of between $5 and $10 may sound like a lot to a retail trader. However, he believes that these price targets are a rounding error when one considers the trillions of dollars in liquidity required to settle global real-world assets (RWAs) at scale. Related Reading: XRP Wave C Push On The Way: What Could Send Price Below $2? Cheeky Crypto also highlighted McClurg’s statement, in which he said the XRP Ledger is already processing real financial transactions and boasts real-world financial use cases, which he claims are drawing institutions’ attention. Notably, the Canary Capital CEO had recently predicted that XRP would dominate the RWA industry, which is projected to become a trillion-dollar industry at some point. This could boost the altcoin’s utility as the XRP Ledger processes more RWA transactions, sending the XRP price higher in the process. At the time of writing, the XRP price is trading at around $1.95, down in the last 24 hours, according to data from CoinMarketCap. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|altcoin|Canary Capital|Cheeky Crypto|CoinMarketCap|occ|Office of the Comptroller of the Currency|Real world assets|Ripple|RWAs|Steven McClurg|xrp|XRP Ledger|xrp news|XRP Price|XRP Queen|XRPL|XRPUSD|xrpusdt|YouTube",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57332778,
    "published": 1768924800000,
    "title": "Chainlink expands data streams to cover multitrillion-dollar U.S. stock market",
    "body": "The upgrade uses a \"pull\" model for sub-second updates, allowing more advanced trading logic and avoiding high gas costs.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Chainlink|Tokenization|tokenized stocks|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57333000,
    "published": 1768925428000,
    "title": "Trump's new CFTC chief Selig starts 'future-proof' initiative to champion crypto",
    "body": "Commodity Futures Trading Commission Chairman Mike Selig signals an intent to set crypto policy into formal rules that would be hard to reverse down the road.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|U.S. Commodity Futures Trading Commission|Mike selig|crypto policy|Regulation|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 16,
        "NAME": "COMMODITY",
        "CATEGORY": "COMMODITY"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57333030,
    "published": 1768925404000,
    "title": "How a third-party data leak led to phishing attempts against Ledger users",
    "body": "A third-party e-commerce breach exposed order data, enabling phishing attempts without compromising Ledger wallets or self-custody systems.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      }
    ]
  },
  {
    "id": 57333284,
    "published": 1768926000000,
    "title": "Solana slips below $130, but onchain data suggests SOL remains bullish",
    "body": "SOL price slipped under $130, but whale accumulation amid declining supply on exchanges and strengthening on-chain metrics point to a potential for recovery.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57333281,
    "published": 1768925235000,
    "title": "Crypto sells off amidst Trump Tariff Turmoil! $Trove falls 90% in awful TGE! Pump Fund announced!",
    "body": "Crypto majors are red following Trump’s tariff turmoil; BTC -2% at $91,100; ETH -4% at $3,105, SOL -3% at $129; XRP -2% to $1.93. CC (+12%), MYX (+5%) and SYRUP (+4%) led top movers. The NYSE began preparations for 24/7 tokenized stock and ETF trading. Steak ’n Shake revealed roughly $10M in Bitcoin exposure alongside the creation of a corporate BTC strategic reserve. Vitalik Buterin called for more sophisticated DAO governance models to improve accountability, coordination, and long-term sustainability. Bermuda outlined plans for a fully onchain national economy, working with Coinbase and Circle on payments, identity, and tokenized financial infrastructure. In Corporate Treasuries / ETFs. The BTC ETFs saw $394M in net outflows on Friday breaking a 4-day inflow streak; ETH ETFs stayed green with $4.7M in inflows. In Memes / Onchain Movers. Meme majors were red along with majors; Doge -1%, Shiba -1%, PEPE -2%, TRUMP -1%, Bonk -1%, Pengu -4%, SPX -12%, WIF -1% and Fartcoin -8%. USOR (+70%), GSD (+50%), and Eliza Town (+800%) led onchain movers.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57333526,
    "published": 1768926912000,
    "title": "Bitcoin Dips Under $90K as Crypto Stocks Plunge Amid Fresh Trump Trade War Turmoil",
    "body": "Crypto-focused stocks Strategy and SharpLink Gaming dropped sharply as Bitcoin fell below $90,000 amid Trump's latest tariff threats.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57333468,
    "published": 1768926806000,
    "title": "Trump Media sets date for airdrop of digital tokens to DJT shareholders",
    "body": "Crypto.com will mint nontradable tokens for DJT shareholders on Feb. 2, as Trump Media expands its blockchain rewards strategy.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Trump|Djt|World Liberty Financial|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 204,
        "NAME": "AIRDROP",
        "CATEGORY": "AIRDROP"
      }
    ]
  },
  {
    "id": 57334013,
    "published": 1768928447000,
    "title": "Solayer unveils $35 million fund for real-time DeFi, AI and tokenization apps on infiniSVM",
    "body": "Funded by Solayer Labs and Solayer Foundation, the effort targets onchain apps with revenue and high usage potential.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|crypto ecosystem|Funding|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 57333801,
    "published": 1768927453000,
    "title": "Ray Dalio warns of banks shying away from fiat, praises gold surging",
    "body": "The hedge fund manager said central banks were not handling fiat in the same way, warning of a breakdown in the global monetary order.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 57334594,
    "published": 1768930204000,
    "title": "Is Dogecoin About To Repeat NVIDIA’s Run? Here’s What The Chart Says",
    "body": "Comparing Dogecoin to NVIDIA may seem illogical at first. One is a speculative digital asset rooted in internet culture, while the other is a leading equity in the AI and tech sector. However, a chart shared by cycle analyst @Cryptollica reframes the comparison by stripping away narrative and focusing on capital flows. Rather than asking which story is more compelling, it examines how money has historically rotated between established market leaders and high‑risk assets as cycles mature. What The Dogecoin—NVIDIA Chart Is Showing Investors The chart posted by Cryptollica tracks the DOGE-to-NVIDIA ratio across multiple market cycles, emphasizing relative performance rather than absolute price. This perspective matters because it highlights where capital has generated the highest marginal returns over time. Historically, the ratio has moved within a clearly defined downward channel, with major turning points occurring when the price reaches the lower boundary of that structure. During both the 2017 and 2021 cycles, the ratio compressed into this same support area. In each case, NVIDIA had already realized significant upside, while Dogecoin remained heavily discounted in relative terms. What followed was not a breakdown in NVIDIA’s price, but a period where Dogecoin significantly outperformed as speculative capital rotated back into higher-risk opportunities. The current structure mirrors those earlier conditions. The ratio is again testing long-term support, signaling a familiar imbalance: extended gains already priced into NVIDIA, and suppressed relative value in Dogecoin. In previous cycles, this setup preceded sharp shifts in relative performance as liquidity began favoring assets with greater upside sensitivity. What A Rotation Environment Means For Dogecoin The pattern highlighted by the chart centers on rotation rather than decline. When leading trades lose momentum, capital typically stays within the market and seeks higher beta exposure. Historically, Dogecoin has benefited during these transitions, serving as a vehicle for speculative flows once dominant growth assets reached saturation. This does not imply weakness in NVIDIA’s underlying fundamentals. Its valuation remains tied to sustained AI-driven growth expectations. Dogecoin, however, operates under a different dynamic, driven largely by sentiment and liquidity conditions. When markets move from concentration into dispersion, assets like DOGE have previously delivered outsized percentage gains. The chart suggests that a similar environment may be forming again. At comparable points in past cycles, Dogecoin outperformed after NVIDIA-like leaders had already completed their primary expansion phase. If the ratio holds its historical support, the data points to a renewed window where DOGE could outperform on a relative basis. Rather than predicting hype-driven rallies, the chart highlights a recurring structural relationship between capital leaders and speculative assets. Whether the pattern repeats will depend on liquidity and risk appetite, but the setup reflects a consistent historical behavior that has appeared more than once across market cycles. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57334325,
    "published": 1768929404000,
    "title": "Tokenized gold volumes beat most ETFs as metal rallies toward $5,000",
    "body": "Crypto tokens backed by gold booked $178 billion trading volume last year, surpassing all but one major gold ETF, a report showed.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Gold|Tokenized Assets|Tether Gold|Paxos|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 57335208,
    "published": 1768931954000,
    "title": "RedStone acquires Security Token Market, TokenizeThis conference",
    "body": "The deal adds a long-running dataset on tokenized real-world assets to RedStone’s oracle business as RWA activity spans public blockchains and institutional networks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57335061,
    "published": 1768931471000,
    "title": "Polymarket Banned in Portugal, Hungary as Prediction Market Pushback Grows",
    "body": "Regulatory actions are ramping up globally even as prediction market companies claim they’re not offering gambling services.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57335841,
    "published": 1768933767000,
    "title": "Massachusetts Can Ban Kalshi Sports Markets for Now, Judge Rules",
    "body": "A judge granted a preliminary injunction that could force Kalshi to stop offering sports-related prediction markets in the state as soon as Friday.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57336383,
    "published": 1768935274000,
    "title": "US CFTC chair Selig appoints crypto lawyer as senior adviser",
    "body": "Michael Selig named two people as senior advisers, one of whom helped with a law firm‘s letter that led to an SEC no-action letter on crypto custodians.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57337613,
    "published": 1768938784000,
    "title": "Massachusetts judge bars Kalshi from offering sports bets: Report",
    "body": "The preliminary injunction against the predictions market platform came at the request of Massachusetts Attorney General Andrea Joy Campbell.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57333213,
    "published": 1768926144000,
    "title": "Bitcoin falls below $90,000 amid new tariff war concerns, bond selloff: Markets Liveblog",
    "body": "Analysts, CoinDesk reporters and longtime industry participants weigh in on today's bitcoin, crypto and market price action.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Top Stories|Bitcoin News|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57338245,
    "published": 1768941051000,
    "title": "XRP Bullish Divergence Shows The Next Direction That Price Is Headed In",
    "body": "XRP might be currently trading in corrections, but technical analysis shows the cryptocurrency is still headed in an upward direction. A recent analysis shared on X by crypto analyst JD frames the pullback as a calculated reset, arguing that the correction fits neatly into a larger setup that may determine XRP’s next major move. The lower the XRP price goes, the higher the breakout will be. Falling Wedge Breakout: The July 2025 Precision Move Technical analysis shared on X by crypto analyst JD shows that XRP’s price action has been following a well-laid-out plan that goes as far back as early 2025. The 3D candlestick price chart shows that XRP spent the first half of 2025 trading inside a falling wedge, a structure that is known for resolving to the upside. Related Reading: Analyst Says XRP Price Just Entered Neutral State – What This Means That setup played out cleanly in July 2025, when the XRP price broke above the falling wedge and reached JD’s projected measured target with accuracy. The completion of that measured target led to the start of a correction, which is where the current technical structure comes into focus. After the July breakout, XRP transitioned into a descending broadening wedge characterized by lower lows and lower highs that expand over time. This structure has governed price action since mid-2025 and explains the steady grind lower. JD’s comments reference this phase directly, noting that the recent 23% correction unfolded as he had predicted. With this in mind, the analyst noted that the lower the XRP price goes, the higher the breakout will be. Next Direction For XRP Price The descending broadening wedge on the three-day chart comes with a clear measured projection that outlines where this corrective phase could terminate. As it stands, there’s still a possibility that the XRP price will continue declining to as low as $1.5 before rebounding at the lower trendline of the descending wedge. Related Reading: XRP/Gold Ratio Just Reached A Historical Support Zone, What This Means For Price If the price reaches this projected region and selling pressure weakens as anticipated, the setup favors a sharp reversal higher, consistent with how XRP previously reacted after the falling wedge completed in July 2025. However, it is important to keep in mind that the price doesn’t necessarily have to fall to as low as $1.5 before an upward rebound happens. On the other hand, an eventual break above the upper trendline of the descending wedge is projected by crypto analyst JD to push XRP as high as $4, which would place the cryptocurrency trading at new price highs. The most important thing right now is a close above $2.3 in order to cement this break above the descending wedge. At the same time, on-chain data points to cautiousness in the near term. Data from Glassnode shows that XRP is slipping back into a cost-basis setup similar to what was last observed in February 2022, a trend that might influence sell pressure in the near future. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Descending Wedge Pattern|JD|Ripple|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57338101,
    "published": 1768940565000,
    "title": "Massachusetts judge poised to tell Kalshi to stop taking sports bets in state",
    "body": "The prediction market platform Kalshi will be preliminarily ordered by a superior court justice in Massachusetts to halt its online sports business there.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Massachusetts|Kalshi|Prediction Markets|Court Filings|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57340059,
    "published": 1768946437000,
    "title": "XRP’s Quiet Phase May Be Setting Up A Sudden Breakout: Expert",
    "body": "XRP’s next big rise could come with hardly any warning, traders and analysts warn. Markets are quiet now. That quiet has happened before, and it has sometimes been followed by sharp moves that catch most people off guard. Related Reading: Bitcoin Senses Risk As Trump Balks At Europe With Major Tariffs History Of Sudden Moves According to several community analysts, XRP has a pattern of long quiet periods followed by fast spikes. It rarely creeps steadily upward for weeks before a charge. Instead, price often treads water, people lose faith, and then momentum arrives quickly. That behavior has left many short-term traders on the sidelines when runs happen. A move looks obvious only after it is already well under way. Legal Overhang Gone Reports say the SEC lawsuit changed XRP’s timing for years. While other tokens took part in big market swings, XRP traded under heavy regulatory pressure. That pressure is now removed. The major $XRP breakout will come when many least expect it. Its always a “catch-off-guard” move.. but we’re prepared. — 🇬🇧 ChartNerd 📊 (@ChartNerdTA) January 17, 2026 The market has since been allowed to price XRP without that cloud. In late 2024, a notable rally began after US President Donald Trump’s win and the exit of SEC Chair Gary Gensler. Momentum pushed XRP from roughly $0.50 to above $3 in a matter of weeks. But the gains were followed by a long reset. Exposure Beats Perfect Timing According to a number of commentators, being already invested matters more than hitting the exact bottom. When the price starts to climb fast, buyers who jump in late often pay too much and panic-sell when the heat fades. Early holders tend to capture most of the upside. Reports note this has repeated across multiple cycles. Emotion drives late entry; calm positioning often wins. At the time of writing, XRP was trading near $1.93, down about 4% on the day and roughly 55% below its recent high. Many who bought above $3 over the past year have cut losses or reduced positions, which has left sentiment thin. Related Reading: Bitcoin Shows Signs Of Internal Strength As Analysts Turn More Optimistic On Quick Inflows & Short-Term Squeeze Liquidity in key ranges is lighter than traders might assume. Volume patterns and derivatives flows will matter if price begins to move again. An array of factors could start the run — quick inflows, a shift in macro appetite, or a big buyer showing up. On-chain signs, exchange flows, and futures positioning would give clearer clues, but those signals can flip fast. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|crypto|Ripple|sec|xrp|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57339807,
    "published": 1768945556000,
    "title": "Bitcoin enters Delaware Life’s retirement annuity portfolio",
    "body": "The product gives retirement investors indirect Bitcoin exposure through a BlackRock index built on the company's spot Bitcoin ETF.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57340087,
    "published": 1768946431000,
    "title": "Trump Tariff Threat Leaves Bitcoin Out in the Cold",
    "body": "Emily Nicolle questions whether a Bitcoin rebound might be on the cards under renewed pressure from Donald Trump’s tariff threats.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57340434,
    "published": 1768947473000,
    "title": "Delaware Life, BlackRock Offer Bitcoin Exposure Through Fixed Indexed Annuity",
    "body": "Delaware Life breaks new ground with the insurance industry's first Bitcoin-linked annuity, offering crypto exposure with principal protection.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57341238,
    "published": 1768949924000,
    "title": "Trump Media Set to Issue Non-Transferable Crypto Tokens, Cutoff Date February 2",
    "body": "Trump Media & Technology Group Corp. (DJT) has officially announced the date for its highly anticipated distribution of a new digital token to its shareholders, as part of its partnership with cryptocurrency exchange Crypto.com. The record date for this digital token initiative will be February 2, 2026. Trump Media’s New Crypto Initiative According to the announcement, eligible shareholders will include ultimate beneficial owners and registered holders of at least one whole share of DJT stock as of the record date. In order to ensure a smooth distribution process, Trump Media will gather information from broker participants about eligible holders. Related Reading: Is A New XRP Price Record Imminent? Analyst Forecast Colossal Short Squeeze Ahead After the record date, Trump Media plans to collaborate with Crypto.com to mint the digital tokens, which will be displayed on the blockchain and held in custody until distribution. In addition to the digital tokens, Trump Media has indicated that various rewards will be made available to record-date shareholders throughout the year. These rewards may include benefits or discounts associated with Trump Media’s offerings, such as Truth Social, Truth+, and Truth Predict. CRO Token Plummets The partnership between Crypto.com and Trump Media dates back to August last year, when the Trump-linked company announced a $6.4 billion investment in the crypto exchange’s native token, CRO, as part of a strategic reserve. Related Reading: Ethereum Poised For $4,000 Breakout? Expert Pinpoints On-Chain Triggers For Potential Rally Devin Nunes, Trump Media’s CEO and Chairman, expressed his enthusiasm about the latest move and the partnership with Crypto.com, stating: We look forward to leveraging Crypto.com’s blockchain technology consistent with Securities and Exchange Commission guidance to benefit our shareholders and promote transparency, including by obtaining a clear picture of bona fide beneficial ownership as of the record date. Despite the latest announcement, Crypto.com’s native token failed to capitalize on the news, dropping to $0.089 on Tuesday amid the broader crypto market’s retracement. It has recorded an 11% drop in the past week alone. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|CRO|CRO price|CROUSDT|crypto market|crypto news|crypto.com|Crypto.com Exchange|Crypto.com news|Trump|Trump media|Trump media crypto news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 75,
        "NAME": "CRO",
        "CATEGORY": "CRO"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57342529,
    "published": 1768953606000,
    "title": "Bitcoin Whale Panic Fades: Sell Pressure On Binance Falls Off A Cliff",
    "body": "Bitcoin’s exchange-side supply signal is flashing a notable change: whale-sized transfers into Binance have dropped sharply from late-November panic levels, suggesting large holders are no longer leaning on the sell button with the same urgency. Selling Pressure From Bitcoin Whales Fade CryptoQuant contributor Darkfost said current data shows a “clear decline in whale transactions,” specifically BTC inflows to exchanges, meaning “large holders are sending significantly less BTC to trading platforms than before.” In the post, the chart focus was Binance inflows segmented by transaction size, spanning transfers from 100 BTC up to the largest prints above 10,000 BTC, flows that are commonly interpreted as potential sell-side positioning when they hit an exchange. Related Reading: Why Is Bitcoin And Crypto Down Today? Key Drivers Behind The Move The key backdrop in Darkfost’s thread is how quickly whale behavior shifted around the market’s late-2025 drawdown. “December has been particularly challenging, even for these investors,” the analyst wrote, adding that whales are typically “more cautious” and “less sensitive to market movements than retail participants,” often acting with “greater discipline and patience.” That discipline appeared to crack as Bitcoin rolled over from its latest all-time high near $126,000. Darkfost described a surge in whale inflows to Binance at the end of November as BTC “continued its correction,” with the “average monthly total” reaching “nearly $8 billion” during a period when BTC “fell back below the $90,000 level.” “This phase clearly triggered a panic-driven move,” the post said. “Transactions ranging between 100 and 10,000 BTC increased significantly, especially as price broke below the $85,000 level. This behavior reflects real stress among certain whales, who chose to sell quickly in order to limit losses, thereby reinforcing selling pressure on the market.” The crux is what changed since that cluster. “Today, the situation looks very different,” Darkfost wrote. Those Binance inflows “have been divided by three and now stand at around $2.74 billion,” with “daily movements” becoming “far less frequent than during the cluster observed at the end of November.” Related Reading: Is Bitcoin Really In A Bear Market? Why January 20 Matters The analyst framed the drop as an observable behavioral pivot rather than a single-day anomaly. “This shift in dynamics suggests that whales have changed their behavior,” Darkfost wrote. “They are no longer selling aggressively and now appear to favor waiting.” Institutional Demand Side Remains Robust While Darkfost’s post focuses on whale-associated inflows as a proxy for potential sell pressure, CryptoQuant CEO Ki Young Ju pointed investors to the other side of the ledger: institutional accumulation. “Institutional demand for Bitcoin remains strong,” Ki wrote on X. “US custody wallets typically hold 100–1,000 BTC each. Excluding exchanges and miners, this gives a rough read on institutional demand. ETF holdings included.” Ki added that “577K BTC ($53B) [was] added over the past year, and still flowing in,” characterizing the trend as ongoing rather than a completed wave. At press time, Bitcoin traded at $90,885. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|Bitcoin Whale News|Bitcoin whales|btc|BTC news|btc price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57343741,
    "published": 1768957242000,
    "title": "Bitcoin Bear Market Depths: A Closer Look At How Low BTC Could Go",
    "body": "On Tuesday, Bitcoin (BTC) dipped below the significant $90,000 mark once again, raising concerns about the possibility of entering a new bear market and casting doubt on the cryptocurrency’s prospects. Market analyst Raun Neuner published a new analysis of the situation in a post on X (formerly Twitter). Is $37,000 On The Horizon? Neuner highlighted that while stocks are performing robustly and commodities are experiencing what he calls a “supercycle,” the crypto market still struggles to gain traction. This situation raises the critical question: What is the worst-case scenario for Bitcoin? Related Reading: Ethereum Poised For $4,000 Breakout? Expert Pinpoints On-Chain Triggers For Potential Rally Historically, Bitcoin’s bull markets tend to peak approximately 532 days after each Halving event. Applying this pattern to the current cycle suggests that Bitcoin could have reached its peak around early October, where it briefly touched $125,000. Historical trends show that following these peaks, Bitcoin typically endures a substantial decline of 70 to 80%. If this framework holds for the current cycle, Neuner estimates a potential downturn to around $37,000 in the event of a full bear market. Zooming out to consider broader traditional market dynamics provides further context. After a year marked by strong performances in both stocks and commodities, market corrections are to be expected. During risk-off periods in equity markets, Bitcoin has historically amplified these downward moves, contributing to building pressure toward the lower end of the spectrum. The analyst indicates that a key reference point for Bitcoin might be around the $57,000 mark, where the 200-week moving average (MA) resides. Critical Bitcoin Support Levels To Watch The immediate factors contributing to Bitcoin’s recent drop below the $90,000 threshold are linked to heightened volatility in global bond and equity markets, exacerbated by geopolitical tensions. Walter Bloomberg, an expert in market analysis, pointed out that the new downtrend has been spurred by various macroeconomic factors, including renewed threats from President Trump regarding tariffs on Greenland and Japan’s fiscal strategies that have added to market instability. Related Reading: Is A New XRP Price Record Imminent? Analyst Forecast Colossal Short Squeeze Ahead Consequently, investors have turned to safe-haven assets like gold, which recently reached a record price exceeding $4,700. In response, Bloomberg warns that macro risks may be underappreciated. Demand for downside protection in Bitcoin’s options market is also rising, indicating that investors are aware of the potential for further declines. The next significant levels for the Bitcoin price in the near term, according to Bloomberg, lie between $84,000 and $85,000, which are expected to act as support for BTC. If the cryptocurrency fails to hold these levels, fears of a deep bear market may become more pronounced. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin bear|bitcoin bear market|Bitcoin Bear Market Lows|Bitcoin news|bitcoin price|bitcoin technical analysis|btc|BTC news|btc price|BTCUSDT|crypto|crypto market|crypto news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]