[
  {
    "id": 57935686,
    "published": 1770829245000,
    "title": "Bitcoin Moves With Tech, Not Precious Metals, Analysts Find",
    "body": "Bitcoin’s image as a steady store of value is being tested. What once was talked about as a hedge against uncertainty now moves more like a high-upside, high-risk bet. Related Reading: Jim Cramer Suggests US Government Could Buy Bitcoin Near $60K Signals Of A Growth Asset According to Grayscale, recent trading patterns show Bitcoin tracking closely with shares of software companies rather than with gold or silver. That change in behavior has been noticeable since early 2024, when institutional flows and exchange-traded products pushed crypto into more mainstream hands. Reports say investors who chase growth — many drawn by the AI story — have been selling software names hard, and Bitcoin has followed some of that pressure. Institutional Links And Market Forces Reports note that deeper ties to traditional markets explain part of this shift. Large firms, ETF mechanics and growing institutional holdings mean movements in stock markets can spill into crypto. There has also been active selling from US-based accounts that left Bitcoin trading at a discount on some platforms. That selling happened after a string of big liquidations late in the year and again in recent weeks, which amplified losses for traders who used leverage. Where Price Stands Now Bitcoin is changing hands around $66,900, with clear resistance near $69,900 and support levels slipping under $66,600. The swings are sharp and intraday moves can be wide, reflecting a mood that is cautious and reactive. From its peak above $126,000 in October, the market has pulled back by roughly 50% in several waves, which shows how quickly sentiment can turn against even the most talked-about crypto. Gold, Geopolitics And Risk Appetite Reports point out that bullion has climbed to fresh highs while Bitcoin has failed to mirror those safe-haven flows. Rising geopolitical friction has driven some money into metals and away from riskier bets, including tech shares and crypto. Traders who expected Bitcoin to act like a fortress against turmoil have found that, for now, it behaves more like an asset whose value rises on hope and falls when fear returns. A return of fresh capital would likely be needed to steady prices. ETF inflows could help, and a renewed wave of retail buyers would too. Research suggests that retail interest is currently focused on AI stories and growth narratives, which leaves crypto out of favor for many individual investors. That concentration of attention matters: capital flows are what lift or sink these markets. Related Reading: After Predicting XRP’s Drop, Analyst Says The Bottom May Be In Bitcoin Tracks Tech, But Long-Term Value Still Intact Grayscale says Bitcoin’s recent moves mirror tech stocks, not gold, but its long-term potential as a store of value remains. Short-term swings reflect market integration and investor activity, while future performance will depend on capital flows and broader economic trends. Featured image from ETF Trends, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|AI|bitcoin|btc|btcusd|digital currency|gold|safe haven asset|Tech|tech stocks",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57935768,
    "published": 1770829199000,
    "title": "Malaysia's central bank announces stablecoin and tokenization sandbox",
    "body": "The pilot programs explore wholesale settlement between institutions and real-world use cases, along with stablecoin development and tokenized bank deposits.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 57935591,
    "published": 1770829040000,
    "title": "Uniswap Token Jumps Following BlackRock Investment as BUIDL Goes DeFi",
    "body": "Uniswap’s governance token jumped after the decentralized exchange’s creators announced an integration with BlackRock's tokenized fund.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "uniswap|DeFi",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 53,
        "NAME": "UNI",
        "CATEGORY": "UNI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57934249,
    "published": 1770825610000,
    "title": "XRP ‘Looks Different’ This Cycle, Targets No. 2 Spot: Crypto Analyst",
    "body": "Crypto Insight UK director Will Taylor argued in a new video that XRP is “trading different” this cycle and said he sees a credible path for it to challenge Ethereum’s long-held No. 2 position, with an outside chance of even pressuring bitcoin if the right mix of narrative and market structure lands. The “XRP Curveball” Theory Taylor anchored his thesis to a comment he highlighted from Mark Yusko, a well-known bitcoin-focused investor, who warned of a potential “curveball” tied to XRP and a future where policymakers clamp down on private stablecoins. Yusko, in Taylor’s telling, speculated that a “CBDC version” could emerge where authorities effectively steer users away from assets like USDT and USDC, a framing Taylor said resonated with what parts of the XRP community have anticipated for years. Mark Yusko says he’s watching for a potential policy curveball, including a future CBDC framework that could restrict private stablecoins like USDT and USDC, while noting $XRP activity may be happening more behind the scenes. 🤯 https://t.co/ba4aqu2dLN pic.twitter.com/bpWBw7lGX2 — Xaif Crypto🇮🇳|🇺🇸 (@Xaif_Crypto) February 9, 2026 “Now, what have I been saying about XRP this cycle? I’ve said that it looks different,” Taylor told viewers. “I’ve said that I think it will challenge ETH for spot number two. And I also think that there’s a potential that it challenges Bitcoin for the number one spot this cycle. And I know that a lot of people don’t agree… but that’s actually what I think.” Related Reading: Glassnode: XRP Is Back In Its 2021-2022 Playbook As SOPR Drops Sub 1 Taylor was careful to frame the idea as a non-base-case scenario while emphasizing why he believes XRP is uniquely positioned if US policy and institutional incentives shift in its favor. He pointed to Ripple’s US footprint, its endurance through regulatory “trials and tribulations,” and what he characterized as proximity to political power in Washington. In his view, those factors could matter if the next phase of crypto adoption is shaped as much by compliance architecture as by ideology. He also cited comments from Ray Dalio, referenced via an interview Taylor said aired “yesterday,” where Dalio discussed a future of reduced transactional privacy and the risk of being “shut off” if politically disfavored, a scenario Taylor linked to broader CBDC discourse. Taylor emphasized that his point was not whether such an outcome is desirable, but that traders should position for what they think is most likely to happen, not what they want to happen. “If I could change the way that I thought the world was going to be, I would put my capital somewhere else and I’d make the world a different place,” Taylor said. “But I’m not born in a world that I get to choose what happens in the future. But I am born into a world where I get to see what I think is going to happen and place my bets accordingly. It’s just like trading. You don’t trade or place an investment on something you want to happen. You place it on something that you think is going to happen.” XRP Vs. ETH Vs. BTC On the market-structure side, Taylor focused on bitcoin dominance, arguing it is “really, really tight” on Bollinger Bands, a condition he reads as a volatility setup. He revisited a historical example where an 11% bitcoin pullback preceded what he described as a 490% XRP surge, and argued that, historically, drops in bitcoin dominance have tended to coincide with sharp XRP outperformance. Taylor’s core claim is that the compression in dominance has persisted for roughly six months and is now at levels he compared to an earlier era, “before ETH and ICOs”, when dominance dynamics looked structurally different. He allowed for the opposite outcome, where dominance squeezes higher and bitcoin “sucks the liquidity in,” but said he increasingly favors a downside dominance break that would mechanically strengthen the case for altcoin beta, with XRP as a candidate beneficiary if narrative catalysts arrive alongside the move. Related Reading: XRP Price To $1 Or $10? Analyst Warns Investors Of Possible Crash Taylor also leaned on Binance volume comparisons across three-day candles, arguing XRP’s recovery volume looked more aggressive than the preceding selloff, while he said sellers appeared more dominant in ETH and BTC over the same framing. He tied that relative read to XRP cross charts versus ETH and BTC, describing repeated attempts at range resistance and suggesting a “positive price action” trigger could accelerate XRP’s relative breakout. He flagged near-term calendar items, including yesterday’s Clarity Act meeting and the XRP Community Day today, while cautioning against assuming a reflexive pump. Still, Taylor’s broader point was about positioning into a regime shift he believes could arrive quickly, pointing to visible liquidity concentrated above spot levels on his charts, extending from roughly $1.50 up toward $4.30, with comparatively less liquidity stacked below. “I think people are going to be shocked when we start to reverse and we reverse quickly,” Taylor said, arguing that a fast upside move could force traders out of short-term positioning. He then mapped his most bullish path: bitcoin returning to new highs – he floated 150K and “180-ishk plus” as targets – while bitcoin dominance “nukes,” setting up what he called “crazy price action” for XRP if it captures share of that dominance unwind. At press time, XRP traded at $1.3594. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|ETH|ethereum|xrp|XRP analysis|xrp news|XRP Price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57934219,
    "published": 1770825484000,
    "title": "Cryptos crumble, bitcoin falls through $66,000, as Friday's bounce fades",
    "body": "With so many other asset markets in rally mode, investors for the moment appear to have moved on from crypto.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57933948,
    "published": 1770824626000,
    "title": "Inside The 'Clipping Farms' Driving Fintech's Marketing Boom",
    "body": "Fintech and crypto firms are paying freelance editors as little as $1 per thousand views to flood social feeds with branded clips. Regulators are scrambling.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57936400,
    "published": 1770831260000,
    "title": "JPMorgan bullish on crypto for rest of year as institutional flows set to drive recovery",
    "body": "After bitcoin fell below its estimated production cost, the bank said stronger fundamentals and rising institutional inflows could lift crypto in 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Institutional Adoption|JPMorgan Chase|Gold|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57936381,
    "published": 1770831122000,
    "title": "Susquehanna-Backed Crypto Lender BlockFills Suspends Withdrawals as Bitcoin Sinks",
    "body": "Crypto firm BlockFills said it has temporarily halted deposits and withdrawals on its platform amid falling crypto prices and volatility.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57936769,
    "published": 1770832028000,
    "title": "BlackRock enters DeFi, taps Uniswap for institutional token trading",
    "body": "BlackRock is bringing its $2.1 billion tokenized Treasury fund to Uniswap, expanding institutional access to DeFi and deepening Wall Street’s push into onchain finance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 53,
        "NAME": "UNI",
        "CATEGORY": "UNI"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57937187,
    "published": 1770833205000,
    "title": "Gen Z 'nihilism' is fueling a $100 trillion crypto derivatives boom in response to a broken system",
    "body": "A significant increase in housing costs makes home ownership unattainable for many Gen Z individuals, leading to financial nihilism, said CoinFund's David Pakman.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Consensus Hong Kong 2026|perpetual contracts|CoinFund|Gen Z|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57937065,
    "published": 1770832960000,
    "title": "'This Is Not Good for Crypto': Lawmakers Slam SEC Chair for Easing Industry Policing",
    "body": "As the crypto market hemorrhages value, scrutiny has increased on the impact of President Trump’s crypto dealings on investor confidence.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57936999,
    "published": 1770832818000,
    "title": "Here’s Why The XRP Price Has Been In A Consistent Downtrend Since 2025",
    "body": "On-chain data from Glassnode has unveiled the reason why the XRP price has been in a persistent downtrend since 2025. Notably, the XRP price crashed from its high above $3 last year and has been falling ever since. While many in the crypto space believed XRP could eventually reclaim the $3 level, the cryptocurrency has continued to struggle, shedding more gains each month amid broader market weakness and a shift in sentiment. Why The XRP Price Has Been Declining Since 2025 Glassnode has attributed XRP’s prolonged price correction since 2025 to a shift in investor behavior driven by weakening on-chain profitability and rising losses among holders. According to the data, XRP fell below the aggregate holder cost basis, which represents the average price at which current investors acquired their tokens. Related Reading: XRP Price To $1 Or $10? Analyst Warns Investors Of Possible Crash When a cryptocurrency trades below this level, a large portion of holders are technically underwater, meaning they are holding at a loss. This condition often leads to panic selling as investors attempt to limit further losses, increasing selling pressure on the asset and reinforcing the price downtrend. A key indicator supporting this view is the Spent Output Profit Ratio (SOPR), measured using a seven-day Exponential Moving Average (EMA). The SOPR tracks whether coins being moved or sold on the blockchain are being done so at a profit or a loss. Glassnode’s chart shows that XRP’s SOPR declined from about 1.6 in July 2025 to around 0.96 recently. Notably, a value above 1 indicates that holders are selling at a profit, while a value below that signals that coins are being sold at a loss. This sustained move below the neutral level suggests that most selling activity in XRP is now occurring at a loss rather than in profit-taking conditions. As a result, on-chain profitability for XRP holders has turned negative. Such an environment usually weakens investors’ confidence in a cryptocurrency and reduces the incentive to hold it, especially among short-term traders. Negative profitability can also discourage new capital inflows, as prospective buyers see limited signs of recovery or momentum, further contributing to price decline or stagnation. XRP Structure Mirrors Bearish 2022 Setup Interestingly, Glassnode noted that XRP’s current market structure closely resembles a period between September 2021 and May 2022. During that earlier phase, XRP’s SOPR also fell below 1 and remained there for a long time. Related Reading: XRP Bounces Hard After Capitulation — Relief Rally Or Another Bull Trap? The period was also marked by prolonged consolidation and low volatility following sharp declines, before the market eventually stabilized. This comparison suggests that XRP may be experiencing a similar structural phase in which losses dominate trading activity and recovery is delayed until selling pressure eases and sentiment moves back to positive territory. As of writing, the XRP price has declined even further, now trading under $1.4. CoinMarketCap data shows that the cryptocurrency has plummeted by more than 4.3% over the past 24 hours and by well over 46% year to date. Featured Image from Freepik, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|altcoin|CoinMarketCap|EMA|Exponential Moving Average|glassnode|Ripple|SOPR|Spent Output Profit Ratio|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57937562,
    "published": 1770834249000,
    "title": "UNI Rallies 10% As BlackRock Brings Treasury‑Backed BUIDL Token To Uniswap",
    "body": "Uniswap’s native token, UNI, posted a sharp gain on Wednesday after the world’s largest asset manager, BlackRock, announced plans to bring its Treasury‑backed digital fund, BUIDL, onto the decentralized finance (DeFi) platform. The move, which also includes BlackRock’s intention to purchase UNI tokens, fueled a strong rally in the token during the trading session. BUIDL Launch On Uniswap The development was detailed in a joint press release from Uniswap Labs and Securitize. The two companies revealed a strategic integration that will allow shares of the BlackRock USD Institutional Digital Liquidity Fund (BUIDL) to be traded using UniswapX technology. Through the integration of UniswapX with Securitize’s infrastructure, investors will be able to access market quotes and swap BUIDL directly with whitelisted participants around the clock, every day of the year. Related Reading: Ripple Wins Key UAE Bank Partnership To Support Digital Asset Infrastructure The companies described the move as an important step in bridging traditional financial products with decentralized trading systems. Robert Mitchnick, BlackRock’s Global Head of Digital Assets, characterized the collaboration as a meaningful development in the convergence of tokenized assets and decentralized finance. He said integrating BUIDL into Uniswap represents significant progress in enabling interoperability between tokenized US dollar yield funds and stablecoins. UNI Outperforms Sluggish Crypto Market Following the announcement, Uniswap climbed to a weekly high of $4.50 earlier on Wednesday. However, the upward momentum eased later in the session, with the token pulling back to around $3.68 at the time of writing. Related Reading: Strategy Unfazed By Bitcoin Crash, Michael Saylor Vows Quarterly Purchases Even with the retracement, UNI stood out as one of the few cryptocurrencies recording gains during the day, as Bitcoin (BTC) and the broader digital asset market continued to face bearish pressure. From a technical perspective, Uniswap investors will need to watch the $3.14 level, which has served as support since Friday of last week. On the upside, the $4.70 level may act as short‑term resistance if renewed buying interest pushes prices higher in the coming days. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|BlackRock|BlackRock BUIDL|BlackRock news|crypto market|crypto news|cryptocurrency|UNI|UNI news|UNI price|Uniswap|Uniswap (UNI)|Uniswap news|Uniswap Price|UNIUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 53,
        "NAME": "UNI",
        "CATEGORY": "UNI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57938288,
    "published": 1770835953000,
    "title": "U.S. DOJ hits Paxful for $4 million in case tied to illegal sex work, money laundering",
    "body": "The crypto platform's penalty was sharply reduced due to its ability to pay, according to U.S. authorities.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Paxful|U.S. Department of Justice|criminal activity|Money Laundering|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57938476,
    "published": 1770836444000,
    "title": "Analyst Wans XRP Price Could Crash Below $1 If Bitcoin Reaches This Level",
    "body": "Crypto analyst TARA has predicted that the XRP price could still crash below the psychological $1 level. This came as she drew the altcoin’s correlation to Bitcoin’s price action, while highlighting how a BTC crash could also push XRP to as low as $0.87. XRP Price Could Drop To $0.87 If Bitcoin’s Crash Deepens In an X post, TARA stated that a Bitcoin crash to $52,200 would bring the XRP price down to its .786 support at $0.87. She noted that this level is also the .618 extension and the gap that was left by the October 10 liquidation event. The analyst made these comments while noting what she was watching for on XRP during this market downtrend. Related Reading: XRP Price Enters ‘Final Shakeout Zone’, What Investors Should Expect TARA also mentioned that the XRP price has reached its textbook .382 resistance at $1.53, but that the waves on Bitcoin appear incomplete. She predicted that XRP could suffer another leg down in the short term as she expects a short-term correction for BTC to $65,800 before it makes another push up to the .5 resistance level at $75,400. The analyst stated that this projected Bitcoin crash to $65,800 could bring the XRP price down to $1.30 as a short-term support, with another wave up expected as high as the .5 resistance at $1.65. Meanwhile, TARA remains bullish on XRP in the long term, noting that the macro Wave 3 targets remain $7 to $9. She also noted that XRP could have bottomed around this current range, but BTC continues to largely drive price action for the altcoin and the broader crypto market, which is why it can still drop further. Two Potential Scenarios For XRP Crypto analyst CasiTrades stated in an X post that the XRP price is currently in a Wave 4 relief that could send it towards the .5 retracement and macro .618 near $1.65, a level she described as critical. She warned that if XRP fails to flip $1.65 into support, it would set up a clean final wave down targeting $1.09 or even $0.90. Related Reading: What Happens Now That The XRP Price Has Revisited The October 10 Lows? CasiTrades further stated that this current relief bounce has reset the RSI enough that a move down to these levels would likely produce a bullish divergence, which makes them “exceptional long-term buy zones.” On the other hand, if the XRP price reclaims $1.65, she stated that it will be best to wait for confirmation of a back-test of support and then use that as an entry off strength. The analyst told investors that this is not a time to panic sell, as major lows have been reached, and that there is a chance the final wave down fails. At the time of writing, the XRP price is trading at around $1.38, down over 4% in the last 24 hours, according to data from CoinMarketCap. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|bitcoin|btc|bullish divergence|CasiTrades|CoinMarketCap|Ripple|RSI|TARA|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57938804,
    "published": 1770837377000,
    "title": "Bitcoin rebound hype fades as range highs crumble: Here’s why BTC is volatile",
    "body": "Bitcoin price crumbled back toward its 2026 low as a lack of fresh capital inflows, weak investor sentiment, and rising selling in spot markets chipped away at the $66,000 level.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57939216,
    "published": 1770838419000,
    "title": "BlackRock exec says 1% crypto allocation in Asia could unlock $2 trillion in new flows",
    "body": "During a panel discussion at Consensus in Hong Kong, Peach pointed to massive capital pools in traditional finance as ETF adoption spreads across Asia.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|BlackRock|Bitcoin ETF|Asian markets|Consensus Hong Kong 2026|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57939441,
    "published": 1770838853000,
    "title": "Bitcoin Slides as Fed Rate Cut Doubts Follow Strong Jobs Report",
    "body": "Bitcoin continued falling Wednesday after a strong U.S. jobs report dampened hopes that the Federal Reserve would lower interest rates in March.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57939958,
    "published": 1770840272000,
    "title": "Bitcoin Exchange Paxful Must Pay $4 Million Over Prostitution, Money Laundering Charges",
    "body": "Paxful signed a plea deal saying it should pay a $112 million fine for its crimes. But the DOJ determined it could only afford to pay $4 million.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57939841,
    "published": 1770840020000,
    "title": "Ethereum Whale Selloff Continues As Supply Share Drops Under 75%",
    "body": "On-chain data shows the Ethereum wallets with more than 1,000 ETH have reduced their holdings over the last eleven weeks, shedding 1.5% of the ETH supply. Ethereum Whales Have Distributed Tokens Equivalent To 1.5% Of The Supply As explained by on-chain analytics firm Santiment in an X post, Ethereum addresses with more than 1,000 ETH have participated in net selling since Christmas. The indicator of relevance here is the “Supply Distribution,” which tells us about the percentage of the total circulating ETH supply that a given wallet group is holding. Related Reading: Bitcoin Giant Awakens: 2,043 BTC Moved After 7-Year Slumber Addresses are placed into these cohorts based on the number of tokens that they are carrying in their balance. The 1 to 10 coins group, for instance, includes all investors owning between 1 and 10 ETH. Now, here is the chart for the Ethereum Supply Distribution shared by Santiment that shows the trend in the indicator for three wallet ranges: 0 to 1 coins, 1 to 1,000 coins, and 1,000+ coins. As displayed in the above graph, the smallest of Ethereum investors, retail holding less than 1 ETH, have seen their combined supply go up since December. This group now holds more than 2.3% of the cryptocurrency’s supply, the highest level ever. The mid-tier wallets with 1 to 1,000 ETH have seen a similar trajectory in this period, with their supply breaking the 23% mark for the first time since July. The growth in these addresses could lie in staking. While the smaller investors have been accumulating, the same hasn’t been true for the highest end of the market: those with more than 1,000 ETH. This range includes cohorts like the sharks and whales, who are considered key holders of the cryptocurrency due to the notable size of their holdings. Over the last eleven weeks, these large entities have distributed 1.5% of the total ETH supply. This selloff has taken their supply under the 75% level, the lowest in seven months. Alongside this phase of selling from the sharks and whales, the Ethereum price has plummeted, and it’s possible that this bearish price action could only continue in the near future if the distribution maintains. It now remains to be seen whether the Supply Distribution of the 1,000+ ETH investors will remain in a downtrend in the coming days or if a reversal will appear. Related Reading: Bitcoin Not “Pumpable” Right Now, Says CryptoQuant Founder: Here’s Why A digital asset that has seen the reverse behavior from its top wallets is Pepe. As highlighted by Santiment in another X post, the 100 largest wallets of the memecoin have participated in notable accumulation over the past four months. In total, these humongous wallets have bought 23.02 trillion PEPE during this period. As the analytics firm explained: Retail sentiment is very bearish at the moment toward Pepe and meme coins, but expect that coins with heavy accumulation will inevitably have another breakout once Bitcoin is able to see some sustained bullish momentum. ETH Price At the time of writing, Ethereum is trading around $1,950, down nearly 14% over the last week. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ethereum|Ethereum Selloff|Ethereum Whales|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57942559,
    "published": 1770846407000,
    "title": "Democratic lawmakers slam SEC Chair Atkins over crypto enforcement",
    "body": "A House Committee on Financial Services hearing on Wednesday dredged up concerns about the pro-crypto regulatory shift under the Trump administration.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57942939,
    "published": 1770847464000,
    "title": "XRP Is Ripple's 'North Star' Amid Ambitions to Build $1 Trillion Firm, Says CEO",
    "body": "Brad Garlinghouse said his company has the opportunity to reach a $1 trillion valuation, while centering its ambitions around XRP.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57942867,
    "published": 1770847143000,
    "title": "Chainlink feeds go live for Ondo tokenized US stocks on Ethereum",
    "body": "Price feeds for SPYon, QQQon and TSLAon are now live on Ethereum, allowing the Ondo-issued tokenized equities to be used as collateral in DeFi lending markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57944228,
    "published": 1770850846000,
    "title": "How Much Would You Have If You Put $500 In Bitcoin In 2014 Vs. XRP?",
    "body": "XRP and Bitcoin (BTC) were pitted against each other in a recent analysis, with market expert X Finance Bull revealing what early investors could have gained if they had invested $500 into both XRP and BTC in 2014. The analysis compares the performance of both cryptocurrencies over the years, highlighting the factors behind XRP’s growth and sustained momentum. What $500 In Bitcoin And XRP in 2014 Is Worth Today A new analysis by X Finance Bull reveals the dramatic growth potential of early investments in Bitcoin and XRP. According to the report, a $500 investment in XRP at the 2014 lows would be worth approximately $255,000 today. He compares XRP’s gains with those of Bitcoin, noting that if investors had bet the same amount in BTC in 2014, their investments would have grown to around $133,000. Related Reading: Analysts At Leading Wealth Manager Predict Bitcoin’s 2026 Price, And It’s Very Bullish These figures suggest that XRP outperformed Bitcoin by more than twice over the same period, delivering a 511-fold return, compared to BTC’s 266-fold gain. During that time, XRP’s performance benefited not only from early, steady adoption and speculative interest but also from the continued development of its underlying payment system. Over the years, XRP has moved beyond a purely speculative asset, gaining more traction as it evolves into a potential global settlement layer. Sharing similar sentiments, X Finance Bull highlighted how XRP’s infrastructure developments have significantly supported its significant price growth today. He noted that the cryptocurrency has seen major progress in areas such as Exchange-Traded Funds (ETFs), banking licenses, and enterprise-level adoption. Notably, XRP Spot ETFs officially launched in November 2025, attracting massive inflows that have significantly boosted demand for XRP among institutional investors. In addition, the Office of the Comptroller of the Currency (OCC) has conditionally approved Ripple’s application to establish a national trust bank charter. All of these developments have contributed to XRP’s price growth over the past few months. Investors Reap Rewards For Holding XRP Through Volatility In his post, X Finance Bull suggested that investors who held onto their XRP positions through the volatile years “know why they held.” Following the cryptocurrency’s dramatic rally above $3, many investors reaped the rewards of staying invested from its lows and trusting in its potential for future price appreciation. Related Reading: XRP’s 1,500% Path To $24: Analyst Warns Investors To Be Prepared For When The Correction Resolves From 2018 to 2025, XRP struggled with a lawsuit filed by the US Securities and Exchange Commission (SEC). During those years of legal turmoil, many investors continued to hold onto their XRP despite the uncertainty and price stagnancy. Following Ripple’s legal win, XRP surpassed $3 in 2025, marking its first break above that level since 2018. Compared to XRP, Bitcoin has also experienced significant growth in the past few years. After crossing the $100,000 threshold in 2024, BTC continued its surge into 2025, finally hitting a peak above $126,000 in October. Featured image from Shutterstock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|ETFs|exchange traded funds|occ|Office of the Comptroller of the Currency|Ripple|US SEC|US Securities and Exchange Commission|X Finance Bull|xrp|XRP Spot ETFs",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57944880,
    "published": 1770852480000,
    "title": "AI’s Builders Are Sending Warning Signals—Some Are Walking Away",
    "body": "Senior researchers are leaving Elon Musk’s xAI as Anthropic discloses new safety findings and AI insiders issue unusually blunt warnings.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57946250,
    "published": 1770855650000,
    "title": "Coinbase unveils crypto wallets designed specifically for AI agents",
    "body": "Users can set controls and permissions to allow the AI agent to manage liquidity positions and execute trades at any time of day, Coinbase said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57946876,
    "published": 1770857275000,
    "title": "Coinbase Launches Wallet for AI Agents With Built-In Guardrails",
    "body": "The company says its sandboxed, self-custodial design keeps private keys isolated as the autonomous bot boom continues.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57946683,
    "published": 1770854460000,
    "title": "UK’s Digital Bonds to Be Issued Using HSBC Blockchain Platform",
    "body": "The UK Treasury has chosen HSBC Holdings Plc’s blockchain platform for the pilot issuance of the country’s digital gilt instruments, as part of plans to update the nation’s capital markets infrastructure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "LSE:HSBA",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 57948602,
    "published": 1770861648000,
    "title": "Is Bitcoin A Better Investment Than Gold? Finance Expert Shares Deep Insights",
    "body": "Robert Kiyosaki, the author of Rich Dad Poor Dad, has once again declared his support for Bitcoin, this time making a direct comparison between the digital asset and gold. In a recent post on social media, the New York Times bestselling author said that if he were forced to choose between the two, he would select Bitcoin over gold, citing the cryptocurrency’s actual design as the deciding factor. His comments quickly led to reactions from his followers, not only because of the comparison but also due to his own recent activity in the crypto market. Bitcoin Is A Better Investment Than Gold According to Kiyosaki, investing in Bitcoin is a much better decision than buying gold, and this is mostly due to the supply dynamics of the two assets. On a surface level, Kiyosaki noted that it would be obviously better to invest in both gold and Bitcoin, while also adding silver for diversification of assets. However, if he had to choose only one asset, he would choose Bitcoin. Related Reading: Contrary To Popular Belief, This Is Not The Worst Bitcoin Crash In History – Here’s The List Kiyosaki’s view on Bitcoin as a better investment is based on its hard supply cap of 21 million coins. Unlike gold, whose total reserves are uncertain and expandable through technological advancements and exploration, Bitcoin’s issuance schedule is mathematically predetermined. The protocol behind BTC makes sure that no more than 21 million coins will ever exist. As of now, over 19 million coins have already been mined, which means the network is close to its maximum supply threshold. According to Kiyosaki, this design is brilliant, and that means the price of Bitcoin should only go up. Based on Kiyosaki’s perspective, engineered scarcity gives Bitcoin a structural advantage over gold. If demand is growing while supply remains fixed, basic economic theory implies upward price pressure over the long term. “Glad I bought my Bitcoin early,” Kiyosaki said. From Selling BTC To Defending His Early Entry Claims Robert Kiyosaki rose to prominence with his 1997 bestselling book on personal finance called Rich Dad Poor Dad, which eventually rolled over into a series of personal finance books. Over the years, he has broadened his commentary to include real estate, precious metals, commodities, and, more recently, cryptocurrencies. Related Reading: Forget A Bitcoin Yearly Top, BTC Price Might Have Hit A 16-Year Cyclical Peak In late 2025, Kiyosaki disclosed that he had sold a portion of his Bitcoin holdings. The disclosure came in November, around the time the price of Bitcoin fell below $90,000. According to him, he sold roughly $2.25 million worth of Bitcoin, explaining that the coins had originally been acquired years earlier at about $6,000 each. Speaking of buying Bitcoin at $6,000, Kiyosaki is claiming he stopped buying Bitcoin at $6,000. However, he has faced backlash for this claim. Recent community notes show Kiyosaki said on January 23, 2026, that he was continuously buying Bitcoin, alongside other assets like gold, silver, and Ethereum. Nonetheless, the gold-versus-Bitcoin discussion among investors is unlikely to stop anytime soon. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|ethereum|gold|New York Times|Rich Dad Poor Dad|robert kiyosaki|silver",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57949143,
    "published": 1770863012000,
    "title": "Privacy-focused Midnight blockchain to go live next month, says Cardano's Charles Hoskinson",
    "body": "Input Output Global's Founder Charles Hoskinson said Midnight, the long-awaited privacy-focused blockchain, will launch in the final week of March as a partner chain to Cardano.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Cardano|Consensus Hong Kong 2026|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57948829,
    "published": 1770862199000,
    "title": "Charles Hoskinson confirms deal to onboard LayerZero on Cardano",
    "body": "Input Output CEO and founder Charles Hoskinson announced the a deal to get the institutional-focused LayerZero ported over to the Cardano blockchain.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Cardano Foundation|LayerZero|Breaking News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57949724,
    "published": 1770864504000,
    "title": "Bitcoin Price Bleeds Lower With $65K Becoming The Battleground",
    "body": "Bitcoin price failed to stay above $70,000 and started another decline. BTC is now trading below $68,800 and might extend losses in the near term. Bitcoin is slowly moving lower below $68,800 and $68,000. The price is trading below $68,000 and the 100 hourly simple moving average. There is a bearish trend line forming with resistance at $68,200 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might dip again if it trades below the $66,500 and $65,000 levels. Bitcoin Price Dips Again Bitcoin price failed to remain stable above the $70,000 zone. BTC started a fresh decline and traded below the $68,800 support zone . There was a push below $68,000. The price dipped below the 50% Fib retracement level of the upward move from the $60,500 swing low to the $72,256 high. There is also a bearish trend line forming with resistance at $68,200 on the hourly chart of the BTC/USD pair. Bitcoin is now trading below $68,000 and the 100 hourly simple moving average . If the price remains stable above $65,000, it could attempt a fresh increase. Immediate resistance is near the $68,200 level and the trend line. The first key resistance is near the $69,000 level. A close above the $69,000 resistance might send the price further higher. In the stated case, the price could rise and test the $70,000 resistance. Any more gains might send the price toward the $71,500 level. The next barrier for the bulls could be $72,000 and $72,500. More Losses In BTC? If Bitcoin fails to rise above the $69,000 resistance zone, it could start another decline. Immediate support is near the $66,000 level. The first major support is near the $65,000 level or the 61.8% Fib retracement level of the upward move from the $60,500 swing low to the $72,256 high. The next support is now near the $63,500 zone. Any more losses might send the price toward the $62,000 support in the near term. The main support now sits at $61,200, below which BTC might struggle to recover in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $66,000, followed by $65,000. Major Resistance Levels – $69,000 and $70,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57949996,
    "published": 1770865243000,
    "title": "More Bitcoin Ahead: Saylor, Strategy Commit To Regular BTC Purchases",
    "body": "Michael Saylor has doubled down on his company’s plan to keep buying Bitcoin on a regular schedule, saying that short-term swings will not change the approach. Related Reading: Jim Cramer Suggests US Government Could Buy Bitcoin Near $60K The message was simple and repeated: accumulation continues. Many in markets heard it as both reassurance and a reminder of how much the firm now depends on the asset. Saylor’s Quarterly Buying Plan According to public statements and company filings, the firm will keep making purchases every quarter. Reports say Bitcoin is being treated like a long-term reserve rather than a trading position. That means buys continue no matter what headlines scream today. The tactic is deliberate and steady. It is designed to smooth the entry points over time. A Massive Position And What It Means The company holds 714,644 Bitcoins. On its own pages the value runs into the tens of billions. That level of accumulation places the firm among the largest single holders of the coin, and with such scale comes concentration risk. The position was not built overnight. It was assembled over years, and much of it was funded through debt instruments tied to the company’s strategy of growth through accumulation. Bitcoin Price Action In Context Bitcoin has been volatile. It slid back below $70,000 this week after a run higher earlier in the year, and at one stage recently it had traded near a much higher peak that recalibrated many investors’ expectations. Short-term traders are uneasy. Long-term backers are unbothered. Price swings of this size can push shares of companies with large crypto exposure down sharply, which is what happened to the firm’s stock as market sentiment shifted. How Debt And Liquidity Factor In Reports say Strategy carries more than $8 billion in total debt, including notes created specifically to fund purchases. Cash on hand is being used to cover ordinary obligations, with the company noting it has enough to pay dividends for a period measured in years. Bitcoin Correlation With Tech Stocks Meanwhile, many market players now treat Bitcoin like a high-beta asset that moves with tech stocks in risk-on episodes, rather than like a safe haven that shines when fear rises. That shift in behavior is one reason some analysts have raised questions about the sustainability of a debt-financed accumulation model when prices move sharply lower. Related Reading: After Predicting XRP’s Drop, Analyst Says The Bottom May Be In Saylor’s Pledge And What Comes Next The commitment by Saylor and his team to buy each quarter is intact. The company says selling is not on the table. For outside observers, the question is whether steady accumulation funded in part by debt becomes a strength if prices recover, or a vulnerability if volatility persists and credit conditions tighten. The answer will emerge as market conditions unfold. Featured image from Vecteezy, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|Michael Saylor|Strategy",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57950404,
    "published": 1770866336000,
    "title": "Ethereum Price Cracks $2,000, Opening Door To Deeper Selloff",
    "body": "Ethereum price started a fresh decline and traded below $2,000. ETH is now consolidating and remain at risk of another decline below $1,950. Ethereum struggled to extend gains above $2,020 and corrected lower. The price is trading below $2,000 and the 100-hourly Simple Moving Average. There is a bearish trend line forming with resistance at $1,980 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh decline if it stays below the $2,020 zone. Ethereum Price Dips Further Ethereum price failed to stay above $2,050 and started a fresh decline, like Bitcoin . ETH price traded below the $2,020 and $2,000 levels to enter a bearish zone. The pair dipped below the 50% Fib retracement level of the upward move from the $1,745 swing low to the $2,169 high. Besides, there is a bearish trend line forming with resistance at $1,980 on the hourly chart of ETH/USD. However, the bulls were active near $1,900. Ethereum price is now trading below $2,000 and the 100-hourly Simple Moving Average . If the bulls remain in action above $1,900, the price could attempt another increase. Immediate resistance is seen near the $1,960 level and the trend line. The first key resistance is near the $2,000 level. The next major resistance is near the $2,020 level. A clear move above the $2,020 resistance might send the price toward the $2,165 resistance. An upside break above the $2,165 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $2,250 resistance zone or even $2,280 in the near term. More Losses In ETH? If Ethereum fails to clear the $2,000 resistance, it could start a fresh decline. Initial support on the downside is near the $1,920 level. The first major support sits near the $1,900 zone or the 61.8% Fib retracement level of the upward move from the $1,745 swing low to the $2,169 high. A clear move below the $1,850 support might push the price toward the $1,820 support. Any more losses might send the price toward the $1,750 region. The main support could be $1,720. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI – The RSI for ETH/USD is now below the 50 zone. Major Support Level – $1,900 Major Resistance Level – $2,020",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57950501,
    "published": 1770866262000,
    "title": "US fines Paxful $4M for moving funds tied to trafficking, fraud",
    "body": "US prosecutors said Paxful marketed itself as a non-KYC platform and presented anti-money laundering policies that it knew “were not implemented or enforced.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57950391,
    "published": 1770866133000,
    "title": "X Money ‘external beta’ will go live in 1-2 months, Musk says",
    "body": "The tech billionaire revealed X Money will launch in limited beta before rolling out globally as part of the firm’s “everything app” strategy.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57951120,
    "published": 1770867900000,
    "title": "Thailand's SEC Clears Path for Crypto-Linked Derivatives",
    "body": "Thailand will allow digital assets to back regulated derivatives, deepening crypto’s role in its capital markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57952238,
    "published": 1770870305000,
    "title": "Ethereum developers suggest using ZK tech to anonymize AI use",
    "body": "Ethereum co-founder Vitalik Buterin and the Ethereum Foundation’s head of AI have proposed a method to keep users’ AI API calls private while still allowing punishment for abuse.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 143,
        "NAME": "ZK",
        "CATEGORY": "ZK"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57952961,
    "published": 1770871745000,
    "title": "Thailand approves crypto as underlying assets in derivatives markets",
    "body": "Binance Thailand's chief executive said it is a \"watershed moment\" for digital assets in the country, which he says are no longer merely speculative instruments.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57953288,
    "published": 1770872886000,
    "title": "Dogecoin (DOGE) Stumbles Lower, Market Awaits Trend Shift Signal",
    "body": "Dogecoin corrected some gains and traded below $0.0950 against the US Dollar. DOGE is now holding the $0.0885 support but might decline further. DOGE price started a fresh downside correction from $0.1020. The price is trading below the $0.10 level and the 100-hourly simple moving average. There is a key declining channel forming with resistance at $0.0935 on the hourly chart of the DOGE/USD pair (data source from Kraken). The price could aim for a fresh increase if it remains stable above $0.0880. Dogecoin Price Dips Again Dogecoin price started a downside correction after it failed to clear $0.1020, like Bitcoin and Ethereum . DOGE declined below the $0.10 and $0.0980 levels. There was a move below the 50% Fib retracement level of the upward move from the $0.080 swing low to the $0.1020 high. The bears even pushed the price below $0.090. Besides, there is a key declining channel forming with resistance at $0.0935 on the hourly chart of the DOGE/USD pair. Dogecoin price is now trading below the $0.10 level and the 100-hourly simple moving average. Immediate resistance on the upside is near the $0.0935 level. The first major resistance for the bulls could be near the $0.0950 level. The next major resistance is near the $0.10 level. A close above the $0.10 resistance might send the price toward $0.1050. Any more gains might send the price toward $0.1120. The next major stop for the bulls might be $0.120. More Losses In DOGE? If DOGE’s price fails to climb above the $0.10 level, it could continue to move down. Initial support on the downside is near the $0.0885 level and the 61.8% Fib retracement level of the upward move from the $0.080 swing low to the $0.1020 high. The next major support is near the $0.0850 level. The main support sits at $0.080. If there is a downside break below the $0.080 support, the price could decline further. In the stated case, the price might slide toward the $0.0765 level or even $0.0750 in the near term. Technical Indicators Hourly MACD – The MACD for DOGE/USD is now gaining momentum in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for DOGE/USD is now below the 50 level. Major Support Levels – $0.0885 and $0.0850. Major Resistance Levels – $0.0935 and $0.1000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "DOGE|DOGE news|Doge price|DOGE USD|DOGE/BTC|DOGE/USDT|Dogecoin|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57953216,
    "published": 1770872417000,
    "title": "The WhatsApp moment for money is here",
    "body": "This is the year that stablecoins are becoming part of the mainstream for online and international payments",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57954079,
    "published": 1770874493000,
    "title": "Russia is blocking WhatsApp to push ‘surveillance’ app, company says",
    "body": "Russian news outlets reported on Wednesday that WhatsApp’s domain had been completely blocked and was inaccessible without a VPN or another workaround.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57953927,
    "published": 1770874306000,
    "title": "US Banks Urge Regulator to Slow Crypto-Linked Charters Amid Rule Overhaul",
    "body": "The warning comes as crypto firms push for deeper access to the U.S. banking system, heightening tensions over unresolved regulatory gaps.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57956047,
    "published": 1770879645000,
    "title": "Bitcoin Realized Losses Hit Luna Crash Levels — But Price Context Points To A Different Market Phase",
    "body": "Bitcoin is facing renewed selling pressure after losing the key $70,000 level, a breakdown that has pushed the market into a more defensive phase. The inability to hold this psychological support has weighed on sentiment. With traders increasingly cautious as volatility rises and liquidity conditions remain uncertain. Price action near the mid-$60,000 range now represents a critical zone where market participants are assessing whether the current move is a deeper correction or simply another consolidation phase within the broader cycle. Related Reading: Bitcoin Drop Wipes Billions From Recent Buyers: New Whale Cost Basis Falls Toward $90K On-chain data highlighted by analyst Axel Adler adds important context to the recent decline. According to his analysis, realized losses across the Bitcoin network have surged to levels comparable to those seen during the June 2022 Luna and UST crash. At first glance, this suggests significant stress and widespread capitulation among investors. However, the price backdrop is markedly different this time. Whereas the 2022 losses occurred when Bitcoin traded near $19,000, the current wave of loss realization is unfolding around $67,000. This distinction materially changes how the signal is interpreted. Rather than pointing to systemic market collapse, the data may reflect the flushing out of late-cycle buyers and leveraged positions, leaving Bitcoin at a pivotal stage where demand strength will determine the next directional move. Extreme Realized Losses Signal Capitulation, Not Structural Breakdown Axel Adler’s latest on-chain assessment highlights a sharp deterioration in Bitcoin’s realized profit and loss dynamics. The Bitcoin Net Realized Profit/Loss 7-day moving average recently dropped to around -$1.99 billion, signaling large-scale loss-taking comparable to conditions seen during the June 2022 Luna-driven market shock. This metric tracks the balance between realized profits and losses from coins moving on-chain, offering a smoothed view of investor behavior over time. Although the indicator slightly recovered to roughly -$1.73 billion in the following days, it still represents the second-deepest negative reading on record. Net losses have remained below -$1.7 billion for several consecutive sessions. This indicates persistent seller pressure and ongoing capitulation among investors who entered the market at higher prices. Historically, a sustained return above zero has marked transitions back to profit-dominant market phases. Bitcoin Realized Loss has climbed to approximately $2.3 billion on a 7-day basis, a level comparable to peak stress during the 2022 crash. However, the broader context differs significantly. Similar loss volumes are now occurring near $67,000 rather than $19,000, suggesting a cyclical flush of late bull-market entrants rather than systemic market failure or structural network deterioration. Related Reading: Ethereum Holders Shift To Self-Custody As Market Consolidates Near $2K Bitcoin Breakdown Extends As Momentum Remains Bearish Bitcoin’s daily chart reflects sustained downside pressure after the decisive loss of the $70,000 level. The price is now hovering in the mid-$60,000 range following a sharp decline. The move confirms a clear shift in short-term market structure, characterized by lower highs, accelerating selloffs, and repeated failures to reclaim former support zones. This pattern typically signals weakening bullish momentum and increasing caution among market participants. Technically, Bitcoin is trading below key moving averages, which now act as overhead resistance rather than support. The inability to recover these levels suggests that sellers continue to dominate short-term price action. Recent spikes in trading volume during the drop reinforce the idea of forced deleveraging and defensive positioning rather than orderly rotation or accumulation. Related Reading: Ethereum Crash Below $2,000 Triggers Record Token Movement: Hinting At Capitulation The $60,000–$62,000 region emerges as the next critical support area. Aligning with prior consolidation zones and historical liquidity clusters. Holding this range would help stabilize sentiment and potentially enable consolidation. A break below it, however, could open the door to deeper retracement scenarios. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin analysis|bitcoin bear market|Bitcoin correction|Bitcoin news|bitcoin price|Bitcoin Realized Losses|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57957130,
    "published": 1770882306000,
    "title": "OKX Ventures backs STBL in partnership with Hamilton Lane and Securitize",
    "body": "The companies are joining forces to introduce an RWA-backed stablecoin on OKX’s Ethereum-compatible layer-2 blockchain, X Layer.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Securitize|Consensus Hong Kong 2026|Tokenization|Stablecoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57957553,
    "published": 1770883236000,
    "title": "Bitcoin Flashes Luna-Level Capitulation Signal at $67K, Not $19K",
    "body": "Bitcoin is printing on-chain loss-taking on a scale last seen during the Luna/UST meltdown, but at a radically different price point, a distinction that changes what the signal likely means for this drawdown. Axel Adler Jr. said Bitcoin’s Net Realized Profit/Loss has sunk deep into negative territory, with the 7-day moving average falling to -$1.99 billion on Feb. 7 before improving slightly to -$1.73 billion by Feb. 10. That places the current regime among the most severe loss-dominant stretches on record. Adler described it as “the second deepest negative reading in the entire history of observations,” exceeded only by June 18, 2022, when the metric hit -$2.24 billion amid the Luna/UST crash and cascading liquidations. The key detail, Adler argues, is persistence. Net Realized Profit/Loss has stayed below roughly -$1.7 billion for five consecutive days, forming what he framed as a sustained cluster of seller pressure, the kind of multi-day compression that typically marks capitulation behavior rather than a single shock print. In Adler’s framing, the mechanic is straightforward: realized losses are dominating realized profits on moved coins, and the market is working through the supply owned by participants forced or willing to sell below their cost basis. Related Reading: These Three Catalysts Could Spark Bitcoin’s Next Rally, According To Wintermute “The depth and duration of the current negative regime point to massive capitulation of participants who bought coins at higher levels,” he wrote. “The key reversal trigger is the return of Net Realized Profit/Loss above zero, which would signal the market’s transition from loss dominance to profit dominance. As long as the metric remains in deeply negative territory, seller pressure persists.” Bitcoin Losses Match Luna Crash Scale The companion chart, Bitcoin Realized Loss (7DMA), shows realized losses rising to about $2.3 billion on Feb. 7 and holding near that level through Feb. 10, another rarity in historical context. Adler called it “one of the highest smoothed levels in the entire history of observations,” explicitly comparing it to June 2022. He also emphasized that the 7-day smoothing understates peak stress in real time. At the height of the 2022 episode, Adler noted, single-day losses were roughly three times higher than the weekly-smoothed figure. In the current window, he pointed to a single-day realized loss of $6.05 billion on Feb. 5, the second-largest one-day loss in Bitcoin’s history, according to his note. The headline comparison, however, is not just magnitude but setting. In 2022, a similar realized-loss regime occurred with bitcoin trading around $19,000. This time, Adler says, the losses are being crystallized around $67,000 after a pullback from $125,000, a context he frames as a correction that is flushing out late entries rather than an ecosystem-wide failure cascade. Related Reading: Bitcoin Chart Screams 2022 Bear Market, Until You Notice What’s Missing “Back then, Realized Loss at $2.7B was occurring at a price of $19K,” Adler wrote. “Now, comparable loss volumes are being locked in at a price of $67K, which suggests not a systemic crash but rather a flushing out of late bull-cycle entries. This is capitulation of local top buyers, not a fundamental loss of network value.” Adler’s playbook puts two markers front and center. The first is a sustained move of Net Realized Profit/Loss (7DMA) back above zero for multiple weeks, which he frames as the transition from loss dominance to profit dominance. The second is a decline of Realized Loss (7DMA) below $1 billion, which would indicate that the wave of forced or pain-driven selling is fading. The risk, in his view, is that the market’s “cleansing stress” shifts into something more final if price weakness compounds. Adler flagged the sub-$60,000 area as a line where continued growth in realized losses alongside further price decline could turn a correction into “full-blown capitulation”, not because the current prints are small, but because the regime could extend and deepen. For now, Adler’s core claim is that Bitcoin is producing Luna-sized loss signals without Luna-like structural damage. Same order of magnitude on-chain, different story in the tape. At press time, BTC traded at $67,924. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57959156,
    "published": 1770886855000,
    "title": "Bitcoin Social Sentiment Stays Bearish Even As Price Recovers From $60,000 Drop",
    "body": "Data shows the social media sentiment around Bitcoin has remained deeply bearish despite the recovery that the cryptocurrency’s price has made. Social Media Data Suggests Retail Still Fearful About Bitcoin In a new post on X, analytics firm Santiment has discussed about how the Positive/Negative Sentiment for Bitcoin has developed on social media following the recent recovery surge in the asset’s price. Related Reading: Ethereum Whale Selloff Continues As Supply Share Drops Under 75% The Positive/Negative Sentiment refers to an indicator that tells us, as its name suggests, how the positive and negative sentiments related to a given asset compare on the major social media platforms. The metric works by putting social media posts/threads/messages containing mentions of the asset through a machine-learning model to differentiate between positive and negative comments. Then, it counts up the number of posts in each category and finds their ratio. When the value of the indicator is greater than 1, it means the asset is observing more bullish messages than bearish ones. On the other hand, the metric being under this threshold implies the dominance of a negative sentiment. Now, here is the chart shared by Santiment that shows the trend in the Positive/Negative Sentiment for Bitcoin over the last few months: As is visible in the above graph, the Bitcoin Positive/Negative Sentiment rose to a notable level when the asset saw its rally in January. This suggests that retail traders on social media became greedy. What eventually followed the market greed was a top in the cryptocurrency and a reversal to the downside. As this drawdown took BTC back to the $60,000 level, the Positive/Negative Sentiment plummeted, meaning that fear now dominated social media platforms. Just like how the greedy sentiment led into a top, this bearish mentality paved way for a rebound instead. This is a pattern that has been witnessed with digital asset markets time and time again, with prices tending to move against the expectations of the crowd. Interestingly, even though BTC has climbed back into the high $60,000 levels since its low, the Positive/Negative Sentiment has continued to be at low levels. “Historically, while FUD is high, price rebounds have a heightened probability,” noted the analytics firm. It now remains to be seen how Bitcoin will develop in the near future, given the current bearish sentiment. Related Reading: Bitcoin Giant Awakens: 2,043 BTC Moved After 7-Year Slumber In some other news, the stablecoin market cap has dipped recently, as Capriole Investments founder Charles Edwards has highlighted in an X post. Edwards has pointed out that the stablecoin market cap has historically only fallen in bear markets. If the recent trajectory of the combined USDT and USDC market cap is to go by, capital may once again be leaving this side of the sector. BTC Price Bitcoin recovered above $70,000 earlier, but the coin has since retraced a bit as its price is now trading around $67,700. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin Positive/Negative Sentiment|Bitcoin Social Media Sentiment|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57959846,
    "published": 1770888204000,
    "title": "Bankers push OCC to slow crypto trust charters until GENIUS rules clarified",
    "body": "The American Bankers Association pressed the OCC to delay new national trust bank charters for crypto and stablecoin firms until the GENIUS Act framework is fully in place.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57960501,
    "published": 1770890009000,
    "title": "zkME Technology wins $20,000 PitchFest prize at Consensus Hong Kong",
    "body": "The Hong Kong-based DePin company beat out 11 other finalists with its identity verification solution aimed at bringing DeFi to the mainstream.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Consensus Hong Kong 2026|Crypto startup|DePIN|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      }
    ]
  },
  {
    "id": 57935294,
    "published": 1770828201000,
    "title": "Institutional crypto platform BlockFills said halt withdrawals, restrict trading",
    "body": "It's shades of 2022, when any number of crypto platforms were forced to suspend withdrawals as prices crumbled.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|BlockFills|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57960680,
    "published": 1770890440000,
    "title": "LayerZero (ZRO) Soars 40% Amid Zero Blockchain Debut, Major Institutional Backing",
    "body": "ZRO, the native token of the omnichain interpretability protocol LayerZero, has skyrocketed more than 40% on the past day following the announcement of its new Layer-1 (L1) blockchain backed by major institutional players. Related Reading: XRP Positioned For Major Structure Shift As Price Tests Critical Level LayerZero Unveils Zero Blockchain On Tuesday, LayerZero Labs announced a new L1 blockchain, Zero, aimed at institutional financial markets. According to the announcement, it is set to launch in fall 2026, with three initial “zones,” described as permissionless environments fully owned and governed by the underlying network. Moreover, ZRO will serve as the network’s native token, providing interoperability between Zones and across the 165+ blockchains it connects. Designed to “eliminate the long-standing scalability challenges of decentralized networks,” Zero is set to process 2 million transactions per second (TPS) per Zone and charge near-zero fees by targeting four primary bottlenecks. “By leveraging Zero-Knowledge (ZK) proofs to decouple execution from verification, Zero transitions the network from redundant replication to a heterogeneous architecture,” LayerZero Labs explained on X. “This structural shift allows for two distinct validator classes: lightweight Block Validators capable of running on low-grade consumer hardware and optional higher performance Block Producers,” it continued. Bryan Pellegrino, CEO of LayerZero Labs, affirmed that Zero’s architecture advances the industry’s roadmap by at least a decade. “We believe we can actually bring the entire global economy onchain with this technology. Our mission is to build permissionless infrastructure for a better world – this is the beginning of that world,” he added. Zero Receives Major Institutional Backing The rollout was backed by key institutional players, including Citadel Securities, The Depository Trust & Clearing Corporation (DTCC), ARK Invest, Google Cloud, and Intercontinental Exchange (ICE). Notably, Citadel Securities is collaborating to evaluate how its technology could apply to trading, clearing, and settlement workflows. Additionally, it made a strategic investment in ZRO. ARK Invest is becoming a shareholder of LayerZero equity and ZRO. Meanwhile, Cathie Wood, the company’s CEO and CIO, joined LayerZero’s new advisory board alongside Michael Blaugrund, VP of Strategic Initiatives at ICE, and Caroline Butler, former head of digital assets at BNY Mellon. “This is a historic opportunity at the intersection of finance and the internet. I am thrilled to join LayerZero’s advisory board and help accelerate the adoption of Zero by the largest markets and companies in the world,” Wood said in a statement. DTCC will investigate the Zero blockchain architecture to enhance the scalability of the DTC Tokenization Service and collateral management, while ICE will examine it for 24/7 trading and tokenized collateral. Moreover, Google Cloud partnered to explore how to enable AI agents to make micropayments and trade resources instantly. Tether also announced a separate strategic investment in LayerZero Labs on Tuesday. ZRO Price Skyrockets Following the news, ZRO soared more than 40% in the last 24 hours, hitting a four-month high of $2.59 on Wednesday morning. The cryptocurrency had been trading between the $1.50 and $2.00 area over the past few weeks, reaching a local low of $1.35 during last week’s crash. Now, the recent momentum has pushed LayerZero back above the $2.00 area and toward a major resistance area. The cryptocurrency has been unable to reclaim the $2.60 mark since June, being rejected from this area after each retest. Related Reading: Bitcoin Could See New Drop To $60,000 Despite Bounce – Here’s The Level To Defend If ZRO reclaims $2.60, it could target the next major resistance, located at around $3.00. Analyst Crypto Tony affirmed that if the cryptocurrency clears this level, “we are good for $3.30. Wave 3 is beginning.” As of this writing, ZRO is trading at $2.45, a 36.5% increase in the weekly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|ark invest|Bryan Pellegrino|Cathie Wood|Citadel Securities|dtcc|Intercontinental Exchange|LayerZero blockchain|LayerZero Labs|tether|Zero blockchain|ZRO|ZRO price|ZROUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57961430,
    "published": 1770891958000,
    "title": "UK government appoints HSBC for tokenized bond pilot",
    "body": "The UK appointed HSBC Orion for its DIGIT pilot to explore blockchain bonds, aiming to improve efficiency, cut costs and boost security.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      }
    ]
  },
  {
    "id": 57962069,
    "published": 1770893647000,
    "title": "Agant registers with U.K. FCA ahead of British pound stablecoin debut",
    "body": "The issuer cleared a key regulatory hurdle as it prepares to roll out GBPA, a fully backed sterling stablecoin targeting institutional use.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Stablecoins|U.K. Financial Conduct Authority|GBP|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57961704,
    "published": 1770892864000,
    "title": "Solana leans into tokenization and payments at Hong Kong’s Accelerate APAC event",
    "body": "From ETFs to stablecoins to AI infrastructure, Solana’s pitch in Hong Kong was clear: less memecoin mania, more internet capital markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Consensus Hong Kong 2026|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57962410,
    "published": 1770894194000,
    "title": "AI-powered agents dominate the EasyA x Consensus Hong Kong hackathon",
    "body": "Winning projects like FoundrAI demonstrate how generative AI is allowing developers to build market-ready products in just 48 hours.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Consensus Hong Kong 2026|Hackathon|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      }
    ]
  },
  {
    "id": 57962161,
    "published": 1770893571000,
    "title": "Ark Invest buys Bullish stock for 9th straight day in $11.6 million purchase",
    "body": "Ark bought around 2.1 million BLSH shares in the past nine trading days, valued about $58.8 million based on the stock's closing price each day.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|ARK Invest|Bullish|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 57963285,
    "published": 1770896599000,
    "title": "Bitcoin defies 'extreme fear,' hot jobs report to show signs of resilience",
    "body": "Bitcoin rose after the U.S. jobs report indicated employment growth in many sectors of the economy was restrained even as the headline number surged.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|Derivatives|Altcoins|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57963771,
    "published": 1770897600000,
    "title": "Espresso network launches ESP token with 10% airdrop amid Ethereum layer-2 debate",
    "body": "The network transitioned to proof-of-stake and coincides with the rollout of the ESP token, which is used for staking, securing the network and protocol participation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|airdrop|layer 2|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 204,
        "NAME": "AIRDROP",
        "CATEGORY": "AIRDROP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57964559,
    "published": 1770899432000,
    "title": "XRP Community Day Recap: The 7 Most Bullish Takeaways",
    "body": "Ripple used XRP Community Day to tighten its message: XRP is not an accessory to the business, it’s the organizing principle and the company is positioning its product stack, regulatory posture, and institutional roadmap around that premise. XRP Community Day Highlights CEO Brad Garlinghouse went straight for the ceiling. “There will be a trillion dollar crypto company, I don’t doubt that for a second,” he said. “I think Ripple has the opportunity to be that company, and maybe there’ll be more than one.” The framing matters because it’s not a token price call — it’s a scale argument about where regulated rails, liquidity, and enterprise distribution could concentrate as XRP plugs further into legacy finance. Policy was the second major pillar. Garlinghouse put odds on the table for US legislation, predicting a “75%” chance the CLARITY Act will be “very close to getting signed by the end of April.” Related Reading: XRP Positioned For Major Structure Shift As Price Tests Critical Level Garlinghouse also tried to reconcile market volatility with institutional appetite, pointing to ETF flow behavior during a rough tape. “I believe in a multi-chain world. Even last week, when there was massive carnage going on in the market, there was positive XRP ETF inflows of $30M or $40M,” he said. “Public markets are keen to invest in crypto. Customers want it.” The compliance posture was framed less as defensive and more as a competitive moat by Garlinghouse. “We want to be the most regulated, compliant, because we’re focused on institutional flows—that is the priority,” Garlinghouse said. “The OCC charter makes it very clear that RLUSD is a leader under the GENIUS Act, it cements our leading position.” In Ripple’s telling, regulatory credentials aren’t a cost center; they’re how you win mandates, counterparties, and distribution in the parts of the market that actually move size. He also hinted at some major progress on the Fed Masters Account. “Now, there’s been a lot of speculation about what we could do in the future,” Garlinghouse said. “There’s been some commentary about a Fed Master Account, which we do think is compelling. And there’s things we may do in the future that I’m not gonna go into today.” He then anchored the point in trajectory rather than rumor: conditional OCC approval and engagement, he said, represent “massive progress relative to where we started this journey.” Related Reading: Glassnode: XRP Is Back In Its 2021-2022 Playbook As SOPR Drops Sub 1 On XRP itself, Garlinghouse delivered the cleanest thesis statement of the event: “XRP is the north star for Ripple. It’s our purpose.” He tied Ripple Payments, Ripple Prime, Ripple Treasury, custody, and RLUSD to a single objective: “how we can drive utility, trust, liquidity around XRPL.” President Monica Long expanded that into an execution roadmap: “We’re rewinding the tape back to the founding of the company, like XRP and the Ledger are our reason for being,” she said. “So we call it our North Star, like that this is kind of what guides us in a lot of our product strategy and decision-making.” From there, she outlined three institutional-flavored pushes: bringing more licensed payments flow onto the XRPL DEX, a “payments credit” concept that matches payment-provider financing needs with XRP holders seeking yield via a proposed lending protocol amendment, and growing custody demand as banks move past safekeeping and into tokenization of deposits, funds, and traditional securities. At press time, XRP traded at $1.38. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|Ripple|xrp|XRP Community Day|xrp news|XRP Price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57964501,
    "published": 1770899120000,
    "title": "Forget $80k: Michael Terpin warns bitcoin could revisit the $40,000s before a real recovery",
    "body": "Terpin argued that bitcoin’s post-halving bubble followed its typical arc and says history suggests the market may still face another wave of pain.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Consensus Hong Kong 2026|Transform Ventures|Michael Terpin|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57965436,
    "published": 1770901766000,
    "title": "Morning Minute: Coinbase Gives AI Agents Their Own Wallets",
    "body": "Something big is happening with AI. And Coinbase is betting on it becoming much bigger...",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Opinion",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57965352,
    "published": 1770901599000,
    "title": "Bitcoin Trapped In Bear Market Woes As Liquidity Runs Dry, Is Another Crash Coming?",
    "body": "Bitcoin’s price structure is showing signs of strain, and new data from CryptoQuant shows that fresh capital is no longer entering the market. Instead of the recent drawdown acting as an attraction for buyers, it appears to be triggering withdrawals. This change in liquidity behavior is important, as it indicates that Bitcoin may be transitioning into deeper bear market conditions. Notably, on-chain metrics tracking new liquidity flows are revealing negative cumulative inflows over the past month. Selling Pressure Builds, New Investor Inflows Flip Negative According to a recent analysis that was done on the CryptoQuant platform, Bitcoin’s 30-day cumulative new investor flow has dropped to approximately $2.6 billion. Related Reading: Analyst Reveals The Best Time To Buy Bitcoin And The Best Time To Sell This metric was revealed from CryptoQuant’s ‘Bitcoin New Investor Flow’ data, which is revealing that more capital is leaving the ecosystem than entering it. The data shows that the ongoing dip is failing to attract meaningful participation from new buyers. Interestingly, the current reading of this metric is displaying a huge contrast between previous bull phases and current conditions. Large spikes in new money, visible in blue in the chart below, accompanied strong price rallies, particularly in 2017, 2021, and again during the 2024-2025 bull market. Those inflow surges coincided with powerful upside momentum in terms of price action. At present, those spikes are notably absent. Instead, the lower section of the chart is displaying growing red readings due to net capital outflows. The latest print is below zero, which shows that sell-offs are not being absorbed by fresh liquidity. This dynamic matters because markets rely on marginal buyers to sustain higher prices. When new participants step back, price action becomes vulnerable to deeper pullbacks. That is why there is a need for new buyers to absorb the selloffs. Low Liquidity Raises Crash Risks Although liquidity contraction does not automatically guarantee another major crash, it increases fragility of price action. Bitcoin, for one, is still trading below $70,000, although bulls have largely prevented further breakdowns below $60,000. This, in turn, has kept the Bitcoin price trading in a range around $70,000. Related Reading: Bitcoin Caught Between Two Liquidity Traps — Which Side Breaks First? However, many crypto analysts are of the notion that Bitcoin could still crash further to lower price levels. Calls for a deeper correction are circulating across trading platforms and social media, with projected bottoms stretching from around $55,000 to as low as $30,000. The absence of inflow spikes suggests that Bitcoin may struggle to regain momentum in the near term. If liquidity continues to dry up, the probability of another significant leg lower before a rebound increases. At the time of writing, Bitcoin is changing hands at $67,160, reflecting a modest 0.3% gain over the past 24 hours. This price behavior is unfolding alongside a slowdown in mining activity due to miners shutting down their systems, which led to the largest mining difficulty drop since 2021. Featured Image from Pixabay, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin New Investor Flow|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|cryptoquant",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57965773,
    "published": 1770902788000,
    "title": "From stablecoins to biotech: Why YZi Labs is betting on things that haven't happened yet",
    "body": "Ella Zhang of YZi Labs says her firm invests in founders building what doesn’t yet exist, guided by first principles and long-term conviction across AI, biotech and Web3.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Binance Labs|Consensus Hong Kong 2026|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57965898,
    "published": 1770902709000,
    "title": "StanChart Slashes Bitcoin 2026 Target by 33%, Warns of More Pain",
    "body": "Standard Chartered has cut its Bitcoin price forecast for the second time in less than three months, warning that the cryptocurrency could slide to hit $50,000 before recovering.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "LSE:STAN",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57966542,
    "published": 1770904846000,
    "title": "Calm Down: Ethereum Has Survived 8 Major 50% Falls, Lee Reminds Investors",
    "body": "Tom Lee, head of research at Fundstrat, is betting on a prompt bounce for Ethereum. He pointed to a pattern stretching back to 2018: each time ETH dropped deep, it later recovered strongly. Related Reading: Jim Cramer Suggests US Government Could Buy Bitcoin Near $60K That history has shaped the tone of his remarks in Hong Kong, where he argued that previous collapses ended with rapid turnarounds. Tom Lee Backs A Quick Rebound According to Lee, Ethereum has endured more than a 50% decline on eight separate occasions since 2018 and each time it came back. He used those past moves as the basis for his view that another sharp recovery is likely. Analysts often disagree about how much weight to give past cycles. $ETH 100% V-Shape Record 👀 Tom Lee highlights Ethereum’s eight V-shaped recoveries since 2018. Tom DeMark, whose models are followed by macro legends like Paul Tudor Jones and used across institutional desks, says a final undercut near $1,890 would “perfect” the bottom. That… pic.twitter.com/j9zWoUOLgP — SamAlτcoin.eth (@SAMALTCOIN_ETH) February 11, 2026 Market conditions are not identical now, yet patterns matter because traders use them. Some analysts have highlighted the $1,890 level as a likely low. They said it might be probed twice in an “undercut” before stabilizing. That kind of setup is common in volatile markets and is used to find entry points. Staking Squeezes Liquid Supply Reports note that staking demand remains strong even while prices fall. The validator entry queue has swollen to about 21 days, with roughly 4 million ETH waiting to be accepted. That has left more than 30% of the total supply locked up — about 36.7 million ETH. People are earning roughly 2.80% APR on staked coins, a modest return by crypto standards, but enough to persuade many holders to lock funds away. When large sums are immobilized like this, tradable supply thins and price reactions can be amplified on both the way down and the way up. Related Reading: More Bitcoin Ahead: Saylor, Strategy Commit To Regular BTC Purchases Ethereum Price Action And Market Strain Market moves have been sharp. ETH slid to about $1,900 at the time of writing, down 5.4% in the last seven days, and has failed to hold above $2,000 in recent days. Over the last 30 days, the token fell roughly 36%. Heavy liquidations have been recorded, with more than $1 billion in positions closed out as leverage was forced to unwind. That generated fast selling and left traders cautious. Economic data, geopolitical headlines, and anticipation of US inflation readings have added to the nervous mood. Some desks now treat any bounce as tentative until volatility eases. Whether that rebound comes fast or takes time, Lee’s stance is clear: sharp drops have not marked the end for Ethereum in the past. He sees the current stress as another chapter in a familiar cycle, not a structural break. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|bitcoin|crypto|ETH|Ether|ethereum|Tom Lee",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57966558,
    "published": 1770904771000,
    "title": "Is this crypto winter different? Key observers reevaluate Bitcoin",
    "body": "The current market downswing could be driven by institutional investors exiting positions, as crypto still presents too much risk for them.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57967325,
    "published": 1770907141000,
    "title": "Crypto industry experts at Consensus see Asian institutions pivot toward stablecoins",
    "body": "Panelists at the conference discussed how regulatory progress in Hong Kong and Japan creates a structured path for capital allocation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Consensus Hong Kong 2026|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      }
    ]
  },
  {
    "id": 57967265,
    "published": 1770906933000,
    "title": "Gate CEO and founder Lin Han says banks have lost the war against stablecoins",
    "body": "The head of the fourth-largest crypto exchange by daily trading volume also said he believes bitcoin’s four-year cycle is no longer a thing.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57967556,
    "published": 1770907743000,
    "title": "A ladder for the masses: Pakistan’s Bilal Bin Saqib says crypto is a necessity, not a luxury",
    "body": "Regulation of digital assets is a great opportunity for emerging markets, said Pakistan’s crypto regulation lead.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Consensus Hong Kong 2026|Pakistan|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57967983,
    "published": 1770908926000,
    "title": "AI Chatbots Giving ‘Dangerous’ Medical Advice, Oxford Study Warns",
    "body": "Wrong answers, confused advice and difficulty with personalising information plague AI chatbots in medicine.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57967781,
    "published": 1770908404000,
    "title": "Asia leapfrogging the West in onchain retail use as regional hubs lead on stablecoin rules",
    "body": "Experts at Consensus Hong Kong said regional focus on user utility and stablecoin regulation is driving adoption.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Consensus Hong Kong 2026|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 57968204,
    "published": 1770909584000,
    "title": "Standard Chartered sees bitcoin sliding to $50,000, ether to $1,400 before recovery",
    "body": "The bank cuts its 2026 crypto price targets, warning of further near-term capitulation as ETF outflows and macro headwinds weigh on digital assets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Ether|Standard Chartered Bank|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57968382,
    "published": 1770910235000,
    "title": "Dogecoin Is Now In The ‘Maximum Opportunity / Minimum Risk’ Zone: Crypto Analyst",
    "body": "Dogecoin is flashing what crypto analyst Cryptollica (@Cryptollica) calls on X a rare “maximum opportunity / minimum risk” setup, as long-horizon indicators on a DOGE-versus-dollar proxy chart push into levels that previously coincided with cycle lows. Why This Could Be The ‘Maximum Opportunity’ For Dogecoin In a Feb. 11 post on X, Cryptollica shared a 10-day DOGE chart denominated against the US Dollar Index (DXY), arguing the slower timeframe “filters out the intraday noise and reveals the true cyclical nature of the asset.” The analyst framed the move as a reset back to a historically important base level and pointed to momentum readings that, in past cycles, marked capitulation. Related Reading: Why Dogecoin (DOGE) Can’t Break $0.10 Despite Short-Term Bounce and Neutral RSI At the center of Cryptollica’s thesis is a black horizontal line on the DOGE/DXY 10-day chart — a level the analyst described as the historic “Launchpad.” “The black horizontal line represents the historic ‘Launchpad.’ In early 2021, this level was the breakout resistance that ignited the bull run (ELON),” Cryptollica wrote. “In 2022, 2023, and now 2026, this same level is acting as a macro support fortress. Price has returned to its origin.” That framing leans on a classic market-structure idea: prior resistance that becomes support can act as a memory point for positioning and risk-taking, especially when the market revisits it after a full boom-bust loop. Cryptollica also highlighted the 10-day RSI sitting at 34, referencing a “red line” zone on the indicator. The claim: when DOGE’s RSI reached that same zone in prior stress periods, including 2015, March 2020, and 2022, it preceded meaningful rebounds. “Every time the RSI touched this zone (2015, March 2020 (covid crash), 2022), it marked a cyclical bottom followed by a significant rally,” Cryptollica wrote. “We are mathematically in the ‘Maximum Opportunity / Minimum Risk’ zone.” Related Reading: Dogecoin Bear Market Almost Over? Crypto Analyst Weighs In The post stops short of calling for immediate upside, but the language suggests the analyst sees skew shifting: less perceived downside relative to the potential upside if a new expansion phase begins. Is The Dogecoin Bottom In? In a separate chart shared on Wednesday, Cryptollica mapped DOGE/USDT on a 3-day timeframe, sketching a wide channel with a labeled TopLine, Midline, and BottomLine. The chart annotates prior turning points around $0.75, $0.49, $0.22, and $0.09, with price now drifting back toward the lower boundary near the $0.07–$0.08 area. Cryptollica captioned the second image simply: “DOGE BOTTOM ?” Taken together, the posts lay out a conditional thesis rather than a timed call: DOGE has rotated back to a historically important support reference on a macro-style pair (DOGE/DXY), while momentum sits in a zone that previously aligned with cycle inflection points. Whether that historical rhyme turns into a repeat will likely hinge on whether the “launchpad” support holds and whether DOGE can reclaim higher range levels marked on the longer timeframe channel rather than continuing to bleed along the bottom boundary. At press time, DOGE traded at $0.09366. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]