[
  {
    "id": 55782376,
    "published": 1765731655000,
    "title": "XRP Holders Labeled ‘Uneducated Perma Bulls’ By Veteran Trader – Details",
    "body": "Veteran market trader Peter Brandt has reignited debate around XRP after issuing sharp remarks about the token’s most loyal supporters. Drawing from a career that spans more than five decades, Brandt grouped XRP alongside silver when describing markets where bullish belief often holds firm despite repeated price swings and long periods of disappointment. Related Reading: Do Kwon Falls Hard — Terraform Labs Chief Gets 15 Years For Wire Fraud According to people familiar with his comments, Brandt grounded his criticism in personal trading history. He said he has handled thousands of contracts across commodities, equity benchmarks, and digital assets, and argued that the “perma bulls who I find most uneducated and biased are those who trumpet Silver and XRP,” pointing to what he sees as a pattern of investors staying bullish even when price action and broader conditions turn against them. Brandt Highlights Decades Of Experience Brandt’s tone was blunt and personal. He has a long record of public commentary, and his criticisms of XRP are part of a pattern that stretches back years. Earlier this month he called XRP supporters “obsessed” and compared their conviction to that of silver bulls. For 50 years I have traded many thousands of contracts of every commodity, stock indexes and as many cryptos as you can think of The perma bulls who I find most uneducated and biased are those who trumpet Silver and XRP — Peter Brandt (@PeterLBrandt) December 12, 2025 At times he has made bearish forecasts — including predictions that XRP would slide toward zero against Bitcoin — while at other moments he identified bullish chart patterns and set higher targets that were later hit before the market reversed. Community Pushback And Surprises Responses came fast. Zach Rector, a known figure in the XRP space, pushed back on Brandt’s view. Reports disclosed that Bitcoin maximalist YoungHoon Kim said on December 12 that he would start buying XRP — a notable shift for someone who had favored Bitcoin exclusively. Kim has claimed an IQ of 276, a detail many readers flagged as unverifiable, but it was repeated in social posts and prompted discussion. X Finance Bull accepted Brandt’s trading record but suggested that charts alone may miss broader structural moves in crypto markets. Dr. Don Woods, a self-described silver bull, joked that triple-digit returns had left him unbothered by labels of bias or ignorance. XRP: Price Context And Market Moves According to market snapshots tied to the exchanges, XRP traded above $3 at one point before slipping toward the lower end of the $2 region. Volume and broader crypto swings played parts in that move. Brandt’s critics point to that resilience as proof his calls are sometimes off. His supporters say his track record over five decades still deserves weight. Both views are in circulation, and both are being used to argue different investment cases. 10,000 XRP And The Freedom Argument Meanwhile, Edoardo Farina, founder of Alpha Lions Academy, has kept a steady bullish stance. Based on his past posts, he argued that holding 10,000 XRP could put an investor in a special position if prices rise enough. Related Reading: American Bitcoin Makes Big Buy, Adds 416 BTC To Its Stack “It’s hard to understand how free you’ll be,” he wrote in one message that was later shared widely. That claim contains no timeline or clear price targets. It is a conviction play, not a forecast built from disclosed assumptions. The differing views is part of a wider debate about bias, data, and belief in crypto. Some traders treat Brandt’s words as a warning against unchecked optimism. Others treat community pushback as evidence that XRP’s story is not settled and that broader factors — legal, regulatory, and adoption-related — could change the math. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|bitcoin|crypto|Peter Brandt|xrp|XRP Bulls|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55782373,
    "published": 1765731600000,
    "title": "Compliance, Credibility, and Consumer Trust in the New Age of Crypto ATMs",
    "body": "Bitcoin Depot’s Scott Buchanan argues that crypto ATM operators must continually strengthen their safeguards and make things safer and more transparent for users — protective actions that not only benefit individual crypto users but also bolster the market’s integrity and support its long-term growth.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Opinion|Bitcoin ATMs|Opinion",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55784857,
    "published": 1765736055000,
    "title": "Firestorm erupts in Aave governance forum over CoW Swap fees",
    "body": "Members of the Aave DAO clashed with Aave Labs, with some arguing that the company was not acting in the best interests of token holders.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55794994,
    "published": 1765756862000,
    "title": "UK can ‘lead the world’ on crypto, says City minister",
    "body": "Britain’s new regulatory regime will take effect in the second half of 2027",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55799714,
    "published": 1765766791000,
    "title": "Bitcoin Price Faces Growing Heat—Is Momentum Turning Against Bulls?",
    "body": "Bitcoin price corrected gains and traded below the $90,000 support zone. BTC is now rising and might struggle to clear the $90,500 zone. Bitcoin started a downside correction from the $92,500 zone. The price is trading below $90,000 and the 100 hourly Simple moving average. There is a bearish trend line forming with resistance at $90,650 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move up if it settles above the $90,500 zone. Bitcoin Price Aims Fresh Increase Bitcoin price failed to gain strength for a move above the $92,000 and $92,500 levels. BTC started a downside correction and traded below the $90,500 support. The price even spiked below the $88,000 support. However, the bulls were active near the $87,500 zone. A low was formed at $87,582 and the price is moving higher. There was a break above the 23.6% Fib retracement level of the downward move from the $93,561 swing high to the $87,582 low. Bitcoin is now trading below $90,000 and the 100 hourly Simple moving average . If the bulls remain in action, the price could attempt another increase. Immediate resistance is near the $90,000 level. The first key resistance is near the $90,500 level. There is also a bearish trend line forming with resistance at $90,650 on the hourly chart of the BTC/USD pair. The next resistance could be $92,000. A close above the $92,000 resistance might send the price further higher. In the stated case, the price could rise and test the $92,500 resistance. Any more gains might send the price toward the $93,200 level. The next barrier for the bulls could be $94,000 and $94,500. Another Decline In BTC? If Bitcoin fails to rise above the $90,500 resistance zone, it could start another decline. Immediate support is near the $88,550 level. The first major support is near the $88,000 level. The next support is now near the $87,500 zone. Any more losses might send the price toward the $86,500 support in the near term. The main support sits at $85,000, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $88,550, followed by $88,000. Major Resistance Levels – $90,000 and $90,500.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55802463,
    "published": 1765771690000,
    "title": "XRP Price Struggles Near $2.0—Breakout Blocked or Pullback Ahead?",
    "body": "XRP price started a fresh decline below $2.00. The price is now struggling and faces resistance near the $2.020 resistance level. XRP price started a fresh decline below the $2.00 zone. The price is now trading below $2.00 and the 100-hourly Simple Moving Average. There is a bearish trend line forming with resistance at $2.020 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move down if it settles below $1.950. XRP Price Dips Again XRP price attempted a recovery wave above $2.120 but failed to continue higher, like Bitcoin and Ethereum . The price started a fresh decline below $2.050 and $2.020. There was a move below the $2.00 support level. A low was formed at $1.9525, and the price recently started an upside correction. There was a move above the 50% Fib retracement level of the downward move from the $2.047 swing high to the $1.952 low. However, the bears are active near $2.00 and $2.020. There is also a bearish trend line forming with resistance at $2.020 on the hourly chart of the XRP/USD pair. The price is now trading below $2.00 and the 100-hourly Simple Moving Average. If there is a fresh upward move, the price might face resistance near the $2.00 level. The first major resistance is near the $2.020 level or the 61.8% Fib retracement level of the downward move from the $2.047 swing high to the $1.952 low. A close above $2.020 could send the price to $2.050. The next hurdle sits at $2.080. A clear move above the $2.120 resistance might send the price toward the $2.150 resistance. Any more gains might send the price toward the $2.20 resistance. The next major hurdle for the bulls might be near $2.250. Another Decline? If XRP fails to clear the $2.020 resistance zone, it could start a fresh decline. Initial support on the downside is near the $1.9650 level. The next major support is near the $1.950 level. If there is a downside break and a close below the $1.950 level, the price might continue to decline toward $1.920. The next major support sits near the $1.880 zone, below which the price could continue lower toward $1.820. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $1.950 and $1.920. Major Resistance Levels – $2.020 and $2.050.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55804363,
    "published": 1765774815000,
    "title": "Why the ‘stablecoin supercycle’ could rewire banking",
    "body": "Some technologists believe more than 100,000 such payment systems could swamp the world within five years",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55804362,
    "published": 1765774807000,
    "title": "Bitcoin investor plans Caribbean community — with its own court system",
    "body": "Some locals on the island of Nevis oppose the libertarian project, calling it a ‘state within a state’",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55804383,
    "published": 1765774128000,
    "title": "XRP Spot ETFs Rack Up 30-Day Inflow Streak in Divergence From Bitcoin, Ether",
    "body": "The products have attracted fresh capital every trading day since launch, lifting cumulative net inflows to about $975 million.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|XRP News|ETFs|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55804620,
    "published": 1765775316000,
    "title": "Dogecoin (DOGE) Slides Deeper Into Red—Is a Bottom in Sight?",
    "body": "Dogecoin started a fresh decline below the $0.1400 zone against the US Dollar. DOGE is now consolidating losses and might face hurdles near $0.1400. DOGE price started a fresh decline below the $0.1400 level. The price is trading below the $0.1380 level and the 100-hourly simple moving average. There is a key bearish trend line forming with resistance at $0.1375 on the hourly chart of the DOGE/USD pair (data source from Kraken). The price could extend losses if it stays below $0.1400 and $0.1420. Dogecoin Price Dips Further Dogecoin price started a fresh decline after it closed below $0.1420, like Bitcoin and Ethereum . DOGE declined below the $0.1400 and $0.1380 support levels. The price even traded below $0.1350. A low was formed near $0.1326, and the price recently corrected some losses. There was a minor increase toward the 23.6% Fib retracement level of the downward move from the $0.1530 swing high to the $0.1326 low. Dogecoin price is now trading below the $0.1400 level and the 100-hourly simple moving average. If there is a recovery wave, immediate resistance on the upside is near the $0.1380 level. There is also a key bearish trend line forming with resistance at $0.1375 on the hourly chart of the DOGE/USD pair. The first major resistance for the bulls could be near the $0.140 level. The next major resistance is near the $0.1425 level and the 50% Fib retracement level of the downward move from the $0.1530 swing high to the $0.1326 low. A close above the $0.1425 resistance might send the price toward the $0.1450 resistance. Any more gains might send the price toward the $0.1500 level. The next major stop for the bulls might be $0.1550. Another Decline In DOGE? If DOGE’s price fails to climb above the $0.140 level, it could continue to move down. Initial support on the downside is near the $0.1340 level. The next major support is near the $0.1325 level. The main support sits at $0.130. If there is a downside break below the $0.130 support, the price could decline further. In the stated case, the price might slide toward the $0.1250 level or even $0.1240 in the near term. Technical Indicators Hourly MACD – The MACD for DOGE/USD is now gaining momentum in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for DOGE/USD is now above the 50 level. Major Support Levels – $0.1340 and $0.1300. Major Resistance Levels – $0.1400 and $0.1420.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "DOGE|DOGE news|Doge price|DOGE USD|DOGE/BTC|DOGE/USDT|Dogecoin|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55808963,
    "published": 1765781881000,
    "title": "Doha Bank Issues $150M Digital Bond Using Euroclear’s DLT Platform",
    "body": "The deal achieved T+0 settlement on a permissioned distributed ledger rather than a public blockchain, reflecting a growing regional shift toward regulated digital bond infrastructure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Qatar|Standard chartered|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      }
    ]
  },
  {
    "id": 55811012,
    "published": 1765784869000,
    "title": "BTC $80K Check-Back Risk Rises as Nasdaq Rebound Stalls",
    "body": "Nasdaq and MOVE index patterns warrant caution for BTC bulls.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Markets|Nasdaq|Treasury|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55815328,
    "published": 1765790174000,
    "title": "Juventus Jumps After Billionaire Agnellis Family Rejects Tether’s Bid",
    "body": "Juventus Football Club SpA shares rose the most this year after the Agnellis family’s investment vehicle Exor NV rejected an unsolicited bid by Tether Holdings to acquire the Italian football club.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "MIL:JUVE",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55818258,
    "published": 1765794619000,
    "title": "Hashdex Unveils Its Top 3 Crypto Predictions For 2026",
    "body": "Hashdex is out with its 2026 crypto investment outlook, and the vibe is pretty clear: stop treating crypto like a weird side-bet and start treating it like… an allocation. The firm’s CIO Samir Kerbage says “most investors” should be thinking in the 5–10% range, framing it as a pragmatic response to a messier macro regime (sticky inflation risk, debt burdens, the 60/40 portfolio looking less like a law of nature and more like a historical artifact). Look, you can debate the exact number, but Hashdex’s point is that the underweight has become the active decision. Crypto is now “well above $3 trillion” in market cap and about 1% of the global investable market by its math—meaning a sub-1% allocation is basically a deliberate fade. They also cite a Charles Schwab survey where 45% of financial advisors said they planned to allocate to crypto ETFs over the next year. And they’re not just waving their hands. Hashdex runs a simple portfolio thought experiment: adding crypto exposure (represented by the Nasdaq Crypto Index US) to a 60/40 improves risk-adjusted returns in their backtest window, with higher allocations juicing total return while, yes, drawdowns get uglier. That trade-off isn’t hidden — it’s the whole point of sizing the position instead of YOLO’ing it. Related Reading: Crypto Tanks After Fed Cut: Santiment Breaks Down The Trap But the meat of the report isn’t “buy crypto because number go up.” It’s three themes, three predictions — basically a roadmap for what they think does the heavy lifting in 2026. Top 3 Crypto Predictions For 2026 First up: the “cryptodollar”. Hashdex argues stablecoins are starting to do something geopolitically weird and financially consequential: while some sovereigns try to de-dollarize, stablecoins re-dollarize at the user and corporate level, with issuers recycling that demand into short-duration Treasuries. Their baseline is stablecoins going from roughly $295 billion to well over $500 billion in 2026. If that accelerates, they suggest it changes the shape of Treasury demand — in one scenario, stablecoin growth could shorten the average duration of US debt by around four months (because the backing skews short). That’s the kind of detail bond people obsess over. Crypto people probably should, too. Related Reading: Will The Crypto Market Benefit From The Trump Fed Takeover? Second: tokenization finally acting like a flywheel instead of a conference slide. Hashdex points to tokenized RWAs at roughly $36 billion as of late 2025 and says the market could grow 10x to about $400 billion by end-2026. They also flag that tokenized Treasury bills have already climbed to over $8 billion, from a little above $700 million two years earlier. They namecheck real-world rollout examples — BlackRock’s liquidity fund, Franklin Templeton’s on-chain government money fund, UBS’s tokenized VCC fund in Singapore, Siemens’ on-chain bond — as proof this isn’t just crypto teams talking to themselves anymore. “We’re not spending enough time talking about how quickly we’re going to tokenize every financial asset.” Third: AI, but not the “add AI to the pitch deck” version. Hashdex says decentralized AI networks pulled nearly $1 billion in venture funding in 2025, largely aimed at problems like verification, coordination, and compute cost. Their call is the “AI Crypto” segment growing from about $3 billion to $10 billion in 2026. The throughline is simple even if the plumbing isn’t: stablecoins deepen on-chain liquidity, tokenization pulls more assets onto rails, and AI pushes demand for crypto-native infrastructure that can verify and coordinate without a single gatekeeper. Hashdex’s punchline is that 2026 is when “exploratory” turns into “strategic.” Not a tidy ending, sure — but markets rarely give you one. At press time, the total crypto market cap stood at $3.03 trillion. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto|Crypto market news|Crypto Market Trends 2026|crypto news|Crypto Predictions 2026",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55819499,
    "published": 1765796432000,
    "title": "Dogecoin Holds Demand Zone Above $0.13, What A Bounce Would Do",
    "body": "As the eventful year of 2025 draws to an end, crypto analysts are looking into what the Dogecoin price could hold for investors going into the end of the year. One of these analysts is BitGuru, who shared an interest in the Dogecoin price chart, highlighting the next possible roadmap that the meme coin could take. With the possibility of a bounce rising, the next targets have become increasingly important to identify in order to maximize gains. Why The Dogecoin Price Could Recover Quickly BitGuru’s analysis focuses on the rising demand surrounding the meme coin after finding support from the recent crash. The Dogecoin price had stopped above $0.13, suggesting that the demand at this level continues to hold strong as buyers return to the market. Related Reading: Reasons Why XRP’s Technical Structure Favors Upside Than Down Over Next 6 Months Pointing out this demand, the crypto analyst explains that the Dogecoin price is actually holding the demand zone after a prolonged downtrend. This is often bullish for the digital asset as it shows rising interest in the cryptocurrency as it establishes new support levels. This base formation, as the analyst calls it, could serve as the starting point for the next rally that could push the Dogecoin price higher. However, for this to happen, the Dogecoin bulls would have to maintain their position above this demand level. If this support level is held, then BitGuru forecasts that the Dogecoin price could start to recover again. This bounce could lead to a 50% increase, with the analyst’s chart outline putting it as high as $0.188. The upper end of the rally shows the price climbing to $0.22 before hitting resistance. End Of Year Could End Red Interestingly, the last quarter of the year has often been reasonably bullish for the Dogecoin price, but the year 2025 has deviated hard. So far, the quarter is already 41.8% deep in the red, according to data from the CryptoRank website, and it doesn’t look like that would change anytime soon. Related Reading: XRP Mirrors 2016 Trend That Led To 69% Crash Before 110,000% Rally The Dogecoin price is already down more than 7.5% in the month of December so far, contributing to the decline that has been felt in the quarter. The months of October and November ended in the red with 20% and 21.3% losses, respectively, and if this trend continues, then the Dogecoin price could follow suit. Featured image from Dall.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55820942,
    "published": 1765798420000,
    "title": "JPMorgan Launches Tokenized Money Market Fund on Ethereum as Wall Street Moves Onchain: Report",
    "body": "The $4 trillion U.S. bank is the latest financial giant in rolling out tokenized MMF onchain, joining BlackRock, Franklin Templeton and Fidelity.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Tokenization|Ethereum News|JPMorgan|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55822307,
    "published": 1765800690000,
    "title": "Bitcoin's Parabolic Arc Snaps: Trader Peter Brandt Eyes $25K Crash Floor",
    "body": "Veteran trader Peter Brandt warns that bitcoin's growth parabola has fractured, potentially leading to a price drop to $25,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Technical Analysis|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55824928,
    "published": 1765802295000,
    "title": "Aave DAO Pushes Back as Interface Fees Shift Away From Treasury",
    "body": "The change was framed as an upgrade offering improved execution, but delegates flagged that swap-related fees were no longer flowing to the Aave DAO treasury.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Tech|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55825687,
    "published": 1765806191000,
    "title": "Morning Minute: The SEC & OCC Usher In Crypto Era",
    "body": "Two major actions from late last week signal that crypto is fully entering the mainstream, with full regulatory buy in.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Opinion",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55826397,
    "published": 1765807200000,
    "title": "Ripple Expands $1.3B RLUSD Stablecoin to Ethereum L2s via Wormhole in Multichain Push",
    "body": "Ripple said it's testing its U.S. dollar stablecoin on Optimism, Base, Ink and Unichain with more blockchains to be added next year pending regulatory review.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Ripple|Stablecoin|Ethereum News|Wormhole|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55826399,
    "published": 1765807200000,
    "title": "Kula Brings $50M of Impact Investing Onchain With Community-Governed RWA Model",
    "body": "The decentralized investment firm is using tokens and DAOs to give local communities direct control over energy and infrastructure projects in emerging markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Real World Assets|Zambia|DAO|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55825957,
    "published": 1765806692000,
    "title": "Real-World Asset DeFi Moves Into Sports Finance With Tokenized Football Club Revenues",
    "body": "A new DeFi model is providing football clubs with faster access to liquidity by converting future media and broadcasting revenues into tokenized, onchain assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Web3|Sports|Soccer|Chiliz|Real World Assets|Tokenization|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55826755,
    "published": 1765807751000,
    "title": "Juventus Fan Token Slides Over 13% After Tether Bid Rebuff, Even as Club Shares Surge",
    "body": "Juventus Football Club shares surged after stablecoin issuer Tether made, and was rebuffed on, a €1.1 billion takeover bid, while the club’s fan token saw a double-digit pullback.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Juventus|Fan Tokens|Tether|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55827631,
    "published": 1765809012000,
    "title": "Strategy Adds Nearly a Billion Dollars in Bitcoin for Second Straight Week",
    "body": "Michael Saylor’s firm is still buying big, adding $980 million worth of Bitcoin—slightly more than last week’s BTC haul.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55828896,
    "published": 1765810800000,
    "title": "Most Influential: Todd Blanche",
    "body": "The crypto industry praised a memo signed by Deputy Attorney General Todd Blanche directing the Department of Justice to end “regulation by prosecution.”",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|DOJ|Tornado Cash|President Trump|CoinDesk Most Influential 2025|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55828898,
    "published": 1765810800000,
    "title": "Most Influential: Roman Storm",
    "body": "The Tornado Cash developer’s trial this summer is evidence that the crypto industry is still severely lacking regulatory clarity.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Roman storm|Tornado Cash|SDNY|Donald Trump|CoinDesk Most Influential 2025|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55828973,
    "published": 1765810800000,
    "title": "Most Influential: Sergey Nazarov",
    "body": "Chainlink’s co-founder spent 2025 turning oracles, cross-chain messaging and CRE into building blocks for tokenized funds and on-chain finance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Sergey Nazarov|DeFi|CoinDesk Most Influential 2025|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55830104,
    "published": 1765812641000,
    "title": "Why Did The Bitcoin, Ethereum, And XRP Prices Crash, And Will It Continue?",
    "body": "Crypto pundit Crypto Wimar has explained why the Bitcoin, Ethereum, and XRP prices crashed, highlighting the continuous selling pressure. The crypto market is also at risk of further downward pressure due to macro factors such as the impending Japan rate hike. Why The Bitcoin, Ethereum, And XRP Prices Crashed In an X post, Crypto Wimar revealed that Wintermute has dumped 40% of its holdings over the last three weeks, which has contributed to the crash in Bitcoin, Ethereum, and XRP prices. The crypto pundit further noted that the market maker is still dumping millions in BTC and ETH on Binance, which puts these coins at risk of further declines. Related Reading: What’s Happening With The Bitcoin, Ethereum, And Dogecoin Prices Recently? The Bitcoin, Ethereum, and XRP prices are also crashing as crypto market investors brace for a Japan interest rate hike by the BOJ at their December 19 meeting. Polymarket data shows that there is currently a 97.4% chance that the BOJ will increase rates by 25 basis points. A Japan rate hike impacts the crypto market as it puts the yen carry trade in focus, with investors moving to sell their assets before the yen strengthens and their debt becomes more expensive. Meanwhile, it is worth mentioning that the Bitcoin, Ethereum, and XRP prices have crashed after every Fed rate cut this year. This similar price action is playing out as the Fed lowered rates by 25 bps last week. These crypto assets had seen a notable rebound prior to the Fed rate decision last week, indicating that the cut was already priced in. Demand for Bitcoin, Ethereum, and XRP also appears to be dwindling, even among institutional investors. Crypto analytics platform CryptoQuant stated that Bitcoin treasury growth is losing momentum, noting that the accumulation pace is slowing despite the fact that 117 new companies added BTC to their treasuries this year. Ethereum treasury company BitMine is also the only company that has continued to accumulate ETH at an impressive pace amid this market downturn. BTC At Risk Of Drop Below $50,000 Crypto analyst Titan of Crypto has indicated that the Bitcoin price could still drop below $50,000, which also puts Ethereum and XRP at risk of crashing. In an X post, the analyst raised the possibility that a BTC bear pennant is forming. Related Reading: Why Is The Bitcoin Price Down Again? Analyst Calls Out Trading Desk For Triggering Crashes He noted that this is not a structure that market investors will typically want to see in a bull market. Titan of Crypto added that the structure is still developing, but it is one that is worth monitoring closely. Meanwhile, the analyst’s accompanying chart showed that the Bitcoin price could drop below $50,000 as soon as February next year. It is worth mentioning that veteran trader Peter Brandt had also earlier predicted that BTC could drop below $50,000 based on his belief that the flagship crypto is already in a bear market. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|Binance|bitcoin|Bitcoin news|bitcoin price|BoJ|btc|BTC news|btc price|btcusd|BTCUSDT|Crypto Wimar|cryptoquant|ethereum|fed|Peter Brandt|Polymarket|Titan Of Crypto|xrp",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55829835,
    "published": 1765812277000,
    "title": "TON Extends Slide, Drops More Than Broader Crypto Market",
    "body": "The token's trading range was volatile with above-average volume indicating trader repositioning and uncertainty.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Technical Analysis|TON",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 98,
        "NAME": "TON",
        "CATEGORY": "TON"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55829833,
    "published": 1765812187000,
    "title": "Bitcoin Miner IREN’s 47% Slide Flagged as a Buying Opportunity by B. Riley",
    "body": "The bank kept its buy rating on the stock and $74 target, citing a Microsoft GPU ramp and ample funding options.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Iren|Bitcoin Mining|B. Riley|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55830677,
    "published": 1765813309000,
    "title": "Tom Lee's BitMine Keeps Buying Ethereum, Adding $320 Million to ETH Treasury",
    "body": "Ethereum treasury firm BitMine Immersion Technologies added to its balance sheet last week, acquiring around $320 million in ETH.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55830560,
    "published": 1765813280000,
    "title": "BONK Slides Toward Lower Range as Volatility Expands",
    "body": "The Solana-based memecoin drifted back toward recent lows after failing to hold higher levels during a high-volume session.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Technical Analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 113,
        "NAME": "BONK",
        "CATEGORY": "BONK"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55830380,
    "published": 1765812998000,
    "title": "Strive Hikes Preferred Share Dividend Rate as Bitcoin Treasury Companies Continue to Plunge",
    "body": "Bitcoin has tumbled below $88,000 on Monday, helping to send Strive (ASST) common stock lower by 7% to $0.79",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55831163,
    "published": 1765814056000,
    "title": "Bitcoin Plunges Below $87K as Crypto Weakness Worsens",
    "body": "The curse of the U.S. trading session — in which bitcoin tends to fall as American stocks trade — has hit yet again.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Markets|Bitcoin News|Ethereum News|Breaking News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55830989,
    "published": 1765813914000,
    "title": "ICP Slips Back Toward Recent Lows as Rally Attempt Fades",
    "body": "Internet Computer drifted lower after failing to hold intraday gains, with elevated volume reflecting continued distribution near resistance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Technical Analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 82,
        "NAME": "ICP",
        "CATEGORY": "ICP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55832062,
    "published": 1765815391000,
    "title": "Anchorage Digital Buys Securitize’s RIA Platform to Expand Wealth Management Business",
    "body": "The bank has bought the Securitize For Advisors unit, bringing the RIA-focused crypto wealth management platform in-house.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Anchorage Digital|Securitize|mergers and acquisitions|Exclusive|CoinDesk Wealth|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55831706,
    "published": 1765814820000,
    "title": "CME Group Expands Crypto Derivatives With Spot-Quoted XRP and Solana Futures",
    "body": "These are CME’s smallest crypto contracts to date, aimed at active participants who prefer to trade in spot market terms without managing contract expiries or rollovers.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|CME Group|Solana News|XRP News|crypto futures|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55831885,
    "published": 1765813781000,
    "title": "Ondo Finance to Offer Tokenized U.S. Stocks, ETFs on Solana Early Next Year",
    "body": "The platform will enable 24/7 trading of U.S. stocks and exchange-traded funds with near-instant settlement, building on Ondo's existing $365 million in tokenized assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Tokenization|Solana News|Tokenized Securities|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 108,
        "NAME": "ONDO",
        "CATEGORY": "ONDO"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55832235,
    "published": 1765815598000,
    "title": "Bank of America says U.S. banks are heading for multi-year onchain future",
    "body": "The Wall Street firm said faster U.S. stablecoin and charter rules are pulling crypto into the regulated banking system and pushing banks toward an on-chain future.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|crypto regulation|Stablecoins|Bank of America|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55832709,
    "published": 1765815043000,
    "title": "Bitcoin is \"Digital Labubu”! Crypto Plummets! SEC & OCC usher in Crypto Era!",
    "body": "Crypto majors were mostly flat over the weekend; btc even at $89,700; eth +1% at $3,150, bnb +1% at $888, sol +1% at $133. Mnt (+10%), merl (+3%) and trx (+3%) led top movers. The sec issued a no-action letter allowing certain tokenized stock offerings, giving firms some regulatory clarity to launch tokenized equities without immediate enforcement risk. The sec also issued an investor bulletin explaining the basics of crypto custody. The occ granted national bank charters to circle, ripple, and other crypto firms. Tether considered tokenizing its stock after pursuing a share sale that could value it around $500b. Vanguard’s quant equity head compared bitcoin to a “digital labubu” even as vanguard opened client access to trading crypto etf products. The uk proposed legislation to bring crypto under its full fca regulatory oversight. Xstocks enabled tokenized equities to move between solana and ethereum using chainlink’s ccip bridge. Netflix greenlit a crypto-themed comedy titled one attempt remaining, starring jennifer garner.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]