[
  {
    "id": 57633071,
    "published": 1769928877000,
    "title": "Tom Lee’s BitMine sits on $6 billion loss from ether bets",
    "body": "The firm’s recent ETH purchases came just ahead of a sharp market slide, pushing unrealized losses past $6 billion as liquidity thinned and liquidations picked up.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57633441,
    "published": 1769930074000,
    "title": "Sam Bankman-Fried turns up Trump support following Ellison’s release",
    "body": "FTX founder Sam Bankman-Fried said US president Donald Trump was “right on crypto” and that Joe Biden “bungled crypto” in a series of recent X posts.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57633301,
    "published": 1769929614000,
    "title": "Single trader just lost $220 million as ether plunged 10%",
    "body": "A massive ETH liquidation on Hyperliquid led a leverage-driven wipeout that pushed total crypto liquidations past $2.5 billion in 24 hours.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57634429,
    "published": 1769933211000,
    "title": "Step Finance treasury breach leads to $27M in losses, STEP crashes 90%",
    "body": "Solana-based DeFi platform Step Finance disclosed a treasury wallet breach that saw over $27 million in SOL moved onchain, sending its STEP token down more than 90%.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57635005,
    "published": 1769932833000,
    "title": "Here’s Why Bitcoin Fall Below $80,000 Could Be A Deep Pit – Analyst",
    "body": "In the past few hours, Bitcoin has dropped below $80,000 amid another wave of liquidations as January comes to a rather volatile close. Analysts at Kobeissi note there have been three notable liquidation events in the past 12 hours, resulting in a combined loss of $1.3 billion. Such developments, coupled with a very fearful market after last week’s price slump, have pushed Bitcoin below a key price level. According to the renowned market expert Burak Kesmeci, Bitcoin’s behavior towards this $80,000 price zone holds significant consequences for the market trajectory. Related Reading: Bitcoin Estimated Leverage Ratio Spikes To New High — Fresh Volatility Ahead? Bitcoin Slips Under ETF Realized Price As Downside Risk Grows In a recent X post, Burak Kesmeci outlines the technical and on-chain importance of the $80,000 price level to the Bitcoin market. Before Bitcoin’s recent breakdown below $80,000, the asset had twice retested this zone following the correction phase that began in early October 2025. Each successful rebound from these retests reinforced $80,000 as a critical support level, with certain chart formations even hinting at potential trend reversal. This underscored the market’s technical sensitivity to this level before the recent loss. However, Kesmeci highlights an on-chain importance of the $80,000 price point in that it also functions as the cost basis of the Bitcoin Spot ETFs. Therefore, the recent price fall below $80,000 places a large cohort of institutional investors at risk of entering unrealized losses. In January 2026 alone, the Bitcoin ETFs already witnessed massive levels of withdrawals, resulting in a total net outflow of $1.61 billion. However, these figures are likely to surge higher as sustained price decline below the ETF cost basis is expected to trigger a wide-scale, panic-driven redemption among investors. In addition to its on-chain and technical importance, Kesmeci also notes that $80,000 presently functions as the True Market Mean. Related Reading: TD Sequential Flashes Buy Signal For XRP On Key Price Condition – Analyst What Next For Bitcoin? According to Burak Kesmeci, a bearish scenario would require a weekly close below the $80,000 support level. If confirmed, the analyst warns that bearish momentum could intensify, potentially driving Bitcoin lower toward $72,000, $68,000, and eventually $62,000 in sequence. This is because these levels align with notable volume profile clusters, representing potential areas where liquidity could accumulate, and the price may temporarily stabilize. Conversely, in a bullish scenario, Kesmeci notes that a sustained rebound from current levels could shift momentum back in favor of the bulls. The first major upside hurdle lies at $90,000, followed by the 111-period Simple Moving Average (SMA111) near $95,000, which is described as a critical level for confirming a medium-term trend reversal. A decisive break above the psychological $100,000 resistance would further strengthen the bullish case and signal a potential resumption of the broader uptrend. At press time, Bitcoin trades at $77,832, reflecting a 7.1% loss in the past day. Featured image from iStock, chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|Bitcoin Spot ETF cost basis|Bitcoin Spot ETFs|btcusd|BTCUSDT|Burak Kesmeci|True Market Mean",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57638285,
    "published": 1769947242000,
    "title": "Bitcoin LTH Supply Rises Again Amid Bearish Market Dynamics",
    "body": "The Bitcoin market experienced a shockingly dramatic weekend, as opposed to the typical silent price action displayed in previous weekends. On Saturday, January 31st, the world’s leading cryptocurrency seemingly led other crypto assets south of the charts, with its price falling from $84,350 to as low as $75,000 in a single swoop. As this unfolded, an inversely correlated shift also played out underneath the charts. A recent on-chain evaluation has pointed out that Bitcoin’s Long-term Holder behavior is changing, contrary to what its short-term holders are doing. Long-Term Holders Accumulate As Short-Term Supply Declines Pseudonymous on-chain analyst Darkfost recently took to CryptoQuant, via a Quicktake post, pointing out that Bitcoin’s long-term holders are racking up more BTC. The relevant indicator here is the LTH supply change (Coinbase fix). Related Reading: Rising Above The Ashes: XRP ETFs Set New Record Despite Market Crash For context, this metric tracks the net change in the amount of Bitcoin held by long-term holders (typically coins unmoved for ~155 days). According to the analyst, approximately 186,000 (on a monthly average) have been added to the Long-term holders’ supply. Seeing as more coins are aging past 155 days, Darkfost implied that short-term holder supply is, in turn, witnessing steady contraction. Notably, the analyst pointed out this kind of transition (between long-term and short-term investors) last happened in April, as the Bitcoin price retraced. As it is intuitively evident, a rising LTH supply is typically interpreted as growing conviction among Bitcoin’s long-term investors. By extension, this means that long-term holders are distributing less of their holdings and stowing away more. In theory, this behavior is bullish news for the cryptocurrency. This is because, as LTHs absorb supply, the amount of available Bitcoin for sale reduces. Historically, it is also a bullish signal for the BTC price, as it has often appeared during the early stages of accumulation periods or late into correction stages. However, the broader market implications in the current context might not be so favorable. Darkfost highlighted that there is very weak demand available to cushion the falling BTC price. At the same time, the Bitcoin market appears to be entering a bearish phase; hence, it is not far-fetched to see major capitulation events in the near-term. If this happens, the Bitcoin price would likely plummet, as weaker investors may sell off their holdings in fear or as victims of liquidation events. For a bullish outlook to be truly relevant, there has to be a clear recovery in demand, alongside continued long-term holder accumulation. Bitcoin Price At A Glance As of press time, the Bitcoin price stands at approximately $78,060, reflecting a 6.9% loss in the past day. Related Reading: Crypto Funds Bleed $1.80 Billion As Metals Rally Heats Up Featured image from iStock, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin long-term holders|Bitcoin news|bitcoin price|BTC news|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57640261,
    "published": 1769954400000,
    "title": "The era of ‘suitcase money’ is over: Why your offshore crypto is no longer safe from the taxman",
    "body": "Holders with large troves of unreported crypto held offshore are rightly getting nervous about new and invasive tax-reporting regimes.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|CoinDesk Wealth|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57641280,
    "published": 1769958000000,
    "title": "Quantum threat gets real: Ethereum Foundation prioritizes security with leanVM and PQ signatures",
    "body": "Earlier in January, the Ethereum Foundation formally elevated post-quantum security to a strategic priority, creating a dedicated Post-Quantum team.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Ethereum News|Ethereum Foundation|quantum computing|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57642058,
    "published": 1769960700000,
    "title": "'Join Them'—Apps Copying Pelosi And Polymarket Insiders Go Viral",
    "body": "A new generation of tools promises to level the playing field by tracking congressional trades and prediction market whales. The results are effective.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57641959,
    "published": 1769960255000,
    "title": "Bitcoin price forecasts tap sub-$50K levels as BTC copies old bear markets",
    "body": "Bitcoin bear market history was \"repeating,\" said BTC price analysis after key support failed and realized price flipped to new resistance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57642307,
    "published": 1769961613000,
    "title": "Ethereum Price Slips Below $2,500 — Here Are The Next Support Levels",
    "body": "The Ethereum price has been under intense bearish pressure over the past few weeks, reflecting the overall fragile state of the cryptocurrency market. The altcoin lost nearly 20% of its value in the past week, free-falling under the psychological $3,000 level since Thursday, January 29th. With the market still showing signs of further downside risk, there is no telling how deep the Ethereum price will fall in the current bearish setup. However, the latest on-chain data has offered insights into the next critical levels for the second-largest cryptocurrency. ETH’s Next Support Stands At $2,475: Glassnode In a recent post on the X platform, crypto analyst Ali Martinez identified the next three on-chain support levels for the Ethereum price. This on-chain evaluation revolves around the UTXO Realized Price Distribution (URPD) metric, which helps to pinpoint strong resistance and support levels based on investor cost bases. Related Reading: Ripple’s David Schwartz Shuts Down Claims Of XRP Hitting $100 For context, an investor’s cost basis refers to the actual price at which they purchased a particular cryptocurrency (Ethereum, in this scenario). Typically, the ability of a price level to function as an on-chain support or resistance zone depends on the number of investors who have their cost basis at the given level. As inferred earlier, the UTXO Realized Price Distribution tracks the amount of a particular cryptocurrency that was acquired at a specific price level. Now, the price levels below the present spot value with significant trading activity are often considered as major support zones, as shown in the chart below. The reasoning behind this expectation is that investors with their cost bases around these price levels are likely to double down on their positions and purchase more coins. This increased buying activity will, hence, offer a cushion for the Ethereum price to stay afloat and potentially bounce back. Highlighting data from Glassnode, Martinez identified the $2,623, $2,475, and $1,881 levels as the next crucial support zones for the Ethereum price after losing the $2,772 mark. However, it appears that the altcoin’s price has also lost the $2,623 and $2,475 support following its latest decline over the weekend. Ethereum Price Overview As of this writing, the price of ETH stands at around $2,410, reflecting an over 10% decline in the past 24 hours. With this latest decline, the altcoin’s price seems to be hovering around the support cushion at around $2,475. If ETH’s stay below this support level is sustained, investors could see the Ethereum price fall to as low as $1,881. A fall of this magnitude would represent a 25% decline from the current price point and an over 60% correction from the cycle high. Related Reading: Ethereum Boost: Vitalik Buterin Sets Aside $45M In ETH For Privacy And Open Tech Featured image from iStock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ETH URPD|ethereum|ethereum price|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57642304,
    "published": 1769961600000,
    "title": "How instant gratification is sucking the air out of the bitcoin market",
    "body": "Society is experiencing a shift toward gambles that offer rapid feedback and immediate stimulation over long-term investment.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|options market|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57641812,
    "published": 1769959978000,
    "title": "Here's why bitcoin traders are now betting billions on a drop to $75,000 and bailing on price rising higher",
    "body": "This surge in demand for lower-strike puts contrasts with the post-Trump-election pattern of enthusiasm for high-strike calls.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Bitcoin Options|Cryptocurrency Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57643283,
    "published": 1769965200000,
    "title": "Hints of progress: State of Crypto",
    "body": "The White House is meeting folks, Congress advanced a bill and key regulators are back to joint press appearances.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Newsletters|State of Crypto|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57643643,
    "published": 1769966493000,
    "title": "Crypto’s $19 billion '10/10' nightmare: Why everyone is blaming Binance for the bitcoin crash that won't end",
    "body": "Months after the Oct. 10 liquidation cascade, market depth has yet to recover, and traders are divided over Binance's role as bitcoin continues to crash.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Binance|market turbulence|Leveraged Trading|Liquidations|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57644183,
    "published": 1769968451000,
    "title": "Ethereum Founder Vitalik Buterin Made $70K Betting Against 'Crazy Mode' on Polymarket",
    "body": "The Ethereum founder claims his strategy of betting against extreme market sentiment \"usually makes money\" on Polymarket.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|polygon|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57644101,
    "published": 1769967840000,
    "title": "Bitcoin sell-off pushes IBIT investor returns into the red — asset manager",
    "body": "Based on dollar-weighted flows, aggregate returns for investors in BlackRock’s iShares Bitcoin Trust have turned negative following Bitcoin’s recent sell-off.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57644459,
    "published": 1769969416000,
    "title": "Senator Elizabeth Warren is sounding the alarm on Trump’s 'spy sheikh' crypto deal",
    "body": "Senator demands probe after report links Emirati intelligence chief to secret investment in U.S. crypto venture.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Policy|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57645279,
    "published": 1769972400000,
    "title": "Hong Kong is positioning itself as crypto’s global connector, says lawmaker Johnny Ng",
    "body": "The Hong Kong lawmaker and Web3 advocate said common law, open capital flows and ties to southern China give the city a unique role in global crypto markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Consensus Hong Kong 2026|Hong Kong|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57645366,
    "published": 1769972810000,
    "title": "Bitcoin's 'hopium' for bulls may be over and this weekend's slide could be just the beginning",
    "body": "Bitcoin’s sharp weekend drop triggered fresh liquidations, with analyst Eric Crown warning the market may face months of further downside.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|crypto market|liquidation|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57648434,
    "published": 1769983233000,
    "title": "Bitcoin Breaks Key Support, Analyst Signals Lower Levels Ahead",
    "body": "Bitcoin’s price action has fallen into bearish territory after dropping below an important previous low that had supported the rally for months. At the time of writing, Bitcoin is trading at $78,560 after falling to as low as $77,082 in the past 24 hours, a move that crypto analyst XForceGlobal says represents a significant change in the technical structure. According to his detailed Elliott Wave analysis shared on X, the price action has now invalidated the bullish framework many traders were relying on, and lower levels are becoming more likely in the coming weeks and months. Related Reading: Ethereum Boost: Vitalik Buterin Sets Aside $45M In ETH For Privacy And Open Tech Breakdown Below Previous Low Changes Primary Wave Count According to XForceGlobal, Bitcoin had been working through a complex sideways structure, specifically a WXY combination that was expected to resolve through distribution rather than outright breakdown. Bulls managed to complete three of the five required components of this triangle-like structure, but the failure to defend the prior low was the signal that led to a structural shift. This prior low refers to the $82,000 low in November 2025. Bitcoin bulls failed to defend this low when the price action broke below $80,000 in the most recent 24 hours. Once that level gave way, the primary wave count could no longer be maintained. In terms of the Elliott Wave count, that lower low means that price action from the all-time high should now be treated as separated and corrective, not part of a healthy continuation. This restructuring gives the current decline more room to develop from a Fibonacci extension perspective and changes how minimum and maximum downside targets should be evaluated. Bitcoin Price Chart. Source: @XForceGlobal On X Two Bearish Scenarios Point To The Same Zone The resulting analysis shows two main scenarios of how Bitcoin’s price action can continue from here, both of which are converging on similar downside levels. The first is a flat correction, where Bitcoin is currently unfolding a C wave. Although XForceGlobal describes this as the least attractive option, it would still imply a full distribution range that invalidates a bullish structure and drags the Bitcoin price to as low as $60,000. The second scenario is a macro ending diagonal structured as a WXY move to the downside. This scenario uses the October 2025 all-time high above $126,000 as a cut point to improve wave separation of the current price action. Interestingly, the price projection from this scenario also aligns with targets in the same $60,000 area. Despite different technical paths, both interpretations point to comparable downside risk over the medium timeframe. Related Reading: Crypto Funds Bleed $1.80 Billion As Metals Rally Heats Up Now that the larger structure is now compromised, XForceGlobal says it makes sense to adopt a shorter-timeframe bearish bias while reorganizing the next wave count. The outlook is that Bitcoin continues its decline to at least $60,000 before rebounding to stage a return above $100,000. Featured image from Pixabay, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|btcusd|crypto|crypto market|crypto news|cryptocurrency",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57649317,
    "published": 1769986034000,
    "title": "Crypto protocol CrossCurve under attack, $3M reportedly exploited",
    "body": "Crypto bridge CrossCurve has told users to pause interacting with its protocol while it conducts an investigation into a smart contract breach.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 57652479,
    "published": 1769995716000,
    "title": "UAE Royal’s Alleged Stake in Trump Crypto Venture Raises Ethical Concerns",
    "body": "A foreign investment in a Trump crypto firm reportedly preceded a reversal in U.S. AI chip restrictions, prompting corruption allegations.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57653983,
    "published": 1770000067000,
    "title": "Bitcoin Price Can’t Reclaim $80K, Putting $70K On The Radar",
    "body": "Bitcoin price started a major decline below $80,000. BTC is down over 10% and might soon test the $70,000 support zone. Bitcoin failed to remain above $82,500 and started another decline. The price is trading below $80,000 and the 100 hourly simple moving average. There is a bearish trend line forming with resistance at $79,200 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might dip further if it trades below the $75,000 and $74,000 levels. Bitcoin Price Dips Again Bitcoin price failed to remain stable above the $85,000 zone. BTC started a major decline below the $83,200 and $82,500 levels. The bears were able to push the price below $80,000. It spared major bearish moves, pushing the price below $78,000. A low was formed at $75,665, and the price is still signaling more downsides. There is also a bearish trend line forming with resistance at $79,200 on the hourly chart of the BTC/USD pair. Bitcoin is now trading below $78,500 and the 100 hourly simple moving average. If the price remains stable above $75,000, it could attempt a fresh increase. Immediate resistance is near the $78,500 level. The first key resistance is near the $79,200 level or the 23.6% Fib retracement level of the downward move from the $90,440 swing high to the $75,665 low. A close above the $79,200 resistance might send the price further higher. In the stated case, the price could rise and test the $82,000 resistance. Any more gains might send the price toward the $83,000 level or the 50% Fib retracement level of the downward move from the $90,440 swing high to the $75,665 low. The next barrier for the bulls could be $84,000 and $84,500. More Losses In BTC? If Bitcoin fails to rise above the $79,200 resistance zone, it could start another decline. Immediate support is near the $76,200 level. The first major support is near the $75,500 level. The next support is now near the $75,000 zone. Any more losses might send the price toward the $72,000 support in the near term. The main support sits at $70,000, below which BTC might struggle to recover in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $75,500, followed by $75,000. Major Resistance Levels – $79,200 and $82,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57654714,
    "published": 1770002287000,
    "title": "Ethereum Price $2,200 Collapse Raises Risk Of A Sub-$2K Spike",
    "body": "Ethereum price started a major decline after it failed to clear $2,500. ETH is down 20% and is now struggling to stay above the $2,200 support. Ethereum failed to stay above $2,550 and started a fresh decline. The price is trading below $2,400 and the 100-hourly Simple Moving Average. There is a major bearish trend line forming with resistance at $2,415 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase if it stays above the $2,200 zone. Ethereum Price Dips 20% Ethereum price failed to remain stable above $2,550 and started a major decline, like Bitcoin . ETH price traded below $2,400 to enter a bearish zone. The bears even pushed the price below $2,250. A low was formed at $2,220 and the price is now showing bearish signs below the 23.6% Fib retracement level of the recent decline from the $3,040 swing high to the $2,220 low. There is also a steep bearish trend line forming with resistance at $2,415 on the hourly chart of ETH/USD. Ethereum price is now trading below $2,350 and the 100-hourly Simple Moving Average . If the bulls remain in action above $2,200, the price could attempt another increase. Immediate resistance is seen near the $2,350 level. The first key resistance is near the $2,420 level and the trend line. The next major resistance is near the $2,500 level. A clear move above the $2,500 resistance might send the price toward the $2,620 resistance or the 50% Fib retracement level of the recent decline from the $3,040 swing high to the $2,220 low. An upside break above the $2,620 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $2,800 resistance zone or even $2,880 in the near term. More Losses In ETH? If Ethereum fails to clear the $2,420 resistance, it could start a fresh decline. Initial support on the downside is near the $2,220 level. The first major support sits near the $2,200 zone. A clear move below the $2,200 support might push the price toward the $2,120 support. Any more losses might send the price toward the $2,050 region. The main support could be $2,000. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI – The RSI for ETH/USD is now below the 50 zone. Major Support Level – $2,200 Major Resistance Level – $2,420",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57655451,
    "published": 1770004024000,
    "title": "BitRiver CEO arrested for alleged tax concealment: Reports",
    "body": "The Zamoskvoretsky Court in Moscow has reportedly ordered BitRiver CEO Igor Runets to remain under house arrest amid tax evasion charges.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 57655817,
    "published": 1770005289000,
    "title": "XRP Price Stumbles Toward $1.50, Bulls Running Out Of Room",
    "body": "XRP price extended losses and traded below $1.60. The price is now consolidating and might decline further if it remains below $1.50. XRP price started a fresh decline below the $1.650 zone. The price is now trading below $1.60 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance at $1.650 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move down if it stays below $1.650. XRP Price Dives 15% XRP price failed to stay above $1.80 and started a fresh decline, like Bitcoin and Ethereum . The price declined below $1.720 and $1.650 to enter a short-term bearish zone. The price even spiked below $1.550. A low was formed at $1.50, and the price is now consolidating losses. There was a recovery wave above $1.550. The price even cleared the 23.6% Fib retracement level of the downward move from the $1.938 swing high to the $1.50 low. The price is now trading below $1.60 and the 100-hourly Simple Moving Average. If there is a fresh upward move, the price might face resistance near the $1.60 level. The first major resistance is near the $1.650 level. There is also a key bearish trend line forming with resistance at $1.650 on the hourly chart of the XRP/USD pair. A close above $1.650 could send the price to $1.720 or the 50% Fib retracement level of the downward move from the $1.938 swing high to the $1.50 low. The next hurdle sits at $1.770. A clear move above the $1.770 resistance might send the price toward the $1.80 resistance. Any more gains might send the price toward the $1.8350 resistance. The next major hurdle for the bulls might be near $1.90. Another Decline? If XRP fails to clear the $1.60 resistance zone, it could start a fresh decline. Initial support on the downside is near the $1.540 level. The next major support is near the $1.5150 level. If there is a downside break and a close below the $1.5150 level, the price might continue to decline toward $1.50. The next major support sits near the $1.4650 zone, below which the price could continue lower toward $1.420. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $1.540 and $1.50. Major Resistance Levels – $1.60 and $1.650.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57656561,
    "published": 1770007425000,
    "title": "Story delays $IP token supply unlock as usage lags and dump fears grow",
    "body": "Team and investor tokens now set to unlock in August 2026 as the IP-focused blockchain moves to slow new supply, tighten token economics and buy time to build network usage amid weak market sentiment.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Story protocol|IP|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57656543,
    "published": 1770007360000,
    "title": "Bitcoin Derivatives Signal Elevated Stress Following Market Rout",
    "body": "Bitcoin’s weekend plunge opened a rare CME futures gap, as macro and geopolitical pressures drove a broad deleveraging.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57657220,
    "published": 1770009209000,
    "title": "Nevada Court Grants Temporary Restraining Order Against Polymarket",
    "body": "Nevada's court ruling against Polymarket comes as prediction markets face global regulatory pressure and bans across multiple jurisdictions.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57657193,
    "published": 1770008518000,
    "title": "Michael Saylor’s High-Stakes Bitcoin Bet Faces Fresh Strain",
    "body": "Bitcoin’s latest plunge is putting the world’s largest corporate crypto treasury under renewed pressure.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NMS:MSTR",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57657832,
    "published": 1770011056000,
    "title": "CrossCurve Threatens Legal Action After $3M Cross-Chain Bridge Exploit",
    "body": "The protocol warned it may pursue criminal and civil action after identifying addresses tied to a hack of its token transfer system.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 57658180,
    "published": 1770011791000,
    "title": "Crypto stolen hit $370M in January, quadrupling year on year: CertiK",
    "body": "The amount of crypto stolen in January is also a 214% increase from the month before, with a majority of the value lost due to a single phishing incident.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57658037,
    "published": 1770011621000,
    "title": "Jupiter brings Polymarket to Solana and lands $35 million investment deal",
    "body": "Jupiter said Polymarket will be integrated on its platform, while ParaFi Capital has made a $35 million strategic investment in JUP with an extended lockup.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 123,
        "NAME": "JUP",
        "CATEGORY": "JUP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57657964,
    "published": 1770011492000,
    "title": "Average Bitcoin ETF buy underwater as investors pull $2.8B in 2 weeks",
    "body": "Bitcoin fell as low as $74,600 on Monday following a weekend rout, a nine-month low. for the cryptocurrency.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57656291,
    "published": 1770006015000,
    "title": "Bitcoin Flirts With Lowest Price Since Trump’s Return to Office",
    "body": "Bitcoin fell to a 10-month low in Asia trading Monday following a weekend selloff, with sentiment fragile amid broader market turbulence.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]