[
  {
    "id": 55028343,
    "published": 1764309608000,
    "title": "Bitcoin Bullish Rebound Sparks Path Toward The $98,000 Imbalance Zone",
    "body": "Bitcoin is showing new signs of strength after its sharp decline, with buyers stepping back in and momentum shifting upward. With price reclaiming key support levels, the path toward the major $98,000 imbalance zone is now back on the table, but bulls still need to prove this rebound has real conviction. FVG Filled, Bearish OB Tagged — What Comes After The Perfect Hit? Crypto analyst Crypto Patel, in a recent market update, noted that Bitcoin has now completed a key technical move by filling the Fair Value Gap (FVG) and tapping directly into the Bearish Order Block exactly as previously projected. He emphasized that traders who avoided shorting the $81,000–$85,000 region and instead positioned for the upside likely captured a clean and predictable long setup. Related Reading: Bitcoin’s New ‘Line In The Sand’ May Be $82,000, Not $56,000: Analyst With that phase now complete, the focus shifts to Bitcoin’s next major target. Patel highlights the $96,800–$98,000 FVG as the upcoming high-timeframe imbalance zone. From a broader perspective, Patel still expects Bitcoin to make a move toward the $98,000 zone before any significant corrective leg unfolds. This aligns with his macro outlook, which continues to favor a final upward sweep into that region before momentum weakens again. However, he also outlines a clear invalidation point for the bearish bias. A sustained high-timeframe close above $107,550 would negate the existing bearish market structure entirely. Such a breakout would signal the start of a new bullish phase for Bitcoin, potentially setting the stage for a fresh all-time-high trend. Promising Bounce As BTC Defends the $90,000 Support Zone According to The Boss, Bitcoin’s latest price action is showing early signs of strength. After the sharp decline, BTC reacted firmly at the local support and managed to push back above the $90,000 level, indicating that buyers are stepping in with renewed confidence. The chart now reflects a stable support zone that has held up against downward pressure. Related Reading: Bitcoin Bear Market Confirmed? Expert Predicts Price Target Of $40,000 By Late 2026 Part of this rebound appears to be driven by improving macro sentiment. Softer expectations around Federal Reserve tightening, a rise in overall risk appetite, and a shift back toward risk-on assets are all contributing to Bitcoin’s recovery attempt. From a technical perspective, The Boss notes that Bitcoin must continue to hold above the $90,000–$91,000 range to form a meaningful upward wave from this base. However, caution is still warranted. Without clear confirmation from momentum indicators and sustained trading volume, the current move has the potential to be limited. The possibility of a dead-cat bounce remains on the table, especially following such an aggressive sell-off. Featured image from Pngtree, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|Fair Value Gap|FVG|The Boss",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55029697,
    "published": 1764311378000,
    "title": "Balancer Outlines Reimbursement Plan Following $128M Exploit",
    "body": "Balancer has identified six whitehat actors who recovered approximately $3.9 million across multiple networks during the exploit.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 10,
        "NAME": "BAL",
        "CATEGORY": "BAL"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 55029493,
    "published": 1764311075000,
    "title": "Bitcoin and S&P 500 Year-End Bull Run Loading? Vol Metrics Say Yes",
    "body": "Implied volatility indices tied to bitcoin and the S&P 500 have erased the recent spike, offering bullish price signals.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Volatility|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55029352,
    "published": 1764310854000,
    "title": "UK takes ‘meaningful step forward’ with proposed DeFi tax overhaul",
    "body": "The UK has proposed a “no gain, no loss” approach to decentralized finance transactions, scrapping capital gains taxes on deposits to crypto lending platforms.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55031411,
    "published": 1764308550000,
    "title": "Cryptos Steady as BTC Hits Key Fib Level, Traders See Room for $100K but Little Beyond",
    "body": "Traders have quickly re-priced the macro backdrop as the probability of a 25 bps cut at the upcoming FOMC meeting has surged from 39% to almost 87% in a matter of days.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55033711,
    "published": 1764316821000,
    "title": "Bitcoin Puell Multiple Plunges, But Not Inside Bottom Zone Yet",
    "body": "On-chain data shows the Bitcoin Puell Multiple has gone through a decline recently, a sign that miner revenue has gone down relative to its baseline. Bitcoin Puell Multiple Has Dropped To 0.67 In a new post on X, analyst Ali Martinez has talked about the latest trend in the Bitcoin Puell Multiple. The “Puell Multiple” refers to a popular on-chain indicator that keeps track of the ratio between the daily BTC mining revenue (in USD) and 365-day moving average (MA) of the same. Related Reading: Bitcoin Could Be At Risk Of A Deeper Bear If This Ratio Compresses, Says Glassnode Miners earn their income through two sources: block subsidy and transaction fees. In the context of the metric, however, only the former part of their revenue is relevant. Block subsidy is a fixed BTC-denominated reward that miners receive when they add the next block to the chain. Usually, it makes up for the dominant and stable part of miner income. When the value of the Puell Multiple is greater than 1, it means that the network validators are earning a higher revenue from block subsidy than the average for the past year. On the other hand, the metric being under the mark implies miners are making less than usual. Now, here is the chart shared by Martinez that shows the trend in the Bitcoin Puell Multiple over the past decade: As displayed in the above graph, the Bitcoin Puell Multiple has witnessed a rapid decline recently that has taken its value below the 1 level. This drop in the metric is a result of the bearish price action that the cryptocurrency has faced. The block subsidy is fixed in BTC value and is more-or-less also fixed in rate of time, so the daily BTC income from it is about constant for miners. The USD value of the reward, however, is dependent on the asset’s spot price, which is indeed variable. The earlier bull run resulted in the Puell Multiple rising above the 1 mark as miner revenue from block subsidy surged. Similarly, the market downturn has led to a decline in the USD miner income. Today, the metric’s value is 0.67, meaning that the chain validators are making just 67% of the average revenue from the last 365 days. Historically, miners being under a high amount of pressure has made bottoms more probable for Bitcoin. Related Reading: Bitcoin’s New ‘Line In The Sand’ May Be $82,000, Not $56,000: Analyst As the analyst has highlighted in the chart, the major bottoms since 2015 have generally formed when the Puell Multiple has dipped below 0.50. If the current cycle is also going to follow a similar pattern, then miner pain may not be enough for a bottom yet. BTC Price The latest rebound in the Bitcoin price has sustained for now as its price is still trading around $91,600. Featured image from Dall-E, Glassnode.com, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin Bottom|Bitcoin Puell Multiple|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55036281,
    "published": 1764320431000,
    "title": "Hyperliquid (HYPE) Ready For A Significant Surge To $50: Key Levels Identified",
    "body": "After dipping below the $30 mark last week, Hyperliquid (HYPE), the native token of one of the rapidly expanding decentralized exchanges (DEXs), has managed to recover by 2% this Thursday, positioning itself to benefit from this latest upward movement that has seen the leading cryptocurrencies recover key levels. HYPE Poised For A New Rebound Market analyst OxMakeSense has highlighted the potential roadmap for HYPE to reach $50 in the short term, just below all-time high levels of $59, indicating that the token is starting to show the first signs of a significant shift. He emphasizes that the upcoming levels are filled with untouched liquidity, which could facilitate a climb for HYPE. Related Reading: Bitcoin Price Climbs Back To $91,000: Is The Decline Over? Key Levels To Watch Following a month of pressure, the analyst asserted that the asset recently formed its first solid rebound, suggesting that the selling pressure has begun to ease and market reactions are gaining strength. OxMakeSense identifies a crucial checkpoint for Hyperliquid in the $37–$38 price range, marking where the last breakdown occurred. If HYPE can reclaim this level, he suggested that it could lead to a squeeze of “trapped sellers.” Additionally, surpassing the $38 threshold would open up the chart for a direct move toward the $41–$42 range, an area described as “thin” with little major resistance left from prior sell-offs. Analyst Warns Of Potential Retracement To $25 In his social media analysis, OxMakeSense noted that the momentum pivot sits at a significant level of $44. He stated that strong trends typically begin by reclaiming mid-range levels like this one. Should HYPE flip this resistance into support, it is expected to accelerate further. Above $44, HYPE would enter a clearer trajectory, with targets aligning at $48 and ultimately at $50, where a substantial amount of untouched liquidity resides. Related Reading: Metaplanet In Jeopardy: Bitcoin Needs To Surpass $108,000 By December 18 To Prevent New Crisis However, not all analysts share the same bullish outlook. Fellow analyst Crypto TXG has expressed concerns regarding HYPE’s recent performance, pointing out that it lost the $35.8 level and found a temporary bottom near $28.5. While HYPE has reversed the trend, it is currently testing the $35.8 mark from below, which acts as a barrier. If HYPE can break through this resistance, the next target would be $42.3. Conversely, if it fails at $35.8, another pullback could occur, potentially retesting the $28.5 support more decisively. Adding to the cautious sentiment, market expert Ali Martinez has indicated that if the token retests the breakdown zone, there is a possibility it could revisit the $25 mark. This suggests that, despite the recent uptick, a short-term retracement of approximately 28% could be on the horizon. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|HYPE news|HYPE price|Hype price anaysis|HYPE price forecast|HYPE price news|Hyperliquid|Hyperliquid (HYPE)|Hyperliquid news|Hyperliquid price|HYPEUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55036279,
    "published": 1764320427000,
    "title": "Best Wallet Token’s Presale Ends in 3 Hours: Last Chance to Buy Before Listing",
    "body": "What to Know: Current wallets often force a trade‑off between centralized risk, clunky UX, and minimal user benefits, leaving mainstream crypto users underserved. Fragmented multichain activity and chaotic presale access highlight the need for a unified, mobile‑first wallet hub with built‑in economic incentives. Best Wallet Token builds a Fireblocks‑powered, non‑custodial wallet with multichain DEX aggregation and curated presale access through its Upcoming Tokens portal. $BEST underpins reduced fees, staking rewards, and higher APY opportunities, aligning user growth with token demand as Best Wallet targets mass adoption. Crypto has quietly shifted back into ‘build and buy infrastructure’ mode. Traders aren’t just chasing memecoins anymore – they’re hunting tools that actually make Web3 usable: safer wallets, better UX, and lower friction for multichain swaps and presales. Wallets sit at the center of that stack, but most haven’t evolved in years. You still juggle browser extensions, clunky mobile apps, and centralized providers that can freeze you out or blow up overnight. On the other hand, hardcore non-custodial wallets often feel hostile to newcomers, with confusing approvals, no real benefits for loyal users, and little support for cross-chain flows. That gap is where Best Wallet is trying to plant its flag. It positions itself as ‘The Next Gen Crypto Wallet,’ aiming to merge institutional-grade security, clean mobile UX, and actual economic perks for holders. And Best Wallet Token ($BEST) is the official token of this ecosystem. With 1 $BEST still priced at $0.026015 in presale and the raise already above $18.1M, the market has effectively pre‑voted on the thesis before any exchange listing. You can read our analysis of Best Wallet Token for more context. Best Wallet Builds A Mobile-First, Benefit-Driven Web3 Hub Best Wallet is designed as a mobile-first, non‑custodial wallet that tries to feel like a fintech app, not a developer tool. You get an intuitive interface, no KYC, and support for thousands of assets across 6+ chains, while still retaining self-custody of your keys and funds at every step. Under the hood, it’s the first fully integrated Fireblocks MPC‑CMP wallet in this segment, combining advanced key management with custom multi-wallet portfolios for more sophisticated users. An Upcoming Tokens portal curates the best crypto presales , giving you simplified access to vetted early‑stage opportunities instead of trawling Telegram threads or DEX listings alone. For trading, the Best DEX aggregator is powered by Rubic, routing orders across 50+ chains, 330+ DEXs, and 30 cross‑chain bridges to seek competitive pricing and fewer failed swaps. And what powers all of this is the wallet’s official token, Best Wallet Token ($BEST) – here’s how to buy $BEST now and join the presale. How High Could $BEST Go If Adoption Lands? If Best Wallet captures 5% of the global crypto wallet market, $BEST could reach a speculative $0.05106175 by the end of 2026, delivering roughly 97% returns from the current presale price of $0.026015. Read our $BEST price prediction to see why this estimation is within reason. Token utility is designed to reinforce that adoption loop. An 8% allocation – 800M $BEST – is reserved for staking rewards via a dynamic pool where your yield scales with your share of total staked tokens. Crucially, staking is available during presale, giving early participants a way to put idle allocations to work immediately. On top of that, $BEST holders are set to receive reduced fees across the Best Wallet ecosystem, higher APY options in the staking aggregator, and access to exclusive presales and iGaming partnerships through the Upcoming Tokens portal. If those perks pull users away from older wallets, the upside case becomes less theoretical and more realistic and promising. Best Wallet’s pitch is simple: combine institutional‑grade security, a mainstream‑ready mobile experience, deep multichain connectivity, and actual token‑holder benefits into a single app. With the presale still at $0.026015 and over $18.1M already raised, the project is trying to lock in a user base before the next wave of wallet competition hits. Whales have bought over $155K yesterday and today ($84.5K here , $59.3K here , and $12k here ). If you think the next cycle rewards usable infrastructure over pure speculation, $BEST is positioned as a leveraged bet on that thesis. You’re not just backing a token – you’re backing a wallet that aims to be the first screen every new crypto user opens. Join the $BEST presale before it ends in under 3 hours. This article is marketing communication and educational content, not investment, trading, or financial advice; always do your own research before investing Authored by Aaron Walker, NewsBTC – https://www.newsbtc.com/news/best-wallet-token-presale-last-chance-before-listing",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55036899,
    "published": 1764321164000,
    "title": "South Korea targets sub-$680 crypto transfers in sweeping AML crackdown",
    "body": "South Korea’s AML overhaul introduces stricter reporting, bans offenders from owning VASPs, and implements preemptive freezes to prevent illicit crypto flows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55037416,
    "published": 1764321164000,
    "title": "South Korea targets sub-$680 crypto transfers in sweeping AML crackdown",
    "body": "South Korea’s AML overhaul introduces stricter reporting, bans offenders from owning VASPs and implements preemptive freezes to prevent illicit crypto flows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55038816,
    "published": 1764324031000,
    "title": "Solana Reclaims Crucial Resistance Despite First SOL ETF Outflows – 25% Rally Ahead?",
    "body": "As the crypto market rebounds from the recent lows, Solana (SOL) has reclaimed a crucial level, nearing a key resistance area that could set the stage for a long-awaited price recovery rally, according to some market watchers. Related Reading: Ethereum’s End-Of-Year Rally Still At Play? Analysts Eye 50% December Jump Solana Bounces Despite ETF Outflows The crypto market has surged above the $3 trillion mark for the first time in a week, with Bitcoin, Ethereum, and most leading cryptocurrencies reclaiming crucial support levels lost during the latest market pullback. Solana joined the market rally and jumped from the recently recovered $135-$140 area to the upper zone of its local range on Wednesday afternoon. Notably, the altcoin has been trading between the $130-$145 price range over the past two weeks, briefly losing the lower boundary during last week’s correction. This week, SOL’s price has reclaimed some crucial ground, surging over 10% since Monday’s opening and nearing the $145 resistance. Amid this performance, analyst Ted Pillows noted institutional participation, as SOL treasury companies have started to show early signs of recovery. He also highlighted that Solana Exchange-Traded Funds (ETFs) have experienced record inflows this month despite the correction. According to Farside Investors’ data, the SOL-based investment products have registered $613 million in inflows since their launch on October 28. It’s worth noting that throughout the recent pullbacks, Solana funds have seen a strong demand, with a 22-day positive streak while the altcoin’s price descended to multi-month lows. However, as its price recovered, SOL’s ETFs registered their first negative in nearly a month. 21Shares’ TSOL, which launched a week ago, saw $34 million in outflows on Wednesday, outshining the over $13 million and $10 million in inflows of Bitwise’s BSOL and Grayscale’s GSOL. As a result, the whole category recorded net outflows of $8.1 million. In his analysis, Ted Pillows also noted that “It seems like SOL has bottomed for a while, but institutional buying needs to accelerate here. Otherwise, it won’t take long for Solana to make new lows.” SOL Ready For December Recovery? Analyst Ali Martinez suggested that Solana’s pain might be over as its price “usually bottoms when investors capitulate… And for the past two weeks, that’s exactly what’s been happening.” According to the chart, SOL’s price has historically found a floor when the Net Unrealized Profit/Loss (NUPL) indicator reaches the capitulation zone, which it has recently fallen to. Meanwhile, Crypto Patel highlighted that Solana is breaking out of a one-month downtrend, which could trigger a 25% recovery rally near the key $180 barrier in the coming weeks. Another market observer warned that the altcoin is “walking straight into the lion’s den” as its price nears the $144-$146 resistance levels. Trader Mr. Ape noted that Solana’s price has been rejected three times from this heavy supply area, and momentum “is slowing again as we hit the zone.” Related Reading: XRP ETFs Outshine BTC, ETH, And SOL Funds With $164M Single-Day Inflows To the trader, this is the crucial level to watch, as another rejection could send the price to the $132 support, where strong demand lies from the previous bounce. On the contrary, a successful breakout from this level and reclaiming it as support could confirm the shift and trigger a surge to the $157 area. As of this writing, Solana is trading at $142, a 7.7% increase on the weekly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|Bitwise BSOL|BSOL|btc|crypto market correction|Crypto Market Recovery|ethereum|Sol|Solana|Solana breakout|Solana ETFs|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55039753,
    "published": 1764325325000,
    "title": "Crypto Exchange KuCoin's European Arm Wins MiCA License in Austria",
    "body": "KuCoin EU obtained a Markets in Crypto Assets (MiCA) regulation license in Austria, allowing it to offer regulated services across the EEA.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|KuCoin|Austria|MiCA|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55039620,
    "published": 1764325035000,
    "title": "IMF warns tokenized markets may deepen flash crashes, says governments will step in",
    "body": "Tokenization promises faster and cheaper markets, but the IMF warns that new risks and government intervention will accompany the shift to programmable finance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55040804,
    "published": 1764326723000,
    "title": "Trump White House ‘World’s Most Corrupt Crypto Startup Operation’: House Democrats",
    "body": "President Trump and his family made $800 million from sales of cryptocurrencies in the first half of the year, according to a new report.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55040262,
    "published": 1764325966000,
    "title": "Tom Lee $100K Bitcoin Prediction Wakes Sleeping Whales for Bitcoin Hyper",
    "body": "What to Know: Tom Lee’s $100K Bitcoin target reinforces the idea that this cycle still has upside, pushing traders toward higher-beta plays beyond BTC itself. Bitcoin’s core limitations (slow throughput, variable fees, and no native smart contract) are driving intense interest in Layer 2 designs that unlock scalable, programmable $BTC liquidity. Competing Bitcoin L2 approaches now range from EVM sidechains to rollups and SVM-based execution layers, each trying to capture the next wave of $BTC-driven on-chain activity. Bitcoin Hyper introduces an SVM-powered Bitcoin Layer 2 with extremely low-latency execution and $BTC-settled smart contracts, targeting DeFi, payments, and gaming use cases. When Fundstrat’s Tom Lee publicly floats a $100K Bitcoin target before year end, it doesn’t just light a fire under $BTC. It revives the idea that this cycle still has serious upside left, and that the most aggressive upside often comes from narrative-driven plays orbiting Bitcoin rather than $BTC itself. If you’ve traded previous bull markets, you’ve seen this movie before. As soon as big-name analysts turn openly bullish, attention turns from Bitcoin into higher-beta sectors. This includes leverage products, Bitcoin Layer 2s, and infrastructure tokens that can outperform if $BTC actually makes that leg higher. That’s where Bitcoin Hyper ($HYPER) starts to make more sense on trader watchlists. Instead of being ‘just another alt,’ it’s pitched as a direct way to amplify a renewed Bitcoin move. How? By unlocking the one thing $BTC has never had at scale: fast, programmable blockspace tied back to Bitcoin’s settlement layer. In that context, Bitcoin Hyper isn’t competing with Bitcoin. It’s monetizing the gap between Bitcoin’s perks (security, brand, liquidity) and trader demands: sub-second execution, low fees, and a place to deploy real DeFi and dApps around $BTC. As more readers dig into Tom Lee’s thesis, expect a growing chunk of them to ask not only ‘Can Bitcoin hit $100K?’ but also ‘What could ride its coattails the hardest if it does?’ That’s the funnel where narrative-heavy infrastructure plays like Bitcoin Hyper tend to live. You can read a dedicated breakdown in our ‘ what is Bitcoin Hyper ’ guide. Why Bitcoin Layer 2 Narratives Heat Up In Late-Cycle Rallies The structural problem hasn’t changed: Bitcoin settles around 7-10 transactions per second on L1, with variable fees and no native smart contracts. That’s fine for long-term holders. But the building potential is capped without a Layer 2 that handles high-throughput execution. As price targets like Lee’s $100K call re-enter the discourse, that technical ceiling becomes a trading angle. If $BTC does break higher, on-chain activity and speculative demand for ‘Bitcoin-adjacent’ yield, DeFi, and leverage historically spike. Infrastructure that can absorb that flow (Lightning, sidechains, and new L2s) tends to capture outsized attention relative to its actual maturity. You’re already seeing a mini arms race: Bitcoin rollup experiments, EVM sidechains pegged to $BTC, and Solana-style high-throughput designs aimed at Bitcoin liquidity. Bitcoin Hyper slots in as one of those options: a Bitcoin Layer 2 that leans on the Solana Virtual Machine rather than EVM. It tries to offer Solana-like speed while staying anchored to $BTC. For traders, it’s another way to express a view that ‘this time, Bitcoin’s upside should come with usable blockspace.’ Here’s a step-by-step guide to buy $HYPER now. Inside Bitcoin Hyper’s Bet On SVM-Powered Bitcoin Blockspace $HYPER’s architecture is modular: Bitcoin L1 for settlement and finality, and a real-time SVM Layer 2 where high-frequency smart contracts and DeFi logic actually run. The thesis is simple: if you can get Solana-style performance, which includes low-latency transaction processing, sub-second confirmation, and fees closer to fractions of a cent), but with $BTC as the underlying asset and settlement layer, then you potentially unlock a very different flavor of the Bitcoin ecosystem. High-speed payments in wrapped $BTC, AMMs, lending markets, NFT platforms, and gaming dApps can all execute on SVM while periodically anchoring state back to Bitcoin. Technically, Bitcoin Hyper uses a single trusted sequencer with periodic state anchoring to Bitcoin, plus a Decentralized Canonical Bridge for $BTC transfers into the L2. SPL-compatible tokens are modified for this environment, letting Solana-native devs port Rust-based code and tooling into a Bitcoin-centric context with relatively low friction. For builders used to Solana’s SVM, that’s a powerful on-ramp. On the token side, the presale has already raised $28.6M, with tokens currently priced at $0.013345. Smart money is moving as well: one whale bought $500K $HYPER two weeks ago . If you’re betting that Bitcoin’s next leg includes not just higher prices but more sophisticated on-chain activity, Bitcoin Hyper is effectively a leveraged play on that thesis via SVM-powered blockspace. Join the $HYPER presale now for a 40% staking APY. This article is for informational purposes only and does not constitute financial, investment, or trading advice; always do your own research. Authored by Elena Bistreanu, NewsBTC – https://www.newsbtc.com/news/tom-lee-100k-bitcoin-target-puts-bitcoin-hyper-on-watchlists",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55041291,
    "published": 1764327179000,
    "title": "Wemade rallies partners for KRW stablecoin push after years of setbacks",
    "body": "Wemade’s new GAKS alliance brings Chainalysis, CertiK and SentBe together to support a compliant KRW stablecoin mainnet after multiple setbacks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55041117,
    "published": 1764326905000,
    "title": "KuCoin’s EU arm secures MiCA license in Austria, Malta excluded",
    "body": "Licensed by Austria’s Financial Market Authority, KuCoin EU can operate across 29 EEA countries, excluding Malta.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55041857,
    "published": 1764328133000,
    "title": "BlackRock’s Own Income Fund Boosts Bitcoin ETF Holdings 14%",
    "body": "Strategic Income Opportunities Portfolio expands its allocation to the iShares Bitcoin Trust amid rising institutional demand.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|BlackRock|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55042906,
    "published": 1764329338000,
    "title": "Crypto industry pledges over $3M to victims of Hong Kong’s deadliest fire in decades",
    "body": "The crypto industry rushed to the aid of Hong Kong residents who suffered the city’s most devastating fire in 80 years, which has claimed the lives of at least 128 people.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55044140,
    "published": 1764331227000,
    "title": "Bitcoin Ready For $250,000 As ETF Basis Trade Dies, Says Arthur Hayes",
    "body": "Arthur Hayes believes Bitcoin’s October flush to $80,000 marked the end of a liquidity-driven reset, not the start of a new bear market – and that the structural forces that pushed BTC down are now reversing. $80,000 Was The Bottom As Dollar Liquidity Turns In a Milk Road Show episode recorded November 26 and released November 27, the BitMEX co-founder argued that the much-celebrated US spot ETF “institutional bid” was largely a leveraged basis trade that has now run its course at the same time as US dollar liquidity appears to have bottomed. “And so that’s why I believe that the $80,000 dip on Bitcoin recently is the bottom,” Hayes said. “And now we’re going to have a supportive liquidity situation, at least marginally on the dollar, and we’re bottom here and can go higher.” Hayes is still openly targeting a blow-off move into the $200,000–$250,000 range by year-end, repeating the call from his recent “Snow Forecast” essay. “I’m going to stick with it,” he said. “If I’m wrong it doesn’t matter. I’m long, right? I’m still happy either way. It’s either $200k–$250k or not.” Related Reading: Bitcoin’s New ‘Line In The Sand’ May Be $82,000, Not $56,000: Analyst At the time of recording, the host noted Bitcoin was “back above $90K.” Hayes said ETF flow charts that dominated crypto social media in the spring and summer badly misled retail. He pointed to the largest holders of BlackRock’s iShares Bitcoin Trust (IBIT) – Brevan Howard, Goldman Sachs, Millennium, Avenue, Jane Street – as evidence that the dominant players were not long-only allocators. “These entities are not places where they’re just going to go long Bitcoin,” he said. Instead, they were running a standard basis trade: buying IBIT, pledging it as collateral and shorting CME futures. “They were making, let’s call it 7 to 10% per annum on that trade. They fund Fed funds at four-ish percent and they lever it up.” When the futures basis collapsed following the October 10 liquidation cascade, that trade had to be unwound by selling the ETF and covering futures shorts, flipping net ETF flows from strong inflows to outflows. Retail investors misread that as “institutions turning bearish.” “Retail thinks, ‘Oh no, institutions loved Bitcoin in the summer and now they hate it in the fall, therefore I need to get rid of my exposure as well,’ not understanding what was driving those flows in the first place,” Hayes said. He paired this with a second temporary pillar: listed digital asset treasury (DAT) companies that issue stock or debt to buy Bitcoin. Once those vehicles traded at net asset value or a discount, new issuance became uneconomic and in some cases incentivized selling BTC to buy back shares, removing another marginal buyer. Macro Conditions Are The Key Catalyst Against that micro backdrop, Hayes situates a much larger macro shift. He tracks a proprietary US dollar liquidity index built from Fed balance sheet series and commercial bank data. In his telling, roughly a trillion dollars of liquidity was drained from dollar money markets from July onward due to Treasury General Account (TGA) refilling and Federal Reserve quantitative tightening. Related Reading: Bitcoin Is Now Tied To A 2-Year Cycle, Warns Investment Firm CIO In 2023, then-Treasury Secretary Janet Yellen could offset that drain by issuing huge amounts of high-yielding T-bills that pulled about $2.5 trillion out of the Fed’s reverse repo facility back into the system. In 2025, he argues, Treasury Secretary Scott Bessent had no such reservoir to tap. Now, Hayes says, both the TGA rebuild and QT have effectively run their course. The TGA has been restored to its target zone, and the Fed has halted balance sheet runoff. “We have essentially bottomed on the liquidity chart and the direction in the future is higher,” he said, adding that markets are still waiting to see how the Trump administration actually delivers on promises of massive credit creation via industrial policy, bank lending and a more dovish Fed. He expects the next leg of liquidity to come more from commercial banks than the central bank, citing early signs of rising bank lending and public commitments from institutions like JPMorgan to finance large industrial programs. Hayes was equally direct on the October 10 wipeout, calling it a harsh lesson for underprepared leveraged traders rather than a coordinated hunt. “People think that I’m going to get off of work and trade leveraged crypto for a few hours and I’m going to somehow make money. No, you’re going to get liquidated,” he said. “If you are a proper trader, you should not get liquidated. Period.” On positioning, Hayes said he used the post-crash environment to buy what he considers fundamentally strong altcoins like Pendle, Ethena and EtherFi at levels last seen months earlier. He expects those to outperform ETH in the short term but still backs the long-term “institutional DeFi” narrative that could take Ethereum to “the $10,000 to $20,000 price by the end of the cycle.” For now, his core thesis is simple: the ETF basis trade is largely gone, the liquidity drain is over, leverage has been flushed – and the macro tide, in his view, is turning back in Bitcoin’s favour. At press time, BTC traded at $91,004. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|Arthur Hayes|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55043796,
    "published": 1764330785000,
    "title": "Best Crypto To Buy As Bolivia’s Reserves Fall From $15B To $2B And Banks Embrace Digital Assets",
    "body": "What to Know: Bitcoin Hyper turns Bitcoin into a programmable, SVM-powered Layer 2, enabling low-latency BTC payments, DeFi, and gaming while anchoring security to Bitcoin. SUBBD leverages AI and Web3 to give creators lower fees, token-gated content, and crypto payouts, targeting the $85 billion content industry. Solana’s high throughput, low fees, and new US spot ETF support cement its role as a leading institutional-grade Layer‑1 blockchain. Bolivia’s reserve stress and banking pivot to digital assets underscore the growing demand for crypto infrastructure in the real world, rather than purely speculative tokens. A country’s financial stress often shows up in its policy decisions long before it appears in headlines. Bolivia’s reversal of its crypto ban and its move to let banks custody digital assets isn’t a quirky policy pivot. It’s what happens when foreign reserves fall from over $15B to roughly $2B. In such an environment, stablecoins and liquid crypto rails suddenly appear as essential survival tools. When a country with a long history of monetary controls starts legitimizing digital assets, it shows where macro pressure is heading. Capital wants neutral, censorship-resistant settlement layers. It also wants programmable money that can plug into banking pipes without IMF approval. That shift is why narrowing down the best crypto to buy means focusing on projects with real-world utility. Payment rails that can settle in BTC, high-throughput chains institutions can rely on, and creator-economy infrastructure all rise to the top. Against that backdrop, three plays stand out. Bitcoin Hyper ($HYPER) is emerging as a Bitcoin-native execution layer with near-Solana speeds. SUBBD ($SUBBD) is building AI-driven tools for creators, while a US spot ETF now backs Solana (SOL) and remains the institutional high-performance L1. Each taps into a concrete use case that becomes more valuable as countries like Bolivia rethink their financial plumbing. In markets where traditional tools fail, crypto infrastructure fills the gaps. That’s why these three assets sit at the center of the reshaping underway. 1. Bitcoin Hyper ($HYPER) — First SVM-Powered Bitcoin Layer 2 If Bolivia’s banks begin holding BTC, the next logical step is faster, programmable rails that still inherit Bitcoin’s security. Bitcoin Hyper positions itself precisely as the first Bitcoin Layer 2, running the Solana Virtual Machine (SVM) . The goal is simple: Solana-level execution speed with Bitcoin-level trust. The design is modular. Bitcoin handles settlement, while a real-time SVM execution layer processes smart contracts and high-throughput workloads. A single sequencer currently manages ordering, with periodic state commitments anchoring everything back to Bitcoin. A Decentralized Canonical Bridge moves BTC between layers as wrapped assets. That setup enables high-speed payments, near-instant confirmations, and low fees, all powered by wrapped BTC. Developers can port SPL-style tokens , use Rust SDKs , and deploy Solana-style dApps without leaving Bitcoin’s trust model. On the capital side, the $HYPER presale has already raised over $28.6M, with tokens at $0.013345. That momentum has already fed into broader market modelling, with analysts mapping out where the ecosystem could trade once the network goes live. For a deeper breakdown of potential upside ranges, you can check our Bitcoin Hyper price prediction guide . Two high-net-worth wallets accumulated $396K recently, including a $53K buy . Staking opens right after TGE with high APY and a short seven-day presale vesting model. If you expect banks and emerging markets to route payments through Bitcoin over time, a Bitcoin-native SVM execution layer becomes a clear infrastructure play. You can learn more about Bitcoin Hyper or join the $HYPER presale directly . 2. SUBBD ($SUBBD) — AI + Web3 Stack for Creators Under Pressure Bolivia’s pivot is about financial survival, but creators are facing their own pressure as platform cuts rise and ad cycles tighten. SUBBD ($SUBBD) responds by merging AI and Web3 to give creators more control over distribution and monetization. The platform bundles AI Personal Assistants, AI Voice Cloning, and AI Influencer Creation into one toolkit. Creators can automate interactions and gate premium posts or communities behind token-based access that settles in crypto. This shift matters because programmable monetization lets a YouTuber in La Paz or a musician in Buenos Aires earn in crypto and keep ownership of their catalog. In regions dealing with FX friction and banking limits, that flexibility becomes real economic optionality. On the numbers, the SUBBD presale has raised over $1.3M, with tokens at $0.05705 and 20% first-year staking. That mix of AI tooling and on-chain monetization positions SUBBD as a targeted bet on the $85B creator economy moving into Web3. Explore the SUBBD presale today . 3. Solana ($SOL) — High-Throughput L1 Now Backed By a US Spot ETF You also want exposure to infrastructure that institutions can actually use. Solana ($SOL) has evolved from a ‘fast L1 experiment’ into a high-performance settlement layer with thousands of TPS and sub-cent fees. That performance profile matters as banks and corporates explore routing stablecoin payments or tokenized treasuries across public chains. Solana’s throughput and low fees give it real advantages for scalable payments, order books, and consumer apps. Its ecosystem has matured into one of the strongest in crypto. NFTs, DeFi, and consumer-grade applications now operate at scale without the bottlenecks seen on older networks. The shift became unmistakable when Bitwise launched the first US spot Solana ETF on October 28, 2025. It pulled in roughly $420M in the first week, signaling that institutions now treat SOL as investable infrastructure. For investors watching countries like Bolivia normalize digital assets, Solana offers liquid, battle-tested exposure to high-performance public chains. It also complements higher-beta presale plays by anchoring a broader conviction in scalable blockchain rails. Recap : As Bolivia’s reserves decline and banks adopt digital assets, structural demand shifts toward the real utility of these assets. Bitcoin Hyper , SUBBD , and Solana all align with this trend. Bitcoin Hyper targets BTC-native execution, SUBBD rewires creator monetization, and Solana anchors institutional-grade throughput, together forming a diversified way to front-run the next phase of adoption. This article is for informational purposes only and does not constitute financial, investment, or trading advice; always do your own research. Authored by Aaron Walker, NewsBTC – https://www.newsbtc.com/news/best-crypto-to-buy-bolivia-banks-digital-assets",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55043793,
    "published": 1764330776000,
    "title": "Best Meme Coins To Buy Before the Shibarium 2026 Privacy Upgrade",
    "body": "What to Know: Shibarium’s planned 2026 FHE upgrade makes privacy-native, utility-rich meme coins the key narrative for the next phase of meme speculation. The best meme coins aren’t just funny tickers; they’re the ones that channel this new flow: trading, payments, and gaming volume that prefers anonymity and speed. Maxi Doge ($MAXI) fuses 1,000x meme culture with staking, competitions, and a growing presale war chest tailored to degen retail traders. PEPENODE’s ($PEPENODE) mine‑to‑earn model gamifies yield through virtual nodes and tiered rewards, aligning naturally with privacy-first, game-heavy meme ecosystems. Shibarium’s roadmap for a 2026 privacy upgrade using Fully Homomorphic Encryption (FHE) is quietly one of the biggest structural shifts in meme coin history. Moving from simple dog-themed speculation to encrypted L2 rails with confidential smart contracts fundamentally changes what can be built on top of Shiba Inu. ‘Lucie,’ a Shiba Inu executive, shared that the end goal of on-chain privacy and confidential smart contracts could arrive before the end of Q2 2026. FHE-secured transactions and privacy-preserving EVM execution open the door for serious DeFi, on-chain gaming, and high-frequency trading strategies that don’t leak alpha on-chain. Meme coins can plug directly into a privacy-focused infrastructure layer designed for scalable, permissionless experimentation. In that world, the best meme coins with the best upside aren’t just funny tickers; they’re the ones that channel this new flow: trading, payments, and gaming volume that prefers anonymity and speed. You’re not just betting on dog pictures; you’re front‑running an architecture shift toward privacy-backed, utility-rich meme ecosystems. Three meme coins are positioned to ride that transition: one built for leverage-obsessed traders, Maxi Doge ($MAXI) , one redefining mining culture, PEPENODE ($PEPENODE) , and one OG dog coin leveling up its own tech stack as privacy and interoperability go mainstream, Dogecoin ($DOGE) . 1. Maxi Doge ($MAXI): Never Skip Leg-Day, Never Skip a Pump Maxi Doge ($MAXI) is built for the kind of trader who treats every bull market like leg day: brutal, focused, and unapologetically heavy. Branded as a canine juggernaut, $MAXI wraps the 1,000x leverage mentality into a meme token that lives and dies by a high-conviction, high-volatility trading culture on Ethereum. It’s the meme coin that never skips a leg-day or a pump, something degens can truly identify with. If that’s got you sold already, we’ve got your way in with our ‘ How to Buy Maxi Doge ’ guide. Under the hood, $MAXI runs as an ERC‑20 with a smart contract–governed supply and a 5% allocation dedicated to staking. Stakers earn dynamic APY currently sitting at 73%, turning idle meme exposure into a yield-generating position while you grind the charts elsewhere. It’s ‘lift, trade, repeat’ encoded directly into token economics. The $MAXI presale has raised $4.2M, with tokens currently priced at $0.0002705, giving you a defined on-ramp before any Shibarium-powered privacy narrative fully ignites. If Shibarium’s FHE upgrade accelerates demand for high-reward trading communities, a leverage-obsessed meme hub like Maxi Doge sits right in that slipstream. Join the $MAXI presale today. 2. PEPENODE ($PEPENODE): World’s First Mine-to-Earn Memecoin PEPENODE ($PEPENODE) leans into the other side of degen culture: building a pseudo-mining empire. Branded as the world’s first mine‑to‑earn memecoin, it replaces GPU rigs with a virtual mining system and a gamified dashboard that feels closer to a clicker game than a staking page. Instead of simply buying and holding, you use your $PEPENODE to buy and upgrade virtual nodes that earn tiered rewards, simulating the economics of mining without the hardware or power bill. Higher-tier nodes earn more, creating a clear progression loop that keeps you checking in, upgrading, and chasing the next yield threshold rather than passively sitting on a bag. The PEPENODE presale has already raised over $2.2M, signaling strong demand for this gamified mining narrative. Our experts also note a potential 2026 EOY price prediction of $0.0077 , giving you a possible ROI of over 558% if you bought at today’s price. As memecoins get pulled toward DeFi and on-chain gaming, a mine‑to‑earn model with tiered node rewards positions PEPENODE as a natural fit for users who want interactive yield rather than passive speculation. It’s a clear bet on meme culture evolving into persistent, game-like economies. Get your $PEPENODE for $0.0011685 and don’t miss the 584% staking rewards. 3. Dogecoin ($DOGE): OG Payments Meme Readying a Tech Overhaul Dogecoin ($DOGE) remains the original meme asset that accidentally became real money. Launched as a joke, it evolved into a peer‑to‑peer cryptocurrency for fast, low‑fee transactions, widely used for tipping creators and simple payments. That grassroots utility is now getting a serious technical upgrade. Developers are preparing the DogeOS upgrade, which is set to bolt on ZK-proof–based privacy and Ethereum-compatible smart contract support. That combination could finally push $DOGE beyond simple transfers into DeFi, Web3 gaming, and dApp ecosystems. For a meme asset that already ranks among the top ten cryptocurrencies by market cap and has been cited as the eighth-largest with rising institutional interest , that’s a non-trivial pivot. It means Dogecoin can realistically coexist with privacy-forward L2 environments like Shibarium, serving as both a payments rail and a composable building block. If Shibarium’s FHE roadmap pulls liquidity and users toward private, EVM-compatible meme ecosystems, a technically upgraded DOGE can act as a bridge between legacy meme liquidity and the next wave of privacy-native applications. It’s still the OG dog, but with a much sharper toolset on the way. Buy $DOGE on top exchanges like Binance. Recap: As Shibarium’s 2026 FHE upgrade drags meme coins into a privacy-first, EVM-powered future, Maxi Doge , PEPENODE , and Dogecoin each target a different vector that could help you stay ahead of the pack. Remember, this isn’t intended as financial advice, and you should always do your own research before investing. Authored by Aaron Walker, NewsBTC — https://www.newsbtc.com/news/best-meme-coins-shibarium-2026-privacy-upgrade",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 44,
        "NAME": "SHIB",
        "CATEGORY": "SHIB"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55047012,
    "published": 1764335602000,
    "title": "Avail’s Nexus wants to be Web3’s execution spine, not just another bridge",
    "body": "Nexus wants to be more than just another bridge, turning crosschain chaos into one unified balance so users can move assets seamlessly between blockchains.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55047354,
    "published": 1764336235000,
    "title": "35% Bitcoin Correction And Hash Ribbon Bottom Signal Put SUBBD Token On Trader Radar",
    "body": "What to Know: Hash Ribbon recovery after a 35% Bitcoin correction, coupled with depressed hashprice, aligns with historic late‑stage capitulation and potential cyclical bottoms. Miner stress and hashrate pullbacks often precede cleaner supply dynamics, setting the stage for capital rotations into higher‑beta narratives like AI and creator tokens. AI‑powered creator platforms are targeting opaque fees, arbitrary bans, and fragmented tooling as Web2 subscription and fan platforms continue to extract oversized revenue shares. SUBBD combines Web3 payments with AI assistants, voice cloning, and token‑gated content to help creators keep more earnings and automate fan engagement. When Bitcoin bleeds this hard, the market’s real opportunities finally show up. A 35% Bitcoin drawdown , from $124K to around $81K, has cleared out a large amount of late-cycle leverage. Yet the rebound toward $90K, with network hashrate still ~15% below its all-time high, sits right in the zone that has historically produced cyclical bottoms. These periods tend to reset excesses without breaking long-term structure. The Hash Ribbon indicator , which measures miner stress across short- and long-term hashrate trends, is now flashing a recovery signal linked to the end of miner capitulation phases. Hashprice remains at five-year lows , pushing miners to shut down older rigs, sell reserves, or merge operations. This is textbook late-stage bottoming behavior. Anyone who’s lived through multiple Bitcoin cycles recognizes this environment: sentiment wobbles, macro headlines turn gloomy, yet the chain itself gets stronger as weak hands exit. It’s also the window when early rotation into emerging narratives, AI, RWAs, and the creator economy historically outperforms. Once Bitcoin stabilizes, these plays often lead the next leg. That’s where SUBBD comes into focus. While Bitcoin rebuilds its base, $SUBBD is aiming to fix a core problem in the $85B creator economy: platforms taking up to 70% of revenue, opaque moderation rules, and fragmented AI tooling. For traders seeking asymmetric upside before risk-on fully returns, SUBBD’s AI-powered, Web3-native creator stack is gaining attention, with independent analysts already circulating early SUBBD price projections. Why Bitcoin Capitulation Is Fueling Rotations Into New Narratives Miner capitulation historically lines up with peak fear, but also with some of Bitcoin’s strongest forward returns. As inefficient rigs shut down and miners sell reserves to survive, that final burst of sell pressure often clears the last major correction of the cycle. Once that reset hits, capital naturally starts hunting for higher-beta plays. This cycle, AI and the creator economy are two of the standout narratives pulling early rotation. AI-assisted creator platforms, decentralized media rails, and token-gated fan ecosystems are all pushing to capture a chunk of a market where platforms like OnlyFans or subscription sites can take 20–70% of creator income. It’s a gap big enough for new Web3 rails to matter. Across Solana, Polygon, and Ethereum, teams are experimenting with NFTs, micro-tipping, decentralized storage, and AI-as-a-service models for creators. SUBBD is among the Ethereum-based entrants, positioning itself as a full-stack AI and payments layer for creators rather than another one-off NFT experiment. How SUBBD Aims To Tokenize and Automate the Creator Economy Where many creator tokens simply bolt crypto onto Web2 business models, SUBBD is built around a clearer premise: merge Web3 settlement with integrated AI so creators keep more and automate more. Instead of 30–70% platform cuts, SUBBD targets transparent, smart-contract-driven revenue splits and crypto-native payouts. At the center of $SUBBD is an AI Personal Assistant that can handle chats, DMs, support, and personalized responses trained on creator-approved data. Additionally, SUBBD incorporates AI voice cloning, AI influencer tools, and object-recognition features, enabling creators to launch new formats without needing to juggle multiple SaaS tools. The token underpins access and incentives across the platform. Users can unlock token-gated content, enter VIP staking tiers, and vote on features. At the same time, creators monetize through subscriptions, PPV content, AI-exclusive drops, NFTs, and tipping via EVM-compatible smart contracts. The presale has already raised over $1.3M with $SUBBD priced at $0.05705, showing meaningful early traction. It’s a model built around both creator monetization and fan participation. To learn how you can get your hands on this upcoming token, check out our helpful How to Buy $SUBBD guide . Staking is currently at a fixed reward rate of 20% APY for year one before evolving into a ‘platform benefits’ system offering exclusive livestreams, in-house content, daily behind-the-scenes drops, and boosted XP multipliers. In a market reset following a significant Bitcoin correction, SUBBD positions itself as a bet on transparent, AI-enhanced creator rails over extractive Web2 platforms. This article is for informational purposes only and does not constitute financial, investment, or trading advice; always do your own research. Authored by Aaron Walker, NewsBTC – https://www.newsbtc.com/news/bitcoin-hash-ribbon-bottom-subbd-token-creator-economy",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55047461,
    "published": 1764336177000,
    "title": "Ethereum ICO whale cashes out $60M after 9,500x gain as top 1% keep buying ETH",
    "body": "Despite the market downturn and some OG investors selling, the largest Ether whales continue their steady accumulation, while Ether ETF buyer sentiment continues to improve.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 205,
        "NAME": "TOKEN SALE",
        "CATEGORY": "TOKEN SALE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55047163,
    "published": 1764335807000,
    "title": "An ‘Important’ China ‘Signal’ Just Quietly Started Flashing As The Bitcoin Price Suddenly Bounces Back",
    "body": "A report has revealed bitcoin has made a sudden return in China, defying a 2021 ban that tanked the bitcoin price...",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55048845,
    "published": 1764338438000,
    "title": "320 Ether On The Move: Bhutan Ramps Up Its Staking Game",
    "body": "According to reports, the government of Bhutan moved 320 Ethereum (ETH) into staking on November 27, 2025. The transaction was routed through Figment.io, an institutional staking provider. Related Reading: Bitcoin Faces More Downside After Recent Crash, Data Shows At the time of the move, the Ether was valued at about $970,000. The transfer is being watched in both crypto and policy circles because it links a sovereign treasury to active participation in a public blockchain. Details Of The Staking Move Onchain Lens say the 320 ETH created 10 new validators, matching the network rule that each validator requires 32 ETH. The payment and validator setup were recorded onchain and were visible to blockchain trackers shortly after the move. This is Bhutan’s largest ETH action since May 2025, when the nation moved 570 ETH to a Binance wallet, based on earlier disclosures. The Royal Government of Bhutan sent 320 $ETH, worth $920.8K, for staking into #ETH2.0 @Figment_io.https://t.co/q4dW3qJBT5 pic.twitter.com/qo0evHxthf — Onchain Lens (@OnchainLens) November 27, 2025 Beyond Treasury Management Observers note Bhutan is not only holding crypto as an asset. By staking ETH, the country is helping to secure the Ethereum network and earning rewards that come from validator participation. Reports have disclosed the move also ties into national plans to shift parts of its digital identity project from Polygon to Ethereum. That plan would make the chain more than a place to park funds; it could become part of public infrastructure. What It Means For Bhutan Bhutan is already known to hold a sizeable amount of Bitcoin. Public data and media reporting put the country’s Bitcoin reserves at about 6,154 BTC, making Bitcoin the primary reserve asset. Staking ETH, even at a smaller scale compared with those holdings, signals that Bhutan is experimenting with using crypto not just for investment but as a tool for state services and network involvement. The action was described by some analysts as an example of a small state testing new financial and technical models. On Liquidity And Rewards When ETH is staked it becomes illiquid for a period tied to network rules. That means the staked tokens cannot be used for immediate spending or trading. At the same time, validators earn rewards that may add modest income to a state treasury. The trade-offs are clear: more participation in protocol security, less short-term flexibility in asset use. Several commentators asked whether sovereign staking will affect how other small nations treat crypto reserves. Related Reading: Crypto Wins Big: Thailand Moves To A 0% Tax On Local Exchange Gains Broader Crypto Context On the world stage the amount is modest, but the move is symbolic. Sovereign actors rarely operate validators on major smart-contract chains. This step was noticed because it ties public services and reserve management to one blockchain. Regulators, market watchers, and blockchain developers have been monitoring the transaction and related policy moves to see whether similar steps might follow elsewhere. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|bitcoin|crypto|ETH|Ether|ethereum|Staking",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55048590,
    "published": 1764336177000,
    "title": "Ethereum ICO whale cashes out $60M after 9,500x gain as top 1% keep buying ETH",
    "body": "Despite the market downturn and some OG investors selling, the biggest Ether whales continue their steady accumulation, while Ether ETF buyer sentiment continues to improve.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 205,
        "NAME": "TOKEN SALE",
        "CATEGORY": "TOKEN SALE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55050629,
    "published": 1764340951000,
    "title": "Uzbekistan greenlights stablecoins for payments under new sandbox regime",
    "body": "Uzbekistan will reportedly roll out stablecoins as an official payment method from Jan. 1, 2026, under a new regulatory sandbox that also enables tokenized securities trading.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 55050628,
    "published": 1764340835000,
    "title": "Bitcoin price down 20%, stablecoin market cap down $2B: November in charts",
    "body": "Bitcoin’s price was down this month nearly 20% as markets worry about lower interest rates and a possible financial bubble in the AI industry.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55051252,
    "published": 1764342038000,
    "title": "Analyst Teases $7.50 XRP Moonshot But Only After A Final Flush",
    "body": "Crypto analyst Charting Guy (@ChartingGuy) is mapping out a sharply asymmetric setup for XRP, arguing that the token is locked in a textbook Wyckoff reaccumulation and is “still NOT bearish in the slightest” despite a year of range-bound trading. Why XRP Is Still Not Bearish His work is based on XRP/USD Bitstamp charts posted on X on 27 November 2025. On the weekly view, XRP trades around $2.23 after an 8–9% gain on the week, consolidating below the 2025 peak at approximately $3.317, which he marks as the 1.0 Fibonacci level. The retracement is drawn from the cycle low near $0.11400 up to that high, producing a ladder of levels that structure the entire thesis. Key Fibonacci levels include 0.5 at about $0.61495, 0.618 at $0.91531, 0.702 just above $1.20 and, crucially, 0.786 at $1.61246. A broad highlighted band covers the prior 2021 high zone and this 0.786 cluster, roughly from the mid-$1s into the low-$2s. Charting Guy describes this as XRP “building support on prior cycle high as well as top of golden pocket,” referring to the 0.618–0.786 retracement area. Related Reading: XRP Reserves On Binance Collapse To Record Lows: Investors Move Toward Long-Term Holding Above the 2025 high, he plots classic Fibonacci extensions: 1.272 at about $8.29661, 1.414 around $13.38940 and 1.618 near $26.63038. His immediate scenario, however, stops short of those levels, projecting a move toward roughly $7.50. XRP Price Roadmap For 2026 The detailed roadmap appears on a two-day XRP/USD chart overlaid with a Wyckoff schematic. The structure begins with a Preliminarily Supply (PSY) phase and a Buying Climax (BC) into the low-$3 zone, followed by a Secondary Test (ST) and an Automatic Reaction (AR) that defines the lower boundary of the range. Horizontal lines mark that floor near $1.61184, an intermediate band around $1.95, resistance at approximately $2.90 and the upper ceiling just above $3.30. During mid-2025, XRP prints an “UT Phase B” upthrust into that $3+ resistance before rolling into a downward-sloping channel. The upper boundary of this channel, labeled “CREEK,” connects a series of lower highs, while the lower boundary guides price back toward the $1.61–1.70 support. In the scenario path, XRP spikes down to test the blue horizontal at $1.61184. This move is annotated as the “SPRING” — Wyckoff’s final shakeout below range support. Price then rebounds to retake the $1.95 area, marked “TEST,” and establishes a higher low between roughly $2.00 and $2.20 as the first “LPS” (Last Point of Support). Related Reading: Analyst Predicts XRP Price Will Hit $100 Before Bitcoin Hits $1 Million From there, the schematic shows a decisive break of the descending “CREEK” trendline, the “JATC” or “Jump Across The Creek,” as XRP accelerates from around $2.20–2.30 through the $2.90 resistance. That breakout is followed by a “SOS” (Sign of Strength) above the former ceiling, with another LPS holding around the $2.90 region and confirming the flip of resistance into support. The right edge of the 2D chart then projects a steep markup phase. XRP rallies from roughly $3.00 to just above $7.50 before stalling, even though it remains below the 1.272 weekly extension at $8.29661. Alongside the charts, Charting Guy pushes back against bearish momentum narratives centered on the monthly RSI. He notes that the RSI peak occurred in January 2025 and “lost momentum ALL 2025 while XRP stayed sideways in a range and held its own,” calling this “a very textbook reaccumulation signal where indicators lose steam to reset and price stays stable.” The technical message is unambiguous: as long as the $1.61–1.70 band holds, Charting Guy views XRP’s extended consolidation as preparation, not distribution—anticipating a final flush below $1.70, followed by a Wyckoff-style breakout sequence toward approximately $7.50. At press time, XRP traded at $2.23. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|xrp|xrp news|XRP Price|XRP Price Analysis|XRP Technical Analysis",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 106,
        "NAME": "AR",
        "CATEGORY": "AR"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55052349,
    "published": 1764343471000,
    "title": "Five XRP charts suggest a short-term price rally to $2.80 is next",
    "body": "Multiple technical, onchain and fundamental indicators suggested a potential XRP price rally toward $2.80 in the coming days.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55052026,
    "published": 1764343236000,
    "title": "Bitcoin in Modest Rally Mode After Thanksgiving as December Fed Rate Gets Locked In",
    "body": "Crypto-related stocks are higher across the board, led by the bitcoin miners.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Market Wrap|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55053404,
    "published": 1764345609000,
    "title": "Dogecoin Just Suffered An 80% Crash In This Major Metric",
    "body": "Dogecoin’s highly anticipated ETF debut has taken an unexpected slow turn. What began as a strong opening for the new GDOG fund quickly faded as inflows collapsed in dramatic fashion. The launch was expected to give Dogecoin a meaningful boost by opening the door for fresh institutional participation. Instead, the opposite has happened, and the Dogecoin ETF has seen its inflows collapse by 80%. Spot Dogecoin ETF Just Suffered An 80% Crash In Inflows The launch of Grayscale Investments’ first-ever spot Dogecoin ETF under the ticker GDOG was hailed as a monumental moment, the first time Dogecoin would be accessible to everyday investors through a traditional brokerage. On November 24, 2025, the product went live on the NYSE Arca, converting Grayscale’s existing DOGE trust into a publicly traded ETF. Related Reading: Pundit Shares XRP Fact That Will ‘Blow Your Mind’ However, just 48 hours after launch, the excitement appears to have cooled down. Although the first day reportedly pulled in roughly $1.8 million in inflows, the second day saw only about $365,420, a collapse of about 80% in early momentum. This has pushed the cumulative net inflows to around $2.16 million, but this is a modest figure for what many expected would be a major catalyst for Dogecoin. Expectations for GDOG were high. Observers pointed to prior early inflow successes with crypto ETFs, notably those for Bitcoin, Ethereum, and more recently Solana, which collectively helped push capital inflows at a large scale. To put this into comparison, Spot Solana ETFs, which first went live on October 18, raked in $117.39 million in inflows in the first two days of trading. The recently launched Spot XRP ETFs also saw inflows of $243.05 million on their first day of trading. According to data from SoSoValue, Dogecoin ETF trading volume for the first day was just $1.41 million, far below many projections. The momentum faded even faster on day two, with volume falling by roughly 78% to $397,620. What It Means for DOGE And The Meme-Coin Space The soft start of GDOG raises questions about whether meme coins like DOGE can truly thrive under traditional financial frameworks. On one hand, the ETF listing is a milestone: a token born as a joke is now trading alongside traditional assets on major exchanges. On the other, the weak capital flows hint at limits to demand among institutional investors. Related Reading: Bitcoin Dead Cat Bounce: Analyst Reveals What To Expect As Price Recovers However, it is still too early to conclude. The long-term relevance of DOGE ETFs can only be judged once the market has had time to digest these new products. A successful DOGE ETF could open the door to other meme-coin funds (some suggest even an ETF for Shiba Inu may follow). In addition to Grayscale, other asset managers have Spot Dogecoin ETFs lined up and ready to hit the market. Bitwise launched its Dogecoin ETF on Wednesday following Grayscale’s debut, but early inflow numbers are yet to come in. The asset manager noted they weren’t expecting to launch this product but are only doing so because the DOGE community requested it. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin ETF|Dogecoin ETF news|Dogecoin ETFs|Dogecoin ETFs news|Dogecoin news|dogecoin price|dogeusd|dogeusdt|GDOG",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 44,
        "NAME": "SHIB",
        "CATEGORY": "SHIB"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55053450,
    "published": 1764343471000,
    "title": "Five XRP charts suggest a short-term price rally to $2.80 is next",
    "body": "Multiple technical, onchain and fundamental indicators suggest a potential XRP price rally toward $2.80 in the coming days.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55055762,
    "published": 1764349251000,
    "title": "Why XRP Will Not Reach $100 By End Of Year Despite ETF Launch",
    "body": "Interest in XRP has increased massively after the launch of Spot XRP ETFs, leading some supporters to float a $100 per token rally before the end of the year. That scenario, however, appears highly unrealistic when basic market fundamentals are considered. In a recent post on X, Zach Humphries dismissed triple-digit predictions, calling them “delusional” and warning that they mislead people who don’t grasp the math behind market valuation. The Market Cap Reality Check Any attempt to peg XRP at $100 must first contend with its circulating supply and the resulting total valuation that such a price implies. According to Humphries, pushing XRP to $100 would demand a market capitalization of about $6 trillion for the cryptocurrency. That figure amounts to a more than 40-fold increase over current market cap levels, a leap so vast it would require inflows that dwarf anything seen in the crypto industry to date. Related Reading: The Bull And Bear Scenario For XRP That Could Play Out In November The entire crypto market itself has a total capitalization of about $3 trillion. Pushing a single altcoin like XRP to $6 trillion in value would mean the coin alone becomes more than twice as large as the entire crypto market combined. XRP reaching $100 is a 4,445% increase from its current price level. Keeping this in mind, it is really unrealistic for XRP to reach $100 even in the next year alone. Therefore, those making claims that the asset can touch $100 before 2025 ends, with only one month left on the calendar, disregard how capital moves, how long accumulation cycles take, and how much work is involved in building market caps of this size. The recent emergence of XRP ETFs does offer improved access for institutional and retail investors. However, the expansion needed for XRP to reach $100 is so large that no ETF launch or last-minute rally could generate the necessary inflows or supply shock within the next 35 days. Long-Term Potential Still Exists Although the $100 target within the next few weeks appears unattainable, that does not necessarily diminish the long-term appeal of XRP. Enthusiasts who see effects from adoption, regulatory developments, and institutional inflows may still believe in significant upside over a multi-year timeframe. Zach Humpries, for one, noted that he is still very bullish on Ripple/XRP long-term. Related Reading: Pundit Reveals Why XRP Price At $1,000 Is Not A Dream – ‘It’s Math’ The purpose of Humphries’ warning message was to restore perspective, not dampen long-term bullish sentiment. The important message is for XRP enthusiasts to shift their focus away from unrealistic valuations this year and instead consider targets that align with actual market cap growth. In a follow-up reply to comments on his post, he mentioned a far more grounded scenario of XRP reaching the $5 region by Christmas. However, this is also very bullish and is dependent on optimism returning to the wider crypto market. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|altcoin|Ripple|Spot XRP ETFs|xrp|xrp news|XRP Price|XRPUSD|xrpusdt|Zach Humpries",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55056295,
    "published": 1764350060000,
    "title": "UK Government to Start Cracking Down on Crypto Tax Avoidance in January",
    "body": "The U.K. released new guidelines that include rules for crypto exchanges to start providing the British tax authority with full customer information on all their digital assets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|HMRC|United Kingdom|Crypto Taxes|OECD|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55057913,
    "published": 1764352845000,
    "title": "Bitcoin To Hit $1.5M? Cathie Wood Says It’s Only A Matter Of Time",
    "body": "Cathie Wood, founder and CEO of ARK Invest, reiterated a bold forecast that Bitcoin could reach $1.5 million by 2030. Related Reading: Crypto Wins Big: Thailand Moves To A 0% Tax On Local Exchange Gains According to a recent webinar, she argued that the current downturn is a pause rather than the end of the cycle and said Bitcoin is only halfway through its four-year rhythm. Her stance comes as market swings have erased large sums and pushed out many investors. Liquidity Flows And Fed Timing Reports have disclosed that roughly $70 billion has already returned to financial markets since a brief US government funding gap ended, and ARK estimates as much as $300 billion could follow as the Treasury General Account is refilled. Wood tied that potential return of cash to moves in central bank policy, noting that the Federal Reserve is expected to end its quantitative tightening program on December 1. She said that easing liquidity could lift both Bitcoin and stocks tied to artificial intelligence. In this recent webinar, I discuss why the liquidity squeeze that has hit #AI and #crypto will reverse in the next few weeks, something the markets seemed to buy, and why AI is not in a bubble. The 123% increase noted below was in Palantir’s US commercial business last qtr. Watch… https://t.co/GdBZtEQcxM — Cathie Wood (@CathieDWood) November 26, 2025 Palantir’s US commercial revenue was highlighted during the talk, with a reported 123% increase last quarter used as an example of real business gains backing some market bets. Based on reports, Wood rejects the idea that gains in the AI sector are purely speculative, and she expects renewed money flows to help risk assets rebound. Stablecoins And Gold In Play According to ARK analysts, stablecoins have captured some of the transactional demand that once favored Bitcoin. At the same time, gold has shown solid returns this year, which the team says offsets part of the shift away from crypto for certain uses. That mix, they argue, changes how capital might move when liquidity returns. Broader Bullish Views From Market Names Several well-known investors continue to project high price targets for Bitcoin. According to public statements, Tom Lee of Fundstrat has said Bitcoin could hit $250,000 by 2025, pointing to supply limits and demand patterns. Venture capitalist Chamath Palihapitiya has floated targets in the range of $500,000 to $1,000,000, citing Bitcoin as a shelter in turbulent times. Related Reading: Bitcoin Faces More Downside After Recent Crash, Data Shows Raoul Pal, the former Wall Street executive and founder of Real Vision, has also advocated for similar six-figure ranges driven by adoption and institutional interest. These voices are included to show the range of long-term expectations among prominent market watchers. Cathie Wood thinks that Bitcoin could reach $1.5 million by 2030, while arguing the current dip is temporary and that the cycle has more to run. Returning liquidity and growing adoption could drive prices sharply higher, according to ARK Invest’s analysis. Featured image from Gemini, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|altcoin|ark invest|bitcoin|btc|btcusd|Cathie Wood|crypto",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55058931,
    "published": 1764354478000,
    "title": "BitMine and Bitcoin Miners' Stocks Surge as BTC, Ethereum Recover",
    "body": "Crypto-related equities like BitMine and leading Bitcoin mining stocks are jumping as Bitcoin and Ethereum regain key levels.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55058585,
    "published": 1764353451000,
    "title": "Wall Street Worrywarts Lose Again as Markets Defy CME, AI Stress",
    "body": "Wall Street just delivered a sharp lesson on the cost of caution — and not even a rare trading outage was able to break the market’s stride.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 55059992,
    "published": 1764356410000,
    "title": "Ethereum Fusaka Will Be ‘The Most Bullish Upgrade’ Ever, Pundit Claims",
    "body": "A pseudonymous analyst has set off a new narrative around Ethereum’s upcoming Fusaka upgrade, arguing it could be the most favorable event ever for ETH as an asset by finally turning Layer-2 networks into meaningful ETH burners. On X, crypto pundit Kira Sama framed Fusaka, scheduled for December 3, as a structural shift in Ethereum’s fee economics. The core of the thesis is a single change: EIP-7918. “Price wise, Ethereum Fusaka upgrade on december 3rd, will be the most bullish upgrade for eth the asset ever, why? One reason. ‘EIP 7918’,” Kira wrote, calling it “the next big catalyst for eth burn.” Ethereum L2 Will Burn ETH Kira’s argument rests on how Ethereum currently treats L2s. Since the rollup-centric roadmap took shape, Ethereum’s base layer has effectively subsidized L2 data availability. In his words, “for a long time, ETH L1 charged zero base fees to L2s, while L2 deployers made millions of profits. So L2s haven’t burnt any meaningful eth.” That subsidized regime has fueled explosive L2 growth but also limited how much L2 usage translates into ETH burn. Related Reading: Ethereum Is 58% ‘Undervalued’ Based On Intrinsic Metrics, Says Hashed CEO EIP-7918 is designed to change that by tying L2 data costs more tightly to mainnet gas prices. Kira summarizes it as follows: “L2 fees will be bounded by the execution cost which will help us reach L2 fees price discovery faster. It also helps maintain the fees during spikes so that L2 users won’t be rugged from absurd tx fees. Win-win.” In practice, that means rollups will face a non-trivial, protocol-enforced minimum on what they pay Ethereum for posting their batches. Crucially for ETH holders, those fees are paid in ETH and a portion is burned under the EIP-1559 mechanism. Kira argues that as L2 throughput scales, this will become a dominant driver of ETH’s burn dynamics: “They will just pay their fair share to Ethereum L1 and burn meaningful eth. It will be slow and steady at the beginning. This will eventually result in burning millions of dollars of eth long term and L2s will be main driving force of making eth deflationary.” Related Reading: Ethereum Price To Recover Or Crash? The Real ‘Leverage Point’ Investors Should Know About The narrative becomes more aggressive when Kira extrapolates to corporate and institutional rollups. He lists a series of existing and anticipated L2s and claims that “Coinbase’s base will burn eth, Robinhood’s L2 will burn eth, OpenAI’s Worlchain will burn eth, Sony’s Soneium will burn eth, Alibaba’s Jovay will burn eth, UAE’s ADI chain burn eth, Kraken’s Ink will burn eth, Lighter will burn eth, Deutsche Bank’s Memento chain will burn eth, Arbitrum will burn eth etc etc etc. Corporations will start burning eth.” From that, he extends the thesis to a broader, highly bullish vision: “Every company in the world will launch their own layer 2. Every alt-L1 will become L2 and start burning eth. Eth inflation will shrink.” While those universal claims go far beyond what the upgrade itself guarantees, they capture the heart of the bullish narrative: if enough economic activity migrates onto Ethereum-secured L2s that must pay non-negligible base fees, Ethereum becomes the settlement and value-capture layer beneath corporate and institutional chains. Kira explicitly compares Fusaka to the London hard fork that introduced EIP-1559 in 2021. “When Ethereum introduced burn through eip-1559 in 2021, it lifted the whole market up,” he wrote. “Everyone will be caught off guard this time as well. L2s burning eth incoming. Bullish eth. Bullish L2s.” For now, Kira is clear about his own conclusion: “December 3rd, tik-tok. The ticker is ETH.” At press time, ETH traded at $3,022. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ETH news|eth price|ethereum|Ethereum Fusaka Upgrade|ethereum news|ethereum price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 206,
        "NAME": "FORKS",
        "CATEGORY": "FORKS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55060086,
    "published": 1764356400000,
    "title": "Cathie Wood still bullish on $1.5M Bitcoin price target: Finance Redefined",
    "body": "Bitcoin recovered after four consecutive weeks in the red, surpassing the key $89,600 flow-weighted cost basis of Bitcoin ETF holders, the most significant cohort driving BTC inflows.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55062008,
    "published": 1764360034000,
    "title": "Can Dogecoin Price Still Reach $10 With The 3rd Wave Deadlock?",
    "body": "A long-term structural analysis suggests the Dogecoin price may be approaching a critical point in this market cycle. With price action compressing and volatility fading, a crypto analyst’s wave-based assessment suggests that DOGE is preparing for an explosive surge toward $10 and beyond, driven by a third-wave deadlock. Third Wave Deadlock To Fuel Dogecoin Price Rally Crypto market expert EtherNasyonal has stated that Dogecoin remains trapped within a third-wave deadlock. This means the cryptocurrency has not yet shown the decisive movement that typically follows a strong wave. Instead, it continues to trade in a tight range without confirming a clear breakout as the price remains confined to the lower region of the ascending channel. Related Reading: Dogecoin Falling Wedge Formation Says Expect 80-90% Rally In The Coming Days The analyst shared an Elliott Wave chart highlighting Dogecoin’s long-term trajectory and price targets above $10, based on a multi-year channel model. His analysis highlights three major waves that define the meme coin’s macro structure. The first wave, which started in 2014, saw an early breakout in 2017, while the second wave triggered the explosive 2021 bull rally. The price action that followed transitioned into the current third wave, during which Dogecoin remains locked in a consolidation zone as it awaits the wave’s completion. If historical patterns were to repeat, EtherNasyonal suggests that Dogecoin could see a third-wave breakout. His chart analysis reveals an ascending channel pointing to several upward targets. If the cryptocurrency manages a breakout, the channel points to an initial target around $0.5, followed by higher targets ranging from $1.2 to over $16. The analyst has also stated that the third-wave breakout will define the strength and direction of Dogecoin’s next major trend. Analyst Says Dogecoin Will Reach $1 By 2026 A fresh analysis from crypto market expert Trader Tardigrade focuses on a less ambitious price target for Dogecoin and on a different timeframe. His weekly chart shows that the meme coin has repeatedly bounced off a long-standing ascending support line. Each of these past rebounds has triggered significant rallies in the Dogecoin price. Related Reading: Dogecoin’s 6,500% Surge: The Road That Leads From $0.15 To $10 This Cycle In November 2024, the meme coin skyrocketed by 86.77%. Just four months later, in March 2025, Dogecoin launched another impressive rally, climbing 210.52%. The momentum continued in November of the same year, with the price surging by 442.48%. Trader Tardigrade notes that Dogecoin has returned to this launchpad area once again, testing the same trendlines that previously ignited strong upward movements. If the historical pattern holds, the analyst predicts DOGE could hit $1 by Q1 2026. His chart shows a potential 611.80% from present levels around $0.15. Although the meme coin is currently in a slump, having lost more than 20% over the past month according to CoinMarketCap, Trader Tardigrade remains confident in its long-term outlook. A move toward $1 would signal a decisive bullish reversal, restoring investor sentiment and overturning the prevailing downtrend. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|@EtherNasyonaL|CoinMarketCap|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt|Elliott wave theory|Trader Tardigrade",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55062162,
    "published": 1764310854000,
    "title": "UK takes ‘meaningful step forward’ with proposed DeFi tax overhaul",
    "body": "The UK has proposed a “no gain, no loss” approach to decentralized finance transactions, scrapping capital gains taxes on deposits to crypto lending platforms.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55063428,
    "published": 1764362779000,
    "title": "Brazil’s Economic Center São Paulo to Pilot Blockchain-Based Microloans for Farmers",
    "body": "The project utilizes a blockchain infrastructure developed with Tanssi's technology, enabling predictable transaction fees and reliability, rather than relying on public blockchains.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Brazil|Loan|Blockchain|Lending|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      }
    ]
  },
  {
    "id": 55063264,
    "published": 1764362468000,
    "title": "European Asset Manager Amundi Debuts Tokenized Share Class on Ethereum",
    "body": "The tokenized share class provides investors with blockchain-based access to Amundi’s euro cash fund, enabling faster, round-the-clock trading.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Tokenization|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55063040,
    "published": 1764361749000,
    "title": "Polymarket puts December rate-cut odds at 87% as crypto stocks climb",
    "body": "Cleanspark, Riot, Cipher and Circle rose higher as the odds of a US rate-cut in December reached its highest level of the month on the prediction market.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55063150,
    "published": 1764310854000,
    "title": "UK takes ‘meaningful step forward’ with proposed DeFi tax overhaul",
    "body": "The UK has proposed a “no gain, no loss” approach to decentralized finance transactions, scrapping capital gains taxes on deposits to crypto lending platforms.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55063478,
    "published": 1764310854000,
    "title": "UK takes ‘meaningful step forward’ with proposed DeFi tax overhaul",
    "body": "The UK has proposed a “no gain, no loss” approach to decentralized finance transactions, scrapping capital gains taxes on deposits to crypto lending platforms.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55063072,
    "published": 1764310854000,
    "title": "UK takes ‘meaningful step forward’ with proposed DeFi tax overhaul",
    "body": "The UK has proposed a “no gain, no loss” approach to decentralized finance transactions, scrapping capital gains taxes on deposits to crypto lending platforms.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55063878,
    "published": 1764363640000,
    "title": "Bitcoin Maxi Says ATH Back On The Table After 40x Derivatives Surge",
    "body": "Bitcoin may be closing in on a new all-time high after moves in the derivatives market and fresh buying from large holders, according to market watchers and on-chain data. Related Reading: Crypto Wins Big: Thailand Moves To A 0% Tax On Local Exchange Gains Max Keiser, a long-time Bitcoin advocate, pointed to a filing by Nasdaq to increase options limits for BlackRock’s IBIT to 1 million contracts — a jump that represents roughly a 40x expansion from prior levels — as a key development that could remove barriers to bigger institutional flows. Options Market Expands Significantly According to Nasdaq paperwork and public commentary, the previous 25,000 contract cap had been seen by some as too small for rising volume. Market experts argued that earlier limits were “discriminatorily small” and suggested that 400,000 contracts would be a more reasonable baseline given current demand. Some described the change as a move that could place IBIT into a mega-cap derivatives category, unlocking follow-on effects for how banks and funds structure exposure to bitcoin. I first explained this in 2017: Now that BTC derivatives market was just expanded by 40x New ATH’s are in play. **November 2, 2017** Max Keiser first discussed Bitcoin market makers needing to expand their inventory to support higher prices in this X post: “Wall St traders… https://t.co/aBQ5DdSDay — Max Keiser (@maxkeiser) November 27, 2025 Banks And Market Makers React Market makers will be able to hedge larger positions without hitting the old size wall, which can lower spreads and deepen available liquidity. Based on reports, that also means banks can build structured notes that use IBIT as a reference without tripping existing risk caps — and JPMorgan is reportedly preparing Bitcoin-backed structured notes that would track BlackRock IBIT. Those products could channel steady, institutional flows into the market rather than one-off spikes. On-Chain Buyers Step In According to Glassnode’s Accumulation Trend Score by cohort, holders of 10,000 BTC or more have flipped to net accumulation and now show a score of 0.8, signaling strong buying. The 1,000 to 10,000 BTC group has also turned positive for the first time since September, while the 100 to 1,000 BTC cohort has been in active accumulation since October and continued buying through recent declines. Even retail holders with less than 1 BTC are showing their strongest accumulation since July. Price Action And Value Zones Bitcoin’s price behavior supports the buying narrative. The token fell into the low $80,000 area that served as support in May and then climbed back above $90,000 quickly, which many traders took as a sign that the market sees value in the $80,000 zone. Based on reports, the average cost basis for US spot bitcoin ETFs was near $82,000, and that figure has been cited as a reason institutions found the dip attractive. Related Reading: Bitcoin Faces More Downside After Recent Crash, Data Shows Market Risks And Short-Term Noise Keiser had warned previously that when size limits blocked hedging, the market would be prone to pullbacks — and some analysts say that is part of the reason for recent volatility. Expanding the options cap allows volume sellers to enter more smoothly, which could reduce erratic swings but will not erase market risk. Price spikes are still possible and downside moves remain a real threat if flows slow or macro conditions shift. Featured image from Gemini, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|ath|bitcoin|btc|btcusd|crypto|IBIT|NASDAQ",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55063588,
    "published": 1764310854000,
    "title": "UK takes ‘meaningful step forward’ with proposed DeFi tax overhaul",
    "body": "The UK has proposed a “no gain, no loss” approach to decentralized finance transactions, scrapping capital gains taxes on deposits to crypto lending platforms.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55063696,
    "published": 1764310854000,
    "title": "UK takes ‘meaningful step forward’ with proposed DeFi tax overhaul",
    "body": "The UK has proposed a “no gain, no loss” approach to decentralized finance transactions, scrapping capital gains taxes on deposits to crypto lending platforms.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55063618,
    "published": 1764310854000,
    "title": "UK takes ‘meaningful step forward’ with proposed DeFi tax overhaul",
    "body": "The UK has proposed a “no gain, no loss” approach to decentralized finance transactions, scrapping capital gains taxes on deposits to crypto lending platforms.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55064066,
    "published": 1764363874000,
    "title": "OpenAI Confirms Data Breach—Here's Who Is Impacted",
    "body": "OpenAI said a Mixpanel breach exposed API user metadata—and urged customers to watch for phishing attacks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55063993,
    "published": 1764363826000,
    "title": "Bitcoin Price To Recover $100,000: BTIG Cites Key Reasons For Optimism",
    "body": "The Bitcoin price has recently stabilized above the $90,000 mark, sparking renewed optimism among bullish investors. Analysts at BTIG have suggested that this rebound could propel Bitcoin towards its ambitious target of $100,000. Bitcoin Price Positioned For ‘Reflex Rally’ Jonathan Krinsky, an analyst at BTIG, expressed confidence that the Bitcoin price is positioned for a continued “reflex rally,” potentially reaching $100,000 in the short-term. Historical data indicates that Bitcoin typically reaches a bottom around November 26, gaining momentum as the year comes to a close. This seasonal pattern further bolsters the prospects for the cryptocurrency in the coming weeks. Related Reading: Hyperliquid (HYPE) Ready For A Significant Surge To $50: Key Levels Identified Another focal point for BTIG is Strategy (previously MicroStrategy), which the analyst views as a candidate for a mean reversion trade. The firm maintains a buy rating on MicroStrategy with a price target set at $630. The analyst also highlighted that the week of Thanksgiving often aligns with momentum resets for digital assets, reinforcing expectations for a tactical upward movement into December. Reversion Ahead To $50,000 Adding to the optimistic outlook, market analyst Rekt Capital recently mentioned that if the Bitcoin price can reclaim its position above the $94,180 mark, it would flip the 2025 yearly candle into a green one, substantiating theories of a potential rally for the leading cryptocurrency in the waning days of the year. However, Bitcoin must navigate certain hurdles to sustain this momentum. Rekt noted that for Bitcoin to build on its current prospects and approach the Macro downtrend line, it would require a weekly close above approximately $93,500, turning that level into support, similar to patterns observed in previous green cycles. Related Reading: Bitcoin Price Future: The Polarized Predictions Between Bulls And Bears—Who Will Prevail? At the same time, Mike McGlone, an analyst at Bloomberg, has voiced concerns on social media regarding the Bitcoin price trajectory for the coming days. He suggested that a typical reversion to around $50,000 might be in the books now, emphasizing Bitcoin’s close correlation with the S&P 500. McGlone pointed out that the S&P 500’s 120-day volatility was at its lowest year-end level since 2017, indicating potential headwinds for Bitcoin. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|bitcoin|Bitcoin news|bitcoin price|Bitcoin Price Forecast|bitcoin price news|btc|BTC news|btc price|BTCUSDT|crypto|crypto market|crypto news|cryptocurrency",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55064417,
    "published": 1764321164000,
    "title": "South Korea targets sub-$680 crypto transfers in sweeping AML crackdown",
    "body": "South Korea’s AML overhaul introduces stricter reporting, bans offenders from owning VASPs and implements preemptive freezes to prevent illicit crypto flows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55064269,
    "published": 1764321164000,
    "title": "South Korea targets sub-$680 crypto transfers in sweeping AML crackdown",
    "body": "South Korea’s AML overhaul introduces stricter reporting, bans offenders from owning VASPs and implements preemptive freezes to prevent illicit crypto flows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55064267,
    "published": 1764310854000,
    "title": "UK takes ‘meaningful step forward’ with proposed DeFi tax overhaul",
    "body": "The UK has proposed a “no gain, no loss” approach to decentralized finance transactions, scrapping capital gains taxes on deposits to crypto lending platforms.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55064415,
    "published": 1764310854000,
    "title": "UK takes ‘meaningful step forward’ with proposed DeFi tax overhaul",
    "body": "The UK has proposed a “no gain, no loss” approach to decentralized finance transactions, scrapping capital gains taxes on deposits to crypto lending platforms.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55064831,
    "published": 1764321164000,
    "title": "South Korea targets sub-$680 crypto transfers in sweeping AML crackdown",
    "body": "South Korea’s AML overhaul introduces stricter reporting, bans offenders from owning VASPs and implements preemptive freezes to prevent illicit crypto flows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55064753,
    "published": 1764321164000,
    "title": "South Korea targets sub-$680 crypto transfers in sweeping AML crackdown",
    "body": "South Korea’s AML overhaul introduces stricter reporting, bans offenders from owning VASPs and implements preemptive freezes to prevent illicit crypto flows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55064751,
    "published": 1764310854000,
    "title": "UK takes ‘meaningful step forward’ with proposed DeFi tax overhaul",
    "body": "The UK has proposed a “no gain, no loss” approach to decentralized finance transactions, scrapping capital gains taxes on deposits to crypto lending platforms.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55064830,
    "published": 1764310854000,
    "title": "UK takes ‘meaningful step forward’ with proposed DeFi tax overhaul",
    "body": "The UK has proposed a “no gain, no loss” approach to decentralized finance transactions, scrapping capital gains taxes on deposits to crypto lending platforms.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55065445,
    "published": 1764325035000,
    "title": "IMF warns tokenized markets may deepen flash crashes, says governments will step in",
    "body": "Tokenization promises faster and cheaper markets, but the IMF warns that new risks and government intervention will accompany the shift to programmable finance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55065097,
    "published": 1764321164000,
    "title": "South Korea targets sub-$680 crypto transfers in sweeping AML crackdown",
    "body": "South Korea’s AML overhaul introduces stricter reporting, bans offenders from owning VASPs and implements preemptive freezes to prevent illicit crypto flows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55065443,
    "published": 1764321164000,
    "title": "South Korea targets sub-$680 crypto transfers in sweeping AML crackdown",
    "body": "South Korea’s AML overhaul introduces stricter reporting, bans offenders from owning VASPs and implements preemptive freezes to prevent illicit crypto flows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55064981,
    "published": 1764321164000,
    "title": "South Korea targets sub-$680 crypto transfers in sweeping AML crackdown",
    "body": "South Korea’s AML overhaul introduces stricter reporting, bans offenders from owning VASPs and implements preemptive freezes to prevent illicit crypto flows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55065894,
    "published": 1764367206000,
    "title": "Here’s Why Ethereum Emerges As The Global Capital Rails For On-Chain Finance",
    "body": "In the rapidly evolving landscape of digital finance, Ethereum is quickly establishing itself as the primary infrastructure for global on-chain capital markets. From tokenized bonds and money market funds to institutional liquidity rails, the world’s capital is beginning to migrate to an ecosystem where transactions are programmable, auditable, and borderless. Why Is Ethereum Chosen As The Default Choice For Global Rails The global capital markets are moving on-chain to Ethereum because it is credibly neutral. ETH has never experienced downtime, and it possesses the economic security necessary to support the world’s financial system. Investor and founder of GM42NFT, Captain GM, has stated that ETH is not fast enough to support trading because it wasn’t built for it. Related Reading: Ethereum Price Falls 25% But On-Chain Data and Institutional Staking Signal Q4 Recovery Potential However, the attempts to build a genuinely fast on-chain trading environment have consistently led teams to centralize significant parts of the trading system. This move creates security, reliability, and neutrality concerns for a system designed to be global. These compromises are in direct conflict with the very benefits that ETH provides, and make it the chosen blockchain for global finance. This is where Raya Network steps in to solve these issues at the core. Raya is delivering a decentralized exchange (DEX) with institutional-grade execution speed and Ethereum-level security. It’s a platform that is as fast as TradFi and remains simultaneously secure, reliable, and credibly neutral as exactly DeFi should be. “Fast is easy, decentralized is hard, and it’s only Reya that does both,” Captain GM noted. Analyst Alucard mentioned that the Raya network has become one of the few projects that genuinely solves the speed and security problem. The sub-millisecond execution speeds, trades are fully verified on ETH, and there’s no dependence on a single sequencer. This is an engineered combination designed for real progress in the space. However, over 45% of the token supply is allocated to the community. Reya, combined with the ETH buyback mechanism, creates an ecosystem that’s aligned both technically and economically. They’re building something fast and secure, and because of that, Reya sits in a different category. Why Reya’s Design Feels More Like A New Standard Than Another DEX A trader and ambassador of Somnia, Onur, has also explained that his experience with Reya feels like a full redesign of on-chain execution rather than a small improvement. It offers sub-millisecond fills, unified margin, Ethereum security with ZK settlement, and smooth flow through EigenDA. Related Reading: Ethereum Price Attempts Fresh Recovery as Bullish Pressure Builds According to Onur, the peer-to-pool model keeps trades consistent, efficient, and free from bottlenecks or hidden edges. As a result of this approach, Reya isn’t just another venue anymore, and it’s actively becoming the new execution standard for DeFi. Featured image from Peakpx, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|Alucard|Captain GM|decentralized exchange|DeFi|DEX|EigenDA|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|ethusd|ETHUSDT|Onur|Reya|Somnia",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55065933,
    "published": 1764326905000,
    "title": "KuCoin’s EU arm secures MiCA license in Austria, Malta excluded",
    "body": "Licensed by Austria’s Financial Market Authority, KuCoin EU can operate across 29 EEA countries, excluding Malta.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55065932,
    "published": 1764325035000,
    "title": "IMF warns tokenized markets may deepen flash crashes, says governments will step in",
    "body": "Tokenization promises faster and cheaper markets, but the IMF warns that new risks and government intervention will accompany the shift to programmable finance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55065931,
    "published": 1764321164000,
    "title": "South Korea targets sub-$680 crypto transfers in sweeping AML crackdown",
    "body": "South Korea’s AML overhaul introduces stricter reporting, bans offenders from owning VASPs and implements preemptive freezes to prevent illicit crypto flows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55066061,
    "published": 1764326905000,
    "title": "KuCoin’s EU arm secures MiCA license in Austria, Malta excluded",
    "body": "Licensed by Austria’s Financial Market Authority, KuCoin EU can operate across 29 EEA countries, excluding Malta.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55066184,
    "published": 1764326905000,
    "title": "KuCoin’s EU arm secures MiCA license in Austria, Malta excluded",
    "body": "Licensed by Austria’s Financial Market Authority, KuCoin EU can operate across 29 EEA countries, excluding Malta.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55066241,
    "published": 1764326905000,
    "title": "KuCoin’s EU arm secures MiCA license in Austria, Malta excluded",
    "body": "Licensed by Austria’s Financial Market Authority, KuCoin EU can operate across 29 EEA countries, excluding Malta.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55066239,
    "published": 1764325035000,
    "title": "IMF warns tokenized markets may deepen flash crashes, says governments will step in",
    "body": "Tokenization promises faster and cheaper markets, but the IMF warns that new risks and government intervention will accompany the shift to programmable finance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55066059,
    "published": 1764325035000,
    "title": "IMF warns tokenized markets may deepen flash crashes, says governments will step in",
    "body": "Tokenization promises faster and cheaper markets, but the IMF warns that new risks and government intervention will accompany the shift to programmable finance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55066181,
    "published": 1764325035000,
    "title": "IMF warns tokenized markets may deepen flash crashes, says governments will step in",
    "body": "Tokenization promises faster and cheaper markets, but the IMF warns that new risks and government intervention will accompany the shift to programmable finance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55066237,
    "published": 1764321164000,
    "title": "South Korea targets sub-$680 crypto transfers in sweeping AML crackdown",
    "body": "South Korea’s AML overhaul introduces stricter reporting, bans offenders from owning VASPs and implements preemptive freezes to prevent illicit crypto flows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55066179,
    "published": 1764321164000,
    "title": "South Korea targets sub-$680 crypto transfers in sweeping AML crackdown",
    "body": "South Korea’s AML overhaul introduces stricter reporting, bans offenders from owning VASPs and implements preemptive freezes to prevent illicit crypto flows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55066057,
    "published": 1764321164000,
    "title": "South Korea targets sub-$680 crypto transfers in sweeping AML crackdown",
    "body": "South Korea’s AML overhaul introduces stricter reporting, bans offenders from owning VASPs and implements preemptive freezes to prevent illicit crypto flows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55066935,
    "published": 1764326905000,
    "title": "KuCoin’s EU arm secures MiCA license in Austria, Malta excluded",
    "body": "Licensed by Austria’s Financial Market Authority, KuCoin EU can operate across 29 EEA countries, excluding Malta.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55066559,
    "published": 1764326905000,
    "title": "KuCoin’s EU arm secures MiCA license in Austria, Malta excluded",
    "body": "Licensed by Austria’s Financial Market Authority, KuCoin EU can operate across 29 EEA countries, excluding Malta.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55066558,
    "published": 1764325035000,
    "title": "IMF warns tokenized markets may deepen flash crashes, says governments will step in",
    "body": "Tokenization promises faster and cheaper markets, but the IMF warns that new risks and government intervention will accompany the shift to programmable finance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55066933,
    "published": 1764325035000,
    "title": "IMF warns tokenized markets may deepen flash crashes, says governments will step in",
    "body": "Tokenization promises faster and cheaper markets, but the IMF warns that new risks and government intervention will accompany the shift to programmable finance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55066931,
    "published": 1764321164000,
    "title": "South Korea targets sub-$680 crypto transfers in sweeping AML crackdown",
    "body": "South Korea’s AML overhaul introduces stricter reporting, bans offenders from owning VASPs and implements preemptive freezes to prevent illicit crypto flows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55067202,
    "published": 1764369511000,
    "title": "Tether Shuts Down Uruguay Mining Operations Over Energy Tariffs",
    "body": "The company had planned to invest up to $500 million in Uruguay, but cited high energy prices and regulatory hurdles as reasons for its pullout.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Tether|Mining|Uruguay|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55067363,
    "published": 1764326905000,
    "title": "KuCoin’s EU arm secures MiCA license in Austria, Malta excluded",
    "body": "Licensed by Austria’s Financial Market Authority, KuCoin EU can operate across 29 EEA countries, excluding Malta.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55067361,
    "published": 1764325035000,
    "title": "IMF warns tokenized markets may deepen flash crashes, says governments will step in",
    "body": "Tokenization promises faster and cheaper markets, but the IMF warns that new risks and government intervention will accompany the shift to programmable finance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55067811,
    "published": 1764326905000,
    "title": "KuCoin’s EU arm secures MiCA license in Austria, Malta excluded",
    "body": "Licensed by Austria’s Financial Market Authority, KuCoin EU can operate across 29 EEA countries, excluding Malta.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55067687,
    "published": 1764326905000,
    "title": "KuCoin’s EU arm secures MiCA license in Austria, Malta excluded",
    "body": "Licensed by Austria’s Financial Market Authority, KuCoin EU can operate across 29 EEA countries, excluding Malta.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55067686,
    "published": 1764325035000,
    "title": "IMF warns tokenized markets may deepen flash crashes, says governments will step in",
    "body": "Tokenization promises faster and cheaper markets, but the IMF warns that new risks and government intervention will accompany the shift to programmable finance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55067810,
    "published": 1764325035000,
    "title": "IMF warns tokenized markets may deepen flash crashes, says governments will step in",
    "body": "Tokenization promises faster and cheaper markets, but the IMF warns that new risks and government intervention will accompany the shift to programmable finance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55067685,
    "published": 1764321164000,
    "title": "South Korea targets sub-$680 crypto transfers in sweeping AML crackdown",
    "body": "South Korea’s AML overhaul introduces stricter reporting, bans offenders from owning VASPs and implements preemptive freezes to prevent illicit crypto flows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55068361,
    "published": 1764326905000,
    "title": "KuCoin’s EU arm secures MiCA license in Austria, Malta excluded",
    "body": "Licensed by Austria’s Financial Market Authority, KuCoin EU can operate across 29 EEA countries, excluding Malta.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55068360,
    "published": 1764325035000,
    "title": "IMF warns tokenized markets may deepen flash crashes, says governments will step in",
    "body": "Tokenization promises faster and cheaper markets, but the IMF warns that new risks and government intervention will accompany the shift to programmable finance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55068940,
    "published": 1764326905000,
    "title": "KuCoin’s EU arm secures MiCA license in Austria, Malta excluded",
    "body": "Licensed by Austria’s Financial Market Authority, KuCoin EU can operate across 29 EEA countries, excluding Malta.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55068809,
    "published": 1764326905000,
    "title": "KuCoin’s EU arm secures MiCA license in Austria, Malta excluded",
    "body": "Licensed by Austria’s Financial Market Authority, KuCoin EU can operate across 29 EEA countries, excluding Malta.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55068938,
    "published": 1764325035000,
    "title": "IMF warns tokenized markets may deepen flash crashes, says governments will step in",
    "body": "Tokenization promises faster and cheaper markets, but the IMF warns that new risks and government intervention will accompany the shift to programmable finance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55068808,
    "published": 1764325035000,
    "title": "IMF warns tokenized markets may deepen flash crashes, says governments will step in",
    "body": "Tokenization promises faster and cheaper markets, but the IMF warns that new risks and government intervention will accompany the shift to programmable finance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55069581,
    "published": 1764326905000,
    "title": "KuCoin’s EU arm secures MiCA license in Austria, Malta excluded",
    "body": "Licensed by Austria’s Financial Market Authority, KuCoin EU can operate across 29 EEA countries, excluding Malta.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55069580,
    "published": 1764325035000,
    "title": "IMF warns tokenized markets may deepen flash crashes, says governments will step in",
    "body": "Tokenization promises faster and cheaper markets, but the IMF warns that new risks and government intervention will accompany the shift to programmable finance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55070118,
    "published": 1764374431000,
    "title": "Newbie Bitcoin Whales Capitulating, But Old Hands Stay Silent",
    "body": "On-chain data shows New Whales on the Bitcoin network have been realizing losses recently, while Old Whales have remained at the sidelines. Bitcoin Has Faced Loss Selling From The Newbie Whales In a new post on X, CryptoQuant community analyst Maartunn has talked about the latest trend in the profit/loss realization behavior of the Bitcoin whales. “Whales” broadly refer to the BTC investors that hold at least 1,000 tokens in their balance. Related Reading: Bitcoin Puell Multiple Plunges, But Not Inside Bottom Zone Yet At the current exchange rate, the cutoff for the cohort is equivalent to $91.6 million, which is quite significant. As such, this group represents the big-money hands of the market, who can carry some degree of influence. Whales can be divided into two subgroups based on holding time. Investors of this size who purchased their coins within the past 155 days are known as the short-term holder (STH) or New Whales. Similarly, whales with a longer holding time are called the long-term holder (LTH) or Old Whales. Now, here is the chart shared by Maartunn that shows the trend in the net amount of profit/loss that these Bitcoin whale groups have been realizing through their selling over the last few months: As displayed in the above graph, the Bitcoin New Whales have shown some loss realization spikes recently. This underwater selling from the cohort has come as the cryptocurrency’s price has gone through a decline. The New Whales include the inexperienced hands of the market who tend to easily panic in the face of volatility. It would appear that this quality of the group has held through the latest crash as well. The Old Whales, on the other hand, are considered to represent the resolute side of the network. From the chart, it’s visible that there has been some loss selling from these large dormant entities recently, but its scale has been small compared to the New Whale capitulation. Related Reading: Bitcoin Could Be At Risk Of A Deeper Bear If This Ratio Compresses, Says Glassnode The fact that the presence of the Old Whales has been relatively muted through the bearish shift, as well as the rebound that has followed, could be a signal worth keeping an eye on. Speaking of the recovery, the Bitcoin rally has meant that its price has climbed back above a major on-chain cost basis level. As analyst Ali Martinez has shared in an X post, the Bitcoin UTXO Realized Price Distribution (URPD) suggests a strong amount of buying last occurred at $84,500. In on-chain analysis, strong demand zones below the spot price are considered points of potential support for Bitcoin. Similarly, levels above are assumed to be sources of resistance instead. One such major level is present at $112,300. BTC Price Bitcoin’s recovery has furthered during the past day as its price has returned to $92,300. Featured image from Dall-E, Glassnode.com, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin New Whales|Bitcoin Old Whales|Bitcoin whales|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55070461,
    "published": 1764374804000,
    "title": "Bitcoin hasn’t seen this much ‘asymmetric risk-reward’ since COVID: Analyst",
    "body": "Bitwise crypto researcher André Dragosch said, “We’re staring at a similar macro setup” for Bitcoin as during the COVID-19 pandemic.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55070652,
    "published": 1764327179000,
    "title": "Wemade rallies partners for KRW stablecoin push after years of setbacks",
    "body": "Wemade’s new GAKS alliance brings Chainalysis, CertiK and SentBe together to support a compliant KRW stablecoin mainnet after multiple setbacks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55070536,
    "published": 1764327179000,
    "title": "Wemade rallies partners for KRW stablecoin push after years of setbacks",
    "body": "Wemade’s new GAKS alliance brings Chainalysis, CertiK and SentBe together to support a compliant KRW stablecoin mainnet after multiple setbacks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55070523,
    "published": 1764327179000,
    "title": "Wemade rallies partners for KRW stablecoin push after years of setbacks",
    "body": "Wemade’s new GAKS alliance brings Chainalysis, CertiK and SentBe together to support a compliant KRW stablecoin mainnet after multiple setbacks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55070651,
    "published": 1764326905000,
    "title": "KuCoin’s EU arm secures MiCA license in Austria, Malta excluded",
    "body": "Licensed by Austria’s Financial Market Authority, KuCoin EU can operate across 29 EEA countries, excluding Malta.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55070522,
    "published": 1764326905000,
    "title": "KuCoin’s EU arm secures MiCA license in Austria, Malta excluded",
    "body": "Licensed by Austria’s Financial Market Authority, KuCoin EU can operate across 29 EEA countries, excluding Malta.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55070521,
    "published": 1764325035000,
    "title": "IMF warns tokenized markets may deepen flash crashes, says governments will step in",
    "body": "Tokenization promises faster and cheaper markets, but the IMF warns that new risks and government intervention will accompany the shift to programmable finance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 55071070,
    "published": 1764327179000,
    "title": "Wemade rallies partners for KRW stablecoin push after years of setbacks",
    "body": "Wemade’s new GAKS alliance brings Chainalysis, CertiK and SentBe together to support a compliant KRW stablecoin mainnet after multiple setbacks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55071068,
    "published": 1764326905000,
    "title": "KuCoin’s EU arm secures MiCA license in Austria, Malta excluded",
    "body": "Licensed by Austria’s Financial Market Authority, KuCoin EU can operate across 29 EEA countries, excluding Malta.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55071333,
    "published": 1764327179000,
    "title": "Wemade rallies partners for KRW stablecoin push after years of setbacks",
    "body": "Wemade’s new GAKS alliance brings Chainalysis, CertiK and SentBe together to support a compliant KRW stablecoin mainnet after multiple setbacks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55071807,
    "published": 1764327179000,
    "title": "Wemade rallies partners for KRW stablecoin push after years of setbacks",
    "body": "Wemade’s new GAKS alliance brings Chainalysis, CertiK and SentBe together to support a compliant KRW stablecoin mainnet after multiple setbacks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55071439,
    "published": 1764327179000,
    "title": "Wemade rallies partners for KRW stablecoin push after years of setbacks",
    "body": "Wemade’s new GAKS alliance brings Chainalysis, CertiK and SentBe together to support a compliant KRW stablecoin mainnet after multiple setbacks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55071806,
    "published": 1764326905000,
    "title": "KuCoin’s EU arm secures MiCA license in Austria, Malta excluded",
    "body": "Licensed by Austria’s Financial Market Authority, KuCoin EU can operate across 29 EEA countries, excluding Malta.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55071332,
    "published": 1764326905000,
    "title": "KuCoin’s EU arm secures MiCA license in Austria, Malta excluded",
    "body": "Licensed by Austria’s Financial Market Authority, KuCoin EU can operate across 29 EEA countries, excluding Malta.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55071437,
    "published": 1764326905000,
    "title": "KuCoin’s EU arm secures MiCA license in Austria, Malta excluded",
    "body": "Licensed by Austria’s Financial Market Authority, KuCoin EU can operate across 29 EEA countries, excluding Malta.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55072179,
    "published": 1764327179000,
    "title": "Wemade rallies partners for KRW stablecoin push after years of setbacks",
    "body": "Wemade’s new GAKS alliance brings Chainalysis, CertiK and SentBe together to support a compliant KRW stablecoin mainnet after multiple setbacks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55071890,
    "published": 1764327179000,
    "title": "Wemade rallies partners for KRW stablecoin push after years of setbacks",
    "body": "Wemade’s new GAKS alliance brings Chainalysis, CertiK and SentBe together to support a compliant KRW stablecoin mainnet after multiple setbacks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55072129,
    "published": 1764327179000,
    "title": "Wemade rallies partners for KRW stablecoin push after years of setbacks",
    "body": "Wemade’s new GAKS alliance brings Chainalysis, CertiK and SentBe together to support a compliant KRW stablecoin mainnet after multiple setbacks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55071889,
    "published": 1764326905000,
    "title": "KuCoin’s EU arm secures MiCA license in Austria, Malta excluded",
    "body": "Licensed by Austria’s Financial Market Authority, KuCoin EU can operate across 29 EEA countries, excluding Malta.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55072178,
    "published": 1764326905000,
    "title": "KuCoin’s EU arm secures MiCA license in Austria, Malta excluded",
    "body": "Licensed by Austria’s Financial Market Authority, KuCoin EU can operate across 29 EEA countries, excluding Malta.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55072794,
    "published": 1764327179000,
    "title": "Wemade rallies partners for KRW stablecoin push after years of setbacks",
    "body": "Wemade’s new GAKS alliance brings Chainalysis, CertiK and SentBe together to support a compliant KRW stablecoin mainnet after multiple setbacks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55073236,
    "published": 1764327179000,
    "title": "Wemade rallies partners for KRW stablecoin push after years of setbacks",
    "body": "Wemade’s new GAKS alliance brings Chainalysis, CertiK and SentBe together to support a compliant KRW stablecoin mainnet after multiple setbacks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55073530,
    "published": 1764327179000,
    "title": "Wemade rallies partners for KRW stablecoin push after years of setbacks",
    "body": "Wemade’s new GAKS alliance brings Chainalysis, CertiK and SentBe together to support a compliant KRW stablecoin mainnet after multiple setbacks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55073778,
    "published": 1764327179000,
    "title": "Wemade rallies partners for KRW stablecoin push after years of setbacks",
    "body": "Wemade’s new GAKS alliance brings Chainalysis, CertiK and SentBe together to support a compliant KRW stablecoin mainnet after multiple setbacks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55073958,
    "published": 1764329338000,
    "title": "Crypto industry pledges over $3M to victims of Hong Kong’s deadliest fire in decades",
    "body": "The crypto industry rushed to the aid of Hong Kong residents who suffered the city’s most devastating fire in 80 years, claiming the lives of at least 128 people.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55073957,
    "published": 1764327179000,
    "title": "Wemade rallies partners for KRW stablecoin push after years of setbacks",
    "body": "Wemade’s new GAKS alliance brings Chainalysis, CertiK and SentBe together to support a compliant KRW stablecoin mainnet after multiple setbacks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55075532,
    "published": 1764383587000,
    "title": "Ethereum tripling its gas limit is the ‘floor, we can go higher’ — Sassano",
    "body": "Ethereum educator Anthony Sassano said Ethereum’s gas limit could climb beyond three times next year, with some developers pushing for a fivefold increase.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55075906,
    "published": 1764329338000,
    "title": "Crypto industry pledges over $3M to victims of Hong Kong’s deadliest fire in decades",
    "body": "The crypto industry rushed to the aid of Hong Kong residents who suffered the city’s most devastating fire in 80 years, claiming the lives of at least 128 people.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55075905,
    "published": 1764327179000,
    "title": "Wemade rallies partners for KRW stablecoin push after years of setbacks",
    "body": "Wemade’s new GAKS alliance brings Chainalysis, CertiK and SentBe together to support a compliant KRW stablecoin mainnet after multiple setbacks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55076180,
    "published": 1764329338000,
    "title": "Crypto industry pledges over $3M to victims of Hong Kong’s deadliest fire in decades",
    "body": "The crypto industry rushed to the aid of Hong Kong residents who suffered the city’s most devastating fire in 80 years, claiming the lives of at least 128 people.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55076179,
    "published": 1764327179000,
    "title": "Wemade rallies partners for KRW stablecoin push after years of setbacks",
    "body": "Wemade’s new GAKS alliance brings Chainalysis, CertiK and SentBe together to support a compliant KRW stablecoin mainnet after multiple setbacks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55076761,
    "published": 1764329338000,
    "title": "Crypto industry pledges over $3M to victims of Hong Kong’s deadliest fire in decades",
    "body": "The crypto industry rushed to the aid of Hong Kong residents who suffered the city’s most devastating fire in 80 years, claiming the lives of at least 128 people.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55076820,
    "published": 1764329338000,
    "title": "Crypto industry pledges over $3M to victims of Hong Kong’s deadliest fire in decades",
    "body": "The crypto industry rushed to the aid of Hong Kong residents who suffered the city’s most devastating fire in 80 years, claiming the lives of at least 128 people.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55076760,
    "published": 1764327179000,
    "title": "Wemade rallies partners for KRW stablecoin push after years of setbacks",
    "body": "Wemade’s new GAKS alliance brings Chainalysis, CertiK and SentBe together to support a compliant KRW stablecoin mainnet after multiple setbacks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55078062,
    "published": 1764329338000,
    "title": "Crypto industry pledges over $3M to victims of Hong Kong’s deadliest fire in decades",
    "body": "The crypto industry rushed to the aid of Hong Kong residents who suffered the city’s most devastating fire in 80 years, claiming the lives of at least 128 people.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55077960,
    "published": 1764329338000,
    "title": "Crypto industry pledges over $3M to victims of Hong Kong’s deadliest fire in decades",
    "body": "The crypto industry rushed to the aid of Hong Kong residents who suffered the city’s most devastating fire in 80 years, claiming the lives of at least 128 people.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55077959,
    "published": 1764327179000,
    "title": "Wemade rallies partners for KRW stablecoin push after years of setbacks",
    "body": "Wemade’s new GAKS alliance brings Chainalysis, CertiK and SentBe together to support a compliant KRW stablecoin mainnet after multiple setbacks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55078061,
    "published": 1764327179000,
    "title": "Wemade rallies partners for KRW stablecoin push after years of setbacks",
    "body": "Wemade’s new GAKS alliance brings Chainalysis, CertiK and SentBe together to support a compliant KRW stablecoin mainnet after multiple setbacks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 55078701,
    "published": 1764329338000,
    "title": "Crypto industry pledges over $3M to victims of Hong Kong’s deadliest fire in decades",
    "body": "The crypto industry rushed to the aid of Hong Kong residents who suffered the city’s most devastating fire in 80 years, claiming the lives of at least 128 people.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55079155,
    "published": 1764329338000,
    "title": "Crypto industry pledges over $3M to victims of Hong Kong’s deadliest fire in decades",
    "body": "The crypto industry rushed to the aid of Hong Kong residents who suffered the city’s most devastating fire in 80 years, claiming the lives of at least 128 people.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55079478,
    "published": 1764329338000,
    "title": "Crypto industry pledges over $3M to victims of Hong Kong’s deadliest fire in decades",
    "body": "The crypto industry rushed to the aid of Hong Kong residents who suffered the city’s most devastating fire in 80 years, claiming the lives of at least 128 people.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55079637,
    "published": 1764329338000,
    "title": "Crypto industry pledges over $3M to victims of Hong Kong’s deadliest fire in decades",
    "body": "The crypto industry rushed to the aid of Hong Kong residents who suffered the city’s most devastating fire in 80 years, claiming the lives of at least 128 people.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55080221,
    "published": 1764329338000,
    "title": "Crypto industry pledges over $3M to victims of Hong Kong’s deadliest fire in decades",
    "body": "The crypto industry rushed to the aid of Hong Kong residents who suffered the city’s most devastating fire in 80 years, claiming the lives of at least 128 people.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]