[
  {
    "id": 57516088,
    "published": 1769549035000,
    "title": "Bitcoin climbs above $89,000 as U.S. dollar tumbles on President Trump's remarks",
    "body": "The president said he isn't concerned about the dollar's recent declines, sending the greenback plunging even lower.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Donald Trump|Market Wrap|Breaking News|top news|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57516441,
    "published": 1769549818000,
    "title": "Chinese National Gets 46 Months in Prison for $37 Million Crypto Scam Targeting Americans",
    "body": "A Chinese national was sentenced to nearly four years in prison for his role in a $37 million crypto scam that claimed American victims.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57516938,
    "published": 1769551226000,
    "title": "5 Months In Red: What Happens If Ethereum Price Closes January With A Loss?",
    "body": "The Ethereum price has struggled to regain momentum amid a persistent downtrend. After closing the last four months in the red, the world’s second-largest cryptocurrency is showing no signs of relief in January 2026. On-chain data shows that Ethereum’s current trajectory mirrors past cycle downturns, raising the possibility of further price declines and prolonged bearish sentiment. Ethereum Price Nears Fifth Consecutive Month Of Losses Ethereum has been in a prolonged slump, marking its fourth straight month of losses in 2025. As the market navigates the final week of January, the cryptocurrency is poised to potentially close a fifth consecutive month in the red, a streak that would reinforce the ongoing bearish trend. Related Reading: Analyst Says You’re Not Bullish Enough On Ethereum – What Does He Mean? On-chain data from CryptoRank shows that throughout 2025, Ethereum saw more red months than green ones. The cryptocurrency began the year with four consecutive months of decline from January to April, followed by a brief recovery in May, only to fall again in June. After this, ETH posted two months of gains, finishing July and August in the green. However, this recovery was short-lived, and since then, the cryptocurrency has been in a downtrend. During its most recent four-month decline, CryptoRanks reported that Ethereum closed September down by 5.59%. The downtrend accelerated at the end of November, with the cryptocurrency crashing by 22.2%, more than four times the decline of the previous monthly close. December 2025 saw another month in the red, though the drop was much smaller, at just 0.83%. Now, in January 2026, Ethereum is still in a downtrend. On-chain data indicates the cryptocurrency has already fallen 1.78% this month, and shows no sure signs of a bullish reversal. Moreover, at the time of writing, ETH is trading above $2,900, reflecting a roughly 5.95% decline over the past week. What A Red January Could Mean For ETH The last time Ethereum closed five consecutive months in the red was in 2018. That year, Ethereum significantly underperformed, recording gains in only 3 of 12 months. The cryptocurrency had posted continuous monthly losses, with November marking its steepest monthly decline at 42.5%. Related Reading: Ethereum Funding Rates Pushing Towards Negative: What’s Going On? After the four-month closing streak, Ethereum’s downtrend persisted for another two months before experiencing a sharp but brief recovery in December 2018. Despite this temporary rebound, the cryptocurrency closed January 2019 in the red, falling 20%. If history were to repeat itself in the current cycle, Ethereum could end January in a decline, similar to its 2018 performance. Interestingly, historical data shows that February has often been a bullish month for ETH. However, 2025 has seen declines from January through to April; it’s uncertain if Ethereum will follow past bullish patterns. For now, what is certain is that ETH’s price is down and would need a significant boost in its bullish momentum. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum|altcoin|CryptoRank|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57516874,
    "published": 1769550998000,
    "title": "Crypto Funds Funneled To Money Launderers Hit $82 Billion, According To Chainalysis",
    "body": "Blockchain analytics firm Chainalysis has released a new report highlighting a sharp escalation in crypto-based money laundering, warning that Chinese-language money laundering networks are emerging as one of the most serious and rapidly growing threats in the digital asset ecosystem. The Rise of Chinese‑Language Networks In Crypto Crime According to the report, illicit on‑chain money laundering activity has expanded dramatically over the past five years. In 2020, crypto-related laundering was estimated to be around $10 billion. By 2025, that figure had climbed to more than $82 billion. A key driver behind this growth has been the rapid rise of Chinese‑language money laundering networks, often referred to as CMLNs. In 2025, these networks accounted for roughly 20% of all identified illicit crypto laundering activity on‑chain. Related Reading: XRP Outlook For 2026: AI Model Signals New Record Ahead — Can Price Reach $6? Chainalysis noted that this regional concentration is further supported by off‑ramping behavior observed on the blockchain. As detailed in the report, CMLNs now routinely launder more than 10% of funds stolen through so‑called “pig butchering” scams. The pace at which these networks have grown stands out even within the broader crypto crime landscape. Since 2020, inflows to identified CMLNs have increased 7,325 times faster than those to centralized exchanges (CEXs). Growth has also outstripped other laundering channels, expanding 1,810 times faster than decentralized finance (DeFi) platforms and 2,190 times faster than illicit on‑chain flows that remain within criminal ecosystems. While CMLNs are not the only actors involved in crypto laundering, Chainalysis found that Chinese‑language, Telegram‑based services now represent a disproportionately large share of attributed global laundering activity. Cross‑Border Crime At Scale The report also shows that CMLNs function openly across multiple platforms and rely on complex, multi‑layered systems. Their operations are characterized by industrial‑level processing capacity and a high degree of technical sophistication. In 2025 alone, Chainalysis identified six distinct service types that together form the CMLN ecosystem. Combined, these services processed $16.1 billion in illicit inflows during the year. The number of active entities within these networks has also grown rapidly, expanding from a small number of wallets just a few years ago to more than 1,799 active on‑chain wallets in 2025. Related Reading: Tether Reveals Massive Gold Accumulation In Q4: Adds 27 Tons To Reserves Tom Keatinge, Director at the Centre for Finance & Security at the Royal United Services Institute, said the speed and scale of these networks are the result of converging global forces. He noted that Chinese money laundering networks have rapidly evolved into “multi‑billion‑dollar cross‑border operations” offering efficient and competitively priced services to organized crime groups across Europe and North America. Chris Urben, Managing Director at Nardello & Co, highlighted another major shift within these networks. He explained that Chinese money laundering groups have increasingly moved away from informal value transfer systems, such as traditional underground banking methods. Instead, Urben emphasized that these criminals have embraced cryptocurrencies as a “faster and more discreet way” to move funds across borders, eliminating the need for complex manual ledgers spread across multiple jurisdictions. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|chainalysis|criminal activity|crypto|Crypto Crime|crypto market|crypto news|cryptocurrency|illicit crypto",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 57517006,
    "published": 1769551149000,
    "title": "US Marshals confirm probe into $40M theft claims involving seized crypto",
    "body": "The US Marshals Service confirmed “the matter is under investigation” following claims that millions in government-seized crypto was stolen.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57517506,
    "published": 1769552863000,
    "title": "Circle faces first major 'threat' for institutional dollars from Tether’s USAT",
    "body": "While Circle's USDC has operated without a \"credible domestic competitor,\" Tether's USAT has the potential to shake up the landscape, analysts said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Tether|Anchorage Digital|Circle|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57518316,
    "published": 1769554859000,
    "title": "Analyst Says Chainlik Price Could Crash 50% If This Level Fails",
    "body": "Chainlink is approaching a technically sensitive area with a growing downside risk on higher timeframes that was flagged by a crypto analyst. Based on a recent technical analysis on X, the analyst noted that LINK’s current weekly structure leaves the market vulnerable if an important support zone around $10 gives way. The price action is still holding above that area for now, but the chart shows that a decisive move below it could quickly change the outlook into a bearish mood. Head And Shoulders Formation On Weekly Timeframe According to a popular crypto analyst known as CryptoBullet on X, LINK’s weekly chart has carved out a standard head and shoulders formation. Based on the rules of technical analysis, the Head and Shoulders (H&S) pattern is bearish. The pattern resolves bearish when there is a confirmed break below the neckline resistance. Related Reading: Bitcoin Price Prediction: Analyst Forecasts 72.86% Crash To $30,000 Technical analysis of Chainlink’s price action shows the left shoulder formed during the early stages of the 2024 recovery, followed by a higher peak that marked the head in early 2025. This was then followed by another lower high that completed the right shoulder in the second half of 2025. However, the most important zone to watch is the neckline support, which slopes slightly upward and is currently sitting in the $10 to $11 region. This support zone has acted as structural support during multiple pullbacks while the head and shoulders pattern was taking shape, making it the most important level to watch going forward. As long as the price holds above it, then the pattern is unconfirmed. ChainLink Price Chart. Source: @CryptoBullet1 on X Losing Support Level And Price Targets The analyst cautioned that a decisive weekly close below the neckline would activate the bearish setup. In technical analysis, a confirmed head and shoulders breakdown is known to open the path to a measured move equal to the height of the pattern. Applied here, that projection places LINK’s downside target in the $4 to $5 range, which would represent just about a 50% decline from current price levels. CryptoBullet described this outcome as the lowest area LINK could reach this year if there’s strong selling pressure, and that such a move would only come into play if support fails very quickly. Related Reading: Ripple’s Next Steps: Where XRP Stops Being Trade And Starts Being Infrastrucutre Notably, the analysis also pointed to an intermediate level that could act as a stopping point that might stop LINK from crashing to $4. A more conservative downside target is around $7.15, which is connected with the Point of Control on the Volume Range Visible Profile and overlaps with the 2022 to 2023 accumulation zone that’s shown on the chart above. At the time of writing, LINK is trading at $11.98, up by 1.1% in the past 24 hours but down by 5.4% in a seven-day timeframe. A rebound from the neckline area would shift the short-term outlook to a relief bounce. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Chainlink|chainlink|Chainlink news|Chainlink price|Link|LINK news|link price|LINKUSD|linkusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57519400,
    "published": 1769557613000,
    "title": "WhatsApp Lawsuit Draws Skepticism From Cryptographers, Privacy Lawyers",
    "body": "A proposed class action accusing Meta of accessing WhatsApp messages is drawing early skepticism from experts, claiming it lacks evidence.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57519890,
    "published": 1769558871000,
    "title": "Bitcoin Seen Entering a More Stable Phase, Coinbase and Glassnode Say",
    "body": "New analysis points to steadier market conditions for Bitcoin as liquidity support holds and investors shift toward hedging over leverage.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57521112,
    "published": 1769562050000,
    "title": "Bitcoin Hiring Surged In 2025 As 1,800 Positions Hit The Market",
    "body": "According to the Bitvocation 2025 Bitcoin Jobs Data report, a total of 1,801 Bitcoin-related job openings were posted last year. That number was about 6% higher than the 1,707 listings recorded in 2024. Related Reading: Bitcoin’s Sharp Reversal Leaves Over $800 Million Liquidated In 1 Day Many of the new roles were not for engineers. Non-technical positions — like product managers, marketing leads, and executive support — made up roughly 74% of the openings. This points to firms trying to build stronger day-to-day operations as they grow. Hiring Hot Spots And Fast Movers Reports say the US kept its lead with around 500 listings. But Singapore recorded the fastest jump, with job postings rising by close to 160% year over year, pushing it up the rankings. Some smaller markets also stood out: a few countries in Europe and Asia showed sizable gains, while Switzerland saw a sharp drop in opportunities. Companies appear to be spreading hiring across more places, not just the usual tech hubs. Companies And Roles That Stood Out More than 150 Bitcoin-first firms advertised roles in 2025. Miner companies and payment firms were among the busiest hirers, and a handful of names filled a lot of listings. Director-level spots increased dramatically, by a factor of about 10, as teams added senior hires to manage growth. Remote work dipped. The share of fully remote jobs fell from about 53% to 45%, which suggests more roles now need some physical presence or hybrid schedules. A Tough Match For Some Jobs Reports note that specialized technical roles remain hard to fill. Finding developers with deep Bitcoin protocol knowledge and experience with Lightning remains a challenge for recruiters. At the same time, companies say they want people who understand Bitcoin’s culture and can work within a team. That mix is rare. Salaries were not always listed, but some senior positions had clear compensation bands, signaling firms are willing to pay for experience. Related Reading: Crypto’s Q4 Weakness Mirrors Pre-Rebound 2023: Analysts What This Means For Job Seekers For candidates, the market now rewards broader skill sets. People who can write, manage products, or run operations with a basic grasp of Bitcoin found more openings. Recruiters preferred people who could move between tasks and handle multiple responsibilities, because many teams remained small even as hiring increased. Featured image from Pexels, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|bitcoin hiring|btc|btcusd|crypto|digital currency",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57522500,
    "published": 1769565603000,
    "title": "Bitcoin Derivatives Pressure Hits 30-Day Extreme, Price Refuses To Break",
    "body": "Bitcoin is struggling to regain traction below the $88,000 level as fear and uncertainty continue to dominate market sentiment. After a volatile selloff, the price has stabilized, but confidence remains fragile, with traders closely watching whether current support can hold or if another leg lower is still ahead. The lack of a decisive rebound reflects a market caught between defensive positioning and cautious accumulation, where conviction on both sides remains limited. Related Reading: Bitcoin Breaks Below $87K As Political Risk Spikes – Liquidations Reveal The Real Driver Analyst Axel Adler highlighted a critical divergence developing beneath the surface. According to his analysis, the Market Pressure Index dropped to 30.54, marking a new 30-day low and falling below the previous extremes recorded on January 21 and January 25. Despite this surge in derivatives-related pressure, Bitcoin’s price barely reacted, holding steady around $88.3K. That disconnect between pressure and price is unusual and signals a moment of heightened tension. Price structure reinforces how sensitive this zone has become. Bitcoin is currently trading in the lower 17% of the Donchian channel, positioning BTC just above the $86.4K support level. This area now represents a clear decision point for the market. If buyers continue absorbing supply, a base may begin to form. If support fails, the absence of downside reaction so far could quickly give way to renewed volatility. Extreme Derivatives Pressure Meets Price Stability According to CryptoQuant data, Bitcoin’s Derivatives Market Pressure Index has reached an unusually critical state. The indicator collapsed to 30.54, marking a new 30-day low and exceeding the previous downside extremes recorded on January 21 (36.95) and January 25 (35.63). The Market Pressure Index is a normalized composite that blends price action, cumulative 6-hour net taker flow, Open Interest, and volume delta, calibrated over a 365-day window to improve signal robustness and reduce noise. The most striking detail is the speed of the move. On January 27 at 07:00 UTC, the index dropped 12 points within a single hour, yet Bitcoin’s price barely reacted, moving only from $88.2K to $88.3K. This creates a rare and critical divergence: derivatives pressure reached an extreme, but price refused to break lower. Adler stresses that this behavior leaves the market at a binary crossroads. Either buyers are actively absorbing supply at current levels—suggesting early base formation—or the market is storing downside energy that could be released sharply if support fails. Together, the charts describe a tense equilibrium. Price Structure shows BTC sitting near support, in the lower 17% of the Donchian channel, with a Structure Shift of -0.57, confirming a broken bullish structure. Meanwhile, sellers are applying maximum monthly pressure and meeting resistance. This is either strong demand asserting itself or the final pause before capitulation. Related Reading: US Institutions Step Back From Ethereum: Coinbase Premium Flashes Caution Bitcoin Downtrend Pressure Persists Below Key Averages Bitcoin is trading around $87,800 on the daily chart, continuing to struggle after repeated failures to reclaim higher resistance zones. The broader structure shows a clear transition from the late-2025 uptrend into a corrective phase, with price posting lower highs and weaker rebounds since the sharp selloff in November. While BTC has managed to stabilize above the mid-$80K region, upside momentum remains limited and fragile. From a technical perspective, the moving averages define the current battlefield. Bitcoin is trading below the 50-day moving average (blue), which is now sloping downward and acting as immediate resistance near the low-$90K area. The 100-day moving average (green) sits higher and continues to trend lower, reinforcing a bearish medium-term bias and capping recovery attempts. Above both, the 200-day moving average (red) remains well overhead near the $105K–$108K range, highlighting how far the price has drifted from a fully bullish structure. Related Reading: Bitcoin Indicator Falls Back To Post-Bear Market Levels: Investors Approach A Key Decision Point Recent bounce attempts toward $92K–$96K were decisively rejected, confirming that sellers remain active on rallies. Volume has eased compared to the November capitulation, suggesting reduced urgency rather than strong demand. For bulls, holding the $86K–$88K zone is critical to prevent a deeper breakdown. A daily close back above $90K would be the first step toward stabilizing the trend. Failure to defend current levels keeps downside risk open toward the low-$80K range. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin breakdown|Bitcoin Derivatives Market|bitcoin futures|Bitcoin news|bitcoin price|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57523438,
    "published": 1769567796000,
    "title": "Bitcoin Price Marches Upward, But $90K Could Decide The Next Act",
    "body": "Bitcoin price started a recovery wave above $88,000. BTC is slowly moving higher and might rise further if it clears $89,600. Bitcoin started a minor recovery wave above the $88,000 level. The price is trading above $88,500 and the 100 hourly simple moving average. There is a rising channel forming with resistance at $89,600 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might recover further if it manages to settle above $89,600 and $90,000. Bitcoin Price Starts Recovery Bitcoin price remained stable above the $87,000 support . BTC formed a base and recently started a recovery wave above the $87,500 level. The price climbed above the $88,000 and $88,500 levels. There was a move above the 61.8% Fib retracement level of the downward move from the $91,098 swing high to the $86,007 low. The bulls even pushed the price above $89,000. Bitcoin is now trading above $88,500 and the 100 hourly simple moving average . If the price remains stable above $88,500, it could attempt a fresh increase. Immediate resistance is near the $89,600 level. Besides, there is a rising channel forming with resistance at $89,600 on the hourly chart of the BTC/USD pair. The first key resistance is near the $90,000 level since it is close to the 76.4% Fib retracement level of the downward move from the $91,098 swing high to the $86,007 low. A close above the $90,000 resistance might send the price further higher. In the stated case, the price could rise and test the $90,500 resistance. Any more gains might send the price toward the $91,200 level. The next barrier for the bulls could be $92,000 and $92,500. Another Rejection In BTC? If Bitcoin fails to rise above the $89,600 resistance zone, it could start another decline. Immediate support is near the $88,800 level. The first major support is near the $88,500 level. The next support is now near the $87,600 zone. Any more losses might send the price toward the $87,200 support in the near term. The main support sits at $86,000, below which BTC might struggle to recover in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $88,500, followed by $87,200. Major Resistance Levels – $89,600 and $90,000.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57523993,
    "published": 1769569211000,
    "title": "Bitcoin Social Interest Fades As Retail Chases Gold, Silver Hype",
    "body": "Data shows social media interest has shifted away from Bitcoin and the cryptocurrency sector recently as interest in Gold and Silver has spiked. Crypto Social Volume Has Cooled Recently In a new post on X, analytics firm Santiment has talked about how the Social Volume has compared between the cryptocurrency market, Gold, and Silver recently. Related Reading: Stablecoin Market Cap Drops By $7 Billion—What It Means For Bitcoin The “Social Volume” is an indicator that tells us about the amount of discussion that a given term or topic is receiving on the major social media platforms. It does so by counting up the total number of posts/messages/threads on the platforms that contain unique mentions of the term. Retail traders outweigh all other types of investors in population, so social media discourse tends to be a reflection of their behavior. As such, a spike in Social Volume for a particular market signals retail interest in the space. Historically, crypto traders have shifted their attention between various sections like memecoins, AI, blue chips, etc. based on where hype is the greatest. The pattern has changed recently, however, as Santiment has explained, “now, retail is proving to be open to jumping sectors entirely, with social data showing how gold, silver, and even equities are getting more and more interest based on wherever the latest pumps appear.” Below is the chart for the Social Volume shared by the analytics firm that shows this trend in action. As displayed in the graph, social media users have seen their attention shift multiple times across January. In the first week, the Social Volume was muted for all markets, corresponding to a post-holidays lull. During the second week, Gold witnessed its Social Volume shoot high as its price reached new all-time highs. Bitcoin rose alongside this surge, but crypto Social Volume still didn’t budge much. In the third week, however, social media interest in digital assets saw a return as Bitcoin and other tokens retraced. This activity likely corresponded to traders trying to speculate about the bottom. Now, in the final week of January, Silver has taken the lead in social media talk, with Gold right behind it and interest in crypto at a low. The shift in retail attention has come as Silver has set new records. “Remember that when crypto retail begins FOMO’ing in, that’s generally where tops appear,” noted Santiment. This pattern was witnessed during Silver’s latest run to a new all-time high above $117, which was followed by a drop to $103 within hours as retail hype spiked on social media. Related Reading: XRP, Ethereum Now ‘Undervalued’ On MVRV, Says Santiment With the crypto Social Volume still sitting at relatively low levels, it would appear that the small traders currently don’t feel strongly about Bitcoin and company. Bitcoin Price Bitcoin has seen a bearish second half of January as its price has retraced back to $88,000. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin Social Volume|btc|BTCUSDT|crypto|Crypto Social Volume|gold|silver",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57524370,
    "published": 1769570032000,
    "title": "Steak ‘n Shake adds $5M in Bitcoin to reserve as in-store sales grow 18%",
    "body": "The restaurant chain said that its adoption of Bitcoin is one of the main reasons that it is “trouncing” its fast-food competitors.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57524658,
    "published": 1769570762000,
    "title": "Trustless AI agent standard could hit Ethereum mainnet on Thursday",
    "body": "ERC-8004, which a lead developer has tipped will be deployed to mainnet this week, enables AI agents to discover and trust each other across platforms without centralized gatekeepers.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57524426,
    "published": 1769570309000,
    "title": "Ethereum Price Breaks Back To $3K As Traders Question Follow-Through",
    "body": "Ethereum price started a recovery wave from the $2,800 zone. ETH is now trading near $3,000 and might aim for more gains if it clears $3,050. Ethereum managed to stay above $2,850 and started a recovery wave. The price is trading above $2,950 and the 100-hourly Simple Moving Average. There is a bullish trend line forming with support at $2,970 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase if it stays above the $2,880 zone. Ethereum Price Starts Recovery Ethereum price managed to remain stable above $2,850 and started a recovery wave, like Bitcoin . ETH price was able to clear the $2,900 and $2,920 resistance levels. The price cleared the 61.8% Fib retracement level of the downward wave from the $3,065 swing high to the $2,784 swing low. The price even surpassed the $3,000 level. A high was formed at $3,030 and the price is now consolidating gains above the 23.6% Fib retracement level of the recent upward move from the $2,784 swing low to the $3,030 high. Ethereum price is now trading above $2,980 and the 100-hourly Simple Moving Average . Besides, there is a bullish trend line forming with support at $2,970 on the hourly chart of ETH/USD. If the bulls remain in action above $2,970, the price could attempt another increase. Immediate resistance is seen near the $3,030 level. The first key resistance is near the $3,050 level. The next major resistance is near the $3,065 level. A clear move above the $3,065 resistance might send the price toward the $3,120 resistance. An upside break above the $3,120 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $3,180 resistance zone or even $3,200 in the near term. Another Rejection In ETH? If Ethereum fails to clear the $3,050 resistance, it could start a fresh decline. Initial support on the downside is near the $2,970 level. The first major support sits near the $2,950 zone. A clear move below the $2,950 support might push the price toward the $2,880 support. Any more losses might send the price toward the $2,825 region. The main support could be $2,780. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI – The RSI for ETH/USD is now above the 50 zone. Major Support Level – $2,950 Major Resistance Level – $3,050",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57525336,
    "published": 1769572806000,
    "title": "XRP Derivatives Reset: Open Interest Drops Nearly 60% From July Peak",
    "body": "XRP is trading below the $2.00 mark as the market drifts into a phase defined by apathy and uncertainty, with participation thinning and conviction on both sides fading. After a powerful rally earlier in the cycle, price action has cooled significantly, and recent attempts to regain momentum have failed to attract sustained follow-through. The current environment reflects a market that is no longer driven by aggressive speculation but instead is weighed down by caution and a lack of clear directional catalysts. Related Reading: Bitcoin Breaks Below $87K As Political Risk Spikes – Liquidations Reveal The Real Driver Top analyst Darkfost explains that the shift began in the derivatives market. After XRP open interest on Binance surged to a new all-time high of $1.76 billion on July 17, positioning became increasingly crowded. As price stalled and volatility picked up, that leverage started to unwind. The result was a sharp contraction in open interest, which unfolded alongside a major price correction. XRP fell from $3.55 to $1.83, a drawdown of nearly 50%, highlighting how tightly price and leverage were linked during the distribution phase. Declining moving averages compress the price, signaling persistent downside pressure and weak momentum. Most recently, Binance XRP open interest dropped below $500 million, a level that has persisted since the exceptional liquidation event on October 10. This sustained compression signals a market that has largely flushed excess leverage, but has yet to see renewed speculative interest—leaving XRP stuck below $2 and searching for a new equilibrium. Deleveraging Resets Market Structure After Liquidity Flush Overall, XRP open interest has fallen by nearly 60%, signaling a significant destruction of liquidity in the derivatives market, particularly following the October 10 (10/10) liquidation event. This contraction reflects a broad unwinding of leveraged positions rather than a sudden collapse in spot demand. As positions were forced out or closed voluntarily, the derivatives layer thinned substantially, leaving the market far less crowded than during the mid-2025 peak. It is also important to recognize the mechanical effect of price on open interest. As XRP’s price dropped, the notional value of outstanding futures contracts fell alongside it, naturally amplifying the contraction in OI. In other words, part of the drop reflects lower prices reducing leverage in dollar terms, not just traders exiting positions. Still, the scale of the decline points to a genuine reset in speculative activity. Stepping back, these deleveraging phases play a critical role in restoring healthier market conditions. They flush out excess leverage, reduce forced-selling risk, and shift control away from overextended short-term traders. Historically, such phases become visible when XRP open interest on Binance falls below its semi-annual average, as is the case now. Past cycles show that once leverage is rebuilt gradually—and participation returns without excessive crowding—price action often stabilizes first and recovers later. While this does not guarantee an immediate rally, the current cleanup phase reduces downside fragility and lays the groundwork for a more sustainable move if demand re-emerges. Related Reading: US Institutions Step Back From Ethereum: Coinbase Premium Flashes Caution XRP Price Action Details XRP is trading just below the $2.00 psychological level, hovering around $1.89. This is a zone that has repeatedly acted as short-term support over recent months. Declining moving averages compress the price, signaling persistent downside pressure and weak momentum. The 50-period moving average (blue) continues to slope downward and now acts as dynamic resistance near the $2.30–$2.40 region. Above it, the 100-period moving average (green) reinforces this resistance cluster, confirming that medium-term trend control remains with sellers. More importantly, XRP is now leaning on the 200-period moving average (red), which has flattened and is acting as a critical structural support around the $1.85–$1.90 range. Historically, sustained trading near the 200 MA often marks transition zones between continuation and broader trend failure. A clean break below this level would expose risk toward prior demand zones near $1.60–$1.70. Related Reading: Bitcoin Stuck In Bear Mode For 83 Days: Trend Pulse Confirms Structural Weakness Volume remains muted, suggesting market apathy rather than panic selling. This aligns with the broader derivatives deleveraging we’ve already observed, suggesting that the market has largely flushed out speculative pressure. For any meaningful recovery, XRP must reclaim the 50 MA and hold above $2.00. Until then, price action points to consolidation under resistance. The direction hinges on whether long-term support continues to hold or finally gives way. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP News|xrp|XRP analysis|XRP derivatives|XRP futures|xrp news|XRP OI|XRP open interest|XRP Price|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57525537,
    "published": 1769573310000,
    "title": "XRP Price Stuck Under $2.00 As Markets Brace For Another Slide",
    "body": "XRP price failed to surpass $2.00 and started another decline. The price is now correcting gains and might struggle to stay above $1.860. XRP price started a downside correction and tested the $1.90 zone. The price is now trading near $1.890 and the 100-hourly Simple Moving Average. There is a declining channel or a possible bullish flag pattern forming with support at $1.860 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could start another increase if it clears $1.950. XRP Price Struggles Below $2.00 XRP price failed to clear $2.00 and started a downside correction, underperforming Bitcoin and Ethereum . The price dipped below the $1.920 and $1.90 levels to enter a negative zone. The price even dipped below the 50% Fib retracement level of the upward move from the $1.810 swing low to the $1.945 high. The bulls are now active near $1.880. There is also a declining channel or a possible bullish flag pattern forming with support at $1.860 on the hourly chart of the XRP/USD pair. The price is now trading near $1.890 and the 100-hourly Simple Moving Average. If there is a fresh upward move, the price might face resistance near the $1.920 level. The first major resistance is near the $1.950 level, above which the price could rise and test $2.00. A clear move above the $2.00 resistance might send the price toward the $2.050 resistance. Any more gains might send the price toward the $2.120 resistance. The next major hurdle for the bulls might be near $2.150. Another Decline? If XRP fails to clear the $1.950 resistance zone, it could start a fresh decline. Initial support on the downside is near the $1.880 level. The next major support is near the $1.860 level and the 61.8% Fib retracement level of the upward move from the $1.810 swing low to the $1.945 high. If there is a downside break and a close below the $1.860 level, the price might continue to decline toward $1.8320. The next major support sits near the $1.80 zone, below which the price could continue lower toward $1.7650. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $1.880 and $1.860. Major Resistance Levels – $1.950 and $2.00.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57526097,
    "published": 1769574821000,
    "title": "Bitwise Registers Uniswap ETF Trust in Early Step Toward Potential Filing",
    "body": "The filing comes after regulators closed their probe into Uniswap Labs, shifting attention from enforcement toward questions over liquidity.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 53,
        "NAME": "UNI",
        "CATEGORY": "UNI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57526671,
    "published": 1769576453000,
    "title": "Record Pain: Bitcoin Investors Suffer $4.5B Loss, Most In 3 Years",
    "body": "Reports note that Bitcoin holders realized large losses as prices slid, and the headline number is hard to ignore. According to on-chain tracker CryptoQuant, about $4.5 billion in net losses was recorded on January 23. Related Reading: Bitcoin Influencers Get Spotlight In X’s New ‘Starterpacks’ That number reflects moved coins sold at prices lower than when they were bought. It is a big transfer of paper pain into real losses. Realized Losses Spike While the dollar figure grabs attention, the meaning is what matters. Many who bought late in the run higher are choosing to sell rather than hold through more decline. That behavior shows frustration. Reports say the Net Realized Profit and Loss metric tallies this by comparing sell prices to purchase prices, and a negative reading this large signals a wave of capitulation. Some larger, long-term holders have been quieter. Their activity appears muted while smaller and mid-term participants make the day-to-day moves. According to analyst posts on CryptoQuant, this mix — quiet big holders and active smaller sellers — is common during corrective stretches. It does not automatically mean the market is broken; it means sentiment has shifted toward caution. $4.5 Billion in Realized Loss on Bitcoin “Highest amount of realized losses in three years. The last time this occurred in Bitcoin, the price was trading at $28,000 after a brief correction period that lasted about a year.” – By @gaah_im pic.twitter.com/OJ7bbL3RSC — CryptoQuant.com (@cryptoquant_com) January 26, 2026 Bitcoin Price Action Midway through the week, Bitcoin traded around the mid-$80,000s, well below the $90,000 mark that some investors had eyed as a key level. Market chatter shows traders watching macro cues like the US Federal Reserve and inflation data for guidance. Volatility has not disappeared; it has simply become more tied to broader economic signals than to isolated crypto headlines. Whale addresses appeared to step in at times, helping to hold local price floors. But many traders remain cautious. Reports note that geopolitical headlines can cause quick swings, yet the current movement looks more like slow digestion of profit and repositioning than explosive panic selling. Activity on spot exchanges and ETF flows has been variable, reflecting the mixed mood across the market. Related Reading: XRP Showing Strength, Analyst Points To $4 Potential Capitulation Has Come Before Similar loss spikes were seen in March 2023, when realized losses reached close to $6 billion, and in November 2022, when losses hit roughly $4.3 billion. These events were followed by consolidation and then eventual recovery. Based on reports from analytics firms and market observers, spikes in realized losses can mark the late stages of selling pressure, after which the market sometimes finds a base. Featured image from Pexel, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|canada|crypto|etf|tariffs|Trump",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57526663,
    "published": 1769576416000,
    "title": "Tether scores $5bn windfall as gold price rockets",
    "body": "Stablecoin company owns at least 116 tonnes of bullion, making it one of biggest winners from blistering rally",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57526529,
    "published": 1769575898000,
    "title": "Coinbase moves closer toward rolling out ‘custom stablecoins’",
    "body": "Coinbase has been working with Solflare, R2, and Flipcash to bring custom stablecoins to market, with the latest testing focused on Flipcash's USDF.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57526836,
    "published": 1769576906000,
    "title": "Solana (SOL) Recovery Reaches A Level That Changes Everything",
    "body": "Solana started a recovery wave above the $125 zone. SOL price is now consolidating and faces hurdles near the $128 zone. SOL price started a decent recovery wave above $122 and $125 against the US Dollar. The price is now trading above $125 and the 100-hourly simple moving average. There was a break above a key bearish trend line with resistance at $124 on the hourly chart of the SOL/USD pair (data source from Kraken). The price could continue to move up if it clears $128 and $130. Solana Price Faces Resistance Solana price remained stable and started a decent recovery wave from $118, like Bitcoin and Ethereum . SOL was able to climb above the $122 level. There was a move above the 61.8% Fib retracement level of the downward move from the $132 swing high to the $117 low. Besides, there was a break above a key bearish trend line with resistance at $124 on the hourly chart of the SOL/USD pair. The bulls even pushed the price above $125. However, the bears remained active near $128. Solana is now trading above $125 and the 100-hourly simple moving average. On the upside, immediate resistance is near the $128 level, and the 76.4% Fib retracement level of the downward move from the $132 swing high to the $117 low. The next major resistance is near the $130 level. The main resistance could be $135. A successful close above the $135 resistance zone could set the pace for another steady increase. The next key resistance is $142. Any more gains might send the price toward the $145 level. Another Decline In SOL? If SOL fails to rise above the $128 resistance, it could continue to move down. Initial support on the downside is near the $124.50 zone. The first major support is near the $122 level. A break below the $122 level might send the price toward the $117 support zone. If there is a close below the $117 support, the price could decline toward the $105 zone in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is losing pace in the bullish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is above the 50 level. Major Support Levels – $125 and $122. Major Resistance Levels – $128 and $130.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Technical analysis|Sol|Solana|solbtc|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57527365,
    "published": 1769578249000,
    "title": "Coinbase Shares Extend Losses as It Expands Into New Metal Futures",
    "body": "Experts say the metals expansion builds infrastructure, not a near-term volatility hedge, as Coinbase stock falls 46% from its peak.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57527282,
    "published": 1769578044000,
    "title": "Top stablecoins shrink as crypto cash flees, posing risk to bitcoin's bounce",
    "body": "USDC leads the decline in the market cap of top stablecoins, posing risk to crypto market valuations.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Stablecoin|Tether|USDC|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57527660,
    "published": 1769578889000,
    "title": "A Fed move to backstop Japan bonds could boost Bitcoin: Arthur Hayes",
    "body": "BitMEX founder Arthur Hayes says the yen is weakening while Japanese government bond yields are rising, which could lead to Japanese investors selling US Treasuries.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57527494,
    "published": 1769578528000,
    "title": "UK bans Coinbase ads that ‘trivialized’ crypto risks: Report",
    "body": "Coinbase’s musical ad depicting a run-down UK, which was already blacklisted from TV, has reportedly seen a wider ban by the country’s ad watchdog for being “irresponsible.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57528523,
    "published": 1769581092000,
    "title": "Crypto launderers are turning away from centralized exchanges: Chainalysis",
    "body": "Chainalysis says the on-chain money laundering ecosystem processed $82 billion in funds in 2025, with Chinese-language networks now dominating.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57529052,
    "published": 1769582660000,
    "title": "BTC, ETH, SOL move higher as markets eye Fed, Mag 7 earnings and weaker dollar",
    "body": "Crypto prices steadied as traders looked past short-term volatility with positioning shifting to the Fed, megacap earnings and a weakening dollar.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57530013,
    "published": 1769584759000,
    "title": "Ethereum’s ERC-8004 aims to put identity and trust behind AI agents",
    "body": "A new Ethereum standard seeks to give AI agents portable identities and reputations, letting them interact across companies and chains without relying on centralized gatekeepers.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57530633,
    "published": 1769587211000,
    "title": "Bitcoin Price Braces For FOMC Volatility As History Shows Major Post‑Fed Sell‑Offs",
    "body": "The Bitcoin price is under increasing pressure ahead of Wednesday’s Federal Open Market Committee (FOMC) meeting, which has historically corresponded with big price movements in the market’s largest cryptocurrency. Rate Cut Odds Fade The Federal Reserve (Fed) is widely expected to leave interest rates unchanged at this meeting. Economists surveyed by financial data provider FactSet anticipate the federal funds rate — the benchmark rate banks use for overnight lending — will remain in the 3.5% to 3.75% range. Such a pause would follow three consecutive rate cuts delivered by the Fed toward the end of last year, a shift that initially fueled optimism across risk assets, including the Bitcoin price. Related Reading: XRP Outlook For 2026: AI Model Signals New Record Ahead — Can Price Reach $6? Despite that earlier momentum, the Bitcoin price has struggled to maintain its footing. Ahead of the FOMC decision, the cryptocurrency is trading near $87,780, roughly 30% below the all‑time highs reached last year. Market analyst Ali Martinez has pointed to Bitcoin’s historical behavior around FOMC meetings as a reason for caution. In a recent post on X (previously Twitter) Martinez highlighted that expectations for a January rate cut are extremely low, estimated at just 2.8%, signaling that meaningful policy easing is unlikely in the near term. That backdrop, he argues, has often set the stage for increased volatility for the Bitcoin price rather than sustained upside. Looking back at 2025, Martinez noted that Bitcoin reacted negatively after the vast majority of the Fed’s policy meetings. Of the eight FOMC decisions held during the year, seven were followed by notable declines for the Bitcoin price. The January meeting was followed by a 27% drop, March saw a 14% decline, June was down 8%, July slipped 6%, September fell 7%, October recorded a 29% pullback, and December ended with a 9% loss. The analysts noted that the only exception seen in the year came in May, when the Bitcoin price briefly rallied about 15% after the decision. Bitcoin Price Approaches Key Decision Zone From a technical and on‑chain perspective, analyst BitBull also sees the Bitcoin price approaching a critical moment. BitBull noted on social media that the asset has entered what she describes as a key on‑chain decision zone. At current levels, the Bitcoin price is trading almost exactly at the Active Investor Mean, estimated near $87,500. This level represents the average cost basis for active buyers, placing much of that capital at breakeven. Related Reading: Tether Reveals Massive Gold Accumulation In Q4: Adds 27 Tons To Reserves BitBull explained that pressure is building on both sides of the price. Above current levels, the short‑term holder cost basis sits near $96,500, meaning many recent buyers are already underwater. As a result, any upward move toward that zone could face selling pressure as traders look to exit at reduced losses. On the downside, the True Market Mean at around $80,700 has historically marked the boundary between a “routine correction and deeper structural weakness.” Further below, the realized price near $56,000 suggests that long‑term holders remain firmly in profit and largely unshaken by recent volatility. BitBull argues if the Bitcoin price can maintain support above the $87,500 level, it would indicate that active capital is defending its position and that broader market strength remains intact. A sustained break below that level, however, could open the door for a move toward $80,700. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin chart|Bitcoin news|bitcoin price|bitcoin technical analysis|btc|BTC news|btc price|BTCUSDT|crypto|crypto market|crypto news|FOMC|FOMC Meeting",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57530740,
    "published": 1769587200000,
    "title": "OKX launches EU stablecoin payment card via regulated issuer Monavate",
    "body": "OKX says the card supports USDC and USDG spending, is issued via Monavate on Mastercard’s network and is available to verified EU users.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57531811,
    "published": 1769590845000,
    "title": "PayPal Survey: 4 In 10 US Merchants Now Accept Crypto",
    "body": "A rising share of shops in the US are now taking crypto at checkout. That shift is small in some places and big in others, but it is real. Reports say that roughly four in 10 US merchants accept cryptocurrency today, and customer interest is a clear reason why. Related Reading: Record Pain: Bitcoin Investors Suffer $4.5B Loss, Most In 3 Years Merchant Demand Is Rising According to a new survey from PayPal and the National Cryptocurrency Association, about 39% of merchants have added crypto as a payment option. Many of those firms say they hear from buyers about crypto use on a regular basis. Reports note that 88% of merchants have gotten questions about paying with crypto, and 69% say they see demand at least once a month. Also, 84% of respondents think crypto payments will be common within five years, which shows a lot of business leaders expect wider use soon. Who’s Accepting Crypto Adoption is uneven. Big companies with annual revenue above $500 million lead the pack, with roughly 50% accepting crypto. Smaller shops lag at about 34%, while midsize firms sit near 32%. Travel and hospitality, gaming and digital goods, and higher-end retail are among the sectors pushing crypto forward. These markets often sell online or to tech-savvy buyers, so it makes sense they’d move faster. Crypto’s Role In Sales For merchants that already accept digital assets, crypto is not just an occasional trickle. Reports say digital assets account for over a quarter of sales for some of those sellers. Around 72% of current crypto-accepting merchants said their crypto sales grew over the past year. That kind of growth helps explain why firms want to keep the option available. Barriers And Bright Spots A common complaint is that setup is still too hard. Surveys found about 90% of merchants would accept crypto if it were as easy as taking a credit card. Payment tools and integration are top concerns. Merchants list faster payments, the chance to reach new customers, and better buyer privacy as reasons to accept crypto. Younger generations are pushing the trend too — Millennials and Gen Z buyers are often the ones asking to use crypto at checkout. Related Reading: Bitcoin Influencers Get Spotlight In X’s New ‘Starterpacks’ What Merchants Want Next The survey was run in October 2025 and polled about 619 payment strategy decision-makers across retail, travel, and digital goods. PayPal and the NCA put the findings in a public release at the end of January 2026. Many executives say the next step is simpler tools and clearer rules. If merchants get easier on-ramps and reliable rails for settlements, acceptance could spread faster. Featured image from PayPal Newsroom, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|crypto|digital currency|payment|paypal",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57532280,
    "published": 1769587800000,
    "title": "Stablecoins seen as ‘the default’ for payments as OKX brings crypto card to Europe",
    "body": "With EU banks exploring stablecoin issuance and regulators laying ground rules, OKX says its card marks a turning point in crypto’s integration into everyday finance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|OKX|Mastercard|Stablecoin|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57532574,
    "published": 1769593432000,
    "title": "Suspected US seizure theft wallet launches memecoin, crashes 97%",
    "body": "A wallet linked to an alleged US government crypto seizure theft launched a Solana memecoin on Pump.fun that later crashed 97%, sparking tokenomics warnings.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57532873,
    "published": 1769594400000,
    "title": "Bitget hires ex-Bitpanda legal chief Oliver Stauber to build Vienna MiCA hub",
    "body": "Bitget EU says it expects MiCA approval in Austria by mid-2026, with a broker-led model and strict asset standards for European users.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57533909,
    "published": 1769597380000,
    "title": "Nomura's Laser Digital applies for U.S. national trust bank to offer crypto custody",
    "body": "The proposed bank would offer cryptocurrency custody, spot trading and staking services under direct federal regulatory supervision.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Nomura|Laser Digital|United States|banking|US|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57534247,
    "published": 1769598164000,
    "title": "Altcoins Hyperliquid, Pump.fun Post Double-Digit Weekly Gains as Bitcoin Nears $90K",
    "body": "As Bitcoin inches towards $90K, capital has rotated into altcoins, resulting in weekly gains between 30% and 56%.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57534758,
    "published": 1769599800000,
    "title": "Inside The Trade That Made Mike Novogratz An AI Kingpin—And Could Net Him $20 Billion",
    "body": "Long dismissed as a hedge fund trader who lucked into bitcoin, billionaire Michael Novogratz is now one of the most important players in AI infrastructure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|Money|/money|Billionaires|/worlds-billionaires|Daily Cover|daily-cover|Editors' Pick|editors-pick|premium",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57534681,
    "published": 1769599272000,
    "title": "ECB’s Cipollone says digital euro key to payments sovereignty in ‘weaponised’ world",
    "body": "European Central Bank executive Piero Cipollone has argued that rising geopolitical tensions make a European-controlled payments system a strategic necessity.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 57535269,
    "published": 1769601640000,
    "title": "Pundit Explains Why The XRP Price Hitting $100 Isn’t Delusional",
    "body": "The idea of the XRP price reaching $100 is usually dismissed almost instantly based on arguments of market capitalization and circulating supply. On paper, that math suggests a $100 value would imply a market cap valuation of at least $6 trillion, which is a figure many see as unrealistic when compared to today’s crypto market. Nonetheless, a few XRP enthusiasts are of the notion that such a framework does not apply to XRP. A crypto pundit on X, known as 24HRSCRYPTO, noted that treating XRP like a static store-of-value asset misses the entire point of what the cryptocurrency is designed to do. The Pundit’s Argument: XRP Moves Value, It Doesn’t Store It According to 24HRSCRYPTO, market cap math is misleading when it is used to judge an asset like XRP, which is designed for high-velocity settlement. 24HRSCRYPTO is an XRPL validator and fervent XRP supporter that’s always calling for ultra-bullish price targets for the cryptocurrency. Related Reading: Crypto Traders Share Odds Of XRP Price Rising 40% This Year, Can It Still Rally? In his words, market capitalization assumes an asset stores value, whereas a global liquidity asset moves value. XRP, from this perspective, is not meant to warehouse trillions of dollars but to facilitate the rapid movement of capital across systems, borders, and currencies. Based on this logic, if XRP is used to free trapped capital and settle transactions at scale, the same units of liquidity can be reused repeatedly within a short period of time with huge demand. Price, then, reflects the demand plus the level of trust placed in the system and the volume of economic weight it is clearing, not how much money is sitting still. Under that framework, static market cap comparisons are a poor proxy for what XRP could be valued at in a fully deployed global settlement role. With this in mind, 24HRSCRYPTO noted that XRP at $100 isn’t delusional; it’s reality. Why Market Cap Math Dominates The $100 Debate The skepticism around a $100 XRP price comes from straightforward math. At the time of writing, XRP is trading at $1.92 and is about 5,100% away from reaching $100. XRP currently has a circulating supply of 60.85 billion tokens, and multiplying that supply by $100 produces a $6 trillion market cap, which is larger than the current market cap of the entire crypto market. Related Reading: XRP Funding Rates And Spot Volume Tell An Interesting Story For Price Market cap is treated as a hard ceiling based on this angle. The assumption is that for XRP to trade at $100, trillions of dollars would need to sit idle inside its market cap at the same time. That logic works reasonably well in theory for XRP. However, 24HRSCRYPTO is of the notion that the logic is for crypto assets like Bitcoin, whose primary function is holding value, and the assumption breaks down when applied to a liquidity-focused network asset. However, this claim does not, in fact, guarantee that XRP can trade at $100 without the cumulative market cap of circulating tokens reflecting such an amount. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|24HRSCRYPTO|Ripple|xrp|XRP Ledger|xrp news|XRP Price|XRPL|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57535825,
    "published": 1769603411000,
    "title": "OKX Launches Crypto Payment Card Across the European Economic Area",
    "body": "OKX has announced the launch of the OKX Card in Europe, expanding its payments footprint across the European Economic Area. The product allows users to pay with stablecoins at merchants that accept Mastercard, positioning crypto balances for direct everyday use rather than requiring prior conversion or preloaded fiat balances. Related Reading: XRP Derivatives Reset: Open Interest Drops Nearly 60% From July Peak The announcement comes at a time when crypto infrastructure is increasingly intersecting with traditional financial rails. While price action across major assets remains volatile, platforms are continuing to build payment and settlement tools aimed at reducing friction between on-chain assets and real-world spending. Rather than introducing a new payment concept, OKX is formalizing an existing demand: using stablecoins as a transactional medium within regulated environments. The broader relevance of the launch lies less in novelty and more in how crypto-native mechanics—such as self-custody and on-chain settlement—are being adapted to conventional consumer payment formats. Crypto Payments, DeFi, and TradFi Convergence According to the details released by OKX, the OKX Card enables direct stablecoin payments without requiring users to manually convert assets or preload funds. Stablecoins remain in the user’s wallet until purchase, when conversion occurs at checkout. The card charges no transaction or FX fees and applies a stated 0.4% market spread when converting stablecoins to euros. It is issued via a licensed European payments partner and operates under standard AML and KYC requirements within the EEA. The card supports Apple Pay and Google Pay, and functions anywhere the Mastercard network is accepted. OKX also confirmed a limited rewards program, offering crypto-denominated cashback during the initial launch period. Related Reading: Bitcoin Derivatives Pressure Hits 30-Day Extreme, Price Refuses To Break This launch reflects a broader trend: firms are repackaging DeFi infrastructure into TradFi-facing products. These companies now embed core DeFi elements—self-custody, on-chain settlement, and stablecoin liquidity—directly into regulated consumer tools like payment cards. This does not replace DeFi, but extends its utility beyond native crypto environments. DeFi is no longer only an alternative system running in parallel, but a backend layer increasingly integrated into traditional financial interfaces. OKB Consolidates After Sharp 2025 Repricing OKB is trading near $107 on the daily chart, consolidating after a sharp repricing cycle that unfolded in the second half of 2025. The structure reflects a classic post-rally digestion phase rather than active trend continuation. After peaking above the $220–$240 area, the price entered a prolonged corrective move that erased a large portion of the prior advance and shifted market control back toward sellers. From a trend perspective, the moving averages define the current regime clearly. OKB remains below the 50-day moving average (blue), which has turned down and continues to cap upside attempts. The 100-day moving average (green) is also sloping lower, reinforcing a zone of layered resistance between roughly $120 and $135. In contrast, the 200-day moving average (red) is still rising and currently sits just below price, acting as a key medium-to-long-term support reference. Related Reading: Bitcoin Breaks Below $87K As Political Risk Spikes – Liquidations Reveal The Real Driver Recent candles show reduced volatility and compressed ranges. While volume has declined materially compared to the distribution phase near the highs. This combination points to market equilibrium, not aggressive selling pressure. Buyers appear willing to defend the 200-day average, but lack the momentum needed to reclaim short-term trend levels. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|Crypto card|crypto payments|DeFi|OKB|OKB analysis|OKX|OKX Crypto Card|OKX new|OKX Wallet",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 91,
        "NAME": "OKB",
        "CATEGORY": "OKB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57535823,
    "published": 1769603400000,
    "title": "WisdomTree expands tokenized fund access to Solana in multichain push",
    "body": "Both institutional and retail investors will be able to mint, trade and hold the tokenized funds on Solana through WisdomTree Connect and WisdomTree Prime.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|WisdomTree|WisdomTree Prime|Solana News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57535932,
    "published": 1769603400000,
    "title": "WisdomTree brings its full tokenized fund lineup to Solana",
    "body": "WisdomTree adds Solana to its tokenized fund lineup, citing transaction speed as it expands a regulated multi-chain strategy.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57537152,
    "published": 1769607006000,
    "title": "XRP Could Enter New Growth Phase After Clarity Act Decision — Here’s How",
    "body": "XRP may be approaching a pivotal turning point as regulatory uncertainty is moving closer to resolution with the upcoming Clarity Act decision. If the Clarity Act establishes a clearer framework, XRP could unlock fresh capital flows, renewed exchange participation, and broader integration across the financial platforms. This moment could represent the transition from consolidation to a new phase of sustained growth. How Clear Rules Could Reshape XRP Market Perception The passing of the Clarity Art will trigger XRP to go absolutely parabolic. An analyst known as Bird has highlighted on X that the Clarity Art is designed to make the rules of crypto regulation straightforward. It will tell in the market which digital assets will be legally allowed and which are not. As the resolution inches closer, XRP has already been tested in court and was not classified as an illegal security. Related Reading: What Does XRP Really Do? Expert Explains What It Is Built For Thus, when the rules become clear across the entire crypto market, companies, banks, and investors can finally use and hold XRP without worrying about regulatory backlash. These clear rules mean more trust, more capital, and more use for XRP. Bird’s view is that this is exactly why the court case was meant to happen, because it has positioned XRP to front-run every other digital asset. While retail traders are watching the price, banks and institutions are positioning for it. Crypto analyst LukeSuther pointed out that the XRP price action is being deliberately constrained, not out of bad faith, but out of necessity, because participants can’t migrate global settlement infrastructure into a market that’s still fully volatile and speculative. Before true price discovery can happen, regulation, liquidity corridors, compliance frameworks, and integration with legacy financial systems must be in place. However, if XRP were already operating in a completely open, utility-driven market, LukeSuther argues that it wouldn’t be trading at $2.00. Instead, the price will remain compressed while the institutions load and the rails are being built. Why Infrastructure Matters More Than Market Narrative The founder of Lux Lions NFT and host of the Crypto Blitz YouTube show, RipBullWinkle, stated that what started as a digital asset experiment is now evolving into real capital markets infrastructure. Brad Garlinghouse and Tony Edward break down XRP’s institutional adoption trajectory during an X Spaces discussion. Related Reading: XRP Advances As A Recognized Digital Asset In Regulated Markets — Here’s How According to RipBullWinkle, the conversation wasn’t about price targets. Rather, it was about real-world utility in the cross-border settlements and liquidity infrastructure that traditional finance is quietly integrating into the blockchain-based rails. While the market is busy chasing narratives, foundations are being built in public view. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|Clarity Art|Crypto Blitz|LukeSuther|Lux Lions NFT|RipBullWinkle|Ripple|xrp|xrp news|XRP Price|XRPUSD|xrpusdt|YouTube",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57537149,
    "published": 1769607000000,
    "title": "Fidelity Investments Starts its own stablecoin in a massive bet that future of banking is on blockchain",
    "body": "The FIDD token will run on Ethereum, serve institutional and retail users, and comply with the new GENIUS Act’s reserve rules.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Fidelity|Stablecoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57536990,
    "published": 1769606423000,
    "title": "Crypto loses speculative edge as AI and robotics attract capital: Delphi",
    "body": "Speculative capital is flowing into new emerging tech opportunities, as progress with US crypto regulations continues to stall, limiting investor appetite for digital assets, Delphi Digital said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57537478,
    "published": 1769607943000,
    "title": "UK advertising watchdog bans Coinbase ads as 'irresponsible'",
    "body": "The ASA banned Coinbase adverts concluding they imply crypto could ease the country's cost-of-living crisis.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Coinbase|United Kingdom|Advertising|Advertising Standards Authority|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57537251,
    "published": 1769607000000,
    "title": "Fidelity Investments to Launch Stablecoin In Coming Weeks",
    "body": "Fidelity Investments is launching its own stablecoin, joining a slew of companies across startups and financial institutions with similar intentions.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57538025,
    "published": 1769609765000,
    "title": "CoinDesk 20 Performance Update: AAVE Gains 2.9%, Leading Index Higher",
    "body": "Avalanche (AVAX) was also a top performer, rising 1.6% from Tuesday.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "CoinDesk Indices|CoinDesk Indices|CoinDesk 20|charts|Prices|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 2,
        "NAME": "AAVE",
        "CATEGORY": "AAVE"
      },
      {
        "TYPE": "122",
        "ID": 8,
        "NAME": "AVAX",
        "CATEGORY": "AVAX"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57537909,
    "published": 1769609269000,
    "title": "Top Bitcoin mining stocks rise amid US winter storm hashrate decline",
    "body": "Hashrate fell sharply as Bitcoin miners curtailed operations during extreme cold, boosting profitability for companies that stayed online.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57538391,
    "published": 1769610964000,
    "title": "UK Regulator Bans Coinbase Ads Over Cost-of-Living Messaging",
    "body": "The Advertising Standards Authority deemed the ads irresponsible by presenting crypto as a solution to “prevalent financial concerns.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57539089,
    "published": 1769613261000,
    "title": "South Dakota Lawmaker Takes Second Stab at Launching State Bitcoin Reserve",
    "body": "The bill by State Representative Logan Manhart seeks to allocate as much as 10% of the state’s investment funds to the cryptocurrency.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57539038,
    "published": 1769613037000,
    "title": "Peter Thiel and Galaxy-backed Citrea wants to turn idle bitcoin into a high-speed bank account",
    "body": "Founders Fund and Galaxy-backed Citrea is aiming to unlock Bitcoin-denominated credit markets with a new mainnet and a Treasury-backed stablecoin designed for USD settlement.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Bitcoin News|Stablecoin|Lending|Rollups|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57538835,
    "published": 1769612446000,
    "title": "What’s Going On With The US Dollar And How Does It Affect Bitcoin, Ethereum Prices?",
    "body": "The Bitcoin and Ethereum prices rallied after reports of the US dollar crashing spread across the market. Recent data show that the US dollar has fallen to its lowest level in four years, raising concerns about the strength of the world’s dominant reserve currency. As the dollar weakens, market players are beginning to shift attention to alternative assets such as precious metals and digital currencies, including BTC, which is increasingly viewed as a potential hedge against rising inflation and currency depreciation. US Dollar Falls To Lows Not Seen In 4 Years New reports from Bloomberg highlight the relentless slide in the US dollar index (DXY) over recent weeks, with the price tumbling further after President Donald Trump’s comments on the currency’s performance. Sources reveal that Trump said the dollar is “doing great,” despite its ongoing downturn. Related Reading: Analyst Says Chainlink Price Could Crash 50% If This Level Fails Traders interpreted the President’s seemingly indifferent response to the declining dollar as a signal that the slide could continue, triggering further selling pressure. Data from the web-based stock market research platform Finviz shows that, as of writing, the US dollar index has crashed to 95.92 from a previous level near 100. This marks its weakest level in nearly four years, specifically since 2022. Additionally, Bloomberg reported that its Dollar Spot Index also recorded its lowest four-day decline since Trump announced new tariffs in April 2025. Traders in the $9.5 trillion per-day currency markets are also increasingly betting that the dollar could decline further, as US policy risks weigh on the world’s primary reserve currency. Amidst the decline in the US dollar index, cryptocurrencies like Bitcoin and Ethereum are posting gains. BTC’s price rose above $89,000, while Ethereum has climbed more than 3% to reach above $3,000, in the past 24 hours. This simultaneous rally in cryptocurrencies alongside the weakening US dollar suggests that investors may be shifting capital to risk-on assets. Market analyst ‘Master of Crypto’ recently outlined several reasons behind the continued decline in the weakening US dollar in a post on X. He explained that large budget deficits, the FED’s challenge of balancing inflation control with job market stability, steady bond supply, and FX hedging activities are keeping the US dollar near recent lows. According to him, in this type of market environment, holding idle cash becomes a significant risk for investors. Related Reading: Here’s How Much XRP Ripple Execs Have Dumped So Far Possible Implications For The Bitcoin And Ethereum Price Historically, periods of US dollar weakness have often coincided with rallies in Bitcoin, and other cryptocurrencies. When the dollar declines, investors sometimes seek alternative assets to preserve value. This can increase demand for Bitcoin and Ethereum, which are viewed by many as alternative stores of value and risk-on assets. While this correlation is not a clear indication of a potential cryptocurrency rally, analysts like ‘Milk Road Macro’ suggest that the declining dollar could help support a broader crypto market recovery. He said that as the dollar weakens, capital will flow into precious metals like gold and silver. Soon after, this same capital is expected to rotate into BTC, potentially fueling a price rebound. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|Ethereum|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57539359,
    "published": 1769614149000,
    "title": "Top Wall Street Firms Met With SEC Crypto Task Force to Discuss DeFi Concerns",
    "body": "Citadel, SIFMA, and JPMorgan met with the SEC on Tuesday to raise concerns about the agency’s aggressively pro-crypto agenda.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 57539322,
    "published": 1769613810000,
    "title": "HYPE price soars 58% amid exploding commodities trading on Hyperliquid",
    "body": "HYPE has entered a classic breakout stage after its onchain activity exploded, with a 45% price rally to $50 next in the cards.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57539141,
    "published": 1769613489000,
    "title": "Fidelity to Enter Stablecoin Market With Ethereum-Based 'Digital Dollar'",
    "body": "Wall Street giant Fidelity will enter the stablecoin world with the upcoming launch of its Ethereum-based Digital Dollar (FIDD).",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57539734,
    "published": 1769615378000,
    "title": "Robinhood CEO says tokenized stocks could prevent another GameStop freeze",
    "body": "Vlad Tenev blamed the trading halt on its app in 2021 on bad infrastructure, a problem that he says tokenization would solve.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Robinhood|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 57540666,
    "published": 1769617842000,
    "title": "Here’s Why The Hyperliquid Price Is Exploding Again",
    "body": "The Hyperliquid price is seeing renewed bullish momentum, recording double gains over the last week and bucking the broader crypto market downtrend. This comes thanks to bullish fundamentals in the token’s ecosystem, including a rise in open interest on the decentralized exchange (DEX). Why The Hyperliquid Price Is Rising The Hyperliquid price is up over 58% in the last seven days, outpacing the broader crypto market as Bitcoin trades just below the psychological $90,000 level. This price surge has come on the back of a rise in Hyperliquid’s HIP-3 open interest. The DEX announced in an X post that open interest reached an all-time high of $790 million, driven recently by a surge in commodities trading. Related Reading: XRP, HBAR, And Litecoin: Pundit Highlights Coins To Watch In 2026 The exchange added that HIP-3’s open interest has been hitting new all-time highs each week, after being just $260 million a month ago. HIP-3 enables anyone to launch a custom perpetual market for crypto, commodities such as gold and silver, and other assets such as stocks. Thanks to this upgrade, the DEX is seeing increased trading activity, which has led to a surge in the Hyperliquid price. Notably, the Hyperliquid price has benefited from the precious metals boom, with the silver perpetuals market on the DEX seeing massive trading activity. CoinGecko data shows that the Silver perpetuals market is the third-largest traded in the last 24 hours, behind Bitcoin and Ethereum, with a trading volume of just over $1 billion. In an X post, Hyperliquid’s co-founder Jeff Yan noted that the DEX has achieved an important milestone of becoming the most liquid venue for crypto price discovery in the world. This came as he highlighted the order books for BTC perps on Binance and his DEX. He added that Hyperliquid has also grown to become the most liquid venue for perps on traditional-finance (TradFi) assets. Little Selling Pressure And Huge Buying Pressure For HYPE In an X post, Hyperliquid stakeholder Henrik noted that the Hyperliquid price is also rising as major selling pressure is gone. On the other hand, HYPE is seeing significant demand, including from digital asset treasuring companies such as Hyperliquid Strategies. He further highlighted the imminent Kraken HYPE listing, which is also bullish for the token. Meanwhile, Henrik stated that Hyperliquid dominates all trading metrics, including volume and open interest. Related Reading: Here’s Why The Bitcoin, Ethereum, And Solana Prices Are Still Crashing Hard The increase in the DEX’s trading activity is also significant and bullish for the Hyperliquid price, as the majority of fees earned on the protocol are directed to the Assistance Fund, which is used to buy back HYPE tokens on the open market. DeFiLlama data shows that the DEX is currently among the top five protocols by fees generated over the last 24 hours. At the time of writing, the Hyperliquid price is at around $34, up over 27% in the last 24 hours, according to data from CoinMarketCap. Featured image from Medium, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|Assistance Fund|Binance|bitcoin|btc|CoinGecko|CoinMarketCap|DeFiLlama|DEX|ethereum|Henrik|Hype|HYPE price|Hyperliquid|Hyperliquid price|HYPEUSD|HYPEUSDT|silver|TradFi|Traditional Finance",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57540422,
    "published": 1769617085000,
    "title": "Fidelity readies digital dollar as stablecoins move into institutional finance",
    "body": "Fidelity will issue a stablecoin through its newly approved national trust bank, signaling deeper institutional use of blockchain-based payment infrastructure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 57540368,
    "published": 1769617027000,
    "title": "Coinbase opposition won't stymie U.S. crypto market structure bill, HSBC says",
    "body": "The bank argued that legislative momentum remains strong as industry heavyweights prioritize long-term regulatory certainty over unpredictable enforcement.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Cryptocurrency Regulations|Market Structure Legislation|HSBC|Coinbase|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57540796,
    "published": 1769617861000,
    "title": "Bitcoin price fails to follow as gold hits $5.3K record into FOMC",
    "body": "Bitcoin disappointed with an apparent failed breakout above $90,000 after gold soared to fresh highs and US dollar strength nosedived.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57541118,
    "published": 1769619076000,
    "title": "The UK government says banks need to stop blocking crypto firms if the country wants to become a digital hub",
    "body": "U.K. officials say banks must treat crypto businesses fairly as final regulation nears.Strategy",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|United Kingdom|HM Treasury|FCA|Coinbase|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57542218,
    "published": 1769622026000,
    "title": "Price predictions 1/28: BTC, ETH, BNB, XRP, SOL, DOGE, ADA, BCH, HYPE, XMR",
    "body": "Bitcoin rallied above $90,000 as the US dollar index weakened, gold hit new highs and traders positioned ahead of today’s FOMC. Will a rate cut or pause extend the BTC and altcoin rally?",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 12,
        "NAME": "BCH",
        "CATEGORY": "BCH"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57542088,
    "published": 1769621668000,
    "title": "Dubai Insurance launches crypto wallet  premium payments, claims settlements",
    "body": "The digital wallet allows insurance premiums and claims to be settled in crypto through a regulated custody partnership with Zodia Custody.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57542604,
    "published": 1769623211000,
    "title": "Tether Will Keep Adding to $24 Billion Gold Stash Held in Former Nuclear Bunker, Says CEO",
    "body": "Stablecoin issuer Tether is now one of the world's biggest gold holders, keeping its precious metal in a former Swiss nuclear bunker.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57542577,
    "published": 1769623206000,
    "title": "Bitcoin Breaks Into State Policy As South Dakota Weighs 10% Allocation",
    "body": "South Dakota has a new bill on the table that would let the state put up to 10% of certain public funds into Bitcoin. Reports say Rep. Logan Manhart filed House Bill 1155 this week, restarting an effort that stalled last year. Related Reading: PayPal Survey: 4 In 10 US Merchants Now Accept Crypto The measure would change state investment rules to give the State Investment Council explicit authority to hold Bitcoin in its portfolio. Lawmaker Files Bill For Bitcoin Reserve According to filings and public posts, Manhart’s proposal mirrors a move he tried in 2025 and keeps a clear cap on exposure: 10% of the moneys made available for investment. The bill text says the limit “may not exceed 10%” and lays out options for how the exposure could be taken, including direct holdings or regulated products. A South Dakota lawmaker is reviving a push to bring bitcoin into state finances. Republican Rep. Logan Manhart introduced House Bill 1155, which would allow the state to invest up to 10% of eligible public funds in bitcoin. It’s a renewed effort after a similar bill stalled… pic.twitter.com/hPBbiSB6zT — Timmy Shen (@timmyhmshen) January 28, 2026 The new push comes after last year’s proposal was deferred in committee. Reports note that HB 1202 was put aside during the 2025 session and did not advance, and Manhart signaled he would try again in 2026. That history matters because it shows the idea has support in some corners but also faces practical and political hurdles. What The Bill Allows Based on reports, the bill not only sets a 10% ceiling but also tries to handle custody and security concerns. It mentions requirements such as using qualified custodians or exchange-traded products, encrypted storage, and multi-signature controls. Those rules are aimed at lowering the risks that come with holding a volatile asset with public money. Supporters say Bitcoin could act as a hedge and add a new type of asset to the state’s mix. Opponents point to volatility and possible legal or accounting issues when state funds are used in this way. Related Reading: Record Pain: Bitcoin Investors Suffer $4.5B Loss, Most In 3 Years The debate will likely hinge on how the State Investment Council evaluates risk and which funds would be considered “eligible” under the bill’s language. Political And Financial Pushback There is practical pushback from fiscal watchdogs and some lawmakers who worry about public perception. Money managed for things like pensions carries duty of care. That duty was stressed last session and will be raised again now that the bill is back. The point has been made plainly and will shape committee hearings. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|digital currency|House Bill 1155|South Dakota",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57542493,
    "published": 1769622944000,
    "title": "Wall Street giants push back on exemptions for tokenized securities in SEC meeting",
    "body": "Executives and industry groups pressed regulators to apply traditional securities rules to blockchain-based trading, pushing back on exemptions even as DeFi enters the debate.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|SEC|Wall Street|Cryptocurrency|Tokenized Securities|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 57539115,
    "published": 1769613503000,
    "title": "Bitcoin treasury firm Strive raises $225 million to pay off loans, buy more bitcoin",
    "body": "The offering of SATA shares was oversubscribed and upsized from the initial $150 million target.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Vivek ramaswamy|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57543054,
    "published": 1769624535000,
    "title": "MegaETH mainnet to go live Feb. 9 in major test of ‘real-time’ Ethereum scaling",
    "body": "This follows its October 2025 $450 million token sale that was heavily oversubscribed.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Ethereum News|layer 2|Token Sale|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 205,
        "NAME": "TOKEN SALE",
        "CATEGORY": "TOKEN SALE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57543973,
    "published": 1769626800000,
    "title": "Crypto's political power supercharged with $193 million in Fairshake, thanks to new cash",
    "body": "The industry's chief campaign-finance arm got another $49 million and already outpaces what it had in the last U.S. congressional races, when it aided dozens of wins.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Fairshake|campaign contributions|Ripple|A16z crypto|U.S. Political Elections|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57543972,
    "published": 1769626678000,
    "title": "Federal Reserve holds policy steady as early rate cut bets vanish and bitcoin stalls",
    "body": "The January Fed rate decision capped a sharp reversal in easing expectations, likely among the reasons for crypto's poor price performance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Federal Reserve|FOMC|Interest Rates|Bitcoin News|Breaking News|top news|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57543758,
    "published": 1769626247000,
    "title": "Strive Enters Top 10 Publicly Traded Bitcoin Holders, Pays Off Debt After Semler Acquisition",
    "body": "Financial services firm Strive Asset Management is now among the top 10 publicly traded holders of Bitcoin.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57544287,
    "published": 1769627790000,
    "title": "Optimism governance approves OP token buyback plan tied to supeTrchain revenue",
    "body": "The proposal links the OP token more directly to the economic performance of the Superchain.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Optimism|Optimism foundation|Optimism unlimited|Token Governance|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 92,
        "NAME": "OP",
        "CATEGORY": "OP"
      }
    ]
  },
  {
    "id": 57544187,
    "published": 1769626060000,
    "title": "US Marshals Are Investigating a Possible Digital-Asset Hack",
    "body": "The US Marshals Service, which provides custody of cryptocurrencies seized by or forfeited to federal law enforcement agencies, said it’s investigating a possible hack of US government digital-asset accounts.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 57544580,
    "published": 1769628302000,
    "title": "Crypto PAC Fairshake reports $193M after industry donations ahead of US midterms",
    "body": "The funding represented a 37% increase in Fairshake’s cash on hand since it last disclosed its holdings in July 2025.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57544798,
    "published": 1769629224000,
    "title": "Paxos' gold token rakes in record inflows as crypto investors turn to the yellow metal",
    "body": "Tokenized gold has improved the traditional store of value metal's utility, while bitcoin trades like a risk asset amid uncertain times, one expert noted.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Gold|Tokenized Assets|Paxos|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 183,
        "NAME": "PAXG",
        "CATEGORY": "PAXG"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57544938,
    "published": 1769629859000,
    "title": "Clawdbot Chaos: A Forced Rebrand, Crypto Scam and 24-Hour Meltdown",
    "body": "Scammers exploited a brief gap amid a trademark dispute to launch meme coin CLAWD, briefly inflate it to $16 million, and turn a viral AI project into a cautionary tale.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 208,
        "NAME": "ADMINISTRATIVE EVENTS",
        "CATEGORY": "ADMINISTRATIVE EVENTS"
      },
      {
        "TYPE": "122",
        "ID": 214,
        "NAME": "TICKER CHANGE",
        "CATEGORY": "TICKER CHANGE"
      }
    ]
  },
  {
    "id": 57545421,
    "published": 1769631122000,
    "title": "Coinbase launches prediction markets in all 50 US states via Kalshi",
    "body": "More than a month after announcing plans to move deeper into prediction markets, Coinbase said that it would launch its offering for ”sports, politics, culture and more.”",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57545924,
    "published": 1769632800000,
    "title": "Japanese Banking Giant’s Crypto Subsidiary Applies for US Banking Charter",
    "body": "A Swiss subsidiary of Japanese investment banking giant Nomura is the latest crypto firm to seek a U.S. national bank charter from the OCC.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]