[
  {
    "id": 57473660,
    "published": 1769414423000,
    "title": "Japan plans framework that could permit crypto ETFs by 2028: Nikkei",
    "body": "Japan’s financial regulator is weighing rule changes that could allow crypto assets to qualify for ETFs, signaling a possible shift in retail access.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57474853,
    "published": 1769418645000,
    "title": "Matcha Meta breach tied to SwapNet exploit drains up to $16.8M",
    "body": "Matcha Meta urged users to revoke one-time approvals for SwapNet’s router contract after a smart contract vulnerability saw up to $16.8 million stolen on the Base blockchain.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 57475695,
    "published": 1769421742000,
    "title": "Metaplanet raises 2026 outlook as Bitcoin write-down tops $670M",
    "body": "Japanese Bitcoin treasury company Metaplanet has hiked its 2025 revenue and profit guidance, forecasting a near doubling of sales in 2026 as its BTC income and treasury strategy scale up.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57476096,
    "published": 1769423410000,
    "title": "Bitcoin Price Prediction: Analyst Forecasts 72.86% Crash To $30,000",
    "body": "A new Bitcoin price prediction has been put forward following a long-term technical analysis shared on the social media platform X by crypto analyst Leshka.eth. The analysis compares Bitcoin’s current structure on the weekly timeframe to the 2021 market peak, showing how price behavior is repeating an identical pattern. Based on how Bitcoin has interacted with a rising multi-year channel in previous cycles, the analysis proposes a projection as to how Bitcoin could be setting up for a powerful corrective move that sends the price back to as low as $30,000. Bitcoin Weekly Structure About To Break Technical analysis of Bitcoin’s price action on the weekly candlestick timeframe chart shows that the leading cryptocurrency has been trading with higher highs and higher lows since 2018. Interestingly, this trend of higher highs has led to repeated interaction with a rising resistance trendline that has defined every major cycle top. Related Reading: Ripple’s Next Steps: Where XRP Stops Being Trade And Starts Being Infrastrucutre As shown in the chart below, Bitcoin pushes into this upper boundary during each bull market, only to be rejected once momentum fades. These rejection points are clearly marked across multiple cycles, including the 2017 and 2021 peaks. This repeated failure is a defining feature of Bitcoin’s macro cycles of exhaustion after prolonged upside expansion. Bitcoin once again rallied into this same long-term trendline when it broke to new all-time highs in October 2025 before stalling and rolling over. Bitcoin’s price failed to hold above the trendline and has corrected by about 30% since then. The leading cryptocurrency is now trading below $90,000, and this technical outlook introduces the possibility that the current pullback is not yet complete and could extend further. Bitcoin Weekly Candlestick Chart. Source: @leshka_eth on X Bitcoin Crash Extension To $30,000? The chart also highlights the depth of prior bear market declines once Bitcoin was rejected at this long-term structure. After the 2017 cycle top, Bitcoin fell roughly 84.99% from peak to trough. Following the 2021 high, Bitcoin once again declined by about 77.47% before finding a bottom near the lower boundary of the broader rising channel. Based on the current setup, the projected downside move marked on the chart measures approximately 72.86%. Applying a drawdown of that magnitude from the recent cycle high places Bitcoin’s potential bottom around $30,000. Related Reading: Coinbase Exec Points Out The Big Difference Between Bitcoin And Central Banks Interestingly, Grok AI offered a more optimistic interpretation of Bitcoin’s near-term outlook based on responses to questions under the same technical post. According to Grok, aggregated views from sources such as CNBC, Reddit, and Forbes suggest that the probability of Bitcoin dropping into the $30,000 to $40,000 range is relatively low, estimated at around 15% to 25% by bearish cycle models. On the other hand, many analysts instead expect higher price floors, often above $50,000. Some long-term projections extend over $200,000, with names like Binance co-founder Changpeng Zhao predicting $200,000 and Tom Lee predicting $250,000 in 2026. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57476518,
    "published": 1769424755000,
    "title": "Bitcoin income windfall drives Metaplanet to revise full-year revenue forecast upward",
    "body": "The company forecasts revenue of over $100 million for FY2026, with 97.5% of projected sales coming from its Bitcoin Income Generation business.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|MetaPlanet|Bitcoin News|Bitcoin Options|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57477006,
    "published": 1769425547000,
    "title": "Japan ETFs said likely to trade by 2028 as SBI, Nomura ready products",
    "body": "The Financial Services Agency is moving to classify crypto as an eligible asset for exchange-traded funds, with potential inflows reaching $6.4 billion, according to Nikkei.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|exchange-traded funds|cryptocurrencies|Japan|Regulation|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57477184,
    "published": 1769427571000,
    "title": "Bitcoin risks fourth straight monthly loss, a streak not seen since 2018",
    "body": "A rare streak of four consecutive declines collides with January options expiry that could influence short term price action.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Deribit|Options|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57477558,
    "published": 1769428829000,
    "title": "Global Liquidity Says Bitcoin Is Extremely Undervalued – Here’s The ‘Real’ Figure",
    "body": "Crypto pundit Kyle Chassé has pointed to the rising global liquidity to prove that Bitcoin is currently undervalued. His comments come as fiat currencies like the Dollar and Yen continue to weaken amid concerns about governments’ fiscal policies. Global Liquidity Points To A Bitcoin Target Of $270,000 In an X post, Kyle Chassé shared an accompanying chart highlighting a Bitcoin target of $270,000 based on rising global liquidity. The pundit stated that the herd says that $90,000 BTC is expensive, but that the fiat ledger has reminded everyone why the digital ledger exists. This came as he revealed that the global M2 money supply has hit a record $98 trillion, driven by aggressive expansion from the U.S., the Eurozone, China, and Japan. Related Reading: Bitcoin Price Following The 2022 Fractal? Here Was The Previous Outcome Chassé further noted that year-to-date (YTD) global liquidity growth is now 6.2%, the fastest pace since the 2020 pandemic response. The pundit warned that in a system where the fiat denominator is permanently diluted, fixed-supply assets are not going up in price, but that cash is “loudly becoming worthless.” As such, he believes that BTC is a good hedge against currency debasement and potentially inflation. The pundit’s comments notably come amid a decline in the dollar, with the DXY down since the start of the year. The yen is also down YTD, as these fiat declines are coming amid a push by the governments to increase spending. Increased government spending is considered bullish for Bitcoin, given its fixed supply compared to fiat currencies, which governments continue to print. BitMEX co-founder Arthur Hayes had also recently predicted that a rise in dollar liquidity would spark higher BTC prices. However, that is yet to be the case as Bitcoin continues to trade like a risk asset and has erased its year-to-date (YTD) gains amid political tensions in the U.S. A U.S. government shutdown is also looking more likely by January 31, sparking a BTC drop below $87,000 yesterday. BTC Will Rise Once Liquidity Returns Crypto pundit Merlijn assured that Bitcoin will rise once liquidity comes back. In an X post, he urged market participants to zoom out and that the BTC pattern would become obvious. The pundit revealed that the flagship crypto has already recorded waves 1, 2, and 3 with lower highs, which signal trend fatigue. Related Reading: Here’s Why The Bitcoin, Ethereum, And Solana Prices Are Still Crashing Hard Now, Bitcoin is looking to form waves 4 and 5, which would signal a reset, absorption, and base building. Merlijn suggested that the bottom may not yet be in, but that once that happens, BTC could rally to as high as $124,000, bringing it close to its current all-time high (ATH) of $126,000. At the time of writing, the Bitcoin price is trading at around $87,700, down in the last 24 hours, according to data from CoinMarketCap. Featured image from Pngtree, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|Arthur Hayes|BitMEX|CoinMarketCap|dxy|Global M2 Money Supply|Kyle Chassé|Merlijn|Year-To-Date|YTD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57478532,
    "published": 1769432478000,
    "title": "Bitcoin Liquidations Spike to $750M Amid Weekend Slide",
    "body": "Long positions bore the brunt of a $750 million crypto liquidation spike, as prices slid toward $88K amid Japan's financial turmoil.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57479238,
    "published": 1769435069000,
    "title": "Michael Saylor’s Strategy buys 2,932 Bitcoin amid market sell-off",
    "body": "Strategy acquired $264 million of Bitcoin last week during the market pullback, lifting its holdings to more than 712,000 BTC, according to a Monday SEC filing.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57479330,
    "published": 1769435599000,
    "title": "Coreweave stock gains 9% on fresh $2 billion Nvidia investment",
    "body": "Already an investor in CoreWeave, Nvidia last September had agreed to purchase $6.3 billion of computing services from the AI infrastructure provider.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Coreweave|Nvidia|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57479305,
    "published": 1769435348000,
    "title": "Crypto users affected in massive 149M infostealer data dump",
    "body": "A researcher uncovered a 149 million-record credential dump from infostealer malware, including 420,000 Binance logins, exposing growing risks to crypto users.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57479851,
    "published": 1769437089000,
    "title": "US Bitcoin Miners Slow as Winter Storm Hits Power Grids",
    "body": "Extreme cold led miners to curb their electricity use, briefly cutting hashrate as grid stress spread across several regions.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57479819,
    "published": 1769436802000,
    "title": "UK banks block or delay 40% of crypto exchange transfers: Survey",
    "body": "A new UK Cryptoasset Business Council report found that almost all major banks are imposing blanket limits or blocks on transfers to crypto exchanges, effectively debanking crypto users.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57480756,
    "published": 1769439641000,
    "title": "Gold Hits Record $5K While Bitcoin Struggles To Keep Pace",
    "body": "Gold shone brightly today, racing to a new high while crypto took the back seat, and the gap between the two assets opened wide. Related Reading: Money Keeps Leaving: Bitcoin ETFs Shed $1.72 Billion In Just 5 Sessions On Monday, the precious metal moved past the $5,000 mark, registering a price point market sentinels had not witnessed before. Bitcoin, by contrast, failed to keep pace and traded well below its recent highs. Gold Hits Record Levels Safe-haven demand pushed gold sharply higher. Prices were up above $5k an ounce and inked roughly $5,110 at the peak. Silver, for its part, did not go unnoticed, jumping to fresh peaks near $107/ounce. Source: Gold Price Traders pointed to simmering geopolitical friction and talk of tougher trade moves led by US President Donald Trump as fuel for the rally. A weaker greenback made metals more attractive to customers overseas, and central bank buying provided steady backing. Liquidity in some corners were thin as investors rushed to shift cash into things that feel stable when risk elevates. Bitcoin Falls Behind Market numbers show Bitcoin hovering in the mid-$80,000s range, retreating from peaks seen late last year. Reports note the alpha crypto is roughly 30% below the highest level it hit reached in October 2025, leaving some holders quite jittery. Volatility was another factor. Where bullion is being sought for safety, Bitcoin is viewed more as a growth or speculative play, and that difference in investor application becomes clear when markets tighten. Some funds slashed their crypto exposure, signaling a short reroute away from high-risk gambits. Why Investors Are Shifting Analysts and traders described a simple choice: shelter or swing for gains. When headlines push worry, money flows into assets that are widely trusted across markets and governments. Metals fit that ticket. Based on market chatter, fears of a US government funding clash and fresh tariff announcements stacked pressure on stocks and added a sense of urgency to safe-haven acquisition. Options and futures trading hinted at a more cautious perpective, with volatility indexes rising and bond yields behaving in ways that made the yellow metal look more appealing by comparison. Related Reading: XRP Charts Flash Familiar Signal As Analyst Calls For $11, Then $70 What Traders Are Watching Market watchers said eyes will be glued on a few key metrics: The dollar’s path, moves by major central banks, and any sign that US politics escalates could keep metals elevated. For Bitcoin, network activity, large wallet flows, and regulatory headlines will likely set the tone. Some traders expect swings both ways. Others caution that when risk appetite is back, crypto may bounce hard, but that outcome is not a sure thing and will be dependent on a string of policy and macro moves. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btcusd|crypto|digital currency|gold|silver|tariffs|Trump|US Dollar",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57481912,
    "published": 1769442783000,
    "title": "Tom Lee's BitMine Makes Biggest Ethereum Buy Yet in 2026",
    "body": "Publicly traded Ethereum treasury firm BitMine Immersion Technologies added to its stash with its largest ETH acquisition of the year so far.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57482309,
    "published": 1769443824000,
    "title": "Bitcoin due dollar-fueled macro bottom as traders dismiss $88K bounce",
    "body": "Bitcoin price analysis warned that BTC would follow the US dollar toward a long-term bottom next, adding pain for crypto bulls.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57482321,
    "published": 1769440398000,
    "title": "BlackRock doubles down on bitcoin fund offerings with income-focused filing",
    "body": "The ETF would actively manage a covered call bitcoin exposure through BlackRock's existing iShares Bitcoin Trust (IBIT), to generate income for investors.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|BlackRock|Bitcoin News|Bitcoin ETF|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57482518,
    "published": 1769445045000,
    "title": "Crypto Traders Share Odds Of XRP Price Rising 40% This Year, Can It Still Rally?",
    "body": "Retail traders are increasingly optimistic about XRP, even though the cryptocurrency’s price is currently struggling to keep up above $1.90. Despite the recent lack of follow-through in price action, different data shows confidence is building beneath the surface. Data from prediction markets by Robinhood shows traders are actively pricing in the possibility of a sizable upside move for XRP’s price action this year, with odds pointing toward a rally of roughly 40% from current levels. How Prediction Market Pricing Is Reflecting Bullish Expectations Data from prediction markets hosted on Robinhood shows that traders are actively trading contracts tied to XRP reaching specific price levels in 2026. Notably, the data shows that the contract for XRP trading at $2.75 in 2026 is currently quoted with a bid of $0.66 and an ask of $0.73. Related Reading: XRP Price Obliteration Is Not A Matter Of If, New All-Time Highs Are Coming An ask of $0.73 means that the Robinhood prediction platform believes the likelihood of XRP reaching or exceeding $2.75 is high enough to demand a significant premium. Although this does not represent a guaranteed probability, it suggests that traders offering liquidity see that outcome as more likely than not, placing implied odds in the 73% range based on current pricing. That same optimism is present as price targets move higher, though more measured. The contract tied to XRP crossing $3.00 is priced around 50 cents. This implies the market views that level as a roughly even chance and a 50% scenario that the XRP price breaks above $3 again in 2026. The ask price drops to 44 cents for an XRP price bet of $3.25, which means there is a 44% chance XRP reaches this level. Can XRP Still Rally While Near $1.90? Recent price action has seen XRP now back to trading around support at $1.9. At the time of writing, XRP is trading at $1.88, down by 5% in the past seven days. This decline is part of an extended correction move after XRP’s rally in early January was rejected around $2.41 on January 6. Related Reading: XRP Price Recovery Is Possible If It Reclaims This Ichimoku Base The entire crypto industry is now back to a mood of fear, according to CoinMarketCap’s Fear & Greed Index. The index shows that the overall market sentiment is currently sitting at a Fear reading of 29. Even so, this risk-off mood has done little to dampen bullish expectations among many XRP investors. Several forecasts published in January continue to point toward a move into new all-time price highs this year. Standard Chartered’s analysts, for example, have projected that XRP could reach $8 in 2026 if sustained ETF inflows and clearer regulation are able to increase institutional interest. Another price outlook echoed the idea that a new all-time high above $5 is possible before the year ends based on the current trend of XRP outflows from crypto exchange reserves. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|CoinMarketCap|etf|Fear & Greed Index|Ripple|Robinhood|Standard Chartered|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57482612,
    "published": 1769445371000,
    "title": "Crypto Funds Shed $1.73B Last Week, Largest Figure Since November",
    "body": "Digital asset investment products saw $1.73 billion in outflows last week as U.S.-led redemptions intensified.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||||||Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57482574,
    "published": 1769445092000,
    "title": "BlackRock Files With SEC to Launch iShares Bitcoin Premium Income ETF",
    "body": "BlackRock filed for a Bitcoin income ETF using an options strategy to generate premium income for investors beyond spot price gains.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57482904,
    "published": 1769446430000,
    "title": "Ripple partners with Saudi bank unit on blockchain payments, custody",
    "body": "Ripple’s agreement with Riyad Bank highlights growing institutional interest in blockchain for payments, custody and tokenization across global financial markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57482933,
    "published": 1769446319000,
    "title": "Cathie Wood’s ARK Invest files for two crypto index ETFs tied to CoinDesk 20",
    "body": "One proposed fund will attempt to exactly mimic the CoinDesk 20, but the other would track the index, excluding bitcoin.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|ARK Invest|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57483073,
    "published": 1769447348000,
    "title": "Wall Street's Jefferies sees market structure bill as tokenization inflection point",
    "body": "Infrastructure gains and regulatory momentum are accelerating tokenization. A market structure bill is the missing link for the next phase of digital asset adoption.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|crypto regulation|Market Structure Legislation|Jefferies|Analysts|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57483060,
    "published": 1769447273000,
    "title": "Senate Crypto Bill Markup Delayed By Snowstorm, But May Still Get Hit With Partisan Vote",
    "body": "There’s a good chance snow will be cleared in D.C. by Thursday’s markup—but a “99%” chance the bill won’t receive any Democratic support, one Senate source said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 57483228,
    "published": 1769448146000,
    "title": "Crypto exchange WhiteBIT flagged by Russia as 'undesirable' over support for Ukraine military",
    "body": "WhiteBIT has actively supported Ukraine's war effort, donating $11 million to military initiatives and processing over $160 million in donations.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Russia|Ukraine|Crypto Exchange|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57483420,
    "published": 1769446200000,
    "title": "Crypto Misses the Macro Trade as Retail Dives Into Gold, Stocks",
    "body": "Gold is topping $5,000. Stocks keep booming. The dollar is falling again. Yet Bitcoin — hailed as both a momentum and “debasement” trade — is sitting out the action. Its price is stalling, volumes are limp, and longtime believers are drifting toward more dependable markets like equities and precious metals.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57483752,
    "published": 1769448908000,
    "title": "U.S. Marshals investigate claims that son of government contractor stole $40 million of seized crypto",
    "body": "The threat actor was captured on video flaunting millions in crypto allegedly siphoned from U.S. government seizure addresses, later traced back by ZachXBT.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Cryptocurrency|seized crypto|US Marshals Service|Zachxbt|U.S. Justice Department|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57484008,
    "published": 1769451933000,
    "title": "Trading 212 sold crypto-linked securities without authorisation",
    "body": "Investment platform did not have the correct permission to sell crypto ETNs for approximately three months",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57484199,
    "published": 1769452813000,
    "title": "Millions in crypto wealth at risk of vanishing when holders die. Here's how to protect them",
    "body": "Without proper planning, inherited crypto can easily be lost to delays, missing keys or fiduciaries unfamiliar with the asset class, experts warn.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|CoinDesk Wealth|Wealth Management|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57485101,
    "published": 1769455418000,
    "title": "Gold’s digital rally mirrors increasing stress on US dollar",
    "body": "Tether’s XAUt tokenized gold now accounts for more than half of the gold-backed stablecoin market as the US dollar weakens amid renewed safe-haven demand.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57485603,
    "published": 1769457318000,
    "title": "Macro fears mask Ethereum’s momentum, SharpLink CEO says",
    "body": "SharpLink CEO Joseph Chalom argues that macro uncertainty is hiding a massive institutional shift toward Ethereum-based tokenization.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Ethereum News|ETH|Digital Asset Treasury|BlackRock|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57485936,
    "published": 1769458096000,
    "title": "VanEck expands crypto ETF lineup with spot Avalanche product",
    "body": "The newly launched fund offers exchange-traded exposure to AVAX as other proposed Avalanche ETFs remain under regulatory review.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 8,
        "NAME": "AVAX",
        "CATEGORY": "AVAX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57486346,
    "published": 1769459716000,
    "title": "Valour wins FCA approval to offer Bitcoin, Ether ETPs to UK retail investors",
    "body": "The rollout comes as UK regulators reopen the retail market to crypto-related products and global issuers expand regulated offerings.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57486842,
    "published": 1769461245000,
    "title": "XRP’s 173-Day Theory: What Happens If This Historical Trend Plays Out Again",
    "body": "A crypto analyst has identified a recurring chart pattern centered on a 173-day cycle that previously preceded a major price expansion for XRP. Based on this pattern, the expert suggests that XRP may be approaching a similar price rally if the trend plays out as expected. XRP Historical Pattern Signals Powerful Upside Move A crypto analyst who goes by ‘Bird’ on X has drawn attention to a recurring pattern on XRP’s daily chart. His analysis compares XRP’s current price formation with the pattern that preceded the 2025 breakout, highlighting a nearly identical time cycle and chart structure. Related Reading: XRP Completes ‘Super Guppy Compression’ Against Bitcoin, Next Target Emerges On the left side of the chart, Bird noted that it took about 173 days for XRP to break after reaching its first major top in 2025. This period is clearly marked by vertical blue lines on the chart and shows price moving within a descending wedge pattern. Notably, each price rally was lower than the previous one, while support levels remained relatively stable. Trading volume during that phase also hovered around $1.8 billion, suggesting that the breakout developed under steady market participation rather than thin liquidity. On the right side of the chart, which shows XRP’s price action in the current market cycle, Bird points to a similar pattern forming. Since the July 2025 peak, XRP has spent about 173 days moving sideways within a descending wedge. Compared to the past cycle, trading volume has been much lower, averaging around $1 billion. However, the pattern’s shape and timing closely match past trends. Bird notes that XRP has not broken down despite months of severe downward pressure. Instead of falling below key support levels, the price has been squeezed into a tighter range within the same descending wedge pattern. It also held near the $1.94 level as it approached the tip of the wedge. The analyst stated that this move shows the market is not moving sideways at random but is entering a late-stage compression before a larger upward move. If historical trends hold, Bird has predicted that XRP could surge to between $4 and $4.5. With the cryptocurrency currently trading around $1.87, this would represent a surge of more than 113%. Analyst Predicts 2017 XRP Price Explosion In 2026 Despite XRP’s recent crash below $1.9, analysts still believe its price could recover and launch a strong rally. A recent analysis by market expert Steph is Crypto reflects this optimistic outlook. Related Reading: What the Triple-Tap At $1.80 Means For The XRP Price In his post on X, Steph is Crypto predicted that XRP could be on the verge of a price explosion similar to the one in 2017. At the time, the cryptocurrency recorded a powerful rally, jumping from around $0.005 to more than $0.25. If this same trend repeats, the analyst forecasts a breakout from around $2 to above $22. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Bird|Descending Wedge Pattern|Ripple|Steph is Crypto|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57486611,
    "published": 1769460614000,
    "title": "US Government Bitcoin, Crypto Theft Allegation Emerges Involving CEO’s Son",
    "body": "A new controversy has surfaced around Bitcoin (BTC) and other crypto assets held by the US government, following allegations raised by blockchain investigator ZachXBT. Controlling Millions In Stolen Government Crypto In a series of posts on social media platform X (previously Twitter), ZachXBT accused John “Lick” Daghita of stealing millions of dollars’ worth of seized digital assets from wallets linked to the US government. John Daghita is the son of Dean Daghita, the president of CMDSS, a firm that publicly states it provides critical services to the US Department of Justice (DOJ) and the Department of Defense. Related Reading: Expert Who Nailed The Bitcoin Top Now Says Buy At These Levels According to the investigation, the alleged theft came to light after a young hacker was provoked during a heated “band for band” argument on social media app Telegram. During the exchange, which was fully recorded, the individual reportedly began screen-sharing his cryptocurrency wallets while boasting about his holdings. Those wallets were later traced to more than $40 million in seized crypto assets that belonged to the US government. ZachXBT’s findings go further, claiming that the individual known online as “John (Lick)” was observed controlling wallets tied to more than $90 million in suspected illicit funds. Among those assets were cryptocurrencies linked to US government seizure addresses associated with the Bitfinex hack. In the recordings reviewed by the investigator, John is seen actively managing multiple wallet addresses while millions of dollars’ worth of Ethereum (ETH) and Tron (TRX) were moved in real time, strongly suggesting direct control over the funds. CMDSS Goes Dark, Suspect Alters Online Identities Shortly after the allegations were made public, CMDSS appeared to remove its digital footprint. The company scrubbed its website, X account, and LinkedIn page. Around the same time, John reportedly began changing his online usernames and deleting non-fungible token (NFT)-related handles from Telegram. Related Reading: XRP Ledger Congestion Could Burn 1 Billion Coins A Year, Developer Claims Despite these efforts, ZachXBT noted that John continued to taunt investigators and even sent him a small amount of ETH from one of the flagged wallets. ZachXBT stated that he plans to return those funds directly to a US government seizure address, underscoring his position that the assets belong to the government. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|bitcoin|Bitcoin news|bitcoin price|btc|crypto|crypto market|crypto news|cryptocurrency|US Bitcoin reserve",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57486890,
    "published": 1769461078000,
    "title": "Bitcoin investor sentiment cools amid US shutdown fears, Fed policy jitters",
    "body": "Bitcoin’s push for $93,000 was stalled as professional traders stay cautious and the market’s focus remains pinned to gold’s rally, Federal Reserve policy and US macroeconomics.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57488275,
    "published": 1769465681000,
    "title": "Avalanche Gets First US ETF As VanEck Debuts AVAX Fund",
    "body": "Avalanche (AVAX) is the latest altcoin to get a spot ETF, allowing investors to gain exposure to the token alongside traditional equities.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 8,
        "NAME": "AVAX",
        "CATEGORY": "AVAX"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57488464,
    "published": 1769466223000,
    "title": "Gen Z Is Betting Big on Prediction Markets—Literally",
    "body": "A new survey suggests 31% of Americans—and far more young people—believe prediction markets will reshape culture.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57488546,
    "published": 1769466163000,
    "title": "Bitcoin Miners Power Down US Operations in Wake of Winter Storm",
    "body": "The fallout from the arctic blast that swept across the US is prompting some large-scale Bitcoin mining companies to shutter parts of their energy-intensive operations as electricity costs surge.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57488813,
    "published": 1769467262000,
    "title": "Russia Bans WhiteBIT, Deeming Crypto Exchange 'Undesirable' Over Ukraine Support",
    "body": "Russian authorities blacklisted WhiteBIT and its parent company over the crypto exchange's support of Ukraine’s war effort.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57489546,
    "published": 1769469640000,
    "title": "Anthropic CEO Says AI Progress Is Outpacing Society’s Ability to Control It",
    "body": "Anthropic CEO Dario Amodei is warning that AI risks are rising as regulation falls behind rapid advances and his company pushes ahead.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 57490709,
    "published": 1769473000000,
    "title": "Stablecoin market fall shows flight to gold, not Bitcoin: Santiment",
    "body": "Bitcoin has fallen nearly 30% since a major market crash in October, while gold and silver have soared to new highs.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57491458,
    "published": 1769475645000,
    "title": "US Institutions Step Back From Ethereum: Coinbase Premium Flashes Caution",
    "body": "Ethereum saw a sharp breakdown below the $2,800 level before quickly bouncing and attempting to reclaim $2,900, but the recovery still looks fragile. The sudden dip exposed how thin demand has become at key support zones, and while buyers are trying to stabilize the price, momentum remains weak. With volatility rising and sentiment turning defensive, Ethereum is entering a pivotal stretch where the next few weeks could define the broader trend for 2026. Bulls need to reclaim lost ground quickly, but repeated failures to hold higher levels suggest the market is still vulnerable to deeper downside if support breaks again. Related Reading: Bitcoin Indicator Falls Back To Post-Bear Market Levels: Investors Approach A Key Decision Point Adding to the pressure, a key US institutional demand proxy is flashing a warning sign. The 30-day simple moving average (SMA30) of the Ethereum Coinbase Premium Index has dropped to −0.08, reaching its lowest level since early 2023. This index tracks the pricing gap between Ethereum’s USD pair on Coinbase and the USDT pair on Binance, and deep negative readings typically indicate ETH is trading at a discount on Coinbase—often interpreted as weaker demand from US-based institutional buyers. This divergence matters because positive Coinbase premiums historically support sustained upside trends in Ethereum. With that premium now at a multi-year low, ETH’s attempt to recover above $2,900 is happening without strong confirmation from US “smart money,” increasing uncertainty around the next move. Coinbase Premium Hits Multi-Year Low A CryptoQuant report highlights a key warning signal for Ethereum: the Coinbase Premium Index, which measures the price gap between ETH/USD on Coinbase and ETH/USDT on Binance. Because Coinbase is widely viewed as a proxy for US institutional activity, a deeply negative premium typically indicates ETH is trading at a discount where “smart money” is most active, while Binance—often driven by global retail and whale flow—holds relatively stronger pricing. In practical terms, this spread helps reveal where demand is coming from and whether capital flows are supportive of a sustained trend. The current downside in the premium suggests a clear lack of buying pressure from US institutions. Even if global markets on Binance are stabilizing Ethereum’s price in the short term, the absence of American demand creates a bearish divergence. This matters because positive premiums underpin major ETH rallies; they signal the US-based accumulation and deep spot demand that drive price extensions. Without that backing, rallies are more likely to fade, and rebounds can become vulnerable to renewed selling pressure. The report flags this historic premium low as a warning: despite global resilience, the market lacks the US momentum that typically fuels a strong, immediate reversal. For bulls, the priority is not only reclaiming key price levels, but also seeing confirmation through premium recovery. Related Reading: Bitcoin Stuck In Bear Mode For 83 Days: Trend Pulse Confirms Structural Weakness Ethereum Attempts To Stabilize After Sharp Breakdown Ethereum is trading near $2,897 after a sharp breakdown below $2,800 that quickly reversed, allowing price to rebound back toward the $2,900 area. While the bounce suggests buyers are still defending the lower end of the current range, the overall structure remains weak. ETH has been trending lower from its late-2025 highs, and recent recovery attempts continue to fade before triggering a sustained reversal. Technically, Ethereum is still trading below its key trend averages, which keeps pressure on bulls. The 50-period moving average (blue) is positioned above the price and is beginning to roll over, signaling weakening short-term momentum. Related Reading: XRP Distribution Phase Continues, But Funding Rates Suggest Shorts Are Overextended The 100-period moving average (green) is also above current levels and sloping downward. This reinforces that traders are selling into rallies rather than following them with fresh demand. Together, these moving average bands have become a clear resistance zone that ETH must reclaim to shift the trend back in favor of buyers. At the same time, the 200-period moving average (red) remains below the price and continues to rise gradually, acting as a long-term structural support reference. As long as ETH holds above this curve, the move looks more like a corrective phase than a full macro breakdown. For bulls, the immediate objective is reclaiming $3,000, then pushing toward $3,150–$3,250 to challenge the 50/100 MA zone. If ETH fails to stabilize, downside risk remains open toward $2,750–$2,800. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum News|ETH|ethereum|Ethereum Analysis|Ethereum Coinbase Premium|Ethereum institutional adoption|ethereum price|Ethereum US|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57492666,
    "published": 1769479232000,
    "title": "Bitcoin Whales Are Back: 104K BTC Added As $1M Transfers Surge",
    "body": "Whale-sized Bitcoin holders are piling up more coins even as prices wobble. According to blockchain tracker Santiment, wallets holding at least 1,000 BTC added 104,340 BTC in recent weeks. Related Reading: Gold Becomes The Whale Safe Haven As Bitcoin Takes A Back Seat Reports note that total supply held by these large wallets hit 7.17 million BTC, the highest level since September 15, 2025. Mid-sized holders joined in too, adding roughly $3.21 billion worth of Bitcoin between January 10 and January 19. Small retail wallets moved the other way, offloading about 132 BTC, worth around $11.66 million. Whales Push Their Stakes Higher The numbers point to patient buying by big players. Large transfers of $1 million or more have climbed to a two-month high, which suggests heavy participants are active on the network again. According to Santiment, this kind of flow is often tied to institutions and wealthy investors moving coins between custody, exchanges, and private wallets. Some of those moves are driven by strategic choices; some are meant to secure holdings. Either way, a growing pile in whale hands changes where supply sits. Smaller holders are stepping back, while the so-called smart money increases exposure. Reports say mid-sized wallets — those holding between 10 and 10,000 BTC — were net buyers in the same stretch. 🐳 Large Bitcoin whales are accumulating at an encouraging pace, wallets with at least 1K $BTC have collectively accumulated 104,340 more coins (a +1.5% rise). Additionally, the amount of $1M+ daily transfers is back up to 2-month high levels. 🔗 Chart: https://t.co/CJOfiOBbWU pic.twitter.com/4loxDFtUdb — Santiment (@santimentfeed) January 25, 2026 Price Action And Market Signals Bitcoin’s price has not matched the upbeat on-chain action. Trading was around $87,730 at one point, with intraday swings between $86,500 and $87,500. The alpha crypto asset was down about 0.5% over 24 hours and roughly 5.4% over the prior week. Volumes have ticked up, though, which makes the case that some investors are stepping in at these levels. The picture is mixed: on-chain accumulation suggests a base is being formed, but macro headlines keep the market on edge. On-Chain Strength Versus Headlines A growing stash by big holders can support a future rally if external stress eases. Yet prices move on more than Bitcoin flows. Large transfers and rising accumulation mean demand exists under the surface, but that demand has yet to fully push the market higher. Macro Risks And Market Jitters Geopolitical worries are casting a long shadow. Reports say US President Donald Trump has moved warships toward areas of tension, and prediction markets show a significant chance that the US could strike Iran by June. Trade friction with Canada over recent auto rules has raised fresh political noise, and Polymarket shows the probability of a US government shutdown above 70%. These are real risks that can lift oil, rattle markets, and sap appetite for risk assets. Related Reading: Money Keeps Leaving: Bitcoin ETFs Shed $1.72 Billion In Just 5 Sessions Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|canada|crypto|fed|Santiment|tariffs|Trump|whales",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57492588,
    "published": 1769478933000,
    "title": "TikTok Backlash Fuels Sudden Surge in Little-Known Australian Social App",
    "body": "Upscrolled surged into the top 10 free apps after users accused TikTok of suppressing political content, straining UpScrolled’s servers.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      }
    ]
  },
  {
    "id": 57493053,
    "published": 1769480448000,
    "title": "North Korea–Linked Hackers Use Deepfake Video Calls to Target Crypto Workers",
    "body": "Hackers are using AI-generated video calls to impersonate trusted contacts and trick crypto workers into installing malware.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57493111,
    "published": 1769480430000,
    "title": "Ether price gained 200% the last time this global liquidity signal flashed",
    "body": "ETH whale accumulation and its alignment with a rare global liquidity signal could be a sign that Ether price is gearing up for another triple-digit rally.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57493779,
    "published": 1769482845000,
    "title": "Bitcoin Breaks Below $87K As Political Risk Spikes – Liquidations Reveal The Real Driver",
    "body": "Bitcoin is hovering at a critical demand zone as the market braces for the possibility of further downside. After losing the $87,000 level, price action remains fragile, with buyers struggling to regain control and sell-side pressure intensifying during rebounds. The broader risk-off mood frames the latest drop as a response to growing macro uncertainty rather than a purely technical move. Related Reading: Bitcoin Indicator Falls Back To Post-Bear Market Levels: Investors Approach A Key Decision Point Rising political instability in the United States appears to have acted as the near-term trigger. Prediction markets now place the probability of a new government shutdown at roughly 78%, with federal funding set to expire on January 30, 2026. As bipartisan negotiations stall, political risk is once again being priced into markets, weighing on sentiment and pushing traders toward defensive positioning. In this environment, Bitcoin broke below $87,000 and sparked a fast liquidation cascade. Data shows that around $170 million in leveraged long positions were wiped out within 60 minutes, with total long liquidations reaching roughly $320 million over the following four hours. Nearly $40 billion in total crypto market value vanished in a short span, highlighting how quickly volatility can expand when liquidity is thin. The speed and structure of the move suggest a derivatives-driven deleveraging event rather than broad spot capitulation. That distinction matters because it implies the next phase will depend on whether forced selling fades and real demand returns at this level. Liquidations And OI Reveal A Deleveraging-Led Drop A report from XWIN Research Japan explains that Bitcoin’s latest flush was likely amplified by a wave of forced liquidations in the derivatives market. Liquidations occur when futures positions fall below their maintenance margin and are automatically closed by exchanges to prevent further losses. In this case, a large share of the risk was concentrated in leveraged long positions, which are commonly used by short-term traders as well as hedging and arbitrage participants. Many of these longs were positioned for a renewed 2026 uptrend, making the market vulnerable once the price slipped under key support. When the decline accelerated, liquidation orders hit the books as market sells. Which can intensify downside moves in thin liquidity environments. To understand whether this was a structural shift or simply a leverage reset, XWIN points to Open Interest (OI). OI measures the total size of outstanding futures contracts and reflects how much leverage remains embedded in the market. When price falls alongside declining OI, it typically signals that position unwinds and liquidations are driving the move rather than a sudden change in fundamentals. On-chain estimates place aggregate OI near $28.4 billion. Well below the roughly $47 billion peak in late 2025, showing that leverage had already reduced. Still, OI has stabilized and slightly rebounded in early 2026, leaving room for volatility during corrections. The key is what comes next: whether selling fades, spot demand absorbs supply, and leverage normalizes as participation returns. Related Reading: Bitcoin Stuck In Bear Mode For 83 Days: Trend Pulse Confirms Structural Weakness Bitcoin Slides As Key Moving Averages Turn Into Resistance Bitcoin is trading near $87,820 after a steady decline that has kept the price pinned below $90,000. The structure shows BTC losing momentum after failing to hold the mid-January breakout toward $98,000. Followed by a sharp reversal that shifted market control back to sellers. Since that rejection, price has printed a sequence of lower highs, with selloffs accelerating each time BTC attempts to reclaim overhead levels. From a trend perspective, the moving averages highlight how the short-term regime has flipped bearish. BTC is now trading below the 50-period moving average (blue) near $90,300 and below the 100-period moving average (green) around $91,955, both of which are sloping downward. These levels are now acting as dynamic resistance, reinforcing the idea that traders are selling rallies. The 200-period moving average (red) sits close to $90,756, creating a tight resistance cluster between $90.3K and $92K. Bulls must reclaim this cluster to rebuild momentum. Related Reading: XRP Distribution Phase Continues, But Funding Rates Suggest Shorts Are Overextended Support is developing around the $87K–$88K zone, which has acted as a short-term demand pocket during prior pullbacks. If buyers fail to defend this area, downside risk opens toward $86,000 and potentially the mid-$84K range. BTC needs a clean reclaim of $90K, followed by consolidation above the moving-average band. Signaling that demand is returning with strength. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|Bitcoin Liquidation|Bitcoin news|bitcoin politics|Bitcoin risk|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57494324,
    "published": 1769484558000,
    "title": "Stablecoin Outflows Signal Capital Exit as Bitcoin Trades Flat",
    "body": "Top stablecoins have shed $2.2 billion in 10 days, in a sign investors are cashing out to fiat instead of waiting to buy the dip.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57494434,
    "published": 1769484921000,
    "title": "Fundstrat’s Lee sees a crypto comeback once precious metals cool",
    "body": "Fundstrat’s Tom Lee said crypto markets are being overshadowed by record gold and silver prices, but predicts a surge will come once precious metals' rally takes a pause.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57494408,
    "published": 1769484671000,
    "title": "Bitcoin job listings rise 6% in 2025, led by non-technical roles",
    "body": "The most in-demand, non-developer Bitcoin job openings included product manager, executive assistant, marketing manager, director and product designer.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57494903,
    "published": 1769486292000,
    "title": "Bitwise to launch onchain vaults via Moprho",
    "body": "The first vault strategy targets 6% annual percentage yield via over-collateralized lending pools, managed by Bitwise.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      }
    ]
  },
  {
    "id": 57494959,
    "published": 1769486476000,
    "title": "Polymarket strikes prediction market deal with major US soccer league",
    "body": "Polymarket will be the prediction market partner for the US Major League Soccer with the plan to offer “ways to engage more deeply with the game.”",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57495809,
    "published": 1769490032000,
    "title": "XRP Outlook For 2026: AI Model Signals New Record Ahead — Can Price Reach $6?",
    "body": "A new artificial intelligence (AI)–driven outlook for XRP is drawing attention after market analyst Sam Daodu shared projections generated by Claude AI, outlining how the cryptocurrency could perform through the rest of 2026. The forecast presents three distinct price paths for XRP, each shaped by how key factors such as exchange-traded fund (ETF) demand, regulatory clarity, and network activity evolve. Together, the scenarios provide a broad yet structured view of where the fifth-largest cryptocurrency could be headed. Potential 215% Rally Ahead For XRP According to Daodu, Claude AI uses a baseline XRP price of roughly $2.15 and builds its projections around whether market catalysts strengthen or weaken. The model suggests that ETF inflows, exchange balance trends, and growth on the XRP Ledger (XRPL) will be the primary signals determining whether XRP breaks higher, trades sideways, or slips lower by the end of 2026. Related Reading: Global Liquidity Says Bitcoin Is Extremely Undervalued – Here’s The ‘Real’ Figure In the most optimistic scenario, Claude AI predicts XRP would rise to between $4 and $6, representing a potential 215% increase from its current trading price of $1.90. This bullish outcome depends on ETF inflows accelerating beyond $5 billion while exchange balances continue to decline, indicating reduced sell-side pressure. Under this scenario, institutional accumulation would increase spot market demand, while clearer regulatory conditions would help improve overall market sentiment. Claude’s model suggests that once XRP decisively moves above the $3.20 resistance level, tightening liquidity across major trading platforms could magnify even modest buying activity. By late 2026, long-term holders limiting supply could further thin market depth, allowing prices to rise more quickly. However, this outcome would require unexpected positive catalysts and currently sits above what most AI models are forecasting. Base Case Prediction The base case presents a more measured outlook, with XRP trading between $2.00 and $3.00. In this scenario, ETF inflows remain steady but unspectacular, while adoption grows gradually rather than explosively. The model suggests XRP would likely maintain support above $2.00, helped by manageable escrow token releases and incremental improvements to the XRPL that support ongoing transaction growth. Price swings would likely remain contained, with accumulation happening quietly instead of through sharp rallies. By the end of 2026, XRP could settle near the midpoint of this range, reflecting balanced participation from both retail traders and institutional investors. Bearish Outlook Envisions $1.50 – $1.80 On the downside, Claude AI outlines a bearish scenario in which XRP drifts toward the $1.50 to $1.80 range. This outcome would likely unfold if ETF demand weakens and broader macroeconomic pressures intensify. A sustained drop below the $2.00 level could then lead to extended consolidation around the $1.60 support zone. While network activity on the XRPL might continue, momentum in price action would fade as market participants wait for clearer catalysts. Related Reading: Gold Hits Record $5K While Bitcoin Struggles To Keep Pace Ultimately, Claude AI’s forecast points to relative stability around $2.15 in the near term for the cryptocurrency, at least through January, with larger price movements dependent on ETF market inflows exceeding the $5 billion mark. Daodu further pointed out that Claude’s outlook sits between ChatGPT’s more cautious stance and Grok’s comparatively optimistic projections, offering what he describes as a realistic middle ground rather than an extreme outcome. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|crypto|crypto market|crypto news|xrp|xrp news|XRP Price|XRP Price Forecast|XRP price news|XRP Price Prediction|XRP price prediction 2026",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57496469,
    "published": 1769492125000,
    "title": "Viral AI assistant 'Clawdbot' risks leaking private messages, credentials",
    "body": "A security vulnerability in the Clawdbot AI assistant has exposed hundreds of servers, leaking API keys and other sensitive information due to misconfigured proxies, cybersecurity professionals warn.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 57496832,
    "published": 1769493645000,
    "title": "XRP, Ethereum Now ‘Undervalued’ On MVRV, Says Santiment",
    "body": "On-chain analytics firm Santiment has pointed out how XRP and Ethereum are among coins sitting in the MVRV Ratio’s “undervalued” zone. 30-Day MVRV Is Negative For XRP & Ethereum In a new post on X, on-chain analytics firm Santiment has talked about where some notable cryptocurrencies like XRP and Bitcoin currently sit from the perspective of the 30-day Market Value to Realized Value (MVRV) Ratio. The MVRV Ratio is a popular indicator that tells us how the market cap of a given digital asset compares against its Realized Cap. The latter is an on-chain capitalization model that calculates the asset’s total value by assuming that the value of each individual token is equal to the spot price at which it was last transacted on the network. Related Reading: Dogecoin Wedge Breakout Could Be “Powerful,” Analyst Says In short, what the Realized Cap represents is the total amount of capital that the cryptocurrency’s investors have put into it. In contrast, the usual market cap is just the value that holders are carrying in the present. Since the MVRV Ratio takes the ratio of the two, it essentially provides a look into profitability among investors as a whole. In the context of the current topic, the MVRV Ratio of only a particular segment of traders is of interest: those who purchased within the past month. Below is the chart for this version of the MVRV Ratio shared by Santiment that shows its trend across five top coins: Bitcoin, Ethereum, XRP, Cardano, and Chainlink. As is visible in the graph, the 30-day MVRV Ratio has dropped into the negative region for all five of these cryptocurrencies recently, indicating that returns of the monthly buyers have gone into the red. The analytics firm considers assets to be “undervalued” when this condition forms. “A coin having a negative percentage means average traders you’re competing with are down money, and there is an opportunity to enter while profits are below the normal ‘zero-sum game’ level,” explained Santiment. Not all tokens with a negative value on the indicator provide an equal opportunity, however. “The lower a coin’s 30-day MVRV is, the less risk there is in opening or adding on to your position,” noted the analytics firm. Related Reading: Bitcoin Supply Overhang Likely To Cap Rallies Above $98,400, Glassnode Says Down to a value of -5%, Santiment defines cryptocurrencies to be in a “mildly undervalued” zone. Bitcoin has a 30-day MVRV value of 3.7%, so it falls inside this territory. Meanwhile, XRP and Ethereum have the metric sitting at -5.7% and -7.6%, putting them inside a stronger undervalued region. Out of the tokens in the chart, Chainlink’s 30-day buyers are currently in the most amount of pain with losses of 9.5%. XRP Price XRP dropped to a low of $1.8 on Sunday, but the asset has since bounced back above $1.9. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|ETH|ethereum|Santiment|xrp|XRP MVRV|XRP Undervalued|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57496697,
    "published": 1769493091000,
    "title": "Bitcoin and ether volatility trading gets easier with Polymarket's new contracts",
    "body": "Polymarket has launched new prediction markets tied to Volmex's bitcoin and ether 30-day implied volatility indices.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Ethereum News|Polymarket|Volatility|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57496694,
    "published": 1769493011000,
    "title": "A New Pact With Shanghai Propels Hong Kong As Asia’s Premier Gold Hub",
    "body": "Hong Kong's landmark MOU with Shanghai Gold Exchange creates a cross-border clearing platform, cementing its role as Asia's gold trading hub with global ambitions.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  }
]