[
  {
    "id": 56375849,
    "published": 1766721193000,
    "title": "Ethereum unlikely to reach new highs in 2026: Ben Cowen",
    "body": "If Ether manages to reclaim its all-time high in 2026, it may just be a “bull trap,” says crypto analyst Ben Cowen.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56377070,
    "published": 1766723110000,
    "title": "Crypto sentiment holds ‘Extreme Fear’ for 14th straight day",
    "body": "The Crypto Fear & Greed Index is hovering at levels lower than during the shock FTX collapse in late 2022, despite Bitcoin trading at roughly five times the price.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56387063,
    "published": 1766737729000,
    "title": "Aave governance vote ends in rejection after community pushback",
    "body": "The failed vote highlights deeper tensions over token value capture, governance power and whether DAO structures can effectively manage protocol identity.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56388253,
    "published": 1766739186000,
    "title": "Trust Wallet will cover $7M lost in Christmas Day hack, CZ says",
    "body": "The malicious Trust Wallet extension has also been exporting users’ personal information, pointing to potential insider activity, according to cybersecurity company SlowMist.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 56389025,
    "published": 1766740500000,
    "title": "Dogecoin Is Repeating Its 2020 Accumulation Cycle, Analyst Says",
    "body": "Crypto analyst Cryptollica (@Cryptollica on X) is arguing that Dogecoin’s weekly chart is doing that familiar thing again: carving out a rounded base, bleeding off volatility, resetting momentum and quietly setting up what he frames as the “calm before the storm.” Or, at least, that’s the pitch. In a Dec. 23 TradingView analysis titled “DOGE: The Cycle Repeats (1W Timeframe),” Cryptollica calls the current structure a “textbook fractal setup,” pointing to four prior “structural points (1, 2, 3, 4)” across DOGE’s longer-term history and claiming the market is now sitting at “Point 4.” The core claim is less about a single indicator and more about pattern recognition: “the structure is rhyming perfectly with the pre-bull run accumulation phases of the past.” Will Dogecoin Repeat History? Cryptollica frames Zones 1 and 2 as prior “boredom phases” — the type of long, dead-feeling stretches that, in hindsight, look like accumulation. “Zones 1 & 2: These were the ‘boredom phases’ where volatility died, and smart money accumulated,” the post reads. Zone 2, in particular, is described as “the launchpad for the massive 2021 parabolic run.” The current period, which the analyst labels Zone 4, is presented as a near-mirror: “We are seeing the exact same rounding bottom formation. The price is stabilizing, forming a heavy base just like it did before the previous explosions.” Related Reading: Dogecoin Price Could Rally If It Reclaims This Fibonacci Level That’s the structural argument. The momentum argument is RSI, and Cryptollica is unusually direct about how they’re treating it: “Look at the RSI indicator at the bottom. The red line (~32. level) acts as a historical floor.” They add that “every single time the weekly RSI touched or hovered near this baseline (Points 1, 2, and 3), it marked a macro bottom.” Right now, in their read, “the RSI has reset back to this critical support level,” which they interpret as seller fatigue: “It indicates that the sellers are exhausted and the momentum is primed to flip.” If you’ve been around crypto markets long enough, you’ve seen this exact rhetorical move: the past as a template, the present as a rhyme, the future as a pending punchline. Cryptollica tries to pre-empt the eye-roll by insisting the setup isn’t coincidence: “This isn’t just random noise; it’s a cyclical reset.” The post argues DOGE is sitting in what they call “the ‘Golden Pocket’ for accumulation,” and suggests that if the 2020-era analog holds “like it did in 2020 (Zone 2)” then today’s price action is basically quiet loading time. The editorial machinery at TradingView itself leaned in. The platform responded publicly on Dec. 23 that the publication “has been selected as one of our Editor’s Picks and will be featured on the Home Page,” adding a line that reads like the house style for community encouragement: “Good trading plans are valuable, regardless of their outcomes, and particularly rewarding when they succeed.” Cryptollica replied in kind: “TradingView, thank you.” Related Reading: Dogecoin: Why This One Price Level Is Drawing All the Attention Still, one of the more useful parts of this whole thread is a cautionary comment from another user, ZarinSyed, who essentially says: yes, the fractal is interesting, no, that doesn’t mean it’s fate. “The fractal analysis is compelling,” they wrote, “however, while the setup does resemble prior accumulation phases, it’s worth noting that fractals are not deterministic — macro conditions and liquidity flows can alter outcomes.” They put a practical marker on what “confirmation” would look like in their view: “Watching DOGE’s weekly close above the $0.15–$0.17 range could validate the bullish thesis.” And they don’t let RSI off the hook, either. The ~32 level may signal exhaustion, they concede, but “momentum confirmation often requires a sustained move above the midline (50). Until then, the risk of prolonged sideways action remains.” They add a market-structure wrinkle that matters for 2026-style crypto narratives: “Unlike 2020, DOGE now trades in a more mature market with ETF-driven institutional flows. Retail-driven fractals may play out differently.” So what does it mean, in plain trader terms, without pretending the chart is prophecy? Cryptollica is making a high-conviction, weekly-timeframe claim that DOGE is back in an accumulation “buy zone,” with RSI near a historical floor and a rounded base that resembles prior cycle setups. ZarinSyed is basically saying: fine, now prove it, ideally with a breakout and follow-through, and keep an eye on relative metrics like DOGE/BTC dominance if you want to know whether this is a DOGE story or just another alt wobble. At press time, DOGE traded at $ Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56390741,
    "published": 1766742824000,
    "title": "Trust Wallet users lose $7 million to hacked Chrome extension",
    "body": "Changpeng Zhao, a co-founder of Binance, which owns the utility, said the losses will be reimbursed.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Wallets|Crime|Trust Wallet|Binance|Exploits|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 56390806,
    "published": 1766742605000,
    "title": "Inside the Swiss city where you can pay for almost everything in Bitcoin",
    "body": "From McDonald’s to municipal taxes, Lugano is proving that Bitcoin adoption is not about predicting the future; it is about building the infrastructure to handle it today.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56391757,
    "published": 1766744100000,
    "title": "AI bubble risks in 2026: What’s the potential impact on Bitcoin price?",
    "body": "Tether CEO Paolo Ardoino warned an AI sector correction could spill over into crypto markets in 2026, with some analysts projecting BTC to drop to as low as $65,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56393441,
    "published": 1766746878000,
    "title": "Uniswap's token burn, protocol fee proposal backed overwhelmingly by voters",
    "body": "The proposal, which transforms UNI into a value-accruing asset, received more than 125 million votes in support with just 742 dissenting.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Uniswap|Governance|dexs|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 53,
        "NAME": "UNI",
        "CATEGORY": "UNI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56393445,
    "published": 1766746811000,
    "title": "Flare Launches New Way For XRP Investors To Earn",
    "body": "Flare Network has rolled out a new yield-focused product in collaboration with Upshift and Clearstar that offers XRP holders a way to earn returns without selling their XRP holdings. XRP’s price action has been bearish in recent weeks, and that calm has carried into the past trading sessions. The cryptocurrency is trading around $1.87, after staying confined between roughly $1.83 on the downside and $1.88 on the upside in the latest session. This subdued price behavior has preoccupied recent discussions, but development around its ecosystem has continued quietly in the background. Flare Launches New XRP Product Flare Network has officially introduced a new product designed to expand what XRP holders can do with their cryptocurrencies besides holding or trading. The product, which is called earnXRP, is positioned as the first on-chain yield solution that is fully denominated in XRP, and at the same time, addresses a long-standing gap in the ecosystem where earning yield typically required moving into stablecoins or other assets. Related Reading: The Decision That Could Change Everything For XRP Investors The launch is built around Flare’s FAssets system, which allows XRP to be represented on the network as FXRP on a one-to-one basis. To participate in earnXRP, holders deposit FXRP (XRP represented 1:1 on Flare) directly into an on-chain vault, where those assets are deployed across yield-generating strategies. In return, users receive a receipt token that tracks their deposited FXRP along with any yield accrued over time, with earnings remaining fully denominated in XRP. Users receive earnXRP, which represents the user’s deposited FXRP plus any yield generated over time. This structure removes much of the complexity typically associated with DeFi participation. Strategy execution, rebalancing, and compounding are handled within the vault. Users can also request withdrawals at any time, a process where their earnXRP tokens are burned, and FXRP is returned to their wallet. Muted Price Reaction For The Altcoin Flare’s earnXRP is one of the few avenues XRP holders can participate in DeFi. FXRP is a 1:1 ERC-20 representation of XRP that unlocks DeFi utility not possible on the XRP Ledger alone. Related Reading: XRP Price Falls To Critical Support Level, Is It Time To Panic? “Only 0.1% of XRP supply is utilized in DeFi, despite it being the 5th largest cryptocurrency by market cap. Users have not had an easy way to capture sustainably high returns. We’re excited to work with Flare and Clearstar to unlock XRP yield using the new Flare XRP Yield vault,” said Ethan, Growth Lead at Upshift. Despite the significance of the launch from a utility standpoint, the immediate market response has been limited. XRP is still trading within its recent range, with the price still below $1.9 and showing little reaction to the announcement. This response shows that the altcoin is currently heavily influenced by broader market conditions and macro sentiment, which have weighed on price action across the entire sector. Featured image from Pngtree, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|Clearstar|DeFi|flare network|Flare XRP Yield vault|FXRP|Ripple|Stablecoins|Upshift|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 122,
        "NAME": "FLR",
        "CATEGORY": "FLR"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56395828,
    "published": 1766750114000,
    "title": "Memecoins go from Christmas cheer to cold reality, sinking 65% in a year",
    "body": "Once a barometer of retail hype, memecoins are closing the year with shrinking liquidity, weaker participation and fading speculative momentum.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 56397120,
    "published": 1766752240000,
    "title": "Saylor Reveals What Will Drive Bitcoin Price To New ATHs – It’s Not What You Think",
    "body": "Bitcoin price dynamics heading into the next market cycle are being reframed by Michael Saylor, who argues that the forces capable of pushing Bitcoin to new all-time highs have little to do with speculation, retail enthusiasm, or ETF-driven flows. Instead, Saylor’s outlook positions Bitcoin price appreciation as the outcome of a deeper structural transition that is unfolding quietly within the banking system. Michael Saylor On Bitcoin Price’s Structural Shift As the market looks toward 2026, Michael Saylor’s thesis on Bitcoin price action focuses on a structural shift away from trader-driven dynamics toward regulated financial institutions, a transition that could fundamentally reshape how capital engages with Bitcoin at scale. For most of its history, Bitcoin price discovery has been dominated by cyclical trading behavior, leverage, and sentiment-driven momentum. Related Reading: Why The Current XRP Valuation Doesn’t Make Sense Even milestones such as spot Bitcoin ETFs, while broadening access, largely remain confined to traditional capital markets. Saylor’s view departs from this model by highlighting Bitcoin’s gradual integration into bank balance sheets, where valuation is driven by utility, collateralization, and long-term capital allocation rather than short-term market cycles. Recent developments underscore this shift. A growing number of major US banks have begun offering Bitcoin-collateralized loans, a move that signals a reclassification of Bitcoin from a high-volatility trading asset to a recognized form of financial collateral. Lending against Bitcoin reflects institutional confidence in its liquidity, custody standards, and long-term value stability. In practical terms, this positions Bitcoin alongside assets that are suitable for credit creation rather than short-term speculation. Once Bitcoin is integrated into lending structures, treasury operations, and institutional risk models, demand characteristics change materially. Capital deployed through these channels is not reactive to short-term price fluctuations. It is strategic, compliance-driven, and designed for multi-year horizons. This type of demand absorbs supply consistently, reinforcing scarcity dynamics already embedded in Bitcoin’s fixed issuance model. As a result, Bitcoin price appreciation becomes a function of sustained capital allocation rather than episodic market rallies. Banking Infrastructure And The New Ceiling For Bitcoin Price Saylor identifies 2026 as the period when the impact of banking adoption becomes fully visible. Major financial institutions such as Charles Schwab and Citigroup, planning to roll out Bitcoin custody and related services, point to a broader alignment between Bitcoin and regulated financial infrastructure. Related Reading: $130 Million XRP Fumble: Analyst Reveals What Went Wrong Custody plays a pivotal role in this process. When banks custody Bitcoin, they unlock the ability to embed it across wealth management platforms, corporate treasury strategies, and secured lending products. This dramatically expands Bitcoin’s addressable capital base by enabling participation from institutions previously constrained by regulatory, operational, or fiduciary limitations. As banking participation deepens, Bitcoin price behavior is likely to evolve. Volatility driven by leveraged trading and speculative positioning diminishes in relative importance, while long-term balance-sheet accumulation becomes a dominant force. In this environment, according to Saylor, Bitcoin’s new all-time highs will not be the product of sudden euphoria but the result of sustained absorption by institutions operating at scale. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56399481,
    "published": 1766755585000,
    "title": "Tokenized commodities near $4B, as gold extends all-time rally",
    "body": "Tokenized commodities are increasing amid growing investor demand for more accessible onchain financial products, following new all-time highs for gold and silver.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 56400675,
    "published": 1766757663000,
    "title": "The Year in XRP 2025: New Highs After 7 Years as Ripple's SEC Case Finally Ends",
    "body": "Ripple had a busy 2025, highlighted by acquisitions, the end of a years-long court battle, and a burst to new heights for XRP.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56400647,
    "published": 1766757628000,
    "title": "Bitcoin Funds See Significant Net Outflows Heading Into Year-End – What’s Going On?",
    "body": "The high tide of liquidity that has recently supported Bitcoin prices appears to be receding rapidly. The market is now grappling with significant net outflows, as data confirms that investment flows have turned decisively negative. This shift represents a stark turnaround in market dynamics, where selling pressure is currently overwhelming buying interest across major platforms. Why Markets Move Before Narratives Catch Up In an X post, a trader and investor in stocks and crypto, WealthManager, revealed that since December 8th, Bitcoin has recorded approximately $716 million in net outflows. Over the past two weeks, flows have been dominated almost entirely by outflows, reflecting a market that has lost momentum rather than conviction. Related Reading: New Bitcoin Crash Incoming? Twenty One Capital Moves 43,500 BTC Amid Major Losses Currently, the cryptocurrency market is not the preferred destination for momentum-driven capital. That momentum has rotated into gold, silver, and broader metals, but the rotations are temporary by nature. However, the opportunity remains in crypto, and the momentum will shift back into the sector at some point. “The lower BTC goes, the bigger the opportunity would become,” WealthManager noted. Analyst Cipher2X has offered an insight into why he is accumulating Bitcoin ahead of 2026. According to Cipher2X, BTC has never waited for perfect conditions to do its most important work. It builds its foundations when liquidity is tight and expectations are low. At this stage, price action is misleading, but the structure is not. On-chain data has shown that supply is increasingly locked up with long-term holders, while access to BTC through regulated channels is becoming routine rather than exceptional. At the same time, micro uncertainty continues to reinforce BTC’s role as a hedge against policy risk, not as a speculative bet on growth. This setup is the kind of environment where BTC intends to move sideways, frustrate the traders, and quietly shift ownership from impatient hands to committed ones. Cipher2X explains that the purpose of accumulating BTC isn’t a short-term catalyst, but because the next regime tends to reward those who have positioned early, not those who have reacted late. 2026 isn’t about the hype; it’s about who was already holding the asset. What Falling Volatility Says About Bitcoin’s Maturity The Bitcoin chart has shown the implied volatility on the BTC options over the past few years. A full-time crypto trader and investor, Daan Crypto Trades, pointed out that aside from a few short spikes of volatility, there’s a clear trend down on this part. BTC is maturing as its market cap is growing over time, and the market is becoming more institutionalized. Related Reading: Bitcoin’s Long Game Is Winning, Even If The Short Term Looks Messy—CEO Daan concluded that the days of seeing multiple 10%+ candles in a row are behind us. Presently, if a single 10% move in one day happens, it would already be considered a big exception. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56403915,
    "published": 1766762593000,
    "title": "Coinbase named a top three 2026 fintech pick at Clear Street",
    "body": "The crypto exchange’s tokenization, AI tools, and stablecoin revenue help it stand out in ‘transition year’ for crypto equities, said Clear Street's Owen Lau.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56405403,
    "published": 1766764893000,
    "title": "Bitcoin sinks below $87,000 as crypto assets slide, metals soar post-Xmas",
    "body": "Gold, silver, platinum and copper all surged to new records as metals — not bitcoin — attracted capital on the debasement trade and geopolitical tension.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Metals|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56405695,
    "published": 1766765081000,
    "title": "Price predictions 12/26: BTC, ETH, BNB, XRP, SOL, DOGE, ADA, BCH, LINK, HYPE",
    "body": "Bitcoin and several major altcoins attempted to start a relief rally, but higher levels continue to attract strong selling by the bears.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 12,
        "NAME": "BCH",
        "CATEGORY": "BCH"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56409308,
    "published": 1766770275000,
    "title": "Coinbase Says Former Agent Arrested In India Over Exchange Hack",
    "body": "Coinbase Global Inc. Chief Executive Officer Brian Armstrong said that a former customer service agent for the largest US crypto exchange was arrested in India, months after hackers bribed customer service representatives to gain access to customer information.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NMS:COIN",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 56409995,
    "published": 1766772000000,
    "title": "Crypto ETFs set to explode higher in 2026, analysts say",
    "body": "Regulatory clarity in the United States and the likelihood of falling interest rates will push the crypto ETF market higher in 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56417456,
    "published": 1766783754000,
    "title": "Etheruem’s tokenization role takes focus as Tom Lee outlines bullish outlook",
    "body": "Fundstrat’s head of research said institutional tokenization supports a $7,000–$9,000 Ether price in early 2026 and a longer-term case for $20,000.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      }
    ]
  },
  {
    "id": 56418385,
    "published": 1766785143000,
    "title": "Bitmain slashes ASIC prices amid mining industry turmoil: Report",
    "body": "Discounts and bundle deals were offered to mining operators, as 2025 ends on a bad note for the crypto market and the mining industry.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56422717,
    "published": 1766792788000,
    "title": "Ethereum's TVL could skyrocket '10X' in 2026: Sharplink CEO",
    "body": "A surge in stablecoins, tokenized RWAs and growing sovereign wealth fund interest could drive a major increase in Ethereum’s TVL in 2026, Sharplink’s co-CEO said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56423117,
    "published": 1766793630000,
    "title": "Bitcoin Supply Overhang: 6.6 Million BTC Bought Above Current Price",
    "body": "On-chain data shows a chunk of the Bitcoin supply has its cost basis above the current spot price, which could potentially shape volatility if BTC rebounds. Bitcoin Supply Overhang Could Dictate Volatility & Selling Pressure As pointed out by CryptoQuant community analyst Maartunn in a new post on X, over 6.6 million BTC is being held above the latest spot price of the cryptocurrency. The on-chain indicator of relevance here is the “Supply In Loss,” which measures, as its name suggests, the total amount of Bitcoin that’s currently carrying some net unrealized loss. Related Reading: Bitcoin Extreme Fear Streak Extends To 13 Days On Christmas The metric works by going through the transaction history of each token in circulation to determine the price at which it was last transacted on the blockchain. If this previous transfer price was more than the current spot price for any coin, then that particular token is considered to be in a state of loss. The Supply In Loss adds up all coins fulfilling this condition to find the total situation on the network. A counterpart indicator called the Supply In Profit accounts for the supply of the opposite type. Now, here is the chart shared by Maartunn that shows the trend in the Bitcoin Supply In Loss over the last few years: As displayed in the above graph, the Bitcoin Supply In Loss shrunk to a value of zero as the asset’s price set its all-time high (ATH) above $126,000 back in October, but with the market downturn that has followed since then, the indicator’s value has shot up. Today, around 6.6 million tokens of the cryptocurrency sit below cost basis, equivalent to a third of the BTC supply in circulation. The recent highs in the Supply In Loss represent the highest degree of pain in the market since 2023. In another X post, the analyst has shared the chart for another Bitcoin indicator, this one called the UTXO Realized Price Distribution (URPD). The URPD contains information about how much BTC was bought last at each of the levels that the asset has visited in its history. Looks like a significant portion of the supply sits above the spot price | Source: @JA_Maartun on X From the chart of the URPD, it’s visible how the Bitcoin supply that’s in loss is distributed across the various levels right now. A few levels are particularly prominent in the degree of supply that they carry, while some others are notably thin with coins. Generally, investors who are in loss look forward to a retest of their cost basis so that they can get their money “back.” Once this happens, some of these hands decide to exit, fearing that BTC will go down again in the near future. This selling can make large supply clusters above the spot price, potential points of volatility. Related Reading: Bitcoin Price Trading Near ‘Fair Value,’ Says On-Chain Model Considering that a large portion of the supply is underwater right now, a venture back to higher levels could be met with selling pressure for Bitcoin. BTC Price Bitcoin has made some recovery during the past day as its price has returned to $88,600. Featured image from Dall-E, CryptoQuant.com, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin Loss|Bitcoin Overhang|Bitcoin Supply In Loss|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56425000,
    "published": 1766797214000,
    "title": "Gemini Poll Finds Over 70% Of Investors Predict XRP Below $2 By Year’s End",
    "body": "As the year draws to a close, XRP investors are increasingly adopting a bearish outlook, anticipating that the altcoin will remain below the critical $2 threshold. XRP Forecasts Dipped A recent poll conducted by cryptocurrency exchange Gemini, running from December 12 to 23, reveals that 73% of investors predict XRP will finish the year between $1.50 and $2.00, suggesting a muted conclusion for the altcoin’s performance in 2025. Just weeks prior, market sentiment was more optimistic, with around 38% of traders expecting XRP to rally to a range of $2.00 to $2.50 by December 31. However, that figure has since dropped to 28%, reflecting a significant decline in confidence. Related Reading: Bitcoin Correction Timeline: Analyst Predicts Potential Bottom In October 2026 The possibility of the cryptocurrency exceeding $2.50 appears almost non-existent, as only about 4% of respondents foresee it reaching the $2.50 to $3.00 range, and a similar 4% predict it could surpass $3.00. The consensus of 73% predicting an XRP finish between $1.50 and $2.00 marks an increase from the 63% recorded earlier in the poll. This growing alignment among poll participants indicates that they are consolidating around this range as the most likely scenario. Furthermore, the sentiment towards higher price levels has significantly shifted. The percentage of voters anticipating a rally into the mid-$2 range has dwindled to a mere 4%, reflecting dwindling confidence after several failed attempts to break through resistance levels. Even the outlook for the altcoin’s price to drop below $1.50 has risen slightly to 7%, up from 6%, although most believe a sharp sell-off is unlikely. Rising Supply From Early Investors This prevailing sentiment aligns with Futures data indicating a prevalence of aggressive sell orders, while the slow accumulation of XRP in exchange-traded funds (ETFs) at a pace of $30 to $50 million daily cannot keep up with profit-taking and risk reduction activities in the market. On-chain data reveals that significant realized gains have been secured as XRP approached its recent highs. For instance, a long-term holder who initially acquired the altcoin around $0.40 sold over 350 million tokens at approximately $2.00, reaping an estimated profit of $721 million. Related Reading: Ethereum Fails To Surpass $3,000: Predictions For The Final Days Of The Year With many early investors reportedly cashing out at the $2 level, there has been minimal support for dip-buying to bolster the price, keeping it in the current range between $1.7 and $1.8 recorded in the week. Experts suggest that when the supply increases from long-term holders, whose initial investments were made at $0.40 to $0.60, it creates a resistance ceiling that is challenging to break without substantial new demand entering the market. At the time of writing, XRP was trading at $1.830. The altcoin has recorded major losses in all time frames, with a year-to-date decline of 15%, in line with the broader market’s performance. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP News|crypto|crypto market|crypto news|xrp|XRP ETF News|XRP ETFs|xrp news|XRP poll|XRP Price Forecast|XRP price news|XRP price predictions|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]