[
  {
    "id": 58096177,
    "published": 1771298227000,
    "title": "Philippines' Digital Bank Maya Looks to US Market for Up to $1B IPO",
    "body": "A U.S. venue could offer deeper capital access as investors weigh the bank’s regulated crypto business against its core banking operations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58096404,
    "published": 1771298554000,
    "title": "Crypto phishers are sending letters to Trezor, Ledger users again",
    "body": "It's not the first time scammers have used snail mail to target victims of hardware wallet company data breaches from years ago.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      }
    ]
  },
  {
    "id": 58097423,
    "published": 1771301917000,
    "title": "Kraken sponsors Trump Accounts in Wyoming, citing crypto alignment",
    "body": "The Wyoming-based crypto exchange said it wanted to give back to the state it calls home, which it picked due to its \"responsible” approach to crypto regulation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58097409,
    "published": 1771301876000,
    "title": "Crypto.com nabs AI certification as it steams ahead with AI expansion",
    "body": "Crypto.com is leaning into AI services as one of three main business lines for the company, joining a mad rush to adopt the tech.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 58097620,
    "published": 1771302646000,
    "title": "Bitcoin’s Long-Term Holders Show Signs of Strain After February Sell-Off",
    "body": "Bitcoin's long-term holders show weakening accumulation, with on-chain data pointing to $54,000 as the next support if $65,000 breaks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58097574,
    "published": 1771302491000,
    "title": "XRP Price Action Tightens As Traders Watch For Breakout Or Breakdown",
    "body": "XRP price extended losses and traded below $1.520. The price is now consolidating losses but faces hurdles near $1.5150 and $1.520. XRP price started another decline and traded below the $1.550 zone. The price is now trading above $1.450 and the 100-hourly Simple Moving Average. There is a short-term bullish trend line forming with support at $1.4720 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move down if it stays below $1.550. XRP Price Trims Most Gains XRP price failed to stay above $1.60 and extended its decline, like Bitcoin and Ethereum . The price declined below $1.550 and $1.520 to enter a short-term bearish zone. The price even extended losses below $1.50. A low was formed at $1.4437, and the price is now consolidating losses. There was a minor upward move above the 23.6% Fib retracement level of the downward move from the $1.6713 swing high to the $1.4437 low. The price is now trading above $1.450 and the 100-hourly Simple Moving Average. There is also a short-term bullish trend line forming with support at $1.4720 on the hourly chart of the XRP/USD pair. If there is a fresh recovery move, the price might face resistance near the $1.5150 level. The first major resistance is near the $1.520 level. A close above $1.520 could send the price to $1.550 and the 50% Fib retracement level of the downward move from the $1.6713 swing high to the $1.4437 low. The next hurdle sits at $1.5840. A clear move above the $1.5840 resistance might send the price toward the $1.620 resistance. Any more gains might send the price toward the $1.650 resistance. The next major hurdle for the bulls might be near $1.6750. Another Drop? If XRP fails to clear the $1.520 resistance zone, it could start a fresh decline. Initial support on the downside is near the $1.460 level or the trend line. The next major support is near the $1.440 level. If there is a downside break and a close below the $1.440 level, the price might continue to decline toward $1.380. The next major support sits near the $1.350 zone, below which the price could continue lower toward $1.3250. Technical Indicators Hourly MACD – The MACD for XRP/USD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $1.470 and $1.440. Major Resistance Levels – $1.520 and $1.550.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58098222,
    "published": 1771304445000,
    "title": "46% Of Bitcoin Supply Now In Loss—What It Could Take For A Bottom",
    "body": "On-chain data shows almost half of all Bitcoin is currently underwater, representing overhead supply that might need to be absorbed before a price bottom. Around 9.31 Million Bitcoin Is Now Being Held At A Loss In a new post on X, CryptoQuant community analyst Maartunn has talked about why a true Bitcoin bottom takes time to form. To illustrate his point, Maartunn has shared a chart for the Bitcoin Supply In Loss, an indicator that measures, as its name suggest, the total amount of the cryptocurrency that’s being held at a net unrealized loss. As is visible in the above graph, the Bticoin Supply In Loss shrunk down to zero as the asset set its new all-time high (ATH) back in October. Since then, however, the metric’s value has sharply expanded as the cryptocurrency has gone through its bearish reversal. Related Reading: Bitcoin NUPL Back In Hope/Fear Region: What Happens Next? Today, the indicator is sitting at 9.31 million BTC, which is the highest that it has been since the 2022 bear market. In terms of supply percentage, this amount is equivalent to 46% of all tokens in circulation. Generally, holders in loss look forward to retests of their cost basis level so that they can exit with their capital back. Currently, there would be a significant amount of such investors. “A large share of holders are waiting to sell at breakeven or a small profit,” noted the analyst. Another on-chain indicator called the UTXO Realized Price Distribution (URPD) showcases which levels exactly the underwater hands bought their Bitcoin at. As displayed in the indicator’s chart, the Bitcoin loss supply is particularly clustered between the $80,000 to $95,000 and $105,000 to $120,000 ranges. Given the distance that the current BTC price has to these levels, it’s possible that traders who bought inside the ranges will stay underwater in the near future. Upward moves for the asset would naturally be met with selling pressure from these investors looking to cut their losses. “That overhead supply must be absorbed and redistributed to stronger hands before a durable bottom can emerge,” explained Maartunn. Related Reading: Bitcoin On-Chain Heatmap Shows All Major Metrics In The Red During the previous bear market, the Bitcoin Supply In Loss dropped to even lower levels than now and the market observed a long phase of consolidation before this transfer of loss supply to more resolute hands could occur. It now remains to be seen how long the cryptocurrency will take to reach a floor this time around. BTC Price Bitcoin has taken to sideways movement since its recovery from the $60,000 low as its price is still trading around $68,600. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin Bottom|Bitcoin Loss Supply|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58098800,
    "published": 1771306220000,
    "title": "Dogecoin Sees Weekly Bearish Cross: Bottom Or Breakdown Next?",
    "body": "Dogecoin is flashing a rare weekly “bearish cross” just as traders debate whether last week’s $0.08 washout was the cycle’s reset or merely the first leg lower. The setup matters beyond DOGE itself because memecoin flows are increasingly being treated as a proxy for risk appetite across crypto. Is The Dogecoin Bottom In? A chart shared by Charting Guy shows the 20-week EMA crossing below the 200-week EMA, a technical event he argues has historically aligned with DOGE capitulation. “DOGE typically bottoms around when the 20 weekly EMA crosses below the 200 weekly EMA. That happened last week” he wrote, adding that he “increased my position by 50% at the lows” and that his community received buy alerts. That framing is colliding with more cautious range-based reads from other analysts watching spot structure instead of the moving-average signal alone. Related Reading: Dogecoin Is Now In The ‘Maximum Opportunity / Minimum Risk’ Zone: Crypto Analyst Daan Crypto Trades described the post-dip bounce as constructive, but explicitly framed it as range trade rather than trend confirmation. “DOGE Decent price action here over the past few days after the big $0.08 test last week. Currently seeing this $0.08-$0.13 area as a large range,” he posted. “Anything above that point would make me confident in a further move towards the Daily 200MA/EMA. Currently near the middle so hard to really assume a direction here the way it’s trading.” On his chart, DOGE/USDT was sitting around the middle of that band near $0.10–$0.11, with the upper range marker around $0.132 and the lower boundary near $0.088. In other words: not a clean trend, not a clean mean reversion, just a market waiting for a push. That “waiting” can be expensive in a leverage-heavy coin. CEO of Aphractal João Wedson struck a stark tone, warning: “If you are long on Doge, you will likely be liquidated soon!” Related Reading: Why Dogecoin (DOGE) Can’t Break $0.10 Despite Short-Term Bounce and Neutral RSI An aggregated liquidation heatmap shared by Alphractal highlights why this warning resonates with derivatives traders: thick bands of potential liquidation levels sit below current price over the past three days, suggesting stop-driven moves could cascade if DOGE starts trending instead of chopping. Wedson also argued that DOGE rallies can function as a broader volatility tell for Bitcoin, calling them “a risk signal for Bitcoin” and saying it “usually happens when Bitcoin is moving sideways.” Alphractal echoed the rotation narrative in a longer note on flows. “Over the past few days, memecoins have significantly outperformed BTC and other altcoins. What stood out the most was Dogecoin, where the number of trades surpassed all others in its category,” the account wrote. “However, in the last few hours, memecoins have started to correct while BTC remains relatively stable.” The near-term map is clean even if the conviction isn’t. Bulls need a decisive reclaim of the top of the $0.08–$0.13 range to credibly reopen the path toward the daily 200 MA/EMA that Daan flagged. Bears, meanwhile, will focus on whether the market revisits the $0.08 area and whether that level holds on a second test with liquidation clusters in play. At press time, Dogecoin traded at $0.10. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58099945,
    "published": 1771309168000,
    "title": "Crypto protocol ZeroLend shuts down, saying it's ‘no longer sustainable’",
    "body": "ZeroLend founder “Ryker” says several blockchains the lending protocol operates on are now “inactive,” leading to periods where it has operated at a loss.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      }
    ]
  },
  {
    "id": 58100465,
    "published": 1771310861000,
    "title": "Steak 'n Shake Says Bitcoin Has Lifted Sales 'Dramatically' in 9 Months",
    "body": "The fast-food chain says bitcoin payments have boosted sales, as it channels crypto receipts into a growing corporate reserve.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58100425,
    "published": 1771310700000,
    "title": "Polygon daily fees flip Ethereum amid prediction market boom",
    "body": "Polygon briefly surpassed Ethereum in daily fees as Polymarket activity surged, highlighting shifting user demand toward Layer-2 networks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 38,
        "NAME": "MATIC",
        "CATEGORY": "MATIC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58100722,
    "published": 1771311617000,
    "title": "Crypto Funds Bleed $173M As Outflows Extend To Fourth Week – Report",
    "body": "Crypto exchange-traded products (ETPs) have extended their negative streak to a fourth consecutive week after US market weakness pushed global funds to over $170 million in weekly outflows. Related Reading: Bitcoin Should Be Flying—Instead, Quantum Risk Keeps It Grounded: Analyst Crypto Funds Outflows Extend Amid US Weakness According to the latest CoinShares data, crypto-based investment products recorded their fourth week of outflows amid the negative market sentiment of the past month. In a Monday report, James Butterfill, head of research at CoinShares, shared that global crypto funds closed the week with negative net flows totaling $173 million, bringing cumulative four-week outflows to $3.47 billion. Notably, crypto ETPs recorded over $1.7 billion in outflows each of the last two weeks of January as the market sentiment shifted, marking the largest negative net flows since November 2025. Over the past two weeks, investment products have seen outflows of $187m and $173m, respectively. The latest figures suggest that the strong selling pressure has slowed, although it has not yet reversed despite improved market sentiment. “The week began on a more positive note, with inflows of US$575m, followed by outflows of US$853m, likely driven by further price weakness. Sentiment improved slightly on Friday following weaker-than-expected CPI data, with inflows of US$105m,” he detailed. Meanwhile, ETPs’ trading activity also dropped notably, with volumes falling to $27 billion from a record $63 billion recorded the previous week. Butterfill noted that the funds also saw a sharp regional divergence in sentiment between the US and the rest of the world. Per the report, the US saw $403 million in outflows last week, while all other regions recorded $230 million in inflows. Germany, Canada, and Switzerland registered the strongest performance, with inflows worth $114.8 million, $46.3 million, and $36.8 million, respectively. Altcoins See Selective Resilience As the report noted, the two leading cryptocurrencies, Bitcoin (BTC) and Ethereum (ETH), saw the worst performance among major assets. The flagship crypto had the weakest sentiment, recording $133 million in negative net flows, fueled by BlackRock IBIT’s $235 million in outflows. However, short Bitcoin investment products also recorded outflows, totaling $15.4 million over the past two weeks, “a pattern often seen near market lows,” Butterfill added. Related Reading: Bitcoin At $8,000? Michael Saylor Says Strategy Still Won’t Break Ethereum suffered $85.1 million in outflows, led by BlackRock ETHA’s $112.7 million, while Hyperliquid saw $1 million in outflows. On the flip side, some altcoin-based investment products saw positive sentiment, continuing to attract fresh inflows last week. Crypto funds based on XRP led the charge with $33.4 million in inflows, adding to the previous week’s $63.1 million positive flows. Solana ETPs followed second with $31 million inflows, a notable increase from the $8.2 million recorded the week prior, signaling confidence in these assets despite the broader trend. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|BlackRock|coinshares|Crypto ETFs|Crypto ETPs|crypto funds|ETHA|ethereum|IBIT|James Butterfil|Solana|Solana ETFs|total|total crypto market cap|US crypto funds|xrp|XRP ETFs",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58100740,
    "published": 1771311600000,
    "title": "Stablecoins gain ground for paychecks and daily spending: BVNK report",
    "body": "A global survey of 4,658 crypto users found 39% receive income in stablecoins and 27% use them for payments, with stronger adoption in emerging markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58101117,
    "published": 1771312793000,
    "title": "DeFi protocol ZeroLend shuts down after three years, citing inactive chains and hacks",
    "body": "The protocol is shutting down after three years, citing unsustainable economics, thin margins and rising security threats.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|DeFi|blockchain contracts|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 58102656,
    "published": 1771317049000,
    "title": "Bitcoin Bull-Bear Cycle Indicator Drops To Deepest Level Since FTX Bottom",
    "body": "On-chain data shows CryptoQuant’s Bitcoin Bull-Bear Market Cycle Indicator has witnessed a deep plunge into the bearish territory recently. Bitcoin Bull-Bear Cycle Indicator Now Most Bearish Since 2022 Bottom In a new post on X, CryptoQuant community analyst Maartunn has talked about the latest trend in the CryptoQuant Bitcoin Bull-Bear Market Cycle Indicator. This metric tells us, as its name suggests, about the market phase that the cryptocurrency is currently inside. The indicator is based on another CryptoQuant metric called the P&L Index, which combines the data of key on-chain indicators to build a single valuation index for Bitcoin. More specifically, the metrics that the P&L Index uses are the MVRV Ratio, NUPL, and LTH/STH SOPR. Related Reading: 46% Of Bitcoin Supply Now In Loss—What It Could Take For A Bottom The MVRV Ratio and NUPL both deal with unrealized network profits/losses, while the LTH/STH SOPR with profits/losses being realized by the investors through their transactions. According to CryptoQuant, the P&L Index’s interactions with its 365-day MA signal whether the asset is switching to a bull or bear market. Breaks above the MA indicate that the cryptocurrency is moving into a bullish regime, while falls below it can signal a bearish transition. The CryptoQuant Bitcoin Bull-Bear Market Cycle Indicator tracks the distance between the P&L Index and its 365-day MA to showcase whether the market is transitioning or if the metric is valued at an extreme. Now, here is the chart for the indicator shared by Maartunn that shows how its value has changed over the past decade: As displayed in the above graph, the CryptoQuant Bitcoin Bull-Bear Market Cycle Indicator plunged into the region below zero during the last few months of 2025, suggesting that the P&L Index crossed below its 365-day MA. As mentioned earlier, such a crossover is a sign of a bearish shift. Since the indicator has gone into this zone, its value has only fallen deeper as the cryptocurrency has seen its negative price action. Following the most recent drop, the metric has hit low levels not seen since the 2022 bear market bottom that followed the FTX crash. The trend is an indication that the P&L Index is approaching an extreme point below the 365-day MA. In the past, market lows have generally been reached alongside such values on the index. Related Reading: Bitcoin NUPL Back In Hope/Fear Region: What Happens Next? That said, the CryptoQuant Bitcoin Bull-Bear Market Cycle Indicator has usually spent a bit of time in the “extreme bear” zone before the cryptocurrency has found a reversal. It now remains to be seen how long the metric will take this time around. BTC Price At the time of writing, Bitcoin is floating around $68,000, down 4% in the last seven days. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin bearish|Bitcoin Bull-Bear Cycle Indicator|btc|BTCUSDT|cryptoquant",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58102622,
    "published": 1771317000000,
    "title": "UK crypto rules too slow to support global hub ambitions, says Agant CEO",
    "body": "Regulatory delays risk blunting Britain’s digital asset push, said Andrew MacKenzie, head of the pound-pegged stablecoin developer.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|United Kingdom|Stablecoins|FCA|Cryptocurrency Regulations|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58104520,
    "published": 1771322455000,
    "title": "Top Expert Projects Bitcoin Bear Market To End In Less Than 365 Days",
    "body": "With Bitcoin (BTC) hovering around 50% below its all-time high of $126,000 reached last October, investors are increasingly questioning when the cryptocurrency might finally establish its next bottom. According to market expert and technical analyst Altcoin Sherpa, the current bear phase is unlikely to drag on for another full year. In his view, Bitcoin could complete its downturn in less than 365 days and potentially resume its broader uptrend before year-end. Has Bitcoin Bottomed? In a recent analysis published on X, Sherpa clarified that his timeline refers specifically to the move from peak to bottom and does not include the accumulation period that typically follows. Accumulation, he explained, is characterized by choppy, sideways price action with relatively low volatility and subdued trading volume. Historically, this phase has lasted anywhere from two to four months. Related Reading: Can XRP Hold Above $1? Token Tumbles 11% as Breakdown Fuels Crash Concerns Looking back at previous cycles, Sherpa notes a fairly consistent rhythm. Bitcoin experienced a powerful rally in 2017 and again in 2021, each followed by a steep year-long decline in 2018 and 2022. After those major drawdowns came an extended stretch of accumulation, as seen in 2019 and 2020. From the top in 2017 to the bottom in 2018, and similarly from 2021 to 2022, it took about one year for Bitcoin to complete its downward move. Another common feature of past bear markets, he argues, has been a final capitulation event — a sharp, dramatic sell-off that effectively marks the end of the downtrend. Sherpa believes a capitulation may have already occurred in 2026, pointing to Bitcoin’s drop from $100,000 to $60,000 as a potential final flush. If that interpretation is correct, the market could already be in the early stages of accumulation. Accumulation Could Already Be Underway Because the 2024 and 2025 rallies were structurally different, Sherpa believes the decline will also differ. While the last two bear markets each lasted about a year from peak to bottom and saw drawdowns of approximately 85% and 75%, respectively, he does not expect the current downturn to mirror that pattern exactly. One reason, he says, is the growing role of US spot Bitcoin exchange-traded funds (ETFs). Although ETF products can and do decline along with the broader market, they have changed the structure of capital flows. He also points to the lengthy consolidation between $50,000 and $70,000, where Bitcoin traded for roughly eight months. From a technical analysis perspective, such extended trading ranges often act as strong support zones during pullbacks. Related Reading: Dogecoin (DOGE) Gives Back Gains, Support Level Under Spotlight As for timing, broader macroeconomic forces — including equities, metals, overall risk appetite and even developments in artificial intelligence — remain critical variables. Still, Sherpa does not think BTC needs another seven months of steady decline to form a bottom. If the recent $100,000 to $60,000 slide was indeed the final Bitcoin price capitulation, then accumulation may already be underway. Historically, that phase has lasted between two and four months, or roughly 60 to 120 days. However, he acknowledges one key risk to his outlook: the possibility that a final capitulation has not yet occurred. If another sell-off emerges — for example, a drop from $75,000 toward $50,000— he would interpret that as the definitive bottoming event. In that scenario, accumulation would likely follow for several months. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin bear market|Bitcoin Bottom|Bitcoin news|bitcoin price|bitcoin technical analysis|btc|BTC news|BTCUSDT|crypto|crypto market|crypto news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58105257,
    "published": 1771324419000,
    "title": "Monero use holds despite delistings as darknet markets shift to XMR",
    "body": "TRM Labs says Monero usage remains above pre-2022 levels as darknet markets shift toward XMR, while unusual node behavior may offer investigators network-level clues.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 57,
        "NAME": "XMR",
        "CATEGORY": "XMR"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58105799,
    "published": 1771326215000,
    "title": "Steak ‘n Shake says same-store sales rose ‘dramatically’ after Bitcoin rollout",
    "body": "American restaurant chain Steak ‘n Shake says its nine‑month burger‑to‑Bitcoin strategy has driven “dramatic” same‑store sales growth and a $15 million Bitcoin reserve.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58105706,
    "published": 1771326031000,
    "title": "After Extreme Pessimism, Crypto Market Conditions Begin To Stabilize: Analysts",
    "body": "Crypto markets are leaning toward their quietest mood in years, and some analysts say that could be the signal sellers have run out of steam. According to Matrixport, a slump in investor mood has pushed its measures to levels that have in the past lined up with market turning points. Related Reading: XRP Spotlighted In German Media With Bold $9 Projection Crypto Sentiment At Multi-Year Lows According to Matrixport, its Bitcoin fear-and-greed gauge has the 21-day moving average below zero and starting to turn up, which is the kind of shift that in prior episodes marked the end of broad selling. Reports note Alternative.me’s Fear and Greed Index sits near 10 out of 100, a reading that lines up with what traders call “extreme fear.” Those are blunt, unsightly numbers. They also tend to make a few investors start looking for bargains. Similar Readings From The Past Past moments with similar readings came after steep drops. June 2024 and November 2025 were named by Matrixport as earlier times when market mood hit comparable depths, and each was followed by at least a temporary change in price action. That pattern doesn’t promise a rebound every time, but it does show how deeply negative views can eventually be absorbed by buyers who step back in at lower prices. 📊Today’s #Matrixport Daily Chart – February 17, 2026 ⬇️ Bitcoin Sentiment Hits Extreme Lows ⁰— Durable Bottom Are Emerging? #Matrixport #Bitcoin #BTC #CryptoMarkets #MarketSentiment #FearAndGreed #RiskManagement #Volatility #CryptoResearch pic.twitter.com/WxJg3xrHSf — Matrixport Official (@Matrixport_EN) February 17, 2026 Technical Indicators Flash Oversold Signals Frank Holmes of Hive says Bitcoin is about two standard deviations below its 20-day trading norm — a rare reading seen only a few times in five years. Reports note that these extremes have historically produced short-term bounces over the following 20 trading days. Bitcoin itself has been moving sharply: it briefly climbed above $70,000 over the weekend, only to fall back about 2.5%, trading near $68,750 at the time of writing. Other trackers report it dipped close to $60,000, marking one of the deepest drops in several years. Traders are keeping a close eye on US GDP and income data, which could influence risk appetite and the next moves for crypto markets. Selling Pressure May Be Near Exhaustion Reports say Matrixport still warns that prices could move lower before any meaningful bottom is cemented. The firm points to a cyclical link between mood and price — deep pessimism often precedes an inflection, but cycles can be messy and extend. Selling pressure can be exhausted and yet new headlines or data can push prices down further before buyers feel confident enough to stay. Related Reading: Bitcoin At $8,000? Michael Saylor Says Strategy Still Won’t Break What Traders Might Do Next Some investors see present readings as an attractive entry point, while others prefer to wait for clearer confirmation from price and volume. Long-term holders often point to the underlying network metrics and institutional interest as reasons to remain optimistic, and their positions are being watched closely. Short-term players, by contrast, are taking a cautious stance, using stops, scaling entries, or sitting out until signals firm up. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|Bear market|bitcoin|btcusd|capitulation|crypto|digital currency|fear and greed|Matrixport",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58106385,
    "published": 1771327876000,
    "title": "Crypto slides as tech stocks and gold retreat; bitcoin-Nasdaq correlation turns positive",
    "body": "Bitcoin falls to $68,000 as tech-led risk-off move deepens, gold extends correction and memecoins lead altcoin losses amid BTC dominance range.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|Derivatives|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58106345,
    "published": 1771327800000,
    "title": "Bitcoin's Crash Is Putting Crypto Treasury Stocks To The Test",
    "body": "A wave of companies embraced Michael Saylor’s bitcoin playbook in 2025. But with prices plummeting, investors are now sorting bargains from balance-sheet traps.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|Daily Cover|daily-cover|Editors' Pick|editors-pick|premium",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58107011,
    "published": 1771329501000,
    "title": "Poland president vetoes MiCA bill again as crypto companies look to license abroad",
    "body": "Polish President Karol Nawrocki vetoed a second MiCA crypto bill, leaving companies without a domestic licensing path as the local regulator warns of a July 2026 deadline.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58107238,
    "published": 1771329735000,
    "title": "Bitcoin Declines as Geopolitical Tension Adds to Risk-Off Mood",
    "body": "Bitcoin fell ahead of the US market open following a three-day break, tracking weakness in equity futures as investors returned to a more cautious macro backdrop.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58107670,
    "published": 1771331411000,
    "title": "XRP $100 Thesis: Jake Claver Details What Must Happen",
    "body": "Jake Claver is again laying out the conditions he says must line up for XRP to reach triple digits, framing the bet not as a chart call but as a sequencing problem tied to institutional tokenization, on-chain liquidity, and regulated market plumbing. In a “Memes and Markets” interview on Feb. 16 with Ben Leavitt and Keith D, Claver defended his so-called “Domino Theory”. Claver told the hosts he didn’t enter crypto until 2020, built a broader portfolio first, then consolidated into XRP after the 2022 drawdown because he viewed it as the “for sure thing.” The hosts pushed on his habit of speaking in absolutes, with Leavitt describing it as “the scariest thing” given how widely his clips circulate. Claver didn’t retreat from the posture. “I will put my nuts on the line and make statements,” he said, adding that his attorneys have advised him to refrain from doing so going forward. “I’m not going to back down. I have a very strong belief in this. And I’ve had enough validation from the right people that lead me to believe that this is the outcome that will take place.” Related Reading: Historic Trend That Led XRP To A Sharp 40% Trend Has Just Reappeared From there, the conversation moved into what Claver sees as the social base of the XRP trade. He argued that XRP attracts a “consistent type of person,” describing holders as disproportionately “faith-based,” generally older, and oriented toward family wealth and philanthropy rather than maximalist anti-bank narratives. Why XRP Could Reach $100 In his telling, that demographic preference is inseparable from the asset’s positioning. “They don’t think the banks are going to go away. They’re not going to be disintermediated,” Claver said. “They don’t think that this is going to be a free DeFi ecosystem, free for all where people can participate without compliance and oversight. And so XRP being the banker’s coin, right? Like that’s appealing to them.” Claver’s core mechanism is less about a single catalyst and more about preconditions. He pointed to timelines he says were aired by large financial institutions around tokenizing asset classes “in the next two years, by the end of 2028,” arguing that tokenization doesn’t matter without the ability to transact at scale. “It really doesn’t provide additional value today because there’s not enough liquidity in those ecosystems for people to transact like there is on the stock market or other markets,” he said. In his model, custody, identity, and liquidity are gating items; once those are in place, stablecoins could be issued on XRPL with XRP used as an intermediary asset, enabling marketplaces for tokenized stocks, private markets, and real estate to function “in a regulated environment.” Related Reading: XRP Outlook Slashed: Standard Chartered Lowers Forecast From $8 To $2 He also offered a cultural feedback loop: a long-running belief in “very high price” outcomes encourages holders to sit tight, reducing the tradable float. In Claver’s view, that scarcity (100 billion token supply) dynamic can amplify price pressure if demand arrives alongside institutional rails. “The more that gets taken off the market, the scarcer the supply is that’s openly traded and the higher the price will get pushed,” he said, arguing that many won’t sell “until they see the significantly higher prices that many people are hoping for.” The interview didn’t avoid the blowback from Claver’s missed New Year’s call. He said his conviction was partly tied to NDAs and partly to a public bet whose purpose, he claimed, was to ensure retail participants weren’t permanently stripped of XRP in side wagers. “Some people like to grind hard for the amount of XRP that they have,” he said. “And for them to just lose that to somebody else on a bet on Twitter, I didn’t feel good about. So all of those people have been returned their XRP.” Pressed on the risk that followers made “very poor financial decisions” around his timeline, Claver leaned on disclaimers and a wealth-management argument: big gains can be destabilizing without tax planning, estate structure, and stewardship. He noted that his advisory firm’s regulated advisors “would tell me I am being reckless and irresponsible with how I have made my allocation,” positioning his own posture as personal choice rather than template. At press time, XRP traded at $1.47. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|Jake Claver|xrp|xrp news|XRP Price|XRP Price Prediction",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58108039,
    "published": 1771332512000,
    "title": "Banking giant Intesa Sanapolo discloses $100 million bitcoin ETF holdings, along with Strategy hedge",
    "body": "The bank also holds a large put option position on Strategy, potentially capitalizing on the company trading above the value of its BTC holdings.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Intesa Sanpaolo|Bitcoin ETF|Strategy|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58108040,
    "published": 1771332428000,
    "title": "Hardware Wallet Owners Hit With Snail Mail Phishing Campaign",
    "body": "The paper mailers mimic Ledger and Trezor branding and device update themes to push users toward malicious verification sites.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      }
    ]
  },
  {
    "id": 58108894,
    "published": 1771334959000,
    "title": "Africrypt founders back in South Africa years after platform collapse: Report",
    "body": "Investigators say Raees and Ameer Cajee are back in South Africa years after Africrypt’s collapse, while investors still struggle to serve legal papers.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 58109196,
    "published": 1771335491000,
    "title": "Gemini Parts Ways With Three Top Executives Months After IPO",
    "body": "Gemini Space Station Inc. said it is parting ways with its chief operating officer, chief financial officer and chief legal officer on Tuesday, just months after going public.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NMS:GEMI",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 58109485,
    "published": 1771336800000,
    "title": "Monad hires former FalconX, BVNK and Optimism executives",
    "body": "The appointments add traditional finance and institutional crypto experience as the layer-1 blockchain scales its post-launch strategy.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58110016,
    "published": 1771338608000,
    "title": "Bitcoin Whales Flood Binance As Correction Deepens: On-Chain Data Shows",
    "body": "Bitcoin’s ongoing correction is pulling large holders back onto centralized venues, with CryptoQuant data showing a sharp jump in whale-dominated inflows to Binance. At the same time, derivatives positioning continues to unwind, reinforcing the picture of a market de-risking across both spot and futures. Bitcoin Whale Share Of Inflows Spikes On Binance CryptoQuant contributor Darkfost (@Darkfost_Coc) said Binance is seeing a notable rise in whale activity as the drawdown pressures participants “from retail participants to whales and even institutions.” His focus was the “whale inflow ratio,” a metric that compares BTC inflows from the 10 largest transactions against total exchange inflows, smoothed using a weekly average to reduce the impact of one-off transfers. “According to the whale inflow ratio, we are seeing a clear surge in whale activity on Binance, reflecting a specific dynamic in the market,” Darkfost wrote. “This ratio is calculated by comparing BTC inflows from the 10 largest transactions to total inflows. Using a weekly average helps reveal a clearer trend, filtering out noise from isolated, exceptional transactions.” Related Reading: 46% Of Bitcoin Supply Now In Loss—What It Could Take For A Bottom Between Feb. 2 and Feb. 15, Darkfost said the ratio rose from 0.4 to 0.62, implying that a larger share of inbound BTC to Binance is now coming from a small set of large transfers. While the metric doesn’t prove intent, a higher concentration of whale inflows is often read as an increase in potential sell-side supply sitting on exchange order books, particularly during risk-off stretches. “It is important to note, however, that this reflects an increase in their share of inflows, which can be interpreted as rising sell-side pressure in the market,” he added. Darkfost also flagged that some of the activity may be linked to a specific entity. “Part of these inflows can be attributed to a well-known whale, believed to be Garrett Jin. Nicknamed 19D5 or ‘the Hyperunit whale,’ this whale has been particularly active on Binance recently, moving close to 10,000 BTC onto the platform.” He framed the broader context as a liquidity and venue-choice story rather than a single wallet-driven anomaly, arguing that multiple whales have been sending “significant amounts of BTC” to Binance, aided by its depth while uncertainty pushes investors to reassess exposure. Derivatives Unwind Adds To Pressure In a separate post, Darkfost argued the derivatives market contraction that followed the cycle’s top remains a central feature of the current tape. “Analyzing Bitcoin open interest across exchanges highlights how severely the derivatives market has contracted since the last all time high and the October 10 sell off,” he wrote, adding that speculation “reached unprecedented levels.” Related Reading: Bitcoin Capitulation Or Buy Zone? What On-Chain Data Shows Right Now He pointed to prior peaks in BTC-denominated open interest on Binance: 94,300 BTC after the November 2021 peak versus 120,000 BTC at the October 2025 market top and said aggregate open interest across all exchanges rose from 221,000 BTC in April 2024 to 381,000 BTC at the cycle peak. Since that top, he said open interest has fallen in almost every month, including a sharp Oct. 6–Oct. 11 drawdown when Binance open interest dropped 20.8%, while Bybit and Gate.io each posted 37% declines. The contraction has continued, with Binance down another 39.3%, Bybit down 33%, and BitMEX down 24%, according to Darkfost. His takeaway is that the market is still in a risk-reduction phase, whether voluntary or forced by liquidations amid volatility. “Overall, this environment indicates that investors are actively reducing exposure, cutting risk, or being forced out through liquidations driven by ongoing volatility,” he wrote. “Under these conditions, it is difficult to envision Bitcoin stabilizing sustainably and reigniting a bullish trend in the short term.” At press time, BTC traded at $67,823. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|Bitcoin whales|btc|BTC news|btc price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58110670,
    "published": 1771340400000,
    "title": "Starknet adds EY Nightfall to enable private payments on Ethereum rails",
    "body": "StarkWare is integrating EY’s Nightfall privacy protocol into Starknet to give institutions private payments and DeFi access on public Ethereum-aligned rails, while preserving auditability.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58110619,
    "published": 1771340378000,
    "title": "Gemini stock plunges after it parts ways with COO, CFO and Chief Legal Officer months after IPO",
    "body": "Crypto exchange says Marshall Beard, Dan Chen and Tyler Meade are departing effective immediately; Cameron Winklevoss to take on COO duties as board names interim finance and legal chiefs.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Gemini|Winklevoss Twins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 58111232,
    "published": 1771342411000,
    "title": "ZeroLend Latest DeFi Platform to Shut Down Amid Liquidity, Revenue Pressures",
    "body": "ZeroLend cited an inability to \"generate sustainable revenue\" as it became the latest DeFi platform to wind down amid the ongoing slump.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 58111795,
    "published": 1771344033000,
    "title": "Dogecoin Has Now Broken Out Of A Descending Triangle, Here’s The Next Stop",
    "body": "Dogecoin might be trading at $0.1, but is already flashing signs of a structural change on the daily timeframe after weeks of downward pressure. After spending much of the past month trading beneath a descending resistance line, the leading meme coin has now broken above that trendline in what one analyst describes as textbook bullish price action. The analysis, shared on X by crypto analyst Trader Tardigrade, pointed to a breakout and successful retest that could set the stage for a stronger move for the price of Dogecoin. Breakout Above The Descending Trendline According to Trader Tardigrade, Dogecoin has officially broken above a descending trendline that had been stopping its price action into a series of lower highs since the middle of January. The daily candlestick chart attached to the technical analysis posted on X shows a clearly defined downward-sloping resistance line, with multiple lower highs forming along the way. Related Reading: What The Dogecoin Recovery From This Accumulation Zone Means For The Price The breakout occurred after Dogecoin had gradually compressed toward the lower end of the pattern. A strong bullish candle pushed the price through the descending resistance when the Dogecoin price broke above $0.1. This was the first sign that sellers were no longer in control at that level. Descending triangles and descending trendlines are a reflection of sustained selling pressure. When price decisively breaks above such structures, it can indicate a change in market sentiment, especially if accompanied by strong follow-through candles. Keeping this in mind, the important part of the setup is not just the breakout, but what happened afterward. Trader Tardigrade pointed out that Dogecoin pulled back to retest the broken trendline. Instead of falling back below it, the price respected the level and held firm. The retest area is around the $0.10-$0.102 range on the chart, and former resistance now appears to have transformed into support. Here’s The Next Stop For DOGE This type of move is referred to as a “resistance-turned-support” confirmation. When a previously restrictive level becomes a base for buyers, it strengthens the bullish case and reduces the probability of a false breakout. The analyst described this as a confirmation of textbook bullish price action. Related Reading: Dogecoin Price Momentum Oscillator Drops To Levels That Triggered Previous 21,000% Rally If Dogecoin maintains support above the broken trendline, the next logical upside target is at the most recent swing high around $0.115 to $0.12. That region previously acted as rejection territory in late January before Dogecoin resumed its decline, making it the first major resistance overhead. The chart projection shared by the analyst suggests the possibility of a continued rally to the mid-$0.13 to $0.15 range if momentum continues. A sustained move above $0.12 would likely draw additional attention from short-term traders watching for confirmation of a trend reversal. At the time of writing, Dogecoin is trading at the reclaimed $0.10 price level. Featured Image from Pngtree, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|Descending Trendline|Descending triangles|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt|Trader Tardigrade",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58111782,
    "published": 1771344000000,
    "title": "First Licensed DAO Derivatives Exchange Launches Amid Volatility",
    "body": "The DAO-governed derivatives exchange DerivaDEX launched its platform today under a T license from the Bermuda Monetary Authority (BMA).",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      }
    ]
  },
  {
    "id": 58111696,
    "published": 1771343678000,
    "title": "Bitcoin slips below $67,000 as software stocks continue to plunge",
    "body": "The most important indicator for bitcoin's price direction at the moment is the iShares Tech-Software ETF, and it's down another 3% on Tuesday.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Market Wrap|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58112113,
    "published": 1771344801000,
    "title": "Bitcoin price ignores $168M Strategy buy, and falls as Iran tensions escalate",
    "body": "BTC price fell below the key $70,000 level as tensions between the US and Iran ramped up and a broad risk-asset sell-off liquidated late BTC long positions.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58112051,
    "published": 1771344355000,
    "title": "The crypto tax reckoning is here",
    "body": "We are officially entering the ‘crypto tax enforcement era’, but the new rules, written by people who don’t understand crypto, could have some big repercussions for the industry as a whole.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Opinion|Opinion",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58112490,
    "published": 1771345677000,
    "title": "South Korea lifts 9-year corporate crypto ban: What the policy change means",
    "body": "South Korea reopens crypto to corporations with strict caps and asset limits. This is part of a broader strategy that includes stablecoin legislation and potential spot crypto ETFs.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58112896,
    "published": 1771347258000,
    "title": "Tom Lee Expects 'Defining Year for Ethereum' as BitMine Buys ETH Amid 'Rock Bottom' Vibes",
    "body": "BitMine Immersion Technologies is sitting on a nearly $8 billion unrealized loss, but Tom Lee remains optimistic about Ethereum.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58112774,
    "published": 1771346633000,
    "title": "Gemini post-IPO shakeup sees exit of three top executives",
    "body": "The exchange's chief legal officer, chief operating officer and chief financial officer are out and Cameron Winkelvoss will take on more responsibilities.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 58112675,
    "published": 1771345805000,
    "title": "Crypto custodian BitGo a potential acquisition target for Wall Street firms, analysts say",
    "body": "Compass Point and Canaccord call BitGo a potential acquisition target and defend the stock despite its weak debut, citing growth in institutional crypto infrastructure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|BitGo|mergers and acquisitions|Top Stories|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58113361,
    "published": 1771348500000,
    "title": "Macro headwinds test Bitcoin price as $70K crumbles amid US market volatility",
    "body": "Bitcoin bulls’ attempt to break above $70,000 stalled after a key US macroeconomic “fear” metric broke a critical threshold. Is a revisit to BTC's yearly lows back in play?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58113551,
    "published": 1771349415000,
    "title": "DOGE Price Slips 3% Daily, Break Below $0.098 Could Trigger Further Dogecoin Downside",
    "body": "Dogecoin (DOGE) is currently testing investor confidence as the memecoin hovers near a key psychological level. After weeks of sideways trading, the DOGE price has slipped roughly 3% over the past 24 hours, leaving traders focused on whether support around $0.098 can hold or open the door to deeper losses. Related Reading: After Extreme Pessimism, Crypto Market Conditions Begin To Stabilize: Analysts The token is currently trading around the $0.099 mark, a level that has repeatedly acted as both support and resistance throughout February. While the broader crypto market remains cautious, the DOGE price behavior suggests a market caught between weakening momentum and attempts to establish a short-term base. DOGE's price trends to the downside on the daily chart. Source: DOGEUSD on Tradingview Technical Signals Point to Fragile Support Recent DOGE price action shows it consolidating within a narrow range after failing to sustain moves above nearby resistance zones. Multiple exponential moving averages between roughly $0.102 and $0.111 continue to cap upside, indicating sellers remain in control of the broader trend. Momentum indicators also reflect uncertainty. The RSI has moved toward neutral territory after earlier signs of oversold conditions, suggesting buying pressure is fading rather than strengthening. Analysts note that DOGE remains below its longer-term trend indicators, including the 200-day and 200-EMA levels, which typically signal bearish market structure when price trades underneath them. Immediate support sits near $0.098, a level closely watched by traders. A decisive break below this threshold could expose the $0.090–$0.088 region, with some forecasts pointing toward a possible retest of the yearly low near $0.08 if selling accelerates. Adding to the cautious outlook, a recent weekly “bearish cross”, where shorter-term moving averages fall below longer-term ones, has historically coincided with extended consolidation or downside phases for Dogecoin. Market Sentiment and Liquidity Remain Key Drivers Despite the decline, trading activity suggests gradual distribution rather than panic selling. Volume remains close to its monthly average, indicating traders are reducing exposure cautiously instead of exiting aggressively. Dogecoin’s performance continues to track broader crypto sentiment. With Bitcoin moving sideways and overall risk appetite subdued, meme coins have struggled to attract sustained inflows. Liquidation heatmaps show clusters of leveraged positions below current price levels, raising the risk of cascading moves if support fails. At the same time, DOGE’s large community and history of sentiment-driven rallies keep traders alert to sudden reversals triggered by social media activity or broader market recovery. What Comes Next for Dogecoin Dogecoin currently appears locked in a transitional phase. Holding above $0.10 could allow consolidation to continue and potentially form a base for recovery. However, a confirmed breakdown below $0.098 would likely reinforce bearish momentum and shift focus toward lower support zones. Related Reading: Bitcoin Bull-Bear Cycle Indicator Drops To Deepest Level Since FTX Bottom Until buyers reclaim higher resistance levels with stronger volume, analysts say the path of least resistance remains sideways to lower, leaving DOGE price at a critical technical crossroads in the near term. Cover image from ChatGPT, DOGEUSD chart on Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|Doge price|dogecoin price|dogeusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58114580,
    "published": 1771352100000,
    "title": "Bitcoin stays pinned below $70K as BTC’s negative funding rate flashes warning sign",
    "body": "Bitcoin’s negative funding rate and a cooling tech sector in the US add pressure to markets and contribute to BTC failing to trade above $70,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58114797,
    "published": 1771352691000,
    "title": "Amid crypto VC shakeout, Dragonfly closes $650M fund with focus on real-world assets",
    "body": "Dragonfly’s raise comes as crypto venture capital shifts toward tokenized real-world assets, payments and core financial infrastructure that enables institutional participation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58115016,
    "published": 1771353642000,
    "title": "Gemini Stock Dives as Winklevoss-Led Crypto Exchange Dumps Executives",
    "body": "Shares in publicly traded crypto exchange Gemini are plunging as the firm parts ways with three executives following broader layoffs.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58116052,
    "published": 1771355700000,
    "title": "Bitcoin chart pattern, whale activity warn of another 20% price drop",
    "body": "Bitcoin has formed a classic bearish pattern on its daily chart, and if confirmed, a price drop to $56,000 could be on the cards.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58115024,
    "published": 1771353549000,
    "title": "CFTC chair doubles down on defending prediction markets from state lawsuits",
    "body": "Michael Selig said the US financial regulator had filed an amicus brief against what he called an “onslaught of state-led litigation” against prediction markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 58117503,
    "published": 1771357884000,
    "title": "Crypto venture capital firm Dragonfly raises $650 million despite 'gloom of a bear market'",
    "body": "The firm’s fourth fund positions it alongside a16z and Paradigm even as blockchain VC fundraising contracts and investors pivot toward stablecoins and tokenized finance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Dragonfly Capital|crypto fund|Venture Capital|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 58117602,
    "published": 1771359051000,
    "title": "Stripe's stablecoin firm Bridge wins initial approval of national bank trust charter",
    "body": "The U.S. banking license would allow Bridge to issue and manage stablecoins under direct federal oversight.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Office of the Comptroller of the Currency|Bridge|Stripe|Stablecoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 58119228,
    "published": 1771362473000,
    "title": "Gold firm Elemental Royalty to pay out dividends in Tether's tokenized gold",
    "body": "The company claimed the bragging right of being the first to let investors opt for dividend payments in a cryptocurrency, backed by gold.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Gold|Tether|Tokenized Assets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58119518,
    "published": 1771362910000,
    "title": "HIVE Digital posts 219% revenue jump as miner-AI hybrid strategy gains traction",
    "body": "Third-quarter results show revenue growth despite lower Bitcoin prices, alongside new AI computing contracts, as HIVE continues to expand beyond its core mining business.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58119396,
    "published": 1771362766000,
    "title": "Abu Dhabi Funds Boosted BlackRock Bitcoin ETF Exposure to $1 Billion by End of 2025: Filings",
    "body": "Abu Dhabi funds added to their Bitcoin exposure in Q4, jumping to more than $1 billion worth of IBIT at the conclusion of the year.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58120601,
    "published": 1771365057000,
    "title": "Stripe-owned Bridge gets OCC conditional approval for national bank charter",
    "body": "While still subject to final approval, the regulator's nod would enable Bridge to offer stablecoin and digital asset services to businesses.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58120507,
    "published": 1771364723000,
    "title": "Quantoz gains Visa nod to issue stablecoin-linked debit cards in Europe",
    "body": "The Dutch electronic money issuer will act as a BIN sponsor for fintech partners, linking regulated dollar- and euro-denominated tokens to mainstream card rails.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58120805,
    "published": 1771365685000,
    "title": "Abu Dhabi wealth funds added to bitcoin ETF holdings in Q4",
    "body": "Combined, Mubadala Investment Company and Al Warda Investments held more than $1 billion of BlackRock's iShares Bitcoin ETF (IBIT) at the end of 2025.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin ETF|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58120855,
    "published": 1771365602000,
    "title": "Binance Kidnap Attempt Puts Crypto Industry on Alert",
    "body": "Emily Nicolle takes stock of the rise in physical attacks against crypto holders and company executives in France.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58121527,
    "published": 1771367034000,
    "title": "Precious Metals Royalties Firm to Offer Dividends in Tether's Tokenized Gold",
    "body": "Elemental Royalty said investors will be able to receive dividends in Tether’s XAUT, establishing a novel use case for tokenized gold.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58121169,
    "published": 1771366429000,
    "title": "Stripe-Owned Bridge Gains National Bank Trust Charter to Boost Stablecoin Offerings",
    "body": "Bridge, the stablecoin firm of payments giant Stripe, was awarded conditional approval for a national trust banking charter.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 205,
        "NAME": "TOKEN SALE",
        "CATEGORY": "TOKEN SALE"
      }
    ]
  },
  {
    "id": 58123003,
    "published": 1771369759000,
    "title": "Ether bulls target $2.5K as staking ETF launch, RWA market cap reflect growth",
    "body": "Ether adoption grows as major endowments shift capital, BlackRock launches a staking ETF, and Ethereum's real-world asset dominance highlights TradFi investor interest.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58123651,
    "published": 1771371116000,
    "title": "Why Bitcoin Open Interest Has Seen Its Largest Decline in Almost 3 Years",
    "body": "Bitcoin open interest has plunged 55% from its October 2025 peak, marking the steepest decline since April 2023 as traders unwind leverage.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58123522,
    "published": 1771371004000,
    "title": "Ethereum’s Bounce Still Lacks Conviction — Downside Risk Remains",
    "body": "Ethereum is attempting to rebound after recent selling pressure, but the recovery so far lacks the strength needed to confirm a lasting bottom. With momentum appearing corrective rather than impulsive and key resistance levels still intact, downside risk remains on the table unless buyers can deliver a decisive structural shift. No Impulsive Break, No Bullish Confirmation According to a recent Ethereum update by More Crypto Online, the downside scenario remains valid unless price delivers a clear impulsive five-wave advance or decisively breaks above the weekend high. The bounce from last week’s low currently appears corrective rather than impulsive. Related Reading: Ethereum Price Recovery Runs Into A Wall, Decline Risk Returns Momentum has been limited, and the structure does not yet suggest that a sustainable bottom has formed. So far, there is no clear technical evidence that a durable reversal is underway. However, Ethereum is trading within a technically significant zone. Following the recent liquidation flush, markets have become more reactive, making it important to stay alert for potential reversal signals that could shift the short-term outlook. For now, confirmation is still lacking. Until a stronger structural shift appears, close monitoring of the lower-timeframe micro structure remains essential to determine whether Ethereum builds strength or resumes its downward trajectory. Ethereum Attempts Recovery After Sunday Selloff Ethereum is attempting to stabilize after the sharp Sunday selloff, showing early signs of recovery. In his latest analysis, Lennaert Snyder noted that, similar to Bitcoin, ETH printed relatively weak weekend extremes around $1,929 on the low and $2,107 on the high. These levels now serve as key liquidity reference points for the week ahead. Related Reading: Ethereum Whale Selloff Continues As Supply Share Drops Under 75% Snyder’s broader plan anticipates a push toward higher prices, but he prefers to see nearby liquidity pools mitigated before considering quality long positions. With the higher-timeframe trend still pointing downward, short setups remain valid if the right structure presents itself. For long entries, he wants to see a sweep of the $1,946 and/or $1,929 lows, as both represent weak pivots, ideally including a full sweep of the weekend low. Such a move could provide the liquidity grab needed for a high-probability reversal back toward the weekend high. However, if price rallies directly from current levels and leaves those lows untouched, he would instead look for short opportunities following a market structure break (MSB) near the $2,107 high. Additionally, H1 liquidity sits around $2,015, offering potential scalp setups depending on whether the price gains acceptance above it or rejects it sharply. Longs would be considered on a clean reclaim, while failure after a sweep could favor shorts. With it being a bank holiday, no trades are being placed today, and the outlined plan remains intact unless price action invalidates it. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum|bitcoin|btc|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|ethusd|Lennaert Snyder|Market Structure Break|More Crypto Online|msb",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58124696,
    "published": 1771373196000,
    "title": "Federal Appeals Court Rejects Kalshi Bid to Pause Nevada Enforcement",
    "body": "The ruling clears a path for state action, leaving predictions-market operator Kalshi with limited options, according to one legal expert.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 58126291,
    "published": 1771376458000,
    "title": "Bitcoin Ready To Bounce Again? The Major Accumulation Trend You Should Be Aware Of",
    "body": "Bitcoin (BTC) may be positioning for another significant upward move as on-chain data suggests strong accumulation activity among long-term holders. A CryptoQuant author, Darkfost on X, highlighted a significant rise in demand from accumulator addresses that consistently acquire and retain Bitcoin. According to him, the current behavior of these investors could influence market sentiment and trigger a price bounce in Bitcoin. Bitcoin Accumulation Activity Suggests Future Upside Darkfost’s CryptoQuant chart analysis shows that monthly accumulation from “accumulator addresses” now averages around 372,000 BTC, up sharply from 10,000 BTC per month in September 2024. This substantial increase in long-term buying indicates a strategic positioning that contrasts with the recent short-term trading behavior in the market. Related Reading: Extreme Bitcoin Shorts Could Predict A Bottom, Here’s The Significance His chart also shows that demand from accumulator addresses was steadily increasing each year. According to the analyst, Bitcoin’s latest price decline appears to have created opportunities for these long-term investors to continue buying aggressively. Rather than reacting to ongoing price volatility, they appear to be focused on Bitcoin’s future growth and are positioning ahead of any potential bounce. Notably, Darkfrost has indicated that the scale of the recent accumulation is unprecedented, suggesting a large portion of Bitcoin has consistently been removed from circulation. As demand continues to increase and supply declines, this could create ideal conditions for an upward price movement. The recent accumulation trend also highlights a major contrast between short-term trading and deliberate positioning. Accumulator addresses tend to show a disciplined, patient approach to investing, which has historically aligned with periods of stronger market performance. Their aggressive buying may act as a stabilizing factor in the market and provide early indicators for a possible price rebound. The same principle applies to periods with notable sell-offs and weak demand. When investor sentiment is low, particularly in highly volatile conditions, it can contribute to more pronounced downtrends. How Accumulator Addresses Are Identified Darkfost notes that CryptoQuant identifies accumulator addresses using a detailed set of criteria. According to him, these addresses show no outflows and must have purchased a minimum amount of BTC in their latest transaction. Each address must also have at least two separate purchasing events or inflows, hold a minimum total Bitcoin balance, and have been active at least once over the past seven years. Related Reading: Why The Bitcoin Price Crash Toward $60,000 Was “Necessary” To ensure accuracy, CryptoQuant also excludes known exchanges and miner addresses, as well as any addresses that interact with smart contracts. This framework helps reduce distortions and provides a clearer picture of long-term holders actively accumulating Bitcoin. Darkfost emphasized that the identification and selection process is precise and thorough, allowing confidence in the validity of the observed accumulation. While CryptoQuant takes extensive measures to be accurate, the report acknowledges that selection is not perfect and cannot capture every entity, such as centralized exchanges or miners. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin Accumulator Addresses|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|cryptoquant|Darkfost",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58127173,
    "published": 1771378020000,
    "title": "Zora debuts attention markets on Solana, betting on social trends",
    "body": "The ZORA token gained 6.2% to $0.022 over the last 24 hours as Zora announced its new attention markets product.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]