[
  {
    "id": 54661610,
    "published": 1763652016000,
    "title": "BlackRock’s Staked Ethereum ETF Play Could Supercharge Bitcoin Hyper",
    "body": "What to Know: BlackRock’s move toward a staked Ethereum ETF marks the arrival of yield-bearing crypto ETFs that blend price exposure with on-chain staking rewards. The success of ETHA and broader interest in staking products indicate that major asset managers are ready to scale deeper into core crypto infrastructure. Bitcoin Hyper addresses Bitcoin’s scalability limits through a rollup-style Layer-2 using wrapped BTC, aiming to transform Bitcoin into a functional DeFi settlement layer. With more than $28M raised, 41% staking rewards, and utility tied directly to Bitcoin’s expansion, Bitcoin Hyper provides asymmetric upside in an ETF-driven market cycle. BlackRock just spun up a new trust in Delaware for an iShares Staked Ethereum Trust ETF, signaling phase two of institutional crypto: yield on-chain, wrapped in TradFi. Roughly 15 months after launching its flagship Ethereum ETF, $ETHA, the asset management giant is now lining up a product that combines $ETH price exposure with staking rewards. $ETHA, which launched in July 2024, has already pulled in around $13B in inflows and quickly became one of the most successful spot Ethereum ETFs on the market. The key detail: ETHA itself does not stake its $ETH, so investors get pure price exposure alone, and nothing from the roughly 4% average staking yield that validators earn on-chain. The new trust changes that equation. A staked $ETH ETF would transform Ethereum exposure into a total-return product, tacking on staking yield to capital gains. That kind of structure is tailor-made for institutions that want the benefits of blockchain without running their own validator infrastructure or worrying about slashing risks. As more issuers follow with staking products, a larger slice of $ETH will be locked up, tightening supply and deepening liquidity in regulated venues. When big money gets comfortable with yield-bearing crypto ETFs on Bitcoin and Ethereum, the usual pattern is simple: liquidity and attention trickle down the risk curve. First majors, then high-beta infrastructure plays. In this cycle, one of the cleanest ways to express that ‘higher beta on Bitcoin’ thesis is not another meme coin, but a Bitcoin Layer-2 like Bitcoin Hyper ($HYPER) that tracks Bitcoin’s performance while adding real utility. That is where Bitcoin Hyper’s ongoing presale starts to look very interesting. Bitcoin Hyper Turns Bitcoin into A Scalable DeFi Powerhouse Bitcoin Hyper is building a Layer-2 rollup on top of Bitcoin that batches transactions off-chain, executes them at high speed, then settles the final state back to Bitcoin Layer-1. In practice, it aims to turn Bitcoin into something that feels closer to Solana in terms of speed, while still inheriting Bitcoin’s battle-tested security. To do this, the team uses a canonical bridge that wraps native $BTC into a compatible asset for use on the Hyper rollup. A Solana Virtual Machine environment then handles execution, enabling thousands of transactions per second and near-instant finality. On top of that, developers can plug in DeFi protocols, NFT marketplaces, and other dApps that simply are not viable on Bitcoin’s base layer today. This is the pain point Bitcoin Hyper goes after: Bitcoin is the largest, most trusted asset in crypto, yet still awkward to use beyond simple transfers and custody. Fees spike in every hype cycle, throughput caps out around single-digit TPS, and DeFi flows largely bypass the network. By pushing computation to an L2 while anchoring security on Bitcoin, Hyper tries to unlock that trapped value. From a macro angle, the timing lines up with the ETF story. As spot Bitcoin ETFs accumulate coins and BlackRock explores yield products on Ethereum, more institutional capital is parked in base-layer assets. The next logical step is infrastructure that lets those assets actually move and work in DeFi. A Bitcoin-native L2 that can route wrapped BTC into lending, DEXs, and payments is directly aligned with that shift. Add in the project’s public focus on conservative security assumptions, and the narrative becomes straightforward: a scaling solution that respects the base chain, rather than trying to replace it. Bitcoin Hyper Presale, Staking Rewards, And ETF-Driven Upside On the numbers side, the Bitcoin Hyper presale has already raised over $28M, with the current token price sitting at $0.013305. That puts it in the upper tier of the best crypto presales of 2025 and suggests there is real appetite for Bitcoin-aligned infrastructure rather than just memes. Staking is a major part of the pitch. Early buyers can stake $HYPER for reported rewards of around 41%, turning idle presale allocations into a yield-bearing position while the team ships its roadmap. Learn how to buy and stake $HYPER today. For investors who are already eyeing BlackRock’s staked $ETH ETF as a source of passive income, that kind of on-chain yield on a high-beta token adds an extra layer of torque. There is also a clear roadmap-linked upside story. Our price modeling sees potential highs of $0.08625 in 2026 if Bitcoin Hyper hits its milestones around mainnet, early dApps, and DAO launch. Relative to the current presale price of $0.013305, that target implies roughly a 546% increase. For holders who already believe in Bitcoin’s long-term trajectory and see BlackRock-style products as confirmation, $HYPER acts like a leveraged play on that same thesis: more throughput, more DeFi rails, and more ways for $BTC liquidity to earn yield. In other words, while BlackRock stays tightly focused on Bitcoin and Ethereum ETFs, investors who want to front-run where that institutional adoption might push demand next are looking directly at Bitcoin Layer-2s. Right now, Bitcoin Hyper is one of the few presales offering that combination of narrative fit, clear technical design, and significant capital already committed. Check out the Bitcoin Hyper presale. This article is for informational purposes only and is not financial advice. Crypto and presale investments are highly volatile and risky. Authored by Aaron Walker for NewsBTC — https://www.newsbtc.com/news/ blackrock-staked-ethereum-etf-bitcoin-hyper-layer2-presale",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54662085,
    "published": 1763652746000,
    "title": "Solana ETFs Post Second-Biggest November Inflows as Demand Grows During Downturn",
    "body": "Spot SOL exchange-traded funds extended an inflow streak since they began trading on Oct. 28 while bitcoin and ether ETFs bled hundreds of millions of dollars.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|ETFs|Solana News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54662967,
    "published": 1763654433000,
    "title": "Pundit’s Bitcoin 3-Month Scenario Shows Massive Crash, Here’s The Target",
    "body": "Crypto pundit Andrea has shared a 3-month scenario for Bitcoin that shows the flagship crypto could suffer a massive crash. This crash is expected to follow BTC’s rebound and an end-of-year rally to new highs. Pundit Projects Bitcoin Crash To $60,000 After Rebound To New Highs In an X post, Andrea shared an accompanying chart showing that Bitcoin could eventually crash to $60,000, with the crash expected sometime in mid-2026. However, before then, the crypto pundit predicted that BTC could still rally to new highs despite its recent crash below the psychological $100,000 level. Related Reading: Here’s Why The Bitcoin Price Keeps Crashing- Is $80,000 Next? Specifically, he revealed a potential three-month scenario for Bitcoin, stating that he expects an end-of-year rally to at least $115,000-$116,000. The crypto pundit added that if BTC can break that level, then it could push towards $135,000 and $140,000, which will mark new all-time highs (ATHs) for the flagship crypto. However, Andrea stated that the peculiarity of this pump will be with a dropping BTC dominance, with altcoins outperforming the flagship crypto. This analysis comes amid Bitcoin’s most recent crash below $90,000, which marked a seven-month low for BTC. Notably, veteran trader Peter Brandt has predicted that this decline could extend further, with the flagship crypto dropping to as low as $58,000. Brandt questioned whether Bitcoin’s sweeping reversal on November 11, followed by 8 days of lower highs and the completion of a massive broadening top, qualifies as a bear market. He added that the targets implied are $81,000 and $58,000. The veteran trader also remarked that those who claim they will be big buyers at $58,000 will be pukers by the time BTC reaches $60,000. BTC Suffers A Breakdown Of The Megaphone Pattern Crypto analyst Colin revealed that Bitcoin has broken down from the megaphone pattern. He noted that without a quick recovery in the next day or two, this would suggest that BTC is entering a bear market. He opined that this bear market may be less intense due to diminishing returns and diminishing losses each cycle. Related Reading: 4 Bitcoin Indicators That Led To Market Rallies In The Last 2 Years Have Returned The analyst reiterated that if the Bitcoin price can reclaim the 50-week moving average before the week is over, it could signal a bullish outlook for the flagship crypto. However, until then, he remarked that it is better to assume that a bear market or bigger correction is the most likely scenario. Colin also raised the possibility of BTC following the ISM (business cycle) higher in a big move next year, after this corrective period. If that happens, then the bear market may be short-lived. At the time of writing, the Bitcoin price is trading at around $93,000, up almost 2% in the last 24 hours, according to data from CoinMarketCap. Featured image from Pngtree, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|Andrea|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|CoinMarketCap|Colin|ISM|Peter Brandt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54662936,
    "published": 1763654215000,
    "title": "Tether backs Parfin to push institutional USDT adoption across Latin America",
    "body": "The investment will help Parfin expand its onchain settlement tools and strengthen stablecoin infrastructure that is already driving institutional crypto use in LATAM.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54663387,
    "published": 1763655146000,
    "title": "What Next For XRP as Bitcoin Loses $90,000 Level Again",
    "body": "Institutional activity declined significantly, and the market remains pressured by Bitcoin's weak structure and ETF outflows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54663830,
    "published": 1763655897000,
    "title": "Proposed Bitcoin for America Bill Would Enable BTC Tax Payments, Which Go to Reserve",
    "body": "Introduced Thursday, the bill would allow Americans to pay their taxes in Bitcoin, with those funds being used to grow the U.S. stockpile.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54663677,
    "published": 1763655533000,
    "title": "Ethereum’s Fusaka Upgrade Signals New Era for Value Accrual: Fidelity Digital Assets",
    "body": "The upgrade marks a sharper strategic turn for the blockchain, aligning protocol development with economic intent and strengthening the case for ether.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Ethereum News|Fusaka|Fidelity Digital Assets|Analysts|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54664903,
    "published": 1763658047000,
    "title": "Here’s The Resistance Zone Keeping The Dogecoin Price From Rallying",
    "body": "The Dogecoin price has spent the past several days moving through a noticeably weaker phase, falling from the mid-$0.18 region into a prolonged decline that has kept the price tilted downward. The chart shows a major high forming near $0.18311 before sellers forced the price into a tight downtrend, but every attempted bounce has turned into another correction. Technical analysis from BitGuru focuses on why this rebound attempt is still weak and what Dogecoin must break above before any meaningful rally can begin. Dogecoin Price Downtrend And Repeated Corrections The structure of Dogecoin’s price action since reaching $0.183 on November 10 makes the weakness clear. After topping at $0.18311, Dogecoin slipped into a descending channel, with the downtrend highlighted by lower highs across November 11 and 12. Each time the price tried to push upward, the move stalled at a predictable level, creating another corrective swing. The chart shows this clearly during the November 13 and 14 period, where a modest recovery reached $0.16598 before sellers regained control. Related Reading: Analyst Says You’re Looking At XRP The Wrong Way, Here’s What It Actually Does Since then, the price pattern shows that the Dogecoin price has been following a controlled downtrend. The selling pressure is consistent, and every rebound so far has been capped by the same resistance around $0.166. The momentum has been drifting downward for most of the past week, keeping the Dogecoin price suppressed below this price level. the most recent candles on the chart show Dogecoin attempted another rebound after a drop into the $0.153 region. BitGuru noted that this bounce is not enough to confirm a reversal, and a stronger recovery will only be confirmed if it breaks above the nearby resistance zone. The current price action in the past few days shows Dogecoin is holding above short-term support, but it has not yet shown the strength required to break out of the sideways-to-downward structure. Until the candles break above the compression zone formed between November 15 and 16, then Dogecoin might continue trading sideways. Dogecoin / TetherUS. Source: BitGuru On X The Resistance Zone Dogecoin Must Break BitGuru’s main focus is the resistance zone that has repeatedly rejected Dogecoin. From the chart, this resistance stretches across the range between $0.163 and $0.167, coinciding with the point where the last two consolidation phases stalled. Each time Dogecoin reached this area, selling pressure increased, creating another correction. Related Reading: Model Shows How XRP Could Hit $24 After ETFs Go Live The chart shows this clearly in the boxed region leading into the November 16 decline, where Dogecoin hovered below $0.16598 for several hours before slipping again. This zone is acting as the barrier preventing Dogecoin from starting a new rally. According to BitGuru, the market needs a clean breakout above this range before any stronger recovery can be confirmed. Without that breakout, the Dogecoin price will still be vulnerable to further downside movement. At the time of writing, Dogecoin is trading around $0.1566 and is well below this resistance block. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54664889,
    "published": 1763657961000,
    "title": "The 100-Year-Old Wall Street Tool Being Rebuilt For Crypto",
    "body": "RDC is reinventing Depositary Receipts for Bitcoin, Ethereum and Solana—bridging crypto tokens into DTC, prime brokerage, ETFs and ’40 Act funds.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54664658,
    "published": 1763657537000,
    "title": "Bitcoin's Nvidia-Led Gains Prove Short-Lived, With Price Slumping Back to $88K",
    "body": "U.S. stocks are also giving up a major early advance, with the Nasdaq now ahead just 0.3%.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Market Wrap|Breaking News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54665381,
    "published": 1763658869000,
    "title": "21Shares Doubles Dogecoin Bets With 2x Leveraged DOGE ETF",
    "body": "TXXD targets risk-tolerant investors and joins a growing list of altcoin-tracking funds that have recently listed on U.S. exchanges.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "dogecoin||Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54610768,
    "published": 1763658442000,
    "title": "Ethereum Cofounder Issues Stark BlackRock Warning That Could Spell Disaster For Bitcoin Amid Sudden Price Sell-Off",
    "body": "Ethereum cofounder Vitalik Buterin has warned elliptic curve cryptography could break before the next U.S. presidential election in 2028...",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54665016,
    "published": 1763658227000,
    "title": "ICP Breaks Below Key Support as Volume Surges at Resistance Test",
    "body": "Heavy trading activity during a failed rebound attempt pushed ICP into a tighter consolidation zone below $4.95, reinforcing short-term downside risk.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Technical Analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 82,
        "NAME": "ICP",
        "CATEGORY": "ICP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54665922,
    "published": 1763659953000,
    "title": "Bitcoin Dives As Sudden Fed Flip Sparks Price Crash Fears",
    "body": "Bitcoin and the wider crypto market has dropped sharply, reigniting bitcoin crash fears...",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54665764,
    "published": 1763659152000,
    "title": "Crypto Market Extends Slide With Bitcoin Dropping Below $87,000",
    "body": "The cryptocurrency market extended a more than a month-long retreat in Thursday trading, just as stocks surrendered the gains they had logged earlier in the day.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54665534,
    "published": 1763659110000,
    "title": "Core Foundation Secures Injunction Against Maple Finance Over Bitcoin Yield Product",
    "body": "Core Foundation alleged that partner Maple Finance has misused confidential information to create a rival Bitcoin yield product.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54665464,
    "published": 1763659048000,
    "title": "HBAR Faces Fresh Liquidity Alarms After Breakdown to $0.1373",
    "body": "Hedera’s token slipped below key support levels as a late-session trading halt, collapsing volume, and failed recovery attempts point to mounting structural and liquidity stress.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 81,
        "NAME": "HBAR",
        "CATEGORY": "HBAR"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54666243,
    "published": 1763660480000,
    "title": "Bitcoin, Ethereum and XRP Dive as Rate Cut Hopes Fade, Liquidations Near $1 Billion",
    "body": "Bitcoin is being battered again Thursday, falling below the $87,000 mark for the first time in seven months as liquidations top $900 million.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54666772,
    "published": 1763661612000,
    "title": "Ethereum Is Sitting On Its Most Critical On-Chain Support Level — A Rally Emerging?",
    "body": "The cryptocurrency market finds itself at a compelling crossroads, and Ethereum has once again returned to a pivotal on-chain support zone that has historically marked major turning points in its market cycle. With ETH now pressing against this same support, the market is exhibiting a strong reaction that could confirm the integrity of the long-term trend. Why This On-Chain Support Zone Defined Ethereum Recovery Ethereum’s price is sitting right on top of its most important on-chain support, and the behavior around this level is exactly what occurs before a big reversal. A popular crypto news site, CryptosRus, has revealed on X that the ETH price sharply dropped to $2,870 earlier today, only to bounce instantly after Nvidia’s earnings lifted the entire market. CryptoRus highlighted that this bounce isn’t the real story, but the level at which it happened is. Related Reading: Ethereum Big Wallets Are Back: Whales Are Quietly Accumulating ETH – A Rally On The Way? Presently, the $2,800 zone is a strong on-chain floor for ETH. This is because the level lines up perfectly with the realized price of both retail and whales. These are the same zones that have marked the ETH bottoms in every past cycle, and ETH just tapped it perfectly. The classic signature of a bottom-zone behavior is that small wallets are in panic, while big wallets are buying in silence. Meanwhile, the on-chain rotation data has clearly shown that retail holders are selling, while whale investors holding 10,000 ETH and above are steadily loading up. A similar sentiment has been detected in the liquidation data. Long liquidations are barely moving on each new low, which means that the forced sellers are gone and the short sellers have been piling in aggressively. That’s the perfect setup for a squeeze. According to the expert, ETH didn’t just dip; it slammed into a major on-chain support, as large investors bought it up with conviction. Meanwhile, retail dumped it in panic, shorts crowded it, and now even a small bounce can trigger the fireworks. Historical Patterns Suggest A Reset Precedes The Next Expansion Ethereum had just repeated the identical liquidity pattern that occurred at the last two major bottoms, and it happened almost in the same week. An analyst known as Milk Road has stated that every single major ETH reversal started with a full liquidity reset. Related Reading: Ethereum Price Uphill Battle Continues as Sellers Hold the Advantage As that same liquidity reset occurs again, that’s when the ETH price begins its next massive expansion leg, which is exactly the setup ETH is currently in. In the meantime, the next phase will depend entirely on how quickly the market depth can be rebuilt. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|CryptosRus|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|Ethereum Whales|ethusd|ETHUSDT|Milk Road",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54667378,
    "published": 1763662790000,
    "title": "Crypto Exchange Ripio Reveals $100M Crypto Treasury, Second Largest in Latin America",
    "body": "The company's holdings, which include bitcoin and ether, have been managed through trading and hedging strategies since 2017.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Ripio|Bitcoin Treasury Reserve Asset|Digital Asset Treasury|Crypto Exchanges|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 54668236,
    "published": 1763664140000,
    "title": "Coinbase launches ETH-backed loans as onchain lending tops $1.25B",
    "body": "Users can borrow up to $1 million in USDC against their Ether as Coinbase expands its Base-powered network, which has processed $1.25 billion in loans.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54667958,
    "published": 1763662651000,
    "title": "#1 Mentions Market Trader @0xTyrael shares his Prediction Market strategies!",
    "body": "Against The Odds: Your Weekly insight into Prediction Markets & Sports Betting! - Hosted by @Tyler_Did_It & @Geebz - Today's Guest: @0xTyrael, the #1 Mentions Market Trader will be sharing their strategies and thoughts on prediction/mention market trading with us.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      }
    ]
  },
  {
    "id": 54668845,
    "published": 1763665200000,
    "title": "Bitcoin, stocks crumble after Nvidia earnings and Fed uncertainty over next rate cut",
    "body": "Bitcoin weakness persists as the BTC price drops to $86,000, alongside a US stock market sell-off and diminishing odds of a 50-basis-point Fed interest rate cut at the next FOMC.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54670317,
    "published": 1763667957000,
    "title": "Bitcoin for taxes? Proposed bill would let Americans pay the IRS in BTC",
    "body": "Tax revenue denominated in Bitcoin would be funneled into the US strategic BTC reserve and would not trigger a taxable event for the payer.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54670262,
    "published": 1763667789000,
    "title": "Michael Saylor’s Strategy Risks Losing Billions in Index Flows",
    "body": "Michael Saylor’s Strategy Inc. is among the most exposed to the crypto slump — and now faces the real risk of being dropped from the benchmark indices that have underpinned its presence in mainstream portfolios.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NMS:MSTR",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54670711,
    "published": 1763669082000,
    "title": "Bitcoin Billionaire Dumps Entire $1.3 Billion BTC Stash After 14 Years: Arkham",
    "body": "A Bitcoin whale appears to have sold his entire crypto stash for $1.3 billion—14 years after first buying BTC, says Arkham Intelligence.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 199,
        "NAME": "ARKM",
        "CATEGORY": "ARKM"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54671420,
    "published": 1763670386000,
    "title": "Elon Musk Is the Most Fit, Intelligent and Handsome Person Alive—Says Grok AI",
    "body": "Elon Musk's chatbot went viral for declaring him the most wonderful man on earth—fitter than LeBron, smarter than da Vinci, and definitely not biased at all.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54672835,
    "published": 1763673008000,
    "title": "Kalshi Raises $1B at $11B Valuation as Prediction Market Race Continues: TechCrunch",
    "body": "The CFTC-regulated exchange is gaining ground on crypto-native Polymarket, offering event contracts with fiat access and legal clarity.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Kalshi|Polymarket|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 54672891,
    "published": 1763672975000,
    "title": "AI hedge fund Numerai wins backing from top university endowments, token soars",
    "body": "Numerai's NMR token jumped over 40% after it announced a new funding round led by major university endowments, pushing the hedge fund to a $500M valuation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54673130,
    "published": 1763673300000,
    "title": "ETH DATs have a problem: Ether’s crash below $3K vaporized a year’s worth of gains",
    "body": "Ethereum treasury companies are holding millions of dollars in unrealized losses, and the falling mNAV valuations and ETH’s potential to fall below $2,500 could further complicate matters.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54674161,
    "published": 1763675332000,
    "title": "How Crypto Traders Navigate Volatility And Mental Strain",
    "body": "Crypto markets have entered another period of sharp volatility. For traders behind these positions, the damage extends beyond financial loss.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54674506,
    "published": 1763673300000,
    "title": "ETH DATs have a problem: Ether’s crash below $3K vaporized a year’s worth of gains",
    "body": "Ether treasury companies are holding millions of dollars in unrealized losses, and the falling mNAV valuations and ETH’s potential to fall below $2,500 may further complicate matters.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54676536,
    "published": 1763679657000,
    "title": "Is XRP Entering A Bear Market? Analyst Breaks Down The Truth",
    "body": "Crypto analyst Will Taylor, founder of Cryptoinsightuk, says talk of an XRP bear market is premature, arguing that the token’s higher-time-frame structure and liquidity profile remain bullish despite extreme volatility and record liquidations. Is The XRP Bear Market Here? In a video published on 19 November, Taylor acknowledged the “doom and gloom” dominating crypto sentiment but insisted that, from a technical standpoint, “nothing’s really changed” for XRP. His core claim is that XRP is still trading above a reclaimed multi-year resistance level that now acts as structural support. “We have spent over a year above our 7-year resistance holding it as support,” he said, calling this setup “almost unprecedented for XRP and for any asset.” As long as that zone holds, he rejects the idea that the market has rolled into a confirmed long-term downtrend. “Until that support is lost you can’t convince me that we’re bearish. I just don’t believe that.” Taylor uses Bitcoin as the macro anchor for the XRP thesis. He described the current BTC drawdown as a standard bull-market correction, noting that price is now sitting around a 30% pullback from the highs, similar to prior mid-cycle moves. He pointed out that the daily RSI is oversold and that the three-day RSI is at levels last seen near the $25,000 lows. “If we’re referring back to when momentum has felt this bad, it’s literally cycle lows,” he argued, while stressing that this does not guarantee an immediate reversal. Related Reading: XRP Supply In Profit Falls to 58.5% – Lowest Since 2024 Despite Higher Price Against that backdrop, he characterizes XRP as simply ranging above long-term support. On the daily chart, he said XRP is “holding its range pretty well,” with price near the lower end of that structure. He framed the area around roughly $2 as historically attractive from a risk-reward perspective: “Bottom of the range is where people are scared, where sentiment’s low. These are the areas that are pretty decent.” The liquidity map is central to his view. On lower time frames, Taylor sees some liquidity beneath recent lows, around $2.05–2.03, which could be swept without breaking the broader range. However, he stressed that the overwhelming concentration of resting liquidity lies far above spot. In the daily, he claimed that for XRP “the densest area of liquidity by an absolute long shot is above us […] dense all the way up to $4.20, $4.30 in dollars.” He argued that this distribution matters because market makers and exchanges maximize revenue where positions are opened and closed, not at stagnant prices. “They make money when contracts are opened and closed. They don’t give a [expletive] whether the price goes up or down,” he said. In his view, that means price statistically gravitates toward the most crowded liquidity pockets: “You have to play the four out of five chance that it is going to go into the dense area of liquidity.” Related Reading: Famous Trader Bets $27 Million That The XRP Price Will Crash XRP Vs. The Rest Of Crypto Taylor also pointed to relative-value signals. Against Ethereum, XRP recently closed a weekly candle above the 0.000071 level, which he said “has trapped us down since August.” Versus Bitcoin, he highlighted that XRP has been “holding the range lows” and has finally logged a weekly close above a resistance cluster that capped price since early October. XRP dominance, he added, has broken out of a downtrend and closed back above a recent cluster, although he wants “one or two more weeks” of continuation to confirm a bullish cross. He underscored that this structure has held despite the October 10, “the largest liquidation event in history of crypto.” While the FTX collapse saw about $2 billion in leveraged positions liquidated, the October 10 move liquidated roughly $20 billion and still failed to push XRP into a sustained breakdown.The sharp wick lower was “instantly bought back to the upside,” and the range was reclaimed soon after. “Things like XRP are looking super bullish here,” he concluded. “I think XRP is going to blow the doors off people’s expectations.” For now, Taylor maintains that an XRP bear market would require a decisive loss of the long-term support zone and a very different liquidity and dominance picture. Until those conditions appear, he says, “there isn’t a factual argument” for a confirmed bear market—only predictions. At press time, XRP traded at $2.11. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|xrp|xrp news|XRP Price|XRP Price Analysis|XRP Technical Analysis",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54676336,
    "published": 1763678894000,
    "title": "Tether’s Gold Hoard Surges to 116 Tons, Rivals Small Central Banks",
    "body": "Jefferies said that stablecoin giant Tether has quietly become one of the gold market’s most influential new buyers.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Tether|Gold|USDT|Jefferies|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 164,
        "NAME": "XAUT",
        "CATEGORY": "XAUT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54678656,
    "published": 1763683253000,
    "title": "Bitcoin Mean Reversion Oscillator Prints First Green Oversold Bar in Months – A Classic Bull-Market Bottom Signal",
    "body": "Bitcoin continues to struggle around the $90K level as the market battles intense selling pressure and widespread fear. Short-term sentiment remains fragile, with investors reacting to rapid price swings and mounting downside volatility. Yet, beneath the noise, key on-chain metrics are beginning to show signs that the correction may be nearing exhaustion. Related Reading: Nearly 7M Bitcoin Now Sitting At A Loss: Highest Unrealized Pain Since January 2024 According to analyst On-Chain Mind, Bitcoin’s Mean Reversion Oscillator has just printed its first green oversold bar in months, a signal that has historically aligned with late-stage retracements during bull markets. This oscillator measures how far price has deviated from its cyclical mean, helping identify when Bitcoin becomes overstretched to the downside. Each time this indicator dipped into its green oversold zone in previous cycles, Bitcoin was either forming a macro bottom or preparing for a significant rebound. The fact that this signal has appeared while BTC consolidates above $90K — despite severe profit-taking, forced liquidations, and structural fear — suggests that strong hands may be quietly absorbing supply. Historical Bottom Signals Align as Macro Tailwinds Strengthen On-Chain Mind explains that Bitcoin’s current Mean Reversion Oscillator reading aligns closely with historical patterns seen during bull market retracements. Each time the oscillator dipped into the green oversold zone while the 35 line held, Bitcoin formed a cyclical bottom before resuming its upward trajectory. This line has acted as a structural support level across multiple market cycles, and the fact that it is holding once again reinforces the idea that strong hands are stepping in as weaker participants capitulate. According to On-Chain Mind, when this indicator flashes green during an ongoing bull market, it often marks textbook accumulation territory — the kind of opportunity that appears only a few times per cycle. The current setup resembles previous late-stage pullbacks rather than the beginning of a prolonged bear trend. Adding to this outlook, NVIDIA’s blowout earnings delivered a major confidence boost to U.S. equities. With revenue and guidance far exceeding expectations, the results signal that AI-driven demand remains strong. In broader macro terms, such strength in tech leadership often spills over into higher-risk assets like crypto, improving liquidity and investor sentiment. Related Reading: Bitcoin Capitulation Deepens Around $90K Level: Classic Late-Stage Fear Structure Emerging Testing Support as Momentum Begins to Stabilize Bitcoin’s latest daily chart shows price attempting to stabilize after a sharp multi-week decline, with BTC currently trading near $92,000. This level is acting as a temporary support zone following the breakdown from the $100K area, where sellers aggressively dominated order books. The chart reveals a series of lower highs and lower lows — a classic short-term downtrend structure — but the recent candlesticks hint at reduced selling momentum compared to the peak pressure seen earlier in November. The 50-day and 100-day moving averages have both turned downward, reflecting weakening short-term trend strength, while the 200-day MA remains far below price, highlighting that the broader bullish cycle may not be invalidated yet. Importantly, the current candle structure shows smaller bodies and longer lower wicks, suggesting buyers are beginning to absorb sell-side liquidity around the $90K–$92K region. Related Reading: XRP Supply In Profit Falls to 58.5% – Lowest Since 2024 Despite Higher Price Volume profiles also support this shift. While capitulation-like spikes occurred during the heaviest drop, trading activity has now normalized, indicating panic selling is cooling off. Historically, such deceleration after a steep leg down often precedes a relief bounce, even if volatility persists. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|Bitcoin mean reversion oscillator|Bitcoin news|Bitcoin Oversold|bitcoin price|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54678241,
    "published": 1763682490000,
    "title": "Kalshi’s valuation marked up to $11B after $1B funding round: TechCrunch",
    "body": "Kalshi has joined predictions market rival Polymarket in the $10 billion-plus valuation club after reportedly raising another $1 billion from Sequoia Capital and CapitalG.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54679837,
    "published": 1763683260000,
    "title": "Cash-for-Crypto Laundromat Used to Fund Marsalek’s UK Spy Ring",
    "body": "Russian intelligence services helped fund the former Wirecard executive Jan Marsalek’s spy ring by using a cash-to-cryptocurrency money laundering network, UK police said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54680299,
    "published": 1763685929000,
    "title": "Google Sparks Backlash After Gmail Setting Lets Gemini Peek Inside Inboxes",
    "body": "Google has faced criticism after a buried setting allowed Gemini to scan inboxes and calendars without clear notice to users.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54679984,
    "published": 1763685401000,
    "title": "Bitcoin Giant Strategy Could Shed Billions If Removed From Stock Indices: JPMorgan",
    "body": "Analysts from the investment banking giant wrote in a note Thursday that removal from MSCI indices could lead to $2.8 billion in outflows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54680753,
    "published": 1763686850000,
    "title": "Why is Zcash Surging? Analysts Break Down the ZEC Rally and What Comes Next",
    "body": "Zcash (ZEC) is back in the spotlight after a dramatic rebound. Following Monday’s steep fall to roughly $548, the privacy coin has bounced sharply, gaining 12% in the last 24 hours and reclaiming the $670 level. Related Reading: Bitcoin To Suffer 40% Crash From All-Time High? Analyst Reveals ‘Final Target’ After surging more than 1,500% year-to-date and rallying 175% in the past month, the privacy-focused cryptocurrency is now testing a major bullish breakout pattern, leaving traders wondering what comes next and whether ZEC can truly sustain this momentum. ZEC's price trends to the upside on the daily chart. Source: ZECUSD on Tradingview Institutional Accumulation Fuels a Powerful Upswing A major catalyst behind Zcash’s meteoric rise has been aggressive accumulation from high-profile institutional players. The newly rebranded Cypherpunk Technologies, backed by Tyler and Cameron Winklevoss, has snapped up 233,644 ZEC, worth roughly $150 million. This stash now represents around 1.25% of the circulating supply, with the firm openly declaring plans to raise its holdings to at least 5%. This level of concentration has tightened liquid supply and injected strong confidence across the market. Supporting the trend, long-time privacy advocate Arthur Hayes has openly backed ZEC, predicting a run to $1,000 and even suggesting Zcash could eventually reach 20% of Bitcoin’s value. The upcoming November 2025 halving has added another bullish layer. With block rewards set to fall by 50%, ZEC will enter a sharply reduced-issuance environment, historically a strong driver of scarcity-led rallies across major cryptocurrencies. Technical Indicators Signal a Potential Zcash (ZEC) Breakout On the technical front, Zcash is close to confirming a classic inverse head and shoulders formation on the 4-hour chart. The neckline sits around $690, and a decisive breakout above this level could open a path toward $956, a nearly 40% upside from recent prices. ZEC is also trading above its 50-day EMA at $613, while a green Supertrend signal hints at sustained bullish momentum. Still, analysts caution that ZEC must hold above the EMA to avoid invalidating the formation. Key support remains at $600–$605, where momentum has recently cooled. Coordinated Influence and Growing Privacy Demand Beyond charts and supply mechanics, market observers say a coordinated narrative push is also at play. Crypto media figure Ran Neuner believes influential industry players are rallying behind Zcash to spotlight privacy as a critical next frontier. According to him, this is less a pump-and-dump and more a long-term mission around compliant, user-controlled privacy, a feature that differentiates ZEC from rivals like Monero. Related Reading: XRP Supply Shock Ahead? ETFs Could Consume It All, Analyst Predicts If ZEC can maintain its breakout structure and demand for privacy-focused assets continues to rise, Zcash may be positioning itself not just for a short-term spike, but for a serious challenge to broader market rankings in the months ahead. Cover image from ChatGPT, ZECUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Zcash Zec|ZCash|ZEC|ZEC Price|zecusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54681605,
    "published": 1763688304000,
    "title": "UK Fraud Office Probes $28M Crypto Fund Collapse, Two Arrested",
    "body": "The office has begun probing Basis Markets, a defunct crypto project accused of misappropriating investor funds.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54682688,
    "published": 1763690456000,
    "title": "Bitcoin OG Owen Gunden Deposits Final 2,499 BTC ($228M) to Kraken – Details",
    "body": "Bitcoin is currently trading below $92,000, and the market is showing clear signs of exhaustion as selling pressure intensifies. Fear has pushed sentiment toward the bearish end of the spectrum, with many analysts now arguing that BTC may be entering a new bear market. The loss of key support levels and the rapid acceleration of downside volatility have only fueled these concerns, especially as short-term holders continue to capitulate at scale. Related Reading: Bitcoin Capitulation Deepens Around $90K Level: Classic Late-Stage Fear Structure Emerging However, not all perspectives are bearish. Some analysts believe that Bitcoin may be forming a local bottom, as the current correction resembles previous mid-cycle retracements seen during strong bull markets. They argue that the broader macro environment remains supportive and that long-term holders have not shown signs of structural weakness. As selling pressure concentrates among weak hands, the possibility of a reversal increases — especially once forced sellers exhaust themselves. Adding to the uncertainty, new on-chain data from Lookonchain revealed that Bitcoin OG Owen Gunden just deposited all his remaining 2,499 BTC into Kraken roughly an hour ago. Moves like this often trigger speculation, as exchange deposits from early holders can signal potential selling. Yet historically, similar events have also occurred near cycle bottoms when panic is at its peak. A Massive BTC Transfer Sparks Market Speculation According to fresh data from Lookonchain, Bitcoin OG Owen Gunden has just deposited his remaining 2,499 BTC (worth $228 million) into Kraken roughly an hour ago. This move has immediately raised questions across the market, as large exchange deposits from early whales often signal potential selling pressure. What makes this development even more notable is the context: just two weeks ago, Lookonchain reported that Gunden appeared ready to offload his entire 11,000 BTC stash — a position worth over $1.12 billion at the time. Now, with this final deposit, it appears he has officially completed the move. For many traders, this confirms that one of the oldest and largest long-term holders has fully exited or is preparing to exit the market. Such whale behavior can amplify fear during corrective phases, especially as Bitcoin continues to struggle below $92K. Moves of this scale not only contribute to short-term volatility but also influence sentiment by signaling that even early accumulators may be reducing exposure. However, historically, capitulation events from long-term holders have often coincided with or preceded major turning points. If this massive transfer marks the end of Gunden’s sell-off, the market may soon absorb the pressure — potentially clearing the path for a recovery once the fear subsides. Related Reading: Nearly 7M Bitcoin Now Sitting At A Loss: Highest Unrealized Pain Since January 2024 Short-Term Trend Still Under Pressure Bitcoin’s 4-hour chart reveals a market that remains firmly under short-term selling pressure, despite occasional relief bounces. The price is struggling to reclaim $92,000, a level that previously acted as support but is now working as resistance. The series of lower highs and lower lows highlights a persistent downtrend that has shaped BTC’s trajectory since early October. All major moving averages—the 50 SMA, 100 SMA, and 200 SMA—are positioned above current price action and pointing downward. This alignment confirms a clear short-term bearish structure. Each time BTC attempts to recover, it meets strong resistance at these declining MAs, signaling that sellers remain in control. The most recent bounce barely reached the 50 SMA before being rejected again, reinforcing the weakness of buyer momentum. Related Reading: XRP Supply In Profit Falls to 58.5% – Lowest Since 2024 Despite Higher Price Volume remains elevated on downswings, which indicates that sell-offs continue to be driven by conviction rather than random volatility. Buyers are stepping in around the $89,000–$91,000 zone, but so far, this support has only produced temporary pauses rather than meaningful reversals. For a structural shift, BTC would need to reclaim at least the $95,000 area and break above the 100 SMA. Until then, the trend remains tilted toward further downside or continued consolidation near current levels. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin analysts|Bitcoin news|Bitcoin OG|Bitcoin Whale Activity|btc|BTCUSDT|Owen Gunden",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54685107,
    "published": 1763695045000,
    "title": "Bitcoin Price Crashes Under $90K, Triggering Fresh Fears of Deeper Weakness",
    "body": "Bitcoin price started another decline below $90,000. BTC is now showing bearish signs and might struggle to recover above $88,5000. Bitcoin started a fresh decline below $92,000 and $90,000. The price is trading below $90,000 and the 100 hourly Simple moving average. There is a bearish trend line forming with resistance at $91,000 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move down if it settles below the $90,000 zone. Bitcoin Price Dips Further Bitcoin price failed to stay in a positive zone above the $90,000 level . BTC bears remained active below $88,800 and pushed the price lower. The bears gained strength and were able to push the price below the $87,500 zone. A low was formed at $85,276, and the price is now consolidating losses below the 23.6% Fib retracement level of the recent decline from the $92,872 swing high to the $85,276 low. Bitcoin is now trading below $90,000 and the 100 hourly Simple moving average . Besides, there is a bearish trend line forming with resistance at $91,500 on the hourly chart of the BTC/USD pair. If the bulls attempt another recovery wave, the price could face resistance near the $87,000 level. The first key resistance is near the $89,000 level and the 50% Fib retracement level of the recent decline from the $92,872 swing high to the $85,276 low. The next resistance could be $91,000 and the trend line. A close above the $91,000 resistance might send the price further higher. In the stated case, the price could rise and test the $92,500 resistance. Any more gains might send the price toward the $93,200 level. The next barrier for the bulls could be $94,500 and $95,000. More Losses In BTC? If Bitcoin fails to rise above the $90,000 resistance zone, it could start another decline. Immediate support is near the $85,500 level. The first major support is near the $85,000 level. The next support is now near the $83,200 zone. Any more losses might send the price toward the $82,500 support in the near term. The main support sits at $80,000, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $85,500, followed by $85,000. Major Resistance Levels – $87,000 and $89,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54684706,
    "published": 1763694029000,
    "title": "Bitcoin implodes as volatility from Big Tech, AI bubble fears, spreads to crypto",
    "body": "Bitcoin price corrected alongside major US equities as a tech-led sell-off and investor concerns over AI spending and a Federal Reserve policy shift hit markets hard.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54685557,
    "published": 1763695838000,
    "title": "BTC Falls Toward Mid-$80Ks as Market Structure Weakens Into Year-End",
    "body": "FlowDesk flags sustained sell pressure from old wallets, QCP notes a sudden hawkish Fed repricing, and Deribit data shows downside positioning now dominating.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|btc|btc price|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54686557,
    "published": 1763697659000,
    "title": "Trump’s WLFI Moves To Contain Wallet Breach While Federal Inquiry Looms",
    "body": "World Liberty Financial (WLFI) said it is reallocating funds and confirming user identities after several wallets were compromised ahead of its platform launch. Related Reading: XRP Supply Shock Ahead? ETFs Could Consume It All, Analyst Predicts According to WLFI’s post on X, the company froze the affected addresses in September and has been verifying ownership before moving assets back to users who pass the checks. Wallet Breaches And Response Reports have disclosed that the breaches came from either phishing attacks or exposed seed phrases, not from WLFI’s own platform or smart contracts, the company said. WLFI described the problem as linked to third-party security failures and said only a “small subset” of users were hit — though it did not give exact figures on how many accounts or how much crypto was involved. 1/ Prior to WLFI’s launch, a relatively small subset of user wallets were compromised via phishing attacks or exposed seed phrases. Since then, we’ve tested new smart contract logic to safely reallocate user funds and verified users’ identity via KYC checks. Shortly, users who… — WLFI (@worldlibertyfi) November 19, 2025 On-chain data cited by analyst Emmett Gallic of Arkham shows WLFI executed an emergency action that burned 166.67 million WLFI tokens, a move valued at $22.14 million from a compromised address, and then shifted tokens to a recovery address. That firewall step appears intended to limit further loss while the company sorts ownership questions. World Liberty Fi executed an emergency function burning 166.667M $WLFI ($22.14M) from compromised address, reallocating to a recovery address. Function designed for two scenarios: An investor loses wallet access before vesting OR malicious account acquires WLFI via exploit pic.twitter.com/VSUDWhDPCR — Emmett Gallic (@emmettgallic) November 19, 2025 Regulatory Spotlight Grows The timing of the security disclosure has drawn extra attention. Based on reports, Senators Elizabeth Warren and Jack Reed asked the DOJ and Treasury to review alleged WLFI token sales tied to sanctioned parties. Their letter referenced a watchdog report from Accountable.US that linked transactions to the Lazarus Group — a North Korea-linked actor on sanctions lists — and to an Iranian crypto exchange. It remains unclear whether the wallet compromises are related to the transactions lawmakers flagged. Experts Question On-Chain Findings Security researchers have pushed back on some of the watchdog’s claims. Taylor Moynahan of MetaMask and Nick Bax of Ump.eth said the Accountable.US analysis misread certain on-chain activity. Another day in crypto with wild allegations. Today, it’s that a North Korea-linked address invested in WLFI. I do a some DPRK crypto research myself, so I decided to take a look at their findings. They’re bad and an innocent user is out $100k because of it🧵 pic.twitter.com/yJKEH04nup — Nick Bax.eth (@bax1337) November 18, 2025 Related Reading: With 42% Of XRP Holders Underwater, Analysts Say The Altcoin Could Crash Even Further Bax argued that the report mistakenly connected a wallet tied to an individual known as “Shryder” with DPRK-linked activity, which led to the freezing of roughly $95,000 in WLFI tokens. WLFI has responded by emphasizing user protection and compliance. The company said it prioritized freezing vulnerable wallets and verifying rightful owners before any transfers. It also announced tests of revised smart contract logic meant to reduce the chance of similar breaches in future rollouts. Featured image from Gemini, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|bitcoin|crypto|North Korea|Trump|WLFI",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 205,
        "NAME": "TOKEN SALE",
        "CATEGORY": "TOKEN SALE"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54687157,
    "published": 1763698699000,
    "title": "Ethereum Price Declines Again, Consolidates Below $3K After Latest Breakdown",
    "body": "Ethereum price failed to stay above $3,000 and tested $2,770. ETH is now attempting to recover but faces resistance near $2,880. Ethereum started a fresh decline after it failed to stay above $3,000. The price is trading below $3,000 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance at $3,050 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move down if it settles below the $2,800 zone. Ethereum Price Dips Further Ethereum price failed to continue higher above $3,050 and started a fresh decline, like Bitcoin . ETH price dipped below $3,000 and entered a bearish zone. The decline gathered pace below $2,880 and the price dipped below $2,800. A low was formed at $2,770 and the price is now consolidating losses below the 23.6% Fib retracement level of the recent decline from the $3,058 swing high to the $2,770 low. Ethereum price is now trading below $3,000 and the 100-hourly Simple Moving Average . If there is another recovery wave, the price could face resistance near the $2,920 level and the 50% Fib retracement level of the recent decline from the $3,058 swing high to the $2,770 low. The next key resistance is near the $2,950 level. The first major resistance is near the $3,050 level. There is also a key bearish trend line forming with resistance at $3,050 on the hourly chart of ETH/USD. A clear move above the $3,050 resistance might send the price toward the $3,120 resistance. An upside break above the $3,120 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $3,220 resistance zone or even $3,250 in the near term. Another Drop In ETH? If Ethereum fails to clear the $2,920 resistance, it could start a fresh decline. Initial support on the downside is near the $2,770 level. The first major support sits near the $2,740 zone. A clear move below the $2,740 support might push the price toward the $2,680 support. Any more losses might send the price toward the $2,620 region in the near term. The next key support sits at $2,550 and $2,500. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI – The RSI for ETH/USD is now below the 50 zone. Major Support Level – $2,770 Major Resistance Level – $3,050",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54688132,
    "published": 1763700481000,
    "title": "XRP Price Extends Losses, Deepens Move Below $2.0 Amid Softer Sentiment",
    "body": "XRP price started a fresh decline below $2.050. The price is now struggling and faces resistance near the $2.050 pivot level. XRP price started a fresh decline below the $2.050 zone. The price is now trading below $2.050 and the 100-hourly Simple Moving Average. There is a bearish trend line forming with resistance at $2.080 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move down if it settles below $2.00. XRP Price Dips Further XRP price attempted a recovery wave above $2.120 but failed to continue higher, like Bitcoin and Ethereum . The price started a fresh decline below $2.050 and $2.020. There was a move below the $2.00 support level. A low was formed at $1.957, and the price is now consolidating losses below the 23.6% Fib retracement level of the downward move from the $2.141 swing high to the $1.9575 low. The price is now trading below $2.050 and the 100-hourly Simple Moving Average. If there is a fresh upward move, the price might face resistance near the $2.050 level and the 50% Fib retracement level of the downward move from the $2.141 swing high to the $1.9575 low. The first major resistance is near the $2.080 level. There is also a bearish trend line forming with resistance at $2.080 on the hourly chart of the XRP/USD pair. A close above $2.080 could send the price to $2.120. The next hurdle sits at $2.150. A clear move above the $2.150 resistance might send the price toward the $2.20 resistance. Any more gains might send the price toward the $2.250 resistance. The next major hurdle for the bulls might be near $2.320. More Losses? If XRP fails to clear the $2.080 resistance zone, it could start a fresh decline. Initial support on the downside is near the $1.950 level. The next major support is near the $1.920 level. If there is a downside break and a close below the $1.920 level, the price might continue to decline toward $1.880. The next major support sits near the $1.8450 zone, below which the price could continue lower toward $1.80. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $1.950 and $1.920. Major Resistance Levels – $2.050 and $2.080.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54688156,
    "published": 1763700359000,
    "title": "Crypto Sentiment Hits 'Extreme Fear' Amid $2.7 Trillion S&P 500 Wipeout",
    "body": "Widening U.S. credit spreads, overextended market gains, and an uncertain macro landscape are being blamed for Thursday's wipeout.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54688560,
    "published": 1763701211000,
    "title": "Why Bitwise Thinks Bitcoin Still Hits $200,000 In 2026",
    "body": "Ryan Rasmussen, Head of Research at Bitwise, used a Yahoo Finance appearance to restate Bitwise’s view that Bitcoin is headed to $200,000 in 2026, while simultaneously characterizing the current sell-off as a maturing-market shakeout rather than a trend break. Is The Bottom In For Bitcoin? He opened with a near-term assessment that “we’re closer to the bottom here today than we have been for the past few weeks,” linking the drawdown to sharply risk-off conditions and to ETF-era flow dynamics. In his framing, Bitcoin “really was a leader of this risk-off move starting in mid-October,” and he expects it to “be a leader to the upside once things start to turn around,” adding that the market feels nearer to that inflection than it did “a week or two weeks ago.” When asked whether spot Bitcoin ETFs have become a double-edged sword, Rasmussen agreed, describing a market that now has deeper liquidity but more cross-currents. “Bitcoin, in our view, is one of the biggest technological developments of the past 15 years,” he said, before explaining that institutionalization brings “new investors and adds more liquidity to the market,” yet also means “we’re seeing a lot more choppiness in times where risk-off moves happen.” He pointed to hedge funds rotating in and out via basis trades and emphasized that “you just have more market participants.” Over time, he expects that shift to damp volatility, but not in a straight line: “throughout that journey, we’re going to see some choppiness, and certainly over the past month, we’ve seen that.” Related Reading: Will Bitcoin Bottom At $56,000? CryptoQuant CEO Presents The Data Pressed on why volatility still looks elevated, Rasmussen separated short-horizon spikes from long-run trend. “If you look at the trend over the past 10 years, volatility has certainly been falling,” he said, but conceded that “over this short-term period, you do see spikes in volatility.” The composition of buyers is, in his view, changing in a stabilizing direction. “The buyers for Bitcoin that we’re seeing come into the market today are more long-term buyers than we’ve seen in the past,” he said, naming wealth managers and financial advisors who “are adding Bitcoin to model portfolios” and “rebalancing on a standard basis.” That institutional style of demand “should all reduce volatility, add more long-term demand,” though he also noted a counterweight: corporate treasury buying that was strong earlier in the year has faded. “The corporate treasuries that are purchasing Bitcoin were coming in in size earlier this year, and that’s really dried up,” he said, arguing that this demand pause is “in part due to this sell-off that we’ve seen in October.” Bitcoin Still Set for $200,000 By 2026 Rasmussen acknowledged the pain of lower prices for recent buyers, but insisted the medium-term path remains higher. “Lower prices are a gift and a curse, of course,” he said. “A lot of investors are feeling pain right now who bought Bitcoin above $100,000 or closer to the $125,000 mark, but we believe that Bitcoin’s going to end the year higher than it is today.” He reiterated that the short-term bottoming process is likely advanced, and then pivoted to his structural thesis: “Institutions are finally here.” He stressed that adoption is gradual rather than instantaneous: “That doesn’t mean that right away they deploy all of their capital.” Even so, he cited early signals such as endowment participation: “even Harvard, we saw with their recent filing, is buying Bitcoin in their endowment.” Related Reading: Bitcoin Capitulation Deepens Around $90K Level: Classic Late-Stage Fear Structure Emerging On macro, Rasmussen conceded an irony that an asset marketed as sovereign and untethered now reacts to central-bank expectations. Post-COVID, he said, Bitcoin has traded in a “fiscally-dominated environment where rate cuts and other macro elements do play more of a role,” and correlations to equities have “spike[d] or raise[d].” Still, he argued correlations are drifting back toward historical lows, and he emphasized Bitcoin’s tendency to do well in “low rate environments and risk on environments.” Regarding the December Fed meeting, he said “no cut in December is largely priced into the market,” and suggested investors have “already started to turn to 2026.” The price target itself was stated unambiguously. “So this year, we had a price target of $200,000. And I think it’s safe to say that come December, that’s not going to happen. But we do believe that in 2026, Bitcoin will hit $200,000,” Rasmussen said. He attributed that forecast to institutional inflows arriving “in waves,” spanning “wealth managers or endowments or pensions or corporations or governments,” which he believes are creating “a systemic imbalance of demand versus supply.” At press time, BTC traded at $91,205. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|bitcoin price prediction|bitwise|btc|BTC news|btc price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54688647,
    "published": 1763701151000,
    "title": "Bitcoiners lose their mind after Scott Bessent walks into a Bitcoin bar",
    "body": "Bitcoiners viewed US Treasury Secretary Scott Bessent’s appearance at the opening night of the Bitcoin-themed bar as “a sign” for Bitcoin.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54688646,
    "published": 1763701041000,
    "title": "Grok fan-girling Elon Musk shows why AI must be decentralized",
    "body": "Grok couldn’t stop singing Elon Musk’s praises, arguing he could beat Mike Tyson in a fight and was fitter than NBA superstar LeBron James.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54689535,
    "published": 1763702903000,
    "title": "Dogecoin (DOGE) Falls Again as Trader Sentiment Turns Increasingly Bearish",
    "body": "Dogecoin started a fresh decline below the $0.1550 zone against the US Dollar. DOGE is now consolidating losses and might face hurdles near $0.1560. DOGE price started a fresh decline below the $0.150 level. The price is trading below the $0.150 level and the 100-hourly simple moving average. There is a bearish trend line forming with resistance at $0.1550 on the hourly chart of the DOGE/USD pair (data source from Kraken). The price could extend losses if it stays below $0.1550 and $0.1620. Dogecoin Price Dips Further Dogecoin price started a fresh decline after it closed below $0.1620, like Bitcoin and Ethereum . DOGE declined below the $0.160 and $0.1550 support levels. The price even traded below $0.150. A low was formed near $0.1448, and the price is now showing bearish signs below the 23.6% Fib retracement level of the downward move from the $0.1593 swing high to the $0.1448 low. There is also a bearish trend line forming with resistance at $0.1550 on the hourly chart of the DOGE/USD pair. Dogecoin price is now trading below the $0.1550 level and the 100-hourly simple moving average. If there is a recovery wave, immediate resistance on the upside is near the $0.1520 level. The first major resistance for the bulls could be near the $0.1550 level, the trend line, and the 76.4% Fib retracement level of the downward move from the $0.1593 swing high to the $0.1448 low. The next major resistance is near the $0.1620 level. A close above the $0.1620 resistance might send the price toward the $0.170 resistance. Any more gains might send the price toward the $0.1740 level. The next major stop for the bulls might be $0.1880. More Losses In DOGE? If DOGE’s price fails to climb above the $0.1550 level, it could continue to move down. Initial support on the downside is near the $0.1450 level. The next major support is near the $0.1320 level. The main support sits at $0.1250. If there is a downside break below the $0.1250 support, the price could decline further. In the stated case, the price might slide toward the $0.120 level or even $0.1120 in the near term. Technical Indicators Hourly MACD – The MACD for DOGE/USD is now gaining momentum in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for DOGE/USD is now below the 50 level. Major Support Levels – $0.1450 and $0.1380. Major Resistance Levels – $0.1550 and $0.1620.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "DOGE|DOGE news|Doge price|DOGE USD|DOGE/BTC|DOGE/USDT|Dogecoin|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54689996,
    "published": 1763703437000,
    "title": "MSCI index likely to kick out crypto treasuries, exec warns",
    "body": "If the MSCI decides to exclude digital asset treasuries, index-tracking funds would need to sell, and that alone “creates meaningful pressure on the affected names.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54690658,
    "published": 1763704839000,
    "title": "Bitcoin Crash Dominated By US Selling, CryptoQuant Data Shows",
    "body": "On-chain analytics firm CryptoQuant has revealed how selling from US Bitcoin investors has dominated during the recent market downturn. Bitcoin Coinbase Premium Gap Points To US Selloff In a new thread on X, CryptoQuant has talked about some key pieces of data related to the US-dominated Bitcoin selloff. The first indicator that CryptoQuant has shared is the “Coinbase Premium Gap,” which keeps track of the difference between the BTC price listed on Coinbase (USD pair) and that on Binance (USDT pair). Related Reading: Dogecoin’s Strongest Support Zone Revealed—Here’s The Level As the below chart shows, the 30-hour moving average (MA) value of this metric has plummeted into the red territory recently. A negative value on the Coinbase Premium Gap indicates that the asset is trading at a price lower on Coinbase as compared to Binance. The former exchange is the preferred platform of the American investors, especially large institutional entities, while the latter one hosts a global traffic. As such, a red premium can be a sign that US-based whales are selling more than world investors. “The Coinbase Premium Gap dropped as low as -$90, which is a sign of strong U.S. selling pressure,” explained the analytics firm. Another metric that points toward extraordinary selling pressure from the American traders during the recent price decline is the cumulative return for the different trading sessions. From the above chart, it’s visible that both European and Asia-Pacific trading hours have seen an almost neutral return in Bitcoin over the past month. The American session, on the other hand, has witnessed a deep negative value. Another major way institutional entities invest in Bitcoin is through the spot exchange-traded funds (ETFs), investment vehicles that hold BTC on behalf of their investors, and allow them to gain off-chain exposure to the coin’s price movements. These funds have also witnessed outflows during the selloff in the last few weeks. ETFs have seen net outflows for three straight weeks now, which is a departure from last year’s Q4 trend, where 194,000 BTC flowed into the wallets connected with these funds, but in Q4 2025 so far, 8,000 BTC has flowed out instead. “ETF outflows continue to weigh on the BTC spot market,” noted CryptoQuant. Related Reading: Bitcoin Short-Term Holders Panic: 65,200 BTC Sent To Exchanges At Loss As for what could be next for Bitcoin, the cost basis of the spot ETFs may be worth watching for, which is located at $86,566. If the cryptocurrency breaches below this mark, holdings of the spot ETFs will go underwater. BTC Price At the time of writing, Bitcoin is floating around $92,000, down more than 10% over the last seven days. Featured image from Dall-E, CryptoQuant.com, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin Coinbase Premium Gap|bitcoin crash|Bitcoin ETFs|Bitcoin Selling|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54690829,
    "published": 1763672975000,
    "title": "AI hedge fund Numerai wins backing from top university endowments, token soars",
    "body": "Numerai’s NMR token jumped over 40% after it announced a new funding round led by major university endowments, pushing the hedge fund to a $500 million valuation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54691430,
    "published": 1763706131000,
    "title": "Plume CEO tips RWA to grow 3-5x in 2026 as it grows past crypto natives",
    "body": "Plume announced on Wednesday that Securitize, a tokenization platform backed by BlackRock and Morgan Stanley, had inked a deal to deploy institutional-grade assets on Plume’s Nest staking protocol.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54692722,
    "published": 1763708427000,
    "title": "BitMine’s Unrealized Losses Hit $3.7B As Ethereum (ETH) Price Struggles Below $3,000",
    "body": "A recent report discussed how Digital Asset Treasury (DAT) companies like BitMine and Strategy are sitting on billions of dollars of unrealized profits as Ethereum (ETH) and Bitcoin (BTC) lose crucial support levels. Related Reading: This Altcoin Soars 20% In One Day Following Major Saudi Arabia Partnership DATs To Face ‘Increasing Scrutiny’ On Thursday, crypto insights company 10x Research reported that the largest Ethereum Treasury company, BitMine Immersion Technologies, has a multi-billion-dollar paper loss after the ongoing market correction, which has sent ETH to multi-month lows. “Bitmine is now down more than $1,000 per ETH, implying about $3.7 billion in unrealized losses before even accounting for the hefty NAV [net asset value] premium public-market investors paid on top,” the report highlighted. 10x Research believes that treasury companies will struggle to attract new retail investors amid the current market environment, where existing shareholders are sitting on billions of dollars in losses. When NAV rises, “old” shareholders benefit; when it falls, the damage compounds, a dynamic DAT investors often underestimate. When the premium inevitably shrinks to zero, as it is doing now, investors find themselves trapped in the structure, unable to get out without significant damage, a true Hotel California scenario. Unlike Exchange-Traded Funds (ETFs), Digital Asset Treasuries “layer on complex, opaque, and often hedge-fund-like fee structures that can quietly erode returns,” the report added, noting that many investors are unaware that DATs embedded costs “far exceed” the management fee charged by asset managers like BlackRock on its Bitcoin (BTC) and ETH ETFs. Moreover, 10x Research argued that with the potential introduction of a staked Ethereum ETF by BlackRock, “the economics of DATs are likely to face increasing scrutiny” as retail investors reallocate to a low-cost source of yield. BitMine Remains Confident On Ethereum Despite DAT challenges and ETH’s price action, BitMine has continued to bet on the King of Altcoins. According to Lookonchain data, a new wallet suspected to be linked to the Ethereum-focused treasury company purchased 21,054 ETH, worth around $66.57 million at the time, on Tuesday night. In its November Chairman’s Message, Thomas ‘Tom’ Lee, noted that the crypto market prices have not recovered from the October 10 liquidation event, and “the lingering weakness has the hallmarks of a market maker (or two) suffering from a crippled balance sheet.” BitMine does not believe crypto prices have peaked for this cycle, he added, suggesting that “a crypto cycle top is likely 12-36 months away.” On the contrary, Lee told CNBC News on Monday that the market is “pretty close” to bottoming this week. Crypto suffered from that liquidation event on October 10th, but because the fundamental story is intact and crypto discounts the future, that’s why it’s volatile, but it still looks pretty attractive here. Related Reading: Solana Reclaims $140 As Second Wave Of SOL ETFs Debut – Is A Rebound Coming? Notably, ETH has lost the $3,000 support for the first time since July, retesting the $2,800 area on Thursday morning. However, Lee has affirmed that “Ethereum is undervalued because number one, the story is gaining relative to Bitcoin this year. But two, we’re getting this sort of intrinsic floor because of the value that the assets locked onto the Ethereum blockchain.” As of this writing, Ethereum is trading at $2,840, a 29% decline in the monthly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|10x Research|BitMine|BlackRock|crypto market correction|DATs|ETH|ETH DATS|ethereum|Ethereum ETFs|ethereum price|Ethereum treasury|ETHUSDT|Strategy|Tom Lee",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54692775,
    "published": 1763706131000,
    "title": "Plume CEO tips RWA to grow 3-5x in 2026 as it grows past crypto natives",
    "body": "Plume says that Securitize, a tokenization platform backed by BlackRock and Morgan Stanley, has inked a deal to deploy institutional-grade assets on Plume’s Nest staking protocol.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54694171,
    "published": 1763711018000,
    "title": "Bitcoin ETFs Have Bled a Record $3.79B in November",
    "body": "U.S.-listed spot BTC and ETH ETFs see record outflows.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Ethereum News|Solana News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54694740,
    "published": 1763712030000,
    "title": "Bitcoin Bear Market Confirmed? Expert Predicts Price Target Of $40,000 By Late 2026",
    "body": "Bitcoin (BTC) experienced a slight rebound after reaching a near eight-month low of $87,500 on Wednesday. By Thursday, the leading crypto surged back toward $90,000. However, market expert Leshka warns that this brief increase may signal only the start of a new distribution phase for Bitcoin, as selling pressure continues to build. Possible Bottom Between $40,700 And $47,500 In a recent post on X (formerly Twitter), Leshka assessed Bitcoin’s position on the weekly chart, identifying critical demand zones between $40,700 and $47,500 that could take shape throughout 2026. She suggested that these levels might represent the bottom for Bitcoin during the anticipated bear market. If such forecasts materialize, this could indicate price drops of 47% to 54% from current values. Related Reading: CEO Cuts Cardano Founder’s Bitcoin Price Forecast, Warns Bear Market Just Starting Despite these potential lows, Leshka remains optimistic about Bitcoin’s long-term trajectory. She mentioned that if these price targets are met, Bitcoin could rebound dramatically, reaching new all-time highs of around $150,000 by 2027. In the immediate time, however, bears appear to have the upper hand in the market. Analyst Ali Martinez recently noted that the TD Sequential indicator, which is designed to signal potential market reversals, has flashed a sell signal for Bitcoin. Historically, this indicator has been a reliable predictor of price corrections, with past occurrences resulting in drops of 78% and 32%. A median correction based on these previous downturns would indicate a possible price target of $40,000, aligning with Leshka’s forecasts for Bitcoin. Analyst Predicts Temporary Rally For Bitcoin Technical analysis from Crypto Feras also contributes to this bearish sentiment. He pointed out that Bitcoin has breached its 50-day moving average (MA50) placed above $102,000, suggesting that a period of reflection is in order. Feras indicated that the exponential moving averages (EMA89-99) could provide initial support at $88,500, typically facilitating a short-term “bearish retest” of the MA50 after a breakdown. The analyst noted that this potential rally usually lasts for two to five weeks and may see both Bitcoin and altcoins behave positively, even though investors might misinterpret it as a return to a bull market. Related Reading: BlackRock’s Bitcoin ETF Bleeds Over $500 Million In Its Biggest One-Day Outflow Additional support is noted at $84,000, which could be briefly retested. Feras suggested that this scenario might represent a final bear trap before a more prolonged downturn, a historical trend that could repeat itself. He also addressed the question of when the market might shift back into “bull mode.” According to Feras, Bitcoin will remain in a bear market as long as it trades below its weekly MA50. Once Bitcoin reclaims this important moving average, discussions regarding a potential bull market or continuation of a bull trend could resume. Until that happens, he emphasized that it is premature to label Bitcoin’s current phase as anything but bearish. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|bitcoin technical analysis|btc|BTC news|btc price|BTCUSDT|crypto|crypto news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54696363,
    "published": 1763714930000,
    "title": "Crypto Bulls See $1.7B Liquidations as Bitcoin Swiftly Nears $80K",
    "body": "The Crypto Fear & Greed Index fell to 11 on Monday — deep within “extreme fear” territory and its lowest reading since late 2022.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54697203,
    "published": 1763716510000,
    "title": "SoftBank’s PayPay changes the game for Binance Japan users",
    "body": "Operated by SoftBank, the backer of one of the world’s top 10 public Bitcoin holders, PayPay is integrating with Binance Japan ahead of its expected US IPO in December.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54696866,
    "published": 1763715915000,
    "title": "BlackRock Bitcoin ETF sheds $2.47B in November as outflows hit record $3.79B",
    "body": "BlackRock’s IBIT drives November’s record ETF outflows, bleeding $2.47 billion and accounting for 63% of the $3.79 billion withdrawn from US spot Bitcoin ETFs.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54697382,
    "published": 1763716993000,
    "title": "DOGE Chart Turns Fully Bearish After Multi-Level Support Failure",
    "body": "Technical indicators show Dogecoin is deeply oversold, trading below its 50-day and 200-day moving averages, signaling continued trend weakness.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54697942,
    "published": 1763718074000,
    "title": "Bitcoin Suffers Flash Crash to $80K on Hyperliquid Amid Market Volatility",
    "body": "BTC dropped by $3K within a minute on Hyperliquid.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54698628,
    "published": 1763719241000,
    "title": "Permabull Tom Lee Sees Bitcoin as High as $200,000 by January’s End",
    "body": "The always optimistic co-founder of Fundstrat Global Advisors believes in the long-term power of retail investors.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54698574,
    "published": 1763719240000,
    "title": "Saylor’s Strategy Under Threat: Index Status At Risk With $8 Billion On The Line",
    "body": "Michael Saylor’s Strategy, formerly known as MicroStrategy, has found itself significantly exposed to the ongoing downturn in the cryptocurrency market, which has seen more than $1 trillion in total market capitalization wiped out over the past month. As the largest public holder of Bitcoin, with over 650,000 coins, the company is now facing the real threat of being removed from major benchmark indices, which have been crucial for its visibility in mainstream portfolios. Analysts Predict Major Impact On Strategy According to a recent Bloomberg report, analysts at JPMorgan Chase have issued a warning that Saylor’s firm may lose its standing in key indices such as MSCI USA and the Nasdaq 100. Related Reading: CEO Cuts Cardano Founder’s Bitcoin Price Forecast, Warns Bear Market Just Starting The analysts assert that this could result in passive outflows estimated between $2.8 billion and $8.8 billion if MSCI proceeds with a decision expected by January 15. Passive funds connected to the company currently account for nearly $9 billion in market exposure, making any index exclusion a substantial blow. Strategy’s business model has relied on a cyclical strategy of selling stock to buy Bitcoin, capitalizing on price rallies, and repeating this process. At its zenith, Saylor’s company’s market capitalization far exceeded the value of its Bitcoin holdings. However, that premium has evaporated, and the company’s valuation now aligns closely with its crypto reserves—a stark indication that investor confidence is fading rapidly. “While active managers are not bound to adhere to index changes, exclusion from major indices would undoubtedly be viewed negatively by market participants,” noted JPMorgan analysts, led by Nikolaos Panigirtzoglou. Such a shift could affect liquidity, increase funding costs, and diminish overall investor appeal. MSCI Contemplates New Index Inclusion Rules In its ongoing consultations with stakeholders, MSCI indicated that some market players believe digital asset treasury firms (DATs) may function more like investment funds, which are ineligible for index inclusion. In accordance with these perspectives, MSCI has proposed excluding companies whose holdings in digital assets constitute 50% or more of their total assets from its global investment market indexes. Related Reading: BlackRock’s Bitcoin ETF Bleeds Over $500 Million In Its Biggest One-Day Outflow Since peaking last November, Saylor’s firm has seen its shares (MSTR) decline by over 60%, causing a collapse in the premium that once attracted momentum and crypto-focused investors. Despite this slump, Saylor’s company remains up over 1,300% since he first began purchasing Bitcoin in August 2020, outperforming major equity indices throughout this period. The selloff has extended its reach into the company’s newer funding structures, as well. The prices of its perpetual preferred shares—an essential part of Saylor’s recent strategies—have seen sharp declines. Additionally, yields on securities issued in March have risen to 11.5%, up from a previous 10.5%. A recent euro-denominated preferred stock offering has already dropped below its discounted offering price in under two weeks. Michael Youngworth, head of global convertible bond strategy at Bank of America Global Research, remarked, “That premium has collapsed in recent weeks,” adding that the present situation makes capital raising increasingly challenging. Feature image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|btc|BTC news|crypto|crypto news|Micheal Saylor|Microstrategy|MicroStrategy news|MSTR|Strategy|Strategy news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54699062,
    "published": 1763719935000,
    "title": "Nearly $1B Liquidated In an Hour as Bitcoin Plunges Below $82K",
    "body": "A leverage-driven crash liquidated nearly $1B in an hour as Bitcoin continued its slide, pushing the total crypto market cap under $3T.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54698744,
    "published": 1763719239000,
    "title": "Chinese Maker Behind Most of World’s Bitcoin Miners Has Been Focus of US National Security Probe",
    "body": "Investigators have sought to assess whether Bitmain Technologies’ products pose risks of espionage or sabotage, according to people familiar with the matter. The company says they don’t.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NCM:ABTC",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54699736,
    "published": 1763721216000,
    "title": "Ark Invest Adds Nearly $40M of Crypto Equities for Second Day as Sell-Off Continues",
    "body": "The St. Petersburg, Florida-based investment manager added to its holdings in Coinbase, Bitmine Immersion Technologies, Circle Internet and Bullish.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|ARK Invest|Cathie Wood|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54701055,
    "published": 1763723509000,
    "title": "Snipers Made $1.3M on Jesse Pollak’s Creator-Coin Debut on Base",
    "body": "Two traders captured more than $1.3 million in profits by exploiting Base’s new “flashblocks” system during the debut of the network founder’s creator coin.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Base|Creator Economy|Jesse pollak|layer 2|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54701595,
    "published": 1763724613000,
    "title": "Ethereum Dead Cat Bounce Puts Price At $3,400, But What’s The Ultimate Target?",
    "body": "Ethereum is still struggling after the initial market crash on October 10 that rocked the market. The subsequent market declines have pushed the largest altcoin by market cap toward $3,000, breaking below it for the first time at the start of the week. With the price looking to find support, there is the possibility of a dead count bounce happening that could see the price rise by more than 10%. However, with a dead count bounce being ultimately bearish, the target remains much lower. Why Ethereum Could Be Headed Lower Crypto analyst TradingShot, in a recent analysis, outlined how the Ethereum price looks to be caught in a bearish trend since early October. This had first begun after the altcoin put in a new all-time high just above $4,900 before being hit hard in the October 10 market-wide crash. Related Reading: Dogecoin Price Could Surge Above $1 As It Repeats This Trend From 2023-2024 Since then, the digital asset has been caught within a Channel Down. This Channel Down is what triggered the double-digit decline that has been recorded for the altcoin since then. As the crypto analyst explains, the Ethereum price has seen a 27.50% decline on both of its bearish legs since this trend was established. Recently, though, there has been a small turn in the tide after the price dropped below $3,000, and this happened after Ethereum formed higher lows on the 1-Day RSI. Mostly, this is bullish for the cryptocurrency’s price, but the catch is that it is likely only going to be so for the short term. If the bullish divergence does play out as expected, then the Ethereum price is definitely set for some recovery. TradingShot believes that this recovery could bring the ETH price up by 10%, pushing it up to $3,400 before the bears step back in again. However, the overall trend still remains bearish, and this could act as a hindrance to this recovery. Once the bears mount enough resistance to stop the rally in its tracks, it is expected that the decline will resume. If this plays out, then it could mean that the recovery was only a dead cat bounce. Related Reading: Here’s Why The Bitcoin Price Keeps Crashing- Is $80,000 Next? This $3,400 level lies at the 1-Day MA50, which is important because it was the point of rejection back on October 27. Last time, it led to a 27.50% crash for the Ethereum price. This time, once the sell-offs begin again, the crypto analyst believes that this could trigger a sharp crash below $3,000. The timeframe for this ranges from the end of November to the start of December, giving it only a couple of weeks to play out. The crash is expected to push Ethereum down to $2,650 before finding a bottom, marking a new lower low. Featured image from Dall.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54701621,
    "published": 1763724580000,
    "title": "Indonesia Detains Hacker Tied to Markets.com Crypto Theft After $398K Loss",
    "body": "Authorities say the suspect exploited weak backend validation to manipulate USDT balances on the trading platform.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54701592,
    "published": 1763721730000,
    "title": "Crypto Markets Today: Bitcoin, Ether Slide as Liquidity Crisis Fuels Heavy Sell-Off",
    "body": "Crypto markets plunged toward April lows on Friday as a lingering liquidity crunch amplified price swings. Bitcoin and ether fell more than 10%.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|Derivatives|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54703262,
    "published": 1763727441000,
    "title": "Tom Lee Knows Why the Crypto Market Crashed: $BEST May Be the Safest Investment Now",
    "body": "The October 10 crypto crash wasn’t just another violent wick on the chart. According to Tom Lee, chairman of Ether-focused treasury and market-making firm BitMine, the selloff exposed “structural weaknesses” within major liquidity providers that only become visible when volatility hits hard. Speaking with CNBC , Lee said the record liquidation cascade, nearly $20B wiped out in hours, forced over-leveraged market makers to rapidly unwind positions as collateral values sank. That derisking drained liquidity from order books, widened spreads, and accelerated the crash in a classic feedback loop. For regular users, that kind of liquidity vacuum isn’t just macro noise. It’s when swaps fail, fees spike, and centralized wallet pipelines become bottlenecks precisely when you need them most. When the infrastructure you rely on cracks under pressure, you’re effectively outsourcing your survival to someone else’s balance sheet. That’s why many investors are now shifting their focus from price action to tools that hold up during stress. Best Wallet is positioning its presale around that exact narrative: a mobile-first, non-custodial ecosystem built to keep users in control even when market plumbing breaks elsewhere. In a post-crash environment where structural fragility is once again front and center, that message is resonating. How a Market-Maker Liquidity Crunch Spills Into Everyday Crypto Use Lee’s point is simple but uncomfortable: when major market makers run aggressively leveraged books, a shock like the October 10, 2025, crash can flip a liquidity provider into a forced seller almost instantly. Once those books start unwinding, liquidity doesn’t just thin, it evaporates. Slippage spikes, execution quality drops, and long-tail tokens or smaller venues become structurally untradeable for hours. We’ve seen versions of this story before. Centralized exchanges and brokerages often look stable right up until volatility reveals mismatched liabilities or overextended positions. For everyday users, the question is painfully practical: How do you trade, route liquidity, or rebalance portfolios without being dependent on a single entity’s balance sheet or uptime when markets are blowing up? Different wallets are attempting their own solutions. MetaMask is leaning hard into smarter routing and institutional integrations. Trust Wallet focuses on simplicity and broad asset support for casual users. Phantom expanded from Solana to EVM chains to capture multichain retail flow. Best Wallet Token , currently in presale, aims to join this field from a different angle, pairing a consumer-grade mobile UX with a security-centric backend built on Fireblocks’ MPC-CMP infrastructure. In a cycle where liquidity reliability is suddenly front-page news again, that positioning stands out. Why Best Wallet Is Positioning Itself as “Crash-Resistant” Infrastructure Most wallets still act as thin front-ends. Best Wallet is taking a different route, building a full-stack, volatility-aware ecosystem that assumes turbulence is the norm, not the exception. The team is openly targeting 40% of the global wallet market by the end of 2026, aiming at users who want institutional-grade security packaged inside a mobile-first interface. At its core is what the team calls the first fully integrated Fireblocks MPC-CMP wallet, housed within a retail app. Instead of relying on a single private key, multi-party computation splits signing across independent shards, eliminating a single-point-of-failure while keeping transactions fast enough for everyday trading. The app’s multi-wallet portfolio system lets users cleanly separate long-term holdings, active trading, and experimental positions without juggling addresses. Beyond storage, the product places a strong emphasis on access. The Upcoming Tokens portal curates early-stage presales and embeds a streamlined purchase flow, allowing users to participate in vetted launches without jumping through third-party sites. The Best DEX aggregator , powered by Rubic, pulls routes from multiple chains, DEXs, and cross-chain bridges, optimizing trades for both price and execution in real-time. On the token side, $BEST is designed to tie utility directly to user activity. Holders receive reduced in-app fees and can stake into a dedicated 800M-token rewards pool (8% of supply). Payouts scale proportionally with each staker’s share of the pool, and staking is live during the presale, giving early buyers a head start on compounding. That pitch appears to be resonating. The presale has already raised over $17.2M with tokens priced at $0.025975 and just 7 days remaining. Whale-tracking data shows two recent large purchases totaling $136k, including a confirmed $56K buy on September 2, 2025, a signal that some larger players are willing to take early directional exposure. For anyone recalibrating after the October 2025 crypto crash, tools like Best Wallet offer a more constructive response than trying to time the exact bottom. Rather than betting on perfect entries, you can build a stack that remains flexible, fee-efficient, and self-custodial the next time liquidity disappears without warning. Join the $BEST presale today. This article is for informational purposes only and should not be considered financial, investment, or trading advice. Authored by Aaron Walker, NewsBTC – https://www.newsbtc.com/news/crypto-market-crash-october-10-2025-best-wallet-presale",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54703021,
    "published": 1763726981000,
    "title": "Philippines Bets on Sui's Move Language as Education System Struggles With Basics",
    "body": "A crypto industry-backed developer program is giving students in a remote province their first exposure to on-chain building.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54702975,
    "published": 1763726739000,
    "title": "Winklevoss twins bet on Zcash, privacy to combat AI threat",
    "body": "Cameron and Tyler Winklevoss are betting on privacy protocols gaining major traction as AI continues to grow at an exponential rate.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      }
    ]
  },
  {
    "id": 54704308,
    "published": 1763729173000,
    "title": "Here's How Digital Asset Treasuries are Holding Up as Prices Trend South",
    "body": "Major crypto treasuries face billions in paper losses amid a sustained market slump, raising concerns of forced selling.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|||||Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54704806,
    "published": 1763730000000,
    "title": "Why The Bitcoin Crash To $85,000 Is Actually Good News: Jeff Park",
    "body": "With Bitcoin trading around $85,000, Jeff Park, Partner and CIO at ProCap BTC, used his Nov. 20 conversation with Anthony Pompliano to argue that the drop may be valuable for reasons that have little to do with short-term “dip buying” and everything to do with narrative regime change. His central claim is that the classic halving-anchored rhythm is losing its foundation. Why The Bitcoin Crash Is Necessary “The four year cycle is almost definitively over,” Park said, because what it was “based off of historically, which is the halving, is just irrelevant from the additional marginal demand that comes from other channels that have opened up.” In his framing, the market is being pulled into a different cadence: “logically and fundamentally the four-year cycle should no longer exist and a new cycle should emerge that is more in sync with institutional risk capital appetite.” Related Reading: Is The Bitcoin Bottom In? Fidelity Research Lead Weighs The Odds Park is careful not to treat that as a clean break, because beliefs still move prices. He stressed that a large legacy cohort continues to trade as if the four-year script is real. “There is still a big group of investors that believe it should exist,” he said, describing them as early adopters with “characteristics that almost feel like the occult where they have prophecies.” The key, in his view, is their supply control: “the biggest Bitcoin holders in wallets that are 10,000 [BTC] and plus in size still control a good chunk of the market they are still a third of the Bitcoin market.” That concentration makes the cycle potentially reflexive: “if a third of the Bitcoin holders believe the four-year cycle is true and they act like the four-year cycle is true, well then it doesn’t really matter because they’re the price setters […] these things can be self-fulfilling.” From there, Park pivots to why weakness into year-end could be constructive. He noted that Bitcoin is now “below year to date […] in 2025,” raising the prospect of a red close. In a deliberately sharp line, he joked that if 2025 ends negative, “that breaks the four-year cycle because now we have a red [yearly candle] and so it’s a three-year cycle.” Related Reading: Why Bitwise Thinks Bitcoin Still Hits $200,000 In 2026 The humor masks a strategic preference: “maybe we do need this red [candle] right now so we could have the ability to unleash the super cycle for Bitcoin to come without ever having to talk about the four-year cycle again.” Park framed a marginally green close as the worst of both worlds. “The last thing I want honestly is […] an up 5% year to 2025 where we close at like $98K or $99K or $100K and that counts as a green year,” he said, because then “the next year everyone’s going to talk about […] this is the down year now,” leaving 2026 under the “harrowing weight over your head that we’re actually going to have another down year.” Pompliano pressed the obvious counter-scenario: “Is there a world where it could just kind of rip right back […] and go to $140,000 or something?” Park didn’t rule it out. “It’s absolutely possible. Anything can happen,” he replied. But he summarized the trade-off starkly: “we either have to hope for […] that it either goes up a lot to make the year count or we just try to notch in a small loss here for the year so we can just wipe out the four-year cycle altogether.” For Park, Bitcoin at $85,000 is “good news” only insofar as it increases the odds of breaking a self-reinforcing calendar myth, clearing the way for a market driven less by halving folklore and more by institutional risk cycles. At press time, BTC traded at $84,469. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54705043,
    "published": 1763730274000,
    "title": "Prediction Market Kalshi’s Valuation Jumps to $11B After Reported $1B Raise",
    "body": "The surge follows months of rapid trading growth and key regulatory shifts reshaping the U.S. prediction market space.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 54705647,
    "published": 1763730986000,
    "title": "ETF altseason? Solana, XRP funds buck crypto’s market sell-off",
    "body": "SOL and XRP ETFs have attracted nearly $900 million in combined inflows, highlighting rare investor conviction amid an ongoing market rout.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54705511,
    "published": 1763730986000,
    "title": "ETF altseason? Solana, XRP ETFs defy broader crypto sell-offs",
    "body": "SOL and XRP ETFs have attracted nearly $900 million in combined inflows, highlighting rare investor conviction amid an ongoing market rout.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54705717,
    "published": 1763666549000,
    "title": "Advocacy groups urge Trump to intervene in the Roman Storm retrial",
    "body": "Already convicted of one felony charge and facing a possible retrial on two others, the Tornado Cash co-founder’s future is uncertain.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54669531,
    "published": 1763666549000,
    "title": "Advocacy groups urge Trump to intervene in the Roman Storm retrial",
    "body": "Already convicted of one felony charge and facing a possible retrial on two others, the Tornado Cash co-founder’s future is uncertain.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54706073,
    "published": 1763732088000,
    "title": "Bitcoin Bounces Above $84K as Fed's Williams Puts December Rate Cut Back on Table",
    "body": "Previously having essentially written off chances of further monetary ease in 2025, interest rate traders are now pricing more than a 70% chance of a rate cut at the Federal Reserve's December meeting.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|New York Federal Reserve|John Williams|Federal Reserve|Interest Rates|Breaking News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54706298,
    "published": 1763731991000,
    "title": "Saylor’s Preferreds Boom Comes Into Question as Bitcoin Slumps",
    "body": "The plunging value of Bitcoin is piling pressure on the securities Strategy Inc. has been issuing in bulk to buy the asset, raising questions about the financing model of the world’s largest crypto treasury firm.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NMS:MSTR",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54706932,
    "published": 1763733616000,
    "title": "Scott Bessent Stirs Headlines With Surprise Visit To Bitcoin Bar",
    "body": "A surprise appearance by US Treasury Secretary Scott Bessent at the opening of a Bitcoin-themed bar in Washington, DC, has drawn sharp attention from both crypto supporters and cautious observers. Related Reading: Trump’s WLFI Moves To Contain Wallet Breach While Federal Inquiry Looms According to reports, Bessent stopped by Pubkey during its launch event, a move that many in the Bitcoin community read as a visible sign of warmer relations between parts of government and the crypto sector. Pubkey Visit Raises Eyebrows And Cheers Pubkey, a venue that bills itself as Bitcoin-friendly, has grown from a New York outpost into a small chain. Reports have disclosed that the New York location once hosted US President Donald Trump, who reportedly paid in Bitcoin during a previous visit. The Washington opening, where Bessent appeared unannounced, triggered a flurry of online reaction. Some community figures called the moment historic. Others urged caution, saying public appearances do not automatically translate into policy shifts. Had to do a second buy today using my “it was so obvious” framework. Having the Secretary of the Treasury at the Pubkey DC launch seems like a moment I could easily look back on and say “wow, it was all so obvious”. Stack Sats and chill. https://t.co/8uPWEqLJ9y pic.twitter.com/Dew1A4gkFZ — Ben Werkman (@BenWerkman) November 21, 2025 Policy Signals And Concrete Talk Based on reports, Bessent has been public about ideas that place Bitcoin on the government agenda. He has spoken about the GENIUS Act and has discussed ways the Treasury could use seized Bitcoin to seed a Strategic Bitcoin Reserve in a budget-neutral manner. In an interview dated March 7, 2025, he suggested the Treasury was exploring options that would avoid immediate sales of seized crypto and instead look for ways to keep BTC on the books. That shift in tone is being watched closely by traders and policy watchers alike. Community Reaction Was Fast Ben Werkman, a crypto fund CIO, said the event felt like a “moment” for the industry. Another industry figure, Steven Lubka, called it the sign many had been waiting for. At the same time, analysts warned about reading too much into a single photo op. One trader noted that market moves are driven by many forces, and that symbolic gestures often take time to matter for prices. Short-term traders may ignore signals like this, while longer-term holders may file them away. What This Means For Markets And Lawmakers If the Treasury takes steps to pause sales of seized BTC and to test ways of holding coins, the move could change how institutional players view the asset class. But reports also remind readers that policy ideas meet legal and budget tests before they become real. Lawmakers and regulators will have to weigh the proposal. The public nature of Bessent’s visit, though, makes the discussion harder to treat as private or theoretical. Related Reading: XRP Supply Shock Ahead? ETFs Could Consume It All, Analyst Predicts A Moment, Not A Promise The image of a cabinet official mingling at a Bitcoin bar is powerful. It gives the community talking points. Yet, officials and experts say more formal steps are required before the visit becomes policy. For now, the appearance stands as a public sign of interest, backed by statements and proposals that are still in play. Bitcoin’s supporters will note the visibility. Critics will watch for the paperwork. Photo illustration by Slate. Photos by vvelda@ymail.com/Flickr and Wavebreakmedia/iStock/Getty Images Plus, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|crypto|Pubkey|Scott Bessent",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54706929,
    "published": 1763733542000,
    "title": "GSR Expands Institutional Platform to Raise Transparency, Control in Crypto Trading",
    "body": "GSR upgraded GSR One, unifying market making, over-the-counter trading and treasury services as demand for institutional-grade crypto infrastructure increases.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|GSR|Market Makers|Institutions|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54708037,
    "published": 1763735425000,
    "title": "Coinbase to Snap up Solana-Based DEX Vector as Acquisition Spree Continues",
    "body": "The exchange’s latest deal folds Solana-native Vector into its consumer trading arm, extending a rapid M&A streak.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Coinbase|M&A|Solana News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54708372,
    "published": 1763735907000,
    "title": "Blockchain Is Key To Improving Carbon Credit Markets",
    "body": "Blockchain adoption continues to accelerate, even as crypto reminds investors that volatility is feature of the market",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54709132,
    "published": 1763737237000,
    "title": "Who’s Selling? Here’s The Demographic Driving The Bitcoin, Ethereum, And Dogecoin Price Crash",
    "body": "Recent data has revealed the demographics of sellers driving the Bitcoin, Ethereum, and Dogecoin crash. The Coinbase BTC premium index also continues to drop further in the red, which strengthens the case of where exactly the sell pressure is coming from. The Demographic Behind The Bitcoin, Ethereum, And Dogecoin Price Crash In an X post, crypto pundit Crypto Rover noted that the U.S. session has been the weakest trading session so far this month. The pundit further shared an accompanying chart, which showed that BTC has suffered a loss of around 12% in the U.S. session since the start of November, also leading to the Ethereum and Dogecoin crash. Related Reading: Why Are The Bitcoin, Ethereum, And Dogecoin Prices Down Again? Meanwhile, the EU has had the second-weakest session after the U.S., with Bitcoin dropping around 12% in this session since the start of this month. The Asian session has been the least volatile, with BTC trading sideways, recording a drawdown of only about 2% since the start of November. Ethereum, Dogecoin, and altcoins have also been stable during the Asian trading session. Crypto pundit Bossman also indicated that the U.S. was responsible for most of the sell pressure that is driving the Bitcoin, Ethereum, and Dogecoin crash. In an X post, he noted that every single American session is marked by relentless selling for hours. Meanwhile, the Asians wake up, buy it all back, and then the Americans wake up, and the selling begins again. Notably, the Bitcoin, Ethereum, and Dogecoin prices record increased volatility whenever the U.S. stock market opens, with market commentator Zerohedge attributing it to the ‘10 am slam’ by market algos. This indicates that institutional investors are heavily contributing to the market crash. This is evident in the significant outflows recorded by Bitcoin ETFs in recent times. These funds have recorded five daily net outflows over the last seven days, according to SoSoValue data. Coinbase BTC Premium Index In The Red CoinGlass data shows that the Coinbase Bitcoin premium index is in the red, further confirming that most of the sell pressure driving the BTC, Ethereum, and Dogecoin crash is coming from the U.S. Typically, a negative premium indicates that the BTC price on Coinbase is lower than the average global price, which signals weak demand from U.S. investors. Related Reading: Analyst Who Predicted Bitcoin Price October Top Is Back With A New Prediction Crypto researcher Kyle Soska noted that Bitcoin and Ethereum are roughly 10 days into a derisking event by U.S.-based entities, likely a combination of ETF users and large private, ultra-high-net-worth individuals. He further remarked that this places the market near the end of the selling episode based on historical data. Soska opined that the first of a near-term bottom would be a mean reversion of the Coinbase-Binance spot discount from its current level of around -$110 back to a more normal level range of around $40. At the time of writing, the Bitcoin price is trading at around $85,000, down over 6% in the last 24 hours, according to data from CoinMarketCap. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|Bitcoin Spot ETFs|Bossman|btc|BTC news|btc price|btcusd|BTCUSDT|Coinbase-Binance Spot Discount|Coinglass|CoinMarketCap|Crypto Rover|Dogecoin|ethereum|Kyle Soska|SoSoValue|ZeroHedge",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54709055,
    "published": 1763737097000,
    "title": "Just One Week Left Before Best Wallet Token’s Explosive $17M Presale Ends",
    "body": "What to Know: Many crypto wallets remain either centralized with single points of failure or decentralized yet fragmented and challenging to use on mobile. Users now expect a secure, cross-chain, yield-enabled wallet experience rather than a simple send-and-receive tool. The Best Wallet targets a 40% share of the global wallet market by end-2026 with a mobile-first, benefit-rich, non-custodial design. Fireblocks’ MPC, Rubic’s DEX aggregator, and curated presale access position the Best Wallet’s $BEST presale as a full DeFi command center. Crypto is in another risk-on phase, and you can see it in where capital is flowing. While meme coins still grab headlines, more money is rotating into infrastructure plays that actually solve user pain points, especially around self-custody, security, and cross-chain access. Wallets sit at the center of that shift. If you have used multiple apps, chains, and DEXs, you know the problem. Most of the best crypto wallet contenders are either custodial with clear single points of failure, or non-custodial but clunky on mobile and fragmented across chains. You get basic send and swap options, but not real advantages like curated presales, better yields, or integrated fee discounts. That gap is where Best Wallet is moving fast. Positioning itself as a next-gen crypto wallet, it combines institutional-grade MPC security and a mobile-first design. And now, thanks to its Best Wallet Token ($BEST), it’s adding a benefits layer that goes far beyond just holding tokens. 💡 The idea is simple: make self-custody feel as easy as a fintech app, but with deep DeFi hooks. With the $BEST presale already raising more than $17.2M and only a week left on the clock, Best Wallet Token is pushing to become a serious contender for users searching for the best crypto wallet experience, not just another token punt. ➡️ Learn more about the project’s fundamentals in our Best Wallet Token review, and explore detailed $BEST price forecasts to understand the full token outlook. Best Wallet Presale Targets Mass Adoption with Real User Benefits At its core, Best Wallet wants to be the wallet you actually use every day, not just another app in a folder. It is a non-custodial, no-KYC mobile wallet with multi-chain support, while integrating staking, DEX aggregation, and presale access into one streamlined interface via the Upcoming Tokens portal. The security story is anchored by a fully integrated Fireblocks’ MPC-CMP setup, so you get institutional-grade key management without seed phrases being your single point of failure. For users, the pitch is straightforward. Hold and use $BEST to reduce fees across the Best Wallet ecosystem, unlock higher APY opportunities through a staking aggregator, and get earlier, simpler access to new presales that have passed an internal vetting process. That’s in addition to governance rights. 💰 The presale has already raised over $17.2M, underscoring clear demand for a more feature-rich, mobile-first wallet stack. $BEST currently costs $0.025975 and you can stake it for 76% APY. Can $BEST Be More Than Just Another Presale Token? If Best Wallet captures even a small slice of the broader wallet market, $BEST could potentially reach levels that deliver multiple returns from the current presale price of $0.025975. 🐳 Momentum is already showing on-chain, with smart money moving in. High-net-worth wallets snapped up $BEST tokens in chunks with whale buys of $70.2K and $50K. Combine staking incentives, reduced ecosystem fees, and exclusive presale access, and you get a clear utility loop where active users are rewarded for staying inside the Best Wallet ecosystem rather than hopping between random apps or meme coins. If you are looking beyond hype-driven narratives and toward durable wallet infrastructure, this is one presale you may want on your radar. 🚨 A heads up, though. The Best Wallet Token presale is entering its final stretch with just one week before it ends. November 28 is D-day, so the clock is ticking if you want to join the presale. With a mobile-first non-custodial wallet, Fireblocks MPC security, DEX aggregation, and presale access built in, Best Wallet and its native $BEST token offer a more stable and utility-driven alternative to purely speculative plays. If you are searching for the best crypto wallet experience that bundles security, access, and rewards into one app, $BEST is positioning itself as a potential core holding rather than a side bet. 🚀 Secure $BEST before the presale ends next week. Disclaimer: This article is for informational purposes only and should not be considered financial or investment advice. Always do your own research. Authored by Aaron Walker for NewsBTC – https://www.newsbtc.com/news/best-crypto-wallet-17m-presale-ends-soon",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54709119,
    "published": 1763736946000,
    "title": "Bitcoin ASIC producer Bitmain faces US probe over national security risks: Report",
    "body": "US authorities are investigating Chinese Bitcoin mining hardware giant Bitmain over potential national security risks tied to alleged remote capabilities, according to Bloomberg.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]