[
  {
    "id": 56844075,
    "published": 1767600002000,
    "title": "Shiba Inu’s 20% Pop Signals Meme Coin Revival – Details",
    "body": "Shiba Inu (SHIB) has ridden a fresh wave of speculative buying this week, with the token jumping nearly 20% while the broader meme coin sector surged. Related Reading: $18 Million Ethereum Loss Sends Whale Running To Gold According to Santiment, total meme coin valuation rose by about 23% over the period as traders piled back into higher-risk tokens. Trading volumes jumped from $2.16 billion to roughly $8.6 billion, a whopping increase that shows how fast money rotated into this corner of the market. Supply Concentration Raises Eyebrows Reports have disclosed that supply remains highly concentrated among a handful of wallets. The top 10 holders control over 60% of SHIB’s maximum supply, which equals around 1 quadrillion tokens. 🐶📈 Meme coins, the most “speculative” of assets, have proceeded with their post-holiday run. The entire meme market cap is now above $45.3B, growing by +20.8% in just the past week. 📊 Notable 7-day gainers include: 🪙 $PEPE +54% 🪙 $USELESS +54% 🪙 $MOG +38% 🪙 $DOG +36% 🪙… pic.twitter.com/htdfiXLaLf — Santiment (@santimentfeed) January 4, 2026 Those wallets together hold about 630 trillion SHIB. Based on Santiment’s figures, the official burn wallet alone holds roughly 40% of the total supply, a stake valued at over $3 billion. This kind of concentration can magnify price swings if large holders move coins onto exchanges or sell. Technical Setup Points To A Test Analyst Charting Guy flagged the token’s weekly chart as “looking good” in a January 4 tweet, noting a strong weekly candle that closed up 22%. Based on reports, SHIB started 2026 at $0.000006904 and has since pushed higher. $SHIB weekly looks good pic.twitter.com/YigTTQ3kEW — Charting Guy (@ChartingGuy) January 4, 2026 The meme coin briefly traded above $0.0000093 before a pullback and is currently around $0.000008766. Year-to-date gains sit near 32% and the token was up 5.14% over the past 24 hours and 17.31% over the last week. Charting Guy’s chart shows SHIB approaching the tip of a long-running descending trendline that traces back to a high of $0.0000334 in December 2024. A break above that line would raise the chance of a larger move higher. Meme Coins See Wide Gains Other tokens have also posted big moves. Dogecoin recorded about a 20% rise while Pepe surged roughly 65% over the same span. The group’s sharp gains came as speculative interest accelerated and traders chased short-term returns. Related Reading: A Maduro Bet, A Market Alarm: US Lawmaker Targets Trading Abuses Market Volume And Trader Behavior Santiment’s data highlights that trading activity spiked dramatically, signaling a swift return of hot money to meme coins. The jump from $2.17 billion to $8.7 billion in daily traded value shows more participants are active and willing to take bigger risks. Based on the mix of heavy supply concentration and a crowded technical setup, Shiba Inu’s path could widen in either direction. A decisive breakout above the descending trendline might extend last week’s rally, while heavy selling from large wallets could trigger sharp pullbacks. Featured image from Gemini, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Shiba Inu News|altcoin|crypto|Dogecoin|meme coin|SHIB|Shiba Inu",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 44,
        "NAME": "SHIB",
        "CATEGORY": "SHIB"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56844980,
    "published": 1767606930000,
    "title": "Bitcoin's breakout lifts crypto equities and miners in pre-market trading",
    "body": "Bitcoin pushes above $92,000 as stocks tied to crypto, AI mining, and metals rally in pre market trading.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Marathon|Gold|MicroStrategy|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56844770,
    "published": 1767606484000,
    "title": "Bitcoin traders kick off 2026 with bets on price rally above $100,000",
    "body": "Dominant call positioning is shaping bitcoin’s price dynamics as bitcoin breaks out of its sideways range.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Deribit|Options|Derivatives|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56846878,
    "published": 1767610836000,
    "title": "XRP Is Setting Up For Its ‘Next Explosive Move,’ Analysts Say: Here’s The Target",
    "body": "XRP is approaching a decision point across the monthly and daily charts, with renowned crypto analysts The Great Mattsby (Matt Hughes) and Charting Guy (@ChartingGuy) framing the current structure as a volatility-compression setup that could resolve higher if key high-timeframe supports continue to hold. XRP Price Poised For ‘Explosive Move’ Mattsby’s core claim is that XRP has defended its long-term trend support and is now coiling for expansion. “XRP had a perfect bounce off the 20-month MA, while the upper and lower bands continue to contract—setting up for its next explosive move higher,” he wrote, adding: “It’s crazy how many people are bearish right at major high-time-frame support.” On the monthly chart, XRP is shown trading around $2.08629, sitting above the Bollinger basis near 1.89623, with the upper band labeled at $3.57705 and the lower band at $0.21541. The visual takeaway is the squeeze: the band envelope has tightened materially compared with prior periods, a condition Mattsby ties to “explosive” directional follow-through when it resolves. Related Reading: Jake Claver Doubles Down On $100 XRP Target After 2025 Miss The other important input on that panel is the 20-month moving average, which Mattsby highlights as the pivot. His October framing leans on historical rhyme: “XRP is repeating what it did back in 2017. Consolidate sideways for months until it touched the 20month MA. After that, it shot up to finish off the cycle.” In his view, the touch-and-hold dynamic is already in place this cycle, even if it’s “taking a little longer.” With the October 10 liquidation event, XRP pierced the 20-month moving average and has since consolidated above it. If that read holds, the most explicit upside reference on-chart is the monthly Bollinger upper band around $3.57705, a level that would represent a return to the top of the current volatility envelope rather than an open-ended projection. Wyckoff-Style Re-Accumulation Points To $8 Charting Guy’s daily chart overlays a Wyckoff-style roadmap and labels the sequence as a re-accumulation that transitions into markup. The yellow projection assumes XRP is still working through overhead supply, with the ~$2.08 area (marked by the blue horizontal line and aligned with the current print) acting as the immediate gatekeeper. In that framing, $2.08 is not a comfort-zone support level yet; it is a level XRP needs to reclaim decisively and then stay above on retests for the bullish sequence to keep validating. Related Reading: XRP Faces Strong Social Discontent—Is A 50% Bullish Reversal Just Around The Corner? A second constraint on the chart is the descending channel, the “creek” structure that defined the current downtrend. Charting Guy expects that XRP will rally towards the upper trendline resistance, followed by a controlled pullback labeled “test,” where price checks whether demand is real and whether sellers can still force acceptance back into the old range. If that test holds (another short-lived dip below $2.08 is fine), the roadmap then looks for an “LPS” (last point of support): a higher low that signals supply is being absorbed. Only after that does the yellow path call for “JATC” (jump across the creek), the clean breakout through the channel, followed by “SOS” (sign of strength) into the next major horizontal ceiling around ~$3.40. From there, the schematic expects another pause and “LPS” beneath that ~$3.40 zone, before the final markup leg accelerates into the ~$8 region. In short, the chart’s bullish outcome is conditional on sequential level-flips: first $2.08, then the channel, then ~$3.40 and finally $8. Until now, XRP is “following perfectly” the path, as the analyst noted via X. At press time, XRP traded at $2.13. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|xrp|xrp news|XRP Price|XRP Price Analysis|XRP Technical Analysis",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56847395,
    "published": 1767611726000,
    "title": "Bank of America will allow wealth advisers to recommend Bitcoin from Monday",
    "body": "Bank of America will enable advisers across Merrill and its private bank to recommend four spot Bitcoin ETFs, expanding beyond client-led access.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56848653,
    "published": 1767614221000,
    "title": "Fake MetaMask 2FA security checks lure users into sharing recovery phrases",
    "body": "According to SlowMist, attackers are impersonating Metamask, aiming to steal users’ secret recovery phrases.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      }
    ]
  },
  {
    "id": 56848991,
    "published": 1767615042000,
    "title": "Japan’s finance minister backs exchanges as gateway for digital assets",
    "body": "Japan’s finance minister signaled that crypto’s future lies inside regulated exchanges as Japan advances tax, disclosure, and market reforms.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56849531,
    "published": 1767616360000,
    "title": "Crypto wallet firm Ledger faces customer data breach through payment processor Global-e",
    "body": "Ledger is dealing with a new data exposure incident involving its third-party payment processor, Global-e, according to pseudonymous blockchain sleuth ZachXBT.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Ledger|Hacks|hardware-wallets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      }
    ]
  },
  {
    "id": 56849928,
    "published": 1767617006000,
    "title": "Starknet mainnet hit by fresh downtime as team probes cause",
    "body": "Starknet, an Ethereum ZK‑rollup network used for decentralized finance and gaming, is facing fresh mainnet downtime following previous outages in 2025.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56851252,
    "published": 1767619828000,
    "title": "Dogecoin Price On The Brink Of A 9,000% Rally To $10? What Historical Performance Shows",
    "body": "Dogecoin has spent a large part of the current cycle moving sideways, leaving its long-term chart largely defined by a downtrend. However, a technical study of Dogecoin’s previous market cycles, where similar stretches of compression preceded outsized price expansions, points to instances where Dogecoin can rally to price targets anywhere between $10 and $20 in the current cycle. How Dogecoin Performed During Previous Alt-Seasons A recent technical analysis shared by crypto analyst Javon Marks on the social media platform X looks at direct comparisons between Dogecoin’s current structure and the setups that led to its most dramatic rallies in the past. Related Reading: Dogecoin Long-Term Bullish Structure Still In Play And Will Cross $10 Looking back at previous market cycles, Dogecoin went through some of the biggest magnitudes of rallies, even within the volatile world of cryptocurrencies. During its first major alt-season run, Dogecoin surged by more than 9,000% from its base to reach a new peak of $0.015 in early 2018. Back then, this rally caught many doubters off guard, considering the fact that Dogecoin had no inherent value at the time and was the first mover in a niche of meme coins. What followed in the next cycle was even more extreme, with the second major expansion delivering gains of about 28,000% in 2021. This rally was enough to establish Dogecoin’s reputation as the king of meme coins, and the all-time high of $0.73 it reached back then is yet to be broken. The chart that followed Marks’ analysis shows that each rally began after prolonged periods where Dogecoin appeared largely stagnant and was trading sideways. What A 9,000% Or 20,000% Move Means For DOGE Applying those percentage gains to Dogecoin’s current price range produces eye-catching figures that propose a break above the anticipated $1 level and even above double digits. Related Reading: Dogecoin Price Could Rally To All-Time Highs If It Breaks This Resistance Level A move similar to the first major alt-season rally, roughly 9,000%, would place Dogecoin around the $10 price level. A repeat of the second cycle’s performance would push the price far higher. to as high as $20. These are ultra-bullish targets that seem unrealistic based on Dogecoin’s current price levels. However, the analyst also highlighted near-term reference zones that sit well below the most extreme projections but still reflect meaningful upside. Price levels around $0.6533 and $1.25111 were identified as more realistic milestones within a bullish scenario. Interestingly, these are also very bullish, as they represent increases of 340% and 740%, respectively, from Dogecoin’s price range around $0.15. Not everyone reading the chart arrives at the same conclusion, and that difference in interpretation was evident in comments under Marks’ post. Another Dogecoin analyst, KrissPax, responded by saying there’s a difference between a full alt-season and what he described as a relief rally. According to KrissPax, nothing in the current chart suggests a $20 Dogecoin this year. However, Marks explained that the idea is not that Dogecoin will certainly reach $10 or $20 this year, but to show what types of gains to expect if another alt-season unfolds, which is looking more and more likely. Featured image from Pngtree, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|altseason|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt|Javon Marks|KrissPax",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56851300,
    "published": 1767619645000,
    "title": "Three bullish XRP charts to watch as price gains 18% in 2026",
    "body": "XRP price gained in the first five days of 2026 as chart breakouts and steady ETF inflows produced targets near $3, with longer-term projections as high as $7-8.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56851411,
    "published": 1767619912000,
    "title": "How ZachXBT exposed a Coinbase impersonation scam using onchain clues",
    "body": "How an onchain investigator linked a Coinbase impersonation scam to $2 million in losses and why social engineering remains the real risk.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56851802,
    "published": 1767620551000,
    "title": "Ethereum can move beyond Bitcoin-style limits as new scaling tools mature: Vitalik Buterin",
    "body": "PeerDAS is already live on Ethereum's mainnet, while zkEVMs are at an advanced stage, focusing on safety and scalability.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Ethereum News|Vitalik Buterin|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56852406,
    "published": 1767622172000,
    "title": "Goldman Sachs upgrades Coinbase to buy, cuts eToro to neutral",
    "body": "The bank said it is 'selectively constructive' on brokers and crypto companies heading into 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Coinbase|eToro|Goldman Scahs|Analysts|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56853439,
    "published": 1767624210000,
    "title": "CoinDesk 20 Performance Update: Cronos (CRO) Rises 9% as Index Gains Over Weekend",
    "body": "Polygon (POL) joined Cronos (CRO) as a top performer, rising 8% from Friday.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "CoinDesk Indices|CoinDesk Indices|CoinDesk 20|charts|Prices|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 38,
        "NAME": "MATIC",
        "CATEGORY": "MATIC"
      },
      {
        "TYPE": "122",
        "ID": 75,
        "NAME": "CRO",
        "CATEGORY": "CRO"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56853987,
    "published": 1767625299000,
    "title": "Bitcoin network hashrate fell for second consecutive month in December: JPMorgan",
    "body": "Mining profitability also declined last month, with daily block reward revenue down 7%, and 32% year-on-year.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Bitcoin Mining|Hashrate|Hut 8|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56853869,
    "published": 1767625037000,
    "title": "Bitmine Immersion adds 33,000 ETH, bringing total crypto and cash holdings above $14 billion",
    "body": "Led by Chairman Tom Lee, the company now holds 4.14 million ether (ETH), or 3.4% of the total supply.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Bitmine|Ether|Ethereum Treasury|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56853657,
    "published": 1767624353000,
    "title": "CME Group’s average crypto derivatives volume hit record $12 billion in 2025",
    "body": "CME's overall average daily volume across asset classes hit an all-time high of 28.1 million contracts, with crypto being a key contributor.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|CME Group|Crypto Derivatives|Crypto Trading|Derivatives|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56854149,
    "published": 1767625594000,
    "title": "Starknet goes down for over 4 hours, team is ‘actively investigating’",
    "body": "Downtime can have knock-on effects across decentralized finance and other onchain applications.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Tech|starknet|layer 2|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56854844,
    "published": 1767626011000,
    "title": "Crypto traders can now speculate on housing prices through Polymarket",
    "body": "The crypto-based betting platform is expanding beyond politics and macro with real estate markets tied to daily housing indices.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Real Estate|Prediction Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 56855169,
    "published": 1767627646000,
    "title": "Bitcoin Reaches $93,000 Amid Renewed Optimism: What To Keep An Eye On This Week",
    "body": "On Monday, Bitcoin successfully reclaimed the $93,000 mark, spurred by a wave of renewed optimism that has also revitalized altcoins such as Ethereum (ETH), XRP, and Solana (SOL), all of which are experiencing recoveries not seen in nearly a month. According to data from CoinGecko, Bitcoin has recorded a weekly surge of 7%, while Ethereum and Solana have outperformed the leading cryptocurrency with increases of nearly 9% during the same period. Notably, XRP has taken the lead, boasting a significant 15% uptrend. Large Holders Drive Bitcoin Surge A key driver behind this recent surge, especially for Bitcoin, can be attributed to large holders, or “whales,” who have acquired approximately 270,000 BTC in the last 30 days, amounting to roughly $23 billion. Related Reading: Dogecoin Price On The Brink Of A 9,000% Rally To $10? What Historical Performance Shows Market analyst NoLimit highlighted this crucial development in a recent social media post, noting its significance: this accumulation represents 1.3% of Bitcoin’s total supply and marks the largest net buy from this group in 13 years. However, NoLimit asserts that this doesn’t imply that Bitcoin will see an immediate surge in its value. It indicates that long-term investors are aggressively positioning themselves even while the broader market sentiment remains mixed. Will BTC Establish A Macro Lower High? In the short term, though, market analyst Rekt Capital warns that despite Bitcoin hovering just above $93,400, it has closed its 12-month candle below the $93,500 mark. This suggests that the $93,500 level is likely to act as resistance moving forward. Historical patterns across four-year cycles indicate that such resistances can hinder price movement for an extended period, often resisting for up to three years before being breached in the next Halving year. Related Reading: Venezuela, Geopolitical Risk, And Bitcoin: What On-Chain Data Really Shows Should Bitcoin indeed be in the early stages of a bear market, this could imply that prices might surpass the $93,500 resistance in the coming months only to establish a macro lower high before continuing their downward trajectory. According to Rekt Capital, the sustainable breakout above this resistance is more likely to occur in the next halving year in 2028. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|bitcoin|Bitcoin news|bitcoin price|bitcoin technical analysis|btc|BTC news|btc price|BTCUSDT|crypto|crypto market|crypto news|cryptocurrency|ETH|ethereum|ethereum price|Sol|Solana|xrp|XRP Price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56855636,
    "published": 1767628605000,
    "title": "Bitcoin eyes $94,000 as crypto prices manage early U.S. gains for second straight session",
    "body": "Digital asset treasury companies — 2025's worst performers — were leading crypto-related stock gains.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Market Wrap|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56855655,
    "published": 1767628577000,
    "title": "Tom Lee Predicts $250K Ethereum Price as BitMine Adds to $13 Billion Stash",
    "body": "BitMine Immersion Technologies added to its industry-leading Ethereum stash as chairman Tom Lee made major price predictions for ETH and BMNR.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56855528,
    "published": 1767628421000,
    "title": "Japan’s finance minister says she supports crypto trading at stock exchanges",
    "body": "Finance officials signal tax and regulatory changes aimed at bringing digital assets into the financial mainstream.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Japan|crypto regulation|Crypto Trading|Finance|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56856174,
    "published": 1767629675000,
    "title": "Bitcoin rally masks fragile liquidity as spot volumes hit year-long lows",
    "body": "Bitcoin and altcoin prices have pushed higher, but Glassnode data shows spot trading activity has dropped to its weakest levels since late 2023.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin Trading|Liquidity|Spot Trading|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56856662,
    "published": 1767630621000,
    "title": "Consumer Crypto Spending Grows in 2026 as Visa Reports Major Card Growth",
    "body": "Consumer use of crypto-linked payment cards continued to gain traction heading into 2026, following a sharp rise in spending volumes reported by Visa for 2025. Data from Dune Analytics shows that spending across Visa-backed crypto cards increased steadily throughout last year, a significant growth. Related Reading: XRP Is Setting Up For Its ‘Next Explosive Move,’ Analysts Say: Here’s The Target Across six Visa-partnered crypto card programs, total net spending rose from $14.6 million in January 2025 to $91.3 million by December. The increase represents a 525% jump over the year and reflects growing consumer comfort with paying directly from crypto wallets at traditional points of sale. The cards are issued by a mix of crypto payment platforms and decentralized finance projects, including EtherFi, Cypher, GnosisPay, Avici Money, Exa App, and Moonwell. ETH's price trends slightly to the upside on the daily chart. Source: ETHUSD on Tradingview EtherFi and Cypher Lead Visa Crypto Card Spending Among the tracked programs, EtherFi recorded the highest spending volume, accounting for $55.4 million in transactions during 2025. That figure placed it well ahead of Cypher, which ranked second with $20.5 million in total spend. The remaining card issuers posted smaller but consistent increases, suggesting broader participation across the ecosystem rather than growth driven by a single outlier. Monthly spending data shows a gradual rise throughout the year, with no major spikes or sharp reversals. Analysts say this pattern points to routine usage rather than one-off events. Commenting on the data, Polygon researcher Alex Obchakevich noted that crypto card spending increasingly reflects regular financial behavior, indicating that crypto-linked cards are moving beyond experimental use cases. Visa Expands Stablecoin Infrastructure Visa’s growing role in crypto payments has been supported by its expanding stablecoin infrastructure. The payments firm now enables stablecoin settlement across multiple blockchains, including Ethereum, Solana, Avalanche, and Stellar. This setup allows card issuers to convert crypto balances to fiat in real time during transactions, while still relying on Visa’s global merchant network. In December 2025, Visa also launched a stablecoin advisory team focused on helping banks, merchants, and fintech companies design and manage stablecoin-based products. The initiative highlights Visa’s view that blockchain-based settlement and programmable money are becoming more relevant to mainstream payments. Outlook for Crypto Card Usage in 2026 With spending volumes rising and infrastructure continuing to expand, crypto card usage is expected to grow further in 2026. While volumes remain concentrated in the U.S., Europe, and parts of the Asia-Pacific region, the steady increase suggests consumer crypto spending is becoming more normalized. Related Reading: Memecoin Strength Returns After Historic Market Decline: A Setup For A Comeback? How sustained this trend will be may depend on broader market conditions and continued integration between crypto platforms and established payment networks. Cover image from ChatGPT, BTCUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|btc|btcusd|crypto",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56856547,
    "published": 1767630363000,
    "title": "Goldman Sachs sees regulation driving next wave of institutional crypto adoption",
    "body": "Regulatory clarity and expanding use cases beyond trading are setting the stage for deeper institutional participation in digital assets, the bank said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Institutional Adoption|Cryptocurrency Regulations|Goldman Sachs|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56856332,
    "published": 1767629970000,
    "title": "Robinhood leaning into advanced traders as crypto volatility reshapes user behavior",
    "body": "The trading platform is increasingly catering to advanced crypto traders with tools tailored to active, tax-aware users, its head of crypto said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Robinhood|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56857322,
    "published": 1767630516000,
    "title": "Crypto is Green! Up 6-9%! Memes outperform! Pepe up 67%! Infinex Founder Interview!",
    "body": "The global crypto market cap hit $3.16t (+1.5%) with majors trading higher; btc +2% at $93,000; eth +1% at $3,175, bnb +2.5% at $906, sol +1% at $135. Virtuals (+24%), render (_17%), btt (+11%) and fet (+11%) led top movers. The btc etfs saw $471m in net inflows on the first trading day of 2026, the highest single-day total since nov 11. Sec commissioner caroline crenshaw officially departed the agency on jan 2nd, leaving behind an all-republican commission. Big 4 firm pwc announced it will go deeper into crypto with a focus on stablecoins and payments.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56858050,
    "published": 1767633377000,
    "title": "China’s financial associations reclassify RWAs as ‘risky‘: Report",
    "body": "Wu Blockchain reported the policy change listing Real-World Asset tokenization alongside stablecoins, ”air coins,” and crypto mining as illegal activities in China.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56857729,
    "published": 1767632699000,
    "title": "Etherum's Blockchain Trilemma 'Solved': Vitalik Buterin",
    "body": "The Ethereum co-founder said upgrades allow the network to achieve decentralization, security and scalability at once.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56858124,
    "published": 1767633612000,
    "title": "Tom Lee calls for a new bitcoin ATH in January, while warning of a volatile 2026",
    "body": "The Fundstrat co-founder and Bitmine chair said bitcoin has yet to peak in January and reiterated his belief that ether is ‘dramatically’ undervalued.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Fundstrat Global Advisors|Bitmine|Thomas Lee|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56858297,
    "published": 1767620687000,
    "title": "Crypto Wallets Can ‘Directly Compete With Neobanks'",
    "body": "Bitget Wallet CMO Jamie Elkaleh tells Decrypt how the platform is evolving from a crypto wallet to a everyday finance app that seamlessly integrates crypto with TradFi, building on its vision of \"Crypto for Everyone.\" - (Sponsored post by Bitget Wallet)",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56859175,
    "published": 1767636029000,
    "title": "Analyst Updates XRP Price Prediction: Why $16 Is Still On The Table",
    "body": "A crypto analyst who previously predicted that the XRP price could rise toward $16 has now updated his outlook to a higher target. According to the revised projection, XRP is preparing to rally above $18, a level that would represent a staggering 369% surge from its current all-time high of about $3.84 Updated XRP Price Forecast Eyes Breakout Above $16 Crypto market analyst ChartNerd has updated his XRP price outlook from a previous analysis, reinforcing his bullish stance while outlining two potential market scenarios. He described the structure in his chart analysis as a Staircase to Valhalla, implying that XRP could move through distinct phases toward a higher valuation above $18, rather than experiencing a single explosive surge. Related Reading: Pi Cycle Top Put XRP Price At $300, But Is This Feasible? In his post on X, the expert stated that XRP is reacting positively from a key Vertical Accumulation Support zone that has acted as a defense barrier for roughly 13 months around $1.99. He emphasized that this area successfully held price and is now serving as the base layer for a potential continuation higher. According to the analyst’s chart, Scenario 1, which shows XRP already moving above the Vertical Accumulation Support area, remains the more bullish outcome and currently has the advantage. However, he cautions that confirmation will only come if XRP can break above the Vertical Accumulation Resistance zone between $3.1 and $3.7. If this happens, a stronger price rally can be validated. Notably, ChartNerd outlines a final “Markup” phase with a bullish target of $18-$22 for XRP. This projection reflects a steep expansion zone shown on the chart following a successful breakout from the Vertical Accumulation Resistance and a subsequent consolidation period. ChartNerd also outlines a second scenario, which presents a more bearish path for XRP. In this case, the cryptocurrency could dip below $1.5 from its current price above $2 before attempting to approach the vertical accumulation resistance again. In the near term, he agreed that XRP is currently at support and suggested that a break above $2.20 could open the door to further upside. Analyst Says 2026 Will Be A Landmark Year For XRP In a recent post, ChartNerd shared a chart highlighting a historical structure that closely mirrors XRP’s price behavior in 2016. During that period, XRP was quietly building momentum that eventually fueled its bullish surge in January 2018. Related Reading: XRP Price Mirrors 2017 Sideways Accumulation Trend – Here’s What Happened Last Time ChartNerd has suggested that if history repeats itself, 2026 could become a landmark year for XRP, potentially setting new records and marking a major milestone for the cryptocurrency. The analyst described the 2026 pattern as an uncannily similar formation, featuring the same Double Top formation and wick drop seen in the 2016 structure. Additionally, both timelines experienced a Stochastic Relative Strength Index (SRSI) reset, reinforcing the expert’s thesis that XRP could replicate its 2016 bullish trend in 2026. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|ChartNerd|double top formation|Ripple|RSI|Stochastic Relative Strength Index|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56858835,
    "published": 1767635188000,
    "title": "Grayscale declares first Ethereum staking payout for US-listed ETF",
    "body": "The cash distribution stems from staking rewards earned after the fund enabled Ethereum staking in October.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56859514,
    "published": 1767636631000,
    "title": "Price predictions 1/5: SPX, DXY, BTC, ETH, XRP, BNB, SOL, DOGE, ADA, BCH",
    "body": "Bitcoin and several major altcoins have continued their march higher, indicating improving investor sentiment and sustained demand from the bulls.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 12,
        "NAME": "BCH",
        "CATEGORY": "BCH"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56862455,
    "published": 1767642961000,
    "title": "Bitfinex Hacker Behind $11 Billion Bitcoin Heist Credits Trump for Early Prison Release",
    "body": "The White House defended the release of Ilya Lichtenstein, who stole over 119,000 Bitcoin in 2016, from prison to home confinement—but didn’t take credit for the action.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56862278,
    "published": 1767642687000,
    "title": "A few Republicans have crypto's destiny in their hands at the SEC, CFTC",
    "body": "After holiday leadership shifts, the two U.S. markets regulators — the SEC and CFTC — are now run only by pro-crypto Republicans, with Congress still debating.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|U.S. Securities and Exchange Commission|Paul Atkins|Caroline D. Pham|Mike selig|crypto legislation|U.S. Senate|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56863160,
    "published": 1767644422000,
    "title": "XRP's 9% surge leads crypto as bitcoin climbs to 6-week high near $95,000",
    "body": "Bakkt, Figure and Hut 8 were among numerous crypto-related stocks posting double-digit percentage gains.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|XRP News|Market Wrap|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56864295,
    "published": 1767646822000,
    "title": "Bitcoin’s Recovery Extends Into 2026 as Charts Hint at Another Leg Higher",
    "body": "Bitcoin (BTC) has opened 2026 with renewed momentum, extending a recovery that began in the final days of December and pushing prices back above key psychological levels. Related Reading: XRP Is Setting Up For Its ‘Next Explosive Move,’ Analysts Say: Here’s The Target After ending 2025 with a modest decline that challenged expectations around the traditional four-year cycle, the largest asset has reclaimed the $90,000 zone and is trading above $92,000. The move reflects a mix of technical breakouts, steady institutional inflows, and easing selling pressure, even with long-term skepticisms. BTC's price records moderate gains on the daily chart. Source: BTCUSD on Tradingview Technical Structure Points to Higher Levels On the daily chart, Bitcoin (BTC) has been forming a rounded base that resembles the early stages of a cup-and-handle pattern, a structure often associated with trend continuation. Recent candles have closed higher, though long upper wicks suggest some resistance near current levels. Analysts note that maintaining a sustained hold above the $89,500–$90,000 range is crucial to sustaining the bullish setup. A confirmed break above the $94,700 area could validate the pattern and open the door to a measured move toward the $100,000–$104,000 zone, implying roughly 10–12% upside from recent prices. Shorter-term indicators also show improving momentum, with higher lows forming on lower time frames and moving averages beginning to turn upward. However, elevated leverage on derivatives platforms means that pullbacks could still trigger sharp liquidations if support levels are breached. Bitcoin ETF Inflows and On-Chain Data Support the Move Beyond charts, underlying market data points to reduced distribution. Exchange inflows have dropped sharply since the end of December, signaling lower immediate selling pressure. On-chain metrics show both short-term and long-term holders moving fewer coins, suggesting a preference to hold rather than sell into strength. Institutional demand has also re-emerged through spot Bitcoin ETFs. Early January saw more than $600 million in net inflows in a single session, reinforcing the view that larger investors continue to treat Bitcoin as a portfolio allocation rather than a short-term trade. This steady accumulation has helped Bitcoin absorb macro-driven volatility, including recent geopolitical headlines that briefly lifted broader risk assets. Skepticism Remains as Market Eyes 2026 Outlook Not everyone is convinced the recovery will last. Economist Peter Schiff has reiterated his long-standing view that Bitcoin’s rally is unsustainable, arguing that recent gains in precious metals offer a stronger long-term case. Related Reading: Memecoin Strength Returns After Historic Market Decline: A Setup For A Comeback? Still, Bitcoin remains roughly 26% below its all-time high, leaving room for further debate over valuation and direction. Consequently, the market appears to be focused on whether Bitcoin can build on its early 2026 recovery. Cover image from ChatGPT, BTCUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin price|btc|btc price|btcusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56865868,
    "published": 1767650039000,
    "title": "NFT Paris cancels conferences: ‘The market collapse hit us hard‘",
    "body": "The total NFT market capitalization dropped significantly in 2025, from about $9 billion in January 2025 to just over $2.7 billion in 2026.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 56866310,
    "published": 1767651044000,
    "title": "Rapper Drake Faces RICO Lawsuit for Promoting and Using Crypto Casino Stake",
    "body": "Famed rapper Drake is one of the named defendants in a new RICO class-action lawsuit involving his actions on crypto casino Stake.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56866867,
    "published": 1767652230000,
    "title": "Why Are The Bitcoin, Ethereum, And Dogecoin Prices Rising?",
    "body": "The Bitcoin, Ethereum, and Dogecoin prices are rising today, with the flagship crypto rising to as high as $93,000. This market rally comes on the back of several factors, including the U.S.-Venezuela escalations, which have increased risk sentiment. Why The Bitcoin, Ethereum, And Dogecoin Prices Are Up In an X post, market commentator The Kobeissi Letter noted that risky assets seem to be gaining momentum despite the U.S. capture of former Venezuelan president Maduro. This suggests risk sentiment may be back after the year-end decline in 2025, which has contributed to the recent rise in Bitcoin, Ethereum, and Dogecoin prices. Related Reading: Here’s How Much BlackRock Spent Buying Bitcoin And Ethereum In 2025 The Bitcoin, Ethereum, and Dogecoin prices are also rising on the back of an increase in the M2 money supply, which now stands at $22.4 trillion, according to data from the St. Louis Fed. This is bullish for crypto assets as some of this liquidity is expected to flow into the crypto ecosystem. Meanwhile, the U.S. debt continues to rise, standing at $38.6 trillion, a development that is bullish for crypto as investors hedge against inflation by allocating to these asset classes. Meanwhile, it is worth noting that the Fed has also been carrying out its Reserve Management Purchases (RMP), which experts such as James Lavish have described as a form of quantitative easing (QE), which is positive for the prices of Bitcoin, Ethereum, and Dogecoin. BitMEX co-founder Arthur Hayes has even predicted that BTC could rally to as high as $200,000 on the back of this move from the Fed. Meanwhile, the Fed has also been injecting liquidity into the economy through the New York Fed’s repo operations. Crypto Bulls Are Back In Control Market analyst Ted Pilliows also suggested that the crypto bulls are back in control, which is why the Bitcoin, Ethereum, and Dogecoin prices are rising. In an X post, he noted that BTC has large sell orders from the $92,000 to $95,000 level on Binance. Ted added that if bulls push BTC above the $95,000 level, there is very little resistance until $100,000, suggesting a rally to this psychological level could be on the cards. Related Reading: Dogecoin Reclaiming $0.128 Support Could Signal The Perfect Chance For Long Positions In another X post, the market analyst noted that the Coinbase Bitcoin premium is recovering, with institutional demand for BTC picking up again. SoSoValue data show that Bitcoin ETFs recorded a daily net inflow of $471.14 million on January 2, their largest since December 17. A sustained daily net inflow could lead to higher prices for BTC, which is also a positive for the Ethereum and Dogecoin prices. At the time of writing, the Bitcoin price is trading at around $92,400, up in the last 24 hours, according to data from CoinMarketCap. Featured image from Pngtree, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|Arthur Hayes|bitcoin|Bitcoin news|bitcoin price|Bitcoin Spot ETFs|BitMEX|btc|BTC news|btc price|btcusd|BTCUSDT|Coinbase Bitcoin premium|CoinMarketCap|Dogecoin|ethereum|fed|Global M2 Money Supply|James Lavish|Maduro|QE|quantitative easing|Reserve Management Purchases|RMP|SoSoValue|The Kobeissi Letter",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56866834,
    "published": 1767652052000,
    "title": "Elon Musk's xAI Refuses to Rein In Grok as Non-Consensual Deepfakes Run Wild",
    "body": "Users are getting Grok to generate non-consensual images of women. Elon Musk's AI platform says this is just another form of free speech.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 56866580,
    "published": 1767651581000,
    "title": "Goldman Sachs Upgrades Coinbase, Downgrades eToro—Here's Why",
    "body": "Goldman Sachs issued a new price target for Coinbase on Monday, while upgrading the exchange to \"Buy\" from \"Neutral.\" COIN jumped 8%.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56866627,
    "published": 1767650711000,
    "title": "Stablecoin Banking Startup Kontigo to Repay Customers After Hack",
    "body": "Latin America-focused banking startup Kontigo plans to reimburse more than 1,000 customers after a hack that affected some $340,905 worth of their stablecoins, the company said in an X statement on Monday.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 56867754,
    "published": 1767654030000,
    "title": "Early XRP Investors Sell-Offs Keep Price Low, Here’s How They’re Doing It",
    "body": "XRP’s price has remained restrained despite steady activity around the asset, and recent commentary helps explain the disconnect. According to Jake Claver, CEO of Digital Ascension Group, the explanation lies beyond Ripple’s escrow releases or retail behavior, pointing instead to structural factors influencing how XRP supply reaches the market. How XRP Investors Are Selling Without Spooking The Market Claver explained in a recent post on X that large XRP sales are primarily happening through institutional channels such as over-the-counter (OTC) trades and dark pools that keep activity out of public view, rather than on public exchanges. He specifically pointed to platforms such as FalconX and Kraken’s dark pool infrastructure. These venues are designed for institutions, hedge funds, and early investors who want to move large positions without advertising their intentions on open order books. Related Reading: Popular Crypto Founder Dumps Millions In Ethereum, Here’s What He’s Buying This matters because public exchanges are highly sensitive to large sell orders. When big sales appear on an exchange, they often cause rapid price declines as other traders react. OTC desks operate differently. They match buyers and sellers privately, allowing XRP to change hands without immediate impact on visible market prices. As a result, significant amounts of XRP can be sold while the chart appears relatively stable. For early investors who accumulated XRP at much lower prices years ago, this approach is highly efficient. It allows them to gradually exit or rebalance positions while protecting execution quality. For the broader market, however, it creates a disconnect. Demand may exist, but as long as a steady supply is being released through private channels, upward price momentum remains limited. This explains why XRP can struggle to break higher even in periods of positive sentiment or strong network-related narratives. ETF Demand Is Quietly Draining The Same Liquidity Pool An important extension of Claver’s point came not from a comment beneath his original post. A reader asked for a “best estimate” on when OTC desks might run out of supply. He responded that supply is shrinking every day, with ETFs actively depleting available liquidity. Related Reading: Can Dogecoin Price Reach $1 In 2026? Analysts Reveal What To Expect This exchange is critical for understanding the bigger picture. ETFs do not typically buy XRP on public exchanges in a way that distorts price. Instead, they source liquidity through OTC desks, the same channels early investors are using to sell. This means ETFs are steadily absorbing XRP that would otherwise remain available for quiet distribution. Over time, this dynamic changes market structure. As ETFs and other institutional products continue to draw down OTC inventories, early investors will have fewer opportunities to sell large positions without touching public markets. When that happens, selling activity becomes more visible, and price discovery shifts back onto exchanges. Until OTC supply tightens meaningfully, XRP’s price may remain capped despite ongoing demand. The key takeaway is straightforward: current price suppression is not a lack of interest in XRP, but a consequence of how and where early investors are choosing to sell. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|ripple news|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56872033,
    "published": 1767662767000,
    "title": "US access to Venezuelan oil could make Bitcoin mining cheaper: Bitfinex",
    "body": "Bitcoin mining electricity costs could fall if Venezuelan oil production increases, though it may take several years before the benefits are fully realized, Bitfinex analysts say.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 16,
        "NAME": "COMMODITY",
        "CATEGORY": "COMMODITY"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56873404,
    "published": 1767665428000,
    "title": "US crypto stocks soar double-digits as major tokens rally",
    "body": "Major US crypto stocks soared on Monday as the wider crypto market mounted a comeback, with Bitcoin and Ether hitting three-week highs.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56873723,
    "published": 1767666059000,
    "title": "Coinbase rallies 8% after Goldman Sachs upgrades stock to ‘buy’",
    "body": "Goldman Sachs highlighted crypto firms building infrastructure over trading desks, seeing steady growth in tokenization and prediction markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56874049,
    "published": 1767667077000,
    "title": "Bitcoin Price Extends Surge, $95K Resistance Emerges as Next Barrier",
    "body": "Bitcoin price started a fresh increase above $92,000. BTC is now showing bullish signs but might struggle to clear the $95,000 resistance zone. Bitcoin started a fresh increase above the $92,200 zone. The price is trading above $92,500 and the 100 hourly Simple moving average. There is a key bullish trend line forming with support at $92,650 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move up if it stays above the $92,000 zone. Bitcoin Price Reaches Key Resistance Bitcoin price remained supported above the $91,200 zone and started a fresh increase . BTC gained pace for a move above the $92,000 and $92,200 resistance levels. It even surpassed $94,000. A new multi-week high was formed at $94,783 and the price is now consolidating gains. There was a minor decline below the 23.6% Fib retracement level of the recent upward move from the $90,805 swing low to the $94,783 high. Bitcoin is now trading above $92,500 and the 100 hourly Simple moving average . Besides, there is a key bullish trend line forming with support at $92,650 on the hourly chart of the BTC/USD pair. If the price remains stable above $92,500, it could attempt a fresh increase. Immediate resistance is near the $94,200 level. The first key resistance is near the $94,500 level. The next resistance could be $95,000. A close above the $95,000 resistance might send the price further higher. In the stated case, the price could rise and test the $95,800 resistance. Any more gains might send the price toward the $96,500 level. The next barrier for the bulls could be $97,000 and $97,200. Downside Correction In BTC? If Bitcoin fails to rise above the $94,500 resistance zone, it could start another decline. Immediate support is near the $93,200 level. The first major support is near the $92,800 level or the 50% Fib retracement level of the recent upward move from the $90,805 swing low to the $94,783 high. The next support is now near the $92,500 zone. Any more losses might send the price toward the $91,200 support in the near term. The main support sits at $90,000, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $92,800, followed by $92,500. Major Resistance Levels – $94,500 and $95,000.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56874729,
    "published": 1767668440000,
    "title": "Bitcoin Climbs Past $92K While Trump Signals Colombia Action",
    "body": "Bitcoin climbed past the $92,000 mark on Monday, driven by a mix of strong buying and fresh geopolitical noise. Traders watched as BTC moved toward $93,000 after brief gains in global markets, hitting roughly $92,800 in early US trading. Related Reading: Shiba Inu’s 16% Pop Signals Meme Coin Revival – Details Geopolitical Jitters And Market Moves According to market reports, comments from US President Donald Trump about potential action in Colombia added to market uncertainty, helping send flows into risk assets like Bitcoin. Traders sold some positions and then bought back into BTC as prices steadied near the highs. ETF inflows were also cited as supporting demand, with one report noting about $645 million in net flows into Bitcoin spot ETFs around the same session. Bitcoin’s climb was modest in percentage terms, but the dollar amounts grabbed attention. Data showed BTC trading in the low $92,000s before attempts to push higher toward $93,000. Reports have also pointed to liquidations and futures activity that rearranged short positions, prompting quick moves in both directions. PRESIDENT TRUMP JUST NOW: Trump: “Colombia is run by a sick man, he’s not going to be doing it for very long.” Reporter: “So there will be an operation by the US in Colombia?” Trump: “Sounds good to me.” pic.twitter.com/66fQM7cEIY — The Kobeissi Letter (@KobeissiLetter) January 5, 2026 Colombia On Trump’s Crosshairs Based on reports, the recent US operation in Venezuela and wider tensions in Latin America had a role in shifting sentiment. Speaking on Sunday, Trump took aim at Colombia over cocaine trafficking, saying a fresh US military operation tied to the country “sounds good to me,” according to Reuters. He also warned that action may be needed in Mexico. Trump described Colombia as “very sick” and accused its leader of fueling the cocaine trade into the United States, saying that situation “won’t last very long.” Total crypto market valuation at $3.12 trillion on the daily chart: TradingView Institutional Flows And Market Structure Meanwhile, spot ETF purchases and macro traders were active during the move higher. The inflows cited in market pieces suggest institutions continued to add exposure, even as headline risk rose. At the same time, derivatives desks reported notable liquidations that briefly amplified volatility. Some analysts told outlets they see technical hurdles near the current range that could cap gains without fresh catalysts. Others said the next key levels to watch are the area around $93,000 and the lows near the $88,000s to $90,000s, where stop orders and margin calls could trigger sharper swings. Related Reading: $18 Million Ethereum Loss Sends Whale Running To Gold Mixed Signals Market signals remain mixed. While ETF inflows point to steady interest from larger pools of capital, geopolitical headlines from the region keep a risk premium live in prices. Traders are watching US economic data this week as well, since work on jobs and inflation prints could alter the tone for both stocks and crypto. Bitcoin’s push above $92,000 came at a moment of heightened news flow — where comments from US President Donald Trump and big institutional buying intersected. Prices moved quickly, numbers mattered, and traders now watch whether demand can hold near current levels or if headline risk will force a pullback. Featured image from Britannica, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|btcusd|colombia|crypto|Maduro|mexico|Trump|Venezuela",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 44,
        "NAME": "SHIB",
        "CATEGORY": "SHIB"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56875042,
    "published": 1767669039000,
    "title": "Bitcoin And Risk Assets Rally As New Year's Optimism Fuels Gains",
    "body": "Bitcoin climbed alongside other risk assets like stocks on Monday, January 5, as rising optimism in the new year fueled gains.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56875208,
    "published": 1767669510000,
    "title": "Ethereum Price Pullbacks Fail to Scare Buyers, Momentum Tells a Story",
    "body": "Ethereum price started a steady upward move above $3,120. ETH is now consolidating gains and might aim for more gains above $3,250. Ethereum started a fresh increase above $3,050 and $3,150. The price is trading above $3,200 and the 100-hourly Simple Moving Average. There is a short-term bullish trend line forming with support at $3,185 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move up if it clears the $3,250 zone. Ethereum Price Remains Supported Ethereum price started a fresh increase after it settled above the $3,050 zone, like Bitcoin . ETH price gained pace for a move above the $3,120 and $3,150 resistance levels. The bulls even pumped the price toward $3,220. A high was formed at $3,264, and the price is now consolidating gains . It declined a few points below the 23.6% Fib retracement level of the recent increase from the $3,134 swing low to the $3,264 high. Ethereum price is now trading above $3,200 and the 100-hourly Simple Moving Average. Besides, there is a short-term bullish trend line forming with support at $3,185 on the hourly chart of ETH/USD. If the bulls are able to protect more losses below $3,150, the price could attempt another increase. Immediate resistance is seen near the $3,240 level. The first key resistance is near the $3,250 level. The next major resistance is near the $3,265 level. A clear move above the $3,265 resistance might send the price toward the $3,350 resistance. An upside break above the $3,350 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $3,450 resistance zone or even $3,500 in the near term. Downside Correction In ETH? If Ethereum fails to clear the $3,250 resistance, it could start a fresh decline. Initial support on the downside is near the $3,200 level or the 50% Fib retracement level of the recent increase from the $3,134 swing low to the $3,264 high. The first major support sits near the $3,185 zone and the trend line. A clear move below the $3,185 support might push the price toward the $3,120 support. Any more losses might send the price toward the $3,050 region. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI – The RSI for ETH/USD is now above the 50 zone. Major Support Level – $3,185 Major Resistance Level – $3,250",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56876692,
    "published": 1767672502000,
    "title": "XRP Price Rips Higher by 15%, Shifting Short-Term Market Structure",
    "body": "XRP price started a strong increase above $2.20. The price is now consolidating gains and might aim for more gains above the $2.40 zone. XRP price started a fresh increase above the $2.20 zone. The price is now trading above $2.350 and the 100-hourly Simple Moving Average. There is a bullish trend line forming with support at $2.1650 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move up if it settles above $2.40. XRP Price Rallies Significantly XRP price started a major upward move above $2.120 and $2.20, like Bitcoin and Ethereum . The price gained pace for a clear move above the $2.250 resistance. The bulls even pumped the price above the $2.350 zone. A high was formed at $2.416 and the price started a consolidation phase above the 23.6% Fib retracement level of the upward move from the $2.11 swing low to the $2.416 high. The price is now trading above $2.350 and the 100-hourly Simple Moving Average. Besides, there is a bullish trend line forming with support at $2.1650 on the hourly chart of the XRP/USD pair. If there is a fresh upward move, the price might face resistance near the $2.40 level. The first major resistance is near the $2.420 level, above which the price could rise and test $2.450. A clear move above the $2.450 resistance might send the price toward the $2.50 resistance. Any more gains might send the price toward the $2.550 resistance. The next major hurdle for the bulls might be near $2.650. Downside Correction? If XRP fails to clear the $2.420 resistance zone, it could start a fresh decline. Initial support on the downside is near the $2.350 level. The next major support is near the $2.260 level or the 50% Fib retracement level of the upward move from the $2.11 swing low to the $2.416 high. If there is a downside break and a close below the $2.260 level, the price might continue to decline toward $2.20. The next major support sits near the $2.1650 zone, below which the price could continue lower toward $2.020. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $2.350 and $2.260. Major Resistance Levels – $2.420 and $2.450.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56878202,
    "published": 1767675712000,
    "title": "Dogecoin 2x ETF tops early 2026 leaderboard as DOGE prints V-shaped rebound",
    "body": "A 2x Dogecoin ETF is among the best-performing ETFs to start the year, highlighting increased interest in meme coins.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56878204,
    "published": 1767675640000,
    "title": "Bitcoin Wealth Isn’t About Hype—It’s About Time And Stacking, Expert Says",
    "body": "According to an exchange on X, a user asked when Bitcoin would “boom.” A crypto expert answered bluntly that relying on a single price explosion to get rich is the wrong plan and summed up his approach as “time plus stacking.” The remark cut through the guessing and put the focus back on steady habits, not wild hopes. Related Reading: A Maduro Bet, A Market Alarm: US Lawmaker Targets Trading Abuses Bitcoin As A Store Of Value Bitcoin’s supply is fixed, with a hard cap of 21 million coins. That matters because, as Jeremie and other long-term holders point out, Bitcoin is best used to hold value you earned elsewhere. Stacking, in practice, means buying small amounts regularly. Time means keeping those holdings for years. Both together reduce the pressure to guess tops and bottoms and make the plan mechanical rather than emotional. Many buyers still chase quick gains. They ask when the next big run will hit. The answer from long-term traders is simple: hope is not a plan. Fiat money often loses buying power over time, while Bitcoin’s limited supply is designed to preserve value for those who hold through cycles. If you’re relying on #Bitcoin to “boom” to make you rich, you’re doing it wrong. Bitcoin is for storing what you earn. The win is time plus stacking. https://t.co/PDdrf3G6nv — Davinci Jeremie (@Davincij15) January 5, 2026 Price Movements And Political Ties Based on reports, Bitcoin hit a three-week high and traded above $93,000, rising as much as 2.54% on Monday morning. The token cleared its 50-day moving average for the first time since the market tumble that began in early October. Bitcoin is up about 6% so far this year after plunging roughly 22% in the fourth quarter. Ether also moved higher alongside Bitcoin as broader markets rallied. Political events, including the ouster of Venezuela’s President Nicolas Maduro by US special forces and related developments, pushed some investors toward safe-haven assets like gold and silver while not putting a clear dent in appetite for riskier bets like tech stocks. Trading activity and headline news have been linked to short-term moves in crypto prices more than once this year. How Ordinary Investors Should Act According to veteran holders, the mix of steady buying and patience beats timing the market. That is the core of Jeremie’s message. Buy small. Keep adding. Don’t watch the screen every hour. Over time, that habit smooths out the big swings and removes emotional buying at highs and panic selling at lows. Reports indicate many newcomers still treat Bitcoin like a lotto ticket. That mindset fuels big swings. When prices climb, people rush in. When they fall, sellers rush out. The strategy Jeremie described aims to flip that behavior: make accumulation routine, make holding routine. Related Reading: Crypto Users Lose Far Less To Phishing As Losses Drop 83% – Details Market Signals And A Clear Choice Traders can use signals such as moving averages to judge momentum, but technical signs are not a plan by themselves. For people who want to use Bitcoin to protect savings, the clear choice is steady accumulation plus a long holding period. For those chasing a sudden “boom,” the risk is high and the outcome uncertain — at least according to the analyst. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|crypto|Maduro|Trump|Venezuela",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56878037,
    "published": 1767675117000,
    "title": "Fund manager Bill Miller IV says Bitcoin ’looks ready to go again’",
    "body": "The crypto-friendly Trump administration and Wall Street adoption will be two of the biggest drivers behind a Bitcoin rally to new highs in 2026, two industry analysts said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56878620,
    "published": 1767676504000,
    "title": "XRP rockets 11% to nearly $2.40 as Ripple-linked ETFs see highest trading volumes",
    "body": "Spot XRP ETFs in the U.S. saw $48 million in inflows, pushing cumulative inflows past $1 billion since their November launch.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56878485,
    "published": 1767676189000,
    "title": "Grayscale's Ethereum ETF Begins Paying Staking Rewards",
    "body": "The Ethereum payout marks the first time a U.S. spot crypto product has distributed protocol-level income to investors.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56878413,
    "published": 1767676093000,
    "title": "Dogecoin (DOGE) Rally Isn’t Fading Yet—Here’s What’s Keeping It Alive",
    "body": "Dogecoin started a major increase above $0.150 against the US Dollar. DOGE is now consolidating and might decline if it trades below $0.1450. DOGE price started a fresh increase above $0.1450 and $0.150. The price is trading above the $0.150 level and the 100-hourly simple moving average. There is a bullish trend line forming with support at $0.150 on the hourly chart of the DOGE/USD pair (data source from Kraken). The price could aim for a fresh increase if it remains stable above $0.1450. Dogecoin Price Consolidates Gains Dogecoin price started a fresh increase after it settled above $0.1320, like Bitcoin and Ethereum . DOGE climbed above the $0.140 resistance to enter a positive zone. The bulls were able to push the price above $0.150. A high was formed at $0.1541 and the price is now correcting some gains. There was a move toward the 23.6% Fib retracement level of the upward move from the $0.1156 swing low to the $0.1541 high. Dogecoin price is now trading above the $0.150 level and the 100-hourly simple moving average. Besides, there is a bullish trend line forming with support at $0.150 on the hourly chart of the DOGE/USD pair. If there is another increase, immediate resistance on the upside is near the $0.1540 level. The first major resistance for the bulls could be near the $0.1550 level. The next major resistance is near the $0.1620 level. A close above the $0.1620 resistance might send the price toward $0.1750. Any more gains might send the price toward $0.180. The next major stop for the bulls might be $0.1840. Downside Break In DOGE? If DOGE’s price fails to climb above the $0.1550 level, it could start a downside correction. Initial support on the downside is near the $0.150 level and the trend line. The next major support is near the $0.145 level. The main support sits at $0.1420. If there is a downside break below the $0.1420 support, the price could decline further. In the stated case, the price might slide toward the $0.1350 level or even $0.1320 in the near term. Technical Indicators Hourly MACD – The MACD for DOGE/USD is now gaining momentum in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for DOGE/USD is now above the 50 level. Major Support Levels – $0.150 and $0.1450. Major Resistance Levels – $0.1540 and $0.1550.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "DOGE|DOGE news|Doge price|DOGE USD|DOGE/BTC|DOGE/USDT|Dogecoin|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56878359,
    "published": 1767676002000,
    "title": "Sui outperforms bitcoin and ether as Mysten Labs promotes privacy tech",
    "body": "Sui is up 14% against the CoinDesk 20 which posted a 3.5% gain as the market hopes privacy whitepaper becomes a privacy token",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Sui|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56878708,
    "published": 1767676615000,
    "title": "Bitcoin outlook bullish as whales, sharks buy retail sell-off: Santiment",
    "body": "Whales accumulated over $5.3 billion in Bitcoin since mid-December while retail traders took profits, creating bullish market conditions.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56879956,
    "published": 1767679217000,
    "title": "Bitcoin Accumulation Continues: Strategy Purchases 1,287 BTC Amid Rising Prices",
    "body": "On Monday, Strategy, formerly known as MicroStrategy, announced a new acquisition of Bitcoin (BTC) in a filing with the US Securities and Exchange Commission (SEC). Notably, this latest purchase brings the company’s total holdings to nearly 680,000 BTC, with current figures standing at 672,497 BTC. Bitcoin Buys Vs. Stock Struggles Analysts, including Lirrato on the social media platform X, revealed that the company acquired 22,498 BTC in December alone. To reach the target of 680,000 BTC by January, Strategy needs only 7,503 more coins—an amount they surpassed last month. Related Reading: Bitcoin Reaches $93,000 Amid Renewed Optimism: What To Keep An Eye On This Week However, despite this bullish acquisition, the company’s stock (MSTR) has experienced a significant decline, plummeting by over 50% throughout 2025 to its current trading price of around $163 on Monday. Adding to the challenges facing Strategy, the firm could be just ten days away from being delisted from the Morgan Stanley Capital International (MSCI) index, awaiting for the formal announcement. In an October proposal, MSCI indicated that firms holding digital assets amounting to 50% or more of their total assets should be removed from its global benchmarks. This move was justified by MSCI’s assertion that these firms resemble investment funds, which are excluded from its indexes. Strategy Braces For Potential Financial Turmoil Presently, MSCI is conducting a public consultation, and if it determines that Digital Asset Treasury (DAT) companies like Strategy should be excluded, it could set a precedent that other index providers might follow. In a public letter, Strategy’s CEO, Phong Le, and co-founder Michael Saylor discussed the possible implications of an MSCI exclusion. They estimated that such a decision could lead to around $2.8 billion worth of the company’s stock being liquidated, creating a potential chilling effect across the entire industry. Analysts from TD Cowen highlighted that approximately $2.5 billion of Strategy’s market value is tied to MSCI, while an additional $5.5 billion hinges on other indexes. JPMorgan’s analysis suggests that if MSCI were to exclude Strategy, the company could face $2.8 billion in outflows, a number that could escalate to $8.8 billion if it were delisted from additional indexes, including the Nasdaq 100, the CRSP US Total Market Index, and various Russell indexes owned by the London Stock Exchange Group (LSEG). Related Reading: Consumer Crypto Spending Grows in 2026 as Visa Reports Major Card Growth Alongside these potential challenges, Strategy may soon have to contend with substantial financial losses that starkly contrast the $2.8 billion profit they reported in the previous year’s third quarter. Additionally, the Bloomberg Billionaires Index indicates that Michael Saylor has seen his personal wealth diminish dramatically during this downturn, dropping approximately 40% to about $3.8 billion. Nevertheless, on Monday, cryptocurrency prices saw a notable recovery, with Bitcoin and other digital assets such as Ethereum (ETH), Binance Coin (BNB), Solana (SOL) and XRP climbing back above key levels, sparking a new wave of optimism among investors. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|crypto|crypto market|crypto news|Microstrategy|Strategy|Strategy Bitcoin purchase|Strategy news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56880027,
    "published": 1767679322000,
    "title": "Why 2026 Could Redefine Crypto Market Structure",
    "body": "As regulation advances and institutions scale in, 2026 is shaping up as the year crypto markets are forced to prove their resilience.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]