[
  {
    "id": 56720371,
    "published": 1767336492000,
    "title": "DeFi pioneer coughs up $50K after making a pretty bad bet on Ether",
    "body": "Ethereum OG Kain Warwick, the founder of Infinex and Synthetix, missed the mark by about $20,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56721930,
    "published": 1767339937000,
    "title": "Bitcoin ETFs lose record $4.57 billion in two months",
    "body": "Spot BTC ETFs registered their sharpest outflows on record through November and December as prices dropped 20%.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|ETFs|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56723554,
    "published": 1767343506000,
    "title": "Austin Arnold Unveils His Top 6 Crypto Altcoin Picks For 2026",
    "body": "Altcoin Daily host Austin Arnold used a Jan. 1 video titled “Top 6 Crypto Altcoins To Invest In For 2026” to lay out what he framed as three “first-time” catalysts for crypto in 2026 and a corresponding list of six altcoins he says he’d “buy and hold” into that backdrop, spanning smart-contract platforms, AI infrastructure, and tokenization-focused plays. Arnold opened with the claim that crypto sits at the center of “two mega trends”: digital assets and the tokenization of financial assets and argued the combination of macro policy, US legislation, and SEC posture could drive “trillions of dollars” of new inflows. The 3 Bullisch Crypto Catalysts First, Arnold pointed to what he described as a monetary-policy regime shift, including the resumption of “reserve management purchases,” and framed it as supportive for risk assets broadly. “We’re starting to see significant stimulus,” he said, adding that markets were already seeing “quantitative easing light” as “the Fed is starting to buy its own bonds,” while suggesting demand for government debt could fall alongside lower rates. Related Reading: Scaramucci Picks His Top 3 Crypto Altcoins As Rate-Cut Tailwinds Build Second, he argued crypto-specific regulation could function like a green light for institutional capital. He singled out the market structure focused Clarity Act, saying its passage would be “like a starter gun for ETH and SOL to run into trillions of dollars of value,” and noted discussion of a US Senate markup date of Jan. 15 with hopes of movement by late January or February. Third, Arnold highlighted what he called a tokenization push led by SEC chair Paul Atkins, describing “Project Crypto” as an effort to “bring all of traditional finance on the blockchain.” He paired that theme with a distribution angle around spot crypto ETFs, leaning on a quote he cited about how unusual the early ETF growth was: “These were the single best-selling product in the world and no one was allowed to make a phone call to sell it or advertise it,” he said. Top 6 Crypto Altcoins To Invest In For 2026 Arnold’s first pick is Ethereum. He frames it as the primary beneficiary of stablecoin growth and added that stablecoins are “mostly on the Ethereum blockchain,” and tied the thesis to regulation via the Genius Act, citing a view that Treasury Secretary Scott Bessent expects the sector to grow “10x in the next few years.” Arnold also said Ethereum’s stablecoin share rose to 53% from the high-40s “just a few months” earlier, and argued the link to ETH value accrual runs through fees: “30% of all fees on Ethereum are actually stablecoin revenue,” he said. “So as this is 10x’es the amount of fees, the amount of Ethereum being burned should be 10x to match.” Arnold’s second pick was Solana, which he portrayed as a usage leader relative to its market value versus Ethereum. He argued Solana is “already one of or if not the most used chain in crypto,” and claimed that through 2025 it was “more used than the entire rest of the industry combined times 2 to three.” He also cited a real-world asset milestone, saying Solana “RWA holders…have surpassed 125,000 holders.” Cardano is next, which Arnold said had a weak 2025 but could benefit from founder Charles Hoskinson’s push around Midnight. Arnold played a longer excerpt in which Hoskinson argued privacy could be the wedge that changes user behavior: “They can go through Midnight to Cardano and they get privacy. They do something new and different,” Hoskinson said. “Midnight my view will be through hybrid applications… private prediction markets, private DEXes, private stable coins… maybe… those Bitcoin people are going to want to trade on a private DEX instead of a public DEX.” Related Reading: Crypto ETFs Defy The Pullback With $32 Billion In Fresh Investor Cash Arnold then shifted to AI infrastructure with Bittensor (TAO), calling it “decentralized AI” plumbing and noting it had a recent “halving” and a fixed supply model he compared to Bitcoin’s. He also pointed to early-2026 ETF momentum, saying Grayscale filed an S-1 for a TAO product and Bitwise followed with a Bittensor ETF filing. For tokenization exposure, Arnold highlighted Ondo Finance (ONDO) ahead of what he described as an Ondo Summit on Feb. 3, where “world leaders, investors, policy makers” would reconvene, and closed his list with Propy, a real-estate-focused project he said is “US licensed” for title and escrow closing and “backed by Coinbase,” positioning it as a bet on bringing home buying and selling “on-chain.” Arnold closed his list with Propy, explicitly flagging it as the most speculative end of the spectrum and pairing it with a warning that lower-cap exposure can mean “these altcoins go to zero.” The Altcoin Daily host described it as “essentially real estate on-chain.” He emphasized operational and regulatory positioning as part of the pitch, saying Propy is “US licensed title and escrow closing,” and also highlighted its backers: “They’re backed again by Coinbase.” The investment thesis, as Arnold presented it, is straightforward tokenization logic applied to housing: bringing parts of the buying and selling process onto rails that can be settled and recorded on-chain, with Propy positioned as a project already operating within the US compliance perimeter he expects to matter more in 2026. At press time, the total crypto market cap stood at $2.98 trillion. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|Best Altcoins 2026|crypto|Crypto Altcoins 2026|crypto news|Top Altcoins 2026",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56725782,
    "published": 1767348292000,
    "title": "Internet Computer climbs back to $3 as short-term momentum improves",
    "body": "ICP pushed above the $3 level on rising activity, holding recent gains as traders reassess near-term direction.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Technical Analysis|ICP|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 82,
        "NAME": "ICP",
        "CATEGORY": "ICP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56727316,
    "published": 1767351649000,
    "title": "Bitcoin Price Crash To $25,000: Why The Bottom Is Much Lower",
    "body": "Crypto analyst Crypto Whale has explained why the Bitcoin price could still crash to as low as $25,000. The analyst also stated this would form the macro bottom for the leading crypto, as it recovers from this bear market. Why The Bitcoin Price Could Drop To As Low As $25,000 In an X post, Crypto Whale stated that the monthly chart suggested that the Bitcoin price could form a macro bottom near $25,000 sometime in 2026. The analyst further remarked that if history rhymes, these deep retracements tend to mark long-term accumulation zones. He added that this doesn’t signify the end of the cycle but the reset before the next expansion. However, in another X post, Crypto Whale suggested that the Bitcoin price isn’t yet in a bear market, highlighting how the 2026 bull run is likely to unfold. He stated that this month, the crypto market will see a Bitcoin-led rally, while there will be a broad altcoin expansion in February. The analyst expects the bull trap to set in in March, which he predicts would lead to volatility and panic selling. Related Reading: Analyst Reveals Why The Bitcoin Price Is Extremely Bearish Right Now Once that happens, Crypto Whale predicts that May will usher in the capitulation phase, while a full bear market confirmation will happen in June. This outlook for the Bitcoin price comes as research firm XWIN Research noted that BTC has not clearly entered a new bullish trend. The firm further stated that the crypto market remains in a high-volatility range environment, which is neither decisively bullish nor bearish. Meanwhile, XWIN Research raised the possibility that the Bitcoin price could drop to as low as $50,000. They stated that this could happen if recession risks intensify, with deleveraging and ETF outflows pushing the leading crypto below $80,000 and making $50,000 a possibility. BTC Death Cross Signals Drop To $38,000 In an X post, crypto analyst Ali Martinez drew attention to a death cross, which has been recurring on the BTC weekly chart. The analyst noted that if history repeats itself, the Bitcoin price could record a similar 50% to 60% correction, dropping to as low as $38,000 in the process. Related Reading: Bitcoin Enters Decision Phase, But What Does It Mean For The Crypto Market? This death cross between the 10-week and 50-week simple moving averages is said to have occurred in September 2014, leading to a Bitcoin price correction of 67%. It also occurred in June 2018, March 2020, and January 2022, resulting in price corrections of 54%, 53%, and 64%, respectively. Martinez opined that the zone between $50,000 and $38,000 is starting to become interesting from a long-term spot accumulation standpoint. He added that the market will confirm the next move for the Bitcoin price in its own time. At the time of writing, the Bitcoin price is trading at around $88,700, up in the last 24 hours, according to data from CoinMarketCap. Featured image from Pngtree, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|Ali Martinez|altcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|CoinMarketCap|crypto whale|etf|Simple Moving Averages|SMA|XWIN Research",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56728211,
    "published": 1767353400000,
    "title": "5 Trends Crypto Investors Can’t Ignore In 2026",
    "body": "After a year of regulatory thaw and institutional buy-in, crypto is settling into the financial system’s core.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|Money|/money|Daily Cover|daily-cover|Editors' Pick|editors-pick|premium",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56728908,
    "published": 1767355044000,
    "title": "Turkmenistan legalizes crypto mining and exchanges to boost the economy",
    "body": "The legislation aims to boost economic development and foreign investment while treating virtual assets strictly as property.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Virtual Assets Bill|Cryptocurrency Regulations|Crypto Mining|Crypto Exchanges|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56729259,
    "published": 1767355780000,
    "title": "Iran accepts cryptocurrency as payment for advanced weapons",
    "body": "Prospective customers could purchase weapons such as missiles, tanks and drones using crypto, according to a government website.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Iran|Sanctions|cryptocurrency payments|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56731118,
    "published": 1767359700000,
    "title": "PEPE, BONK post double-digit gains: Are memecoins back?",
    "body": "Memecoins added $3 billion in market cap in one day, led by PEPE’s 23% surge and the buzz around the MemeMax_Fi DEX, hinting at a possible \"meme season\" underway.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 93,
        "NAME": "PEPE",
        "CATEGORY": "PEPE"
      },
      {
        "TYPE": "122",
        "ID": 113,
        "NAME": "BONK",
        "CATEGORY": "BONK"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56733385,
    "published": 1767363750000,
    "title": "Saylor’s Strategy Faces ‘Sizable’ Fourth-Quarter Loss From Bitcoin Tumble",
    "body": "Michael Saylor has long noted that Bitcoin’s volatility “is a feature, not a bug” when pitching his cryptocurrency accumulator Strategy Inc.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NMS:MSTR",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56734025,
    "published": 1767366063000,
    "title": "Coinbase Targeting Stablecoin Growth, Onchain Adoption in 2026: Brian Armstrong",
    "body": "The exchange beat financial expectations in Q3 of last year, and it’s aiming to grow its stablecoin and payments businesses in 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56737259,
    "published": 1767373263000,
    "title": "Crypto Crystal Ball 2026: Will Ethereum Finally Start Going Parabolic?",
    "body": "Experts say major trends in Ethereum’s adoption could bring about a long-awaited surge in ETH’s price this year—or at least the start of such a journey.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56737189,
    "published": 1767373225000,
    "title": "Why JPMorgan’s GTreasury Move On The XRP Ledger Could Reshape Global Payments",
    "body": "In a development that could accelerate the evolution of cross-border financial infrastructure, JPMorgan’s GTreasury initiative on the XRP Ledger signals a potential turning point for global payments. JPMorgan’s move challenges long-standing assumptions about the role of banks in digital asset settlement and the increasing legitimacy of the XRP Ledger as a foundation for real-world transaction flows. What JP Morgan has done with GTreasury using the XRP Ledger will change payments forever. Crypto analyst Xfinancebull has revealed on X that when JPMorgan moves, it’s never for show. This was a direct integration into Ripple’s stack, allowing the Ledger to transition from Crypto Rails into the real-world plumbing for global banking. What This Means For XRP And The Broader Digital Asset Market This isn’t about transaction volume; it’s about signal, and the GTreasury system migrates only when the infrastructure is proven safe, fast, and scalable. Ripple didn’t chase relevance; it built infrastructure before the banks arrived. This integration reframes the altcoin to become a foundational layer, not a speculative asset reacting to market sentiment. Related Reading: How XRP’s Utility Will Drive Price Appreciation In The New Year The fundamentals of the XRP Ledger continue to grow massively without noise. An analyst known as Vet highlighted that while other ecosystems are struggling to fix their consensus and unique native approach for a multi-currency ledger, XRPL remains the best-in-class. The network continues to attract high-quality validators and deeply technical community members more than ever before. Education and accessibility have also reached a level where Tap has been well-designed for individuals with the apps and the XRPL.org site. On the protocol side, security has been taken to the next level with formal specifications and formal verification, which is bleeding-edge technology in crypto already used in military and aerospace systems. The payment engine is already specified, and the compliance features with DID, Credentials, and upcoming permissioned domains/DEX functionality are enabling Ripple payments to operate directly on XRPL DEX infrastructure. In addition, Evernorth $1 billion involvement in XRP is aimed at generating yield. Meanwhile, XRP ETFs continue to grow, with issuers reporting high long-term conviction among their investors in the altcoin. Even a quantum-proof encrypted XRPL test net already exists. This is a grind that involves patience, but the trajectory is upward, which has been up. How The XRPL Fits Institutional Portfolio Architecture According to the XRP Update on X (formerly Twitter), Franklin Templeton, a $1.53 trillion global asset manager, has publicly identified the XRP Ledger and XRP as a foundational building block for digital asset portfolios. Related Reading: $1.6 Trillion Asset Manager Goes Deep Into XRP, Shares Reason Behind The Move This move reinforces the altcoin’s role in institutional-grade infrastructure, making it highly scalable, liquid, and built for real-world financial use cases. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|Credentials|did|Franklin Templeton|GTreasury|jpmorgan|Ripple|Spot XRP ETFs|VET|XFinanceBull|xrp|XRP Ledger|xrp news|XRP Price|XRP Update|XRPL|XRPL DEX|XRPL.org|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 55,
        "NAME": "WALLET",
        "CATEGORY": "WALLET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56737523,
    "published": 1767373945000,
    "title": "Tom Lee urges BitMine shareholders to approve share increase ahead of January 14 vote",
    "body": "The chairman of the former bitcoin miner-turned-ether treasury firm reiterated his view that Ethereum is the future of finance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Bitmine|Ether|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56739676,
    "published": 1767378628000,
    "title": "Bitcoin Dominance Grows As Altcoins Post Another Losing Year: Analyst",
    "body": "Altcoins closed 2025 weaker versus Bitcoin, marking a fourth consecutive year of underperformance. According to market data that tracks the TOTAL3/BTC ratio — which measures all altcoins excluding Bitcoin and Ethereum against Bitcoin — the ratio finished lower for calendar years 2022, 2023, 2024 and 2025. That streak has left traders and fund managers rethinking the old pattern where smaller tokens would often surge after Bitcoin rallies. Related Reading: Crypto ETFs Defy The Pullback With $32 Billion In Fresh Investor Cash Altcoins Underperform Bitcoin Market watchers say Bitcoin’s share of the overall crypto market has grown. Bitcoin dominance was reported at roughly 59–60% during the late 2025 selloff, a level that squeezed room for other tokens. Based on reports, small-cap tokens hit their lowest point in four years as money flowed into larger, more liquid assets. Bitcoin itself slipped from an October peak and ended the year in negative territory, a development covered by major outlets that noted it was the first yearly loss for Bitcoin since 2022. Altcoins have now dropped against Bitcoin for 4 years in a row pic.twitter.com/K3rJhSh1tM — Benjamin Cowen (@intocryptoverse) January 1, 2026 Widespread Losses And Heavy Market Moves Several data providers found the median performance among the top 30 altcoins was negative for the year. Market value across the crypto sector fell sharply in late 2025, with some estimates saying more than $1 trillion was erased from total market capitalization during the downturn. Traders described 2025 as a year that began with optimism but closed with broad losses, and many small tokens that rose earlier in the year gave those gains back when risk appetite faded. What Analysts Are Saying Some analysts argue that institutional flows and investor preference for liquidity were important drivers of this trend. Others point to macro pressures in the US and global markets that reduced appetite for speculative positions. Reports note that for an altcoin rebound to beat Bitcoin again, fresh capital would need to rotate specifically into smaller tokens, rather than simply following Bitcoin’s moves. That shift has not been evident so far as 2026 unfurls. The TOTAL3/BTC measure is being used by many traders to gauge altcoin strength versus Bitcoin. When that ratio falls year after year, it means a unit of Bitcoin buys more altcoin market cap than before. Market trackers used by exchanges and analytics firms flagged the persistent downward trend across the last four calendar years, which is an unusual run relative to prior cycles when altcoins sometimes outpaced Bitcoin for parts of a market cycle. Related Reading: Crypto Exchange Korbit Fined $1.90 Million By South Korean Regulators Cautious Stance Investors are staying cautious. Volatility remains high and liquidity can dry up fast in smaller tokens, which makes large moves possible both ways. Based on reports, any meaningful restoration of altcoin gains will likely require clear, sustained capital flows and improved market sentiment. Until that happens, Bitcoin’s share of market capital will probably remain elevated, keeping pressure on smaller tokens. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|altcoins|bitcoin|btc|btcusd|crypto",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56740803,
    "published": 1767380917000,
    "title": "'Hundreds' of EVM wallets drained in mysterious attack: ZachXBT",
    "body": "The incident is potentially related to December's Trust Wallet hack, which left users drained of $7 million in cryptocurrency.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 56741508,
    "published": 1767382620000,
    "title": "Retail Traders Want Options. These Startups Are Betting On How",
    "body": "Retail options volume is surging. One startup wants to make it fun. Another wants to make it comprehensible. Both are betting on very different kinds of traders.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 56742010,
    "published": 1767384000000,
    "title": "Pi Cycle Top Put XRP Price At $300, But Is This Feasible?",
    "body": "The XRP price has been put back in the spotlight as a crypto analyst has forecasted an even more ambitious target than the widely circulated $100 projections currently gaining traction in the market. According to the analyst, XRP has just reached a critical trendline that could trigger a surge toward a Pi Cycle Top. He has shared a detailed chart outlining a roadmap for this bullish price outlook. Analyst Shares Bold $300 XRP Price Prediction A crypto analyst known on X as @Cryptobilbuwoo0 has released a fresh update on XRP, examining its long-term cycle behaviour in 2026. He predicts that the XRP price could surge dramatically, potentially rising from its current low below $2 to as high as $300. Related Reading: Here’s Why The XRP Price Will Shine In The New Year Backing his bold forecast, the analyst noted that XRP recently touched a major green support line on its chart and is now showing early signs of a bullish reversal. He explained that this interaction with support has raised the question of whether the price action is repositioning for a new Pi Cycle Top, a signal typically associated with extreme market peaks. Notably, the chart shared alongside the analysis shows XRP price data stretching from 2014 into future projections beyond 2026. Price action is contained within a rising channel defined by white parallel trendlines, with the green line marking the lower boundary of the long-term support. Previously, whenever XRP reached this green support line, a breakout phase followed shortly. These breakouts often triggered explosive rallies that climbed through the rising channel and peaked near Pi Cycle top markers placed at earlier highs. On the right side of the chart, the crypto expert has highlighted several price targets, including $20, $100, $300, and $1000. The $300 level is near the top of the rising channel, indicating where a future Pi Cycle top could form if XRP follows its historical path. The momentum indicator at the bottom of the chart also shows upward oscillations, with the analyst’s projections for XRP extending deep into 2026 and beyond. Why A $300 XRP Price Might Not Be Feasible While the possibility of XRP reaching $300 is supported by @Cryptobilbuwoo0’s technical analysis, the cryptocurrency is currently trading at $1.83–more than 99% below the projected target. For XRP to achieve such an explosive surge, favorable market conditions would need to align, including stronger investment sentiment and sustained buying pressure. Related Reading: Pundit Shares Why XRP Will Become Expensive And A $1,000 Price Tag Is Possible At present, however, XRP’s price structure appears weak. Its value has been declining and consolidating at lower levels for several months, while overall market sentiment has turned negative. This is reflected in XRP’s Fear and Greed Index, which currently indicates more fear than confidence among investors. Even analysts like Nick, a known crypto crusader and researcher, have stated that XRP is unlikely to reach $100 by the end of 2026. Based on his assessment, a $300 price projection appears even less attainable. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|@Cryptobilbuwoo0|Pi Cycle Top|Ripple|xrp|xrp news|XRP Price|XRP’s Fear and Greed Index|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56744454,
    "published": 1767389425000,
    "title": "XRP Enters A Make-or-Break Zone As This Long-Term Support Cracks",
    "body": "XRP is facing a critical turning point as key long-term support gives way for the first time in over 400 days. After consolidating near $2, the recent break below the 200-day moving average signals mounting pressure, putting the cryptocurrency in a high-stakes zone where the next move could define its near-term trajectory. Price Stalls Below The $2 Wall As Volatility Compresses In an X post, Umair Crypto noted that XRP has faced heavy resistance near the psychological $2 level, forcing the price into a tight consolidation range between $1.85 and $1.88. Such conditions often precede a sharp move, suggesting XRP may be nearing a decisive breakout or breakdown phase. Related Reading: Expert Says XRP ‘Haters’ Miss The Bigger Picture: Here’s What It Is On the daily timeframe, XRP still displays signs of resilience despite the overhead pressure. Buyers have so far managed to defend nearby support zones, preventing a clean breakdown in structure. This defensive price action keeps the broader bullish scenario alive, especially if momentum improves and XRP reclaims higher levels with stronger volume confirmation. However, a wider view from the 3-day chart introduces caution. The current support region aligns closely with the 200-day simple moving average. XRP’s latest close below this moving average marks the first time in more than 400 days, highlighting a notable technical shift that could weigh on sentiment if not quickly reversed. This development places XRP at a critical inflection point. The chart shows a relatively thin historical structure following the explosive November 2024 rally that lifted the price from $0.50 to $3. With fewer well-defined demand zones beneath, any acceleration in selling pressure could lead to faster downside moves. Umair Crypto identified interim support levels around $1.45, $1.10, and $0.69 as potential downside targets if a confirmed breakdown unfolds. Attention remains firmly on the coming sessions, particularly as Ripple’s recent $1 billion token unlock introduces additional supply, adding another layer of pressure to an already sensitive market setup. XRP Former Ceiling Turns Into A Structural Floor According to a monthly XRP update shared by crypto analyst Chad, the asset is currently holding above a key level that previously acted as resistance and has now flipped into support. This shift suggests that buyers are still defending the structure, keeping the broader setup constructive despite recent price action hesitation. Related Reading: XRP Price Slides Under Support, Bearish Continuation Signals Emerge A clear double-top formation can be spotted on the chart. However, Chad notes that it does not have to fully play out as long as XRP continues to hold above the 0.786 logarithmic Fibonacci level. Overall, XRP appears to be in a consolidation phase rather than a decisive move. Price action is currently contained within the 0.786 to 0.886 log Fibonacci range, signaling a period of balance as the market awaits a clearer directional catalyst. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Chad|Fibonacci Level|m&a|moving average|Ripple|Umair Crypto|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56745363,
    "published": 1767391407000,
    "title": "Binance delists FLOW/BTC pair, flags token after exploit",
    "body": "The largest crypto exchange by trading volume announced two moves related to the FLOW token following the project's foundation updating users on a $3.9 million exploit.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 125,
        "NAME": "FLOW",
        "CATEGORY": "FLOW"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 56746850,
    "published": 1767394852000,
    "title": "Jake Claver Doubles Down On $100 XRP Target After 2025 Miss",
    "body": "Jake Claver, a renowned XRP promoter and CEO of Digital Ascension Group, is again leaning into a familiar XRP thesis: behind-the-scenes institutional adoption, NDAs, and “domino” catalysts, only days after analyst Zach Rector publicly criticized Claver’s failed “$100 XRP by end of 2025” prediction as misleading. $100 XRP Only Delayed, Says Claver In a post on Jan.1, Claver responded: “Timelines always get extended,” and added: “I should know this by now from all that we’ve built in the past 3 years, working with partners and regulators. I’m sure Ripple and many others have felt and still feel the same way after 13.5 years. The Domino Theory still stands, Real world events will play out, and XRP will become the backbone of markets in the future.” In a series of posts spanning Dec. 27 through Jan. 1, Claver argued that “real world events will play out, and XRP will become the backbone of markets in the future.” A Jan. 1 post focused on Ripple’s non-disclosure agreements, which Claver described as a signal that large counterparties are already preparing to build with XRP. Related Reading: Expert Says XRP ‘Haters’ Miss The Bigger Picture: Here’s What It Is “Ripple signing over 1,700 non-disclosure agreements probably isn’t random,” he wrote. “These most likely cover talks with major players—governments, global banks, payment networks, big universities, and Fortune 500 firms—all laying the groundwork to use XRP. The pieces for mass adoption have been falling into place behind the scenes for quite a while.” Earlier posts pressed the same point with higher conviction. On Dec. 28, Claver claimed: “Major institutions are stacking up XRP behind the scenes while keeping the public in the dark. The current price is merely a shadow of what’s coming. When XRP transforms into the foundation of international finance, today’s hesitation will become tomorrow’s regret. In my opinion, nothing in crypto space offers this level of certainty and potential for massive returns.” Related Reading: XRP At Risk Of A Drop To $0.80? Analyst Makes The Case On Dec. 31, he described XRP “as built to upgrade the existing financial system,” while adding that “blockchain isn’t just for storing value, it can power a faster, more open financial system. For that, you need high-performance infrastructure like XRP.” As reported on Bitcoinist yesterday, Rector’s criticism has been less about making bold forecasts than about the way they are delivered. Rector argued there was “no plausible scenario” for a roughly 5,000% move in the time window implied by the $100 call, and that the messaging leaned on suggestions of privileged insight rather than probabilistic framing. Rector’s allegations also extended beyond price talk into claims about XRP-focused funds associated with Claver’s orbit. “Jake and his scheme, his business has grown so big they’ve taken in so much XRP from our community,” Rector said. “There’s a massive discrepancy from what he’s saying publicly and what investors are telling me privately.” At press time, XRP traded at $1.89. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|Jake Claver|xrp|xrp news|XRP Price|XRP Price Prediction",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56748477,
    "published": 1767398405000,
    "title": "Altcoin Season Setup Advances: CEX Volume Hits Cycle Highs Despite Price Weakness",
    "body": "Altcoin season was widely anticipated for 2025, but the reality has unfolded very differently. Instead of a broad-based rally, most altcoins suffered deep and prolonged drawdowns, erasing years of gains and forcing many investors out of the market. As 2026 approaches, sentiment around altcoins remains fragile. A growing number of analysts now warn that the worst may not be over, arguing that structural weakness, declining liquidity, and fading retail participation could drive another leg lower across the sector. Related Reading: Ethereum Liquidity Rebuilds On Binance: December Inflows Signal Strategic Repositioning Market data reinforces this cautious outlook. The Crypto Total Market Cap, excluding the top 10 assets—commonly referred to as the OTHERS index—has collapsed by more than 50% since December 2024. Market capitalization has fallen from roughly $451 billion to around $182 billion in just twelve months, highlighting the scale of capital destruction across mid- and small-cap tokens. This sharp contraction reflects aggressive de-risking, weak demand, and sustained selling pressure across the altcoin market. However, not all analysts are convinced the altcoin cycle is finished. A smaller group points to historical precedents, arguing that periods of extreme underperformance and investor capitulation have often preceded powerful altcoin recoveries. From this perspective, 2026 could mark the delayed arrival of an altcoin season—if liquidity conditions improve and capital rotation resumes. Altcoin Trading Activity Remains Elevated Despite Price Weakness A recent CryptoQuant report challenges the widely held belief that this cycle has produced “no altcoin season.” According to the data, centralized exchange trading volume for altcoins—excluding the top five assets—has reached levels significantly higher than those seen in previous market cycles. In other words, altcoins are being traded more actively than ever, even as prices remain deeply depressed across much of the market. This divergence between volume and price helps explain the prevailing confusion. While many tokens have lost a substantial portion of their value, on-chain and exchange data show that activity has not disappeared. Instead, the market has undergone a structural shift. Retail participation has largely faded after months of losses, with many smaller investors capitulating and exiting positions. Their absence, however, has not resulted in lower overall trading activity. CryptoQuant’s analysis suggests that altcoin dominance has increasingly concentrated among larger players. Whales and professional participants now account for a growing share of altcoin volume, using periods of low liquidity and weak sentiment to accumulate positions or actively rotate capital. From this perspective, the current phase may not signal the absence of an altcoin cycle, but rather its transformation. If whale-driven positioning continues and broader market conditions improve, these participants are likely to push prices higher to maximize returns. Related Reading: Bitcoin Miner Distribution Re-Emerges: BTC Enters A Fragile Price Phase OTHERS Market Cap Shows Prolonged Compression The OTHERS chart, which tracks the total crypto market capitalization excluding the top 10 assets, highlights the depth and duration of the ongoing altcoin correction. After peaking near $450 billion in late 2024, the market has lost more than half of its value, stabilizing around the $200–210 billion zone. This sharp contraction confirms that the altcoin market has experienced a full reset rather than a shallow pullback. From a technical perspective, the structure reflects prolonged compression. Price is currently oscillating around the 200-week moving average (red), a level that historically acts as a long-term equilibrium zone during transitions between bearish and recovery phases. The failure to reclaim the 100-week and 50-week moving averages suggests that upside momentum remains weak and that buyers lack conviction at higher levels. Related Reading: Bitcoin Supply In Profit Sets The Stage For Bullish Cross In Q1 2026 Volume dynamics reinforce this view. While periodic spikes appear during sell-offs and relief rallies, there is no sustained expansion in volume that would signal broad-based accumulation. This implies selective positioning rather than widespread risk appetite. Importantly, the market is no longer making aggressive lower lows, indicating that forced selling may be largely exhausted. However, the absence of higher highs keeps the structure neutral-to-bearish. For a meaningful altcoin recovery, OTHERS would need to reclaim the $260–280 billion range and hold above key moving averages. Until then, the chart suggests consolidation, dominance by larger players, and a market still searching for a durable bottom rather than the start of a classic altcoin season. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|altcoin|altcoin analysis|altcoin news|Altcoin Season|Altcoin season news|Altcoin Volatility|Altcoin Volume|Total 3",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56750095,
    "published": 1767402030000,
    "title": "XRP Under $2? One Of The ‘Greatest Blessings’ We’ll See In Our Lifetime, Analyst Says",
    "body": "A well-known finance coach in the XRP community has urged patience, calling the cryptocurrency’s price sliding under $2 a rare long-term chance to buy. According to his public posts, he described XRP trading below $2 as “one of the greatest blessings of our lifetime” and said he remains actively accumulating at current levels. Related Reading: Crypto Exchange Korbit Fined $1.90 Million By South Korean Regulators XRP Below $2 Seen As Entry Point Coach JV’s portfolio centers on a mix of major coins and infrastructure tokens. His top crypto holdings include XRP, Bitcoin, WLFI, Solana, XLM, HBAR, and VET. On the equities side, he highlighted American Bitcoin Corp (ABTC) and Twenty One Capital (XXI) as key stock positions. The disclosure was used to argue that steady exposure, not frantic trading, fits a long-term plan. Market watchers in the XRP sphere are pointing to several possible tailwinds. According to other commentators, growing interest in XRP spot ETFs has pushed combined holdings to about $1.16 billion. There are also reports that companies such as VivoPower and Wellgistics Health have added XRP to their treasuries, which some analysts say could take supply off the market and tighten available coins. Investor Mix Of Crypto And Stocks XRP under $2.00 is one of the greatest blessings of our lifetime. I am still accumulating. My top crypto holdings: XRP Bitcoin WLFI Solana XLM HBAR VET My top two stocks: ABTC XXI Cash-value life insurance is the foundation of my family’s wealth empire. Cash flow is the… — Coach, JV (@Coachjv_) January 1, 2026 Mason Versluis, a popular crypto YouTuber, offered a grounded view about expectations. He urged followers to focus on “the real things” and fundamentals, rather than clinging to failed three-digit forecasts. Versluis reminded the community that XRP began January 2025 at $2.08 and moved to $3.40 by the end of that month. The token then reached a yearly high of $3.66 in July before sliding back to close 2025 at $1.84, which represented an 11.5% YTD decline. “We just look at the fundamentals,” he said, adding that those who loudly predict extreme prices often end up wrong. My thoughts on Jake Claver’s TRIPLE DIGIT $XRP prediction: (Clip from my stream today) pic.twitter.com/y7JJQfPsPf — MASON VERSLUIS (@MasonVersluis) December 31, 2025 According to several voices in the space, regulatory moves could also matter. One influencer cited a White House confirmation that the CLARITY Act markup is scheduled for January 2026, which supporters believe may clarify crypto rules and encourage institutional flows. Based on reports, such policy milestones are being watched closely by investors who expect clearer rules to broaden participation. Focus On Systems Over Hype As for Coach JV’s public statements on this issue, he emphasized and stressed the process more than making predictions. JV explained that he maximized cash-value life insurance as part of his wealth strategy, managed debt very carefully, and created systems which enforce discipline on himself and his business. Related Reading: Crypto ETFs Defy The Pullback With $32 Billion In Fresh Investor Cash The mix of voices in the community reflects two linked ideas: some see current prices as a buying window, while others warn that timing markets is risky. Based on reports and the coach’s disclosures, the common advice is simple — build a plan, stick to it, and buy if the thesis still holds. For many holders, the current sub-$2 trading range is being treated not as failure, but as an opportunity to prepare for possible wider adoption down the road. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|bitcoin|crypto|digital currency|xrp|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56753233,
    "published": 1767409219000,
    "title": "Bitcoin Key Moving Averages Indicate An Imminent Drop To $38,000",
    "body": "As 2025 came to a close, Bitcoin (BTC) ended on a negative note, trading more than 30% below its all-time highs and grappling with the formation of a death cross—a technical indicator that traditionally precedes significant price corrections. Currently hovering just above $89,200, Bitcoin recently saw its 10-week and 50-week simple moving averages (SMAs) cross paths on December 8, a development highlighted by market analyst Ali Martinez on social media site X (previously Twitter). Bitcoin May Face 50%-60% Correction Martinez emphasized the importance of watching the behavior of these two moving averages on the weekly chart. Historically, each time Bitcoin has registered a death cross between the 10-week and 50-week SMAs, it has been followed by substantial corrections. Related Reading: Dogecoin Long-Term Bullish Structure Still In Play And Will Cross $10 As seen in the cryptocurrency’s weekly chart below, past occurrences of such crossovers have led to price declines of 67% in September 2014, 54% in June 2018, 53% in March 2020, and 64% in January 2022. With the recent death cross-forming, Martinez suggests that if history is any guide, Bitcoin could face a correction between 50% and 60%, which would place its price anywhere between $50,000 and $38,000. Adding another layer of complexity to the analysis, market expert Mags has outlined two potential scenarios for Bitcoin’s near future. Two Scenarios For BTC’s Future Following Bitcoin’s downturn since its October highs above $126,000, it has been trading around the $85,000 mark for several weeks. Coinciding with this, Tether’s USDT dominance has broken out of its previous range, currently maintaining levels above the breakout zone. Since Bitcoin and USDT dominance exhibit an inverse correlation, Mags has identified two main scenarios moving forward. The first, a bullish scenario, hinges on the idea that if USDT dominance begins to decline, the current breakout could turn out to be a fakeout. Mags asserts that such a move could potentially ignite another expansion in Bitcoin’s price, possibly even leading to a new all-time high before any significant distribution occurs. Related Reading: Here’s How Much The XRP Price Will Be If It Overtakes Ethereum In Market Cap Conversely, Mags outlined a second scenario indicating early signs of a bearish structure. If the broader market trend weakens, Bitcoin might experience a temporary bounce, while USDT dominance forms a higher low near its mid-range before trending back upwards. In this case, BTC would exhibit a slow distribution pattern, marking neither a crash nor a rapid decline, but rather a gradual, choppy downward movement characteristic of initial bearish market behavior. The next move in USDT dominance is poised to play a crucial role in determining whether the current market represents a mere pause before further price continuation or the onset of an extended distribution phase leading up to a new all-time high. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin chart|Bitcoin Death Cross|Bitcoin news|bitcoin price|bitcoin technical analysis|btc|BTC news|btc price|BTCUSDT|crypto|crypto market|crypto news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56754789,
    "published": 1767412819000,
    "title": "Dogecoin Heading To $0.08? Analyst Thinks So—Here’s Why",
    "body": "A cryptocurrency analyst has pointed out how Dogecoin could be on track for $0.08 based on this breakout from a consolidation channel. Dogecoin Has Fallen Under An Ascending Channel In a new post on X, analyst Ali Martinez has talked about where Dogecoin could be heading based on a technical analysis (TA) pattern. The pattern in question is an “Ascending Channel,” which is a type of Parallel Channel. Related Reading: Bitcoin Cycle Defined by Demand, Not Price: CryptoQuant Head Says Parallel Channels appear whenever an asset’s price observes consolidation between two parallel trendlines. When these lines have a positive slope, the pattern is known as an Ascending Channel. This channel corresponds to consolidation that occurs toward some net upside. Like other such patterns in TA, the upper line acts a source of resistance, while the lower one provides support. A break out of either of these boundaries can signal a continuation of trend in that direction. This means that a surge above the channel may be a bullish signal, while a drop under it a bearish one. Like the Ascending Channel, there is also a pattern in TA called the Descending Channel, emerging when the opposite type of consolidation takes place. That is, when the price moves to a net downside between two parallel trendlines with a negative slope. Until recently, Dogecoin had been trading inside a multi-year Ascending Channel on the 3-day timeframe. The memecoin capped off 2025 with a breakout from it, as the chart shared by Martinez shows. From the above graph, it’s apparent that Dogecoin has escaped the long Ascending Channel with a fall below the support trendline. The memecoin has since been following a steep downward trajectory, a potential sign that the bearish breakout is in effect. Breakouts from Parallel Channels are considered likely to end up being of the same height as the distance between the trendlines. Based on this, the analyst has put the $0.08 target for DOGE. It now remains to be seen whether the asset will follow this trajectory or if it will see a rebound before long. Related Reading: XRP At Risk Of A Drop To $0.80? Analyst Makes The Case In another X post, Martinez has highlighted how Bitcoin, the number one cryptocurrency, has also been trading inside a TA consolidation pattern recently. As displayed in the chart, the pattern in the case of Bitcoin is a Symmetrical Triangle, a channel that involves two lines converging at a roughly equal and opposite slope. BTC’s 4-hour price has been moving sideways in this pattern recently and based on its height, the analyst thinks that the coin may be set up for a 15% move. DOGE Price At the time of writing, Dogecoin is floating around $0.13, up more than 8% over the last 24 hours. Featured image from Dall-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|Dogecoin Ascending Channel|dogecoin price|dogeusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56757953,
    "published": 1767420049000,
    "title": "Bitcoin Volatility Goes Down: BTC Records ‘Calmest Year In History’",
    "body": "Despite the recent price action, Bitcoin (BTC) closed 2025 as the year with the lowest volatility in its history, driven by market maturity, regulatory developments, and the increasing participation of institutions in the crypto space. Related Reading: Ethereum Optimism For 2026: Analysts Share Bullish Forecast Despite Disappointing End-Of-Year Bitcoin Records Least Volatile Year On Friday, K33 Research data revealed that Bitcoin has recorded the least volatile year in the asset’s history. According to the chart, the flagship cryptocurrency saw its lowest volatility level, measured by the average deviation of daily returns, in 2025, hitting just 2.24%. The recent data shows that BTC fell below the previous lowest year on record, 2023, which registered 2.30% volatility. Moreover, it’s annual volatility has also ended below the 3% mark over the past three years, its lowest levels since 2016. This signals a “clear” diminishing trend, K33 Research noted, as Bitcoin’s volatility has been trending lower year by year, suggesting growing market maturity and stabilizing price action. Crypto trader Niels highlighted that “for the first time, BTC recorded its lowest annual volatility on record, lower than every cycle before it, including the early ‘wild west’ years and the post-ETF era.” As he explained, 2025 was “the calmest year in Bitcoin’s history” despite all the price movements of the years, including the Q4 daily corrections, which saw the flagship crypto retrace up to 16% in a single day. It’s worth noting that BTC’s deepest correction in 2025 saw the cryptocurrency drop nearly 36% in a two-month period, while previous cycles’ corrections recorded retraces of more than 50% during similar periods. Previously, Nic Carter addressed the negative sentiment brewing around Bitcoin and the broader market. He detailed that the market could be considered “boring” now because most of the questions that drove the historical volatility have been answered. Carter also asserted that the space matured significantly with “more serious businesses (…), [and] less chaos” in the industry. The Start Of The ‘Institutional Era’ In his X post, Niels also pointed out that the diminishing trend in Bitcoin volatility was fueled by the massive institutional participation, calling for “More capital. More long-term holders. More institutional participation. [and] Less emotional trading” for the future. Similarly, Bitwise’s CEO, Hunter Horsley has affirmed that the overall crypto market was changing, driven by the significant decrease in regulatory risk, which has led to last year’s spike in institutional adoption and mainstream recognition. Notably, the market saw the second of wave of crypto Exchange-Traded Funds (ETFs) go live, with funds based on altcoins like Solana (SOL) and XRP breaking multiple records. In addition, the Digital Asset Treasury (DAT) trend, led by Strategy’s Bitcoin purchases, poured billions of dollars into cryptocurrencies in 2025. Related Reading: Crypto Hacks Swipe Nearly $3 Billion In 2025 Despite Fewer Attacks – Report In November, Ark Invest’s CEO Cathie Wood stated that growing institutional adoption will be a powerful driver for long-term value for Bitcoin, noting that large-scale institutions have barely dipped their toes into the space and “have a long way to go.” Meanwhile, Head of Research at Grayscale, Zach Pandl, said in an January 2 interview that 2026 could be the “dawn of the institutional era” for crypto. He noted that rising demand for alternative stores of value and progress on bipartisan US crypto market structure legislation could drive Bitcoin to new highs in the first half of the year. As of this writing, Bitcoin is trading at $90,240, a 1.54% increase in the daily timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|bitcoin bear market|Bitcoin ETFs|bitcoin price|Bitcoin volatility|btc|BTCUSDT|Cathie Wood|crypto anlayst|Crypto ETFs|crypto market correction|Crypto trader|K33 Research",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56758182,
    "published": 1767420223000,
    "title": "Crypto social chatter has 'very positive' start to 2026: Santiment",
    "body": "The crypto market may see FOMO enter the market if Bitcoin suddenly creeps toward the $92,000 price level, according to a crypto analyst.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]