[
  {
    "id": 54739521,
    "published": 1763791235000,
    "title": "USDC Floods Exchanges: Are Traders Buying The Bitcoin Crash?",
    "body": "On-chain data shows a large amount of USDC inflows have just hit exchanges, a potential sign that investors are looking to buy the Bitcoin dip. USDC Exchange Inflow Has Registered Multiple Spikes Recently As explained by CryptoQuant community analyst Maartunn in a new post on X, the USDC Exchange Inflow has shot up recently. The “Exchange Inflow” here refers to an indicator that keeps track of the total amount of a given asset that’s being transferred to wallets connected with centralized exchanges. Related Reading: Bitcoin Mayer Multiple Retraces To Lower Bound—What Comes Next? Generally, investors deposit their coins to these platforms when they want to trade them away. As such, whenever the Exchange Inflow spikes, it can be a sign that there is demand for selling the asset. Such a trend can naturally be bearish for Bitcoin and other volatile cryptocurrencies. When it comes to stablecoins, however, trading has no effect on their price, as they are, by definition, stable around the fiat currency that they are pegged to. This doesn’t mean that stablecoin exchange deposits are without consequences, though. Investors usually store their capital in the form of USDC or another stablecoin when they want to avoid the volatility associated with Bitcoin and company. Once these traders feel the time is right to buy back in, they send their stables to exchanges and swap to the asset of their choice. As such, stablecoin inflows can actually be a bullish sign for the market. From the chart shared by Maartunn, it’s visible that the USDC Exchange Inflow has surged recently, a potential sign that fresh capital is looking to accumulate the volatile coins. The latest wave of USDC exchange deposits have arrived as Bitcoin and other digital assets have gone through a crash. Given this timing, it’s possible that traders are buying the dip. In some other news, the recent bearish price action has been especially hard on the short-term holders (STHs), as Glassnode analyst Chris Beamish has pointed out in an X post. As displayed in the above graph, the Bitcoin STHs have witnessed a plunge in their Net Unrealized Profit/Loss (NUPL) alongside the market downturn. STHs are the investors who purchased their coins within the past 155 days, and the asset is currently trading at levels notably below any seen during this window, so the entire cohort has dropped into a state of loss. Related Reading: Bitcoin Crash Dominated By US Selling, CryptoQuant Data Shows Since the recent downtrend has been quite steep, the degree of unrealized loss faced by the cohort has also been unlike anything witnessed since November 2022, when the last bear market reached its bottom. “STH are seriously feeling the pain,” noted Beamish. BTC Price Bitcoin briefly slipped below $81,000 earlier in the day, but it has since seen a small jump back to $83,900. Featured image from Dall-E, Glassnode.com, CryptoQuant.com, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin crash|btc|BTCUSDT|stablecoin|USDC|USDC Exchange Inflow",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54740965,
    "published": 1763794842000,
    "title": "Crypto Funds Face Third Consecutive Weekly Losses, Totaling $3 Billion In Outflows",
    "body": "Recent commentary from the Kobeissi Letter has underscored a troubling trend in the capital markets: crypto-focused funds have encountered substantial outflows, with a notable $2 billion exiting last week alone. This marks the most significant withdrawal since February and extends a concerning streak, bringing total outflows to $3.2 billion over the last three weeks. Bitcoin And Ethereum Face Massive Withdrawals Leading these outflows is the market’s leading crypto, Bitcoin (BTC), which experienced a massive $1.4 billion in withdrawals, while the second largest cryptocurrency, Ethereum (ETH), followed closely with $689 million. As a result of these dynamics, the average daily outflows as a percentage of assets under management (AuM) have reached unprecedented levels. Related Reading: Bitcoin Bear Market Confirmed? Expert Predicts Price Target Of $40,000 By Late 2026 The cumulative impact of these outflows, coupled with declining prices, has led to a 27% reduction in total assets under management, now standing at $191 billion, a situation that the Kobeissi Letter has termed a “structural decline.” Market sentiment remains largely negative, particularly for Bitcoin, with expert Lark Davis examining current trends through the lens of key moving averages. Davis pointed out that as long as Bitcoin trades below the 50-week exponential moving average (EMA), currently placed just above the $10,000 mark, it remains in a bear market. He questioned whether the current downturn signifies a “big bear,” hinting at skepticism regarding recovery prospects, or a “mini bear,” reminiscent of April’s decline where Bitcoin, despite losing the 200-day EMA, did not breach the 50-week EMA. Davis proposed three possible scenarios for the coming weeks. The first posits a drastic descent into “goblin town” without recovery, which he considers unlikely given current oversold conditions. The second scenario involves a short-term rally that tests the 50-week EMA, potentially luring investors back before a sharp downturn. The third scenario, which Davis leans towards, suggests that Bitcoin could reclaim the 50-week EMA by year-end, fueled by easing macroeconomic conditions, including interest rates and market valuations. Crypto Market Turmoil Intensifies Compounding these market concerns is the precarious situation of Strategy, formerly known as MicroStrategy, headed by Bitcoin advocate Michael Saylor. Jacob King, CEO of SwanDesk, remarked that should Bitcoin fall a few more percentage points, specifically below Strategy’s average buy at just below $80,000, the firm would find itself in a precarious position with its Bitcoin holdings. King fears that forced liquidations could occur again for crypto investors, which could drive Bitcoin prices down toward $10,000 or lower due to increased selling pressure. Related Reading: Saylor’s Strategy Under Threat: Index Status At Risk With $8 Billion On The Line King’s commentary reflects a broader skepticism regarding the sustainability of the crypto market’s structure. He criticized the investment strategies surrounding Bitcoin as being propped up by “unsustainable fraud and hopium.” Highlighting past statements by Saylor, King recalled when Saylor encouraged extreme measures—such as taking out double mortgages and selling personal assets—to invest in Bitcoin, asserting that the current market turmoil should come as no surprise. At the time of writing, Bitcoin was trading at $84,700, over 30% below all-time high levels of $126,000 reached earlier in October. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|BTCUSDT|crypto|crypto funds|crypto market|crypto news|crypto outflows|cryptocurrency|ETH|ethereum",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54741724,
    "published": 1763796695000,
    "title": "ARK Invest wraps up week with Bitcoin ETF, Bullish, Circle, BitMine buys",
    "body": "ARK Invest ramped up its crypto exposure on Friday, adding Bullish, BitMine, Circle, Robinhood and nearly $600K in Bitcoin ETFs as crypto equities attempted a rebound.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54742381,
    "published": 1763798448000,
    "title": "Analyst Says It’s Time To Rethink Altcoins And Alt Season Expectations – Here’s Why",
    "body": "As the market bleeds red and most altcoins lose crucial levels, some have suggested that investors must reshape their expectations of the crypto market this cycle and the long-awaited “alt season.” Related Reading: BitMine’s Unrealized Losses Hit $3.7B As Ethereum (ETH) Price Struggles Below $3,000 Old Crypto Cycle Is Gone – Analyst Over the past month, the crypto market has wiped out over $1 trillion in market capitalization due to a series of large-scale liquidations and strong selling pressure since the October 10 pullback, which has sunk investors’ sentiment to its lowest levels in months. Amid this performance, the early Q4 rally buzz has faded, and most altcoins have lost the ground gained during the Q3 market breakout. Market observers have shared their outlook on how the crypto market has changed and what to expect in the future. In October, Nic Carter, crypto investor and partner at Castle Island Ventures, weighed in on the shift in retail sentiment regarding most altcoins. As reported by NewsBTC, he affirmed that the bearish sentiment means the space has matured significantly. Carter explained that crypto is “boring” now because most of the uncertainties that drove much of the historical volatility have been resolved, adding that the industry has also largely derisked as a technological substrate. The investor considers that “crypto natives no longer control the narrative, there’s more serious businesses (which don’t require tokens), there’s less chaos, the whole space has matured significantly.” In a Friday thread on X, the Altcoin Sherpa also discussed the market changes, affirming that the “old cycles” have been “dead” for a while. As he explained, the previous cycles consisted of an euphoric phase, a corrective phase, and an accumulation phase before the start of a recovery phase. He highlighted the performance of Altcoins like Solana (SOL) between 2020 and 2024, noting that “this market environment is gone.” Instead, the analyst believes that the market is in a “hyper-accelerated regime.” Altcoins In A ‘Hyper-Accelerated Regime’ Under this new regime, the market experiences short-term uptrends followed by mid-term downtrends, similar to the price action of altcoins like BONK since late 2023, Altcoin Sherpa added: We have 1-3 months of pump followed by 2-6 months of downtrend and rinse repeat. There is no more euphoria where things go berserk for an entire year. Just 1-3 months and then down. Look how many cycles BONK had in a year or 2. The analyst suggested that investors should not expect 2021 conditions for most altcoins or a traditional “Alt Season,” where most tokens experience massive gains at once. He advised to capitalize when the “good times” arrive and be aware that “price can still die in 3 months.” “Reframe your brain in how you think about alt pumps and ‘alt season’. Coins will still downtrend, just not in a slow bleed. More [of] an accelerated destruction + carnage, Altcoin Sherpa detailed. Related Reading: This Altcoin Soars 20% In One Day Following Major Saudi Arabia Partnership He also noted that, unlike previous cycles, altcoins will also recover “a bit quicker than before,” and won’t take over a year to bottom and accumulate before a new leg up begins again. However, Sherpa affirmed that the lack of an accumulation phase will mean that “the overall coins will NOT have as strong of pumps like they used to,” as that period is what makes the rallies strong. “We aren’t seeing anything close to that anymore,” he concluded. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|alt season|Altcoin Cycle|Altcoin Season|altcoins|altcoins performance|BONK|crypto analyst|Crypto cycle|Sol|Solana|total|total crypto maket cap",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54746618,
    "published": 1763809237000,
    "title": "Buckle Up, Bitcoin ETF Buyers, $79K Might Be Your First Real Test",
    "body": "The cryptocurrency market has been under severe bearish pressure in the past week, with the price of Bitcoin falling below this year’s opening price. At the same time, other large-cap assets have struggled, registering double-digit losses over the past few days. In recent months, conversations have swirled around the death of the typical four-year cycle and a shift in the Bitcoin market structure, with the spot exchange-traded funds (ETFs) providing fresh, consistent liquidity. However, the latest on-chain data shows that BTC ETF investors could be under pressure in the coming days. $79,300: The Pain Threshold For BTC ETF Buyers In a recent post on the CryptoQuant platform, IT Tech shared an insight into the current Bitcoin market dynamics and how it could affect the relatively new set of investors known as BTC ETF buyers. According to the on-chain analyst, these exchange-traded fund holders are “about to face their first real test.” Related Reading: Bitcoin Shows A Clear Momentum Reset — Is A Trend Reversal Coming? The relevant metric here is the Bitcoin US ETF Realized Price, which tracks the average purchase price of BTC held by United States-based exchange-traded funds. This indicator offers insights into the profitability of institutional investors and holders. IT Tech, however, made an interesting assertion, calling out the idea that ETF capital inflows are “Institutional Money.” The crypto analyst noted that most value added through US-based exchange-traded funds is mostly from retail investors buying through their brokerage accounts. As observed in the chart above, the Bitcoin US Exchange-Traded Funds Realized Price currently stands around $79,300. IT Tech said that the ETF buyers often feel “smart” when above the realized price, while they feel panic (as seen with most retail investors) when below their cost basis. According to the on-chain analyst, these ETF investors are not accustomed to Bitcoin price declines. Hence, this group of exchange-traded fund holders or “new retail,” who have not been tested before, could enter a phase of panic selling should they go underwater. Currently, the next significant support for the market leader is marked at around $82,000, where several spot investors have their cost basis. Ultimately, this evaluation makes $79,300 another crucial level to watch should the price of Bitcoin suffer further downturn. Bitcoin Price At A Glance As of this writing, the price of BTC stands at around $84,500, reflecting an over 2% decline in the past 24 hours. According to data from CoinGecko, the flagship cryptocurrency is down by more than 11% in the past week. Related Reading: Who’s Selling? Here’s The Demographic Driving The Bitcoin, Ethereum, And Dogecoin Price Crash Featured image from iStock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|Bitcoin news|bitcoin price|Bitcoin US Exchange-Traded Funds Realized Price|btc|btc price|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54749178,
    "published": 1763815592000,
    "title": "Spot Bitcoin ETFs pull $238M as Ether funds snap 8-day outflow streak",
    "body": "Bitcoin ETFs pull in $238 million as Ether funds end an eight-day outflow streak and Solana products extend a ten-day run of inflows.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54749626,
    "published": 1763817027000,
    "title": "Serious JPMorgan Warning Triggers Urgent Response As Fears Swirl Of 2026 Bitcoin And Crypto Price Crash",
    "body": "Analysts with Wall Street giant JPMorgan have sounded the alarm over a looming threat to bitcoin-buying behemoth Strategy...",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54750825,
    "published": 1763820042000,
    "title": "Bitcoin Investors Sitting On Deep Unrealized Losses — What This Means For Price",
    "body": "The price of Bitcoin has continued to struggle in the final quarter of the year, recently slipping beneath the 2025 starting point. According to the latest on-chain data, investors are currently sitting on deep unrealized losses, which suggests more pain for the market. STHs Sit On Heavy Losses Through Market Crash In a Quicktake post on the CryptoQuant platform, online crypto pundit Crazzyblockk revealed that specific classes of Bitcoin investors are holding through worrying amounts of losses. This evaluation is based on the Age-Band Unrealized PnL Distribution metric, which shows the amount of profit or loss different classes of Bitcoin holders (sorted by age of coins held) are yet to realize. Related Reading: Saylor’s Strategy Under Threat: Index Status At Risk With $8 Billion On The Line According to Crazzyblockk, Bitcoin’s latest investors, who have held between a day and a week, are facing significant unrealized losses. Meanwhile, recent funders with a slightly broader maturity bracket (1-day to 1-month) are not exempt from the current market heat. Additionally, short-term holders who have been involved for up to six months are also experiencing significant drawdowns, as the Bitcoin price stands far beneath their cost basis. In the Quicktake post, Crazzyblockk highlighted that when investor groups face these high amounts of unrealized losses, any price recovery stands as a source of exit liquidity. This is because crypto investors tend to exit the market under minimal losses, or at breakeven. As a result, the classic ‘Support Becoming Resistance’ phenomenon would continue to play out, as these investors keep exiting just beneath or at their cost basis. However, the verdict is not totally grim for the Bitcoin price, as the analyst explained. While the BTC market evidently leans towards a bearish structure, short-term holder behavior will play an important role in determining its direction in the coming days. Crazyyblockk explained, based on historical data, that if the short-term investors avoid capitulating at roughly 20 – 30% unrealized losses, the flagship cryptocurrency could avoid the deep reset associated with a full-blown bear market. On the flip side, a series of capitulation events among this investor cohort could cause a deep extension of Bitcoin’s crash, as these exits add more momentum to the already existing bearish pressure. And until this investor group is fully wiped out of the market, the price of Bitcoin could continue the current descent. Bitcoin Price At A Glance As of this writing, Bitcoin is valued at around $84,530, reflecting a 4% decline in the past 24 hours. According to data from CoinGecko, the premier cryptocurrency is down by more than 11% in the past week. Related Reading: Bitcoin Shows A Clear Momentum Reset — Is A Trend Reversal Coming? Featured image from iStock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|btc|btcusd|crypto",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54752230,
    "published": 1763823617000,
    "title": "Pundit Reveals Why XRP Price At $1,000 Is Not A Dream – ‘It’s Math’",
    "body": "A crypto pundit has ignited discussion about the long-term outlook of the XRP price after arguing that a surge to a $1,000 target is not a dream but a realistic goal supported by market math. The analyst believes that XRP’s future depends on measurable utility rather than market hype, positioning the cryptocurrency as an asset built for deep financial integration, which could fuel a prolonged upward rally. Why A $1,000 XRP Price Is Not A Dream Pseudonymous crypto analyst 24HRSCRYPTO predicted on X this Friday that XRP could climb from its current price of above $1.9 to $1,000. He described the path to this ambitious target as a matter of scaling rather than a dream. He also framed it as a math-based outcome, essentially driven by XRP’s foundational role as a global payments currency. Related Reading: Analyst Claims XRP Price Will Surge To $220 Due To ETFs, But Is This Possible? The analyst noted that XRP’s upside potential is more closely tied to real financial infrastructure than to short-lived speculation-driven appreciation. He emphasized that investors often overlook the role of utility, global settlement demands, and deep liquidity, which he believes are the backbone of XRP’s trajectory. These factors set XRP apart from other cryptocurrencies that mainly depend on traders buying at consistently rising prices. 24HRSCRYPTO uses a simple comparison to illustrate the difference that drives cryptocurrency prices. In his view, the Bitcoin price reaches new all-time highs primarily through speculation, while XRP grows through real financial activity supported by its innovative technology. According to the analyst, this disparity is why he believes patience and consistency matter more than hype cycles. The analyst also insists that XRP’s design positions it for long-term use in financial infrastructure where trillions of dollars flow, creating steady demand. He explained that even a modest investment of $5,000 held with discipline until 2030 can grow when supported by real value. This bullish scenario puts a $100 target for XRP within reach as global settlement usage increases. The same logic also supports the analyst’s bold $1,000 price projection. XRP Technical Analysis Signals Growing Strength The XRP price has been dragged down amid the broader market slump, recently crashing to new lows below $2. Despite the altcoin’s weak price action, analysts still hold out hope for a potential market shift to the upside. Related Reading: Analyst Claims XRP Will Flip Bitcoin As These Developments Play Out In a recent technical analysis, crypto market expert Rose Premium Signals notes that XRP has tapped the same demand zone for the third time, creating a strong triple bottom on the weekly timeframe. The analyst’s chart shows that each time the price returns to the $1.8 to $1.9 demand zone, it triggers strong buying. This repeated pattern confirms the formation of a triple bottom, which she considers a classic high-timeframe reversal signal. The chart also reveals that XRP’s recent downtrend has been controlled and met by a well-defended support level. Rose Premium Signals emphasized that each bounce from this support area has triggered progressively stronger reactions. If momentum is confirmed, she predicts that XRP could surge above $3 in the mid-term. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|24HRSCRYPTO|altcoin|Global Settlement|Ripple|Rose Premium Signals|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54752948,
    "published": 1763825523000,
    "title": "UK Crime Network, Worth Billions, Used Crypto to Funnel Drug Cash to Russia, NCA Says",
    "body": "A billion-pound laundering network spread across the UK used cryptocurrency to move criminal proceeds and help Russian interests evade sanctions, according to the NCA.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|crypto crime|Russia|UK|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54752891,
    "published": 1763825326000,
    "title": "Aerodrome Finance Hit by 'Front-End' Attack, Users Urged to Avoid Main Domain",
    "body": "The attack did not compromise the underlying smart contracts, but users are advised to avoid the compromised domains and instead use decentralized ENS domains.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Web3|Decentralized exchange|Attack|Exploit|Top Stories|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 139,
        "NAME": "ENS",
        "CATEGORY": "ENS"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 54753621,
    "published": 1763827146000,
    "title": "Europe Will Get Risky 3x Leveraged Bitcoin, Ethereum ETFs as Crypto Markets Melt Down",
    "body": "Investors in Europe can soon take a gamble on 3x leveraged Bitcoin and Ethereum ETFs thanks to LeverageShares.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54753437,
    "published": 1763826700000,
    "title": "Coinbase 'Negative Premium' at Widest Level since Q1, Signalling Weak U.S. Demand",
    "body": "Bitcoin is on track for its worst weekly performance since March, while U.S. demand indicators weaken as the Coinbase premium declines and spot ETFs reach a record volume.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Coinbase Premium|Bitcoin News|Bitcoin ETF|market analysis|Top Stories|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54753772,
    "published": 1763827678000,
    "title": "'Liquidity Crisis': $12B in DeFi Liquidity Sits Idle as 95% of Capital Goes Unused",
    "body": "This inefficiency disproportionately affects retail liquidity providers, with 50% losing money due to impermanent loss, and net deficits exceeding $60 million, a new report finds.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Web3|1inch|Decentralized Finance|Liquidity|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54754258,
    "published": 1763829023000,
    "title": "Why Zcash Could Be Vulnerable To A 50% Breakdown",
    "body": "The cryptocurrency market continues to bleed, with the total market cap now hovering around $2.89 trillion. Zcash (ZEC), one of the privacy tokens daring to defy the fearful market sentiment, has experienced a steady, choppy price action as market forces struggle to establish control. Interestingly, a prominent market analyst with the X username PlanD has discovered significant bearish potential on the horizon. Related Reading: Why is Zcash Surging? Analysts Break Down the ZEC Rally and What Comes Next Zcash To Fall To $281 – Is The Party Over? Despite its performance amid the general crypto market correction, Zcash struggles to break past a formidable barrier in the $750 price zone. In the last week, the privacy coin experienced this rejection in the two instances it climbed above the $700 price mark. According to PlanD, ZEC’s multiple rejections are also threatening the viability of an ascending channel that began in October. Notably, Zcash has broken below the lower boundary of this channel at $672, in successive moments, signaling increasing bearish pressure and weakening upward structure. If the market bears assume a dominant hand of the privacy coin, PlanD is projecting a price crash to around $281, indicating a potential 50% price loss from the present market prices. PlanD’s prediction is similar to that by fellow analyst Ali Martinez, who has since tipped ZEC could correct to around $325, following its struggles at the $750 price zone. However, while technical indicators point to an impending price collapse, strong fundamental developments provide bullishness for a continuous price uptrend. These include institutional endorsements as Cypherpunk Technologies, backed by Tyler and Cameron Winklevoss, which has recently launched a $50 million Zcash treasury strategy. Furthermore, the upcoming Zcash halving event, slated for November 28, adds another layer of bullish undertone as an increase in token scarcity is expected to drive demand pressure and subsequently boost prices. Related Reading: Dogecoin (DOGE) Falls Again as Trader Sentiment Turns Increasingly Bearish ZEC Price Overview At the time of writing, Zcash trades at $490.52, reflecting a drastic 24.11% decline in the past 24 hours as total crypto liquidation crossed $1.9 billion. Meanwhile, daily trading volume is down by 6.1% and valued at $2.24 billion. Nevertheless, ZEC’s monthly performance stands at a staggering 99.41% representing the coin’s defying bullish performance during a time when the total crypto market cap has reduced by 28%. In the last year alone, the privacy coin has surged by 928%, highlighting a remarkable and sustained bullish trajectory. With a market cap of $7.8 billion, ZEC now ranks as the 13th largest cryptocurrency in the world. Featured image from Shutterstock, chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "ZEC|Ali Martinez|Cryptododo7|PlanD|price resistance|ZCash|Zcash bearish prediction|Zcash Price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54754907,
    "published": 1763830800000,
    "title": "Is Strategy Stock the Preferred Hedge Against Crypto Losses? Tom Lee Thinks So",
    "body": "Strategy’s 650,000 BTC holdings make it a ‘pressure valve’ for the broader market, said the Bitmine Immersion chairman.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Strategy|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54756852,
    "published": 1763835977000,
    "title": "Bitcoin ETFs Just Had One of Their Worst Weeks on Record, Bleeding $1.2 Billion",
    "body": "Spot Bitcoin funds are closing in on $4 billion of outflows so far in November, with investors cashing out as the price of BTC dives.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54757081,
    "published": 1763836564000,
    "title": "Hobbyist Miner Beats \"1 in 180 Million Odds\" to Win $265K Bitcoin Block Using Just One Old ASIC",
    "body": "The winning miner controls just 0.0000007% of Bitcoin’s total network hashpower, which recently hit a record 855.7 exahashes per second.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin Mining|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54757923,
    "published": 1763838072000,
    "title": "Crypto Treasuries Are Fading—And Staking ETFs Will 'Eat Their Lunch': SOL Strategies CEO",
    "body": "SOL Strategies Interim CEO Michael Hubbard believes that there's \"there's no sustainable market\" for pure crypto treasuries. Here's why.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54761029,
    "published": 1763843462000,
    "title": "Group Asks Federal Agency to Halt Use of Elon Musk's Grok AI Amid Racism Concerns",
    "body": "Analysis showed Grok citing extremist sites as credible sources, raising another red flag after the AI's earlier \"MechaHitler\" incident.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54761954,
    "published": 1763845222000,
    "title": "XRP ETFs Could See Aggressive Accumulation – Here Are The Numbers",
    "body": "XRP has entered a new phase in its growth as Spot XRP ETFs begin trading across the United States. The excitement surrounding institutional access to XRP has grown quickly in recent weeks, especially as filings and inflow reports hint at rising interest from funds preparing to scale their exposure. A market commentator known as Chad Steingraber presented a projection showing just how intense ETF accumulation could become if issuers adopt an acquisition strategy similar to what was seen in Bitcoin ETFs. The estimates outline an aggressive period of accumulation that could reduce XRP’s available supply far faster than many expect, and here are the numbers. Related Reading: Trump’s WLFI Moves To Contain Wallet Breach While Federal Inquiry Looms A Breakdown Of Steingraber’s Projection Steingraber’s first scenario examines a modest but steady accumulation model where 12 Spot XRP ETF issuers acquire an average of 3million XRP per day. His projection is based on focusing on the average rather than trying to predict which fund accumulates the most, because the combined impact is what ultimately matters for XRP’s market price. Under this setup, daily inflows would reach up to 36 million XRP. Over a standard five-day trading week, that accumulation would climb to 160 million XRP. Over the course of a month, the amount absorbed by ETFs would increase to 720 million XRP. By the end of a full year, this single projection implies that as much as 8.64 billion XRP could be removed from public circulation and locked into ETFs. Of course, these numbers only take into account the possibility of consecutive net inflow days and no net outflow days. Although these figures are hypothetical, the pace aligns with the early patterns seen in Bitcoin ETFs, where strong averages across issuers created a sustained demand for Bitcoin. A More Aggressive Scenario Based On Recent Activity In another post, Steingraber offered a more forceful accumulation model using the activity of Bitwise’s Spot XRP ETF as a benchmark. Data shows that the Bitwise XRP ETF received inflows of about 5.82 million XRP in its first trading day. In this second scenario, the projected daily acquisition rate is doubled to about 6 million XRP per issuer. If 12 funds follow this pattern, the combined accumulation could hit 72 million XRP every day. Extending the same five-day cycle, the weekly total would rise toward 360 million XRP, while monthly totals would reach approximately 1.44 billion XRP. Over a full year, this more aggressive model ends with 17.28 billion XRP absorbed into ETF products. “The entire XRP public supply will be gone UNLESS THE PRICE GOES ASTRONOMICALLY HIGH,” Steingraber said. Related Reading: $2 Billion Gone In Minutes: Bitcoin Slide Shakes Crypto World The projections serve as a wake-up call on how quickly XRP’s supply ecosystem might change once ETF inflows stabilize and larger issuers like Grayscale, Bitwise, Canary, CoinShares, Franklin, 21Shares and WisdomTree get in on the action. However, BlackRock, which oversees the largest Spot Bitcoin and Ethereum ETFs, is yet to make any move on a Spot XRP ETF. The company had confirmed in August that it has no immediate plans to file for one. Featured image from Pexels, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|blockchain|crypto|crypto market|crypto news|cryptocurrency|digital currency|Ripple|xrp",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54764966,
    "published": 1763850613000,
    "title": "Bitcoin Hits Major Inflection Point As Rising Wedge Breaks",
    "body": "Bitcoin is now sitting at one of its most critical junctures of the entire cycle. A rising-wedge breakdown has driven price straight into a key support zone just as BTC prints its first major post-ATH drawdown of over 33%, a level that has historically signaled prolonged weakness and heightened volatility. With technical pressure colliding with a historically significant threshold, the market now faces a decisive moment. Rising Wedge Break Sends Bitcoin Lower Into Key Support Zone Crypto analyst The Boss, in a recent breakdown of Bitcoin’s daily chart, highlighted the formation of a rising wedge pattern. As expected, Bitcoin has broken down from this wedge, sending the price sliding into what is considered a strong support zone. This level has historically acted as a turning point, making its current test a crucial moment for the market. Related Reading: Bitcoin Shows A Clear Momentum Reset — Is A Trend Reversal Coming? According to the analyst, this area could trigger a potential upward reaction, as buyers often step in when the price reaches such well-established support levels. However, the possibility of a rebound is not guaranteed. The structure must show early signs of strength before any meaningful recovery can be considered reliable. Momentum indicators paint a cautious picture as they remain notably weak, showing no clear signal of bullish pressure returning to the market. At the same time, trading volume remains lower than necessary for a confident reversal, suggesting that buyers have yet to step in. Without stronger participation, any bounce may be shallow or short-lived. Due to these factors, the analyst emphasized that Bitcoin’s current level must be closely monitored. While a short-term reaction from support is possible, a failure to hold this zone would open the door to further downside and potentially expose deeper support areas. BTC Hits 33% Drawdown Threshold: A Historically Significant Signal According to a recent update shared by Crypto Patel, Bitcoin has now recorded a 33% drawdown from its all-time high, marking a correction significant enough to grab the market’s full attention. This is more than a routine pullback; it represents a level of decline that has historically signaled deeper shifts in market sentiment. Related Reading: Bitcoin Faces A Negative Correlation Trend And Still Holds Strong — Here’s Why Looking back through previous cycles, every instance where BTC retraced beyond 33% after a peak has been followed by prolonged periods of weakness, increased volatility, and continued downside pressure. These drawdowns often served as transitional phases, where momentum reset before the next major trend could establish itself. The market now sits in a critical phase, with traders and analysts watching closely to see whether Bitcoin repeats its well-known historical behavior or breaks the cycle with a stronger-than-expected recovery. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|Crypto Patel|The Boss",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54764646,
    "published": 1763849752000,
    "title": "Bitcoin OG's selling to 'weak' hands will deepen selloffs: Peter Schiff",
    "body": "A lack of conviction among \"weak\" hands will cause new Bitcoin holders to dump at the first sign of trouble, worsening market drawdowns.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54768155,
    "published": 1763856051000,
    "title": "Chainlink Is ‘Essential Infrastructure’ for Tokenized Finance, Says Grayscale Research",
    "body": "Grayscale's report comes shortly after it filed to convert its Chainlink Trust into an exchange-traded fund (ETF) that would trade on NYSE Arca.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Chainlink|Grayscale|Tokenization|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54768158,
    "published": 1763856038000,
    "title": "Bitcoin Block Channel Reveals $400,000 Price Target – Details",
    "body": "The Bitcoin market continues to witness an intense price correction in line with broader crypto market movement. In the past week, the premier cryptocurrency recorded another 10% price decline, trading as low as $80,800, before experiencing a modest bounce. Bitcoin now stands 32.79% below its all-time high, with distribution taking preference over accumulation for most investors. However, popular analyst Gert Van Lagen has unveiled an on-chain trend that postulates an impending revival of the bull market. Related Reading: Saylor’s Strategy Under Threat: Index Status At Risk With $8 Billion On The Line Bitcoin Historical Post-Halving Movement Indicates Bullish Hope In an X post on November 21, Gert Van Lagen outlines a positive Bitcoin price prediction based on data from the previous post-halving movement. The renowned analyst explains this forecast, using a long-term logarithmic chart of Bitcoin’s price vs Bitcoin block height, which highlights a regression channel the digital asset has followed since 2009. According to Van Lagen, Bitcoin has followed a similar pattern after every halving, which usually begins with pushing above the midline of this long-term regression channel. Thereafter, the premier cryptocurrency accelerates into a blow-off top (orange spikes) at the channel’s upper boundary as seen in 2013, 2017, and 2021. For all its price exploits in the present market cycle, Bitcoin presently trades just below the midline of the regression channel, suggesting there is ample space for price appreciation. However, Van Lagen notes some unusual price behavior in that Bitcoin has experienced rejection thrice at this midline, each time resulting in a bounce off the 0.382 Fibonacci retracement line. Nevertheless, the analyst still expects the premier cryptocurrency to maintain the 15-year historical trend and eventually secure a decisive move above the midline resistance. If this price development occurs, Van Lagen also predicts Bitcoin to rise to around $350,000 – $400,000, a price range target that aligns with the upper boundary of the regression channel. Related Reading: Why The Bitcoin Crash To $85,000 Is Actually Good News: Jeff Park The ‘Genuine’ Bearish Market Despite the heightened fears of a bearish market at the moment, Van Lagen explains that the much-dreaded crypto winter only commences after Bitcoin reaches its upper boundary target, establishing a market top. Based on the presented analysis, the market expert predicts Bitcoin will crash from this market peak to retest the 210,000 block SMA, i.e, the lower trend line of the regression channel. At the time of writing, Bitcoin is valued at $84,300 after a 2.36% price loss in the past day. In the last month, the crypto market leader has experienced a 21.96% price devaluation, suggesting a rather volatile and cautious market condition. Featured image from Pexels, chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|bitcoin block|Bitcoin bullish prediction|Bitcoin Halving|Gert Van Lagen|Regression channel",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54770479,
    "published": 1763860003000,
    "title": "BlackRock’s Bitcoin clients aren’t ‘underwriting’ the case for global payments",
    "body": "Bitcoin being widely used for daily payments in the future is just “out-of-the-money-option value upside,” according to BlackRock’s head of digital assets Robbie Mitchnick.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54773348,
    "published": 1763863213000,
    "title": "Dogecoin Goes Wall Street: Grayscale Confirms Nov. 24 ETF Launch",
    "body": "Grayscale Investments will list spot ETFs for Dogecoin and XRP on the NYSE Arca on November 24, 2025, offering a new way for everyday investors to buy those coins through regular brokerages. Related Reading: Kiyosaki Dumps Bitcoin At $90K After Predicting A $250K Moonshot – Here’s Why According to exchange notices and regulatory filings, the funds will trade under the tickers GDOG for Dogecoin and GXRP for XRP. The listings convert Grayscale’s existing private-placement trusts into publicly traded products. Grayscale Moves To List Dogecoin And XRP Reports have disclosed that both ETFs received approval to be listed, and the paperwork was filed with the US Securities and Exchange Commission. The move brings spot exposure to two smaller, but widely followed, cryptocurrencies into a mainstream vehicle. For many investors, that means access without directly managing wallets or private keys. Grayscale Dogecoin ETF $GDOG approved for listing on NYSE, scheduled to begin trading Monday. Their XRP spot is also launching on Monday. $GLNK coming soon as well, week after I think pic.twitter.com/c6nKUeDrtI — Eric Balchunas (@EricBalchunas) November 21, 2025 Market Activity Up Ahead Of Launch Trading activity in related derivatives climbed in the lead up to the announcement. Dogecoin derivatives volume increased by more than 30% to roughly $7.22 billion, based on exchange data. XRP derivatives surged as well, jumping about 51% to around $12.74 billion. Based on reports, these spikes reflect traders positioning for potential price swings around the ETF debut. Spot ETFs do not promise higher prices, but they do change who can buy the assets. Brokers, retirement plans, and funds that avoid direct crypto custody may now step in. That could affect liquidity in both the tokens and their markets. At the same time, the overall crypto market has seen pressure; reports say the launches come during a roughly six-week downturn. DOGE market cap currently at $21.4 billion. Chart: TradingView Questions Remain Over Demand And Flows Product fees, custody details, and how the trusts convert into ETF shares will shape investor appetite. Past launches of crypto ETFs showed brisk early flows for some products, while others saw muted interest. What matters for prices is not only listings, but inflows and outflows once trading begins. Related Reading: $2 Billion Gone In Minutes: Bitcoin Slide Shakes Crypto World Investors and analysts are likely to watch the first days of trading for clues. High volume and tight spreads would suggest strong demand. Low turnover or wide spreads could signal tepid interest. Based on reports, market participants will also monitor whether the ETFs draw the same sort of speculative trading that has driven derivatives volume in recent days. The listing of both GDOG and GXRP on the same date marks a notable step for mainstream crypto products. According to exchange filings, the funds are structured as spot ETFs that hold the underlying tokens via custodians. While that does not remove price risk, it does make buying these assets simpler for a broad group of investors. Featured image from Gemini, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|altcoins|crypto|Dogecoin|etf|grayscale|memecoin|xrp",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]