[
  {
    "id": 56595969,
    "published": 1767098683000,
    "title": "Bitcoin 2026 bull case: Traders see 'strong signals' for 6-figure BTC price",
    "body": "Traders spotted strong bullish signals for Bitcoin, including a potential bear trap reversal and a technical breakout projecting a rally to $107,000 next month.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56596827,
    "published": 1767100282000,
    "title": "Aptos gains as volume surge signals accumulation",
    "body": "APT broke through key resistance levels on institutional buying activity.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Aptos|Technical Analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 70,
        "NAME": "APT",
        "CATEGORY": "APT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56598741,
    "published": 1767103262000,
    "title": "The Year in Stablecoins 2025: Record Growth as GENIUS Act Opens the Floodgates",
    "body": "Stablecoins exploded in 2025 with new regulations, banking charters, and a $306 billion market cap—but not all issuers had smooth sailing.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 56598717,
    "published": 1767103254000,
    "title": "Something Big Is Coming — Investor Hints At XRP ETF Breakthrough This Week",
    "body": "Investor Paul Barron’s hint at “big news” has reignited attention on XRP exchange-traded funds this week, sending the community into speculation over possible upcoming announcements or launches. Related Reading: Crypto Heat Fizzling Out? US Search Interest Plunges As Retail Shy Away Traders and holders reacted fast on social channels, pushing chatter and price focus higher even as specifics remain unclear. ETF Flows Heat Up According to data shared by Nate Geraci, President of NovaDius Wealth, Bitcoin and Ethereum ETFs dominated year-to-date inflows. BlackRock’s IBIT Bitcoin ETF led with $25 billion in inflows. Grayscale’s Bitcoin Mini Trust ETF followed at $1.11 billion. Fidelity and VanEck posted $477 million and $305 million respectively. On the Ethereum side, BlackRock’s offerings recorded about $9.12 billion. A Solana staking ETF from Bitwise pulled in $839 million. These numbers show where most large investors are putting money right now. Expect some big news this week $XRP ETFs https://t.co/3BY5XJosPx — PaulBarron (@paulbarron) December 29, 2025 Community Reaction And Speculation Barron’s remark has been read by many as a hint at another XRP-related announcement. Some expect a new ETF launch; others are watching for updates from issuers already in the market. That talk has helped push attention — and inflows — to XRP products that only debuted late in the year. XRP Ledger Tokenization Surge Based on reports from rwa.xyz, on-chain data indicates tokenized real-world assets on the XRP Ledger rose by 2,200% in 2025. The network saw about 23x growth in the value of native real-world assets, including stablecoins, and crossed the $500 million threshold. Themes around RWA tokenization were widely discussed this year by figures such as BlackRock CEO Larry Fink and former SEC Chair Paul Atkins, and the XRPL appears to be drawing benefit from that interest. XRP ETFs Show Early Strength Canary’s XRP ETF (XRPC) registered $384 million in year-to-date inflows after launching in November. Other XRP spot funds have built sizable holdings too: 21Shares holds about $250 million, Bitwise roughly $227 million, Grayscale around $244 million, and Franklin about $206 million. Based on reports, all of these XRP spot ETFs launched in November and December and now tally roughly $1.24 billion in total assets under management with cumulative inflows near $1.14 billion. For a new category, that level of money moving in over a short span is notable; some industry voices point out the total might have been higher if market mood had not cooled recently. Reports also say XRP ETFs pulled in over $1 billion through 21 days of steady inflows. Pending Products And Rumors WisdomTree’s XRP ETF is among the pending offerings that market watchers expect to arrive next. At the same time, talk about a BlackRock XRP ETF has circulated widely. There is currently no public filing tied to a BlackRock XRP product, and reports caution that such expectations are premature without official filings or approvals. Related Reading: Bitcoin Rules The Decade: Outshines Gold And Silver, Analyst Says Current flows note that XRP’s ETF debut has shifted part of investor focus from pure crypto bets to spot ETF allocations and tokenization themes. Whether Barron’s hinted “big news” becomes a concrete catalyst will depend on filings and formal product launches. For now, the mix of solid early inflows and rapid XRPL tokenization growth has put XRP squarely in the conversation among ETF-focused investors and network adopters. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|BlackRock|crypto|etf|Real World Asset|Tokenization|xrp",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56599354,
    "published": 1767104146000,
    "title": "Russia targets unregistered crypto miners with new criminal penalties",
    "body": "Russia’s justice ministry proposed fines and prison for illegal crypto mining, as officials say most miners still haven’t joined the tax register.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56599254,
    "published": 1767104016000,
    "title": "CoinDesk 20 Performance Update: Ethereum (ETH) Gains 1.8% as Index Moves Higher",
    "body": "Aptos (APT) was also a top performer, up 3.1% from Monday.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "CoinDesk Indices|CoinDesk Indices|CoinDesk 20|charts|Prices|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 70,
        "NAME": "APT",
        "CATEGORY": "APT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56601642,
    "published": 1767107526000,
    "title": "XRP supply on exchanges hits 8-year lows: Will it spark a 2026 price rally?",
    "body": "XRP exchange supply hits 8-year lows, tightening the available supply for sale and setting the stage for a potential 2026 supply-shock rally.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56605642,
    "published": 1767114025000,
    "title": "Crypto Policy In The Hot Seat As US Lawmaker Calls SEC Hearing",
    "body": "US Representative Maxine Waters has formally asked House Financial Services Committee Chair French Hill to schedule an oversight hearing with Securities and Exchange Commission (SEC) Chairman Paul Atkins, saying the agency must explain recent choices that, she argues, weaken enforcement of securities laws. Related Reading: Bitcoin Rules The Decade: Outshines Gold And Silver, Analyst Says Waters Seeks Answers On Dropped SEC Cases According to Waters’ letter, the SEC has terminated or stayed a number of high-profile crypto enforcement actions that had been moving through the agency’s process, and committee Democrats want an explanation for those decisions. Reports have disclosed that the letter names actions involving Coinbase, Binance, Justin Sun, Kraken, and Ripple among those of concern. The request lists nine areas where the SEC’s recent conduct raises questions for lawmakers, including whether enforcement choices were driven by legal judgment or by outside pressures. Waters, who is the ranking Democrat on the Financial Services Committee, told Chairman Hill that the public deserves clarity about changes to enforcement strategy and about how investor protections will be preserved. Concerns About Politicization And Investor Protections Based on reports, Waters expressed particular alarm that the agency’s handling of cases since US President Donald Trump took office looks different from prior enforcement patterns, and she argues that some moves could amount to an erosion of investor protections. Industry observers and several media outlets have picked up the story, noting the broader context: a year of big shifts in crypto policy and new legislation that has altered the regulatory picture. 🚨 MAXINE WATERS CALLS FOR HEARING ON SEC CHAIR ATKINS’ CRYPTO DECISIONS — The Wolf Of All Streets (@scottmelker) December 30, 2025 Some outlets say the timing of Waters’ letter—sent late in December—reflects rising pressure from Democrats as they prepare for oversight if they regain more committee influence. What Waters Wants From The SEC In her request, Waters seeks direct answers about why certain cases were dropped or delayed, what internal analyses the SEC relied on, and whether staff reductions or policy shifts affected enforcement. She also asked that Chairman Atkins appear before the committee so members can question him in public. Committee Role And Next Steps Reports indicate the letter was delivered to Chairman Hill on December 29, 2025, and that Waters urged him to set a date for an oversight hearing as soon as possible. Related Reading: Crypto Heat Fizzling Out? US Search Interest Plunges As Retail Shy Away The committee could use a hearing to examine documents and testimony from SEC officials, and to press for a public accounting of how decisions were made about major crypto matters. How quickly that happens will depend on the committee’s calendar and on whether Hill agrees to a formal public session. The issue has drawn attention because it involves both enforcement of existing securities law and the future of crypto oversight in the US. Investors, industry groups, and lawmakers on both sides are watching to see whether the SEC’s recent moves represent a long-term policy shift or isolated choices tied to individual cases. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|bitcoin|crypto|Maxine Waters|sec",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56605314,
    "published": 1767113492000,
    "title": "Grayscale files for first U.S. Bittensor ETP as decentralized AI gains momentum",
    "body": "The filing marks the first attempt to bring TAO, Bittensor’s native token, to U.S. markets through a regulated investment product.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Grayscale|decentralized AI|Crypto ETPs|Exchange-Traded Product|SEC|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 73,
        "NAME": "BITTENSOR",
        "CATEGORY": "BITTENSOR"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56605221,
    "published": 1767113034000,
    "title": "Ethereum quietly sets a record: 8.7M contracts deployed in one quarter",
    "body": "Onchain development activity on Ethereum has rebounded sharply, driven by tokenized assets, stablecoins and infrastructure, according to Token Terminal.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56606300,
    "published": 1767114935000,
    "title": "Grayscale moves toward exchange listing for TAO trust in US",
    "body": "The proposed TAO investment vehicle, one of the first exchange-traded products that could be available to US markets, is expected to be listed on NYSE Arca following approval.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 73,
        "NAME": "BITTENSOR",
        "CATEGORY": "BITTENSOR"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56607049,
    "published": 1767116201000,
    "title": "South Korea’s long-awaited crypto law stalls over who can issue stablecoins",
    "body": "The Digital Asset Basic Act is stalled as regulators clash over who should be allowed to issue won-pegged stablecoins, extending uncertainty in one of Asia’s most active crypto markets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|South Korea|Regulation|Stablecoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56608917,
    "published": 1767119423000,
    "title": "XRP’s Real Use Case Is Laying The Groundwork For Appreciation — Here’s How",
    "body": "In the evolving landscape, the narrative around XRP’s real use case is increasingly standing out in a market often driven by speculation. The altcoin is embedded in live financial workflows, particularly in cross-border payments and liquidity management. Its role as a bridge asset allows institutions to move value quickly, cheaply, and at scale, solving real inefficiencies in the global payments system. Why XRP Functions As A Bridge Asset In Global Payments This design choice is centered on understanding why its utility will drive price appreciation. An analyst known as SMQKE revealed on X that the core of this model is payment utility. XRP is designed to operate within the global payment infrastructure, and Ripple has integrated with existing financial systems to enhance speed, reduce costs, and improve settlement efficiency. Related Reading: Pundit Shares ‘Urgent Update’ With XRP Community – Here’s What He Said Through Ripple’s integrations, financial institutions adopt the network, and the altcoin is utilized directly to move value across borders. From a price perspective, this document outlines how institutional settlement activity has created a sustainable demand for XRP, supporting price appreciation through real transaction flow. Analyst Vet has highlighted the areas where XRP and the XRP Ledger were great in 2025. One is smart contracts, and a significant amount of development went into getting the alpha testnet live, where individuals can currently deploy and play around with it. Community awareness toward this also increased meaningfully. On the DeFi front, momentum came out strongly from late 2024, especially driven by meme coins. However, the activity dried out over the year. Baseline DEX activity is now higher than it was before the DeFi wave, but this raises the potential for more growth in 2026. Furthermore, interoperability has made tangible progress as Wormhole went live, Axelar live became operational, and yield-bearing issued assets were bridged onto the XRPL. Currently, Zero-Knowledge Proofs (ZKP) appear to be a key enabler for trust-minimized bridging. On the application side, existing XRPL projects and wallets doubled down. Apps became more polished, with new feature-rich and better integrations, while no new app took over the community. At the same time, tokenization stood out as one of the strongest verticals. RLUSD was a major milestone, complemented by smaller launches of other stablecoins and tokenized funds. The distribution channel of these assets needs a lot of work, which directly ties back to application-layer development. That’s why this year should be viewed as the foundation for 2026. How Fee Destruction Changes Economic Incentives Ripple’s XRP is designed to compete in low-fee markets and has built programmable economics. According to Xfinancebull, every transaction fee is destroyed; it is not paid to validators, no middleman, and there is no inflation loop. Related Reading: Flare Launches New Way For XRP Investors To Earn This is because XRPL is designed to scale global payment rails, not enrich toll collectors. That’s why XRP is one of the few chains where volume is value, not congestion. Xfinancebull stated that this isn’t a trading feature, but it’s a monetary policy shift hidden at the protocol layer. Featured image from Pxfuel, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP News|altcoin|Analyst Vet|Ripple|SMQKE|XFinanceBull|xrp|xrp news|XRP Price|XRPL|XRPUSD|xrpusdt|zero-knowledge proofs|ZKPs",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56608987,
    "published": 1767119610000,
    "title": "XRP Projected To Reach $8 By 2026: Standard Chartered Identifies Two Major Catalysts",
    "body": "Despite a mixed performance throughout 2025, XRP has emerged as one of the standout performers in the cryptocurrency market. Currently trading slightly below $1.90, the fifth-largest cryptocurrency has retraced nearly 50% from its all-time highs achieved in July. Nevertheless, Standard Chartered is optimistic about XRP’s future, forecasting a significant upward trend driven by anticipated inflows into spot exchange-traded funds (ETFs) and increased regulatory clarity. Spot XRP ETFs Could Drive $4-$8 Billion In Inflows The bank predicts that the launch of spot XRP ETFs could bring in between $4 billion and $8 billion into XRP throughout 2026. Should these inflows materialize, the resulting demand—coupled with XRP’s relatively limited supply—could catalyze a sharp increase in the coin’s price. Related Reading: US Strategic Bitcoin Reserve: Key Catalyst For Potential Surge Toward $150,000 Next Year Analyst Geoffrey Kendrick has laid out an ambitious roadmap for XRP’s future, anticipating prices of $8.00 in 2026, and potentially reaching $12.50 by 2028. To put this into perspective, XRP’s current circulating supply is approximately 57 billion coins. Even modest inflows of a few billion dollars could create a meaningful supply shock in the market. So far, XRP ETFs have gathered around $1.25 billion. To reach the $8 target, it would require annual flows to hit the range of $5 billion to $10 billion, similar to the initial enthusiasm surrounding Bitcoin ETFs. Regulatory Resolution As Key Catalyst A parallel factor influencing XRP’s potential rise is the resolution of regulatory uncertainty surrounding the cryptocurrency. The US Securities and Exchange Commission’s (SEC) long-standing lawsuit against Ripple Labs has significantly impacted XRP’s narrative. Yet, in August 2025, the SEC withdrew its appeal, resulting in Ripple agreeing to a $125 million settlement and affirming that XRP sales on secondary markets are not classified as securities transactions. Related Reading: Bitcoin And Ethereum Influx: Strategy Grabs 1,200 BTC, Bitmine Immersion Ups ETH by 44,000 This resolution eliminates a substantial legal burden and is seen by Standard Chartered as a catalyst for increased adoption. With legal uncertainties removed, capital that had been sidelined could finally enter the market. However, for XRP to achieve a price of $8 by 2026, favorable economic conditions, including low interest rates and a risk-on attitude among investors, would be critical. Should macroeconomic challenges escalate, investors may shy away from altcoins. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|crypto|crypto market|crypto news|Spot XRP ETF|Spot XRP ETFs|XRP ETF|XRP ETF News|XRP Price|XRP Price Analysis|XRP Price Breakout|XRP Price Forecast|XRP price news|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56609039,
    "published": 1767119416000,
    "title": "How privacy prevailed in an otherwise dismal Q4 for crypto",
    "body": "Relative outperformance by privacy-focused cryptocurrencies such as Zcash suggests defensive positioning as markets absorbed losses and broader structural stress.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56610091,
    "published": 1767121262000,
    "title": "The Year in Bitcoin and Crypto ATMs 2025: Power Tools, Scams and Calls for Action",
    "body": "Bitcoin and crypto ATMs faced heightened scrutiny in 2025, as authorities and lawmakers tried to confront a growing number of scams.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56612074,
    "published": 1767124850000,
    "title": "XRP Price To Rally 690% To $15 In Unexpected ‘Measured Move’",
    "body": "The XRP price may be on the verge of its biggest rally yet, as a crypto analyst has forecast a dramatic 690% surge to $15 soon. According to the expert’s analysis, XRP is undergoing an unexpected measured move that has historically led to explosive price surges. While the current price structure depicts a bearish trend, the analyst remains confident that XRP could recover from the ongoing downside momentum and catch the market off guard with a parabolic move upwards. XRP Price Projected To Reach $15 From Under $2 Crypto market analyst Javon Marks has delivered a new outlook on XRP, highlighting a powerful continuation setup based on historical price behavior. In his analysis, Marks pointed out a measured move structure that previously defined a primary expansion phase for XRP. Related Reading: XRP Stochastic RSI Just Touched 0.0 For The Second Time In History The analyst explained that XRP completed the full measured move after its breakout in 2017, delivering a sharp upside extension. According to him, the same technical conditions are reemerging in XRP’s current market structure, suggesting the potential for another significant price surge. Marks emphasized that if the measured move plays out as expected, XRP could reach uncharted price levels above $15. He revealed that a surge to this point would represent nearly an eightfold increase from current trading levels below $2, equating to gains of more than 690%. Notably, this bullish scenario would mark a significant milestone for XRP, which has never been in double-digit territory and is presently trending downwards. The chart accompanying Marks’ analysis shows a long-term symmetrical triangle pattern that formed after XRP’s previous explosive rally during the 2017-2018 bull cycle. The cryptocurrency’s price had repeatedly respected converging trend lines, indicating sustained accumulation and compression over several years. XRP broke above the upper boundary of this formation in late 2024, mirroring the same breakout seen during the previous cycle when the measured move occurred. This was followed by a strong price rally that continued into early 2025, pushing XRP above $3. Although the cryptocurrency delivered impressive gains for much of 2025, its price has since declined, falling below $2 and now trading at $1.87 after crashing by 15% over the past month, according to CoinMarketCap. A Downtrend Pressure Despite Short-Term Support On the flip side, crypto expert Marcus Cornivus notes that XRP remains in a downtrend, showing no signs of immediate recovery, as its market continues to be weighed down by persistent selling pressure. He said that XRP is holding just above a strong demand zone, where a short-term bounce is possible as buyers attempt to defend this area. Related Reading: XRP Price Must Stay Above This Level Or Crash To $0.9 Cornivus also stated that XRP’s overall trend and the bigger picture are bearish, with lower highs intact and the descending trendline still in control of price action. He highlighted that any bounce that fails to break and hold above the trendline would only lead to a temporary pullback. Additionally, if sellers retreat even briefly, he expects XRP to react sharply. The analyst has also revealed that if the demand zone fails, XRP’s downside continuation may accelerate. Featured image from Pngtree, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|CoinMarketCap|Javon Marks|Marcus Cornivus|Ripple|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56611852,
    "published": 1767124348000,
    "title": "South Korea delays crypto bill over stablecoin concerns: Report",
    "body": "The introduction of a stablecoin bill pioneered by South Korean President Lee Jae-myung will reportedly be delayed into 2026 after concerns about issuers.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56614103,
    "published": 1767128431000,
    "title": "XRP Slides To $1.80 While Binance Reserves Continue To Decline",
    "body": "XRP is struggling to regain bullish momentum as persistent selling pressure continues to dominate market conditions. Price action remains weak, and recent attempts at recovery have failed to attract meaningful demand. With bulls largely absent, sentiment across the XRP market has turned defensive, and an increasing number of analysts are warning that the token could face further downside in the coming weeks if current conditions persist. Related Reading: Chainlink Shows Strong Accumulation Signal: LINK Exchange Liquidity Dries Up Despite the bearish tone reflected in price, on-chain data reveals an important structural shift. Data from Binance shows that XRP reserves on the exchange have declined to approximately 2.64 billion XRP, marking their lowest level since 2024. This drop indicates that a significant amount of XRP has been withdrawn from the platform, reducing the supply readily available for immediate sale. In on-chain analysis, falling exchange reserves are typically interpreted as a sign that holders are moving assets into self-custody rather than positioning to sell aggressively. The divergence between weakening price action and declining exchange reserves adds complexity to the outlook. While the market remains under clear pressure and momentum continues to fade, the absence of rising reserves suggests that the recent price decline has not been driven by large-scale exchange selling. Instead, the data points toward weak demand rather than an influx of sell orders. Falling Exchange Reserves Suggest Selling Pressure Is Easing A recent CryptoQuant report highlights a sharp decline in XRP reserves on Binance, pointing to a continued outflow of coins from the exchange. This reduction means fewer tokens are readily available for immediate sale, a dynamic that on-chain analysts typically associate with easing sell-side pressure. Instead of positioning to exit, investors appear to be moving XRP into private wallets, signaling a preference for holding or using assets outside of active trading venues. Arab Chain adds important context to this development. XRP’s price has fallen to around $1.80 after failing to sustain levels above $3, a zone that previously defined the bullish peak of the move. Crucially, this price decline has not been accompanied by an increase in exchange reserves. Related Reading: XRP Selling Pressure Returns: Investors Shift From Holding to Distribution In past market cycles, sharp bearish reversals were often driven by rising reserves, as large inflows to exchanges reflected aggressive selling. That pattern is notably absent this time. The current setup suggests that XRP’s weakness is more a function of fading demand than heavy distribution. Sellers do not appear to be flooding exchanges, even as price trends lower. This distinction matters for assessing downside risk. With XRP reserves now at their lowest level since 2024, the market may be building a more supportive base. If buying momentum returns, reduced exchange supply will amplify price reactions, triggering faster and more pronounced moves than periods of high reserves. XRP Tests Long-Term Support As Bearish Structure Persists XRP price continues to trade in a clearly weakened structure, with the chart highlighting a prolonged corrective phase following the sharp rejection from the $3.60–$3.70 highs. After peaking in late summer, XRP entered a steady downtrend marked by lower highs and persistent selling pressure, eventually breaking below the $2.00 psychological level. This breakdown shifted market structure decisively in favor of bears and accelerated the move toward the current $1.85–$1.90 zone. From a technical perspective, XRP is trading below its 50-day and 100-day moving averages, both of which have rolled over and are now acting as dynamic resistance. The 200-day moving average, currently rising near the $1.75–$1.80 region, has become the most critical level to monitor. Related Reading: Why $100,000 Is Bitcoin’s Most Important Resistance Level Price is hovering just above this long-term support, suggesting that selling pressure is slowing but not yet fully exhausted. At the same time, declining volume during recent sessions points to reduced participation rather than clear accumulation. As long as XRP fails to reclaim the $2.10–$2.20 range, downside risks remain elevated. A decisive breakdown below the 200-day moving average would likely open the door to a deeper correction toward the $1.60 area. On the upside, bulls would need a strong reclaim of $2.00 followed by acceptance above short-term moving averages to signal a meaningful trend reversal. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP News|xrp|XRP analysis|XRP Exchange Reserves|xrp news|XRP Price|XRP reserves|XRP supply|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56615919,
    "published": 1767132014000,
    "title": "XRP Becomes Most Bought Digital Asset, Bitcoin And Ethereum Bleed $500 Million",
    "body": "XRP, Bitcoin, and Ethereum are displaying sharply diverging fund flow trends, with XRP emerging as the most accumulated digital asset in the latest CoinShares Digital Asset Fund Flows Weekly Report. With Bitcoin and Ethereum jointly recorded nearly $500 million in outflows, the data illustrates a shift in investor positioning away from the market’s largest assets toward select alternatives amid ongoing volatility. XRP Inflows Highlight Selective Demand Contrasting sharply with the redemptions sweeping through Bitcoin and Ethereum products, XRP has continued to register major inflows. CoinShares data shows XRP-linked investment vehicles attracted $70.2 million in new capital last week, reflecting ongoing interest from investors in these nascent ETF categories. Since their mid-October US launches, XRP has accumulated about $1.07 billion in inflows, a remarkable trajectory given the prevailing outflow environment for larger assets. Related Reading: XRP Price May Be Bearish Below $2, But On-Chain Data Tells A Different Story This bifurcation in fund flows underscores a selective repositioning among investors. While broad risk assets like Bitcoin and Ethereum grapple with selling pressure, XRP’s performance shows that certain niche products are still attracting interest even in a downtrend. This pattern may be likely due to different expectations about regulations, adoption, or the impact of newly launched ETF products aimed at specific investors. Bit-Heavy Outflows: Bitcoin And Ethereum Under Pressure Despite their dominant roles in the market, Bitcoin and Ethereum endured significant net outflows during the reporting week ended December 29, contributing the lion’s share of the overall outflow figure. According to CoinShares, Bitcoin-linked products recorded approximately $443 million in redemptions, representing nearly the totality of the weekly withdrawal from crypto investment vehicles. Ethereum-focused products also saw $59.5 million exit, adding to a broader pattern of institutional caution toward the largest digital assets. These negative flows have accumulated since the mid-October US ETF launches, with Bitcoin recording roughly $2.8 billion and Ethereum about $1.6 billion in outflows over this period. The concentration of redemptions in the United States, where $460 million left digital asset funds, highlights a prevailing aversion among domestic investors toward reallocating capital into BTC and ETH during periods of price volatility and regulatory uncertainty. Related Reading: Banks Could Start Holding XRP Due To This Simple Change The sustained outflows amid weak sentiment reflect broader investor behavior during market stress. When capital flees established assets, it often signals profit-taking, risk reduction, or shifts into alternative strategies or cash positions, all of which can exert downward price pressure and prolong short-term weakness. For Bitcoin and Ethereum, this trend suggests that even their extensive adoption and liquidity have not insulated them from pullbacks in institutional demand. Overall, the latest fund flow data signals a clear rotation in investor attention. While Bitcoin and Ethereum continue to experience significant outflows, XRP is drawing capital, emphasizing a market environment where targeted assets are increasingly capturing the focus of both institutional and retail participants as 2026 approaches. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|ethusd|ETHUSDT|Ripple|ripple news|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56617676,
    "published": 1767135624000,
    "title": "XRP Enters The Same Zone That Preceded Its Last Historic Breakout – What To Know",
    "body": "XRP is once again trading in a zone that closely mirrors the conditions seen before its last historic breakout, drawing fresh attention from market watchers. Key momentum indicators suggest selling pressure is fading, while long-term holders appear to be quietly absorbing supply. Although price action remains cautious for now, the setup is sparking discussions about whether XRP is positioning itself for another major move once market confidence returns. A Rare Momentum Reset On The Higher Timeframe In a significant technical development on XRP’s high-timeframe charts, Steph is Crypto has highlighted that the Stochastic RSI on the 3-week interval has plummeted to a value of 0.00. This level represents a state of total compression for the oscillator, signaling a momentum shift that is rare in the asset’s trading history. Related Reading: XRP Price Trims Upside, Slow Decline Signals Seller Dominance The rarity of this signal cannot be overstated, as it has occurred only once before at the absolute depths of the 2022 bear market. Historically, when the indicator reaches zero, it serves as a definitive marker that the prevailing selling pressure has reached a point of total exhaustion. From a structural perspective, it indicates that the energy behind the downward trend has completely dried up. It is important to note that this does not guarantee an immediate recovery. When this technical phenomenon surfaced in previous cycles, it preceded a prolonged accumulation phase. During that period, the price stabilized as smart money began to build positions, creating a foundation for the next major impulsive move toward the upside. Seeing this signal reappear now suggests that XRP’s downside risk is structurally limited at current valuations. It points to a market environment where long-term holders are actively absorbing the available supply, transitioning from a distribution phase to a period of strategic positioning. A Familiar Market Rhythm Is Emerging on XRP’s Long-Term Chart Altcoin Pioneers, in a recent update, highlighted a striking fractal pattern forming on XRP’s chart, suggesting that history may be repeating with remarkable accuracy. A 3-day chart comparison reveals strong similarities between the 2016–2017 market cycle and the current structure, both shaped by a prolonged ABC corrective phase before a major breakout. Related Reading: XRP Exchange Inflows Spike To End 2025: Will Price Decline Deepen? In the earlier cycle, XRP spent months completing its correction before launching into an explosive rally. The 2024 structure mirrors the past ABC pattern, while the ongoing 2025–2026 correction is aligning closely with the final C-wave down to the $1.87 region, though on a slightly shorter timeline. If this fractal continues to play out, Altcoin Pioneers believe XRP could be nearing the end of a painful shakeout phase, setting the stage for the next powerful upside leg. XRP has followed this script before, and those who held through the last cycle understand what’s coming next. Featured image from Peakpx, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|ABC Corrective Pattern|Altcoin Pioneers|Ripple|Steph is Crypto|stochastic RSI|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56620073,
    "published": 1767140461000,
    "title": "2026 Fed cuts will be ‘key catalyst’ for retail's return to crypto",
    "body": "Investors will be more excited about crypto if the Fed continues cutting rates in 2026, says a crypto analyst.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56620827,
    "published": 1767141859000,
    "title": "Pakistan could be a crypto leader in 5 years at current pace: CZ",
    "body": "Former Binance boss Changpeng Zhao has praised Pakistan for its speedy crypto adoption in 2025, saying the country is on track to become a crypto leader by 2030.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56622158,
    "published": 1767144780000,
    "title": "Ringing In Crypto’s ‘Watershed’ Tax Year: A Tricky 2026 Filing Season",
    "body": "According to digital asset tax experts, the 2026 filing season will be messy and a minefield for most crypto investors. Getting tax professional help in 2026 is critical",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56626273,
    "published": 1767153627000,
    "title": "Bitcoin Risks A Year-Long Bear Market If This Happens: On-Chain Data",
    "body": "Bitcoin’s price action has pushed a closely watched on-chain profitability gauge into a configuration that, in 2022, preceded an extended drawdown and one analyst says a break below $70,000 would risk repeating that “year-long” reset. In a Dec. 30 morning brief, Axel Adler Jr. argued that Bitcoin’s “Supply in Profit” trend is at an inflection point after BTC stabilized in the $87,000–$90,000 range following the pullback from October highs. The metric, which tracks how much BTC is held above its acquisition price, has fallen sharply from October peaks above 19 million BTC to roughly 13.2 million BTC, creating a sizable gap between short- and medium-term moving averages. A 2022-Like Setup Looms For Bitcoin Adler’s core signal is the spread between the 30-day and 90-day simple moving averages of Supply in Profit. After the correction from the all-time high, the 30-day average “dropped significantly below” the 90-day, forming a gap of about 1.75 million BTC. Adler noted that “a similar configuration was observed in 2022 before an extended bearish period,” but stressed an important distinction this time: the 365-day moving average remains “at historically elevated levels for now,” implying the longer-term profit structure hasn’t fully rolled over. Related Reading: US Strategic Bitcoin Reserve: Key Catalyst For Potential Surge Toward $150,000 Next Year The near-term question is whether the 30-day trend has bottomed. Adler flagged Dec. 18 as a local minimum for the 30-day average and said it is now “beginning to turn around,” with confirmation tied to a simple condition: Supply in Profit must hold above its 30-day average, which in practice requires BTC to keep its footing at current levels or higher. Adler’s projection for a bullish recovery in this signal is unusually specific: he estimates the gap between the 30-day and 90-day averages is narrowing at roughly 28,000 BTC per day, mainly because the 90-day average is being pulled down mechanically as high October values roll out of the window. “Why is SMA 90 falling while price remains stable?” Adler wrote in the brief’s FAQ. “This is a mechanical effect of the moving average: values from early October are now dropping out of the 90-day window, when Supply in Profit was at peaks of 18–20M BTC with price at $115–125K. Even with stable current Supply, this pulls the average down.” Related Reading: 2026 Bitcoin Price Predictions: What Banks, Institutions And Experts Forecast That rollover effect, Adler said, should persist through late January, providing a “tailwind” that could allow the 30-day line to reclaim the 90-day line even without a dramatic surge in Supply in Profit. If the current rates of change hold, Adler projects a bullish cross — where the 30-day average rises above the 90-day — in late February to early March. The Invalidation: $70,000 The forecast, however, is explicitly price-sensitive. Adler estimated Supply in Profit has “elasticity to price” of 1.3x, meaning a 10% BTC drawdown could translate into about a 13% drop in the supply held in profit. In his model, the market’s critical fault line is the $70,000 zone. “At what price does the cross scenario get invalidated?” Adler wrote. “The critical zone is below $70K. At that level, Supply would fall to ~10M BTC, and SMA 30 would begin declining faster than SMA 90. The GAP would stop narrowing and shift to expansion, postponing the bullish signal indefinitely.” In that scenario, Adler said the setup would more closely mirror 2022: the spread expands rather than compresses, and the bullish cross gets pushed out, with recovery potentially taking “up to one year.” By contrast, he framed the constructive path as holding above $75,000–$80,000 through January, keeping Supply in Profit supported and preserving the convergence pace. At press time, BTC traded at $88,102. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin bear market|Bitcoin news|bitcoin price|btc|BTC news|btc price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56628073,
    "published": 1767157235000,
    "title": "Crypto Hacks Swipe Nearly $3 Billion In 2025 Despite Fewer Attacks – Report",
    "body": "As we approach the final day of a massive year for the crypto industry, a recent report revealed that the sector has lost nearly $3 billion amid the emergence of new trends from malicious actors and growing security complexities. Related Reading: Solana Bearish Formation Hints At Major Correction Until Mid-2026 – Here’s The Target 2025 Crypto Losses Increase By 45% On Tuesday, blockchain security firm SlowMist shared its 2025 Blockchain Security & AML Annual Report, highlighting the severe security challenges the crypto industry faced throughout the year. According to SlowMist, the total value stolen from crypto hacks increased by 46% in 2025 compared to 2024, a trend previously noticed by earlier reports. Notably, crypto theft had been more devastating by the first half of this year than the entirety of 2024. A Mid-Year report by Chainalysis showed that 2025’s activity by the end of June revealed a significantly steeper trajectory into the end of the first half than any previous year, with an alarming velocity and consistency. Now that the year is near its end, security incidents have cost approximately $2.935 billion, according to SlowMist data, significantly surpassing the $2.013 billion in losses from the previous year. However, the number of incidents dropped year-over-year (YoY) despite the total amount of losses increasing, signaling a trend of fewer but larger-scale crypto heists. The number of incidents declined by 51%, with 200 cases in 2025. In comparison, 2024 saw 410 reported hacks. The report shared that DeFi remained the most frequently targeted sector this year, with 126 security incidents, accounting for approximately 63% of all hacks and total losses of around $649 million. This represents a 37% and 62% YoY decrease from 2024’s 339 incidents and $1.029 billion in losses, respectively. Meanwhile, Centralized exchange (CEX) platforms reported 22 incidents, which accounted for $1.809 billion in losses, led by Bybit’s hack. The February attack resulted in approximately $1.46 billion being stolen in a single incident, becoming the most serious and largest security event of the year. Regulatory Enforcement Strengthens Although phishing remained one of the most active schemes, scams and intrusive attacks continued to evolve in 2025, noted SlowMist. Therefore, scams have become more deceptive and difficult to detect, with malicious actors no longer relying on a single method of attack to deceive victims: Traditional phishing has gradually expanded into permission hijacking, malicious code execution, and supply-chain poisoning. Attacks are no longer reliant on a single method; instead, they increasingly combine social engineering, browser exploitation, new protocol mechanics, and hybrid lure strategies to form stealthy and destructive attack chains. However, the report highlighted that crypto enforcement and sanction actions worldwide displayed a “clear trend of escalation” this year, as regulatory and law enforcement agencies directly intervened “in key areas of crypto-related money laundering, fraud, sanctions evasion, and illicit financing.” Related Reading: Crypto’s Big Money Signals Change: BTC Holders Pause, ETH Whales Buy Notably, there were 18 incidents this year in which lost funds were recovered or frozen. In these cases, the total stolen funds totaled to $1.95 billion, of which nearly $387 million was successfully returned or frozen. SlowMist concluded that “the development of the Web3 industry will no longer rely solely on technical innovation. (…) Organizations that can build stronger internal security controls, more transparent fund governance models, and more comprehensive KYT/AML review capabilities will gain longer-term resilience in the next cycle.” Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bybit hack|crypto hacks|crypto losses|crypto losses 2025|crypto market bull run 2025|crypto market correction|crypto theft|DeFi hacks|SlowMist|total|total crypto maket cap",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56628885,
    "published": 1767158774000,
    "title": "Uganda opposition leader promotes Bitchat amid fears of internet blackout",
    "body": "Google Trends search for “Bitchat” in Uganda shows a spike from 0 to 100 on Wednesday, the day after opposition leader Bobi Wine urged people to download it.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 56629187,
    "published": 1767159458000,
    "title": "Bullish calls of XRP to jump 300% in 2026 do the rounds again, implying $8 target",
    "body": "Standard Chartered predicted XRP could rise to $8 by 2026 in an April note, supported by improved U.S. regulatory clarity and institutional interest.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56629131,
    "published": 1767159078000,
    "title": "Bitcoin, ether drop more than 22% in Q4 as December ‘Santa rally’ fizzles",
    "body": "The market's focus is now on whether bitcoin can maintain its support levels into the new year, as the failed rally may signal a need for a deeper market reset.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|btc|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56629940,
    "published": 1767160831000,
    "title": "Bitcoin Coinbase Premium At Rare Discount As US Demand Weakens",
    "body": "The Bitcoin Coinbase Premium Gap has witnessed a sharp decline into the negative zone recently, with its value now sitting at one of the lowest in the last 18 months. Bitcoin Coinbase Premium Gap Has Plunged In a new post on X, CryptoQuant community analyst Maartunn has talked about the latest trend in the Bitcoin Coinbase Premium Gap. This indicator keeps track of the difference between the BTCUSD price on Coinbase and BTCUSDT price on Binance. Related Reading: Bitcoin Retail Optimism Returns To End 2025—What Usually Follows? Coinbase is mainly used by traders in the US, especially the large institutional entities, while Binance hosts a global traffic. As such, the Coinbase Premium Gap reflects the difference in behavior between American and offshore whales. When the value of the metric is greater than zero, it means the asset is trading at a higher value on Coinbase than Binance. Such a trend implies users of the former are applying a higher amount of buying pressure (or lower amount of selling pressure) as compared to the userbase of the latter. On the other hand, the indicator being negative suggests Binance may be observing a higher amount of accumulation as the cryptocurrency is going for a higher price on the platform. Now, here is the chart shared by Maartunn that shows the trend in the Bitcoin Coinbase Premium Gap over the last year and a half: As displayed in the above graph, the Bitcoin Coinbase Premium Gap has fallen into the negative territory recently, implying the American investors have shifted their behavior to one of higher selling pressure/lower buying pressure. In other words, demand from US traders has gone down. Currently, the indicator is sitting at a value of -$122, which means the cryptocurrency’s price is trading at a discount of $122 on Coinbase relative to Binance. The last time that the metric fell to such a low level was during the price crash in November. In recent times, US institutional entities have played an impactful role in the market, so the Coinbase Premium Gap, which acts a proxy of their behavior, has tended to have some correlation with the asset’s spot price. This pattern was once again seen in November, when a drawdown occurred in the cryptocurrency alongside a plunge into the red zone for the metric. So far, Bitcoin has managed to be relatively stable even with the low demand from the American whales, but it only remains to be seen how long that will continue, given the scale of the discount on Coinbase. Related Reading: Bitcoin Equilibrium: Active Market Participants Just Breaking Even The current value of the Coinbase Premium Gap is one of the lowest in the last 18 months, being seen on only five occasions in this window. BTC Price Bitcoin has been following an overall sideways trajectory recently as its price is still floating around $88,900. Featured image from Dall-E, CryptoQuant.com, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin Coinbase Premium|Bitcoin demand|btc|BTCUSDT|coinbase",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56632309,
    "published": 1767164122000,
    "title": "South Korean retail keeps buying ether hoarder BitMine despite 80% drop:  Report",
    "body": "The company's pivot to building an ether treasury sparked a 3,000% rally, attracting attention from high-risk investors.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 56633419,
    "published": 1767166877000,
    "title": "Coinbase exec warns Senate stablecoin misstep could hand China a global edge",
    "body": "A Coinbase executive says changes to the GENIUS Act could weaken US dollar stablecoins as China moves to boost the digital yuan by allowing interest-bearing wallets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56635202,
    "published": 1767169838000,
    "title": "Bitcoin Long-Term Holder Dump Is Over: On-Chain Data Just Flipped",
    "body": "Bitcoin’s long-term holder cohort appears to have stopped net selling, according to multiple on-chain commentators, in a shift that could remove a key source of structural supply pressure heading into 2026. The change hinges on a supply-change read of long-term holders (coins held longer than six months), which had been negative for months but has now turned modestly positive, said on-chain analyst Darkfost. Is This The Bitcoin Bottom Signal? Darkfost argues that recent claims about long-term holders “selling more than ever” miss what the data is actually showing, especially when large, discrete exchange-related movements skew the picture. “On this chart, which I adjusted to isolate the movement of nearly 800,000 BTC from Coinbase that was distorting LTH data, we can observe a clear shift in supply change,” Darkfost wrote. “Since July 16, the monthly LTH supply change (30 day sum) had been firmly anchored in a distribution phase until recently.” Related Reading: 2026 Bitcoin Price Predictions: What Banks, Institutions And Experts Forecast In plain terms, that meant the share of supply held by long-term holders had been declining for much of the second half of 2025, a regime that tends to coincide with persistent sell pressure as older coins rotate into the market. That phase, Darkfost said, has now ended, at least for the moment. “We have now moved back into positive territory, with around 10,700 BTC transitioning into long term held coins,” Darkfost wrote, calling it “a very modest change,” but “not insignificant.” The implication is that long-term holders have eased off distribution enough for their aggregate holdings to start rising again, even as short-term holders “continue to hold their BTC,” in Darkfost’s framing. CryptoQuant CEO Ki Young Ju echoed the directional takeaway in a shorter post, saying, “Bitcoin long-term holders stopped selling.” Related Reading: Bitcoin Risks A Year-Long Bear Market If This Happens: On-Chain Data VanEck’s head of digital research Matthew Sigel characterized the turn as a meaningful shift in positioning pressure via X. “BTC: Long-term holders turn net accumulators, easing a major Bitcoin headwind and ending, for now, the largest sell pressure event from this cohort since 2019,” Sigel wrote. Renowned expert James Van Straten added historical context to the scale of the move, saying the magnitude of distribution “marked the 2019 bottom as well,” suggesting the current inflection is notable even if it doesn’t, by itself, guarantee a repeat. Darkfost also pointed to historical patterning around these flips. “Historically, such shifts have often preceded the formation of consolidation phases or even bullish recoveries, depending on how the broader trend evolves,” he wrote, emphasizing conditions rather than certainty. At press time, BTC traded at $88,623. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56635987,
    "published": 1767170923000,
    "title": "Bitwise files for 11 single‑token ‘strategy’ crypto ETFs with US SEC",
    "body": "Bitwise is seeking SEC approval for 11 single‑token “strategy” ETFs tied to major altcoins, expanding its product shelf deeper into the altcoin market.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56637462,
    "published": 1767173355000,
    "title": "More NFTs, less money: Supply rose to 1.3B as sales fell 37% in 2025",
    "body": "NFT minting accelerated even as buyers spent less, pushing the market toward a high-volume, low-price equilibrium.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 56638301,
    "published": 1767174782000,
    "title": "Spot Bitcoin ETFs snap 7-day outflow streak with $355M as liquidity improves",
    "body": "US spot Bitcoin ETFs pulled in $355 million, snapping a 7-day outflow streak that saw $1.12 billion withdrawn from the products.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56638133,
    "published": 1767173412000,
    "title": "Crypto Headed For A $10 Trillion Future? Hoskinson Says RWA Is The Key",
    "body": "Charles Hoskinson isn’t backing away from big predictions. The Cardano founder says crypto is still early, despite years of growth and repeated boom-and-bust cycles. In his view, the industry is setting up for something much larger—both in size and in reach. Related Reading: Crypto Heat Fizzling Out? US Search Interest Plunges As Retail Shy Away Today, crypto counts more than 500 million users worldwide. The combined market value already sits in the trillions, with Bitcoin alone worth about $1.75 trillion. That’s impressive, but Hoskinson argues it’s nowhere near the finish line. He believes the sector can grow to 2 billion users and hit a $10 trillion total valuation. That’s a fourfold jump in adoption and more than triple today’s market size. His timeline is clear too. Hoskinson says this could happen within the next 10 years, by 2035. Why Hoskinson Thinks Crypto Explodes From Here The key driver, according to Hoskinson, is real-world asset tokenization, often called RWA. It’s the idea of putting traditional assets—like bonds, property, and commodities—onto blockchains. This isn’t theoretical anymore. Data from RWA.xyz shows close to $20 billion worth of assets, including bonds and real estate, have already been tokenized. That number keeps climbing, even during slow market periods. UPDATE: #Cardano $ADA Founder Charles Hoskinson says the crypto industry will “grow to 2 billion users over the next 10 years and a $10 trillion market cap, because of the RWA revolution and the unification of the financial markets.” $NIGHT pic.twitter.com/F9mntPZd0I — Angry Crypto Show (@angrycryptoshow) December 28, 2025 Hoskinson says this trend changes everything. When assets move on-chain, crypto stops being just about trading tokens. It becomes financial infrastructure. Add in global payment rails and shared standards across blockchains, and you get what he calls a “unified financial market.” Privacy-focused projects also matter here. Hoskinson has pointed to initiatives like Midnight, which aim to balance compliance and privacy. He believes these tools could make institutions more comfortable bringing large pools of capital on-chain. Cardano’s Reality Check In The Market Still, Hoskinson’s optimism comes at an awkward time for his own network. Cardano (ADA) is ending the year under pressure. Selling has stayed heavy, and rallies haven’t lasted. Buying volume remains thin. Price action is stuck below key resistance levels, and momentum hasn’t flipped. As a result, ADA is hovering near important support zones. If those levels break, traders warn the token could drop below $0.30, a psychological line many are watching closely. Market activity overall has slowed, and for now, sellers are still in control. This disconnect hasn’t gone unnoticed. Critics argue Hoskinson’s push for cooperation is partly driven by Cardano’s struggle to attract users at the pace seen on other major chains. Abundance Of Wealth Hoskinson rejects the idea that crypto is a winner-takes-all game. He says the future isn’t about one chain dominating the rest. Instead, he sees room for many networks to grow together. Related Reading: Crypto Policy In The Hot Seat As US Lawmaker Calls SEC Hearing There’s lots of wealth to spread around, he’s said recently. In his view, projects with real use cases will find users naturally as the market expands. That thinking explains his openness to partnerships. Hoskinson has previously hinted at collaborations involving major ecosystems like XRP and Solana. The goal, he says, is shared growth, not tribal fights. Whether the industry reaches $10 trillion remains an open question. But here’s the thing: If RWAs keep moving on-chain and global finance truly starts to merge with crypto rails, the market Hoskinson imagines won’t sound so far-fetched anymore. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|ADA|altcoin|Cardano|Charles Hoskinson|crypto",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56639587,
    "published": 1767177033000,
    "title": "Dogecoin Near $0.11–$0.12 Offers ‘Incredible Risk/Reward,’ Says Analyst",
    "body": "Crypto analyst Matt Hughes, who posts as “The Great Mattsby,” called the $0.11–$0.12 zone “incredible” risk/reward for Dogecoin in a Dec. 30 X post, sharing a weekly DOGE/USDT chart to argue the support is clearly defined. Another trader pushed back, saying traders may be “better off picking a good chart,” setting up a quick dispute over whether DOGE is a high-quality setup or just a cheap one. The Best Risk/Reward Zone For Dogecoin Hughes’ chart frames the $0.11–$0.12 area as a multi-year “line in the sand” on a weekly timeframe. On the right axis, DOGE is marked around $0.1236, sitting just above an orange horizontal band drawn slightly over $0.10. That horizontal is the zone Hughes is referring to, and it’s positioned where price has repeatedly based before, most notably during the long 2022–2023 trough, making it an obvious level for traders who want a nearby invalidation point. He also overlays a linear-scale Gann Square with several rising diagonal guides. The most relevant one is a green, upward-sloping support line that runs under price from the early history of the chart into 2026; the current pullback is compressing into that rising support at roughly the same time it meets the $0.11–$0.12 horizontal. In practical terms, the setup Hughes is advertising is confluence: a horizontal demand zone meeting a long-term uptrend line, which can offer a relatively tight “risk” reference if the level fails. Related Reading: Dogecoin Chart Mirrors Silver’s Breakout, Analyst Flags $9+ Scenario “Risk/reward in the .11-.12 zone for $DOGE is incredible here,” Hughes wrote. “You can visualize support perfectly with this linear scale Gann Square below.” Above spot, the next clearly marked band is a light-blue horizontal line around $0.23, which aligns with a region DOGE has churned around during prior rebounds. Higher up, Hughes’ chart marks additional overhead levels around $0.35 (green) and roughly $0.46 (teal), with a thick line near the upper end of the range around $0.58–$0.60. If the $0.11–$0.12 zone holds, the chart implies the market has room to work back into those overhead shelves; if it doesn’t, the next visible guideposts on the chart are lower rising diagonals in the $0.05–$0.07 region, which would represent a materially deeper reset on the same multi-year structure. On the macro backdrop, Hughes is clear: ” Crypto in 2026: The Bull Run That’ll Crush Fiat Dreams! While governments print money like it’s confetti and banks hoard your wealth, #Bitcoin hits $500K, #Ethereum flips entire industries, Solana owns speed, $XRP settles global finance overnight, and $DOGE moons harder than ever because the memes became money. Skeptics? You’re the same ones who called it a scam in 2021 because you bought the top. Time to wake up or get left in the dust.” Related Reading: Dogecoin Is Repeating Its 2020 Accumulation Cycle, Analyst Says Renowned trader Cheds Trading (@BigCheds) challenged the trade premise bluntly: “Prob better off picking a good chart than throwing money at a bad one.” Hughes didn’t reject the critique; he acknowledged momentum can be easier elsewhere, but restated his preference for a defined downside at the levels he highlighted: “Yea you can ride the momentum better that way but I like the risk/reward in this zone for DOGE.” Hughes’ post also landed alongside broader rotation chatter. He cited @MerlijnTrader approvingly in a separate message, echoing a sentiment-led thesis that altcoin turns often begin when positioning is defensive and conviction is thin. “Look at the wall street cheat sheet, man. We are in depression, right? Trot maps, emotion to price and it’s screaming maximum opportunity right now,” Merlijn said in a short video. “Just got to pick the right coins.” Merlijn tied any rotation to bitcoin’s next resolution and emphasized how uncomfortable those early turns tend to feel. “Once Bitcoin resolves now, all stone bottom one, Bitcoin is weak, right? So they bought them on Bitcoin and stable and everyone has emotionally given up on everything else,” he said. “That’s how rotations are born really quietly, uncomfortably before conviction returns.” For Dogecoin, Hughes’ chart reduces that broader debate to a single question: does the $0.11–$0.12 confluence area hold on the weekly, or does the market force traders to reassess risk further down the structure. At press time, DOGE traded at $0.1232. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|doge|DOGE news|Doge price|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56639501,
    "published": 1767176553000,
    "title": "$675M Lighter airdrop becomes 10th largest in crypto history: Bubblemaps",
    "body": "Bubblemaps says Lighter airdropped $675 million in LIT, one of crypto’s biggest ever, as data shared on X suggests about 75% of recipients still hold.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 204,
        "NAME": "AIRDROP",
        "CATEGORY": "AIRDROP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56641379,
    "published": 1767180052000,
    "title": "Bitwise files for 11 'strategy' ETFs, tracking tokens including AAVE, ZEC, TAO",
    "body": "The exchange-traded funds will invest both directly and indirectly in the tokens.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitwise Asset Management|SEC|ETF|ETFs|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 2,
        "NAME": "AAVE",
        "CATEGORY": "AAVE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 73,
        "NAME": "BITTENSOR",
        "CATEGORY": "BITTENSOR"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56642731,
    "published": 1767182448000,
    "title": "XRP Sees 80% Spike In Major Metric, Why This Matters For Price Appreciation",
    "body": "XRP has recorded a notable surge in one of its most closely watched derivative indicators, which brings attention to how traders are positioning around the asset. Data shows that open interest tied to XRP derivatives jumped by about 80% within a very short four-hour window in the recent trading day, pointing to a sudden influx of leveraged activity. Moves of this magnitude rarely happen in isolation and often point to growing tension beneath the surface of price action, especially when they occur without a clean breakout on the chart. A Four-Hour Reversal After Days Of Weak Participation The spike in open interest shows a rapid increase in the number of outstanding XRP futures and perpetual contracts. When open interest rises this quickly, it usually means traders are aggressively opening new positions, often using leverage. Related Reading: XRP Stochastic RSI Just Touched 0.0 For The Second Time In History The speed of the move is what separates this spike from routine fluctuations. Prior to the surge, XRP open interest had been trending lower, showing reduced trader engagement and a cooling derivatives environment. However, this change was quickly reversed when open interest increased by over 80% in just a four-hour timeframe, culminating in the total number of outstanding contracts standing around 1.74 billion XRP at the time of writing. In terms of price, this translates to about $3.26 billion in exposure being held open across XRP futures markets, according to data from CoinGlass. Why This Setup Matters For XRP Price Appreciation XRP’s price action has been slow in recent days, with the cryptocurrency currently trading at $1.87. Price action has started to respond positively in the short term, though only modestly so far. XRP is up about 0.3% over the past 24 hours, a move that looks small on the surface. Related Reading: Can XRP Price Reach $10,000? Expert Says It’s Different Math, Different League However, when open interest expands this quickly and price begins to edge higher at the same time, it means that traders are leaning bullish and testing the upside, even if spot buyers have not yet committed in size. The lack of a strong breakout at this stage shows that the market is still probing for direction, but the balance has begun to tilt away from complete stagnation. The broader price action adds more context after zooming out slightly. XRP has gained roughly 0.8% over the past seven days, indicating a slow grind higher rather than a sudden impulse move. If price continues to inch higher and manages to clear nearby resistance levels, the elevated open interest could amplify upside moves as short sellers are forced to exit. On the other hand, if XRP’s price action stalls or falls back despite the recent 0.3% daily and 0.8% weekly gains, then the growing leverage on one side increases the risk of a bigger pullback. In that sense, even these small percentage gains matter. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Coinglass|Ripple|xrp|XRP Futures and Perpetual Contracts|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56642722,
    "published": 1767182400000,
    "title": "Bitcoin got stuck after slumping 30% from its peak. Here's why.",
    "body": "The October flash crash exposed how fragile bitcoin’s rally had become. It also illustrated a fundamental change in how BTC is perceived.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|market analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]