[
  {
    "id": 54295121,
    "published": 1762922797000,
    "title": "Bitwise Chainlink ETF appears on DTCC site, tipping pending launch",
    "body": "Bitwise’s spot Chainlink ETF has been placed on the DTCC’s registry, a signal that typically shows a product will launch in the near future.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54295473,
    "published": 1762923618000,
    "title": "Kraken boss hits out at UK crypto rules",
    "body": "Arjun Sethi says users are hindered by dire warnings and hurdles that slow down transactions",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54295382,
    "published": 1762922797000,
    "title": "Bitwise Chainlink ETF appears on DTCC site, tipping pending launch",
    "body": "Bitwise’s spot Chainlink ETF has appeared on the Depository Trust and Clearing Corporation’s registry, a sign that it could launch in the near future.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54295312,
    "published": 1762922797000,
    "title": "Bitwise Chainlink ETF appears on DTCC site, tipping pending launch",
    "body": "Bitwise’s spot Chainlink ETF has been placed on the Depository Trust and Clearing Corporation’s registry, a signal that typically shows a product will launch in the near future.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54296314,
    "published": 1762925279000,
    "title": "JPMorgan Rolls Out JPM Coin Leveraging Coinbase's Base: Report",
    "body": "Unlike stablecoins, deposit tokens are digital claims on existing bank funds and can be interest-bearing, offering a new option for institutional investors.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|JPMorgan|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54296007,
    "published": 1762924844000,
    "title": "XRP Faces Bearish Cross Risk, Sinks 5% Even as ETFs Move Further",
    "body": "The token's ability to defend the $2.39–$2.41 range will determine if it rebounds or faces further declines.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54297145,
    "published": 1762927229000,
    "title": "China’s Cybersecurity Agency Alleges US Government Stole $13 Billion In Bitcoin",
    "body": "According to a recent report by Bloomberg, the cybersecurity arm of China has openly accused the US government of orchestrating the theft of approximately $13 billion in Bitcoin (BTC), adding tension to the ongoing cyber relations between the two nations. China Alleges State-Level Operation The incident in question revolves around the theft of 127,272 BTC from the LuBian Bitcoin mining pool in December 2020, constituting one of the most substantial crypto heists in history. Related Reading: Bitcoin To Bottom Out In 300 Days: Top Expert Forecasts $38,000 To $50,000 Price Point The Chinese National Computer Virus Emergency Response Center suggests that this large-scale hack was likely a planned “state-level hacker operation” orchestrated by the US. The agency points to the discreet and delayed movement of the stolen Bitcoin as indicative of governmental involvement rather than typical criminal behavior. The report further links the Bitcoin from LuBian, a former Bitcoin mining firm, to tokens seized by the US government, which authorities claim are linked to Chen Zhi, the chairman of the Cambodian conglomerate Prince Group. Chen Zhi had been accused by the US of participating in a wire-fraud conspiracy and running a money-laundering scheme in October. Notably, details on when and how the Bitcoin was confiscated by the US remain undisclosed. The narrative put forth in the report suggests that the US government might have employed hacking tactics as early as 2020 to appropriate the 127,000 Bitcoin associated with Chen Zhi, characterizing the operation as an example of a “black eats black” maneuver orchestrated by a state-level hacking entity. Bitcoin Forfeiture Fallout Federal prosecutors involved in the Chen case have refrained from disclosing the methods used to gain control of the Bitcoin, following the Department of Justice’s civil forfeiture complaint seizing the 127,271 BTC, which stands as the most substantial forfeiture action undertaken by the US government. Recent statements from the Chinese government have highlighted a growing trend of accusing the American government of engaging in hacking activities. Related Reading: Crypto Treasuries Shift Focus From Bitcoin And Ether To These Lesser-Known Altcoins Earlier this year, China asserted that the US exploited vulnerabilities in Microsoft Exchange servers to target Chinese companies. Just last month, China alleged that it possessed undeniable evidence of a US cyber attack on the National Time Service Center. In response to the allegations, a lawyer representing Chen Zhi has filed a request for additional time in a US court to allow for tracing of the stolen BTC from LuBian. The attorney, Matthew L. Schwartz has criticized the government’s claims against Chen as being “seriously misguided.” Schwartz, who serves as counsel to Mr. Chen and the Prince Group, stated that they are collaborating with cryptocurrency experts to trace the Bitcoin seized over a year ago and stolen back in 2020. T At the time of writing, BTC was trading at $102,550, recording losses of 3% in the 24-hour time frame. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|Bitcoin Seizure|BTCUSDT|crypto|crypto news|cryptocurrency",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54296885,
    "published": 1762923610000,
    "title": "XRP ETF Canary Takes Flight: 8-A Filing Clears Path To Nasdaq Listing",
    "body": "Canary Capital filed formal paperwork on Monday that could let an XRP-backed ETF start trading on Nasdaq within days. According to the filing, Canary submitted a Form 8-A to the US Securities and Exchange Commission on November 10, 2025, a move that registers the fund’s shares under the Exchange Act and begins a regulatory clock that can lead to a listing if no objections are raised. Related Reading: Could Shiba Inu Triple? Analyst Sees 200% Move Coming Nasdaq Listing Moves Into Final Steps Based on reports, the shares are expected to trade under the ticker XRPC once Nasdaq completes its listing approval and the regulatory waiting period runs its course. The S-1 prospectus filed earlier says the trust’s shares are expected to be listed for trading subject to notice of issuance on the Nasdaq Stock Market. Market players say a key legal mechanism is now in motion. Canary removed a delaying amendment from its S-1, which triggers a 20-day countdown to automatic effectiveness unless the SEC acts. That change has led some issuers to target a November 13 listing date, though final sign-off by Nasdaq and any SEC comments could shift that plan. CEO Steven McClurg at Canary Capital on XRPETF.. #XRP pic.twitter.com/2UnDKdvc4R — RIZ.. 🇺🇸 🇵🇷 (@RizXRP) November 10, 2025 Canary Capital CEO Steven McClurg said the XRP ETF could potentially double the gains Solana saw in its first week. He pointed to strong interest in XRP, reflected in its market capitalization and trading activity. Fund Details And Fees Reports have disclosed some of the fund’s basic terms. The Canary product lists a management fee of 0.50% and names custodians that are already familiar in crypto ETF work, including Gemini Trust Company and BitGo Trust Company. The trust also names US Bank as the cash custodian and US Bancorp Fund Services in an administrative role, according to market write-ups. The background numbers help frame the potential scale. According to earlier SEC filings, as of October 8, 2025, the aggregate market value of XRP was about $173 billion, which placed XRP among the top five digital assets by market cap at that date. That size is one reason multiple issuers have pushed to bring XRP into ETF wrappers. At the time of writing, XRP’s market cap stood at a little over $146 billion. Related Reading: XRP Has Held Its Ground As Most Altcoins Fall, Market Observers Say Market Reaction And What To Watch Price action already reacted. Reports show XRP moved sharply higher around news of the filings, with some outlets noting intraday gains as large as 8% on the rumor and filing flow. Traders will look for actual listing notices and early volume numbers once trading starts. However, when this report was made, the altcoin has shed 3.5% in the last 24 hours. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|altcoins|Canary Capital|etf|Ripple|sec|xrp|XRP ETF",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54297277,
    "published": 1762927386000,
    "title": "UAE’s ‘digital dirham’ CBDC pilot completes first transaction",
    "body": "The United Arab Emirates' central bank digital currency pilot has made its first transaction, reportedly completed in under two minutes.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 54299100,
    "published": 1762929508000,
    "title": "First U.S. Spot XRP ETF Could Go Live on Thursday",
    "body": "A successful ETF launch could expand XRP’s liquidity base and potentially trigger inflows from registered investment advisers who may have avoided direct crypto exposure beyond bitcoin.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Ripple|ETF|XRP|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54299684,
    "published": 1762932605000,
    "title": "Bitcoin Dominance Has Broken Below 50 EMA, What Happens If It Falls Below 40%?",
    "body": "The Bitcoin dominance has remained quite high over the last year, holding firmly above 50% and preventing altcoins from making any meaningful recovery. Even now, the dominance has climbed close to 60%, showing that Bitcoin is still determining the direction of the entire market. However, there has been a development that could change the trajectory of the Bitcoin dominance and put altcoins in the spotlight once again, highlighted by crypto analyst Unichartz. Bitcoin Dominance Breaks Below 50 EMA Since 2023, the Bitcoin dominance has remained firmly above the 50-Day Exponential Moving Average (EMA), showing immense strength around this level. Even through market crashes, the digital asset has maintained its dominance, and with each passing year, the trendline has continued to rise. As long as the Bitcoin dominance stayed above the 50 EMA, it showed it would continue to dominate, but this is changing now. Related Reading: Shiba Inu Derivatives Market Is Taking Off Again, But What Does This Mean For Price? According to the post by Unichartz, it shows that the Bitcoin dominance has now crashed below the 50-Day EMA for the first time in almost one year. This comes as the dominance lost its footing above 60% and has failed to reclaim its position above it. Naturally, there has been an attempt to reclaim the 50-Day EMA once again. However, this attempt failed after the brief surge above 63% in early October was thwarted by the market-wide crash on October 10. Since then, the dominance has remained below the 50 EMA and has now spent a full consecutive month below this critical level. What This Means For The Crypto Market Historically, the altcoin season has only begun when the Bitcoin dominance has seen a decline. This trend has held strong through the years, and even through the current cycle, has prevented the rise of another altcoin season. Related Reading: Dogecoin Does Not Have Potential For A Strong Move Upward, Analyst Says However, with the crash below the 50 EMA, the analyst predicts that the Bitcoin dominance is about to see a massive crash. It shows that the dominance will fall below 40% if it fails to reclaim the 50 EMA soon. Such a crash would give room for altcoins to actually run as the focus moves away from Bitcoin. With the Altcoin Season Index sitting at a low 31 at the time of this writing, it shows that a crash in the Bitcoin dominance is sorely needed for altcoins to rise again. However, the analyst explains that if the dominance does reclaim the 50 EMA, then Bitcoin’s lead may be extended for longer before attention rotates back to altcoin. Featured image from Dall.E, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|altcoin|altcoin news|Altcoin Season|altcoins|Altcoins news|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 44,
        "NAME": "SHIB",
        "CATEGORY": "SHIB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54300328,
    "published": 1762933666000,
    "title": "Morgan Stanley says it’s harvest time as Bitcoin enters ‘fall’ season",
    "body": "Morgan Stanley’s Denny Galindo likens Bitcoin’s cycle to the seasons, warning that the market’s “fall” phase is a time to secure gains before a downturn.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54302207,
    "published": 1762938032000,
    "title": "Ethereum Ready To Explode To $12,000 By January, Says Tom Lee",
    "body": "Funstrat co-founder Tom Lee says Ethereum could be the crypto market’s near-term leader, targeting a move to $12,000 by January on the back of Wall Street’s tokenization push and rising growth expectations for smart-contract platforms. In an interview released Nov. 10 with Tom Nash, Lee emphasized that while Bitcoin remains under-owned, “there’s a bigger move in Ethereum” over the next several weeks as capital reallocates toward the rails that power stablecoins and tokenized assets. Why Ethereum Is Poised To Rally Soon Lee anchored his call to a blend of technical and fundamental drivers. Citing Funstrat’s head of technical strategy, he noted: “Mark Newton thinks we can be like $9,000 to $12,000 by January. I think that’s about right. I think Ethereum […] more than doubles between now and year end or between now and January.” In parallel, he said Bitcoin could reach the “high $100,000s, maybe even $200,000 by the end of the year,” while reiterating that Ethereum likely has the bigger near-term upside. Related Reading: Ethereum Trading Volume On Binance Surpasses $6 Trillion: A Speculative Frenzy Unfolds The crux of the Ethereum thesis, as Lee laid it out, is that the demand side of crypto is shifting toward applications that depend on smart contracts—precisely the domain where Ethereum is most entrenched. “Even Cathie Wood wrote about it. She thinks stablecoins have been cannibalizing demand for Bitcoin and gold and tokenized gold is cannibalizing demand for Bitcoin. But stablecoins and tokenized gold run on smart contract blockchains like Ethereum,” he said. He added that “Wall Street is building and Larry Fink wants to tokenize everything on the […] blockchain. That means Ethereum is where people are starting to raise their growth expectations.” Lee argued that this change in growth expectations matters as much as, if not more than, headline monetary policy over short windows. While acknowledging that the Federal Reserve remains a critical backdrop, he framed potential December easing as a catalyst for risk assets broadly—financials, small caps, and tech—and, by correlation, crypto. “If they cut in December, they’re confirming they’re on an easing cycle,” he said, calling that “really bullish” for equities most tightly linked to growth and liquidity. In Lee’s framework, those same flows support crypto assets—and Ethereum in particular—into year-end positioning. The fund manager also located the crypto setup within a larger “super-cycle” he’s been mapping for years. He contends that markets are still in the early innings of an AI-driven capex boom and a demographic regime that keeps demand for productive technology elevated. That backdrop, he said, has repeatedly wrong-footed bears who anchored on yield-curve inversions and 1970s inflation analogs. Related Reading: Ethereum Approaches Critical Resistance — Bullish Breakout Or Trap In The Making? “People have a hard time understanding and grasping super cycles […] we look for story arcs that last 10 to 15 years,” he said, arguing the last three years showcased “mass misconceptions” about recession and persistent inflation that never reconciled with reported earnings. The Macro Backdrop Pressed on risks to the call, Lee downplayed the idea that inflation is about to re-accelerate and argued that oil would need to approach levels near $200 to deliver a true growth shock to US households. “The most overrated risk is that inflation’s coming back,” he said, pointing to cooling housing and labor metrics and stating that recent claims about re-heating core services inflation were “dead wrong” when checked against the PCE series. On policy path-dependence, he suggested that even a December hold by Chair Powell would likely accelerate political pressure for a leadership change, muting the medium-term impact on risk assets. Timing-wise, Lee sees positioning as the near-term accelerant. He argued that institutions remain behind their benchmarks after repeatedly fading rallies through 2023–2025 and that the final weeks of the year often force a chase into outperforming segments. “There is incredible demand for equities because people are really off-sides […] 80% are trailing their benchmark this year […] they’re going to be buying stocks,” he said, adding that the AI trade “is going to come back strong” and that crypto tends to correlate with that move. For Ethereum specifically, Lee’s case reduces to a simple through-line: the pipes getting built are where the next leg of growth accrues. Stablecoins, tokenized gold, and Wall Street’s broader tokenization agenda are traffic that runs on programmable blockchains; the market, in his view, is only beginning to price that through. “If you’re raising your growth expectations, then your discount to the future is going up,” Lee said, explaining why he believes ETH can “have a huge move into year end” and reach the $9,000–$12,000 range by January. At press time, ETH traded at $3,447. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ETH news|eth price|Ether|ethereum|ethereum news|ethereum price|Tom Lee",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54302014,
    "published": 1762937645000,
    "title": "Bernstein Says U.S. Crypto Framework Positions Nation as Global Leader",
    "body": "With new laws defining market structure and stablecoin oversight, the broker said America’s digital asset industry has entered its most mature phase yet.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Cryptocurrency Regulations|Stablecoins|Bernstein|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54303150,
    "published": 1762939911000,
    "title": "Ethereum Price Prediction Sees $4,000 Next. PepeNode Readies for Rally",
    "body": "What to Know: ETH faces firm resistance at $4,000–$4,100 and could retest the $3,272 support before attempting a breakout toward $4,000. Whales started amassing $ETH in bulk, with one whale in particular reaching $1.38B in $ETH after a recent $213M purchase. PEPENODE ($PEPENODE) builds a gamified mine-to-earn loop on Ethereum, aiming to turn presale interest into ongoing activity and token burns. The $PEPENODE presale is now above $2.1M, with a token price of $0.0011454, and rewards early participants with better-performing mining nodes. Ethereum is chopping just below the levels that matter. After repeated knockbacks near $3,700, liquidity still stacks between $4,000 and $4,100, while the bears keep a toehold. Analyst Ted believes that the $4.1K price point is reachable if $ETH maintains momentum above $3.7K. The right conditions seem to be there. Whales and institutions have quietly stepped in, with one whale address scooping $269,460,000-worth of $ETH , while another increased its Ethereum supply to $1.38B, following a $213M purchase . That kind of absorption often caps downside tails and sets the stage for mean-reversion rallies into stacked offers. If $ETH can reclaim $3,700 with conviction, the path toward $4,000 reopens quickly. For context, spot prices hover in the mid-$3Ks with volatility picking up. CoinMarketCap’s live board shows $ETH around the mid-$3,400s today, reminding you the market’s still rangebound and headline-sensitive. Inside that range, the bid keeps showing up at $3,400–$3,300, but $4,000 remains the battleground with thicker resting liquidity. So what do you do if the price chops for a bit longer? This is where risk rotation gets interesting. Periods of $ETH consolidation historically funnel flows toward narratives with clear catalysts. That’s why more eyes drift to early-stage plays aligned with Ethereum’s culture and rails. Enter PEPENODE ($PEPENODE) , a ‘mine-to-earn’ meme token building a gamified virtual mining loop on Ethereum. When majors stall but on-chain participation holds, projects that blend gameplay, staking and token burns can soak up attention (and capital) until the next $ETH leg. PEPENODE ($PEPENODE): Mine-to-Earn Utility on Ethereum That Rewards Activity PEPENODE ($PEPENODE) positions itself as the meme coin that actually gives you something to do while you wait for the next breakout. Its whitepaper describes a virtual server-room where you buy and slot ‘Miner Nodes’ and facility upgrades, then optimize a simulated hashrate to generate rewards. It’s all on Ethereum, with smart contracts tracking staking and game logic once TGE lands. The concept is simple: create your mining facility, put it to work, and upgrade your nodes whenever necessary. No spicy electricity bills, no massive investments in high-end mining equipment; PEPENODE takes care of that. PEPENODE’s docs outline burn mechanics tied to node purchases and upgrades, alongside staking that switches on during presale and flows into game rewards later. That’s a classic flywheel pitch: more play → more upgrades → more burns → tighter float, assuming adoption sticks. The project incentivizes early adoption, because early nodes deliver higher rewards. Get your ticket into PEPENODE’s ($PEPENODE) mining ecosystem today. PEPENODE, Next Crypto to Explode? The presale is over $2.1M right now with a current token price of $0.0011454, per the project’s live materials. The stage-based pricing means $PEPENODE is guaranteed to increase in value during the presale phase and, if utility checks, post-launch as well. A realistic price prediction for $PEPENODE has the token at $0.0077 by the end of 2026, although massive hype-driven adoption could push it even higher. We’re talking about a 572% ROI if you invest at today’s price. Such a performance would help PEPENODE rank among the best presales of 2025. And possibly one of the next crypto to explode . Where could this go in the broader 2025 setup? The 4-Phase roadmap details several milestones for 2026 and beyond, including launching the Virtual Mining Simulator and introducing the meme coin rewards. For traders watching risk rotations while $ETH wrestles with $3.7K and $4K, the pitch is straightforward: pick spots where the on-chain loop doesn’t grind to a halt just because $BTC and $ETH go sideways. PEPENODE’s ($PEPENODE) mine-to-earn model tries to do exactly that—keeping attention, activity, and token velocity humming until majors decide the next leg. Our guide on how to buy $PEPENODE gives you all the information you need to secure your tokens fast and easy. Go to the presale page and buy your $PEPENODE stack today. This article isn’t financial advice. DYOR before investing. Authored by Aaron Walker, NewsBTC: https://www.newsbtc.com/news/ethereum-price-prediction-4000-pepenode-to-rally",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54303961,
    "published": 1762941652000,
    "title": "XRP’s Next ‘Face-Melting’ Rally Could Hit Within 6 Weeks—Analyst",
    "body": "Some analysts expect XRP to climb sharply from its current price of $2.39. According to posts on X by a popular analyst known as Egrag Crypto, the coin is trading at the bottom of a descending triangle and could stage a strong rally in the coming weeks. Related Reading: Could Shiba Inu Triple? Analyst Sees 200% Move Coming Analysts Point To Historical Setups According to Egrag, two earlier runs give the pattern some weight. He compared the present chart to moves in 2017 and 2021. Back then, XRP went from $0.097 to $3.84 across a roughly three-month span around 2017–2018. In 2021, it rose from below $0.45 to above $1.90 in two monthly candles. Based on those moves, he expects a comeback within four to six weeks and projects gains of about 300% to 1,400% from today’s price. #XRP – ⚔️ Weakness? Or Just Testing the Faith of Bulls? 💎 Lately, I’ve seen many #XRP Bulls turning #Bearish 😔, frustrated by the sideways chop and the boring price action. They say things like “I see weakness on the HTF.” Let me tell you what I see 👁️‍🗨️: I see traders… pic.twitter.com/5WTibse9r7 — EGRAG CRYPTO (@egragcrypto) November 11, 2025 “Mark my words: XRP will usually melt faces within 4–6 weeks, and history backs it up with evidence,” Egrag, who put a target range of $10 to $37 for this cycle, said. “I see traders chickening out, scared to lose their 10x gains. And that’s fine , protecting profits is smart,” he added. Other market voices have echoed parts of that view, reposting Egrag’s chart and wrote that XRP is “busy testing bulls’ faith.” ETF Filing Moves Forward Meanwhile, according to filings and reporting, Canary Capital has taken a key step toward launching a spot XRP ETF in the US. The firm filed a Form 8-A, a move that, once Nasdaq signs off, would let the fund list its shares. Crypto reporter Eleanor Terrett said the filing will become effective at 5:30 p.m. ET once Nasdaq certifies it, and trading is set to start when US markets open on Thursday, November 14, 2025. That development matters because an ETF can make an asset easier for many investors to buy. It does not mean prices will automatically skyrocket. It does mean more attention, and that can change market behavior in ways that are hard to predict. 🚨NEW: @CanaryFunds has filed its Form 8-A. This is the final step before it goes effective at 5:30 PM ET Wednesday once the Nasdaq certifies the listing. When that happens, the last hurdle is cleared and the first $XRP spot ETF will be set to launch Thursday at market open. pic.twitter.com/mXvkrrXbiJ — Eleanor Terrett (@EleanorTerrett) November 11, 2025 Short-Term Data And Market Tone At press time, XRP was trading around $2.39, down about 3% over the last 24 hours. Technical traders focus on where the price sits inside the triangle pattern and watch volume for confirmation of a breakout. Related Reading: XRP ETF Canary Takes Flight: 8-A Filing Clears Path To Nasdaq Listing Some see the structure as a setup for a large move either way. Others point out that the market environment today is not the same as in 2017 or 2021, given bigger trading volumes and different regulatory factors. The ETF timing adds a new element to watch. If Nasdaq approves Canary Capital’s Form 8-A as reported, the first spot XRP shares could start trading on Thursday. Markets often react to such milestones, but how big that reaction will be is unknown. Featured image from Gemini, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|bitcoin|Canary ETF|crypto|etf|NASDAQ|xrp",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54303876,
    "published": 1762941307000,
    "title": "Bitcoin ETFs roar back with $524M inflows in best day since market crash",
    "body": "Smart money traders have also added $8.5 million worth of net long Bitcoin positions, signaling growing optimism among the industry’s most successful traders.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54304833,
    "published": 1762943293000,
    "title": "Kraken Co-CEO Says UK Crypto Promotion Rules May Harm Retail Investors: FT",
    "body": "Arjun Sethi said questionnaires and warnings about potential financial loss slow down transaction times while asset prices are moving.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Kraken|UK|FCA|Regulation|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54305226,
    "published": 1762944256000,
    "title": "Russian Crypto Scammer and Wife Found Dead in UAE After Apparent Revenge Attack",
    "body": "Roman Novak was convicted for a multimillion dollar scam in 2020, and had reportedly defrauded further victims since leaving prison in 2023.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54305706,
    "published": 1762945217000,
    "title": "Bitcoin Path To $1 Million Clears With OG Sellers Fading: Dave Weisberger",
    "body": "Former chairman and co-founder of CoinRoutes and now president of BetterTrade.digital Dave Weisberger used a November 11 video to restate Bitcoin’s long-term bull case, arguing that the market’s “morose” sentiment and technician-driven calls for downside are missing the structural shift underway on both fundamentals and market microstructure. He framed his analysis in two parts—why Bitcoin is being bought and what the current market structure implies—contending that the thesis toward seven-figure pricing remains intact even without an obvious near-term catalyst. The Path To $1 Million Per Bitcoin On fundamentals, he drew a direct comparison with gold’s monetary role and size. Citing an above-ground market value of “around $28 trillion” and “about $7 trillion in known reserves below ground,” Weisberger argued that roughly 80% of gold’s value is monetary, not industrial, using the platinum–gold price relationship as a proxy. “Gold today trades at about two and a half times platinum, which for most of my life was about double the price of gold,” he said, adding that platinum is “30 times rarer and more valued by women in jewelry.” From that relative-value lens, he estimated gold’s “monetary value fully diluted around $28 trillion,” contrasting it with Bitcoin’s “fully diluted market cap just over $2 trillion at today’s prices.” Related Reading: China’s Cybersecurity Agency Alleges US Government Stole $13 Billion In Bitcoin If Bitcoin equals or surpasses gold on monetary characteristics, he argued, the gap implies transformative upside: “It could rise to equal gold. Except it’s better than gold on monetary characteristics.” He emphasized Bitcoin’s native digital finality, resistance to counterfeiting, divisibility, transparency, and programmatic supply schedule—benefits that also avoid gold’s custody, assay, and transport frictions. Even in a scenario where fiat “holds its value,” he suggested, network adoption alone could warrant a multi-fold repricing; in a debasement regime, he said, the asymmetry is stronger: “As the Bitcoin network grows and it gains acceptance it’ll likely rise by 10 times this or more.” Via X, he added “the Fundamental case” is $1 million in today’s dollars. Weisberger revisited the “fastest horse” framing popularized in the early COVID-era liquidity surge. He pointed to Paul Tudor Jones’s thesis in “May of 2020,” acknowledging he misspoke initially, and reminded viewers that the price then “did nothing” for months before a stepwise acceleration from October through the subsequent euphoric leg higher. The lesson, in his view, is that market tone can lag fundamentals until positioning resets and liquidity leadership rotates back to Bitcoin. “History doesn’t always repeat, but it can sometimes rhyme,” he said. On market structure, Weisberger took aim at the four-year halving cycle as a predictive template. Historically, he said, cyclical behavior followed a pattern—halving, a six-month period of miner-incentive doubt, then a relief-to-euphoria rally that later bled into altcoin rotation before a broad drawdown. He argued that dynamic is losing relevance because supply changes are now “irrelevant relative to the amount of demand that’s going on,” while network security trends tell a different story: “If you look at the Bitcoin hash rate chart, it’s increasing at a geometric pace.” The moving parts he sees actually driving prices are the interaction of legacy supply and institutional demand. “It’s basically the OG sellers who are selling over 100,000 [BTC] and the new buyers, whether they’re in ETFs or in MicroStrategy, etc.” Those early holders, in his telling, are rationally diversifying life-changing gains rather than capitulating, which implies a finite overhang: “Entrepreneurs don’t generally sell everything […] they sell some at a level to get where they need to be and then […] sell at later prices.” He underscored that spot ETF investors appear patient despite recent volatility. “Even after all of the carnage of the last few weeks since October 10th, less than 2% of the Bitcoin ETFs have outflown,” he said, characterizing that cohort as long-horizon allocators “looking for a 10x gain,” not trading around single-digit drawdowns. He contrasted October’s deleveraging—“$20 billion was liquidated […] but only five billion of the liquidation was in Bitcoin”—with the 2022 insolvency cascade: “This cycle doesn’t have a Celsius […] doesn’t have an FTX. The impact of the liquidations is not going to be to cause an insolvency event which causes forced sales.” Without a credit-driven unwind, he argued, technical analogies to 2022 are misplaced: “If there’s no forced sales, why do we expect a sale on the magnitude that happened in 2022 […]? They’re trying to impute something without taking into account the actual circumstance.” Related Reading: Most Reliable Bitcoin Boom Indicator Just Went Off-Script: Expert Price leadership, in his view, will return through “liquidity and slow grinding growth” while “hot money” recovers from leverage-driven losses. He expects the OG selling to “abate,” as partial profit-taking runs its course, setting the stage for the next euphoric leg once a catalyst emerges. Weisberger did not pretend to know which spark will ignite it—“I’m not a Nostradamus”—but listed plausible vectors that are consistent with prior cycles: “The catalyst could be sovereign accumulation. The catalyst could be Bitcoin being used as collateral […] It doesn’t really matter what the catalyst is.” The key risk for would-be sellers, he suggested, is time out of the market during the inflection: “Unless you are very nimble, very quick, have no tax consequences, and aren’t out of the market or on vacation in the two or three days when euphoria first starts, then I would be very, very reticent to sell here.” My 2 part Bitcoin analysis: 1) The Fundamental case for $1 Million Bitcoin in TODAYS dollar 2) Why the current gloom is unwarranted & now is a great time to accumulate Bitcoin for the long haul The Bull Case For Bitcoin 11 11 https://t.co/0ACKrn3bgQ via @YouTube — Dave W (@daveweisberger1) November 12, 2025 He closed with a caution that acknowledges the market’s capacity to frustrate both bulls and bears. “Maybe euphoria will happen after it continues to drag on and fall for another few months, but at some point it will happen,” he said. He disclosed his positioning—“I have not sold any sats, nor do I intend to”—and reiterated the discipline required in a choppy tape: “Stay safe out there. This market does look interesting and is going to likely stay that way for a while.” At press time, BTC traded at $104,954. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|Dave Weisberger",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54305787,
    "published": 1762945380000,
    "title": "Ethereum Whales on Buying Spree As Crypto Market Pulls Back",
    "body": "Ethereum whales have accumulated over $350 million in ETH during the recent dip, amid uncertain macro conditions.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54306760,
    "published": 1762947468000,
    "title": "JPMorgan Brings Dollar Deposit Token to Coinbase's Base Network: Report",
    "body": "The bank intends to deploy the deposit token across additional blockchains beyond Base, with plans for multi-currency expansion.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54307013,
    "published": 1762947200000,
    "title": "Japan stablecoin issuers could fill central bank’s bond-buying gap: Report",
    "body": "Japan’s first yen stablecoin issuer, JPYC, said growing demand could make stablecoin reserves a new force in the country’s bond market.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 54306659,
    "published": 1762947200000,
    "title": "Japan stablecoin issuers could fill central bank’s bond-buying gap: Report",
    "body": "Japan’s first yen stablecoin issuer JPYC says growing demand could make stablecoin reserves a new force in the country’s bond market.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      }
    ]
  },
  {
    "id": 54307320,
    "published": 1762948548000,
    "title": "Kraken co-CEO warns UK rules meant to protect users now punish them: FT",
    "body": "Arjun Sethi criticized the UK’s crypto regulations for burdening users with excessive disclaimers, saying they worsen customer experience.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54307426,
    "published": 1762948862000,
    "title": "Zcash Treasury Company Launches With Winklevoss Backing",
    "body": "Biotech firm Leap Therapeutics has rebranded as Cypherpunk Technologies Inc. and pivoted to a digital asset treasury strategy.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "zcash|Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54308188,
    "published": 1762950625000,
    "title": "Dogecoin Price Rally Above $0.74 ATHs In The Works As HTF Trend Holds",
    "body": "Crypto analyst Balo has assured that the Dogecoin price rally to a new all-time high (ATH) above $0.74 is in the works. He explained why this rally may be closer than some may imagine despite the recent bearish price action. Dogecoin Price Eyes Rally Above $0.74 ATH In an X post, crypto analyst Balo shared an accompanying chart showing that the Dogecoin price could surpass its current all-time high of $0.74, reaching $0.8 in the process. This came as the analyst opined that a major run was imminent for the foremost meme coin, despite its current downtrend. Related Reading: Analyst Shares Worst-Case Scenario For Dogecoin This Cycle Balo explained that at each local bottom since early 2024, there has always been a “messy” Dogecoin price action that looks designed to shake people out before the real jump. He added that DOGE has made higher lows and maintained the higher-timeframe (HTF) trend, and that the same price pattern appears to be repeating now. The crypto analyst also admitted that the parabolic surge for the Dogecoin price may feel far away, but that each mini cycle brings DOGE closer to its bull run. He also stated that this gives investors more time to accumulate before the DOGE price rallies to a new all-time high, which he claimed is just a matter of time. This bullish prediction for the Dogecoin price comes amid its current downtrend, with the meme coin struggling below the psychological $0.2 level. DOGE has continued to mirror Bitcoin’s price action, and with the flagship crypto threatening to drop below $100,000 again, crypto analyst Dogecoin OG predicts that the meme coin could fall to the $0.16 range. Analyst Predicts Mega Run For DOGE Crypto analyst Crypto Patel has also provided a bullish outlook for the Dogecoin price, declaring that the meme coin was ready for its next historic mega run. The analyst stated that the breakout and retest are complete and that the structure is locked and loaded for a parabolic explosion. Related Reading: Dogecoin Price Set For 1,200% Rally To $2.2 In This 3rd Run Furthermore, Crypto Patel revealed that the same pattern that sent the Dogecoin price flying during the 2017 and 2021 bull cycles is repeating again on the monthly timeframe. He added that the move looks even more powerful this time around. As such, he expects DOGE to rally 10x to 33x based on the fractal confluence and macro breakout structure. Patel stated that targets 1 and 2 are $2 and $5, respectively, both of which mark new ATHs for the meme coin. His accompanying chart showed that the Dogecoin price could reach these targets sometime next year. At the time of writing, the Dogecoin price is trading at around $0.17, down over 4% in the last 24 hours, according to data from CoinMarketCap. Featured image from Peakpx, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Dogecoin|Balo|CoinMarketCap|Crypto Patel|doge|DOGE news|Doge price|Dogecoin news|dogecoin price|dogeusd|dogeusdt|Higher-Timeframe|HTF|meme coin",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54308234,
    "published": 1762950600000,
    "title": "Altcoins aren’t dead; long live altcoins",
    "body": "Bitcoin won’t win as a monetary asset while tokens power adoption through incentive layers. Zero-knowledge transport layer security unlocks verifiable data portability.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54307993,
    "published": 1762950139000,
    "title": "Sonic Labs pivots from speed to survival with business-first strategy",
    "body": "Sonic Labs’ strategic shift aims to bring “measurable, lasting value” for builders, validators and S token holders through upgraded fees, token burns and institutional partnerships.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54307975,
    "published": 1762948800000,
    "title": "Franklin Templeton Brings Its Benji Token to Canton Blockchain",
    "body": "Franklin Templeton has plugged its blockchain infrastructure into the bank-backed Canton Network in a bid to broaden the use of its tokenized funds by institutional investors.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 54309114,
    "published": 1762952489000,
    "title": "Bitcoin price hits $105K as analysis eyes ‘massive’ Binance BTC withdrawals",
    "body": "Bitcoin maintained its November pattern of higher lows as it rebounded to $105,000, but traders remained cautious of a potential rejection at key resistance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54308777,
    "published": 1762951713000,
    "title": "B. Riley Flags Recovery Signs in Digital Asset Treasuries as BitMine Extends Ether Lead",
    "body": "After weeks of weakness, the bank flagged a potential rebound in digital asset treasury companies as macro risks cooled and short sellers retreated.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Digital Asset Treasury|Bitmine|Ether|B. Riley|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54307065,
    "published": 1762946857000,
    "title": "Circle Falls Amid Concern Lower Interest Rates Will Slow Profit",
    "body": "Shares of Circle Internet Group Inc. fell as much as 5.8% in early trading amid concern declining interest rates will weigh on returns going forward helped to offset higher-than-estimated revenue and earnings in the third quarter.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NYS:CRCL",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54309182,
    "published": 1762944696000,
    "title": "What Uniswap’s Latest Proposal Really Means for UNI Token Buyers",
    "body": "The fee switch implies a 2.5% annual supply reduction, creating a quasi-buyback dynamic that directly links network activity with token scarcity.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Uniswap|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 53,
        "NAME": "UNI",
        "CATEGORY": "UNI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54309918,
    "published": 1762954262000,
    "title": "Morning Minute: SoFi Bank Launches Spot Crypto Trading",
    "body": "It's a major first for banks and fintechs as access to crypto trading becomes easier and easier.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|||Opinion",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54309660,
    "published": 1762953800000,
    "title": "3 Top Trending Crypto to Watch as Tether Records Big Profits",
    "body": "What to Know: Tether’s new commodities desk and expanding gold reserves show crypto’s largest stablecoin is morphing into a broader financial platform. Tether’s recent Q3 report showcases profits north of $10B and a balance sheet of over $181B. For traders seeking trending crypto, infra plus utility shines: Bitcoin Hyper ($HYPER), Best Wallet Token ($BEST), and Polkadot ($DOT) align with this shift. $DOT offers cross-chain optionality near multi-year value zones as flows broaden beyond ETH/SOL; watch ecosystem execution. Tether just signaled it’s not content being ‘only’ a stablecoin giant. In a headline-grabbing move, the company poached HSBC’s top precious-metals executives to build a commodities desk, an unmistakable push into the bullion trade. Vincent Domien and Mathew O’Neill, senior metals leaders at HSBC, are set to spearhead the new unit, according to a Bloomberg article . That’s the crypto world stepping directly onto TradFi’s most guarded turf. Why now? The firm’s latest attestation shows year-to-date profits above $10B , excess reserves of $6.8B, and double-digit billions in gold and bitcoin on the books—financial firepower that turns experiments into strategy. With a balance sheet of over $181B, liquidity ripples across crypto. For now, momentum is pointing sideways, but historically, fresh institutional rails have opened new speculative lanes. That’s why capital is hunting narratives with clear catalysts—the kind that could benefit Bitcoin scaling plays, utility tokens tied to wallets, and high-beta layer-zero ecosystems. With that as a context, here are three crypto to watch as this story unfolds. 1. Bitcoin Hyper ($HYPER) – Bitcoin Rollup Narrative With SVM Firepower If Tether is normalizing real-world collateral on-chain, the next crowd-pleaser is throughput: cheap, fast execution secured by Bitcoin. Bitcoin Hyper ($HYPER) pitches exactly that, an SVM-powered rollup aligned to $BTC settlement, aiming to make Bitcoin app-usable without impacting its security. The project’s documents and public dev notes emphasize native Solana-program compatibility, sequencing research, and a rollup-first security model, pragmatic signals for builders who want speed but won’t compromise finality. For traders watching risk rotations, a ‘Bitcoin L2 with Solana-grade performance’ is a potent narrative, while tools like the Canonical Bridge create powerful utility by dropping confirmation times from hours to seconds and reducing transaction costs significantly. The presale numbers back up the interest: over $26.9M raised so far, with a token price of $0.013255 and virtually unlimited potential. This alone makes $HYPER one of the best crypto to watch today. Based on Hyper’s value proposition, meme context, and impact on Bitcoin’s ecosystem, our price prediction for $HYPER proposes a price point of $0.08625 by the end of 2026. An easy 550% ROI if you invest at today’s price. If this sounds like profit, read our guide on how to buy $HYPER before doing anything else. Then head to the official presale page to secure your $HYPER allocation today. 2. Best Wallet Token ($BEST) – Utility Token for an Active Web3 Wallet Wallet tokens trend when retail flows return. Best Wallet Token ($BEST) leverages this approach with tangible in-app perks, including reduced swap fees, early access to curated presales, boosted staking tiers, and card rewards, thereby tying token ownership to ongoing wallet usage. The token supports the Best Wallet ecosystem, which offers top security, non-custodial services, and access to a variety of present and upcoming features. These include the Best Card and the Best Dex, with access to over 50 chains. For traders, the angle is simple: if Tether’s push accelerates tokenized-asset adoption, the next wave of users needs a wallet that lowers frictions and funnels opportunities. $BEST attempts to monetize that funnel. The presale raised over $16.9M so far, with $BEST valued at $0.025935. Based on the token’s utility and Best Wallet’s value proposition, our price prediction for $BEST puts it at $0.05106175 by the end of 2026. As an early investor, you’re looking at a 96% ROI over the course of 12 months. You can read our guide on how to buy $BEST to learn more about the purchasing process. Go to the presale page and buy your $BEST today. 3. Polkadot ($DOT) — Cross-Chain Upgrades at ‘Value’ Altcoin Levels Not every rotation needs seed-stage risk. At roughly $3 and a $5B-class market cap, Polkadot ($DOT) screens as ‘value beta’ among layer-0s, with a multi-year push to simplify parachain economics and improve bridging safety. Real-time dashboards put $DOT at $3.11 and market cap just over $5B, with mainstream investor outlets flagging similar levels. If tokenized real-world assets ramp, cross-chain messaging and sovereign app-chains re-enter the conversation—and $DOT’s architecture was built for that. For developers, the play is specialized chains with common security; for traders, it’s the optionality that comes with volumes broadening beyond Ethereum and Solana. Key catalysts to watch include enhancements to core messaging, scheduling of next-generation parachain auctions, and any progress from $DOT-based RWA pilots. Price-wise, $DOT doesn’t need mania to re-rate; it needs credible throughput demand across its ecosystem—something that tends to firm up when liquidity is allocated to new venues. If Tether’s metals desk deepens on-chain settlement for RWAs, a neutral routing layer like Polkadot starts to look mispriced relative to its optionality. If you want to invest, go to your favorite exchange and buy your $DOT today. Recap: Tether’s raid on HSBC’s bullion bench isn’t a stunt—it’s a signal that tokenized commodities are entering prime time. In that environment, infrastructure and utility stand to benefit. Bitcoin Hyper ($HYPER) aims to be the BTC-secured rollup where apps actually run; Best Wallet Token ($BEST) anchors wallet-level utility and user acquisition; Polkadot ($DOT) offers cross-chain plumbing at a ‘value’ multiple. This is not financial advice. Do your own research before investing. Authored by Aaron Walker, NewsBTC: https://www.newsbtc.com/news/tether-trending-crypto-bitcoin-hyper-best-wallet-polkadot",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 21,
        "NAME": "DOT",
        "CATEGORY": "DOT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54309600,
    "published": 1762953501000,
    "title": "Circle’s USDC Keeps Climbing; William Blair Reiterates Outperform After 3Q Results",
    "body": "The bank said USDC remains the frontrunner to dominate digital dollars as the company's third-quarter results topped forecasts.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Circle|Stablecoins|Quarterly Earnings|Analysts|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54309704,
    "published": 1762952489000,
    "title": "Bitcoin price hits $105K as analysis eyes ‘massive’ Binance BTC withdrawals",
    "body": "Bitcoin maintained its November pattern of higher lows as it rebounded to $105,000, but traders remained cautious about a potential rejection at key resistance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54310651,
    "published": 1762956000000,
    "title": "Franklin Templeton Expands Benji Technology Platform to Canton Network",
    "body": "The move links traditional finance infrastructure with blockchain rails as major institutions push deeper into tokenized markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Franklin Templeton|Blockchain|Tokenization|Real World Assets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      }
    ]
  },
  {
    "id": 54310362,
    "published": 1762955324000,
    "title": "Canary Capital’s $XRP ETF Is Imminent. $SUBBD Could Be Next In Line",
    "body": "What to Know: An $XRP spot ETF listing widens regulated access to altcoins, which usually tightens spreads and deepens liquidity across adjacent sectors. Canary’s 8-A form points to a Thursday debut; $XRP already saw a price pop and volume surge into the launch window. SUBBD introduces on-chain subscriptions, token-gated content, and AI assistants that turn creator-fan interactions into repeatable transactions. The presale sits at over $1.33M, with $SUBBD valued at $0.056925 and staking at a fixed 20%. Canary Capital’s spot XRP ETF has cleared the last major hurdle and is now teed up to begin trading on the Nasdaq as early as Thursday, with listing references pointing to the ticker ‘XRPC.’ $XRP reacted on cue, notching an intraday jump of up to 10% while 24-hour trading volumes swelled by roughly 40%, sending spot prices near $2.43. The timing isn’t random. In September, US exchanges won the ability to use generic listing standards for spot crypto ETFs, compressing timelines that used to drag on for months. That rule change opened the door for non-$BTC assets to follow, and the first wave has already shown how fast the playbook can run once the plumbing is in place. 💡 If $XRP joins $ETH and $SOL in the ETF club, altcoin liquidity broadens, spreads tighten, and flows begin migrating from pure crypto rails to brokerage accounts. That’s real market structure change, not just another narrative. And for $XRP, that’s payments and creator-facing commerce where fast settlement and low fees matter. This is where one of the season’s better-positioned presales, SUBBD Token ($SUBBD), is pitching utility instead of vibes: an AI-powered creator subscription stack with on-chain payments, content gating, and baked-in rewards. $XRP ETF Opens The Floodgates For Altcoin Liquidity A confirmed listing path for an $XRP spot product means passive money can finally ‘buy the basket’ of large-cap alts without dealing with self-custody. Canary’s trust moved forward after a Form 8-A filing – typically the final procedural check before trading – while market monitors flag a Thursday go-live window. That backdrop should play well for projects tied to real spend. 💡 SUBBD’s design is straightforward: creators sell subscriptions, fans unlock content and features, and $SUBBD settles the exchange while powering perks like discounts, XP multipliers, and early feature access. The team frames it as an AI-driven layer for the already-massive subscription content market. This includes native token incentives that reduce platform take rates and keep more earnings with the people actually making the content. If ETF flows are the macro tide, platforms that turn that liquidity into daily transactions are the shoreline. The SUBBD ecosystem is one of them. SUBBD Turns Creator Subscriptions Into On-Chain Utility On the product side, SUBBD ($SUBBD) ships the elements most creator platforms still duct-tape: payments, token-gated content, and AI assistants to handle requests, chat, and simple management chores. Holders pay less for subscriptions, stake to amplify XP and rewards, and gain access to exclusive drops and beta features. 🔄 For top creators, staking also unlocks VIP perks and collaboration opportunities. It’s a clean loop: pay, participate, earn, repeat – all recorded on-chain for better transparency. The $SUBBD whitepaper lays out an ecosystem where the $SUBBD token is the medium of exchange and the incentive rail, with staking and gamification stitched directly into the product rather than bolted on. Tokenomics mirror that utility focus. Allocations reserve a dedicated pool for staking rewards and liquidity, with the rest split across development, marketing, airdrops, and community incentives. Staking is live at a fixed 20% rate during presale, with a short cooldown after claiming. It’s the kind of predictable reward that helps creators and fans set expectations while the platform ramps. If you want a token built around actual usage – paid subscriptions and content access – this is the pitch, so get your $SUBBD today Presale Math And The Near-Term Upside The presale has raised $1.33M+, with a current token price of $0.056925 and staking rewards locked at 20% APY. 💰 $SUBBD’s potential is massive, though. Our price prediction for $SUBBD sees a possiblw 2026 high of around $0.668, which – if reached – implies roughly 11.6x gains from the current presale mark. That’s an ROI of 1,073%. The estimates lean on standard drivers: user growth, exchange access, and delivery of the AI tooling that turns creators into full-stack micro-businesses. None of that is guaranteed, but the path is more practical than many presales. The $XRP ETF matters here because liquidity attention tends to cascade. Payments-adjacent and creator-commerce projects sit close to XRP’s core utility narrative, so they often see spillover when fresh ETF demand hits the tape. If $XRP volumes lift and spreads compress, user-facing apps with low-friction payments usually benefit next. $SUBBD is positioning for that moment with a working economic loop and clear rewards. The first steps have already been taken, as the project has already onboarded the 2K+ of the top content creators, bringing a combined following of 250M+. So, read our guide on how to buy $SUBBD and head to the official presale website for more information. 🚀 The conclusion is simple: buy $SUBBD today before the train leaves the station. Disclaimer: This isn’t financial advice. Always do your own research before making any investment decision. Authored by Aaron Walker, NewsBTC – https://www.newsbtc.com/news/xrp-etf-launch-canary-capital-subbd-token-presale",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54310817,
    "published": 1762956137000,
    "title": "Bybit finds 16 blockchains with power to freeze user funds",
    "body": "After analyzing 116 blockchains, Bybit’s Lazarus Security Lab found 16 networks that can freeze or restrict user funds, raising questions about decentralization.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54310740,
    "published": 1762956062000,
    "title": "Franklin Templeton Expands Tokenized Fund Platform to Canton Network",
    "body": "The asset manager’s Benji platform will now operate on Canton, a blockchain used for institutional settlement and collateral markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54311486,
    "published": 1762957819000,
    "title": "Bitcoin Supply-Loss Chart Flashes Possible Bottom Signal — Is Reversal Emerging?",
    "body": "The cryptocurrency market has weathered a challenging period, testing the resolve of the most seasoned investors. After a prolonged period of downward pressure, the Bitcoin Supply-Loss Chart is flashing a possible bottom signal. A Deeper Look At Bitcoin Supply In Loss Chart Bitcoin on-chain data on the loss chart is currently flashing a possible bottom. In an X post, CryptosRus has revealed that the supply in the Loss metric chart tracks the total amount of BTC held by addresses where the current market price is below the average cost basis of those holdings. Essentially, the portion of BTC owners is currently underwater on their investment. Related Reading: Bitcoin To Bottom Out In 300 Days: Top Expert Forecasts $38,000 To $50,000 Price Point As a sentiment indicator, the high levels of supply in the Loss chart typically signal fear, capitulation selling, and potential market bottoms. In addition, the low levels indicate broad profitability and market greed. On April 7, 2025, when BTC traded around $74,508, the supply in loss was 5.159 million BTC. By November 5, 2025, even with BTC rising to $98,966, the supply in loss had also increased to 5.639 million BTC. During mid-2024, a similar situation reportedly occurred, marking the bottom at that time. The expert also outlined particular areas on the chart marked as 3, 4, and 5, which show uncanny similarities. Furthermore, in October 2025, recent lows showed a sharp spike in losses amid volatility, with approximately 30% of supply going underwater. On the chart, the yellow boxes highlight a rapid build-up, which has been a potent precursor to the market bottom. Currently, the supply in the loss has climbed to 28% and 33%, which is equivalent to 5.5 million BTC to 6.5 million BTC, matching the October endpoint on the chart and echoing the correction patterns seen in 2024. CryptosRus concluded that this may bring short-term bearish pressure, but it could flush out the final weak holders, opening the way for a bounce in Q4 and Q1 2026. The Accumulation Phase Before The Breakout Bitcoin has experienced three major corrections in this cycle, and each one has eventually led to a new all-time high after months of conviction. According to an analyst known as 0xBossman, this correction is no different, and each of these corrections has been brutal in its own way. BTC’s market flushed out the leveraged traders, resulting in them losing it all. Related Reading: Bitcoin Bull Market Peak Indicators Says Hold Despite Crash Below $100,000, What’s Happening? Meanwhile, the boredom that comes as a result of these corrections is what has led to the bearish sentiment. The market feels indecisive, and altcoins have bled. Thus, 0xBossman advised that traders should step back and realize that this consolidation will end with a massive green candle. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|0xBossman|Bitcin Supply In Loss Metric|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|CryptosRus",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54311313,
    "published": 1762957512000,
    "title": "CoinDesk 20 Performance Update: Bitcoin Cash (BCH) Gained 4.1%, Leading Index Higher",
    "body": "Chainlink (LINK) was also a top performer, rising 4% from Tuesday.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "CoinDesk Indices|CoinDesk Indices|CoinDesk 20|charts|Prices|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 12,
        "NAME": "BCH",
        "CATEGORY": "BCH"
      },
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54311285,
    "published": 1762957282000,
    "title": "XRP ‘distribution’ phase does not change $30 price target: Analysts",
    "body": "XRP analysts are still confident of a bullish continuation with targets between $10 and $30 for cycle tops, fuelled by multiple tailwinds.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54311608,
    "published": 1762956137000,
    "title": "Bybit finds 16 blockchains with power to freeze user funds",
    "body": "After analyzing 166 blockchains, Bybit’s Lazarus Security Lab found 16 networks that can freeze or restrict user funds, raising questions about decentralization.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54312289,
    "published": 1762959642000,
    "title": "RWA Specialist Centrifuge Debuts Tokenization Service, Starting with Daylight",
    "body": "Decentralized energy network Daylight is the first to use the Centrifuge Whitelabel service, aiming to simplify real-world asset tokenization.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Centrifuge|Tokenization|Real World Assets|Exclusive|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54312606,
    "published": 1762960348000,
    "title": "Ethereum price analysis: ETH ‘seconds away’ from breakout toward $4.4K",
    "body": "Ethereum neared a falling wedge breakout, eyeing a potential rally toward $4,400 by mid-December if the bullish setup is confirmed.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54313368,
    "published": 1762962300000,
    "title": "U.S. SEC Chief Atkins Says Clarity Coming on Crypto Tied to Investment Contracts",
    "body": "In the realm of the so-called Howey Test to define investment contracts under SEC jurisdiction, Atkins says there should be a clearer path for crypto involvement.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|U.S. Securities and Exchange Commission|Paul Atkins|Regulations|crypto legislation|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54314240,
    "published": 1762964321000,
    "title": "Pantera-Backed Solana Company to Tokenize Its Shares With Superstate's Opening Bell",
    "body": "The move follows fellow Solana treasury firm Forward Industries making its stock available onchain.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Tokenization|Solana|Superstate|Pantera Capital|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54314942,
    "published": 1762965880000,
    "title": "New Strike Force Set to Target Overseas 'Pig Butchering' As U.S. Hits Burma Operation",
    "body": "U.S. federal agencies are establishing a Scam Center Strike Force to counter the industrial-scale efforts to swindle money via crypto transactions.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Pig Butchering|Southeast Asia|Scams|Treasury|U.S. Department of Justice|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54314863,
    "published": 1762965600000,
    "title": "Franklin Templeton expands Benji tokenization platform to Canton Network",
    "body": "Franklin Templeton has linked its Benji tokenization platform to the Canton Network, expanding institutional access to regulated onchain assets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54314720,
    "published": 1762965398000,
    "title": "Bitdeer's New Bitcoin Mining Facility in Ohio Caught on Fire",
    "body": "A fire affected two buildings belonging to publicly traded Bitcoin miner Bitdeer in Massillon, Ohio on Tuesday.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54314638,
    "published": 1762965310000,
    "title": "Bitcoin Loans Usher In a New BTC Era – Bitcoin Hyper Tipped as the Next 1000x Crypto",
    "body": "What to Know: Bitcoin loans mark a shift from passive holding to active $BTC deployment, broadening access and reinforcing Bitcoin’s monetary role. Active $BTC lending can tighten liquidity loops: more collateralization, deeper markets, and stronger institutional incentives to hold $BTC. Bitcoin Hyper aims to make $BTC fast and programmable via an SVM-based Layer 2 with ZK settlement to Bitcoin. $HYPER’s strong presale momentum and large whale purchases fit perfectly into the current $BTC-focused cycle – one that’s fueled by real utility rather than pure hype. A Canadian Bitcoin-native company just issued its first Bitcoin-backed loan. That’s not a small tweak to the status quo. It’s a signal that $BTC is edging from ‘digital gold’ into an active financial asset, one that non-crypto users can finally access through a familiar product: lending. The firm’s goal is simple: accumulate $BTC and deploy it productively, yet the implication is big. More ways to borrow and build with Bitcoin usually mean stronger demand, deeper liquidity, and a broader user funnel. This design shift matters because utility beats narrative over a full cycle. Loans let institutions put idle $BTC to work and give businesses a way to leverage $BTC without selling it. The feedback loop is obvious: lending platforms attract borrowers, borrowers source $BTC, hodlers see new yield paths, and liquidity improves for everyone. Every service that treats $BTC as collateral, rather than a speculative asset, boosts its monetary credibility. That sets a timely backdrop for Bitcoin Hyper ($HYPER) , a $BTC-centric Layer 2 project built to make Bitcoin fast, programmable, and dApp-ready, and one many investors are already eyeing as the next 1000x crypto . If Bitcoin is stepping into mainstream finance, a chain that bridges $BTC into high-throughput smart contracts sits right in the slipstream. Bitcoin Hyper ($HYPER) Turns $BTC Into A High-Speed, Programmable Asset Bitcoin Hyper ($HYPER) proposes a Bitcoin Layer-2 that uses an SVM-based execution environment, canonical bridging, and ZK proofs to move $BTC at near-instant speed with low fees. The aim is to retain Bitcoin-grade security while unlocking staking, DeFi, and on-chain apps for $BTC itself. This approach directly addresses a pain point that lending alone can’t solve: throughput and programmability on Bitcoin. If loans expand demand for $BTC as collateral, a performant L2 expands what that collateral can actually do. The flow is straightforward. Users bridge $BTC, transact on Layer 2 with high throughput, then periodically settle back to Bitcoin L1 with cryptographic proofs. In practice, that means cheaper payments, faster markets, and room for dApps that rely on programmability without compromising the trust people expect from Bitcoin. The more services reference $BTC, like the newly launched loans, the more a generalized execution layer becomes useful for builders who prefer to stay within the Bitcoin ecosystem rather than porting value elsewhere. Utility also needs clear developer pathways. The $HYPER whitepaper emphasizes developer experience, observability, and infrastructure, enabling teams to ship quickly. If the project can make building on $BTC feel familiar to teams used to modern VM stacks, it lowers switching costs and accelerates innovation. That’s the kind of narrative institutions understand: faster rails, safer settlement, and broader use cases. Get on the $HYPER train before it’s too late. Presale Momentum Meets A $BTC Lending Tailwind Momentum is real. The Bitcoin Hyper presale has reached $26.9M, and you can buy $HYPER right now for just $0.013265. That’s a solid show of demand for a $BTC-first L2 at a time when Bitcoin’s financialization is visibly accelerating. If lending adoption widens the $BTC gateway, $BTC-native infrastructure stands to benefit directly. On-chain activity adds another datapoint. A recent transaction sent about 63.8 ETH, roughly $226K, into the presale contract, resulting in a transfer of 16.8M HYPER. While one whale doesn’t define a market, large buyers usually do their homework and often act as early liquidity. That fits the pattern of growing presale participation and the broader rotation toward $BTC-aligned narratives. What does the $HYPER price prediction look like in simple terms? Using the current price as a base, a year-end 2025 target of $0.02595 implies roughly 1.96x from here if the team delivers core milestones and listings. A 2026 scenario at $0.08625 would be about 6.51x if the DAO and incentive programs mature as planned. As Bitcoin-backed lending marks a new phase in $BTC’s financial integration, Bitcoin Hyper stands out as the infrastructure built to support that momentum. With its Layer 2 approach and growing presale, $HYPER could play a key role in turning the latest Bitcoin lending headlines into lasting on-chain utility. This article is for informational purposes only and doesn’t constitute financial advice. Always do your own research (DYOR) before investing in crypto. Authored by Aaron Walker, NewsBTC – https://www.newsbtc.com/news/bitcoin-loans-usher-in-a-new-btc-era-bitcoin-hyper-tipped-as-the-next-1000x-crypto",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54315302,
    "published": 1762966845000,
    "title": "Institutions Have Been Buying Solana Every Day For 2 Weeks, Is $300 Possible?",
    "body": "Institutional capital is circling back to Solana (SOL) as Spot Exchange Traded Funds (ETFs) open the gates to a new wave of inflows. Solana’s resurgence has caught the attention of the broader crypto community, recording consistent daily inflows and experiencing momentum it has not seen in months. The question now remains whether this steady buildup of institutional accumulation could eventually propel SOL’s price toward the $300 mark. Solana Records 11 Days Of Consecutive ETF Inflows The Solana price is currently hovering above $156, roughly half of its ATH of just over $294 set in January 2025. Over the past few months, the altcoin has experienced significant volatility, including a 20% decline in the last month. During this period, there was little news to drive the market. However, the recent surge in SOL ETF activity could signal a potential turnaround for Solana’s price. Related Reading: Institutional Investors Are Buying XRP And Solana At An Accelerated Rate While They Dump Bitcoin According to data from SoSoValue, US Spot Solana ETFs have witnessed a cumulative total net inflow of $350.47 million in less than two weeks. This suggests that institutions have been buying Solana ETFs every single day since its launch, signaling confidence in the current volatile market. Today, the daily total net inflow of Solana ETFs reached $7.98 million, approximately $1.2 million higher than the previous day’s $6.78 million. SoSoValue’s chart shows that the highest daily inflow during the past 11 days occurred on November 3, when Solana ETFs drew an impressive $70.05 million from both Bitwise and Grayscale. Bitwise’s BSOL ETF has been the primary driver of this steady inflow, accounting for $331.74 million of the total, while Grayscale’s GSOL ETF contributed a modest $18.72 million. The data underscores that institutions are not only showing interest in these new crypto investment products but are actively establishing long-term positions in Solana exposure. Considering Bitcoin ETFs drive the cryptocurrency’s price to former ATHs in 2024, Solana could see a similar response if ETF inflows remain strong and the broader market sentiment stays positive. While it remains unclear whether the cryptocurrency can reach $300, the steady accumulation from institutions provides a constructive foundation for future price appreciation. Grayscale Expands Trading Access With Solana ETF New reports reveal that Grayscale has added another layer of optimism to the SOL news by announcing that options trading for its Solana Trust ETF is not yet live. This provides investors with additional opportunities to gain exposure to the cryptocurrency, manage risk, and trade around Solana’s price movements. Related Reading: Solana To Dethrone Bitcoin And Ethereum? Here’s How The First SOL ETFs Are Faring Grayscale has announced that the Solana Trust will offer 100% staking, zero fees, and an average staking rewards rate exceeding 7%, making it an attractive option for investors seeking both exposure and yield. As Grayscale’s new moves strengthen Solana’s presence in the digital asset landscape, the introduction of options trading could also improve liquidity for the cryptocurrency. Featured image from Pixel Plex, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Solana|altcoin|bitwise|Bitwise’s BSOL ETF|ETFs|exchange traded funds|grayscale|Sol|SOL news|SOL Price|Solana news|Solana Price|Solana Trust ETF|SOLUSD|SOLUSDT|SoSoValue|Spot Solana ETFs",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54315238,
    "published": 1762966736000,
    "title": "Toncoin Drops 2.4% as Post-Rally Selling Pressure Caps Gains",
    "body": "The token briefly rallied to $2.1165 on increased volume before heavy selling erased gains, pulling TON back to key support levels around $2.02.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Technical Analysis|TON",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 98,
        "NAME": "TON",
        "CATEGORY": "TON"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54315148,
    "published": 1762966429000,
    "title": "Coinbase to Leave Delaware for Bitcoin-Friendly Texas",
    "body": "America's largest crypto exchange chooses the Lone Star State for its business-friendly regulation.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54315330,
    "published": 1762965843000,
    "title": "Crypto Rebounds! Lighter $1.5B Valuation! Winklevoss Capital fund Zcash DAT!",
    "body": "Crypto majors are rebounding after Tuesday’s selloff, with Bitcoin (BTC) up 1% at $105,000, while Ethereum (ETH) remains even at $3,550, Binance Coin (BNB) steady at $978, and Solana (SOL) down 2% at $159. Among top movers, CC (+30%), SKY (+15%), DCR (+13%), and ASTER (+10%) led the gains. Meteora’s MET token surged 35% following news of the Uniswap fee switch. Meanwhile, Ethereum whales have accumulated over $350 million during the latest dip, with indications that institutional players are behind the buying. Circle confirmed it is evaluating an $ARC token for its stablecoin chain, while Coinbase reportedly abandoned its planned $2 billion acquisition of stablecoin firm BVNK, according to Fortune. In other developments, SoFi introduced crypto trading for its customers, offering BTC, ETH, SOL, and more. JPMorgan also launched its deposit token, JPM Coin (JPMD), on Base—marking a major expansion of its blockchain products aimed at institutional clients.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54315579,
    "published": 1762967381000,
    "title": "Bitcoin falls to $101K despite stocks, gold rallying ahead of vote to end US govt shutdown",
    "body": "Bitcoin fell to new weekly lows at $101,300 as US equities and gold rallied ahead of the key vote to end the US government shutdown, signaling a shift in investor sentiment toward traditional assets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54315482,
    "published": 1762967319000,
    "title": "BONK Falls 5% to $0.00001223 After Rejection at Key Resistance",
    "body": "BONK slipped 5% to $0.00001223 after failing to break resistance near $0.0000130, with trading volume spiking nearly 50% above average during the pullback.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Technical Analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 113,
        "NAME": "BONK",
        "CATEGORY": "BONK"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54315416,
    "published": 1762967174000,
    "title": "Sui Launches Native Stablecoin USDsui Using Bridge’s Open Issuance Platform",
    "body": "The new U.S.-compliant USDsui aims to link the blockchain’s $200bn monthly stablecoin volume to Bridge’s interoperable platform.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Sui|Stablecoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54315443,
    "published": 1762967126000,
    "title": "DOJ, FBI, Secret Service Unveil 'Strike Force' to Combat Crypto Scams Rooted in China",
    "body": "The Scam Center Strike Force will coordinate across federal agencies to target crypto scam operations the DOJ said lead back to “Chinese crime syndicates.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54315763,
    "published": 1762967979000,
    "title": "HBAR Drops 0.6% to $0.18 Amid Indecisive Trading Session",
    "body": "Hedera's native token breaks key support in final trading hour as institutional focus shifts to regulatory-friendly blockchain alternatives.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 81,
        "NAME": "HBAR",
        "CATEGORY": "HBAR"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54316213,
    "published": 1762969064000,
    "title": "Solana Drops 4.9% Breaking Below Key Support as Alameda Unlocks Continue",
    "body": "Institutional inflows of $336 million fail to offset selling pressure as SOL falls to $153 amid fresh token releases.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Technical Analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54316196,
    "published": 1762968873000,
    "title": "How Ripple plans to bridge crypto and Wall Street in its $4B expansion",
    "body": "Ripple bundles custody, prime brokerage, treasury and stablecoins so institutions can operate like banks with crypto rails.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54316155,
    "published": 1762968825000,
    "title": "Bitcoin Plunges Below $102K Amid Weak U.S. Demand, Fed Divided on December Cut",
    "body": "Bitcoin's Coinbase Premium, a popular gauge for U.S. demand, is having its longest negative streak since the April correction, coinciding with the Fed turning more hawkish.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Market Wrap|market analysis|Bitcoin|Coinbase Premium|CryptoQuant|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54316470,
    "published": 1762969561000,
    "title": "Circle plans native token for Arc blockchain as Q3 profit surges",
    "body": "The stablecoin issuer considered stablecoin-denominated gas fees on Arc, but has a long-term goal of shifting to distributed governance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 54317422,
    "published": 1762972206000,
    "title": "Ripple Exec Reveals Why The Bitcoin Price Is So High Now",
    "body": "Ripple’s Chief Technology Officer (CTO), David Schwartz, has provided a clear explanation for why the Bitcoin price remains so high, currently the most expensive cryptocurrency on the market. Notably, Schwartz’s statement had sparked new discussions across the crypto community. His remarks focused on how people view and use BTC in transactions, revealing a simple economic truth that helps explain the market’s continued confidence in the world’s leading cryptocurrency. Ripple CTO Explains Logic Behind Elevated Bitcoin Price On Tuesday, Schwartz shared his thoughts on X, offering a simple but insightful explanation for Bitcoin’s current price strength. Responding to a community member’s question about why anyone would spend BTC given its potential for future appreciation, Schwartz explained that the reason lies in the asset’s perceived value and future expectations. Related Reading: Why Did The Bitcoin And Ethereum Prices Crash On October 10 And Will It Happen Again? According to the Ripple CTO, when individuals use Bitcoin to pay for goods or services, they are essentially realizing the full expected value of its future growth today. Rather than holding Bitcoin as a long-term investment and waiting for price gains, these users convert its potential into immediate utility. This behavior, he noted, reflects a broader belief in BTC’s enduring value and is one of the primary reasons why the cryptocurrency’s price remains so high. Notably, Schwartz’s remarks followed a conversation that began when Jack Dorsey, co-founder of Square, a business technology company, announced that Bitcoin payments had gone live across the firm’s platforms. Dorsey revealed that Square customers can now pay for services and products using Bitcoin directly, and sellers can choose between multiple settlement options, including BTC-to-BTC, BTC-to-fiat, and fiat-to-BTC transactions. Funds received through Bitcoin payments will be automatically stored in a user’s Square wallet, with self-custody transfer limits of up to $15,000 per day or $50,000 per week. Interestingly, the timing of Schwartz’s explanation comes a month after BTC reached a new all-time high of over $126,000. Compared to other digital assets, Bitcoin is the only cryptocurrency in the six-figure territory, even surpassing traditional investments like gold and major stock indices. While some analysts argue that Bitcoin is overvalued, many investors remain convinced that it could still climb significantly higher in the long term. Bitcoin Price Expected To Rise Even Higher The Bitcoin price is currently sitting above the $100,000 level, but analysts believe it could rise even further. The leading cryptocurrency is hovering near $103,300, experiencing some volatility, which has triggered a nearly 2% dip in the past 24 hours amid whale capitulations. Crypto analyst Joe Francesco noted that Bitcoin had initially surged to $107,000 following a wave of optimism sparked by US President Donald Trump’s proposed $2,000 stimulus plan. Related Reading: New XRP ETF Just Dropped, But Will Anything Be Different This Time? However, the rally proved short-lived, as BTC fell a few days later. Despite the pullback, Francesco has described the cryptocurrency’s chart setup as positive, predicting that Bitcoin could soon break through $107,000, with the potential to reach $115,000 and even $120,000 if upward momentum continues. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|Ripple|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|Ripple CTO|Ripple Exec|ripple news|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54317337,
    "published": 1762971975000,
    "title": "Would-Be $2 Billion Solana Treasury Company's Stock Crashes After Share Offering",
    "body": "Publicly traded brain-machine firm and planned Solana treasury VisionSys AI announced a stock offering. Now it's down 88% in the last week.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54317617,
    "published": 1762933666000,
    "title": "Morgan Stanley says it’s harvest time as Bitcoin enters ‘fall’ season",
    "body": "Morgan Stanley’s Denny Galindo likens Bitcoin’s cycle to the seasons, warning that the market’s “fall” phase is a time to secure gains before a downturn.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54317510,
    "published": 1762933666000,
    "title": "Morgan Stanley says it’s harvest time as Bitcoin enters ‘fall’ season",
    "body": "Morgan Stanley’s Denny Galindo likens Bitcoin’s cycle to the seasons, warning that the market’s “fall” phase is a time to secure gains before a downturn.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54318165,
    "published": 1762974000000,
    "title": "Skittish risk managers could turn Bitcoin’s institutional boom into a bust, CEO warns",
    "body": "Markus Thielen warns Bitcoin’s institutional rally could reverse as ETF outflows and market fatigue weigh on risk appetite.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54318827,
    "published": 1762975735000,
    "title": "LINK Drops 4% as Chainlink ETF News Fails to Push Break of Technical Resistance",
    "body": "The oracle token encountered selling pressure at $16.25 alongside a sizable decline in the broader crypto market.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Chainlink|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54318859,
    "published": 1762975627000,
    "title": "Price predictions 11/12: BTC, ETH, XRP, BNB, SOL, DOGE, ADA, HYPE, LINK, BCH",
    "body": "Bitcoin bulls attempted to initiate a recovery, but were met with heavy selling pressure near $107,000. A similar fate awaited most altcoins, which sold off from their respective resistance levels.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 12,
        "NAME": "BCH",
        "CATEGORY": "BCH"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54318613,
    "published": 1762975209000,
    "title": "Dubai Court Freezes $456M Linked to Justin Sun’s Bailout of TrueUSD Issuer Techteryx",
    "body": "Dubai’s Digital Economy Court said there was compelling evidence of a breach of trust and ordered a worldwide freeze to protect the assets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 173,
        "NAME": "TUSD",
        "CATEGORY": "TUSD"
      }
    ]
  },
  {
    "id": 54318969,
    "published": 1762975945000,
    "title": "XStocks hits $10B in volume 4 months after launch as tokenized stocks gain traction",
    "body": "Backed and Kraken’s xStocks sees rapid growth as investor interest in blockchain-based equities accelerates despite regulatory uncertainty.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54319628,
    "published": 1762977612000,
    "title": "Crypto Long & Short:  The Rise of Digital Asset Treasury Companies",
    "body": "In this week’s Crypto Long & Short Newsletter, Abdul Rafay Gadit writes about how DATCO’s are reshaping corporate finance. Then, we take a look back at crypto rates and a look ahead at signs of strength as the country emerges from the government shutdown, with Andy Baehr’s “Vibe Check.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "CoinDesk Indices|Treasury|MicroStrategy|CoinDesk Indices|Crypto Long & Short|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54319555,
    "published": 1762977300000,
    "title": "Prosecutors request February or March retrial for MEV bot brothers",
    "body": "After a jury deadlocked on a verdict for two brothers accused of perpetrating a $25 million exploit on Ethereum, prosecutors are looking to retry them in 2026.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 54319406,
    "published": 1762977124000,
    "title": "Crypto Investor Dan Tapiero Sees AI-Blockchain Crossover Fueling Next Big Wave",
    "body": "‘Blockchain is the money of AI,’ said the 10T founder, who’s betting 20% of his next fund on startups that don’t yet exist.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Exclusive|Dan Tapiero|10T Holdings|AI|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54319752,
    "published": 1762977866000,
    "title": "Nasdaq-Traded Solana Company Plans to Tokenize Shares via Superstate",
    "body": "Solana Company intends to tokenize shares on Superstate’s Opening Bell, a regulated platform enabling companies to move stocks on-chain.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54320424,
    "published": 1762979505000,
    "title": "Polymarket's Shayne Coplan: Blockchain Let Him Build a Global Force From His Bedroom",
    "body": "The founder of the prediction marketplace spoke at Cantor Fitzgerald’s crypto, AI and blockchain conference in Miami.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Polymarket|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54320406,
    "published": 1762979219000,
    "title": "Bitdeer in flames: Ohio mining facility fire extends stock sell-off",
    "body": "The incident at the Massillon, Ohio, facility followed the company's Q3 earnings report on Monday, showing a net loss of over $266 million.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      }
    ]
  },
  {
    "id": 54320192,
    "published": 1762978977000,
    "title": "Altcoin index metric hints at early revival: Is the next rally close?",
    "body": "New data shows stable altcoin speculation despite Bitcoin’s price drop, hinting at early signs of risk re-entry and a more mature altcoin cycle ahead.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54320405,
    "published": 1762957282000,
    "title": "XRP ‘distribution’ phase does not change $30 price target: Analysts",
    "body": "XRP analysts are still confident of a bullish continuation with targets from $10 to $30 for cycle tops, fuelled by multiple tailwinds.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54320463,
    "published": 1762945320000,
    "title": "Bridge is a compliant crypto communication tool that ‘doesn’t suck’",
    "body": "While Telegram and WhatsApp are fine for most retail users, institutions are held to higher standards when it comes to compliant messaging apps.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54321533,
    "published": 1762982094000,
    "title": "Yahoo Finance Taps Polymarket as Exclusive Prediction Market Provider",
    "body": "Polymarket said data from its prediction market platform will be integrated into Yahoo Finance, expanding its product to more people.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 54321838,
    "published": 1762983044000,
    "title": "Abundance of Catalysts Suggests XRP Price Could Take Off This Week",
    "body": "XRP is entering one of its most crucial weeks in months as a series of bullish catalysts align to set the stage for what could be a breakout move. The token has held firmly above the $2.20 support zone despite the recent market crash, and both technical and fundamental factors now point toward a possible surge in price. According to crypto analyst Guy on the Earth, XRP is in a make-or-break moment, with abundant news catalysts giving traders reasons to stay optimistic about the short-term direction. XRP Holds $2.20 Support; Analyst Eyes Resistance Ahead “Another reversal from lows as XRP holds onto the $2.20 support,” said Guy on the Earth in a recent post on X, capturing the cautious positiveness in the price of XRP. He noted that the token is currently slap bang mid-range, targeting a retest of the $2.63 to $2.72 resistance zone. Related Reading: The XRP Price Is About To Do This In November – “Get Ready” According to him, there is an abundance of positive catalysts this week, ranging from ETF speculation to the end of the ongoing government shutdown. These catalysts are very important, as XRP needs a continuation of its momentum bounce from $2.2 to target the next resistance from here; otherwise, this is a dead cat at best. The analyst emphasized that XRP’s ability to defend its key support levels will be critical in shaping its near-term trajectory. He warned that if the token revisits the $2.20 range, it may struggle to hold that level again, potentially slipping to between $1.90 and $2.00. Despite this caution, he maintained his conviction that the recent lows are already in and that XRP is gradually preparing for a range breakout to the upside. “Things are coming together for the rally we’ve been looking for,” he added, while noting that chopping around this zone is healthy before a break of the range higher. ETF Anticipation Builds Momentum For XRP A large part of this week’s optimism surrounding XRP is tied to growing speculation that a US-listed exchange-traded fund could be nearing approval. Canary Capital’s recent Form 8-A submission to the US Securities and Exchange Commission has increased expectations that the long-discussed spot XRP ETF might debut soon, possibly under the ticker “XRPC.” Related Reading: XRP Price Performance In November: History Says It’s The Most Bullish Month In History The anticipation surrounding this ETF has already begun shaping market sentiment, reflected in the steady stream of excitement from XRP supporters across social media. Traders are drawing comparisons to the rallies seen in Bitcoin and Ethereum following their respective ETF approvals, anticipating a similar influx of institutional demand if XRP’s turn arrives. At the time of writing, XRP trades at $2.41, a 2% dip in the past 24 hours. Maintaining the $2.20 support remains the key technical objective for bulls, as holding that level could pave the way for another attempt at the $2.72 resistance zone in the next few days. Featured image from Peakpx, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|bitcoin|Canary Capital|ethereum|Guy on the Earth|Ripple|US SEC|US Securities and Exchange Commission|xrp|xrp news|XRP Price|XRPC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54321990,
    "published": 1762983009000,
    "title": "IBM claims major leap toward quantum computers with new chips",
    "body": "IBM targets quantum advantage by 2026 and fault-tolerant systems by 2029 with new processors and faster error correction, advancing the race toward quantum computing.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54322199,
    "published": 1762975627000,
    "title": "Price predictions 11/12: BTC, ETH, XRP, BNB, SOL, DOGE, ADA, HYPE, LINK, BCH",
    "body": "Bitcoin bulls tried to spark a recovery, but were met with heavy selling pressure near $107,000. A similar fate awaited most altcoins, which sold off from their respective resistance levels.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 12,
        "NAME": "BCH",
        "CATEGORY": "BCH"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54322516,
    "published": 1762948548000,
    "title": "Kraken co-CEO warns UK rules meant to protect users punish them: FT",
    "body": "Arjun Sethi criticized the UK’s crypto regulations for burdening users with excessive disclaimers, saying they worsen customer experience.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54323032,
    "published": 1762985700000,
    "title": "Dubai Court Issues Worldwide Freeze of $456 Million Tied to Justin Sun's Stablecoin Bailout",
    "body": "A judge ordered a freeze of $456 million in assets tied to a stablecoin reserve bailout that reportedly involved Tron founder Justin Sun.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 54323769,
    "published": 1762950139000,
    "title": "Sonic Labs pivots from speed to survival with business-first strategy",
    "body": "Sonic Labs’ strategic shift aims to bring “measurable, lasting value” for builders, validators and S token holders through upgraded fees, token burns and institutional partnerships.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54323663,
    "published": 1762950139000,
    "title": "Sonic Labs pivots from speed to survival with business-first strategy",
    "body": "Sonic Labs’ strategic shift aims to bring “measurable, lasting value” for builders, validators and S token holders through upgraded fees, token burns and institutional partnerships.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54323836,
    "published": 1762950139000,
    "title": "Sonic Labs pivots from speed to survival with business-first strategy",
    "body": "Sonic Labs’ strategic shift aims to bring “measurable, lasting value” for builders, validators and S token holders through upgraded fees, token burns and institutional partnerships.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 54324163,
    "published": 1762988419000,
    "title": "Bitcoin’s Historical Liquidity Indicator Just Lit Up — Big Move Incoming?",
    "body": "According to an analyst, Bitcoin sits in a liquidity set-up that has shown up before big rallies. Prices are not shooting higher yet. At press time Bitcoin trades around $104,500, down 0.5% over the past day. Related Reading: XRP’s Next ‘Face-Melting’ Rally Could Hit Within 6 Weeks—Analyst Traders watched a decline of about 1.8% earlier that pushed the price near $103,400 and it briefly touched $102,850 during the move. Stablecoin Signal Points Toward Accumulation CryptoQuant analyst Moreno points to the Stablecoin Supply Ratio, or SSR, as the first clear indicator. The SSR compares Bitcoin’s market cap to the total market cap of stablecoins. It has dropped back into the 13 range. Based on historical readings, that 13 area has lined up with market lows in mid-2021 and at several moments across 2024. Reports show that when SSR fell to similar levels, liquidity quietly built up and buying followed after a period of low volatility. Liquidity Pattern Has Appeared Before Every Bitcoin Surge — And It’s Back “We’re witnessing a liquidity configuration that has only appeared a handful of times since 2020, and each instance marked a pivotal moment for Bitcoin’s trajectory.” – By @MorenoDV_ pic.twitter.com/vWKcCkyn55 — CryptoQuant.com (@cryptoquant_com) November 11, 2025 Binance Reserve Trends Add A Second Layer The second metric Moreno highlights comes from Binance. On that exchange, stablecoin balances are rising while Bitcoin reserves are shrinking. In plain terms: more cash-like tokens sit on the exchange and fewer coins are being held there. That pattern has appeared only a handful of times since 2020, according to the data he referenced. Each time, the movement suggested capital waiting on the sidelines and holders moving coins off exchanges into longer-term storage. Market Calm Can Hide Big Moves The current trading backdrop is cautious. Many investors expected a lift after news that the US Congress approved short-term federal funding through January 30, yet crypto did not rally with other risk assets. Some capital rotated back to stocks. At the same time, large holders took profits after recent highs, and momentum cooled. That mix shows how macro events can shift flows without immediately turning into crypto buying. Risk Still Exists — Structure Could Break Moreno warns this liquidity zone acts like a final structural support. If the metrics break down decisively, it could signal a deeper reset before any sustained recovery. In that scenario, buying would likely be delayed and volatility would rise. This is not a guaranteed outcome, but it is a clear risk that traders watch closely. Outlook: Limited Downside, Growing Upside Based on reports and on-chain signals, Moreno believes the risk-to-reward favors buyers at these levels. He points to the built-up stablecoin supply and falling exchange BTC reserves as reasons for that view. Related Reading: Could Shiba Inu Triple? Analyst Sees 200% Move Coming Historical patterns suggest the last three months of the year often bring gains for Bitcoin, but past behavior does not promise future returns. For now, the indicators show capital parked in stablecoins and fewer coins available on major exchanges. That creates a setup where fresh buying could push the market higher quickly if sentiment turns. Yet the opposite is possible: a break below these levels would reshape the cycle and force many participants to rethink positions. Markets will decide which path comes next. Featured image from Gemini, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|Bitcoin News|bitcoin|btc|btcusd|crypto|digital currency|federal reserve|liquidity|US shutdown",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54323946,
    "published": 1762950600000,
    "title": "Altcoins aren’t dead; long live altcoins",
    "body": "Bitcoin won’t win as a monetary asset while tokens power adoption through incentive layers. Zero-knowledge transport layer security unlocks verifiable data portability.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54324047,
    "published": 1762950600000,
    "title": "Altcoins aren’t dead; long live altcoins",
    "body": "Bitcoin won’t win as a monetary asset while tokens power adoption through incentive layers. Zero-knowledge transport layer security unlocks verifiable data portability.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54324097,
    "published": 1762950600000,
    "title": "Altcoins aren’t dead; long live altcoins",
    "body": "Bitcoin won’t win as a monetary asset while tokens power adoption through incentive layers. Zero-knowledge transport layer security unlocks verifiable data portability.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54325549,
    "published": 1762991394000,
    "title": "Brazil Targets Illegal Bitcoin, Stablecoin Use Through New Proposals",
    "body": "Brazil's government and central bank are tightening rules on crypto use in targeting criminals.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54327893,
    "published": 1762996203000,
    "title": "Bitwise’s exec says 2026 will be crypto’s real bull year, here’s why",
    "body": "With crypto markets failing to meaningfully rally toward the end of 2025, this only sets up 2026 for more upside, according to Bitwise’s Matt Hougan.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54328134,
    "published": 1762996973000,
    "title": "NYSE-Listed Exodus Posts Solid Third-Quarter Lift as Bitcoin Revenue Climbs",
    "body": "Exodus posted stronger third-quarter results and unveiled a new Latin America payments acquisition as it expands its Bitcoin-driven business.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54328297,
    "published": 1762952489000,
    "title": "Bitcoin price hits $105K as analysis eyes ‘massive’ Binance BTC withdrawals",
    "body": "Bitcoin maintained its November pattern of higher lows as it rebounded to $105,000, but traders remained cautious about a potential rejection at key resistance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54328351,
    "published": 1762952489000,
    "title": "Bitcoin price hits $105K as analysis eyes ‘massive’ Binance BTC withdrawals",
    "body": "Bitcoin maintained its November pattern of higher lows as it rebounded to $105,000, but traders remained cautious about a potential rejection at key resistance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54328599,
    "published": 1762952489000,
    "title": "Bitcoin price hits $105K as analysis eyes ‘massive’ Binance BTC withdrawals",
    "body": "Bitcoin maintained its November pattern of higher lows as it rebounded to $105,000, but traders remained cautious about a potential rejection at key resistance.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54329085,
    "published": 1762999213000,
    "title": "Uniswap (UNI) Soars 63% as ‘UNIfication’ Fee Proposal and $842M Token Burn Ignite a Frenzy",
    "body": "Uniswap (UNI) has sparked a storm across DeFi after founder Hayden Adams unveiled the long-awaited “UNIfication” proposal, a sweeping governance overhaul that introduces protocol fees, a substantial $842 million token burn, and a strategic buyback plan. Related Reading: XRP’s Next ‘Face-Melting’ Rally Could Hit Within 6 Weeks—Analyst The move marks Uniswap’s biggest reform since its 2020 token launch, designed to transform UNI from a passive governance token into a deflationary, yield-generating asset. Under the proposal, 0.3% of all trading volume will now be split between liquidity providers (0.25%) and a UNI buyback pool (0.05%), creating continuous demand for the token. With over $1 trillion in annualized trading volume, analysts project roughly $38 million in monthly buybacks, about $450 million annually. Whales Accumulate as Uniswap (UNI) Skyrockets 63% The market reaction was explosive. Uniswap (UNI) surged by over 63% in one week, peaking at $10 before stabilizing around $8.57. On-chain data from Santiment shows rising whale accumulation and a steady increase in UNI held outside of exchanges, indicating long-term investor confidence. BitMEX founder Arthur Hayes reportedly purchased $244,000 worth of UNI, joining institutional buyers positioning for a supply shock. CryptoQuant CEO Ki Young Ju predicted that if protocol fees remain active, annual burns could exceed $500 million, drastically tightening supply. “Even with unlocks, a UNI supply shock seems inevitable,” Ju noted. The rally also extended to other DeFi assets, such as AAVE, Synthetix, and Compound, as traders speculated that Uniswap’s model could set a new standard for protocol-owned liquidity and value distribution. UNI's price trends to the upside on the daily chart. Source: UNIUSD on Tradingview UNIfication Ushers in the Next Era of DeFi Governance Beyond tokenomics, UNIfication unites Uniswap Labs, the Foundation, and the Unichain L2 network under one ecosystem. The proposal eliminates interface fees, introduces fee discount auctions to enhance LP returns, and compensates governance delegates, turning Uniswap’s decision-making into a professionalized, revenue-sharing system. Adams emphasized that the initiative represents more than a technical upgrade, it’s a cultural shift. “Uniswap can be the primary place tokens are traded globally,” he said. “This proposal ends a restrictive chapter and begins the decade of Uniswap.” Related Reading: Ethereum Ready To Explode To $12,000 By January, Says Tom Lee With UNI up more than 66% this week and investors anticipating formal governance approval, the DeFi giant appears poised to reclaim its dominance as crypto’s flagship decentralized exchange. Cover image from ChatGPT, UNIUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Uniswap|UNI|UNI price|uniusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 53,
        "NAME": "UNI",
        "CATEGORY": "UNI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54329647,
    "published": 1763000346000,
    "title": "Bitcoin Drops Again After Failed Recovery — $100K Support Now in Focus",
    "body": "Bitcoin price failed to recover above $105,000. BTC is trimming gains and might could continue to move down if it trades below $101,200. Bitcoin started a fresh decline after it failed to clear $105,500. The price is trading below $105,000 and the 100 hourly Simple moving average. There is a bearish trend line forming with resistance at $103,300 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move down if it settles below the $101,200 zone. Bitcoin Price Dips Further Bitcoin price failed to stay in a positive zone above the $105,500 pivot level. BTC bears remained active below $105,500 and pushed the price lower. The last swing high was formed at $107,400 before the price started a fresh decline. There was a drop below the $105,000 and $104,000 levels. The price dipped below the 61.8% Fib retracement level of the upward move from the $99,220 swing low to the $107,400 high. Bitcoin is now trading below $104,000 and the 100 hourly Simple moving average . Besides, there is a bearish trend line forming with resistance at $103,300 on the hourly chart of the BTC/USD pair. If the bulls attempt another recovery wave, the price could face resistance near the $102,500 level. The first key resistance is near the $103,250 level and the trend line. The next resistance could be $103,500. A close above the $103,500 resistance might send the price further higher. In the stated case, the price could rise and test the $105,000 resistance. Any more gains might send the price toward the $105,500 level. The next barrier for the bulls could be $106,800 and $107,000. More Losses In BTC? If Bitcoin fails to rise above the $103,500 resistance zone, it could start another decline. Immediate support is near the $101,200 level and the 76.4% Fib retracement level of the upward move from the $99,220 swing low to the $107,400 high. The first major support is near the $100,500 level. The next support is now near the $100,000 zone. Any more losses might send the price toward the $98,800 support in the near term. The main support sits at $96,500, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $101,200, followed by $100,500. Major Resistance Levels – $103,250 and $103,500.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54329682,
    "published": 1763000337000,
    "title": "Tokenization demand is no longer tied to Bitcoin: Galaxy executive",
    "body": "Galaxy tokenization head Thomas Cowan says interest in tokenization is now “independent of the price of Bitcoin” as institutions have started to see the benefits.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54330361,
    "published": 1762956137000,
    "title": "Bybit finds 16 blockchains with power to freeze user funds",
    "body": "After analyzing 166 blockchains, Bybit’s Lazarus Security Lab found 16 networks that can freeze or restrict user funds, raising questions about decentralization.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54330167,
    "published": 1762956137000,
    "title": "Bybit finds 16 blockchains with power to freeze user funds",
    "body": "After analyzing 166 blockchains, Bybit’s Lazarus Security Lab found 16 networks that can freeze or restrict user funds, raising questions about decentralization.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54330110,
    "published": 1762956137000,
    "title": "Bybit finds 16 blockchains with power to freeze user funds",
    "body": "After analyzing 166 blockchains, Bybit’s Lazarus Security Lab found 16 networks that can freeze or restrict user funds, raising questions about decentralization.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54330759,
    "published": 1763002848000,
    "title": "Ethereum Whale Adds $105M To His ETH Position – $1.33B Bought Since Nov 4",
    "body": "Ethereum has entered a consolidation phase following a turbulent period of selling pressure driven by macroeconomic uncertainty and market fear surrounding the US government shutdown. Over the past week, Ethereum’s price has stabilized around the $3,500 level after briefly dipping below key supports, as traders and institutions reassess risk exposure across the crypto market. Related Reading: Bitcoin STH-MVRV Rebounds From Local Low – Potential Recovery Toward $115K–$120K Despite the cautious sentiment, on-chain data reveals a contrasting story — large holders, or “whales,” are quietly accumulating ETH during the downturn. According to data from Lookonchain and CryptoQuant, several high-value wallets have increased their Ethereum positions significantly, signaling growing confidence among long-term investors even as broader market momentum slows. This accumulation phase suggests that sophisticated players view current price levels as an opportunity rather than a sign of broader weakness. Historically, similar patterns of whale buying during macro uncertainty have preceded periods of recovery and renewed market strength. Whale Activity Suggests Strategic Accumulation Despite Market Uncertainty According to data from Lookonchain, a whale known for aggressive Ethereum accumulation has just purchased an additional 30,548 ETH ($105.36 million) within the past hour. This move brings his total acquisitions since November 4 to an astonishing 385,718 ETH, worth roughly $1.33 billion. Notably, around $270 million of the funds used for these purchases were borrowed from the decentralized lending platform Aave, highlighting a highly leveraged but strategic positioning. This type of activity often signals strong institutional confidence in Ethereum’s medium-term outlook. Borrowing large sums to accumulate ETH indicates that the whale expects price appreciation substantial enough to offset borrowing costs and volatility risks. It also reflects growing demand for Ethereum exposure within decentralized finance (DeFi), where whales utilize platforms like Aave to optimize capital efficiency. Such large-scale buying can have multiple implications: it absorbs available market liquidity, strengthens psychological support zones, and may trigger a sentiment shift among retail investors who interpret the move as bullish. However, it also introduces potential short-term risk — if prices correct further, leveraged positions could amplify volatility. Overall, the data points toward renewed accumulation momentum, suggesting that sophisticated market participants are positioning for Ethereum’s next major move. Related Reading: Uniswap Founder Submits Governance Proposal To Burn UNI — Token Jumps 50% Bulls Attempt to Reclaim Momentum Ethereum (ETH) is currently showing signs of stabilization after weeks of intense selling pressure, trading around $3,479 at the time of writing. The daily chart shows ETH holding just above the 200-day moving average (red line) — a key long-term support level that has historically acted as a launch point for bullish recoveries. After dipping below $3,200 earlier in the week, Ethereum bounced strongly, supported by renewed whale accumulation and improving market sentiment. However, the 50-day (blue) and 100-day (green) moving averages remain above the current price, indicating that the short-term trend is still tilted to the downside. For bulls to regain control, ETH needs to close decisively above $3,650–$3,700, where a confluence of resistance sits. Related Reading: Ethereum Trading Volume On Binance Surpasses $6 Trillion: A Speculative Frenzy Unfolds Volume data suggests that selling pressure is gradually fading, but momentum remains weak. If Ethereum fails to maintain the $3,400–$3,450 zone, the next major support lies near $3,200. On the upside, reclaiming the $3,700 mark could open the door to a recovery toward $4,000. Overall, Ethereum appears to be in a consolidation phase, with large holders accumulating while retail traders remain cautious — a structure that often precedes a stronger directional move. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ethereum|Ethereum accumulation|Ethereum Analysis|ethereum news|Ethereum Price analysis|Ethereum Whale|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54330649,
    "published": 1762956137000,
    "title": "Bybit finds 16 blockchains with power to freeze user funds",
    "body": "After analyzing 166 blockchains, Bybit’s Lazarus Security Lab found 16 networks that can freeze or restrict user funds, raising questions about decentralization.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54330787,
    "published": 1762956137000,
    "title": "Bybit finds 16 blockchains with power to freeze user funds",
    "body": "After analyzing 166 blockchains, Bybit’s Lazarus Security Lab found 16 networks that can freeze or restrict user funds, raising questions about decentralization.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54330686,
    "published": 1762956137000,
    "title": "Bybit finds 16 blockchains with power to freeze user funds",
    "body": "After analyzing 166 blockchains, Bybit’s Lazarus Security Lab found 16 networks that can freeze or restrict user funds, raising questions about decentralization.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54330554,
    "published": 1762956137000,
    "title": "Bybit finds 16 blockchains with power to freeze user funds",
    "body": "After analyzing 166 blockchains, Bybit’s Lazarus Security Lab found 16 networks that can freeze or restrict user funds, raising questions about decentralization.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54330952,
    "published": 1763003303000,
    "title": "Ethereum Slips After Rebound, Struggling to Keep Momentum Above $3,500",
    "body": "Ethereum price failed to stay above $3,550. ETH is trimming gains and might decline further if it dips below the $3,350 support. Ethereum started a fresh decline after it failed to stay above $3,550. The price is trading below $3,500 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance at $3,550 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move down if it settles below the $3,350 zone. Ethereum Price Dips Further Ethereum price failed to continue higher above $3,650 and started a fresh decline, like Bitcoin . ETH price dipped below $3,550 and entered a short-term bearish zone. The decline gathered pace below $3,500 and the price dipped below the 50% Fib retracement level of the upward move from the $3,176 swing low to the $3,658 high. Ethereum price is now trading below $3,550 and the 100-hourly Simple Moving Average . If there is another recovery wave, the price could face resistance near the $3,475 level. The next key resistance is near the $3,500 level. The first major resistance is near the $3,550 level. There is also a key bearish trend line forming with resistance at $3,550 on the hourly chart of ETH/USD. A clear move above the $3,550 resistance might send the price toward the $3,650 resistance. An upside break above the $3,650 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $3,800 resistance zone or even $3,880 in the near term. More Losses In ETH? If Ethereum fails to clear the $3,500 resistance, it could start a fresh decline. Initial support on the downside is near the $3,400 level. The first major support sits near the $3,360 zone and the 61.8% Fib retracement level of the upward move from the $3,176 swing low to the $3,658 high. A clear move below the $3,360 support might push the price toward the $3,280 support. Any more losses might send the price toward the $3,240 region in the near term. The next key support sits at $3,220 and $3,200. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI – The RSI for ETH/USD is now below the 50 zone. Major Support Level – $3,360 Major Resistance Level – $3,550",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54331039,
    "published": 1762956137000,
    "title": "Bybit finds 16 blockchains with power to freeze user funds",
    "body": "After analyzing 166 blockchains, Bybit’s Lazarus Security Lab found 16 networks that can freeze or restrict user funds, raising questions about decentralization.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54330883,
    "published": 1762956137000,
    "title": "Bybit finds 16 blockchains with power to freeze user funds",
    "body": "After analyzing 166 blockchains, Bybit’s Lazarus Security Lab found 16 networks that can freeze or restrict user funds, raising questions about decentralization.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54330941,
    "published": 1762956137000,
    "title": "Bybit finds 16 blockchains with power to freeze user funds",
    "body": "After analyzing 166 blockchains, Bybit’s Lazarus Security Lab found 16 networks that can freeze or restrict user funds, raising questions about decentralization.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54331863,
    "published": 1763005261000,
    "title": "Bitcoin Cash Gains 1.9% to $518 Breaking Key Resistance",
    "body": "Technical breakout drives BCH higher as institutional accumulation emerges above $515 support",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|AI Market Insights|Technical Analysis|Bitcoin Cash|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 12,
        "NAME": "BCH",
        "CATEGORY": "BCH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54331793,
    "published": 1763005068000,
    "title": "Jobs Data Blackout to Muddy Bitcoin's Macro Read as U.S. Shutdown Comes to a Close",
    "body": "Even as the shutdown ends, the loss of October’s inflation data has left investors without a key read on price pressures heading into year-end.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 54332608,
    "published": 1763006916000,
    "title": "Australia Warns Criminals Are Abusing National Cybercrime Platform to Drain Crypto Wallets",
    "body": "Police have urged vigilance, saying Australians should “check for warning signs, and protect themselves from cybercrime.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  }
]