[
  {
    "id": 56497221,
    "published": 1766930463000,
    "title": "The Year in Crypto ETFs 2025: Bitcoin, Ethereum Thrive as XRP and More Join the Party",
    "body": "This year, ETFs opened several new doors to crypto on Wall Street, as the SEC forged a fresh approach to the products.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Long Reads",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56503157,
    "published": 1766941247000,
    "title": "Analyst Says XRP Price On The Verge Of Bearish Breakdown",
    "body": "The XRP price has been bearish all through December, with key support zones failing to hold through the growing sell pressure. While the altcoin hovers around the $1.80 price level, recent on-chain evaluation shows that the XRP price could be in a precarious situation. Bearish Divergence Materializes Between RSI And XRP Price In a Quicktake post on the CryptoQuant platform, market analyst CryptoOnchain highlighted that there is a convergence of both technical and on-chain events, which reveal an imminent bearish phase for the XRP price. Related Reading: Cardano Founder Addresses ADA Dump Rumors, Is He Behind The 80% Price Crash? The analyst first pointed out that the XRP price is painting an unsettling picture on its weekly chart, basing this hypothesis on the technical context. While the XRP price hovers near recent highs, indicating intentions to recover previous levels, its momentum tells a contrasting story. CryptoOnchain explained that a bearish divergence has formed between the Relative Strength Index (RSI) and the XRP price. So, as the XRP price appears to target recent highs, the RSI has taken on a clear downturn, creating lower highs progressively. Usually, this type of divergence indicates weakening buying strength and dwindling momentum. Interestingly, historical data reveal that this pattern has often preceded significant price corrections. At the same time, the XRP price happens to be retesting the psychological and technical key level at $1.80. The market quant explained that in the event that $1.80 fails to hold, the altcoin could quickly see the beginning of an unbridled dump. Looking at the broader technical context, it becomes apparent that any significant upside attempt depends on improving momentum. Open Interest On Binance Cascades To New Low CryptoOnchain also cites a shocking development underneath the surface. The relevant indicator here is the Open Interest, which tracks the total value of all outstanding XRP derivatives contracts (on Binance) that have yet to be closed, settled, or liquidated at a given time. XRP’s open interest recently fell to as low as $450 million, a point marking the lowest level since November 2024. A sharp decrease in Open Interest typically points out that there’s been a significant efflux of leveraged capital from the futures market. Related Reading: XRP Stochastic RSI Just Touched 0.0 For The Second Time In History This kind of unchecked contraction suggests that XRP traders are either forcefully exiting the market or abandoning their positions out of fear. Moreover, the decline in Open Interest alongside weakening price momentum paints a narrative on investor interest; it shows that market participants are stepping back due to a lack of conviction, rather than positioning for upward continuation. With these signals converging to expose a strong bearish scenario for XRP, market participants are advised to act with caution, as the $1.80 key level’s defeat could mean serious trouble for the token’s price. As of this writing, XRP is valued at approximately $1.87, with a 1.5% price jump in the past 24 hours. Featured image from iStock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP News|xrp|xrp news|XRP Open Interest RSI|XRP Price|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56516412,
    "published": 1766967391000,
    "title": "Most crypto treasuries ‘will disappear’ amid bleak 2026 outlook: Execs",
    "body": "Many crypto and Bitcoin treasury companies may go under in 2026 as the model comes under pressure, industry executives tell Cointelegraph.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56516890,
    "published": 1766968417000,
    "title": "Flow validators urged to halt work after divisive blockchain rollback",
    "body": "The Flow Foundation has been slammed for rolling the layer 1 Flow chain back to patch up a $3.9 million exploit, with one partner advising validators to stop processing transactions until further notice.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 56519650,
    "published": 1766973648000,
    "title": "Ubisoft halts Rainbow Six Seige after hackers give each player $13.3M credits",
    "body": "A server-wide hack flooded Rainbow Six Siege with billions in credits, forcing an emergency shutdown and a major rollback operation.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 56521043,
    "published": 1766976090000,
    "title": "Bitcoin Price Advances Cautiously, Bulls Probe for Upside Control",
    "body": "Bitcoin price found support and started a recovery wave above $88,000. BTC is now rising and might attempt to surpass the $89,000 resistance. Bitcoin started a recovery wave above the $88,000 zone. The price is trading above $88,000 and the 100 hourly Simple moving average. There is a bearish trend line forming with resistance at $88,750 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move up if it trades above the $89,500 zone. Bitcoin Price Faces Resistance Bitcoin price managed to stay in a positive zone above $85,500 and started a recovery wave. BTC gained pace for a move above the $87,000 and $87,200 levels. The price climbed above the 50% Fib retracement level of the downward move from the $89,484 swing high to the $86,611 low. The bulls even pushed the price above $88,000. Bitcoin is now trading above $88,000 and the 100 hourly Simple moving average . If the price remains stable above $88,000, it could attempt a fresh recovery wave. Immediate resistance is near the $88,750 level and the 76.4% Fib retracement level of the downward move from the $89,484 swing high to the $86,611 low. Besides, there is a bearish trend line forming with resistance at $88,750 on the hourly chart of the BTC/USD pair. The first key resistance is near the $89,500 level. The next resistance could be $89,800. A close above the $89,800 resistance might send the price further higher. In the stated case, the price could rise and test the $90,200 resistance. Any more gains might send the price toward the $90,500 level. The next barrier for the bulls could be $91,500 and $92,000. Another Decline In BTC? If Bitcoin fails to rise above the $89,500 resistance zone, it could start another decline. Immediate support is near the $88,000 level. The first major support is near the $87,250 level. The next support is now near the $86,500 zone. Any more losses might send the price toward the $85,500 support in the near term. The main support sits at $84,500, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $88,000, followed by $87,250. Major Resistance Levels – $88,750 and $89,500.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56521534,
    "published": 1766976535000,
    "title": "Crypto heavyweights slam proposed 5% wealth tax in California",
    "body": "Crypto executives, including Bitwise CEO Hunter Horsley and Castle Island Ventures founding partner Nic Carter, have pushed back against a proposed 5% billionaire tax in California.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 56522013,
    "published": 1766977701000,
    "title": "Ethereum Price Targets Break Above $3K, Bulls Smell Opportunity",
    "body": "Ethereum price started a decent upward move above $2,900. ETH is now showing positive signs and might eye more gains above $3,000. Ethereum started a recovery wave above the $2,920 zone. The price is trading above $2,950 and the 100-hourly Simple Moving Average. There is a bullish trend line forming with support at $2,930 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move up if it settles above the $3,000 zone. Ethereum Price Eyes More Gains Ethereum price managed to stay above the $2,880 pivot level and started a recovery wave, like Bitcoin . ETH price climbed above the $2,920 resistance to enter a positive zone. The bulls were able to push the price above the 50% Fib retracement level of the downward move from the $3,075 swing high to the $2,888 low. Besides, there is a bullish trend line forming with support at $2,930 on the hourly chart of ETH/USD. Ethereum price is now trading above $2,950 and the 100-hourly Simple Moving Average . If the bulls are able to protect more losses below $2,950, the price could continue to move up. Immediate resistance is seen near the $3,000 level and the 61.8% Fib retracement level of the downward move from the $3,075 swing high to the $2,888 low. The first key resistance is near the $3,030 level. The next major resistance is near the $3,050 level. A clear move above the $3,050 resistance might send the price toward the $3,120 resistance. An upside break above the $3,120 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $3,200 resistance zone or even $3,220 in the near term. Another Decline In ETH? If Ethereum fails to clear the $3,000 resistance, it could start a fresh decline. Initial support on the downside is near the $2,950 level. The first major support sits near the $2,920 zone. A clear move below the $2,920 support might push the price toward the $2,880 support. Any more losses might send the price toward the $2,800 region. The next key support sits at $2,720. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI – The RSI for ETH/USD is now above the 50 zone. Major Support Level – $2,950 Major Resistance Level – $3,000",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56523656,
    "published": 1766980102000,
    "title": "Bitcoin helps USD's reserve status ‘in a strange way’: Coinbase CEO",
    "body": "Bitcoin is helping reinforce the US dollar’s reserve currency status by acting as a market check on excessive inflation and deficit spending, Coinbase CEO Brian Armstrong said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56526666,
    "published": 1766983574000,
    "title": "Bitcoin Breaks Above $90,000 as Traders Bet on New Year Rebound",
    "body": "Bitcoin rose in Asia trading to top $90,000, hinting at a potential breakout after the token missed out on a Santa rally that sent stocks to record highs.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56526971,
    "published": 1766984423000,
    "title": "Trump-linked crypto venture retains auditor with chequered history",
    "body": "Alt5 Sigma’s accounting firm lacks licence and has failed an inspection under industry’s peer review process",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56529384,
    "published": 1766988004000,
    "title": "Here’s The Ethereum Descending Triangle Structure That Threatens A Crash Below $2,800",
    "body": "Ethereum has been having a hard time over the last few months after hitting a brand new all-time high back in August 2025. The last quarter of the year has been especially brutal, with the cryptocurrency’s price down more than 29% in Q4 2025. Despite this abysmal performance, things have failed to turn around, with technical indicators continuing to point to further decline for the altcoin. The latest of these is the appearance of a descending triangle structure, that carried the promise of further downside. Ethereum Price Is Still Not Bullish As crypto analyst Alpha Trade Scope points out in a TradingView post, the Ethereum price chart is still showing major signs of weakness. For example, the digital asset saw its price crash below a descending trendline, and this has marked the continuation of the downtrend that began three months ago. Related Reading: XRP Supply Dwindles While ETFs Go On A Buying Spree Before 2026 The current price trend has led to the formation of a descending triangle structure, which emerged after the cryptocurrency completed an impulse move. Not only this, the trend of recording lower highs has been evidence of the increased selling pressure on the cryptocurrency. Doing this below the aforementioned descending trendline just lends credence to the fact that the downtrend is not over. There has also been a major shift in the market structure of the Ethereum price. For one, there was a Change of Character (CHoCH), which shows that the Ethereum price is no longer bullish, but is rather more bearish at this point. Resistance has also mounted at the $3,000 level over time, and the price has been trading well below this resistance for a while now. Also, the Ethereum price is caught in a tight range, trading within the Fair Value Gap (FVG) mapped out between $2,930 and $2,960. This shows the rising resistance at this level, that could serve as a rejection in the case of a recovery attempt. How Low Can The ETH Price Go? If the current bearish trend holds and the Ethereum price does get rejected, then the first target for the downside lies at $2,815. This first target serves as the first support for the cryptocurrency and the destination for an initial liquidity sweep as investors sell into the decline. However, it is not the final target. Related Reading: What Does XRP Really Do? Expert Explains What It Is Built For In the case of a further break, then $2,800 is expected to give way, leading to the second major target at $2,748. This target is more of a major demand zone and is more likely to trigger a bounce due to the mounting buying pressure at this point. “The chart presents a classic bearish continuation setup, favoring downside expansion if support breaks with confirmation,” the analyst said. Featured image from Dall.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56532038,
    "published": 1766991761000,
    "title": "Digital Yuan holdings to earn interest under China's new framework",
    "body": "The new framework due Jan. 1 will let banks pay interest on clients' e-CNY holdings.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|CNY|e-CNY|Yuan|Digital Yuan|China|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 56536573,
    "published": 1766998023000,
    "title": "Tokenized silver volumes explode as metal's price rises to record",
    "body": "A sharp jump in tokenized silver trading suggests investors are getting exposure to the metal onchain.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Silver|Tokenized Assets|RWA.xyz|Real World Assets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 56538413,
    "published": 1767000476000,
    "title": "Trend Research lifts ETH holdings to $1.8B with $35M buy, is ‘bullish’ on 2026",
    "body": "Trend Research founder Jack Yi pledged to continue buying Ether, citing a conviction for more financial and regulatory tailwinds driving crypto valuations in 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56540902,
    "published": 1767004525000,
    "title": "Bitcoin reverses early gains, drops below $88,000 as Nasdaq futures wilt",
    "body": "Bitcoin reversed Asian session gains, dropping below $88,000 and affecting major altcoins.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Ethereum News|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56541908,
    "published": 1767005980000,
    "title": "South Korean financial group Mirae Asset eyes crypto exchange Korbit acquisition: report",
    "body": "The financial group is in talks to acquire a 92% stake in Korbit for a as much as 140 billion won ($97 million).",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|South Korea|Seoul|Korbit|Acquisitions|mergers and acquisitions|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56542756,
    "published": 1767007374000,
    "title": "Real-world assets top DEXs to become 5th-largest category in DeFi by TVL",
    "body": "RWA protocols have overtaken decentralized exchanges by total value locked, as tokenized Treasurys, private credit, and commodities become core onchain building blocks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 56543874,
    "published": 1767009300000,
    "title": "Crypto ETPs shed $446M over Christmas as year-end sentiment remains fragile",
    "body": "Weekly fund flows point to lingering caution, with investors favoring newer products and select regions over broad market exposure.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 56543704,
    "published": 1767009114000,
    "title": "Sberbank issues Russia's first crypto-backed loan to bitcoin miner Intelion Data",
    "body": "Sberbank used its in-house crypto custody tool to back a loan for mining firm Intelion Data, signaling broader interest in crypto lending.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Sberbank|Bitcoin News|Bitcoin Mining|Crypto|Loans|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]