[
  {
    "id": 57600718,
    "published": 1769808638000,
    "title": "Why Litecoin Price Going To $2,000 Is Not A Fantasy, But Market Cap Math",
    "body": "Crypto pundit BigShortRare has declared that a Litecoin price rally to between $1,200 and $2,000 is not a fantasy but a marketcap math. This came as he explained exactly how the altcoin will reach this price target based on its market cap and circulating supply. Why A Litecoin Price Rally To $2,000 Could Happen In an X post, BigShortRare noted that LTC has a circulating supply of roughly 76.78 million coins. As such, a $1,200 Litecoin price will give the altcoin a market cap of about $90 billion, while at $2,000 per LTC, the altcoin’s market cap is about $150 million. The pundit remarked that these numbers sound big until they are put in context. Related Reading: Here’s Why The Litecoin Price May Be Getting Ready For Another Massive Rally BigShortRare alluded to the fact that Bitcoin has already crossed $2 trillion in market cap in the past, while Ethereum has traded above a $500 billion market cap. Furthermore, he stated that in the previous cycle, capital has repeatedly concentrated into a few large, liquid, and battle-tested assets. Therefore, a Litecoin price rally to a $90 billion to $150 billion market cap would still be a fraction of Bitcoin’s market cap and well within historical altcoin concentration ranges during late-cycle rotation. BigShortRare also mentioned that what supports that valuation range is not illusion but structure. He explained that Litecoin is fully integrated across exchanges, wallets, payment processors, and merchant rails. The pundit added that the altcoin has a fixed supply, no VC overhang, no emissions surprises, and no dependency on speculative incentives. LTC is also said to function as a settlement and payment network, not a promise. “LTC Is The OG” BigShortRare also noted that LTC is an OG crypto project, which is another reason why he is confident that the Litecoin price can rally to as high as $2,000. He stated that when markets rotate from experimentation to reliability, capital doesn’t spread evenly but rather compresses into assets that already work at scale. Related Reading: XRP, HBAR, And Litecoin: Pundit Highlights Coins To Watch In 2026 The pundit remarked that a $1,200 to $2,000 price tag for LTC doesn’t require it to replace Bitcoin or Ethereum. Instead, it only requires the market to price Litecoin as a major monetary rail and not a side character. “That’s not a prediction of timing. It’s a valuation argument. Price decides when. Structure decides if,” he concluded. It is worth noting that BigShortRare’s thesis was in support of crypto analyst Surf’s prediction that the Litecoin price was about to rally to $2,000. His accompanying chart showed that the rally to this price target could happen by 2028. At the time of writing, the Litecoin price is trading at around $64, down over 5% in the last 24 hours, according to data from CoinMarketCap. Featured image from Adobe Stock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Litecoin|altcoin|BigShortRare|bitcoin|btc|CoinMarketCap|ETH|ethereum|Litecoin news|litecoin price|ltc|LTC news|ltc price|ltc/usd|LTCUSDT|Surf",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 33,
        "NAME": "LTC",
        "CATEGORY": "LTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57601054,
    "published": 1769810251000,
    "title": "SoFi posts record Q4 revenue after reentering crypto market",
    "body": "The fintech bank reported record quarterly revenue of $1 billion as it reintroduced crypto trading, launched a stablecoin and rolled out blockchain-based remittances.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57601085,
    "published": 1769810539000,
    "title": "Bitcoin Mining Profits Hit 14-Month Low After Winter Storm Rocks Miners: CryptoQuant",
    "body": "Bitcoin miners are \"extremely underpaid\" given the price of Bitcoin and current BTC mining conditions, according to a CryptoQuant report.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57601717,
    "published": 1769813554000,
    "title": "A Reddit-like social network for AI agents is getting weird, and memecoin traders are cashing in",
    "body": "Moltbook’s viral posts and strange user behavior memecoins, including MOLT soaring more than 7,000%.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "News Analysis|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57602785,
    "published": 1769817655000,
    "title": "Bitcoin’s Digital Gold Thesis Faces Reality As Gold Surges Ahead",
    "body": "Bitcoin was designed to function as digital gold, a decentralised store of value that protects wealth from inflation, currency debasement, and the long-term dominance of the dollar. Currently, the market behaviour is telling a different story as de-dollarisation accelerates and investors seek safety from geopolitical risk and inflation pressures, with gold capturing the bulk of that capital. Is Bitcoin Still A Store Of Value Or A Risk Asset? Crypto investor Himanshu Sinha has stated on X that Bitcoin was supposed to be digital gold because it was built for de-dollarisation, but gold and silver are winning the trade and fulfilling that role. Over the past year, gold has risen by roughly 55%, silver has surged around 150%, while BTC has remained flat. Related Reading: What’s Going On With Bitcoin And The Stock Market? Analyst Breaks It Down The Central banks are the drivers; they don’t want volatility that they can’t manage, and they don’t want an asset that moves in lockstep with the Nasdaq. Instead, they want a controllable monetary infrastructure, and they’re buying gold at the highest rate in history. Just hours ago, gold hit $5,600, then collapsed by 8.21% in a straight vertical drop to $5,140, which is a textbook margin liquidation. At the same time, Microsoft dropped 11.7% as tech sold their gold because it was their only profitable asset, and the investors needed cash fast. This is the same liquidity contagion that used to be seen in the crypto market. According to Sinha, gold cannot be sanctioned in a bar. As the West weaponizes the dollar through sanctions and financial controls, the rest of the world needs a neutral exit. In the end, BTC still proved it is a speculative tool, while gold is proving to be the replacement. Why Gold Is Likely To Keep Outperforming Bitcoin A crypto trader known as Doctor Profit pointed out that nearly a year ago, he shared a Gold versus Bitcoin chart, highlighting that once 0.02 BTC equals 1 ounce of gold, it should mark the top for BTC. Meanwhile, when 0.11 BTC equals 1 ounce of gold, it marks the bottom for BTC. This happened in 2021 during the BTC top and during the BTC bottom in 2022. Related Reading: Expert Who Nailed The Bitcoin Top Now Says Buy At These Levels According to Doctor Profit, the analysis was later proven right this year by calling the BTC top at $125,000 at 0.02 for 1 ounce of gold. Calculating this move, if 1 BTC is $5,500 in gold price and divided by 0.11, it should be $50,000 BTC, which matches the analysis of BTC bottom for this cycle between $50,000 and $60,000 BTC. However, the analysis played out as expected. If calculated with a gold price of $7,000, the equivalent of BTC bottom should be around $63,000, which also aligns with the bottom target. In the Doctor Profit view, gold might continue to outperform BTC in the coming months. Featured image from Getty Images, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|Doctor Profit|gold|Himanshu Sinha|microsoft|silver",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57602928,
    "published": 1769818246000,
    "title": "Tether's gold holdings top $17 billion as net profits surpassed $10 billion for 2025",
    "body": "The stablecoin giant saw sharp growth in its USDT token's supply, and was one of the world's largest U.S. government debt holder with $141 billion Treasury exposure.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Tether|USDT|Gold|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 164,
        "NAME": "XAUT",
        "CATEGORY": "XAUT"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57603644,
    "published": 1769821210000,
    "title": "Why Gold & Silver’s All-Time Highs Are Very Bullish For Bitcoin And Altcoins",
    "body": "Gold and silver have recently dominated headlines, outperforming both Bitcoin and altcoins in the broader crypto market. While both precious metals recorded new all-time highs in 2026, many altcoins failed to reach similar milestones. Bitcoin, by contrast, did achieve an ATH in 2025; however, following that peak, its price retraced sharply to new lows. With this in mind, analysts argue that the strength of gold and silver does not pose a threat to digital assets. Instead, they interpret the divergence as a major bullish signal for Bitcoin and altcoins. Gold And Silver ATH Signals Bitcoin And Altcoins Upside Crypto market expert Mark Chadwick delivered a detailed analysis of precious metals and cryptocurrencies on X this week, pointing to what he calls “the biggest price divergence” ever recorded between gold and Bitcoin. His chart and analysis suggest that a strong performance in gold could be a major indicator for a potential rally in cryptocurrencies. Related Reading: Dogecoin Price Could Continue To Decline If This Doesn’t Happen; Analyst Chadwick noted that gold has surged aggressively, reaching an ATH of over $5,600 in January 2026. This price rally has pushed the metal into extreme overbought levels on higher timeframes. In contrast, Bitcoin is facing prolonged weakness and negative sentiment in 2026, despite reaching an all-time high above $126,000 in October 2025. The analyst suggested that this performance imbalance has reached levels that typically signal a major market shift. Gold and silver have been boosted by factors such as central bank accumulation, inflation hedging, and geopolitical pressures. At the same time, Bitcoin has been weighed down by tighter liquidity, reduced investor interest, and risk-off conditions. As a result, traditional safe-haven assets have entered overbought territory, leaving BTC and altcoins largely overlooked. Chadwick argues that markets move in cycles driven by sentiment and positioning. When one asset becomes excessively overbought, returns diminish, and capital seeks higher upside elsewhere. In past macro cycles, periods of strong performance in gold and silver have often been followed by capital rotating into higher-risk assets once fear subsides. Based on his analysis, Bitcoin’s current positioning reflects exhaustion rather than structural weakness. Chadwick believes that when manipulation ends and capital starts flowing out of gold and silver into BTC, it could set the stage for a sharp rebound in the leading cryptocurrency. Since altcoins typically follow Bitcoin’s performance, the analyst expects that once Bitcoin regains momentum, some of that profit could also rotate into select altcoins, fueling a price rally. Related Reading: XRP Prints Bullish Divergence On The Weekly Chart, But Is ATHs Still Possible? How High Bitcoin And Altcoins Could Rally Chadwick has stated that Bitcoin’s price could easily surge 10x as capital flows back into it and market sentiment and liquidity improve. However, the chart outlines a short-term rally, projecting a 91.60% rise to $170,000 from the $82,000 region. The analyst also predicted that altcoins could rise 50-100x, reflecting a staggering potential for gains in the crypto market. He concluded his analysis by emphasizing that smart money knows massive returns often come from diversification. From this perspective, the current ATHs of gold and silver do not undermine cryptocurrencies but signal an upcoming shift in capital. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|Bitcoin|altcoin|altcoin news|Altcoin season Altcoin season|Altcoin season news|altcoins|Altcoins news|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57604456,
    "published": 1769824834000,
    "title": "Ethereum Boost: Vitalik Buterin Sets Aside $45M In ETH For Privacy And Open Tech",
    "body": "According to reports, Vitalik Buterin has pulled 16,384 ETH from his reserves and plans to spend it on privacy and truly open technology. That move is paired with a call for five years of thrift at the Ethereum Foundation so the foundation can keep building core software while staying healthy for the long run. Related Reading: Gold, Silver Steal The Spotlight As Crypto Hype Fades On Social Media: Santiment A New Focus On Privacy And Openness Reports say the funds, worth about $45 million, will back a broad list of projects: open silicon, secure hardware, private messaging, local-first operating systems, and tools that mix zero-knowledge proofs with other privacy tools like FHE and differential privacy. He has already put money toward encrypted messaging and air quality work, and some new efforts aim to make secure hardware more affordable and verifiable. The plan covers both pieces of tech and the systems people run on them. Simple apps for daily life are included, not just fancy research. In these five years, the Ethereum Foundation is entering a period of mild austerity, in order to be able to simultaneously meet two goals: 1. Deliver on an aggressive roadmap that ensures Ethereum’s status as a performant and scalable world computer that does not compromise on… — vitalik.eth (@VitalikButerin) January 30, 2026 Personal Money For Public Good Buterin is taking on what might once have been “special projects” of the foundation. He withdrew the ETH personally, and reports note he is looking at secure, decentralized staking to route future staking rewards into these efforts. That shifts some financial risk from institutions to an individual who wants those projects to survive even when they are slow or controversial. Some of the initiatives are unlikely to attract fast capital. That is why personal backing matters. A Stronger Core, Not Bigger Hype The Foundation is said to be entering a phase of mild austerity so it can meet two clear goals at once: finish an aggressive technical roadmap and remain alive and independent into the far future. The technical aim is to keep Ethereum fast and scalable without losing decentralization or security. At the same time, the team wants to protect users’ ability to control their keys, their data, and their privacy. Reports note that “Ethereum for people who need it” is the guiding line, rather than chasing large corporate deals that transform how people use the chain. Related Reading: Bitcoin’s Slide To $82K Sets Off A $1.7 Billion Chain Reaction Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoin|bitcoin|crypto|Ether|ethereum|ethusd|Vitalik Buterin",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57604798,
    "published": 1769826112000,
    "title": "Bitcoin options turn bearish as BTC flirts with drop below $80K",
    "body": "Bitcoin options flashed extreme fear signals as the spot BTC ETF outflows rose, and the odds for a drop below $80,000 increased. Will dip buyers step in to save the day?",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57607280,
    "published": 1769835649000,
    "title": "Avalanche (AVAX) Defies Bear Market With Explosive On‑Chain Growth, Messari",
    "body": "A newly released report from crypto market intelligence firm Messari offers a detailed look at Avalanche’s (AVAX) performance during the fourth quarter (Q4) of 2025, revealing a sharp contrast between weak price action and record‑breaking on‑chain activity. Metrics Climb Even As AVAX Suffers Steep Q4 Decline According to Messari, Avalanche’s native token, AVAX, experienced a steep decline during the final quarter of the year. The token fell 59.0% quarter‑over‑quarter (QoQ) and 65.5% year‑over‑year (YoY), dropping from around $30.00 at the end of Q3 in September to approximately $12.30 by the close of Q4. Related Reading: Bitcoin Slides Toward $85,000 Despite Progress On US Crypto Market Structure Bill Avalanche’s circulating market capitalization mirrored that drop, falling 58.3% QoQ and 63.9% YoY from $12.7 billion to $5.3 billion. Yet, the decline in valuation also impacted Avalanche’s relative standing among digital assets. AVAX slipped from 14th to 21st place in rankings by circulating market cap over the quarter. Despite this, Messari highlighted that network usage continued to expand, effectively breaking the typical link between token price performance and network fees. While total fees measured in US dollars declined 11.7% QoQ, that drop was modest compared with the 59.0% fall in AVAX’s price. In native terms, fees paid on the network increased meaningfully. Fees denominated in AVAX rose 24.9% QoQ, climbing from 105,719 AVAX to 132,016 AVAX. Average daily transactions on the C‑Chain jumped 63% to 2.1 million, while a wave of liquidations during the market crash on October 10, 2025, generated $520,715 in transaction fees. Messari noted that this was the highest single‑day fee total recorded on Avalanche since February 2024. Avalanche Sees Record Transaction And User Activity Looking more broadly, Avalanche’s ecosystem reached new activity highs in Q4 2025. Aggregate usage across the C‑Chain and all Avalanche Layer‑1 networks accelerated sharply. Average daily transactions increased 4.5% QoQ and surged 1,162.1% YoY to 38.2 million. At the same time, average daily active addresses climbed 25.1% QoQ and an extraordinary 16,360.3% YoY, reaching 24.7 million. Activity on the C‑Chain alone reached historic levels. Average daily transactions rose 69.0% QoQ and 799.3% YoY, making Q4 2025 the busiest quarter on record for the chain. Staking metrics, however, reflected the pressure from falling prices. The total USD value of staked AVAX declined 59.9% QoQ and 69.1% YoY to $2.3 billion, largely tracking the token’s price drop. Rising DeFi Base And Major RWA Growth Avalanche’s decentralized finance ecosystem also continued to evolve despite market headwinds. Messari reported that the DeFi Diversity Score, which measures how many protocols account for 90% of total value locked, rose 5.9% QoQ and 63.6% YoY, increasing from 17.0 to 18.0. Related Reading: Bitcoin Supply In Loss Begins To Rise, Raising Early Bear Market Concerns Total DeFi TVL across Avalanche L1s and the C‑Chain declined 41.9% QoQ and 3.8% YoY, falling from $2.2 billion to $1.3 billion. At the same time, the network’s stablecoin market cap grew modestly, increasing 1.7% QoQ and 24.3% YoY to $1.8 billion. As seen in the chart above, measured in AVAX rather than dollars, native DeFi TVL rose 34.5% QoQ to 97.5 million AVAX, even as USD‑denominated TVL fell 44.9%. Messari explained that this divergence occurred because AVAX’s price declined faster than the underlying value held within DeFi protocols. One of the strongest areas of growth for Avalanche in Q4 was real‑world assets (RWAs). RWA TVL jumped 68.6% QoQ and 949.3% YoY, rising from $789.8 million at the end of Q3 to $1.33 billion by the close of Q4 2025. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Avalanche|Avalanche (Avax)|Avalanche blockchain|Avalanche DeFi|Avalanche Ecosystem|Avalanche network|Avalanche news|Avalanche price|AVAX news|AVAX Price|AVAXUSDT|crypto|crypto news",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 8,
        "NAME": "AVAX",
        "CATEGORY": "AVAX"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57608182,
    "published": 1769839251000,
    "title": "Bitcoin To $30,000? Analysts Warn BTC Crash Could Be Deeper Than Expected",
    "body": "After bouncing 2.6% from recent lows, Bitcoin (BTC) has been attempting to turn the $82,000-$83,000 area into support. Some analysts have warned that the cryptocurrency must hold the crucial macro support levels or it will “confirm bearish acceleration.” Related Reading: Ethereum Drops Below $2,800 As Crypto Liquidations Near $1B – Should Investors Worry? Bitcoin To Drop 76% From its Peak On Thursday, Bitcoin crashed alongside the rest of the market, retracing nearly 9% in a day toward the $81,314 area. BTC had been trading between $86,000-$93,500 since early November, closing above the lower boundary of its two-month range in the weekly timeframe despite constant volatility. At the moment, the flagship cryptocurrency has lost this key support in the daily timeframe and risks a deeper correction if the price doesn’t recover the $86,000 level before the end of the week. As the price hovers between levels not seen since the late November correction, a market observer has warned that the leading cryptocurrency has lost its 100-week Exponential Moving Average (EMA) as support. Ted Pillows asserted that the last two times Bitcoin had a weekly close below the 100-week EMA, back in 2018 and 2022, it dropped 50% in just 4-6 weeks. Moreover, he highlighted BTC’s historical pattern, noting that the cryptocurrency has repeated a similar performance between the 2017-2018 and 2021-2022 cycles. The chart shows an eight-year ascending trendline that has marked the top of the previous cycles. The trendline began during the late 2017 peak and continued into the next bull market, marking the 2021 cycle top too. Notably, the 2018 bear market correction saw Bitcoin retrace 83.11% from the ascending trendline, while the 2022 pullback had BTC dropping 77.57% from the cycle top. Per the chart, this has formed a rising support line that has marked where BTC’s price bottomed during previous bear markets. Now, Bitcoin has seemingly topped around the trendline once again and could retrace up to 76.88% toward the $30,000 mark in 2026, if history repeats. BTC Retests Macro Triangle Bottom Analyst Rekt Capital also shared his perspective on BTC’s recent pullback now that it has broken down from its weekly price range and is revisiting the $82,500 bottom of its Macro Triangle formation. The analyst explained that Bitcoin has been forming a triangle pattern in the monthly timeframe since mid-2024, similar to its 2021 triangle formation that preceded the previous bear market. Per the analysis, the flagship crypto has shown a nearly identical price action to its 2021-2022 performance, with the price respecting the macro support and descending resistance. A breakdown from the macro triangle bottom “would confirm Bearish Acceleration,” he noted, adding that for bull market continuation, the cryptocurrency would need to break and hold above the macro descending resistance on longer timeframes. “Until then, we have more evidence that maybe we will be following 2021 [performance]. (…) It’s just a little bit more compressed.” He also pointed out that BTC is displaying a similar Bull Market EMAs crossover that occurred during the early stages of the previous bear market. Related Reading: Analysts Say Dogecoin Consolidation Is About To End – Parabolic Run Or Crash Ahead? Rekt Capital highlighted that the imminent crossover does not necessarily predict additional downside, but “is effectively confirming weakness, kind of responding to the weakness that we are already seeing and have seen for a while.” “History is suggesting to us that if we continue to make these macro lower highs, which are a result of weakening demand at historical support regions, then there’s more reason to be bearish rather than bullish,” he concluded. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|Bitcoin Bear Market Lows|Bitcoin breakdown|Bitcoin correction|bitcoin price|btc|BTC ATH|BTCUSDT|crypto analyst|Crypto bear market|crypto market correction|Crypto trader",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57608155,
    "published": 1769838803000,
    "title": "Crypto extreme fear is one of the ‘few strong bullish signals': Santiment",
    "body": "Crypto sentiment platform Santiment said the “silver lining” in the current crypto market is the “extreme negativity” seen on social media.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57609073,
    "published": 1769842849000,
    "title": "Hyperliquid (HYPE) Rally: Expert Suggests Continued Growth, $35 Target Looms",
    "body": "Hyperliquid (HYPE) has emerged as one of the few large‑cap cryptocurrencies showing sustained strength across multiple time frames, even as the broader digital asset market remains under pressure. While Bitcoin (BTC), Ethereum (ETH), and most major tokens have struggled amid a market‑wide pullback, Hyperliquid has continued to post notable gains, setting it apart during what many consider the early stages of a bear market. What’s Driving Hyperliquid Higher Market data from CoinGecko shows that HYPE surged roughly 31% over the past week, pushing the token toward the $34 level earlier in the week, and marking its highest price in more than a month. Over the past 14 days, HYPE is up around 17%, while gains of 13% and 8% were recorded over the 30‑day and year‑over‑year periods, respectively. By comparison, Bitcoin has fallen 12% over two weeks, slipped 4% over the past month, and is down roughly 21% year‑over‑year. Related Reading: Bitcoin Supply In Loss Begins To Rise, Raising Early Bear Market Concerns Experts have pointed to fundamental and structural developments as key drivers behind HYPE’s performance. Crypto analyst Elite Crypto highlighted the impact of Hyperliquid’s HIP‑3 upgrade, which introduced permissionless perpetual contracts tied to real‑world assets (RWAs) such as gold, silver, and other commodities. According to the analyst, trading activity in these products has expanded rapidly, with silver‑based perpetuals alone exceeding $1 billion in daily volume on many occasions. Elite Crypto also pointed to signs of institutional accumulation, noting that decentralized autonomous traders, including strategies operating directly on Hyperliquid, have been steadily increasing their exposure. In addition, research firm Citrini has published bullish commentary on the platform, and speculation around a potential HYPE exchange‑traded fund (ETF) has added to market interest. HYPE Faces Crucial Technical Test From a technical perspective, analysts see important levels coming into focus. DeFi Guru noted that HYPE is currently testing its primary descending resistance, describing recent price action as impulsive and confidence‑driven, suggesting a shift in momentum. The analyst identified $30 as a key level to reclaim decisively. A clean move above that area could open the door to the next major target near $35, which aligns with the 0.618 Fibonacci retracement level. Related Reading: Bitcoin Slides Toward $85,000 Despite Progress On US Crypto Market Structure Bill Another analyst, Efloud, offered a more cautious view and outlined potential support and resistance zones for Hyperliquid. He identified a key support region near the $23.7 level, which is crucial in determining whether the cryptocurrency will continue its rally. Efloud noted that price has already reached an intermediate resistance area and suggested that short‑side setups would only be considered if bearish market structure appears on lower time frames, either at current levels or closer to the $38–$39 range. Despite the broader bullish narrative, Hyperliquid has not been immune to short‑term volatility. Over the past 24 hours, HYPE has pulled back by roughly 10%, falling toward around $29. Analyst Ox Kaize described the recent dip as a normal market reaction, particularly given recent developments affecting both gold and Bitcoin. He asserts that a recovery in those markets could provide additional upside momentum for Hyperliquid, potentially pushing the token toward the $50 level. Additional catalysts remain on the horizon. A second Hyperliquid airdrop is expected in the near future, and Kaize believes the timing could be deliberate, as distributing tokens while prices remain below peak levels may support longer‑term ecosystem growth. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Crypto|crypto|crypto news|HYPE news|HYPE price|HYPE price action|Hype price anaysis|HYPE price forecast|HYPE price news|Hyperliquid|Hyperliquid (HYPE)|Hyperliquid news|Hyperliquid price|HYPEUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57609232,
    "published": 1769843202000,
    "title": "Coinbase insider trading lawsuit against Armstrong, directors moves forward",
    "body": "The lawsuit alleges Marc Andreessen sold $118.7 million in Coinbase shares through Andreessen Horowitz, while CEO Brian Armstrong offloaded about $291.8 million.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57609558,
    "published": 1769844587000,
    "title": "Bitcoin, ether fall as shutdown clock hits and markets brace for a messy Monday",
    "body": "Bitcoin fell toward $83,000 as the U.S. entered a partial shutdown, with traders leaning defensive ahead of a House vote expected Monday.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57609839,
    "published": 1769845628000,
    "title": "Silver's 35% plunge ends up beating bitcoin in a rare crypto liquidation shock",
    "body": "Tokenized silver futures recorded the largest liquidations across crypto markets over the past 24 hours, overtaking bitcoin and ether as a sharp pullback in metals collided with leverage-heavy trading on crypto venues.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57611422,
    "published": 1769848248000,
    "title": "Trump Nominates Pro-Crypto Kevin Warsh For New Fed Chair — Details",
    "body": "United States President Donald Trump has unveiled former Federal Reserve Governor Kevin Warsh as his pick for the next chair of the US central bank. This move confirms the circulating rumors after the former Fed governor reportedly met with Trump at the White House on Thursday, January 29. Trump Pushes Warsh To Senate For Fed Chair Position On Friday, January 30, Trump, via his social media platform Truth Social, announced his nomination of ex-Fed official Kevin Warsh as the successor of Jerome Powell as the Federal Reserve chairman. Prior to this announcement, prediction platforms had heavily tipped Warsh as Trump’s likely pick. Related Reading: Why Litecoin Price Going To $2,000 Is Not A Fantasy, But Market Cap Math Warsh previously served on the Federal Reserve Board of Governors from 2006 to 2011 and held senior roles at the White House National Economic Council during former President George Bush’s administration. The former Morgan Stanley banker was considered for the Fed chair job in 2017 before Powell was eventually appointed. Trump said in his announcement: I have known Kevin for a long period of time, and have no doubt that he will go down as one of the GREAT Fed Chairmen, maybe the best. On top of everything else, he is “central casting,” and he will never let you down. Congratulations Kevin! Warsh has been a vocal critic of the Federal Reserve’s monetary policy long before Powell became chair. Unsurprisingly, his recent stance appears to align with Trump’s agenda of lowering interest rates. In fact, the former Wall Street executive said in an interview last July that President Trump was right to push the Fed to cut rates. Trump’s nomination of Warsh as the Fed chair still needs to be confirmed by the US Senate, with many commentators expecting a battle between the executive and legislative arms. While Trump seeks a Fed chair that listens to the White House, a homage that Powell has refused to pay, the Senate believes the Federal Reserve should function independently. What Does Warsh’s Selection Mean For Crypto? Warsh and Powell seem to be on opposite sides of the divide when it comes to the cryptocurrency industry and Bitcoin. While the current Federal Reserve chair has consistently played down BTC’s relevance in the greater US economy, Warsh has been fairly positive about the world’s largest cryptocurrency. In a recent conversation hosted by the Hoover Institution, Warsh said that Bitcoin is an important asset that doesn’t trouble him, and he doesn’t view the coin as a substitute for the dollar. “Bitcoin can help inform policymakers when they are doing things right or wrong,’ the former Morgan Stanley banker said. Related Reading: Bitcoin Needs Deeper Liquidity Before A Real Recovery Takes Shape: Analysts Featured image from iStock, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto|crypto market|cryptocurrency|Donald Trump|federal reserve|Federal Reserve Chair Jerome Powell",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57612697,
    "published": 1769856705000,
    "title": "US Treasury sanctions Iran-linked crypto exchanges for first time",
    "body": "The US Treasury has sanctioned two UK-registered crypto exchanges tied to Iran’s financial system, marking the first time Washington has targeted digital asset platforms.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57613336,
    "published": 1769859049000,
    "title": "Bitcoin Estimated Leverage Ratio Spikes To New High — Fresh Volatility Ahead?",
    "body": "After surging toward the $100,000 mark a few days into the new year, the price of Bitcoin looks set to end January in stark contrast to how it started the month. On Thursday, January 29, the flagship cryptocurrency fell to a multi-month low of around $81,500, with the general market sentiment worsening over the past few weeks. Going into the weekend, the price of Bitcoin has somewhat cooled off, recovering above the $93,000 level on Friday, January 30. Interestingly, the latest on-chain data suggests that the market leader is only on the verge of another violent price movement. BTC Setting Up For A Violent Liquidation Cascade In a Quicktake post on the CryptoQuant platform, CryptoOnchain shared insights into the current on-chain condition of the Bitcoin price. According to the market quant, the Bitcoin Estimated Leverage Ratio (ELR) witnessed a notable upswing on Binance, the world’s largest crypto exchange, while price was undergoing its most recent correction. Related Reading: Bitcoin Needs Deeper Liquidity Before A Real Recovery Takes Shape: Analysts For context, the Estimated Leverage Ratio is an on-chain metric that tracks the ratio between open interest and the reserve of an exchange (Binance, in this case). This metric measures the average amount of leverage used by the traders in a particular market or exchange. A higher ELR signals a higher market risk, suggesting that small price movements could lead to significant liquidations. According to data from CryptoQuant, CryptoOnchain highlighted that the Bitcoin Estimated Leverage Ratio recently spiked to a critical level of 0.188 when the price fell to around $81,500, indicating that the Open Interest is exceptionally high relative to the exchange’s reserves. Furthermore, CryptoOnchain shared that the divergence between rising leverage and falling prices is a classic “bearish divergence” signal in the derivative market. “It indicates that despite the price weakness, traders are aggressively increasing their leverage positions,” the on-chain expert added. What’s more, CryptoOnchain revealed that when the market becomes heavily over-leveraged during a price correction, it implies that the traders are either “buying the dip” with high leverage or increasingly taking short positions. The market quant said this setup usually precedes a “violent liquidation cascade.” Overall, CryptoOnchain concluded that the market is currently in a high-tension zone, with the combination of peak leverage and low prices suggesting that a “squeeze” is imminent. The analyst, however, clarified that the direction of the next violent movement depends on the dominant side (bulls or bears) of the market. Bitcoin Price At A Glance As of this writing, the price of BTC stands at around $84,200, reflecting a nearly 1% jump in the past 24 hours. Related Reading: Here’s Why The Bitcoin And Ethereum Prices Are Still Trading Sideways Featured image from iStock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc price|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57613829,
    "published": 1769860800000,
    "title": "Active Solana addresses spike 115%, four in 10 merchants take Bitcoin: Month in Charts",
    "body": "Activity on Solana has spiked as new AI tech makes it easier than ever to launch memecoins. Meanwhile, Ethereum is plugging away at future-proofing and bringing down fees.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57614840,
    "published": 1769864449000,
    "title": "U.S. imposes sanctions on crypto exchanges tied to Iran for the first time",
    "body": "The exchanges were accused of facilitating transactions for the Islamic Revolutionary Guard Corps and are linked to an Iranian businessman convicted of embezzlement.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Iran|Treasury|Sanctions|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57614839,
    "published": 1769864400000,
    "title": "NYSE's 24/7 plan could fix key problem for stock tokens, Ondo's de Bode says",
    "body": "NYSE and Nasdaq introducing 24/7 trading with tokenized stock would be a \"godsend,\" solving thin weekend liquidity, Ondo Finance President Ian de Bode told CoinDesk in an interview.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Tokenization|tokenized stocks|Real World Assets|Consensus Miami 2026|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 108,
        "NAME": "ONDO",
        "CATEGORY": "ONDO"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57615757,
    "published": 1769868000000,
    "title": "Record Token Failures In 2025 Reinforce The Role Of Utility",
    "body": "The digital asset market went through a major reset in 2025, as token failures reached record levels.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57616506,
    "published": 1769870806000,
    "title": "Bitcoin plunges under $81,000 amid reports of Iran explosions and Binance spat",
    "body": "Bitcoin slid toward $81,000 on Saturday as thin weekend liquidity magnified selling pressure, with traders pointing to Middle East tensions, U.S. political risk and lingering crypto-specific uncertainty.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57616787,
    "published": 1769853634000,
    "title": "Tether Breaks Records: $10B Profit And $186B USDT Now In Circulation",
    "body": "Tether closed out the year with numbers that turned a few heads in finance circles. Reports say the firm posted net profits above $10 billion for 2025 while the stablecoin USDT grew to roughly $186 billion in circulation — a new high for the token and a sign of how central it has become to crypto markets. Related Reading: Bitcoin Suppression? Analyst Claims Single Force Keeping Price Under $90K Strong Balance Sheet And Big Reserves Reports note that Tether’s balance sheet shows solid backing after dividends and payouts. The issuer reportedly ended the year with several billion in excess reserves and total assets that comfortably outmatched liabilities. That cushion has calmed investors who worry about backing for so much stablecoin. Tether’s cash and short-term holdings are heavy on US Treasury exposure. Based on reports, a large slice of its reserves sits in Treasuries and similar instruments that generate steady interest income. That income helped drive the large profit number, even as the company moved into other assets. The numbers came from Tether’s most recent annual attestation, prepared by independent accountants at BDO, highlighting the company’s status as one of the top earners in the digital asset sector. Gold Buys And A Shift In Mix Reports say Tether has been increasing its holdings of physical gold alongside Treasuries. Recent filings and public comments show roughly 27 tons of gold purchased in the final quarter of the year, and the firm has said it may aim for between 10% and 15% of its portfolio in gold over time. That move is meant to diversify reserves and trim exposure to any single market. Stock And Market Effects The profit and the increase in the USDT supply have spillover effects. Market makers and exchanges usually use Tether as the primary dollar substitute in the crypto market, and the increased USDT supply improves trading and payment liquidity. On the other hand, some rating agencies and analyst firms have pointed out some concerns. There are potential issues with transparency and risk if markets turn against them due to increased allocations to non-Treasury assets. What This Means For Users And Regulators For users, the first thing to note is that the increased supply of USDT in the market typically means improved on-ramps for trading and moving value between platforms. For regulators and big lenders, the numbers underline why stablecoins attract scrutiny. Reports note that watchdogs want clearer, repeatable disclosures to match the scale of these holdings. Related Reading: Ethereum Boost: Vitalik Buterin Sets Aside $45M In ETH For Privacy And Open Tech Tether’s recent performance frames a larger story about how crypto handles dollar-like liquidity in practice. The company says its reserves and reporting meet its own standards, while independent commentators push for still greater clarity. Either way, USDT’s role has grown, and the conversation about risk, disclosure, and where those backing assets sit is only getting louder. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|crypto|digital currency|stablecoin|tether|USDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57617491,
    "published": 1769874064000,
    "title": "ETH, SOL and DOGE slide 7% as $850 million bullish bets end up liquidated",
    "body": "Ether, solana and XRP led losses across crypto as a wave of long liquidations swept futures markets, showing stress spreading beyond bitcoin during weekend trading.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57617302,
    "published": 1769873400000,
    "title": "Bitcoin 'fear' sentiment hits a 2026 high as price downtrends toward $80,000",
    "body": "Social chatter around bitcoin has turned sharply negative after the token slid to its lowest level since Nov. 21, a setup Santiment says often appears near capitulation, even if near term trading stays messy.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57617871,
    "published": 1769875238000,
    "title": "Bitcoin Adjusted SOPR Shows Market At Pivotal Junction — What’s Next?",
    "body": "Over the past week, the Bitcoin market experienced new waves of liquidations with prices dropping to around $81,000 on Thursday. Though the premier cryptocurrency has seen a slight rebound since then, bearish sentiments remain dominant with analysts expecting a potential decline to as low as $56,000. Amid this recent correction, a developing on-chain situation has reached a boiling point, putting the Bitcoin market at a critical juncture. Related Reading: Bitcoin’s Slide To $82K Sets Off A $1.7 Billion Chain Reaction Bitcoin aSOPR Holds Clue To Next Market Phase – Analyst The Adjusted Spent Output Profit Ratio (aSOPR) is an on-chain metric used to measure whether Bitcoin investors are, on average, selling their coins at a profit or at a loss, while filtering out noise from short-term, low-value movements. In usual market trends, each new price peak is accompanied by higher conviction as investors are willing to hold longer, take profits later, and tolerate larger drawdowns because they expect even higher prices. However, during Bitcoin’s ascent from around $40,000 in early 2024 to over $100,000, the aSOPR has shown a different pattern as observed by market analyst MorenoDV. Despite a consistent uptrend resulting in multiple price peaks, Bitcoin aSOPR established a downtrend pattern marked by lower highs and lower lows, thereby creating a puzzling market divergence. According to MorenoDV, this development suggests that Bitcoin traders were aggressively taking profits with each rally, indicating a lack of long-term market confidence. Considering the descending profit-taking pattern, it can also be inferred that investors were satisfied with smaller and smaller gains, suggesting they were no longer convinced that upside continuation was likely. Related Reading: Bitmine Stakes Additional 250,912 Ethereum Worth $745M – 61% Is Now Staked The Present Market Debacle Despite the ongoing divergence, it is still observed that aSOPR respects the general market trend with each high in its descending channel aligning with a local price top, while each retest of the lower boundary coincides with a market bottom. Presently, the aSOPR is retesting this lower boundary, in a fear-ridden market with over 30% of market supply in a loss. Ideally, MorenoDV explains these are accumulation opportunities, especially in further consideration of the negative aSOPR. However, the analyst warns that a decisive fall below this line could strengthen present bearish sentiments, resulting in an intense market capitulation, as an already fearful set of investors would likely initiate a sell-off. At press time, Bitcoin continues to trade around $83,819, reflecting 0.41% decline in the past day. Following the recent liquidations, the market leader is now 34% away from its all time high of around $126,100. Featured image from Freepik, chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin aSOPR|btcusd|BTCUSDT|cryptoquant|Market divergence|MorenoDV",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57618001,
    "published": 1769875557000,
    "title": "VC Roundup: Crypto funding rebounds as institutions test onchain finance",
    "body": "From venture rounds to onchain credit, capital is moving cautiously back into crypto as institutions focus on infrastructure and real-world use cases.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57618298,
    "published": 1769877062000,
    "title": "India Faces Pressure to Rethink Crypto Taxes Ahead of Union Budget as Trading Shifts Offshore",
    "body": "Industry leaders are pushing for tax reform as traders flee offshore, draining domestic exchanges and undermining regulatory oversight.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 57618716,
    "published": 1769878800000,
    "title": "The market for tokenized equities has exploded by almost 3,000% in a single year",
    "body": "Tokenized stocks grew nearly 3,000% in 2025 as new SEC rules and a DTCC pilot pushed the asset class toward the $1 billion milestone, led by Ondo and Securitize.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Tokenization|Real World Assets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57618954,
    "published": 1769879640000,
    "title": "Bitcoin breaks key support level as Glassnode warns of further price breakdown",
    "body": "Long-term bitcoin holders are selling at the fastest pace since August, while some industry observers suggest the market may be approaching a bear-market bottom.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Santiment|Sentiment|crypto market|fear and greed index|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57619223,
    "published": 1769880614000,
    "title": "Crypto Funds Bleed $1.80 Billion As Metals Rally Heats Up",
    "body": "Investors stepped back this week as a mix of shifting bets and quick profit-taking pushed money out of spot crypto ETFs. Markets moved fast, and some of the biggest swings were driven by short-term reactions rather than a change in long-term views. Related Reading: Ethereum Boost: Vitalik Buterin Sets Aside $45M In ETH For Privacy And Open Tech Spot Crypto ETF Flows Based on reports from Farside, US-based spot Bitcoin ETFs saw about $1.50 billion leave over five trading days, while spot Ether ETFs had roughly $327 million in outflows. That adds up to about $1.80 billion pulled from these funds in just a few days. On Jan. 14, reports note a very large inflow for Bitcoin ETFs — $840 million — which shows how quickly money can go in and out. Some traders treated that day as a buying moment. Others used it to take profit. That push-and-pull shows up in the numbers. A Rally In Metals, Then A Sudden Drop Gold and silver grabbed attention when they climbed to fresh highs. Prices surged, and many investors moved money into precious metals. But the rally was short-lived. On a single trading day, gold fell sharply from its peak and silver tumbled even more. Reports say those sudden reversals left some investors rethinking their moves and helped create a wave of selling across other risk assets, including crypto. Bitcoin Price Action Bitcoin has been swinging. Over the past week, BTC fell about 6.50% while Ether dropped around 8.90%, and they were trading around $82,500 and $2,685, respectively, according to CoinMarketCap. The market had a short spike after talk of the US CLARITY Act, but prices then cooled. Moves like this are often tied to positioning, margin calls, and traders reacting to headlines. At times, large flows into ETFs have pushed prices up. Other times, outflows coincide with volatile days when traders close positions quickly. Related Reading: Bitcoin’s Slide To $82K Sets Off A $1.7 Billion Chain Reaction What Analysts Are Saying Reports note that some market watchers view the pullback as temporary. ETF analyst Eric Balchunas said the current negativity about Bitcoin’s price is short-sighted and pointed to strong performance in prior years as context. Another voice, Bitwise’s Matt Hougan, suggested that continued ETF demand could send Bitcoin into a much higher trajectory over time. These views reflect different timeframes — some focus on immediate flows, others on how steady demand might shape prices months from now. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|btc|btcusd|CLARITY Act|gold|iran|metals|Precious Metals|silver|Trump",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57619983,
    "published": 1769882681000,
    "title": "CoreWeave shows how crypto-era infrastructure quietly became AI’s backbone",
    "body": "From crypto mining to AI compute, former cryptocurrency miners are reshaping data center economics as Big Tech’s grip on infrastructure begins to loosen.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57620376,
    "published": 1769883738000,
    "title": "Solana DeFi platform step finance hit by $27 million treasury hack as token price craters",
    "body": "The platform's governance token (STEP) plummeted over 80% following the announcement amid a wider crypto market drawdown.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Solana News|Step Finance|Security|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 57620218,
    "published": 1769883600000,
    "title": "How decentralized AI training will create a new asset class for digital intelligence",
    "body": "Tokenized AI will democratize access to the world’s most valuable resource, argues Brukhman.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Opinion|Tokenization|Opinion",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57620482,
    "published": 1769884455000,
    "title": "Retail traders are running for the exit amid bitcoin's selloff, while 'mega-whales' are quietly buying the dip",
    "body": "Glassnode data shows large bitcoin holders accumulating, while retail remains in distribution.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Glassnode|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57620881,
    "published": 1769886036000,
    "title": "Rising Above The Ashes: XRP ETFs Set New Record Despite Market Crash",
    "body": "Despite a major outflow just a day earlier, Spot XRP ETFs have defied bearish sentiment, setting record trading volumes and attracting fresh inflows. This resilience and surge in investor demand is particularly surprising given the recent crash in the XRP price and the overall downturn in the broader crypto market. Related Reading: Ethereum Boost: Vitalik Buterin Sets Aside $45M In ETH For Privacy And Open Tech XRP ETFs Defy Trends And Hit Record Volume XRP is making headlines after its ETF experienced fresh inflows following a significant outflow. According to data from SoSoValue, XRP ETFs saw a record $92.9 million drop on January 29, 2026. This marked the largest reduction since their launch on November 13, 2025. Since becoming available for trading, XRP ETFs have registered only three outflows, with the recent $92.9 million decrease being the third. This withdrawal was primarily driven by Grayscale’s GXRP, which saw a whopping $98.39 million leave the fund, partially offset by inflows into Franklin Templeton’s XRPZ, Bitwise’s XRP ETF, and Canary’s XRPC. At the time of the outflow, the total net assets of XRP ETFs fell to $1.21 billion from $1.39 billion the day earlier. The decline coincided with a drop in XRP’s price, which fell from $1.92 to $1.80 over 24 hours. Unexpectedly, XRP ETFs picked up just a day after the $92.9 million withdrawal. They recorded a daily total net inflow of $16.79 million, although total net assets still declined slightly to $1.19 billion. More impressively, Spot XRP ETFs achieved record trading volumes despite the overall downtrend. Data from The Block shows that XRP ETFs saw their cumulative volume rise to $2.23 billion from $2.15 billion just one day after the $92.9 million daily outflow. Reports indicated that Bitwise’s XRP ETF had the highest trading volume at the time, followed by Grayscale’s GXRP, Franklin Templeton’s XRPZ, Canary’s XRPC, and 21Shares TOXR, in that order. In terms of total Assets Under Management (AUM), XRP ETFs declined slightly, falling from $1.48 billion to $1.32 billion following the January 29 outflow. XRP Price Continues Slide Amid Market Uncertainty While XRP ETFs are recovering from recent outflows, the cryptocurrency’s price continues to decline, extending its losses from earlier this year. According to CoinMarketCap, XRP has dropped by more than 11% over the past week and a little over 3% in the last 24 hours. Following this decline, its price now sits around $1.69, representing a more than 15% fall from its $2 level seen just a few weeks ago. Related Reading: Bitcoin’s Slide To $82K Sets Off A $1.7 Billion Chain Reaction XRP’s daily trading volume is also down by more than 26.6% at the time of writing, indicating a potential decline in trader confidence and growing uncertainty in the market. Supporting this trend, XRP’s Fear and Greed Index has fallen into the “Fear” zone. The broader crypto market is showing similar weakness, with the index signaling extreme fear across major digital assets. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|altcoins|crypto|cryptocurrency|etf|Ripple|xrp|XRP ETF|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57621094,
    "published": 1769886640000,
    "title": "Bitcoin crashes below $76K Strategy cost basis in $2B liquidation event",
    "body": "Bitcoin saw a sudden weekend liquidity cascade that took BTC price to near $75,000 for the first time since its April 2025 low.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57621043,
    "published": 1769886499000,
    "title": "BitMine Immersion faces $6B paper loss as Ether sell-off deepens",
    "body": "BitMine’s growing ETH losses highlight the risks of crypto treasury strategies as leverage unwinds and weak liquidity accelerates market downturns.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57622185,
    "published": 1769890308000,
    "title": "Bitcoin price slides to lowest level since 2025 tariff shock",
    "body": "Drop comes despite rally in gold and other precious metals as investors seek safety",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57622380,
    "published": 1769891400000,
    "title": "Bitcoin hashrate drops 12% in worst drawdown since China mining ban: CryptoQuant",
    "body": "A severe winter storm has forced US miners to curtail operations, dragging bitcoin’s hashrate, output and miner margins to their weakest levels in months.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Tech|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57622489,
    "published": 1769891716000,
    "title": "Crypto Crash: Liquidations Top $2.5 Billion as Bitcoin, Ethereum and XRP Prices Plummet",
    "body": "The crypto market's recent decline only accelerated Saturday, with Bitcoin falling to nearly $77,000 as liquidations piled up.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57623037,
    "published": 1769893733000,
    "title": "Michael Saylor’s bitcoin stack is officially underwater, but here’s why he likely won't reach for the panic button",
    "body": "The main impact of the price decline is slowing Strategy's ability to buy more bitcoin without diluting shareholders, as its stock now trades at a discount to its bitcoin holdings.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Michael Saylor|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]