[
  {
    "id": 58041508,
    "published": 1771124658000,
    "title": "Roundhill’s election event contract ETFs ‘potentially groundbreaking'",
    "body": "The ETF issuer warned investors that selecting the fund tied to the losing US presidential outcome could result in the loss of nearly all invested capital.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 58045464,
    "published": 1771136268000,
    "title": "Institutions may get 'fed up' and fire Bitcoin devs over quantum: VC",
    "body": "Bitcoin developers must address the quantum risks to Bitcoin fast to avoid a successful “corporate takeover,” according to venture capitalist Nic Carter.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58046720,
    "published": 1771139757000,
    "title": "Senators ask Bessent to probe $500M UAE stake in Trump-linked WLFI",
    "body": "Elizabeth Warren and Andy Kim call on Treasury’s Scott Bessent to review a UAE-backed investment in the Trump-linked crypto firm over national security concerns.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58048092,
    "published": 1771131623000,
    "title": "Solana Funding Rates Hit 17-Day Negative Streak — What This Means For Price",
    "body": "Solana (SOL) has been significantly affected by the bear market, reporting a price loss of 37.38% in the last 30 days alone. Despite the late price relief seen last week, the altcoin remains about 70% off its all-time high, reflecting the dominant selling activity of recent months. Notably, funding rates data suggest traders are yet to see an imminent end to this turmoil, as open interest positioning reflects strong conviction toward further downside. Related Reading: Solana Reclaims $80 Amid Friday Market Bounce – Analysts Set Next Targets Solana Bearish Funding Stretch Sets New Low In 2.5 Years Funding rates are periodic payments exchanged between traders in perpetual futures markets to keep the futures price aligned with the spot price of an asset. Funding rates show which side of the market is more crowded, buyers (longs) or sellers (shorts), and thus a good sentiment indicator. Negative funding rates suggest that short traders are dominant, with a higher percentage of market participants presently betting on a price fall. According to market analyst Ted Pillows, the Solana market has recorded a negative funding rate for 17 consecutive days, indicating that traders have been aggressively positioned on SOL for over two weeks. The market analyst explains that the bearish sentiment around Solana hasn’t touched these extremes in over 2.5 years. Therefore, this development is indicative of a sustained directional conviction and not regular market noise. However, there are two likely scenarios to develop from this concerning situation. Firstly, Solana may continue to bleed downward as spot buying pressure remains weak, combined with the sustained decline in macro risk appetite. On the other hand, the market might also experience a short squeeze marked by rapid upward price movement. This can be due to an exhaustion of selling pressure, after an overwhelming market majority opens short positions. In conclusion, while Solana traders and investors remain strongly bearish, there is still potential for reverse price moves to catch these overcrowded trades off guard. Related Reading: Bitcoin On-Chain Data Indicates High Volatility Ahead Following Post-CPI Reaction Solana Price Outlook At the time of writing, Solana trades at $88.01, reflecting a 3.81% gain in the last day. Meanwhile, the daily trading volume is down by 24.9% and valued at $2.89 billion. According to a renowned market analyst, Ali Martinez, data from the UTXO Realized Price Distribution (URPD) metric highlights key Solana price levels. While $85.55 was previously identified as a resistance zone, Solana’s move toward the $88 level suggests this region may now be flipping into a support area, reinforcing its importance as a short-term demand zone. Featured image from Nairametrics, chart from Tradingview",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Solana|altcoin|Solana Funding Rates|Solana URPD|SOLUSDT|Ted Pillows",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58054684,
    "published": 1771160403000,
    "title": "XRP Spotlighted In German Media With Bold $9 Projection",
    "body": "XRP has edged back above $1.40 after weeks of uneven trading, but some investors believe the quiet recovery could be the start of a longer story. Related Reading: Urgent Crypto Reform: Treasury Secretary Says The Clock Is Ticking The token was changing hands near $1.43 at last check, still far from past highs. While the broader crypto market remains cautious, fresh comments from a European investment executive have added fuel to longer-term price discussions. Bold Forecasts From A German Investor During a recent segment on Der Aktionär TV, Michel Oliver, head of Tokentus Investment AG, said XRP could reach between $7 and $9 in a future bull cycle. Based on reports, he tied that projection to growing institutional use of the network and what he sees as its expanding role in global payments. He argued that the token could serve as a core settlement asset if adoption continues at the current pace. Oliver pointed to infrastructure rather than short-term hype. According to him, the foundation is being laid through licensing wins and partnerships that could support larger transaction volumes over time. He stressed that such growth is unlikely to be fully realized in the current market phase, suggesting the bigger move may come after another reset in sentiment. 😳German news media says #XRP will be the backbone of the new financial system. Targets mentioned: ▫️ $7–$9 in the near term pic.twitter.com/u79obRShDL — BULLRUNNERS (@BullrunnersHQ) February 10, 2026 Licenses And Network Expansion Reports note that Ripple has secured more than 60 financial licenses worldwide, including an electronic money license in the United Kingdom. That approval allows the firm to operate certain regulated payment services in the region. The regulatory footprint has been expanding steadily, and that progress has been highlighted as a reason for long-term optimism. The base blockchain is called XRP Ledger. It was created to facilitate quick and cheap transactions. XRP is used to facilitate this. The assumption is that as more institutions are added to this ledger, this token could increase. The counterpoint to this is that this doesn’t necessarily translate to an increase in value. Currently, to go from this price to $9, it would be an increase of more than 500%. While this is possible, it has been done before. It requires a lot of money to come into this market. European Access Broadens Access to XRP has broadened within Europe. The crypto exchange Safello has increased access to XRP within more European Union countries. It has done this after receiving authorization under the Markets in Crypto-Assets framework. The exchange has supported XRP trading since December 2025. Related Reading: XRP Set To Dethrone Bitcoin Within 6 Years, Entrepreneur Says Greater availability can improve liquidity. It can also draw new participants into the market. Still, exchange listings alone rarely drive multi-hundred-percent gains. For now, XRP sits in a rebuilding phase. Some investors are watching licensing growth and ETF inflows as early signs of strength. Others remain cautious, noting that infrastructure progress must eventually show up in sustained demand. The coming cycles will determine whether the $7 to $9 range becomes a milestone or remains an ambitious forecast. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoin|bitcoin|crypto|Ripple|xrp|XRPL|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58055001,
    "published": 1771164000000,
    "title": "BlackRock's digital assets head: Leverage-driven volatility threatens bitcoin’s narrative",
    "body": "Rampant speculation on crypto derivatives platforms is fueling volatility and risking bitcoin’s image as a stable hedge, says BlackRock’s digital assets chief.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|BlackRock|Bitcoin (Currency)|Bitcoin ETF|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58059746,
    "published": 1771178462000,
    "title": "Her Divorce Was Ugly. Crypto Became a Lifeline",
    "body": "A mother in Texas said that crypto helped her overcome financial abuse.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58060935,
    "published": 1771182000000,
    "title": "Hong Kong is trying to build up its crypto regulations: State of Crypto",
    "body": "Several leaders in Hong Kong announced efforts to advance the region's regulatory environment.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|Newsletters|State of Crypto|Consensus Hong Kong 2026|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58060901,
    "published": 1771181752000,
    "title": "Michael Saylor signals another Bitcoin buy amid market rout",
    "body": "The purchase will mark week 12 of consecutive buys by Strategy, which continues accumulating BTC despite a sharp decline in the company's stock price.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58062051,
    "published": 1771185663000,
    "title": "OpenClaw Creator Gets Big Offers to Acquire AI Sensation—Will It Stay Open Source?",
    "body": "Peter Steinberger's open-source AI agent OpenClaw hit 180,000 GitHub stars and spawned MoltBook chaos. Now Meta and OpenAI want to buy it, but he's determined to keep it free.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58063239,
    "published": 1771189152000,
    "title": "Wall Street giant Apollo deepens crypto push with Morpho token deal",
    "body": "The asset manager overseeing more than $900 billion assets may buy up to 90 million MORPHO tokens as part of a partnership to support DeFi credit market, it said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|apollo global management|Morpho Protocol|DeFi|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]