[
  {
    "id": 55146144,
    "published": 1764498605000,
    "title": "XRP Price At A Critical Turning Point: Analyst Maps Out Simple Rules For Breakout",
    "body": "The monthly XRP chart has entered one of its most decisive phases in years, and one of the asset’s most vocal analysts is laying out a blunt roadmap. Egrag Crypto, known for his long-standing bullish stance on XRP, released a new technical update that breaks down the future outlook for the cryptocurrency into three straightforward outcomes. The chart accompanying his analysis shows XRP trading around the $2.20 region, sitting just above an important Fib support level but still wrestling with momentum, with the monthly candle about to close. Related Reading: 320 Ether On The Move: Bhutan Ramps Up Its Staking Game XRP Must Close Above $2.60 To Keep Bullish Momentum Intact Egrag’s first decisive level is at $2.60, which matches with the 0.5 Fibonacci retracement level on the monthly chart. The analyst described a close above this region as bullish but the asset would not yet be fully clear of danger. The chart shows XRP repeatedly testing this price level in the first half of the year before breaking above it in July. However, the most recent breakdown in Q2 2025 has now put the price level in focus again. The analysis becomes more aggressive once price action breaks above $3.40. EGRAG identified this as the 0.888 Fibonacci level, one of the final retracement zones. According to him, a close above this level confirms a super-bullish macro breakout, which he summarized with the phrase “we are so back.” The chart reinforces this idea by showing a tight compression beneath this upper 0.888 Fib cluster, and that a decisive breakout could lead to a rapid move into new all-time high prices if there’s enough buying pressure. XRP Price Chart. Source: @egragcrypto On X A Close Below 21 EMA Would Break Bullish Structure The downside scenario in Egrag’s breakdown is equally straightforward. He warned that a close below the 21-month EMA would mean a severe failure of the bullish trend structure. His wording was intentionally harsh, noting that such a breakdown would mean “we are f**ked, no sugar-coating it.” The chart shows the 21 EMA currently sitting around the $1.83-$1.90 price zone, forming the final major support on the monthly timeframe. Losing this level would drag XRP back into a deeper corrective zone and finally undo most of the price advancement made this year. A significant development showed up towards the end of the week that aligns with the bullish continuation Egrag outlined. 21Shares confirmed that its US Spot XRP ETF, which is listed under the ticker TOXR, has received SEC approval and will officially launch on Monday. Related Reading: Bitcoin’s November Slump Could Trigger A 2026 Revival, Analysts Say The upcoming launch adds a perspective that institutional participation in XRP is only beginning. If inflows follow the early strength seen from other issuers, the ETFs could reinforce the bullish case Egrag mapped on the chart, especially if the XRP price is able to cross above $2.60 in December. Featured image from Pixabay, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|crypto|crypto market|crypto news|cryptocurrency|digital currency|Ripple|xrp|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55097870,
    "published": 1764508794000,
    "title": "Bitcoin Braced For A Huge December Fed Game-Changer As $6.6 Trillion Flip Predicted To Trigger Price Shock",
    "body": "Some of the most bullish bitcoin and crypto speculators have said they expect a December Federal Reserve bombshell to power a bitcoin price boom...",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55151001,
    "published": 1764504056000,
    "title": "Bitcoin Miners Face A Harsh December: Rising BTC Difficulty, Falling Hashprice",
    "body": "According to CoinWarz, the next difficulty adjustment is expected at block 927,360, moving the target from 149 trillion to close to 150 trillion. That is a modest rise, but it matters because Bitcoin miners are already working with very thin margins. Hashpower is strong enough to push difficulty up even while returns stay near record lows. Related Reading: Bitcoin’s November Slump Could Trigger A 2026 Revival, Analysts Say Hashprice Sits Near Break-Even Hashrate Index data shows hashprice is hovering around $38.3 PH/s per day, a touch up from a recent trough below $35 PH/s on November 21. Reports indicate that $40 PH/s is roughly the break-even level for many operations. When revenue per petahash drifts under that mark, some miners face a hard choice as they usher in December: switch off rigs or keep paying to mine. Average block times have been close to the 10-minute goal, with the network recently averaging about 9.97 minutes, which helped trigger the most recent adjustment that dropped difficulty from 152.2 trillion to 149.3 trillion. Hardware, Politics And Supply Risks Reports have disclosed a US Department of Homeland Security probe into Bitmain, the China-based ASIC maker, over concerns its machines could be accessed remotely. Bitmain is reported to control about 80% of the ASIC market, according to the University of Cambridge. That market concentration leaves the industry vulnerable. If US officials impose restrictions, tariffs, or other limits, miners could face higher hardware costs and slower deliveries. Some equipment orders might be delayed or rerouted, and expansion plans would be tested. China Unlikely To End Bitcoin Mining Ban Despite Uptick Meanwhile, overseas, a mild uptick in China’s bitcoin mining has led some scholars to urge Beijing to relax its ban so miners can use excess energy, but experts say a formal reversal is unlikely. Related Reading: 320 Ether On The Move: Bhutan Ramps Up Its Staking Game According to Hashrate Index, China’s share of global hash rate rose from 13.75% in Q1 2025 to 14% in the current quarter, placing it third behind the US and Russia. Historical data from the Cambridge index shows China’s hash rate fell to zero in July 2021 before unofficial activity pushed it back to 22.29% by September 2021; Cambridge stopped updating its mining map in February 2022. Beijing has tightened rules on crypto in recent years, arguing such activity disrupts financial order and can enable illegal behavior. Experts believe those political and policy concerns make an official lift of the mining ban unlikely, despite the recent rise in activity. Featured image from Getty Images, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|btc|btcusd|crypto|hashprice|hashrate|mining China",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55151771,
    "published": 1764511200000,
    "title": "Ethereum Developers Prep for Fusaka, Second Upgrade of 2025",
    "body": "The goal of the upgrade is to enable Ethereum to handle the large transaction throughput from the layer-2 chains that use the blockchain as their base layer.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Ethereum News|Upgrade|Fusaka|layer 2|Fidelity|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55152676,
    "published": 1764512710000,
    "title": "'We Wear Your Loathing With Pride': Tether's Downgrade at S&P Sparks Online Battle",
    "body": "S&P Global last Wednesday slashed its rating on Tether's USDT stablecoin to its weakest score.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Tether|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55156414,
    "published": 1764518826000,
    "title": "Michael Saylor Sunday Change-Up Suggests New Announcement Coming Monday",
    "body": "The executive chairman of bitcoin treasury firm Strategy teased a switch from orange dots to green dots in what's become his routine cheeky Sunday X post.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|MicroStrategy|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55157319,
    "published": 1764520227000,
    "title": "Monad Price To Crash 99%? BitMEX Co-Founder Calls Protocol Another Berachain",
    "body": "The Layer 1 blockchain Monad has grabbed the headlines in the past few days following its successful launch earlier last week. MON, its native token, enjoyed a significant 80% surge on the back of the launch, hitting an all-time high of 0.048 on Wednesday, November 26. While the Monad protocol has enjoyed significant attention since going live, it appears that not everyone is confident in its potential adoption. Most notably, BitMEX co-founder Arthur Hayes has put forward a pessimistic outlook for the project, saying its token value could fall as much as 99%. Monad Has No Real Use Case: Hayes In a YouTube interview with Altcoin Daily, Hayes stated that any other Layer 1 blockchain besides Ethereum and Solana is “zero” and is not going to do very well. Using Monad as an example, the former BitMEX CEO described the protocol’s coin as another “high FDV, low-float” token. Related Reading: Solana Braces For A Dual-Test Setup – Here’s What Could Happen Next Hayes said that Monad is going to be the new “Berachain” and expects its native token’s value to fall by 99% after the initial jump. Berachain, which launched in February 2025, has its native token BERA trading beneath $1, nearly 94% beneath its all-time high of $14.83. As of this writing, the Monad token is valued at around $0.0285, reflecting an over 40% decline since hitting its all-time high on Wednesday. Hayes highlighted that every new project’s token often enjoys an early price spike before facing a deep correction, as there is usually no real use case to back up the initial growth. The crypto founder noted that it is a classic case of FOMO (fear of missing out), especially after the massive success of Ethereum. Hayes said in the interview: Every coin gets their first pump and people want to believe in the new L1. Everybody wants to invest in the new Ethereum like they would have in 2014 when everyone missed it. Me included. But again, that doesn’t mean it [Monad] is going to actually have any real use case. Moving forward, Hayes went on to pick a “magnificent five” of protocols currently in the cryptocurrency space, including Bitcoin, Ethereum, Solana, ZCash, and Ethena. If Not Layer 1s, What Next? It is little surprise that ZCash made it to the BitMEX co-founder’s list of top blockchain protocols. According to Hayes, ZCash and other privacy-focused coins—like Monero—will dominate the crypto narrative even more in the coming year. Related Reading: Ethereum Fusaka Will Be ‘The Most Bullish Upgrade’ Ever, Pundit Claims Additionally, Hayes mentioned that Zero Knowledge (ZK) proofs and quantum resistance are other crypto narratives to watch out for in 2026. Specifically, the crypto founder noted that the next winner in the crypto market over the next one to two years would come from the ZK space. Featured image from iStock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|Arthur Hayes|Berachain|MON|Monad|Monad price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55164254,
    "published": 1764531052000,
    "title": "BlackRock Exec Says Bitcoin ETFs Becoming A Major Revenue Source Was A ‘Big Surprise’",
    "body": "Spot Bitcoin ETFs (exchange-traded funds) are one of the biggest narratives and have been a game-changer in the cryptocurrency space in the past two years. With these investment products, people get to participate in the cryptocurrency market without having to directly own the digital assets. Interestingly, one of the biggest winners—that often gets overlooked—has been the issuers, especially as the crypto industry has seen increased institutional adoption since the Bitcoin ETFs launched. According to the firm’s executive, the BTC exchange-traded funds becoming the major source of revenue for BlackRock, the world’s largest asset manager, was not envisioned. BlackRock’s Bitcoin Funds Outweighing Expectations At the Blockchain Conference 2025 in São Paulo on Friday, November 28, BlackRock’s business development director in Brazil, Cristiano Castro, told reporters that the Bitcoin ETFs are the largest revenue source for their company. According to the executive, this development came as a “big surprise” to the asset management firm. Related Reading: Fed To End QT In December: Will Bitcoin Mirror The Massive Price Crash From Last Time? Castro said in a statement: We were very optimistic when we launched, but we didn’t believe it would reach such proportions. Just to give you an idea, it [IBIT in the US and IBIT39 in Brazil – the asset’s reference names] came very close to US$100 billion [in allocation]. This feat is notable for the Bitcoin ETFs, especially considering that BlackRock offers more than 1,400 exchange-traded products globally and has a whopping $13.4 trillion in assets under management. The US-based Bitcoin fund (with the IBIT ticker) has over $70.7 billion in net assets, becoming the first ETF to reach the $70-billion mark (doing so in June 2025). While the US Bitcoin ETF market has somewhat slowed down, BlackRock’s IBIT still continues to outpace other ETFs launched in recent years. As earlier reports suggested, IBIT had managed to generate roughly $245 million in annual fees as of October 2025. Bitcoin ETF Outflows ‘Perfectly Normal’ – Castro When asked about the recent outflows from BlackRock’s Bitcoin ETF as the market leader’s value fell, the director stated that there are zero surprises in that trend. “ETFs are very liquid and powerful instruments, and they serve precisely to allow people to allocate their capital and manage their cash flow,” Castro noted. The BlackRock director said that the withdrawals are expected, considering that the product is heavily owned by retail investors, who are reactionary in nature to price corrections. On Friday, the iShares Bitcoin Trust saw a net outflow of $113.72 million, bringing the weekly record to a negative $137.01 million and the fund to its fifth-consecutive week of withdrawals. Related Reading: The Bitcoin Price Crash To $41,000: There’s A Shark In The Water Featured image from Getty Images, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin ETFs|bitcoin price|BlackRock|btc|IBIT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55165823,
    "published": 1764533391000,
    "title": "Tether CEO slams S&P ratings agency and Influencers spreading USDt FUD",
    "body": "The comments followed S&P's downgrade of USDt's ability to maintain its peg, which cited Tether's Bitcoin and gold reserves as a concern.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55169066,
    "published": 1764538853000,
    "title": "Telegram's Pavel Durov: Cocoon decentralized AI network now live",
    "body": "The privacy-preserving decentralized AI platform is built on top of The Open Network, and users earn TON for renting out computing power.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 98,
        "NAME": "TON",
        "CATEGORY": "TON"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55175764,
    "published": 1764550388000,
    "title": "Bitcoin Plunges to Below $88,000 in Risk-Off Start to December",
    "body": "Cryptocurrencies fell sharply on Monday, bringing fresh momentum to a wide-ranging selloff that appeared to have settled.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55178476,
    "published": 1764554572000,
    "title": "Bitcoin crashes 5% in ‘Sunday slam’ as liquidations surge",
    "body": "Bitcoin plunged nearly 5% to $86,950 in Sunday trading, triggering $539 million in liquidations after the asset endured its worst November performance since 2018.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55179263,
    "published": 1764555972000,
    "title": "Asia Morning Briefing: Rising Japan Yields Hit Risk Assets as BTC Slides",
    "body": "Short-term Japanese yields reached their highest level since 2008, strengthening the yen and pressuring leveraged crypto positions during Hong Kong trading hours.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|btc|ETH|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55181357,
    "published": 1764558970000,
    "title": "Bitcoin Collapse Accelerates as Gains Vanish and Sellers Take Full Control",
    "body": "Bitcoin price started a fresh decline from $92,000. BTC is down over 5% and the bulls are struggling to keep the price above $86,500. Bitcoin started a fresh decline below the $90,000 zone. The price is trading below $88,000 and the 100 hourly Simple moving average. There was a break below a key bullish trend line with support at $89,500 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move down if it settles below the $86,500 zone. Bitcoin Price Dips Again Bitcoin price failed to settle above the $92,000 resistance zone and started a fresh decline . BTC dipped sharply below $90,500 and $90,000. There was a break below a key bullish trend line with support at $89,500 on the hourly chart of the BTC/USD pair. The pair even spiked below $87,500. A low was formed at $86,500 and the price is now consolidating losses below the 23.6% Fib retracement level of the downward move from the $91,928 swing high to the $86,500 low. Bitcoin is now trading below $90,000 and the 100 hourly Simple moving average . If the bulls remain in action, the price could attempt another increase. Immediate resistance is near the $87,850 level. The first key resistance is near the $89,200 level or the 50% Fib retracement level of the downward move from the $91,928 swing high to the $86,500 low. The next resistance could be $89,500. A close above the $89,500 resistance might send the price further higher. In the stated case, the price could rise and test the $90,650 resistance. Any more gains might send the price toward the $91,500 level. The next barrier for the bulls could be $92,000 and $92,500. More Losses In BTC? If Bitcoin fails to rise above the $87,800 resistance zone, it could start another decline. Immediate support is near the $86,500 level. The first major support is near the $86,000 level. The next support is now near the $85,500 zone. Any more losses might send the price toward the $83,500 support in the near term. The main support sits at $82,200, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $86,500, followed by $86,000. Major Resistance Levels – $87,800 and $89,200.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55181389,
    "published": 1764558762000,
    "title": "David Sacks calls NYT report on conflicts of interest a ‘nothing burger’",
    "body": "Donald Trump’s top crypto adviser, David Sacks, hit out at a New York Times report speculating how he could gain from his government role.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55182618,
    "published": 1764560612000,
    "title": "China To Intensify Crackdown on Virtual Currencies, Including Stablecoins: Report",
    "body": "Virtual currencies lack the legal status of fiat money, Chinese officials said during an intra-agency meeting on Friday.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|China|Beijing|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 55184759,
    "published": 1764563324000,
    "title": "Ethereum Dives Below $2,880 as Bears Tighten Their Grip on the Trend",
    "body": "Ethereum price started a fresh decline below $2,95 0. ETH is down over 5%, trading below $2,880, and might continue to move down. Ethereum started a fresh decline below $2,950 and $2,900. The price is trading below $2,880 and the 100-hourly Simple Moving Average. There was a break below a key bullish trend line with support at $2,990 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move down if it settles below the $2,800 zone. Ethereum Price Dips Over 5% Ethereum price failed to stay above $3,000 and started a fresh decline, like Bitcoin . ETH price declined below $2,880 to enter a bearish zone. There was a break below a key bullish trend line with support at $2,990 on the hourly chart of ETH/USD. The bears even pushed the price below $2,850. A low was formed at $2,815 and the price is showing bearish signs below the 23.6% Fib retracement level of the downward move from the $3,052 swing high to the $2,815 low. Ethereum price is now trading below $2,900 and the 100-hourly Simple Moving Average . If there is another upward move, the price could face resistance near the $2,880 level. The next key resistance is near the $2,940 level or the 50% Fib retracement level of the downward move from the $3,052 swing high to the $2,815 low. The first major resistance is near the $2,960 level. A clear move above the $2,960 resistance might send the price toward the $3,000 resistance. An upside break above the $3,000 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $3,050 resistance zone or even $3,150 in the near term. More Losses In ETH? If Ethereum fails to clear the $2,960 resistance, it could start a fresh decline. Initial support on the downside is near the $2,820 level. The first major support sits near the $2,800 zone. A clear move below the $2,800 support might push the price toward the $2,740 support. Any more losses might send the price toward the $2,720 region in the near term. The next key support sits at $2,650 and $2,620. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI – The RSI for ETH/USD is now below the 50 zone. Major Support Level – $2,800 Major Resistance Level – $2,940",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55186005,
    "published": 1764564854000,
    "title": "Dogecoin Slumps 9% Amid Bitcoin Weakness. Is a Larger Dump Coming?",
    "body": "The launch of DOGE ETFs from Grayscale and Bitwise saw only $2.16 million in inflows, failing to attract expected institutional interest.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55185816,
    "published": 1764564631000,
    "title": "Bitcoin's Monthly MACD Flashes Red: Echoes of Past Bear Markets",
    "body": "The key indicator's negative flip indicates downside volatility ahead.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Technical Analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55186991,
    "published": 1764565998000,
    "title": "Grayscale to launch US's first spot Chainlink ETF via trust conversion",
    "body": "Grayscale’s Chainlink ETF is expected to launch on Tuesday this week, marking the first spot LINK ETF to enter the US market.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55186483,
    "published": 1764565530000,
    "title": "Bitcoin Drop Ends Up Liquidating $500M Bullish Bets in Early Asia Trading",
    "body": "Binance, Hyperliquid, and Bybit saw over $160 million in liquidations each, with longs making up almost 90% of the total.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55187145,
    "published": 1764566302000,
    "title": "XRP Price Dips Under Crucial Support, Putting Spotlight on Lower Price Targets",
    "body": "XRP price started a fresh decline below $2.150. The price is now struggling and faces resistance near the $2.10 pivot level. XRP price started a fresh decline below the $2.150 zone. The price is now trading below $2.120 and the 100-hourly Simple Moving Average. There was a break below a key bullish trend line with support at $2.180 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move down if it settles below $2.00. XRP Price Dips Again XRP price attempted a recovery wave above $2.150 but failed to continue higher, like Bitcoin and Ethereum . The price started a fresh decline below $2.120 and $2.10. There was a move below the 50% Fib retracement level of the upward move from the $1.817 swing low to the $2.286 high. Besides, there was a break below a key bullish trend line with support at $2.180 on the hourly chart of the XRP/USD pair. The price is now trading below $2.10 and the 100-hourly Simple Moving Average. If there is a fresh upward move, the price might face resistance near the $2.080 level. The first major resistance is near the $2.10 level. A close above $2.10 could send the price to $2.120. The next hurdle sits at $2.150. A clear move above the $2.150 resistance might send the price toward the $2.20 resistance. Any more gains might send the price toward the $2.250 resistance. The next major hurdle for the bulls might be near $2.320. More Losses? If XRP fails to clear the $2.10 resistance zone, it could start a fresh decline. Initial support on the downside is near the $2.00 level or the 61.8% Fib retracement level of the upward move from the $1.817 swing low to the $2.286 high. The next major support is near the $1.9250 level. If there is a downside break and a close below the $1.9250 level, the price might continue to decline toward $1.850. The next major support sits near the $1.820 zone, below which the price could continue lower toward $1.80. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $2.00 and $1.9250. Major Resistance Levels – $2.10 and $2.120.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55189134,
    "published": 1764568565000,
    "title": "China reaffirms crypto ban after noticing ‘speculation has resurfaced’",
    "body": "The People’s Bank of China reasserted the country’s crypto ban, claiming trading had reemerged and vowed to crack down on stablecoins.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55188517,
    "published": 1764568082000,
    "title": "Dogecoin (DOGE) Turns Red Again — Are Traders Bracing for Deeper Declines?",
    "body": "Dogecoin started a fresh decline below the $0.150 zone against the US Dollar. DOGE is now consolidating losses and might face hurdles near $0.1420. DOGE price started a fresh decline below the $0.150 level. The price is trading below the $0.1450 level and the 100-hourly simple moving average. There was a break below a key bullish trend line with support at $0.1520 on the hourly chart of the DOGE/USD pair (data source from Kraken). The price could extend losses if it stays below $0.150 and $0.1450. Dogecoin Price Dips Again Dogecoin price started a fresh decline after it closed below $0.1520, like Bitcoin and Ethereum . DOGE declined below the $0.150 and $0.1450 support levels. More importantly, there was a break below a key bullish trend line with support at $0.1520 on the hourly chart of the DOGE/USD pair. The price even traded below $0.1380. A low was formed near $0.1369, and the price is now showing bearish signs below the 23.6% Fib retracement level of the downward move from the $0.1566 swing high to the $0.1369 low. Dogecoin price is now trading below the $0.1450 level and the 100-hourly simple moving average. If there is a recovery wave, immediate resistance on the upside is near the $0.1420 level. The first major resistance for the bulls could be near the $0.1465 level and the 50% Fib retracement level of the downward move from the $0.1566 swing high to the $0.1369 low. The next major resistance is near the $0.1490 level. A close above the $0.1490 resistance might send the price toward the $0.1520 resistance. Any more gains might send the price toward the $0.1550 level. The next major stop for the bulls might be $0.1620. More Losses In DOGE? If DOGE’s price fails to climb above the $0.1465 level, it could continue to move down. Initial support on the downside is near the $0.1370 level. The next major support is near the $0.1350 level. The main support sits at $0.1330. If there is a downside break below the $0.1330 support, the price could decline further. In the stated case, the price might slide toward the $0.1250 level or even $0.1240 in the near term. Technical Indicators Hourly MACD – The MACD for DOGE/USD is now gaining momentum in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for DOGE/USD is now below the 50 level. Major Support Levels – $0.1350 and $0.1250. Major Resistance Levels – $0.1420 and $0.1465.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "DOGE|DOGE news|Doge price|DOGE USD|DOGE/BTC|DOGE/USDT|Dogecoin|Dogecoin news|dogecoin price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55189308,
    "published": 1764569018000,
    "title": "Ripple Labs gets nod to expand payment activities in Singapore",
    "body": "Ripple has also made several acquisitions this year to expand its business and institutional-focused offerings, with the latest being crypto custody and wallet company Palisade.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55191700,
    "published": 1764572429000,
    "title": "This Analyst Predicted The PIPPIN Price Surge, Here’s The Rest Of The Prediction",
    "body": "Despite the bearish trend that has dominated the crypto market, the meme coin PIPPIN has stood out, flying green while others stalled. Over the weekend, the meme coin emerged as one of the top gainers, rising by more than 50% and doubling its value in only a few days. Interestingly, one crypto analyst had previously called out the PIPPIN rally, predicting that the price would rise. But even with the major rally so far, the analyst’s total prediction is yet to play out completely. The Breakout That Started It All In the analysis, Edoardo Telve points to the first breakout that began all of this for the PIPPIN price. This had come after the meme coin had suffered an extended accumulation range, which began back in March, lasting for seven months in total. This allowed the meme coin to form a structural bottom that allows for the kind of expansion that it has seen so far. Related Reading: Dogecoin ETFs Flat At Launch, But TA Points To $1 If This Support Holds Once the breakout began, the PIPPIN price began to destroy resistance after resistance, leading to what the analyst calls “ the cleanest, strongest bullish shift the chart has shown all year.” As a result, all of the resistances that had prevented true breakouts in the past have been promptly covered. Amid this, there have been a number of areas of interest that have emerged, and the price staying above them suggests that the bullish trend continues to hold. The analyst refers to these levels as the 4EMA cluster, ranging between $0.02, $0.03, and $0.05. As long as the price remains above these levels, it means that the PIPPIN will maintain its strong upward momentum. Where Is The PIPPIN Price Headed? So far, the PIPPIN price has expanded rapidly, rising over 400% in the last week. The Sunday rally saw it touch above $0.19, stopping just short of $0.2. Despite this impressive rally, the analyst says the best may be yet to come. Related Reading: XRP Price At A Critical Turning Point: Analyst Maps Out Simple Rules For Breakout Telve points to factors such as the rising volume, strong impulsive candles, and lack of sharp rejection wicks as indications that the current rally is being driven by buyers as opposed to this being a liquidity grab. The PIPPIN price has also put in higher lows and maintained support above key resistance levels, as well as holding above the 4EMA stack pointed out by the analyst. As the meme coin continues to maintain the current expansion phase, the analyst believes that $0.3-$0.32 remains the final target. Interestingly, this level is historically a large supply zone, suggesting that this is where the sell-offs might begin in full bloom. Featured image from Dall.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "meme coin|Meme coin news|meme coins|Meme coins news|PIPPIN|PIPPIN news|PIPPIN price|PIPPINUSD|PIPPINUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55192977,
    "published": 1764574182000,
    "title": "HashKey Leads Hong Kong’s Crypto Market as Losses Deepen Ahead of IPO",
    "body": "Ultra-low fees kept monetization in the basis-point range, leaving revenue unable to offset steep losses despite surging Hong Kong trading volumes.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|hashkey|Hong Kong|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 55194707,
    "published": 1764576368000,
    "title": "Bitcoin price slides to $85K: How low can BTC go in December?",
    "body": "Bitcoin opened the week in the red as fears of a Bank of Japan rate hike triggered a yen carry trade unwind, potentially risking a drop in BTC price to $67,000.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55195676,
    "published": 1764577827000,
    "title": "XRP Hit By Violent 59% Leverage Flush As Speculators Slam The Brakes",
    "body": "XRP’s derivatives market has undergone a marked regime shift, with leverage collapsing and funding normalising in a way that signals a clear retreat from aggressive speculative positioning. The strongest evidence comes from Glassnode’s latest post on November 30, which frames the current phase as a structural, not merely tactical, pause in XRP leverage. XRP Derivatives Unwind Accelerates “XRP’s futures OI has fallen from 1.7B XRP in early October to 0.7B XRP (~59% flush-out). Paired with the funding rate dropping from ~0.01% to 0.001% (7D-SMA), 10/10 marked a structural pause in XRP speculators’ appetite to bet aggressively on upside,” Glassnode’s CryptoVizArt wrote on X. Open interest at 1.7 billion XRP in early October reflected a heavily leveraged market, with large notional positions stacked in futures and perpetuals. The subsequent collapse to 0.7 billion XRP implies that around one billion XRP of derivatives exposure has been closed, liquidated, or otherwise unwound. Such a reduction is not just a marginal trimming of risk; it is a wholesale deleveraging that strips out a large part of the speculative layer sitting on top of the spot market. Related Reading: XRP Flashes ‘Classic Accumulation Sign’ — Major Breakout Soon? The funding-rate move is equally telling. A 7-day SMA around 0.01% had previously indicated a consistent long bias, with traders willing to pay a recurring fee to maintain leveraged upside exposure. The compression to roughly 0.001% pushes funding close to neutral. In perpetual futures, that transition typically occurs when demand for leveraged longs fades and the market no longer tolerates a meaningful premium to hold long positions. Glassnode’s description of October 10 crash as the point that “marked a structural pause” captures this shift in regime: the market moved from persistent long crowding to a far more cautious, balanced stance. The November 30 post sits on top of a broader context Glassnode has been documenting through November. Related Reading: Analyst Teases $7.50 XRP Moonshot But Only After A Final Flush In November 8, the firm highlighted how profit taking has behaved during the recent drawdown: “Unlike previous profit realization waves that aligned with rallies, since late September, as XRP fell from $3.09 (~25%) to $2.30, profit realization volume (7D-SMA) surged by ~240%, from $65M/day to $220M/day. This divergence underscores distribution into weakness, not strength.” Rather than de-risking into strength, profitable holders have been realizing gains as price fell, reinforcing the deleveraging signalled by futures data. On November 17, Glassnode turned to supply dynamics, noting that “the share of XRP supply in profit has fallen to 58.5%, the lowest since Nov 2024, when price was $0.53. Today, despite trading ~4× higher ($2.15), 41.5% of supply (~26.5B XRP) sits in loss — a clear sign of a top-heavy and structurally fragile market dominated by late buyers.” Those on-chain figures provide the background to the 30 November derivatives snapshot: a market whose ownership is skewed toward late entrants now sits on substantial unrealized losses, while the leverage that previously amplified upside has been largely flushed. Taken together, Glassnode’s data on futures open interest and funding rates crystallise the current state of XRP: a violent 59% leverage reset, a near-neutral funding regime, and a speculative cohort that has stepped back from paying for upside, all layered on top of a top-heavy holder base. At press time, XRP traded at $2.04. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP News|glassnode|xrp|xrp news|XRP On-Chain Analysis|XRP On-Chain Data|XRP Price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55195564,
    "published": 1764577523000,
    "title": "Crypto payments coming to PlayStation as Sony plans stablecoin launch in 2026",
    "body": "Sony Bank is reportedly pursuing a US license and partnering with Bastion as it develops a 2026 dollar stablecoin connected to its growing Web3 unit, BlockBloom.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 55195847,
    "published": 1764578086000,
    "title": "Best Crypto to Buy Now as Bitcoin Hyper’s Presale Races Toward the $30M Milestone",
    "body": "What to Know: Bitcoin’s base layer still struggles with slow transactions, high fees, and limited programmability, creating a gap between its narrative and everyday usability. As demand for high-throughput DeFi and dApps grows, users increasingly expect instant confirmations and low fees, even when interacting with Bitcoin-linked assets. Bitcoin Hyper plans to introduce a Bitcoin Layer-2 with SVM integration, aiming to deliver faster-than-Solana performance while preserving Bitcoin’s settlement security. By combining low-latency execution, SVM-based smart contracts, and Rust tooling, Bitcoin Hyper targets wrapped $BTC payments, DeFi, NFTs, and gaming on a Bitcoin-secured backbone. Bitcoin’s narrative is shifting again. After a decade of proving itself as pristine collateral and macro hedge, attention is swinging back to utility: payments that actually feel instant, and apps that don’t grind to a halt when demand spikes. Yet on the base layer, Bitcoin still moves slowly, with limited capacity of just seven transactions per second, and no native smart contracts. That mismatch is becoming harder to ignore as users experience sub-second confirmations and near-zero fees on newer chains. When you can move assets cheaply and interact with DeFi in real time elsewhere, waiting minutes for a Bitcoin transaction feels like a relic from another era. The demand is clear: keep Bitcoin’s battle-tested security, but upgrade the experience. ⚙️ This is where Bitcoin Hyper ($HYPER) enters the scene. The project positions itself as a Bitcoin Layer-2 that integrates the Solana Virtual Machine (SVM), promising Solana-style performance anchored to Bitcoin’s trust layer. If it works, Bitcoin-native dApps stop being theory and start being everyday tools. And the $HYPER presale structure doubles down on that thesis. With a staged price schedule and a $28.8M+ raise, early conviction is rewarded: those stepping in now are effectively betting that Bitcoin Hyper can become a go-to hub for high-speed, Bitcoin-backed DeFi and dApps, not just another speculative token. ➡️ Discover more about this Layer-2 project in our comprehensive Bitcoin Hyper review. Bitcoin Hyper Aims to Turn $BTC Into a High-Speed dApp Platform Bitcoin Hyper pitches a straightforward value proposition: turn Bitcoin from a slow settlement rail into a high-throughput environment where you can pay, trade, lend, and game at speeds that compete with top Layer-1s. Instead of fighting Bitcoin’s limitations, it will route activity to a Layer-2 execution environment while anchoring security back to the main chain. By integrating the SVM, Bitcoin Hyper aims to deliver faster performance than Solana itself for many use cases, while still treating $BTC as the core asset in the ecosystem. That means high-speed payments in wrapped $BTC with low fees, plus DeFi primitives – like swaps, lending, and staking – that feel responsive rather than congested. The project also targets builders with a Rust-based SDK and API support for NFT platforms and gaming dApps, giving developers a familiar toolkit while tapping into Bitcoin’s liquidity. The early traction is notable: the presale has already raised $28.8M, signaling that the market sees potential in a Bitcoin Layer-2 that targets Solana-level speed. ➡️ Check out our guide to buying Bitcoin Hyper if you plan to join the presale. $HYPER’s Presale Momentum Signals Rising Confidence For Bitcoin holders tired of choosing between security and usability, Bitcoin Hyper offers a different trade-off: keep $BTC at the center, but get Solana-style speed and dApp depth. And as the presale races toward the $30M milestone, it’s securing investors and liquidity to entrench that position. The presale’s pricing, early staking incentives, and clear focus on SVM-powered performance give $HYPER a differentiated pitch in a crowded market. Bitcoin Hyper currently costs $0.013355 per token and dynamic staking at 40% APY right now. According to our Bitcoin Hyper price prediction, $HYPER has the potential to end 2026 at $0.08625 – that’s a ~546% ROI on today’s price. Looking further ahead, $HYPER could reach $0.253 by 2030, a significant ~1,794% ROI. That upside scenario assumes the project becomes a leading venue for Bitcoin-native DeFi and high-throughput applications, not just another experimental scaling play. 🐳 Momentum indicators are starting to line up with that thesis. Smart money is moving, with high-net-worth wallets joining the presale. Whale buys of $502.6K and $379.9K have contributed to $HYPER’s $28.8M-strong presale. Combined with 40% staking APY and rewards geared toward active governance, the tokenomics are clearly designed to favor early, engaged participants. Bitcoin Hyper’s rise as a candidate for best crypto to buy now reflects a deeper shift in the market: users want Bitcoin’s credibility paired with modern UX. If Bitcoin Hyper can bridge that gap between store-of-value and everyday utility and deliver on its promise of extremely low-latency execution, fast smart contracts, and a growing catalog of dApps, it could become a natural hub for Bitcoin-native activity. 🚀 Join the $HYPER presale before the next price increase. Disclaimer: This article is for informational purposes only and does not constitute financial, investment, or trading advice of any kind. Always do your own research before making any investment decision. Authored by Aaron Walker, NewsBTC – https://www.newsbtc.com/news/best-crypto-to-buy-now-as-bitcoin-hyper-presale-nears-30m",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55197598,
    "published": 1764580551000,
    "title": "$50K BTC price crash 'inevitable:' 5 things to know in Bitcoin this week",
    "body": "Bitcoin gained fresh BTC price crash predictions as it fell to $85,000 in flash volatility at the monthly close thanks to a lack of liquidity.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55197631,
    "published": 1764574309000,
    "title": "Why China’s Bitcoin mining activity is surging again after a 4-year crackdown",
    "body": "Bitcoin mining in China is rising again. From dominance to ban to resurgence, this makes an engaging story.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]