[
  {
    "id": 58544324,
    "published": 1772159312000,
    "title": "Bitcoin Price Consolidates Above Support, Breakout Hopes Strengthen",
    "body": "Bitcoin price started a decent increase above $68,000. BTC is now consolidating above $66,250 and might aim for more gains above $68,800. Bitcoin started a fresh increase after it settled above the $67,200 support. The price is trading above $67,200 and the 100 hourly simple moving average. There is a new bearish trend line forming with resistance at $68,000 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might dip again if it trades below the $66,500 and $66,250 levels. Bitcoin Price Dips To Support Bitcoin price managed to form a base above the $66,500 zone. BTC started a fresh increase and was able to surpass the $68,000 resistance zone. The price even rallied above the $68,800 resistance. Finally, the bears appeared near $70,000. A high was formed at $70,000, and the price recently corrected some gains. There was a move below the 38.2% Fib retracement level of the upward move from the $62,500 swing low to the $70,000 high. Bitcoin is now trading above $67,000 and the 100 hourly simple moving average . If the price remains stable above $67,000, it could attempt a fresh increase. Immediate resistance is near the $68,000 level. There is also a new bearish trend line forming with resistance at $68,000 on the hourly chart of the BTC/USD pair. The first key resistance is near the $68,250 level. A close above the $68,250 resistance might send the price further higher. In the stated case, the price could rise and test the $69,500 resistance. Any more gains might send the price toward the $70,000 level. The next barrier for the bulls could be $70,500 and $71,200. Downside Continuation In BTC? If Bitcoin fails to rise above the $68,000 resistance zone, it could start another decline. Immediate support is near the $67,000 level. The first major support is near the $66,250 level or the 50% Fib retracement level of the upward move from the $62,500 swing low to the $70,000 high. The next support is now near the $65,500 zone. Any more losses might send the price toward the $65,000 support in the near term. The main support now sits at $63,500, below which BTC might struggle to recover in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $67,000, followed by $66,500. Major Resistance Levels – $68,000 and $68,500.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58544404,
    "published": 1772159077000,
    "title": "Bitcoin’s 100 BTC club edges toward 20K wallets in a ‘bullish sign’",
    "body": "Santiment highlighted that just seven more wallets are needed to reach 20,000 holding at least 100 Bitcoin each, amid ongoing market uncertainty.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58545297,
    "published": 1772161217000,
    "title": "Aave Crosses $1 Trillion In Loans — No Bank Required",
    "body": "It started as an idea. Now it processes more lending volume than most people will ever see in a lifetime. Aave, the decentralized finance protocol that lets users borrow and deposit crypto without going through a traditional bank, has crossed $1 trillion in total cumulative lending — a milestone that has never been reached by any other protocol in the DeFi industry. Related Reading: Is Bitcoin The Poor Man’s Hedge Against Inflation? Coinbase CEO Thinks So From A 2017 Startup To A Trillion-Dollar Lending Machine Aave was not always called Aave. Its founder, Stani Kulechov, first launched the platform under the name ETHLend in November 2017 before rebranding it in September 2018. What began as a small peer-to-peer lending experiment on the Ethereum blockchain has grown into the dominant force in decentralized lending, with over $27 billion in total user funds currently secured on the platform. Aave crossed $1 trillion all-time loans. A first in DeFi history. pic.twitter.com/9zMKhtGq6R — Aave (@aave) February 25, 2026 Over the past 30 days alone, Aave generated more than $83 million in fees — nearly four times more than its nearest competitor, Morpho. Other well-known lending platforms including JustLend, SparkLend, Maple, and Compound Finance each hold over $1 billion in total value locked, but none come close to matching Aave’s scale. “A decade ago, DeFi and Aave didn’t exist. They were just ideas. Today, Aave stands as the backbone of onchain lending, powering a new financial system that is open, global, and unstoppable,” Kulechov said in a post on X following the announcement. His longer-term ambitions are even bigger. Kulechov has said he wants Aave to become the largest and most efficient liquidity network on the planet — one that banks, builders, and financial technology companies connect to by default. Big Finance Names Are Already At The Table Aave is no longer just for crypto enthusiasts. In August last year, Aave Labs launched a new product called Aave Horizon, a lending market built on Ethereum and designed specifically for traditional financial institutions. Related Reading: Peter Schiff Says Bitcoin Has Never Beaten Gold Since 2021 The idea is to allow established finance firms to borrow stablecoins using real-world assets as collateral. According to reports, VanEck, WisdomTree, and Securitize were among the first major institutions to participate in the offering — a sign that the gap between conventional finance and decentralized protocols is narrowing. Kulechov has also been vocal about what he sees as the next big opportunity for DeFi lending. Reports say he believes that tokenizing what he calls “abundance assets” — things like solar energy infrastructure, battery storage systems, and robotics used in labor — could open an entirely new category of collateral for decentralized lending. He expects those types of assets to be worth a combined $50 trillion by 2050. Featured image from BTCCard, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|aave|altcoins|bitcoin|crypto|DeFi|ethereum|Stablecoins",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58545346,
    "published": 1772161257000,
    "title": "MARA Shares Rise After Bitcoin Miner Strikes AI Data Center Deal",
    "body": "The Bitcoin miner moved to convert U.S. sites into AI-ready campuses, though analysts say confirmed tenants will be key.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58545915,
    "published": 1772162305000,
    "title": "Ethereum Price Signals Fresh Rally Attempt, Traders Watch Key Levels",
    "body": "Ethereum price started a major rally above the $2,020 resistance. ETH is now consolidating gains and might aim for another increase above $2,050. Ethereum started a fresh upward move above the $1,980 zone. The price is trading above $2,000 and the 100-hourly Simple Moving Average. There is a new bearish trend line forming with resistance at $2,040 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh decline if it stays below the $2,080 zone. Ethereum Price Dips To Support Ethereum price managed to form a base and traded above the $1,950 resistance, like Bitcoin . ETH price rallied above the $2,020 and $2,050 resistance levels. The bulls even pumped the price above $2,120. A high was formed at $2,158 before there was a downside correction . The price dipped below $2,000 and tested the 50% Fib retracement level of the upward move from the $1,792 swing low to the $2,158 high before the bulls appeared. Ethereum price is now trading above $2,020 and the 100-hourly Simple Moving Average. If the bulls remain in action above $1,975, the price could attempt another increase. Immediate resistance is seen near the $2,040 level and the trend line. The first key resistance is near the $2,080 level. The next major resistance is near the $2,120 level. A clear move above the $2,120 resistance might send the price toward the $2,155 resistance. An upside break above the $2,155 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $2,220 resistance zone or even $2,250 in the near term. Downside Continuation In ETH? If Ethereum fails to clear the $2,040 resistance, it could start a fresh decline. Initial support on the downside is near the $2,000 level. The first major support sits near the $1,975 zone. A clear move below the $1,975 support might push the price toward the $1,935 support or the 61.8% Fib retracement level of the upward move from the $1,792 swing low to the $2,158 high. Any more losses might send the price toward the $1,900 region. The main support could be $1,880. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI – The RSI for ETH/USD is now above the 50 zone. Major Support Level – $1,975 Major Resistance Level – $2,080",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58546637,
    "published": 1772163524000,
    "title": "Ransomware incidents up 50% in 2025 as payments stay flat",
    "body": "A new Chainalysis report suggests ransomware attackers are \"working harder for diminishing returns\" as regulatory pressure and refusals to pay have hurt ransom proceeds.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58549462,
    "published": 1772168937000,
    "title": "Solana (SOL) Upside Builds, $100 Breakout Hopes Strengthen Across Market",
    "body": "Solana started a fresh increase above the $82 zone. SOL price is now consolidating above $85 and might aim for more gains above the $95 zone. SOL price started a fresh upward move above the $82 and $85 levels against the US Dollar. The price is now trading above $82 and the 100-hourly simple moving average. There was a break above a bearish trend line with resistance at $87 on the hourly chart of the SOL/USD pair (data source from Kraken). The pair could extend gains if it clears the $88 resistance zone. Solana Price Regains Traction Solana price started a decent increase after it settled above the $82 zone, like Bitcoin and Ethereum . SOL climbed above the $85 level to enter a short-term positive zone. The price even smashed the $88 resistance. The bulls were able to push the price above $90. A high was formed at $92, and the price is now consolidating gains. There was a minor decline below the 23.6% Fib retracement level of the recent upward move from the $75.64 swing low to the $92.05 high. Recently, there was a break above a bearish trend line with resistance at $87 on the hourly chart of the SOL/USD pair. Solana is now trading above $85 and the 100-hourly simple moving average. On the upside, the price is facing resistance near $88. The next major resistance is near the $92 level. The main resistance could be $95. A successful close above the $95 resistance zone could set the pace for another steady increase. The next key resistance is $100. Any more gains might send the price toward the $106 level. Downside Correction In SOL? If SOL fails to rise above the $88 resistance, it could start another decline. Initial support on the downside is near the $85.50 zone. The first major support is near the $84 level or the 50% Fib retracement level of the recent upward move from the $75.64 swing low to the $92.05 high. A break below the $84 level might send the price toward the $82 support zone. If there is a close below the $82 support, the price could decline toward the $78 support in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is gaining pace in the bullish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is above the 50 level. Major Support Levels – $85.50 and $84.00 Major Resistance Levels – $88 and $95.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Technical analysis|Sol|Solana|solbtc|SOLUSD|SOLUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58550520,
    "published": 1772170917000,
    "title": "Elizabeth Warren, OCC Chief Spar Over Trump-Linked Crypto Bank Bid",
    "body": "Warren called WLFI's charter bid the \"most disgraceful\" corruption scandal, with the OCC's chief quick to defend the regulator's processes.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 58550726,
    "published": 1772170997000,
    "title": "Polymarket bettors appear to have insider-traded on a market designed to catch insider traders",
    "body": "At least 12 wallets collectively made over $1 million betting on the outcome of ZachXBT's investigation before the findings went public, with one trader turning a $0.14 average entry on shares into $411,000 in profit.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 58551663,
    "published": 1772172983000,
    "title": "XRPL Foundation patches ‘critical' flaw that almost made it to mainnet",
    "body": "The AI bug hunter scanned the Ripple blockchain codebase to catch the vulnerability before it was deployed, enabling engineers to patch it.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      },
      {
        "TYPE": "122",
        "ID": 218,
        "NAME": "SECURITY INCIDENTS",
        "CATEGORY": "SECURITY INCIDENTS"
      }
    ]
  },
  {
    "id": 58551661,
    "published": 1772172865000,
    "title": "Two arrested after South Korean cops lost $1.4M in Bitcoin",
    "body": "Local police seized the Bitcoin in 2021 but stored it in a third-party wallet that was later compromised, with the theft going unnoticed for four years.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58553100,
    "published": 1772175600000,
    "title": "Ethereum’s Fate Hangs On This Multi-Year Support – Recovery Or Deeper Pullback Next?",
    "body": "As the end of the month approaches, Ethereum (ETH) is attempting to end February above the crucial $2,000 barrier. Some analysts have suggested that the upcoming monthly close could determine the fate of the King of Altcoin’s price trajectory. Related Reading: XRP Rally Incoming? Analyst Forecasts March-April Recovery If This Level Breaks Ethereum Trajectory Could Be Defined This Weekend On Thursday, Ethereum briefly fell from its recent highs and retested the $1,980 level before bouncing. Notably, the cryptocurrency surged 11% on Wednesday morning, reaching a ten-day high of $2,148, then stabilized around the crucial $2,000 support. Amid this rebound, market observer Trader Tardigrade highlighted that ETH has momentarily reclaimed a critical monthly level, which had been lost in the shorter timeframes. The King of Altcoins is trading back above its multi-year trendline, suggesting that a potential price recovery rally could be coming if the level holds. Per the post, Ethereum “has a proven pattern: every time price holds above this ascending support trendline, it launches into a parabolic rally.” As the chart shows, the cryptocurrency displayed a similar trendline between 2018 and 2020, when the altcoin bounced from this support and embarked on a massive one-year rally toward its previous all-time high (ATH). Now, ETH shows a similar performance in the monthly timeframe, currently retesting the trendline that began forming in 2022. “If it holds here, history says we’re gearing up for another explosive climb,” the trader affirmed. Similarly, analyst Rekt Capital noted that this multi-year trendline has been “a structural level that has defined the broader macro trajectory for several years.” He stated that if Ethereum ends the month above this trendline, located around the $1,960-$1,970 area, “then price would have scope to rebound into the green region overhead,” between the $2,250-$2,500 levels. However, he warned that this key horizontal region has historically “not been kind to Ethereum across cycles.” Deeper Correction In The Books? Explaining ETH’s previous behavior around this level, Rekt Capital detailed that in 2022, once the price broke below this horizontal region in the monthly timeframe, it continued lower. Meanwhile, Ethereum closed below this level again in early 2025, retested it, turned it into resistance, and resumed its correction toward the April 2025 lows around $1,385. “So structurally, the green region remains a likely candidate for resistance unless Ethereum Monthly Closes above it and successfully turns it into support,” the analyst affirmed, cautioning that it seems less likely given the current bear market conditions. Moreover, he warned that if ETH Monthly Closes below the multi-year support trendline, the $1,570-$1,670 horizontal zone, which was a prior demand cluster, could be revisited. Related Reading: The ‘Next-Generation Trading Chain’: BNB Chain Eyes 2026 Optimization Following Strong Ecosystem Momentum “We have already seen downside wicking toward that orange region, but not a clean, picture-perfect retest. Losing the trendline would likely force price into that orange region more decisively and potentially even result in its loss as support,” he added. As Rekt Capital stressed, if a macro uptrend is lost, there is limited buy-side momentum to support the price against further downside over time. As of this writing, ETH is trading at $2,026, a 4.7% increase in the weekly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|crypto analyst|Crypto bear market|crypto market correction|Crypto Market Recovery|Crypto trader|ETH|ETH breakdown|ETH correction|ethereum|Ethereum Bear Market|Ethereum Breakout|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58556392,
    "published": 1772181473000,
    "title": "Bitcoin miner MARA posts $1.7B quarterly loss on BTC slump",
    "body": "MARA reported a $1.71 billion quarterly loss as Bitcoin fair‑value markdowns hit earnings, and the company laid out a major push into AI and high‑performance compute.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58558423,
    "published": 1772185289000,
    "title": "Spot Bitcoin ETFs take in $1B in three days as investors buy the dip",
    "body": "SoSoValue data shows a three-day reversal after weeks of withdrawals, with BlackRock’s IBIT leading inflows.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58559374,
    "published": 1772187167000,
    "title": "Jack Dorsey Bets Block's Future On AI, Cuts Nearly Half Its Workforce",
    "body": "The fintech company behind Square and Cash App is slashing more than 4,000 jobs as AI has made that many people redundant. Wall Street agrees.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58559094,
    "published": 1772186704000,
    "title": "U.S. spot bitcoin ETFs set for biggest week in 6 after adding $1.1 billion in three days",
    "body": "The inflows coincide with a rebound in the Coinbase Premium index, signaling renewed U.S. demand.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Coinbase Premium|Bitcoin ETF|ETFs|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58559650,
    "published": 1772187568000,
    "title": "Suspected insider wallets rack up $1.2M betting on ZachXBT’s Axiom exposé",
    "body": "The top eight wallets on Polymarket netted over $1.2 million by betting on ZachXBT’s investigation into Axiom, raising insider trading concerns among blockchain researchers.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 58559590,
    "published": 1772187556000,
    "title": "Germany's AllUnity issues regulated stablecoin tied to safe haven Swiss franc",
    "body": "The debut comes as major banks and analysts predict major appreciation in the Swiss currency.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Switzerland|Stablecoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 58559946,
    "published": 1772188260000,
    "title": "Jane Street Lawsuit Fuels Late Double-Digit Pop in Terra Luna Classic",
    "body": "LUNC's price jump follows a lawsuit filed Monday by Terraform Labs’ bankruptcy administrator, boosted by spot-buying and a short squeeze.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "terra-luna-classic|Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 35,
        "NAME": "LUNC",
        "CATEGORY": "LUNC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 58559922,
    "published": 1772188217000,
    "title": "Ethereum Flashes Early Reversal Signal As Taker Ratio Turns",
    "body": "A shift in Ethereum’s derivatives flow on Binance is starting to hint at a possible change in market structure, even as ETH itself remains in a corrective phase. According to CryptoQuant contributor Darkfost, the Taker Buy Sell Ratio is no longer flashing the same persistent sell-side aggression that dominated as the asset pushed toward a new all-time high. Darkfost argues that the indicator offers a useful read on who is pressing harder in the futures market. “This indicator is effective for assessing directional dominance between market buy and sell orders executed on futures contracts. A ratio above 1 indicates buyer dominance, while a ratio below 1 suggests that selling aggressiveness is prevailing within transactional flows.” Ethereum Shows Fresh Bullish Shift That distinction mattered during Ethereum’s run toward record levels. In that period, Darkfost said, selling pressure in the futures market intensified at the same time, keeping the ratio consistently below its equilibrium level of 1. On Binance, the monthly Taker Buy Sell Ratio fell to 0.95, while the weekly average dropped even further to 0.92, pointing to a market where aggressive sellers were controlling the flow. Related Reading: Ethereum DeFi Warning: Vitalik Flags Oracles As A Hidden Time Bomb The backdrop is significant because derivatives now sit at the center of crypto price formation. Darkfost noted that the derivatives market accounts for nearly $65 billion in volume and plays a leading role in price discovery, making order-flow analysis increasingly important for reading the market beneath headline price action. In that context, a ratio stuck below 1 was more than a minor technical detail; it suggested that upside conditions were being undermined by persistent futures-led selling pressure. What makes the current setup more interesting is that the flow data has begun to improve before any obvious reversal in Ethereum’s spot chart. “On Binance, the weekly ratio has been hovering around the neutral threshold for the past two weeks. This shift is particularly notable as it diverges from ETH price action, which remains in a corrective phase. Daily spikes above 1.12 have even been recorded, reflecting episodes of aggressive market buying.” Related Reading: The $2,000 Fault Line: Why Ethereum’s Record Volatility Signals An Imminent Explosion That divergence is the core of the thesis. While ETH has yet to fully reflect it in price, the behavior of takers in the futures market is no longer uniformly defensive. The monthly average has also started to recover, climbing back to around 0.99. That still falls just short of clear buyer dominance, but it marks a meaningful improvement from the earlier stretch of sub-1 readings. Darkfost stops well short of calling a confirmed reversal. “Although this configuration still requires confirmation, it constitutes a constructive signal. A sustained move above 1 would mark a transition toward buyer dominance, potentially supporting a more favorable market dynamic for ETH in the short to medium term.” For now, the signal is less about declaring the correction over than about identifying a change in pressure. If the ratio can hold near neutral and then push decisively above 1, it would suggest that the market driving price discovery is beginning to lean back toward buyers. At press time, ETH traded at $2,028. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ETH news|eth price|ethereum|ethereum news|Ethereum On-Chain Data|ethereum price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58561905,
    "published": 1772190993000,
    "title": "UK Gambling Watchdog to Weigh Allowing Punters to Pay in Crypto",
    "body": "The UK Gambling Commission plans to explore permitting gamblers to pay for their bets with cryptocurrencies as Britain moves toward adopting digital-asset regulations.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58561955,
    "published": 1772191800000,
    "title": "Tether’s New Market Value Would Make Its Top Shareholder Richer Than Warren Buffett",
    "body": "Recent secondary market transactions reveal that stablecoin giant Tether may now be valued as high as $375 billion, potentially vaulting its secretive owners into the highest ranks of the world’s richest.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|Billionaires|/worlds-billionaires|Money|/money|Daily Cover|daily-cover|Editors' Pick|editors-pick|premium",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58562498,
    "published": 1772192949000,
    "title": "Bitcoin falls with ether, solana while decred, AI-linked tokens advance",
    "body": "Positioning in futures and options shows traders looking to protect against further declines.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Crypto Markets Today|Altcoins|Derivatives|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58562420,
    "published": 1772192797000,
    "title": "New York judge blocks Binance bid to force US crypto claims into arbitration",
    "body": "The ruling keeps pre‑2019 investor claims in open court and rejects Binance’s bid to send the dispute to private arbitration in Singapore.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58564543,
    "published": 1772196719000,
    "title": "Morning Minute: Jack Dorsey Slashes 40% of Block's Jobs Due to AI",
    "body": "Citrini warned everyone that these AI layoffs were coming, and it seems Jack Dorsey took their warning to heart and chose to act first.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Opinion",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58564846,
    "published": 1772197240000,
    "title": "Expert Trader Who Correctly Predicted Bitcoin Top Just Shared A Chart Pointing Below $4,000",
    "body": "Expert trader Tony Severino, who correctly predicted Bitcoin’s top, has raised the possibility of a crash to $4,000. This comes as BTC continues to struggle to break key resistance levels, signaling that it could be at risk of a deeper decline. Expert Trader Raises Potential Bitcoin Drop To $4,000 In an X post, Tony Severino questioned the possibility that the next Bitcoin bull market is a lower high followed by a lower low. His accompanying chart showed BTC may be forming a Head-and-Shoulder pattern, which could spark a crash to $4,000. As such, he urged market participants to play the range and cycles. Related Reading: Bitcoin 5TH Wave Is Not Over Yet, And Price Could Still Crash To $52,000; Analyst Warns When asked about a potential bottom for Bitcoin in this bear market, the expert trader said it’s more speculative because the idea of a bottom can change over time. However, he noted that BTC is bottoming now on shorter timeframes and that on the longest timeframes, it could still take a while. Severino also recently stated that he expects a maximum drawdown of around 72% for Bitcoin in this cycle, implying a bottom at around $34,000. Veteran trader Peter Brandt has also predicted that Bitcoin could drop to as low as $40,000 before it finds a bottom. Notably, BTC continues to struggle, suggesting it remains at risk of a deeper decline despite the recent relief rally to $70,000. In an X post, on-chain analytics platform Glassnode noted that profit-taking continues to absorb momentum at the $70,000 threshold. The platform added that this pattern is consistent with a thin-liquidity regime, in which even modest realization events are sufficient to suppress recovery attempts. How BTC Could Drop To $30,000 In This Bear Market Crypto analyst Willy Woo stated that Bitcoin has only ever existed in a secular global macro bull market between 2009 and 2026. He warned that if the global macro breaks down, then the $30,000 level is the fallback level of support. The analyst highlighted $16,000 as the final line to maintain BTC’s bull trend. Related Reading: Elliot Wave Analyst Predicts Bitcoin Price Will Crash In Final Move, What’s The Target? However, Willy Woo believes $45,000 would be a typical bear-market bottom for Bitcoin. He noted that this bearish sell-off by investors appears to have been exhausted, which may allow the price to consolidate sideways for a month and possibly rebound to the mid $70,000 range. However, this level would likely be rejected. The analyst explained that this is because the broader regime is heavily bearish, with both spot and futures liquidity deteriorating. Willy Woo predicts that Q4 would be a good time for the end of the bearish trend and that Q1 or Q2 2027 would be an appropriate time for bullish momentum to return. At the time of writing, the Bitcoin price is trading at around $67,800, down in the last 24 hours, according to data from CoinMarketCap. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT|CoinMarketCap|glassnode|Head and Shoulder Pattern|Peter Brandt|Tony Severino|willy woo",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58566520,
    "published": 1772200415000,
    "title": "DC Scam Center Strike Force Crypto Seizures, Freezes Hit $580M",
    "body": "The seizures target Southeast Asian networks operating “pig butchering” scams from compounds in Burma, Cambodia and Laos.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58567130,
    "published": 1772201413000,
    "title": "Bitcoin threatens new breakdown as US PPI sends gold to 1-month high",
    "body": "Hotter US PPI inflation data boosted precious metals but punished Bitcoin bulls, with BTC price downside nearing 3% on the day.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58567076,
    "published": 1772201176000,
    "title": "South Korea’s tax office leaks wallet seed and loses $4.8M in seized tokens",
    "body": "South Korea’s National Tax Service reportedly published a wallet seed phrase in a press release, with tokens worth $4.8 million swiftly drained in the latest custody blunder for authorities.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      }
    ]
  },
  {
    "id": 58566789,
    "published": 1772200800000,
    "title": "PayPal, MoonPay and M0 launch PYUSDx to let app devs create their own stablecoins",
    "body": "PYUSDx lets developers issue app-specific stablecoins backed by PayPal USD with fast launch, cross-chain support and branded token options.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 191,
        "NAME": "PYUSD",
        "CATEGORY": "PYUSD"
      }
    ]
  },
  {
    "id": 58567766,
    "published": 1772202611000,
    "title": "Fidelity Thinks Bitcoin May Be Leaving Its 80% Crashes Behind",
    "body": "Fidelity Digital Assets argues Bitcoin’s market structure has shifted enough that the familiar four-year boom-bust pattern and the brutal 80% drawdowns that often followed, may no longer be the default outcome. In a Feb. 24 research note titled “Is Bitcoin’s Four-Year Cycle Over?” research analyst Zack Wainwright frames the call around a simple observation: Bitcoin is now a very different-sized asset with a very different buyer base. Fidelity pegs Bitcoin’s market cap at an all-time high of roughly $2.5 trillion as of October 2025, alongside signs of deeper liquidity and a steadier volatility regime than prior cycles. “As bitcoin matures, price behavior is diverging from previous cycles. Volatility decreasing even as price reached new highs above $126,000.” Bitcoin Demand Is Being Re-Shaped Fidelity’s volatility argument leans on one-year realized volatility and how it behaved around cycle peaks. In prior cycles, the pattern was broadly consistent: volatility would compress into new lows ahead of a major upside move toward new highs, then expand as the cycle overheated. Related Reading: Bitcoin Yet To See Meaningful Capital Return, Glassnode Says This time, Fidelity says the compression is arriving sooner after the peak. The note points to 17 new all-time lows in one-year realized volatility logged in January 2026—just months after Bitcoin notched fresh all-time highs in October 2025—calling it a meaningful divergence from the cadence of earlier cycles. The team attributes part of that dampening to scale: Bitcoin is about twice the market cap it was at the 2021 peak, roughly 10x 2017’s peak, and over 200x 2013’s. The second pillar is who is holding supply, and how sticky that demand appears. Fidelity highlights a cohort of 49 public companies holding more than 1,000 BTC each, with combined holdings above 1 million BTC, over 5% of circulating supply. It also notes that, since Q1 2020, this group increased holdings quarter-over-quarter in every quarter except Q2 2022, when Tesla sold a large portion of its position. On the ETF side, Fidelity writes that US spot Bitcoin ETFs launched in January 2024 and collectively held nearly 1.3 million BTC as of Jan. 30, 2026, about 6.4% of circulating supply. The note adds that the category leader surpassed $75 billion in assets under management in under two years, contrasting that pace with gold’s flagship ETF, GLD, which took nearly seven years to reach the same milestone. Together, Fidelity says public companies and ETFs now hold nearly 12% of circulating supply, with most of the growth coming after 2023—a demand shift the team views as structurally important for drawdowns. Related Reading: Bitcoin Spot Volumes Sink To 2024 Lows As Coinbase Selling Pressure Eases Fidelity also argues the cycle has looked “notably stable” across several on-chain and issuance-linked measures. Using a profit-window framework, when addresses in profit first exceed 95% through the last time they remain above 95%, the note says MVRV has stayed roughly around two times realized value through most of the bull market, rather than spiking toward four-to-six times as in earlier cycles. The report flags a counterfactual to illustrate the point: if market cap reached four times realized cap in this cycle, it would imply roughly a $4.5 trillion market cap and about $225,000 per BTC as of Feb. 2, 2026. It also notes the Puell Multiple has stayed close to one, signaling daily issuance value hasn’t meaningfully deviated from its one-year average. Fidelity’s new “Profit to Volatility Ratio” is where the drawdown claim becomes explicit. The team sets 0.01 as a stability line and says the ratio has stayed above 0.015 since late 2023, the longest sustained period at those levels in Bitcoin’s history. Even with a February 2026 downturn that pushed BTC below $70,000, the ratio remained above the threshold. “A measurement above 0.01 can be considered very stable. Conversely, a measurement below 0.01 should be viewed with caution.” The implication, Fidelity suggests, is not that volatility disappears—but that the classic cycle-ending wipeouts may be less likely in a market increasingly shaped by institutional channels and a larger, more liquid base. If that regime holds, the next phase could look less like a blow-off top and more like a slower, more methodical repricing, higher over time, but with fewer cliff-edge resets. At press time, BTC traded at $66,677. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|fidelity",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 62,
        "NAME": "ZRX",
        "CATEGORY": "ZRX"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58568434,
    "published": 1772203705000,
    "title": "Amazon, Nvidia Flood OpenAI With Cash as ChatGPT Maker’s Valuation Hits $730 Billion",
    "body": "OpenAI just secured $110 billion in fresh investment, and announced additional collaborations with two of the big backers.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 58569109,
    "published": 1772197547000,
    "title": "Online Broker XTB Says Poland’s Crypto Gridlock Risks Expansion",
    "body": "Fast-growing trading platform XTB SA said its expansion plans are at risk from Poland’s political deadlock over regulating crypto assets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58569483,
    "published": 1772205421000,
    "title": "Bitcoin Sinks Towards $65,000 as Inflation Douses Risk Appetite",
    "body": "Bitcoin tumbled back toward $65,000 Friday after investors reduced risk following the release of stronger-than-expected inflation data that damped expectations for near-term Federal Reserve rate cuts.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58570955,
    "published": 1772208032000,
    "title": "Bitcoin Nears Major Milestone As 100 BTC Wallets Approach Record Levels",
    "body": "As market participants focus on short-term price movements, Bitcoin is approaching a notable on-chain milestone, with the number of wallets holding at least 100 BTC climbing toward record levels. This growing concentration of high-value holdings reflects increasing accumulation by large investors, and is viewed as a sign of strong long-term confidence in the world’s leading cryptocurrency. How Large Holders Influence Bitcoin’s Market Cycles Bitcoin is approaching a major milestone, with the number of wallet addresses holding at least 100 BTC set to surpass 20,000. An on-chain analytics firm, Santiment, highlighted on X that at current market valuations, a wallet holding 100 BTC or more is valued at roughly $6.78 million, indicating these addresses are largely controlled by high-net-worth individuals, funds, long-term holders, and institutional participants. Related Reading: Bitcoin Holders Underwater As Supply In Loss Spikes, Reaching Historic Extremes When the number of 100+ BTC wallets increases during or shortly after price declines, as it has been recently, it can be considered a bullish signal. While the number of whale wallets is rising, the overall percentage of BTC supply held by key stakeholders has not meaningfully increased. This helps explain why prices have remained suppressed. However, the growth in 100+ BTC wallets indicates broader distribution among large holders rather than a small group controlling the consolidation. In that sense, it points to less extreme consolidation at the very top. At the same time, it also shows that wealth is clearly migrating from smaller retail wallets into stronger hands. This does not signal decentralization at the smallest ownership level, but it does show that more separate entities are reaching the whale status. Historically, expanding whale wallet counts have often appeared during accumulation phases that later support the price recoveries. For a stronger structural shift to occur, the increase in wallet numbers would need to be matched by a rise in the overall supply they control. That dynamic typically unfolds as retail participants slowly sell off their coins to larger wallets. Meanwhile, history has shown that if retail traders eventually panic-sell or take profit too early, it might lead to the absorption stage. Is This A True Rebound Or A Dead Bounce? Bitcoin adoption is picking up pace across the sector. According to ETF analyst Eric Balchunas, Bitcoin Spot Exchange-Traded Funds (ETFs) just recorded their strongest day, pulling in roughly $500 million in a single day, reaching $750 million over the past two days combined at the time the report was published. Related Reading: Engine Stalled: How The $8 Billion ‘October Shock’ Left Bitcoin’s Spot Market In A Liquidity Trap Balchunas views the inflows as “a hitter in a slump going yard,” suggesting the market had been in urgent need of a catalyst after a prolonged period of weak performance. The strong back-to-back inflows have helped ease pressure on the sector, pushing year-to-date ETF outflows to under $2 billion. Despite the sharp turnaround, uncertainty remains about whether the inflow spike represents the beginning of a sustained recovery or merely a temporary bounce. Featured image from Pngtree, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin large holders|Bitcoin news|bitcoin price|Bitcoin Spot Exchange-Traded Funds|btc|BTC news|btc price|btcusd|BTCUSDT|Eric Balchunas|ETFs|Santiment",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58571009,
    "published": 1772208005000,
    "title": "Barclays probes blockchain for banking functions like payments, deposits: Report",
    "body": "The UK lender is reportedly seeking a technology partner to support blockchain-based payments and deposits as stablecoin adoption accelerates across finance and Big Tech.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      }
    ]
  },
  {
    "id": 58571812,
    "published": 1772209533000,
    "title": "Barclays looks for tech provider for new blockchain settlement engine: Bloomberg",
    "body": "The U.K. bank would rival JPMorgan and others in using decentralized technology for banking services.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Barclays|Blockchain|payments|Tokenization|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      }
    ]
  },
  {
    "id": 58572365,
    "published": 1772210357000,
    "title": "Minnesota Weighs Total Ban on Bitcoin and Crypto ATMs",
    "body": "Minnesota lawmakers are considering a ban on Bitcoin and crypto ATMs, with legislation introduced in response to a growing number of scams.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58573384,
    "published": 1772212150000,
    "title": "Bitcoin' rebound cancelled as U.S. stocks fall, gold surges, amid mounting macro risks",
    "body": "Between credit stress concerns, a hot PPI inflation reading, and tensions between U.S. and Iran, investors have plenty of reasons to stay away from risk assets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Market Wrap|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58573852,
    "published": 1772212620000,
    "title": "Minnesota to weigh ban on crypto kiosks after scam reports",
    "body": "Representative Erin Koegel proposed a total ban on crypto ATMs in Minnesota, building on a 2024 state law that imposed restrictions on kiosk operators.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58574210,
    "published": 1772213440000,
    "title": "Crypto Trader Predicts Solana 50% Price Crash To $30 If This Level Breaks",
    "body": "Solana (SOL) could be facing one of its most critical technical tests in recent months, with crypto trader Jussy warning that a breakdown at a key level could trigger a collapse toward prices not seen since previous bear market cycles. With the cryptocurrency trading above this level and forming two bearish patterns across multiple timeframes, the analyst has set two major crash targets for SOL. However, only one of these patterns could lead to a staggering 50% decline to $30 once the price breaks. Solana Bear Flag Pattern Signals Crash To $30 On Tuesday, February 24, Jussy took to X, warning crypto investors and traders that Solana could be heading toward a dramatic price collapse. The analyst notes that the leading smart contract token is currently at a critical support level of $76.57 on the price chart that could define its next bearish move. Related Reading: Wondering What’s Going On With Solana? Projects Are Taking Massive Hit As Price Plunges Looking at the daily chart, Jussy has identified a Bear Flag formation that has been developing since early February 2026. The pattern shows price consolidating within a descending channel after a steep sell-off from above $112, underscoring Solana’s continued downtrend over the past months. Should the $76.57 support level give way, the analyst projects a measured move from the Bear Flag pattern to $37.88, representing a potential decline of more than 50% from current levels. Jussy also said in his analysis that Solana is on a path to $30, suggesting the altcoin could fall even further to that level. Notably, the analyst’s bearish forecast arrives amid Solana’s recent price struggles, as broader market volatility and shifting investor sentiment weigh heavily on the sector. With the crypto bear market already in full swing, SOL has been trading sideways, mirroring the weak performance across major cryptocurrencies, including Bitcoin. CoinMarketCap’s data also shows that Solana’s price has fallen by more than 38% since the start of the year. While it was trending downward just last week, the altcoin has since staged a slight recovery from the $76 level, highlighted in Jussy’s chart analysis. As of writing, SOL is trading above $86, up more than 13% from the critical support level. Should upward momentum persist, it could signal a potential deviation from the analyst’s bearish $30 forecast. Triple Top Pattern Signals Lesser Decline To $60 For his second bearish forecast, Jussy highlighted that Solana has formed a Triple Top pattern on its four-hour chart. This pattern is characterized by three successive failed attempts to push higher, with each one printing at a lower peak than the last. The structure, visible across the January and February price action, suggests buyers have been steadily losing momentum after each recovery attempt. Related Reading: Here’s Why The Bitcoin, Ethereum, And Solana Prices Are Still Crashing Hard If the $76.57 support level breaks, Jussy sees a measured move from the Triple Top pattern down to $61.73 as Solana’s next target. A drop to this level would represent a roughly 19% crash from the support area. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Solana|altcoin|Bear Flag Formation|bitcoin|CoinMarketCap|Jussy|Sol|SOL news|SOL Price|Solana news|Solana Price|SOLUSD|SOLUSDT|Triple top pattern",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58574905,
    "published": 1772214267000,
    "title": "Figure Technology stock crashes 20% following mixed Q4 earnings",
    "body": "The blockchain-based lending platform beat revenue estimates but fell short on earnings, even as annual profit reached $134 million.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      }
    ]
  },
  {
    "id": 58569800,
    "published": 1772205991000,
    "title": "Bitcoin to $30K? Analysts debate when and at what price BTC will bottom",
    "body": "Several analysts forecast Bitcoin extending its bear market into late 2026, with potential cycle lows of $30,000 to $45,000 backed by rising exchange reserves.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Market Analysis",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58577412,
    "published": 1772218819000,
    "title": "XRP Emerging As Safe Haven? CEO Points To Steady Inflows As BTC, ETH Struggle",
    "body": "Most crypto funds have been losing investors lately. XRP hasn’t gotten that memo. While Bitcoin and Ethereum exchange-traded funds have faced weeks of steady outflows, XRP-linked products have quietly been doing something different — attracting fresh money even on the market’s worst days. Related Reading: Is Bitcoin The Poor Man’s Hedge Against Inflation? Coinbase CEO Thinks So XRP Takes Half Of All New Altcoin ETF Money According to Canary Capital CEO Steven McClurg, XRP is capturing roughly 50% of all new capital flowing into altcoin ETFs. That’s a commanding share of a market that includes several competing assets. Solana comes in second, drawing around 30% of fresh inflows, while Hedera accounts for the remaining 20%. McClurg made the comments publicly, pointing to XRP’s staying power at a time when investor confidence across the broader crypto market has been shaky at best. The numbers behind that claim are hard to dismiss. Reports show that so far this month, XRP ETFs have recorded negative flow days on just three occasions. Bitcoin ETFs, by comparison, have posted outflows on nine separate trading sessions during the same period. That gap tells a story about where some investors are choosing to put — or keep — their money right now. 🚨 BREAKING: Canary Capital CEO just dropped something the market isn’t ready for.$XRP quietly absorbing capital while BTC & ETH see outflows. Even on red days. Even when Bitcoin ETFs bled. 😎 https://t.co/MrCwbmUnPC pic.twitter.com/xEAMaMm80e — Xaif Crypto🇮🇳|🇺🇸 (@Xaif_Crypto) February 25, 2026 Last week offered perhaps the clearest snapshot of this divide. Bitcoin and Ethereum investment products together shed $250 million in outflows. XRP, meanwhile, pulled in $3.5 million. Modest in size, but striking given the conditions surrounding it. Steady Inflows Since Launch Reports say XRP ETFs got off to a strong start when the first spot product was listed on Nasdaq in mid-November last year. From that point through January 7, 2026, inflows came in consistently without a single day of net outflows — an unbroken streak that lasted nearly two months. That first outflow day in January was an exception to an otherwise clean run. Since then, XRP funds have largely held their footing while competing products struggled. The cumulative result of that run: $1.24 billion in total net inflows, with assets under management now sitting at a little over $1 billion. Among the individual products, the Canary XRP ETF leads with $280 million in net assets. Bitwise’s XRP ETF trails narrowly at $278 million — a gap thin enough that the rankings could easily shift with a few strong trading days. Bitcoin and Ethereum ETFs have faced sustained selling pressure for months. New buyers have been hard to come by. XRP funds stepping into that environment and continuing to attract capital — rather than lose it — is a departure from what most of the market has been experiencing. Related Reading: Aave Crosses $1 Trillion In Loans — No Bank Required A Shift In Where Investors Are Looking Reports from Canary Capital suggest the pattern reflects something more than short-term trading behavior. Investors appear to be reallocating toward assets they see as having specific utility, with XRP’s established role in cross-border payments drawing attention from both institutional and retail buyers. Featured image from Vecteezy, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|bitcoin|btc|Canary Capital|crypto|ETFs|ethereum|xrp|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58577411,
    "published": 1772218702000,
    "title": "Magic Eden Pulls Plug on Bitcoin and Ethereum Support, Doubles Down on Solana",
    "body": "Magic Eden is pulling support for Ethereum-compatible and Bitcoin-based assets, marking an end to its multi-chain approach to user adoption.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||NFTs",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58578209,
    "published": 1772219958000,
    "title": "Citi and Morgan Stanley expand bitcoin and crypto custody, trading and tokenization efforts",
    "body": "As Citi integrates Bitcoin into bank-grade custody and reporting frameworks, Morgan Stanley moves to bring crypto trading, lending exploration and tokenized products to mainstream wealth clients.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Citigroup|Morgan Stanley|Bitcoin News|Cryptocurrency|Wall Street|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58579360,
    "published": 1772221893000,
    "title": "US DOJ seized and froze $580M in crypto from ‘Chinese transnational criminals‘",
    "body": "The seizures and freezing over three months were conducted by the District of Columbia’s Scam Center Strike Force, established by US Attorney Jeanine Pirro in November.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58580719,
    "published": 1772224063000,
    "title": "Traders may rotate into Bitcoin if UBS’ bearish US stocks view comes true",
    "body": "A UBS report dinged US stocks for being “overvalued” suggesting that better investment opportunities exist outside of US markets. Is this the next rally catalyst for Bitcoin?",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Market Analysis",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58580297,
    "published": 1772223331000,
    "title": "Alchemy introduces autonomous payment rails for AI agents on Base",
    "body": "The system enables AI agents to automatically pay for blockchain data and compute credits in USDC, as autonomous crypto applications gain traction.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 100,
        "NAME": "USDC",
        "CATEGORY": "USDC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58581282,
    "published": 1772225091000,
    "title": "Senate Democrats Lead Inquiry Into Binance: Warren Heads Effort With Letter To DOJ",
    "body": "Cryptocurrency exchange Binance is once again facing mounting scrutiny in Washington, as lawmakers question whether the company is living up to the terms of its 2023 settlement with US authorities — an agreement that ultimately led to the resignation of its founder and former CEO, Changpeng Zhao (CZ). Democrats Urge DOJ And Treasury Investigation On Friday, journalist Eleanor Terrett of Crypto In America reported that eleven Democrats on the Senate Banking Committee, led by crypto-skeptic Elizabeth Warren, sent a letter to Attorney General Pam Bondi and Treasury Secretary Scott Bessent urging their departments to examine Binance’s operations. Related Reading: Jane Street Faces New Lawsuit: Trump Media Calls For Federal Investigation The lawmakers pointed to recent media reports alleging illicit finance activity on the platform, including transactions reportedly linked to Iran, and warned that such conduct could place Binance in violation of its 2023 settlement. In their letter, the senators also referenced Binance’s expanding business relationships with President Donald Trump’s crypto ventures, as well as Trump’s pardon of Zhao. They called for what they described as a “thorough, impartial” investigation into whether the exchange is adhering to its legal obligations. The latest pressure follows a separate inquiry launched earlier in the week. As previously reported by Bitcoinist, Democratic Senator Richard Blumenthal initiated a formal probe through the Senate’s Permanent Subcommittee on Investigations. Binance Denies Sanctions Violations In a letter dated February 24 and addressed to Binance co-CEO Richard Teng, Blumenthal cited reporting that suggested the exchange may have facilitated “large-scale violations” of US and international sanctions on Iran. Related Reading: Circle Tops Q4 Revenue Forecasts, Shares Surge 30% — Key Numbers Inside Blumenthal noted that Binance appeared to ignore warnings and recommendations aimed at reducing Iranian money laundering operations. He also referred to the same reports cited by the Senate banking committee Democrats, indicating that $1.7 billion in transactions to Iran may have passed through the platform. Binance has strongly denied the allegations. The company said it conducted an internal review and found “no evidence of violations of applicable sanctions laws.” The exchange also rejected claims that it had dismissed investigators for raising concerns related to sanctions compliance. Featured image from OpenArt, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|Binance|binance news|Binance settlement|BNB|BNB Price|bnbusdt|crypto|crypto market|crypto news|cryptocurrency|US crypto regulation",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58583162,
    "published": 1772228112000,
    "title": "Coinbase’s head of litigation says states are “gaslighting” on prediction markets",
    "body": "Ryan VanGrack says states are misrepresenting federal law as they move to block prediction markets.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "CoinDesk News|Media Network Interview|Coinbase|Prediction Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58583845,
    "published": 1772229248000,
    "title": "Banking Giant Barclays Mulls Crypto Payments Push: Bloomberg",
    "body": "Publicly traded banking giant Barclays is considering making a push into crypto payments and deposits, according to a report from Bloomberg.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58584460,
    "published": 1772230168000,
    "title": "Trump Orders Federal Agencies to Dump 'Woke' Anthropic AI After Pentagon Dispute",
    "body": "President Trump gave government agencies six months to phase out Anthropic's products after a clash over military safeguards.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 58584428,
    "published": 1772230118000,
    "title": "U.S. Senate Democrats asked Treasury, DOJ to probe Binance's illicit finance controls",
    "body": "Nine lawmakers asked the federal agencies to investigate the global crypto exchange after reports of potential funding channeled to terrorist groups.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Binance|Elizabeth Warren|Donald Trump|illicit finance|U.S. Department of Justice|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58584101,
    "published": 1772229640000,
    "title": "Are Institutions Killing Bitcoin And Ethereum? Here’s How They’ve Fared Since Companies Got Involved",
    "body": "Institutional capital has transformed the cryptocurrency market dynamics, changing who participates and how digital assets are traded. The arrival of spot exchange-traded funds, corporate treasury allocations, and access through major brokerage platforms has pulled Bitcoin and Ethereum deeper into traditional finance. Vanguard, for instance, reversed its long-held anti-crypto stance just a few months ago, allowing trading in funds that hold Bitcoin, Ethereum, XRP, and Solana. However, talking about bad timing, these cryptocurrencies have struggled in the months following that policy change. Challenging Months For Institutional Investors The entrance of major asset managers such as BlackRock and Fidelity Investments was a structural turning point for Bitcoin. The January 2024 launch of Spot Bitcoin ETFs in the United States opened the door for pension funds, registered investment advisors, and other conservative capital pools to gain exposure without directly holding Bitcoin. These ETFs have accumulated billions of dollars in inflows, with custodians now holding a meaningful share of Bitcoin’s circulating supply. Related Reading: Here’s All You Need To Know About The Bitcoin Price This Week However, the past few months have been really challenging for investors. Notably, the last month of inflows into Spot Bitcoin ETFs was in October 2025, when it was pushing to new all-time highs above $126,000. Since then, it has been months of net outflows, and this has weighed down on Bitcoin’s price action. Same goes for Spot Ethereum ETFs, which recorded consecutive months of outflows since November 2025. Vanguard clients are likely among those feeling the impact most directly. In December 2025, US-based investment management company Vanguard reversed its anti-crypto stance and started allowing trading of ETFs and mutual funds that hold Bitcoin, Ethereum, XRP, and Solana. The availability of these crypto products on a major mainstream brokerage like Vanguard was a milestone for crypto investing. Vanguard manages over $12 trillion in assets and serves tens of millions of investors. Unsurprisingly, the price action of Bitcoin and other top cryptocurrencies initially reacted positively to the Vanguard news. However, the timing coincided with a downturn across the entire crypto market, which has been having a red 2026 so far. Since Vanguard’s rollout, Bitcoin’s price has fallen by about 30%, while Ethereum, Solana, and XRP have fallen by about 40% in the same period. Is Institutional Involvement A Threat Or A Sign Of Maturity? It is clear that institutional entry has not erased the volatile nature of crypto markets. Bitcoin and Ethereum are still subject to swings in investor risk appetite, although this is now at a larger scale. Therefore, the question of whether institutions are killing Bitcoin and Ethereum is based on perspective. Related Reading: Why Investors Are Not Buying Bitcoin And Ethereum Despite ‘Low’ Prices The presence of regulated ETFs means that downturns are now absorbed by a wider set of market participants. Companies like BitMine and Strategy are still in the business of huge purchases. New investor bases like this can help sustain prices over time. However, one thing is clear: cryptocurrencies like Bitcoin, Ethereum, XRP, and Solana are no longer fringe assets operating outside the traditional investment system; they now sit within it. This integration will even become more clear once the CLARITY Act is passed in the US. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|Bitcoin news|bitcoin price|BitMine|BlackRock|btc|BTC news|btc price|btcusd|BTCUSDT|CLARITY Act|ETH|ethereum|Solana|spot Bitcoin ETFs|Spot Ethereum ETFs|Strategy|Vanguard|xrp",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58586280,
    "published": 1772233253000,
    "title": "XRP Daily Liquidity Is Pointing To A Rally To $4, Analyst Explains What’s Going On",
    "body": "XRP’s liquidity structure on higher timeframes is in a situation where the path of least resistance could extend to the $4 level. The remark came from crypto analyst Bird in response to hourly and daily liquidity heatmaps shared by Cryptoinsightuk, which show a clear contrast between short-term and higher-timeframe liquidity positioning. At the time of writing, XRP is trading around $1.45, still below the large liquidity clusters visible above the current price. According to Bird, that imbalance may not stay unresolved for long. Hourly Liquidity Cleared, Short-Term Volatility Reduced XRP’s liquidity heatmap on the hourly candlestick chart shows that much of the nearby liquidity below the current price has already been swept. The visible clusters around the $1.30-$1.50 range have all been cleared, meaning that the short-term stop hunts and liquidation pools have largely been cleared out. Related Reading: Analyst Predicts Bitcoin Price Surge To $500,000 As Ribbon Fractal Emerges According to Bird, this trend shows that hourly XRP liquidity is basically gone. This means there is less immediate incentive for XRP to stay around current levels on lower timeframes. When short-term liquidity dries up like this, the outlook is that the price will gravitate to areas where larger pools are untouched. Since the nearby liquidity has already been taken, the next logical target is now where there are larger concentrations of resting orders. As noted by the analyst, these resting orders are stacked all the way up past $4. XRP Hourly Liquidity. Source: @Cryptoinsightuk on X Daily Liquidity Stacked Above $4 Liquidity on the daily heatmap appears layered and dense above the current price, stretching through multiple resistance bands and extending above the $4 price level. The upper regions show heavy trading activity and visible liquidity clusters between $2.50 and $4.00, which is a reflection of a thick concentration of stop orders and resting interest. Related Reading: Bitcoin Final Sell-Off Coming? Analyst Says It’s Time To ‘Buckle Up’ In liquidity-based trading theory, price action is often drawn to areas where there are large position orders, especially when those zones have not yet been tapped. Bird described this higher-timeframe liquidity as stacked all the way up past $4, with the notion that the higher-timeframe liquidity is sitting there like a magnet. XRP Daily Liquidity. Source: @Cryptoinsightuk on X Bird also referenced a five-month breakdown in Bitcoin dominance. At the time of writing, the Bitcoin dominance is at 57.9%, down from 58.2% last week. This means Bitcoin has been steadily losing dominance. A decline in dominance is always due to capital rotation into altcoins. If that trend continues, XRP could easily become one of the best beneficiaries, particularly given its visible higher-timeframe liquidity targets. The analyst also noted that sentiment has not yet reached extreme lows. XRP, in particular, has maintained a relatively positive positioning among investors compared to other cryptocurrencies like Bitcoin and Ethereum. That combination of declining dominance and neutral-to-cautious sentiment can create conditions for XRP’s projected rally above $4. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Ripple|ripple news|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58588283,
    "published": 1772236930000,
    "title": "Crypto VC Paradigm expands into AI, robotics with $1.5B fund: WSJ",
    "body": "Paradigm's Matt Huang previously said developments in AI were \"too interesting to ignore\" and that both AI and crypto will have plenty of overlap.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Latest News",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58588196,
    "published": 1772236808000,
    "title": "Crypto Mixing Is Back — And Criminals Adapted Faster Than The Rules Did",
    "body": "When US crypto regulators cracked down on Tornado Cash in 2022, the assumption was simple: shut down the tool, shut down the problem. It didn’t work out that way. Related Reading: Is Bitcoin The Poor Man’s Hedge Against Inflation? Coinbase CEO Thinks So New research from the Cambridge Centre for Alternative Finance (CCAF) shows that coin mixer usage has climbed back toward pre-ban levels — and that the people most effectively pushed out by the sanctions were not the criminals, but ordinary users seeking financial privacy. Railgun Now Dominates A Recovering Market According to CCAF researchers Wenbin Wu and Keith Bear, total crypto mixer transactions reached approximately 32,000 in 2025 — a significant jump from roughly 21,000 in 2024 and 16,000 in 2023. Usage has been climbing steadily since the US Treasury lifted its sanctions against Tornado Cash on March 21, 2025. Railgun, a protocol that screens deposits against lists of flagged addresses, now handles 71% of all mixer transaction volume. Tornado Cash accounts for around 25% of 2025 transactions, while Privacy Pools holds the remaining 5%. Both Railgun and Privacy Pools attempt to filter out known bad actors before crypto funds enter the system. But reports from CCAF note a meaningful gap — blacklists are updated only as new exploits are discovered, leaving a window where funds from freshly flagged addresses can still pass through. Sanctions Scared Off Legitimate Users More Than Criminals The 2022 crackdown caused immediate disruption. Tornado Cash’s daily transactions collapsed by 97% within days. Across the broader mixer market, volume fell 45%. But the disruption was uneven. Wu told researchers that sanctions “primarily deterred compliant users while illicit actors adapted” — first by migrating to alternative platforms, then to cross-chain bridges and decentralized exchanges altogether. Deposit patterns tell the same story. Before 2022, centralized exchanges — which require identity verification — contributed meaningfully to mixer funding. After the ban, those deposits essentially vanished. By 2025, 95% of all crypto mixer funding came from unlabeled wallet addresses with no recorded entity ties, up from 76% in 2020. Related Reading: Bitcoin Sell-Off Slows Down, But The Road To Recovery Is Long — Analyst Most Transactions Now Happen Within 24 Hours Before the ban, most mixer activity occurred more than 24 hours after wallet creation. That pattern has flipped. Researchers say this faster behavior is “consistent with users seeking to avoid identification.” Still, a 2023 Federal Reserve Bank of St. Louis paper found that only around 30% of Tornado Cash traffic could be linked to illegitimate sources — a reminder that privacy tools serve lawful purposes too. The demand, from both camps, never went away. Featured image from Unsplash, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Altcoin|crypto|Crypto Crime|crypto mixing|crypto news|cryptocurrency",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 58589703,
    "published": 1772240459000,
    "title": "Ethereum’s Market Order Imbalance Hits Record Negatives: $1,850 Is Now The Line In The Sand",
    "body": "Ethereum is attempting to stabilize around the $2,000 level as the broader crypto market shows tentative signs of relief. After weeks of persistent pressure, price action has paused its decline, but sentiment remains fragile. The recent rebound has helped ease immediate downside momentum, yet the technical structure still reflects a market recovering from significant damage rather than entering a confirmed uptrend. Related Reading: Engine Stalled: How The $8 Billion ‘October Shock’ Left Bitcoin’s Spot Market In A Liquidity Trap According to a CryptoQuant analyst, Ethereum endured a severe liquidation-driven sell-off in recent weeks, falling sharply from local highs near $3,300 to lows around the $1,850 region. The intensity of this move becomes particularly evident when analyzing the Net Taker Volume (30-day moving average), a metric that measures aggressive market order activity. In February, this indicator plunged to its most negative level since last November, highlighting the dominance of aggressive sellers during the decline. Such extreme negative readings typically reflect panic-driven execution rather than orderly repositioning. When taker volume skews heavily to the sell side, it often signals forced exits, stop-outs, and cascading liquidations across derivatives markets. While Ethereum’s attempt to hold $2,000 suggests that immediate selling pressure may be easing, the underlying data confirms that the market recently absorbed one of its most intense bouts of downside aggression in months. Net Taker Volume Signals Capitulation — But Not Confirmation The dominance of towering red bars in Ethereum’s Net Taker Volume underscores how aggressively sellers controlled the order books during the recent decline. When taker sell orders consistently exceed taker buy orders by such a magnitude, it reflects urgency. This is not passive distribution; it is market participants hitting bids aggressively, often under stress. The combination of panic-driven exits, systematic short positioning, and forced long liquidations likely amplified the move from $3,300 to sub-$1,900 levels. Notably, the only meaningful cluster of green bars — representing aggressive buying — emerged in mid-January, coinciding with Ethereum’s local peak near $3,400. That brief resurgence in demand failed to sustain itself, after which sell-side momentum reasserted control. Structurally, this pattern suggests that upside liquidity was exhausted before a broader deleveraging cycle unfolded. Extreme negative Net Taker Volume readings are often associated with capitulation phases. Historically, such flushes can mark exhaustion points, as aggressive sellers eventually deplete themselves. However, capitulation alone does not confirm reversal. For a structural shift to materialize, the imbalance must normalize. A contraction in red bars followed by sustained green dominance would signal renewed conviction from aggressive buyers. Related Reading: The $2,000 Fault Line: Why Ethereum’s Record Volatility Signals An Imminent Explosion Ethereum Struggles To Reclaim $2,000 As Downtrend Persists Ethereum remains structurally weak despite brief stabilization attempts near the $2,000 level. The chart shows a clear breakdown from the $3,400–$3,600 region earlier this year, followed by a sequence of lower highs and lower lows — a textbook downtrend formation. The recent bounce has not altered this structure. Price is currently trading below the 50-day, 100-day, and 200-day moving averages, all of which are sloping downward. This alignment confirms bearish momentum across short-, medium-, and long-term horizons. Notably, the 50-day average has accelerated lower, reflecting sustained selling pressure rather than a temporary liquidity vacuum. Related Reading: Digital Gold Is Dead: The Institutional Architecture Binding Bitcoin To The Nasdaq In The 2026 Downturn The sharp decline toward the $1,850 zone was accompanied by a significant spike in volume, suggesting forced liquidations and aggressive distribution. Since then, volume has moderated during consolidation, indicating that while panic may have eased, conviction among buyers remains limited. Technically, $2,000 functions as a psychological pivot rather than confirmed support. A sustained move above the 50-day average would be required to signal improving momentum. Conversely, failure to hold the current range could reopen downside risk toward deeper liquidity pockets. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Ethereum|ETH|ethereum|Ethereum Analysis|Ethereum correction|Ethereum liquidity|Ethereum market order imbalance|ethereum news|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]