[
  {
    "id": 57165133,
    "published": 1768415421000,
    "title": "PEPE Price Prediction: The Level That Will Send The Meme Coin To The Stratosphere",
    "body": "Crypto analyst Morja has revealed his PEPE price prediction, alluding to the level the meme coin must hold to sustain its bullish momentum. Another crypto analyst painted a scenario in which the meme coin replicates the parabolic run it recorded in 2023. PEPE Price Could Sustain Bullish Momentum If It Holds This Level In an X post, Morja stated that a weekly candle close above the red level at $0.000005853 for the PEPE price would confirm a successful retest and reinforce the bullish movement. He further remarked that as long as the price holds above this level, upside continuation remains favored. Related Reading: If You’re A PEPE Investor, You Need To See This Or Risk Losing Your Coins However, the analyst warned that on the way toward $0.000010867, a key resistance is located around $0.0000083, which may act as a significant reaction zone before any further upside continuation. Meanwhile, crypto analyst StudyE has painted a scenario in which the PEPE price goes parabolic, replicating its historic 2023 run. The crypto analyst stated that this would happen if the PEPE price pumps into the January 15 to February 15 window. He further explained that the meme coin needs to be at the unfinished monthly candle in that time window in order to invalidate this. An invalidation would send PEPE higher first, and then the bottom would be in. If that doesn’t happen, it may have one more hurdle to overcome. StudyE stated that no matter the path the PEPE price takes, it would lead to the same outcome and timeframe. Based on this, he declared that the fourth quarter of this year will be parabolic, regardless of what happens. It is worth mentioning that PEPE has been one of the best-performing crypto assets to start the new year, with the meme coin up over 30% year-to-date (YTD). PEPE Eyes Rally To $0.00000728 In The Short Term Crypto analyst CryptoLinx has predicted that the PEPE price could rally to $0.00000728 in the short term. The analyst noted that PEPE is breaking out of the downward channel right now and that the target for this pattern is a move back to the previous high. This is a level that the meme coin had reached at the beginning of the year, when it rallied by as much as 80%. Related Reading: Analyst Predicts 430% PEPE Price Rally If This Level Holds In the long term, crypto analyst Eco Nomad stated that the PEPE price will rally to $0.00001, which is the midpoint of the Gaussian channel. If the meme coin breaks that level, he is confident that it could trade within the 4 zeros, having deleted one zero in the process. At the time of writing, the PEPE price is trading at around $0.000006670, up almost 14% in the last 24 hours, according to data from CoinMarketCap. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "PEPE|CoinMarketCap|CryptoLinx|Eco Nomad|gaussian channel|meme coin|Morja|Pepe Coin|PEPE news|PEPE price|pepeusd|PEPEUSDT|StudyE|Year-To-Date|YTD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 47,
        "NAME": "SPONSORED",
        "CATEGORY": "SPONSORED"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 93,
        "NAME": "PEPE",
        "CATEGORY": "PEPE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57165301,
    "published": 1768415894000,
    "title": "Zcash Foundation Investigation Closed: SEC Decision Sparks 12% Jump In ZEC Price",
    "body": "On Wednesday, the Zcash Foundation announced a significant development regarding its ongoing operations: the US Securities and Exchange Commission (SEC) has concluded its investigation into the public charity. This news has sparked a notable recovery in the price of the Zcash native token (ZEC), signalling renewed investor confidence, with trading volume surging by 39% over the past 24 hours. Zcash Foundation Cleared By SEC The Zcash foundation received a subpoena from the regulatory agency back in August 31, 2023, as part of a broader inquiry titled “In the Matter of Certain Crypto Asset Offerings (SF-04569).” Related Reading: XRP Potential: Four Q1 2026 Triggers That Might Propel Price Beyond $8 After a thorough review, the Zcash Foundation was informed that the SEC does not plan to recommend any enforcement actions or changes pertaining to the organization. This comes amid significant regulatory changes towards digital assets under the Trump administration, including the appointment of the pro-crypto Paul Atkins as chair of the SEC. Similar enforcement actions against firms such as Uniswap (UNI), Coinbase (COIN) and Robinhood (HOOD) were dropped last year. ZEC Price Surges Near $440 In their statement, the foundation expressed satisfaction with the outcome, emphasizing their commitment to transparency and adherence to regulatory standards. They reiterated their focus on advancing financial infrastructure that preserves user privacy for the greater good. Related Reading: The NYC Token Crash: Allegations Of Rug Pull After $2.5 Million Liquidity Withdrawal Following this announcement, ZEC experienced a robust increase of 12%, pushing its price to approximately $437.75 at the time of writing. This surge comes after the cryptocurrency had recently dipped to a near one-month low of $363 last Saturday, illustrating a significant turnaround. However, even with this recent boost, the Zcash token still has a long way to climb. The cryptocurrency remains 86% below its all-time high of over $3,191, according to CoinGecko data. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Breaking News Ticker|crypto|crypto news|ZCash|Zcash Foundation|Zcash News|Zcash Price|ZEC News|ZEC Price|ZECUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57165290,
    "published": 1768415754000,
    "title": "Don’t believe the banks lobbying against stablecoins",
    "body": "Issuers should be allowed to pay interest on stablecoins — just as lenders can on dollars",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Financial Times (Crypto)",
      "source_key": "financialtimes_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57165690,
    "published": 1768416912000,
    "title": "Price predictions 1/14: BTC, ETH, XRP, BNB, SOL, DOGE, ADA, XMR, BCH, LINK",
    "body": "Bitcoin inches toward $100,000 as ETH and select altcoins look to make fresh 2026 highs. Do technical charts confirm that the bull market has restarted?",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57165597,
    "published": 1768416786000,
    "title": "More than half of all crypto tokens have failed — and most died in 2025",
    "body": "Over 13.4 million tokens have been erased between mid-2021 and 2025, according to a new analysis by CoinGecko.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Research|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 64,
        "NAME": "RESEARCH",
        "CATEGORY": "RESEARCH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57165498,
    "published": 1768416521000,
    "title": "Figure joins stock tokenization race with new trading platform backed by BitGo, Jump",
    "body": "The blockchain lender's new OPEN platform hosts equities registered natively onchain, bypassing DTCC and allowing DeFi-based lending.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Tokenization|Real World Assets|Figure|tokenized stocks|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      }
    ]
  },
  {
    "id": 57166915,
    "published": 1768420802000,
    "title": "BTC Breaks Higher as Record Bitcoin ETF Inflows Trigger Wave of Bearish Liquidations",
    "body": "Bitcoin (BTC) surged sharply this week, surpassing the $96,000 mark as renewed institutional demand and easing inflation concerns boosted sentiment across crypto markets. Related Reading: Dogecoin Bulls Don’t Celebrate Too Early: This Level Still Must Fall The action followed a strong inflow into U.S. spot Bitcoin exchange-traded funds (ETFs) and a softer-than-feared U.S. Consumer Price Index (CPI) report, which reduced expectations of aggressive interest rate tightening by the Federal Reserve. The rally ended a prolonged consolidation phase that had kept Bitcoin trading sideways for more than a month. As prices broke through key resistance levels near $94,000–$95,000, short sellers were forced to close positions, adding further momentum to the upside. BTC's price records important gains on the daily chart. Source: BTCUSD on Tradingview Bitcoin ETF Inflows Signal Institutional Return U.S. spot Bitcoin ETFs recorded $753.7 million in net inflows on Tuesday, the largest single-day total since October. Fidelity’s FBTC led with $351 million, followed by Bitwise’s BITB with $159 million and BlackRock’s IBIT with $126 million, according to data from SoSoValue. The surge suggests institutional investors are rotating back into crypto-linked products after year-end portfolio adjustments and tax-related selling weighed on the market in late 2025. Ether-focused ETFs also saw renewed interest, with $130 million in net inflows across five products. Bitcoin rose around 3% following the data, trading near $94,600 at the time, while Ethereum gained more than 6% to around $3,320. Broader crypto markets followed, lifting total market capitalization above $3.3 trillion. Inflation Data Supports Risk Assets The latest U.S. CPI report showed inflation holding steady at 2.7% year-on-year, largely in line with expectations. The absence of an inflation surprise reduced fears of further rate hikes and reinforced views that the Federal Reserve could pivot toward rate cuts later in the year. Lower real-rate expectations typically support risk assets, including cryptocurrencies, by reducing the opportunity cost of holding non-yielding assets, such as Bitcoin. U.S. equities also advanced, suggesting the crypto rally was part of a broader shift in risk sentiment rather than an isolated move. Short Liquidations Add Fuel to the Rally As Bitcoin surged past $96,000, bearish positions were wiped out. Data from Coinglass shows more than $290 million in Bitcoin short positions were liquidated within 24 hours, compared with about $24 million in long liquidations. Across the broader cryptocurrency market, short liquidations totaled close to $700 million. Strong spot buying, rising open interest, and technical breakouts contributed to the move. Bitcoin is now testing former resistance levels as support, with chart patterns indicating a possible continuation toward the $105,000–$110,000 range if momentum persists. Related Reading: Bitcoin’s New Power Buyers: Companies Bought 3 Times What Miners Produced While short-term consolidation remains possible near the $98,000–$100,000 zone, sustained ETF inflows, reduced selling pressure from long-term holders, and continued corporate accumulation suggest underlying demand remains firm. Cover image from ChatGPT, BTCUSD chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin price|btc|btc price|btcusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57167276,
    "published": 1768421700000,
    "title": "XRP tops $2 as TradFi piles in: Do charts predict new highs in 2026?",
    "body": "XRP trades back above $2, and soaring institutional investor flows suggest the altcoin’s rally is just getting started.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57167836,
    "published": 1768422737000,
    "title": "Bitcoin ETFs See Biggest Inflow Since October’s Crypto Crash",
    "body": "Crypto investors are kicking off the new year with an old habit: plowing money into Bitcoin ETFs.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57168094,
    "published": 1768424401000,
    "title": "Ethereum Outlook Has Improved, And It Could Outperform Bitcoin – Here’s What To Know",
    "body": "Ethereum’s outlook has been improving its case. After a prolonged period of underperformance and skepticism, the network is starting to exhibit signs of renewed structural and fundamental strength. While BTC continues to anchor the market as the primary store of value and digital gold, conditions are emerging that could allow ETH to outperform BTC over the coming period. Why The Ethereum Narrative Is Gaining Strength Ethereum has been seen outperforming Bitcoin. In a recent post on X, Walter Bloomberg revealed that Standard Chartered says that the ETH outlook has improved, and now ETH might outperform BTC, citing rising institutional demand and stronger fundamental positioning across key on-chain sectors. Related Reading: Altcoin Season In Q1? Bitcoin, Ethereum Breakdown Maps Out Performance While weakness in BTC has weighed on the broader crypto market, ETH has continued to benefit from institutional-driven demand, and its dominance in stablecoins, decentralized finance (DeFi), and real-world assets (RWA) tokenization. Standard Chartered also points to the increased throughput and potential US regulatory clarity that it could provide additional upside. In terms of valuation, the bank forecasts ETH at $7,500 this year and $30,000 by 2029, reflecting the expectations of sustained network growth. The Co-founder of PinkBrains_io, a DeFi Creator Studio, DefiIgnas, has highlighted that Ethereum could outperform Bitcoin this year, and the reason is roadmap execution. While BTC will likely keep facing recurring waves of quantum FUD into 2026, ETH has a clear roadmap to prepare for future cryptographic risks. Furthermore, ETH is actually scaling. Gas limits on layer 1 keep rising, and zkEVMs will get full production readiness, making ETH cheap and fast enough for high-value transactions, while layer 2s will handle most of the trading and high-frequency activity. Related Reading: Bitcoin And Ethereum Market Structure Points To Crypto Winter – Details These upgrades are incremental, which means there’s no breaking news moment for ETH, but progress is happening fast. Early in the cycle, a lot of Degens loaded up on ETH before the bull run, but many got disillusioned and sold their ETH for BTC. “It would be fun to see the playbook reverse higher,” DefiIgnas noted. A Different Liquidity Cycle Than Previous Bull Markets Crypto liquidity quality witnessed a change in 2025. A technical analyst and show host of Crypto Banter, Kyledoops, reported that Wintermute noted that capital in 2025 stopped rotating broadly across the market. Instead, liquidity is concentrated into Bitcoin, Ethereum, and a small group of large-cap tokens. As a result, the long-anticipated wave of altcoin-wide liquidity never really arrived. Meanwhile, the rise of spot ETFs and crypto treasury vehicles created a new, highly structured inflow channel that funneled flow into the top of the market. These vehicles break the crypto’s oldest playbooks. Price action is no longer driven by broad market expansion. It’s driven by where new liquidity can actually enter. Featured image from iStock, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|bitcoin|btc|Crypto Banter|decentralized finance|DeFi|DefiIgnas|ETH|ETH news|eth price|ethereum|ethereum news|ethereum price|ethusd|ETHUSDT|Kyledoops|Layer 1|Layer 2|PinkBrains|Real world assets|RWAs|Spot ETFs|Standard Chartered|Walter Bloomberg|zkEVMs",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57169004,
    "published": 1768427027000,
    "title": "Bitpanda targets Frankfurt IPO with up to $5.5B valuation: Report",
    "body": "The Vienna-based crypto platform is weighing a potential 2026 listing in Germany as more digital asset companies position for public markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57168845,
    "published": 1768426711000,
    "title": "Coinbase pulls support from crypto market structure bill",
    "body": "CEO Brian Armstrong said there were \"too many issues\" with the bill.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Top Stories|Coinbase|Brian Armstrong|Market Structure Legislation|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57168827,
    "published": 1768426598000,
    "title": "Strategy, BitMine Rise While Bitcoin Miners Surge—As BTC Inches Towards $100K",
    "body": "Bitcoin mining stocks like Bitdeer and CleanSpark jumped Wednesday as BTC climbed above $97,000 for the first time since November.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57168802,
    "published": 1768425962000,
    "title": "Coinbase CEO Brian Armstrong Pulls Support for Crypto Market-Structure Bill",
    "body": "Coinbase Global Inc. has pulled its support from the version of the market-structure bill that’s expected to go into markup in the Senate Banking Committee Thursday.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NMS:COIN",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57169314,
    "published": 1768428038000,
    "title": "Sui Back Online After 'Network Stall' Leads to Six Hours of Downtime",
    "body": "The Sui blockchain recovered from a nearly six-hour outage Wednesday, marking the network's second major downtime since its 2023 launch.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 96,
        "NAME": "SUI",
        "CATEGORY": "SUI"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57169294,
    "published": 1768428015000,
    "title": "Bitcoin Price Crash To $57,000: The Bullish Path That Could End In Tears",
    "body": "Bitcoin’s latest recovery above $94,000 raises up the question of whether it is the next leg for the continuation of a bull cycle or the final rally before a deeper reset. However, an interesting technical outlook shared on TradingView by crypto analyst Xanrox suggests the bullish path many traders are watching could ultimately end lower than expected, even if price strength is strong in the near term. Elliott Wave Setup Leaves Room For One More Push Higher Technical analysis of Bitcoin’s price action on the weekly candlestick timeframe chart shows the cryptocurrency has completed a five-impulse wave that goes as far back as early 2023. This impulse wave count ended with Bitcoin’s peak above $126,000 in October 2025 and the cryptocurrency is now playing out corrective waves ABC. Related Reading: Next XRP Wave Shows Where Price Is Headed Next, But There’s A Catch Based on the Elliott Wave theory, Xanrox noted that Bitcoin may already have completed a sharp decline from a projected 2025 peak near $125,000 down to the low-$80,000 range, labeling that move as a corrective wave A. The price action is now viewed as being in a bullish counter-trend phase, commonly referred to as wave (B) or (X), which is known to retrace a portion of the prior decline before rolling over. In this scenario, Bitcoin could still advance to as high as the $100,000 to $103,000 range over the coming weeks or months and even encourage a brief rotation into altcoins during the advance. That upside, however, is corrective and not impulsive, and the next move is a larger move lower once the structure is complete. Bitcoin Weekly Candlestick. Source: TradingView Long-Term Structure Points To A Painful Reset Window Xanrox’s analysis places Bitcoin within a long-term linear structure stretching from 2017 into 2026, highlighting how previous market cycles ended with deep corrections after euphoric peaks. The analysis uses the 2018 and 2022 drawdowns, which erased more than three-quarters of Bitcoin’s value each time, as anchors for what could unfold next for the leading cryptocurrency. Related Reading: Get Ready For An XRP Price Explosion Once This Happens; Analyst According to this framework, the next major corrective phase is projected to play out in 2026, when Bitcoin could fall into the sub-$60,000 region, with $57,000 as the most important area of interest where the correction might end. The $57,000 price correction target is based on the location of the 0.618 Fibonacci retracement when projected from the recent 2025 peak and is going to be just above the 200-week moving average. The projected move would still represent a correction of roughly 54% from the 2025 high if this actually turns out to be the cycle peak. However, it is important to note that the presence of Spot Bitcoin ETFs introduces a stabilizing force compared to earlier cycles in 2018 and 2022, and so any high correction might find a strong support level before falling as low as $57,000. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|btcusd|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57169447,
    "published": 1768428384000,
    "title": "Coinbase Withdraws Support for Crypto Bill on Eve of Key Senate Vote",
    "body": "The move could derail efforts to get crypto’s coveted market structure bill over the finish line.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "||Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57169705,
    "published": 1768428152000,
    "title": "Eric Adams Says He Did Not Profit From Launch of NYC Memecoin",
    "body": "Eric Adams said he did not profit from the launch of the NYC Token memcoin he is promoting, which initially soared in value before crashing following its debut on Monday, prompting crypto market observers to draw parallels to a “rug pull.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57170475,
    "published": 1768431621000,
    "title": "XRP/Gold Ratio Just Reached A Historical Support Zone, What This Means For Price",
    "body": "Despite its slow momentum over the past few weeks, XRP is still on analysts’ radar as they look beyond its dollar price action and into its performance against gold. One analyst has said that the long-term XRP/Gold ratio has just reached a historical support zone, signaling a familiar technical setup that could determine its next move. XRP/Gold Ratio Arrives At Critical Support Level Market expert ‘Steph is Crypto’ has released a fresh analysis focusing on the XRP to gold ratio and its historical behaviour. In his post on X this Tuesday, he stated that the ratio has returned to a long-standing support zone around $0.0004, which has consistently marked major turning points in XRP’s price action relative to gold. Related Reading: Top Bullish Predictions That Put XRP Price At New All-Time Highs Above $3.8 According to the analyst, this same area previously preceded powerful upside moves in the XRP/gold ratio. Each prior visit to this zone was followed by a sharp reversal higher, as highlighted by the circled lows and steep advances that followed. The chart shows rallies of more than 800% in 2020, over 120% in 2022, and about 530% in 2024. Steph is Crypto also pointed to momentum conditions, noting that the Relative Strength Index (RSI) was oversold in the past when the XRP/gold ratio hit the historical support. In the current 2026 cycle, the RSI sits around 33.38, reflecting a similar oversold setup to previous cycles. According to the analyst, this suggests downside momentum is fading. The general outlook of this analysis suggests that if past trends repeat, the XRP/gold ratio could experience another strong rally this cycle. This time, Steph is Crypto predicts a rally from the support around $0.0004 to over $0.0018, representing a gain of more than 350%. Analyst Links XRP Trajectory To That Of Gold And Silver In a subsequent post, Steph is Crypto shared another analysis comparing the historical price movements and expansion phase of gold and silver with XRP. He presented parallel charts for each asset, highlighting distinct phases preceding major price rallies in the precious metals while illustrating the potential path for XRP based on gold and silver’s past performance. Related Reading: Analyst Outlines The Bull Case For XRP And Why Price Will Hit All-Time High Soon The chart showed that gold and silver experienced a major distribution phase in 2021, followed by a compression phase in 2023 and an expansion in 2026. In Gold’s case, its price reversal was sharp and vertical, with minimal pullbacks before reaching an all-time high near $4,700. Silver’s movement was more muted, showing significant volatility from 2023 to 2025 before accelerating in 2026 to peak above $91. Based on these performances, Steph is Crypto predicts that XRP could follow a similar trajectory. The cryptocurrency has completed its distribution phase above $3 and its compression stage near $2.3, and the analyst now expects it to enter an expansion phase, with a projected ATH target of $32. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|gold|Relative Strength Index|Ripple|RSI|silver|Steph is Crypto|xrp|xrp news|XRP Price|XRP/Gold|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57170442,
    "published": 1768431425000,
    "title": "Bitcoin and ether's sharp 'mechanical' breakouts liquidate nearly $700 million short positions",
    "body": "Bitcoin's breakout above $95,000 rejuvenated risk appetite, with one market strategist saying that the crypto rally has legs.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Ethereum News|market analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57170879,
    "published": 1768432704000,
    "title": "AI, Impersonations Drove Crypto Scam Losses to Record $17 Billion in 2025: Chainalysis",
    "body": "A new report by Chainalysis finds that AI-enabled crypto scams are more efficient, profitable, and harder to stop.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57171669,
    "published": 1768435249000,
    "title": "Bitcoin Futures Flush 31% Of Open Interest As Bottom Thesis Takes Shape",
    "body": "Bitcoin’s derivatives market is showing signs of a reset after a speculative 2025, with Binance open interest falling more than 31% from an October peak as futures-led selling pressure cools, a combination CryptoQuant contributor Darkfost argues often coincides with meaningful cycle lows. In a series of posts on X, Darkfost said 2025’s leverage build-up was fueled by record activity on Binance, where futures trading volumes “exceeded $25T,” helping push Bitcoin open interest (OI) to an all-time high “of over $15B on October 6.” “To put this into perspective, during the previous bull cycle in November 2021, when Bitcoin hit its ATH, open interest on Binance peaked at $5.7B,” Darkfost wrote. “In other words, OI nearly tripled in 2025. Since that peak, open interest has dropped by more than 31%, stabilizing today around $10B.” Darkfost framed the move as a deleveraging phase that intensified amid “massive liquidations,” with OI slipping below its 180-day moving average, a condition the analyst says has historically mattered more than the raw level of leverage. “These deleveraging periods are crucial, as they help purge the excess leverage built up in the market,” Darkfost wrote. “Historically, they have often marked significant bottoms, effectively resetting the market and creating a stronger base for a potential bullish recovery.” Related Reading: Bitcoin Could Be Entering A Supercycle, Fidelity Warns The logic is straightforward: when leverage is forced out, the market can become less vulnerable to cascade-style liquidations and reflexive selling. In that sense, a lower OI environment can reduce the marginal impact of futures positioning on spot, at least compared with the late-stage “crowded trade” conditions that precede sharp drawdowns. But Darkfost warned that a deleveraging signal is not the same thing as a confirmed bottom. “This could be the case again, but caution is warranted,” the analyst wrote, adding that if Bitcoin “continues to slide and fully enters a bear market,” OI could “contract further,” pointing to “deeper deleveraging and a potential extension of the correction.” Bitcoin Sellers Are Losing Momentum Alongside the open interest reset, Darkfost pointed to a sharp drop in futures-driven selling pressure, using Net Taker Volume — a measure intended to capture who is dominating futures order books. Related Reading: Bitcoin HODLer Selloff Ending? LTH Outflows Decline “Selling pressure on BTC coming from the futures market is sharply declining,” Darkfost wrote, noting that after the monthly average hit “–$489M” at its peak, the figure has now been “divided by ten.” “At the moment, sellers still slightly dominate the order books, with –$51M,” the analyst added. The key nuance is that the indicator has not flipped, but it is moving in that direction. “We have not yet returned to positive territory, but we are getting closer,” Darkfost wrote. “It is very encouraging to see traders starting to change their approach, especially given the significant impact futures volumes have on price action. Notably, since this decline in selling pressure began, BTC price action has also stabilized.” For the “bottom thesis” to graduate into a more forceful reversal call, Darkfost anchored the trigger to that sign change: “If Net Taker Volume were to turn positive again, it would clearly ignite the fuse for a bullish reversal.” At press time, BTC traded at $95,131. Featured image created with DALL.E, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 74,
        "NAME": "BNB",
        "CATEGORY": "BNB"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57172547,
    "published": 1768437880000,
    "title": "Robinhood CEO Says AI Could Spark a ‘Job Singularity’",
    "body": "Vlad Tenev argues AI will fuel a surge of new jobs, solo companies, and industries, not just cause displacement.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Artificial Intelligence",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57172821,
    "published": 1768438801000,
    "title": "XRP Compresses At A Breakout Line — Structure Says Expansion Is Brewing",
    "body": "XRP is tightening up at a critical breakout level, with price action suggesting the market is coiling for its next decisive move. While short-term volatility has cooled, the broader structure remains constructive, pointing to a potential expansion phase as compression builds near key resistance. XRP Compresses Into A Critical $2.30–$2.40 Decision Zone According to a latest update from Egrag Crypto, the XRP 3-day chart continues to flash strong bullish signals despite recent consolidation. Price action remains constructive, with XRP compressing inside a descending channel as it approaches a crucial decision zone between $2.30 and $2.40. Related Reading: XRP Price Finds Its Footing at Support, Bulls Test Their Strength From a structural standpoint, several technical elements point to underlying strength. The 50-period EMA has begun to flatten, suggesting that selling pressure is gradually easing. At the same time, the 200-period EMA continues to trend higher, reinforcing the idea that the broader, macro trend remains bullish. Furthermore, XRP is holding above the EMA cluster, indicating that the market structure has not yet broken down. Notably, the upper boundary of the descending channel aligns closely with the former $2.30 breakout level, adding technical significance to this zone. From here, the implications are clear. A clean and decisive 3-day close above $2.40 would likely confirm a breakout from compression, opening the door for continuation toward the $2.70 region, with $3.13 emerging as a higher upside objective. On the other hand, rejection at resistance would likely keep XRP trading in a range. However, as long as the price remains above the $2.00 area, the overall bullish structure stays intact. This is not a breakdown scenario; rather, it reflects tightening price action that often precedes a strong expansion. Triple Tap Hits Range Highs, Reaching A Key Inflection Point In a recent market update, CrediBULL Crypto noted that XRP has now completed its triple-tap move, successfully reaching the upper boundary of its range. With liquidity at the range highs already taken, the market now stands at a clear crossroads, presenting two distinct paths for price action going forward. Related Reading: Why XRP Is Gearing Up For A Massive Week The first scenario frames the recent move as nothing more than a relief bounce, sweeping liquidity at the highs before resuming its local downtrend, within the higher-timeframe uptrend. If this plays out, price could move lower again, potentially dropping below the $1.77 level. In the alternative scenario, the triple-tap pattern is interpreted as the formation of a solid base of structural demand. Under this view, pullbacks are likely to be met with buying interest, with the $1.77 lows acting as a support zone rather than a level to be broken. Weighing the broader context, particularly Bitcoin’s position and overall market conditions, CrediBULL leans toward the second outcome. That bias favors looking for long opportunities, with the expectation that XRP will continue to expand higher and eventually target untapped levels above the current range. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|bitcoin|CrediBULL Crypto|Descending Channel|Egrag Crypto|EMA|Ripple|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57172745,
    "published": 1768438354000,
    "title": "Coinbase pulls support for crypto bill: 'no bill' better than 'bad bill'",
    "body": "Coinbase CEO Brian Armstrong raised four crucial points that he believes would make the legislation “materially worse” for the US crypto industry.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57172945,
    "published": 1768439037000,
    "title": "Coinbase pulls support for major crypto bill. Here's what it means for the industry",
    "body": "Coinbase's withdrawal of its support potentially derails market structure legislation, says an analyst, noting that it's bad for the crypto industry and good for the banks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Coinbase|Top Stories|Policy|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57174636,
    "published": 1768444395000,
    "title": "Senate Banking Committee cancels crypto market structure markup",
    "body": "The committee's Republican chairman, Tim Scott, had pushed for a quick process before it collapsed under the weigh of unfinished business.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|U.S. Senate|U.S. Senate Banking Committee|Tim scott|Market Structure Legislation|Breaking News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57175018,
    "published": 1768445584000,
    "title": "Bitcoin Price Clears the Ceiling—Is $100K the Next Test?",
    "body": "Bitcoin price started a fresh increase above $95,500. BTC is trading above $96,000 and might soon aim for a move to $100k in the near term. Bitcoin started a decent increase above $94,000 and $95,500. The price is trading above $95,000 and the 100 hourly Simple moving average. There is a bullish trend line forming with support at $95,250 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move up if it stays above the $95,000 zone. Bitcoin Price Breaks Key Resistance Bitcoin price managed to stay above the $92,500 support and started a fresh increase . BTC was able to settle above $94,000 and $95,000. The bulls were able to push the price above $95,500. Finally, the price spiked above $97,000. A high was formed at $97,898, and the price is now consolidating gains above the 23.6% Fib retracement level of the recent wave from the $89,995 swing low to the $97,898 high. Bitcoin is now trading above $96,000 and the 100 hourly Simple moving average . If the price remains stable above $95,500, it could attempt a fresh increase. Immediate resistance is near the $97,200 level. The first key resistance is near the $97,800 level. The next resistance could be $98,000. A close above the $98,000 resistance might send the price further higher. In the stated case, the price could rise and test the $98,800 resistance. Any more gains might send the price toward the $99,500 level. The next barrier for the bulls could be $99,800 and $100,000. Another Drop In BTC? If Bitcoin fails to rise above the $97,200 resistance zone, it could start another decline. Immediate support is near the $96,000 level. The first major support is near the $95,250 level and the trend line. The next support is now near the $94,000 zone or the 50% Fib retracement level of the recent wave from the $89,995 swing low to the $97,898 high. Any more losses might send the price toward the $93,000 support in the near term. The main support sits at $92,500, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $96,000, followed by $95,250. Major Resistance Levels – $97,200 and $97,800.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57175732,
    "published": 1768447768000,
    "title": "Solana Mobile to airdrop 1.8B SKR tokens to users, 141M to devs",
    "body": "Solana Seeker owners and mobile app builders will receive billions of Seeker (SKR) tokens next week. The airdrop represents 20% of the total token supply.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 204,
        "NAME": "AIRDROP",
        "CATEGORY": "AIRDROP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57175831,
    "published": 1768448070000,
    "title": "Bitcoin Prices Climb To Highest Price Since November",
    "body": "Bitcoin prices rallied on Wednesday, January 14, reaching their loftiest value in roughly two months as various factors combined to drive gains.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57176275,
    "published": 1768449244000,
    "title": "Russia to open up crypto, aims to make it ‘common occurrence’: Report",
    "body": "A top Russian lawmaker says crypto “will be a common occurrence” in the country, with plans for a bill to deregulate the market for retail use.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57176492,
    "published": 1768450094000,
    "title": "XRP Price Gives Back Momentum, Traders Reassess the Bullish Setup",
    "body": "XRP price failed to surpass $2.20 and started another decline. The price is now correcting gains and might struggle to stay above $2.080. XRP price started a downside correction and tested the $2.080 zone. The price is now trading below $2.120 and the 100-hourly Simple Moving Average. There is a bullish trend line forming with support at $2.080 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could start another increase if it clears $2.150. XRP Price Starts Fresh Decline XRP price failed to clear $2.20 and started a downside correction below the $2.150 zone, underperforming Bitcoin and Ethereum . The price dipped below the $2.120 and $2.10 levels to enter a negative zone. The price even dipped below the 61.8% Fib retracement level of the upward move from the $2.032 swing low to the $2.193 high. The bulls are now active near $2.080. There is also a bullish trend line forming with support at $2.080 on the hourly chart of the XRP/USD pair. The price is now trading below $2.120 and the 100-hourly Simple Moving Average. If there is a fresh upward move, the price might face resistance near the $2.120 level. The first major resistance is near the $2.150 level, above which the price could rise and test $2.20. A clear move above the $2.20 resistance might send the price toward the $2.250 resistance. Any more gains might send the price toward the $2.320 resistance. The next major hurdle for the bulls might be near $2.350. More Losses? If XRP fails to clear the $2.120 resistance zone, it could start a fresh decline. Initial support on the downside is near the $2.080 level. The next major support is near the $2.070 level and the 76.4% Fib retracement level of the upward move from the $2.032 swing low to the $2.193 high. If there is a downside break and a close below the $2.070 level, the price might continue to decline toward $2.050. The next major support sits near the $2.020 zone, below which the price could continue lower toward $2.00. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $2.080 and $2.050. Major Resistance Levels – $2.120 and $2.150.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "XRP|Ripple|XRPBTC|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57177156,
    "published": 1768452109000,
    "title": "Blockchain firm eyes $200M in tokenized water projects across SEA",
    "body": "Some crypto executives predict the tokenized real-world asset market will grow significantly in 2026, fueled by adoption in emerging economies.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57177459,
    "published": 1768453207000,
    "title": "Bitcoin Bulls Take Control: Futures Positioning Turns Bullish for First Time Since October",
    "body": "Bitcoin is pushing above the $95,000 level as selling pressure across the market continues to ease, offering a renewed sense of short-term stability after weeks of choppy consolidation. Following a volatile end to last year, price action has gradually improved, with buyers regaining control and forcing Bitcoin back into a range that had previously acted as resistance. While skepticism remains high and many analysts continue to warn of a broader corrective phase, recent derivatives and positioning data suggest that market behavior may be shifting beneath the surface. Related Reading: Bitcoin LTH SOPR Signals Early Capitulation, But Selling Pressure Remains Contained According to an analysis shared by Axel Adler, Bitcoin’s Positioning Index SMA-30d has climbed to 3.5, marking the first sustained breakout above the 3.0 level since October 6, 2025. That previous breakout occurred during the rally that ultimately carried BTC toward the $125,000 peak, making the current move particularly notable from a historical perspective. The positioning index reflects aggregated futures market dynamics, including open interest, funding behavior, and long-short activity, and is often used to identify regime changes in trader sentiment. This renewed strength in positioning does not guarantee immediate upside continuation, but it does indicate that futures traders are once again willing to take directional exposure after months of defensive positioning. As Bitcoin holds above $95K, the coming sessions will be critical in determining whether this move develops into a broader trend or remains a temporary relief rally. Futures Positioning Signals a Shift Toward a Bullish Regime According to Axel Adler Jr., the recent breakout of the Positioning Index SMA-30d above the 3.0 level marks an important local shift in Bitcoin’s futures market structure. After spending nearly three months oscillating within the 0 ± 2 range, this move signals that traders are transitioning from neutral or defensive positioning into a more directional stance. Adler notes that confirmation now depends on persistence rather than speed. The key continuation trigger is the SMA holding above the 2.0 level for at least one week, which would validate that the shift is not a short-lived reaction. This view is reinforced by developments in the Bitcoin Advanced Sentiment Index. While sentiment briefly peaked at 93.15% when BTC traded near $95,061, it has since cooled to roughly 70%. Importantly, this pullback has occurred without a breakdown in price structure. The index remains well above the neutral 50% threshold and above its 30-day average near 62.9%, indicating that bullish conditions still dominate the futures market. Adler interprets the roughly 23-percentage-point decline in sentiment as a healthy release of short-term overheating rather than a trend reversal. Historically, such resets often strengthen trend durability. Risk emerges if sentiment falls below 50% alongside a price drop under $92,000. Conversely, holding sentiment above 60% during short consolidation phases would support further upside continuation. Related Reading: Bitcoin Short-Term Holders Near A Profit Flip: A Key Level Comes Into Focus Bitcoin Price Action Details Bitcoin price action on the daily chart shows a clear attempt to regain control after a prolonged consolidation phase. Following the sharp November sell-off that pushed BTC into the low $80K region, price has gradually formed a higher-low structure, signaling stabilization rather than continued capitulation. The recent push above $95,000 marks the highest daily close since mid-November and places Bitcoin back above its short-term moving average, a level that had capped upside throughout December. However, the broader trend remains mixed. The 50-day moving average is still sloping downward and sits above the current price, acting as near-term dynamic resistance. Meanwhile, the 200-day moving average continues to trend higher well below price, confirming that the broader market structure remains intact despite recent volatility. This positioning reflects a market transitioning from corrective pressure into a potential recovery phase, rather than a clean trend reversal. Related Reading: XRP Consolidates Above $2 As Volume Z-Score Signals A Quiet Market The recent advance toward $95K occurred without a significant volume spike, suggesting reduced selling pressure rather than aggressive new demand. This is consistent with a relief-driven move fueled by short covering and position rebalancing. For bulls, holding above the $93K–$95K range is critical to maintain momentum and build a base for continuation. Failure to consolidate above this zone would increase the risk of renewed range-bound trading or a pullback toward the $90K support area. Featured image from ChatGPT, chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|bitcoin analysis|Bitcoin Bullish Breakout|bitcoin bulls|bitcoin futures|Bitcoin Futures Market|Bitcoin news|btc|BTCUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57177447,
    "published": 1768453168000,
    "title": "Manhattan DA Urges Lawmakers to Strengthen Crypto Enforcement Tools",
    "body": "Manhattan DA Alvin Bragg is demanding criminal penalties for crypto scams, including one that have drained elderly New Yorkers' life savings.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57178160,
    "published": 1768455294000,
    "title": "Bitcoin open interest falls 30%, setting up bullish recovery: Analyst",
    "body": "Bitcoin derivatives open interest fell 30% from October highs as deleveraging purged excess leverage, historically signaling market bottoms and recovery.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57178232,
    "published": 1768454629000,
    "title": "Former 'bitcoin mayor' Eric Adams denies profiting from NYC Token after 80% crash",
    "body": "The Solana-based token plunged more than 80% shortly after launch, with on-chain watchers flagging liquidity shifts that its backers and Adams’ team dispute.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Eric Adams|New York|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57178626,
    "published": 1768456809000,
    "title": "Ethereum Could Surge To $7,500 And Leave Bitcoin Behind, Banking Giant Says",
    "body": "Standard Chartered has pushed its base-case price target for Ethereum to $7,500 by the end of the year, a big jump from an earlier $4,000 projection. Related Reading: Bitcoin’s New Power Buyers: Companies Bought 3 Times What Miners Produced According to the bank’s digital assets team, growing demand from corporate treasury buyers and spot ETH products has driven the change in outlook. Bank Raises Ethereum Target The bank’s lead analyst expects fee growth on the Ethereum network and stronger institutional adoption to be key drivers for the move higher. The bank also revised its longer-term numbers, lifting its 2028 target to $25,000 and laying out scenarios that push toward $40,000 by 2030. These wider targets reflect models where stablecoins and tokenized assets expand on Ethereum’s chain. Institutional Buying Drives Demand Data cited by market researchers points to heavy accumulation since June, with spot ETF flows and treasury firms together taking close to 4% of Ether’s circulating supply over that period. ETHEREUM SEEN OUTPERFORMING BITCOIN Standard Chartered says Ethereum’s outlook has improved and it is likely to outperform bitcoin. While weak bitcoin performance has weighed on the broader crypto market, rising institutional demand for ethereum and its dominance in stablecoins,… — *Walter Bloomberg (@DeItaone) January 13, 2026 Treasury firms alone reportedly bought about 2.3 million ETH in just over two months, a pace that Standard Chartered says outstrips some previous accumulation phases seen in Bitcoin. Ethereum Vs. Bitcoin Standard Chartered’s note also argues that Ether could outperform Bitcoin, raising the possibility of the ETH/BTC ratio returning toward levels last seen during 2021’s run-up. Based on the bank’s scenarios, weaker Bitcoin momentum combined with stronger real-world use of Ethereum might lift Ether’s price faster than Bitcoin’s in the months ahead. Long-Term Upside Scenarios Some headlines have pointed to even bigger long-range targets produced by the same models, including forecasts of $30,000 by 2029 and $40,000 by 2030 under more bullish assumptions. These outcomes rely on a substantial expansion of stablecoin use, tokenized real-world assets, and continued staking demand that would remove supply from the market. Independent forecasters remain split, and other banks have offered lower year-end projections, offering a reminder that expert views differ. Meanwhile, market watchers caution, though, that relative moves depend heavily on ETF flows and corporate balance-sheet decisions. Related Reading: Bitcoin At $100K Could Spark A Fresh Wave Of Retail FOMO, Analysts Warn Network Fundamentals And Risks According to the bank, Ethereum’s large share of stablecoin activity and its role in decentralized finance make fee income and on-chain demand a meaningful part of valuation models. That said, the bank notes that scale improvements and Layer 1 throughput will matter a lot if big, traditional finance transactions migrate onchain. The research also warns that shifts in macro conditions, outflows from major ETFs, or regulatory setbacks could change the math quickly. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|banking|ETH|Ether|ethereum|Standard Chartered",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57178552,
    "published": 1768456311000,
    "title": "Dogecoin drops 4% as traders sell into strength",
    "body": "Heavy selling pressure emerged after a failed rally attempt, with late-session stabilization showing exhaustion rather than reversal.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57178775,
    "published": 1768457201000,
    "title": "Senate Banking Committee Delays Markup of Key Crypto Bill as Industry Support Frays",
    "body": "Senate efforts to rewrite U.S. crypto rules hit another snag after the Banking Committee delayed markup of the industry-shaping bill.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Law and Order",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57179160,
    "published": 1768458395000,
    "title": "NCAA urges CFTC to pause college sports prediction markets",
    "body": "The group says contracts mirror sports betting but lack safeguards, warning transfer portal markets could pose “catastrophic” risks to student athletes.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Policy|Prediction Markets|Polymarket|Kalshi|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      }
    ]
  },
  {
    "id": 57179801,
    "published": 1768460404000,
    "title": "Crypto Market Bill Draft Criticized For Allowing Continued Developer Prosecution",
    "body": "The recently released draft of the CLARITY Act, a significant piece of legislation aimed at regulating the crypto market, has ignited a wave of criticism from supporters within the community. Initially, the bill was meant to include protections for developers. However, expert commentary suggests that it opens the door to continued prosecution of developers and enhances surveillance measures for users of non-custodial software. Crypto Market Structure Bill Draft Lacks Essential Protections Market expert Ryan Adams highlighted another key issue in the crypto bill, stating that if banks succeed in eliminating stablecoin yield provisions within the CLARITY Act, it would indicate that the Senate is prioritizing bank interests over those of the general public. Adams’s concerns were echoed by various users, who opined that the strategy appears orchestrated to allow banks to benefit by controlling how yields are managed and distributed. Related Reading: Zcash Foundation Investigation Closed: SEC Decision Sparks 12% Jump In ZEC Price An independent report by The Rage reinforces these worries, detailing how the proposed draft includes so-called developer protections that may fall short. Notably absent are safeguards against the rigorous implications of the Bank Secrecy Act (BSA) for self-custodial wallets. Additionally, the draft hints at possible applications to decentralized finance (DeFi) that could empower agencies to implement Travel Rule-like regulations, along with anti-money laundering (AML) measures targeting web-based interfaces and blockchain analysis firms. Per the report, the Senate has already received 137 amendments to the draft ahead of its markup, scheduled for January 15. A revised version of the Blockchain Regulatory Certainty Act (BRCA) is also included, which has been seen as vital for protecting developers. BRCA Loopholes While the BRCA offers exemptions under AML and counter-terrorist financing regulations, it continues to leave developers vulnerable to accountability for the actions of users utilizing their software. The BRCA states that “non-controlling” developers—defined as those without unilateral control over digital asset transactions—will not be categorized as money transmitters under the relevant laws. However, this only alleviates certain charges and doesn’t prevent criminal liability for those whose software is misused. Pro-crypto Senator Cynthia Lummis remarked on this aspect of the BRCA, indicating that it retains all necessary AML protections, which implies that despite any positives, accountability remains a looming threat for developers. Simultaneously, the “Keep Your Coins Act” within the draft includes provisions claiming that federal agencies cannot prohibit self-custody of digital assets. However, further stipulations assert that this right does not prevent the application of laws concerning illicit finance, leaving loopholes for government intervention. The Securities and Exchange Commission’s (SEC) past attempts to impose a broker rule that would classify decentralized finance services as intermediaries requiring reporting obligations have been echoed in the current draft. This time, the Senate Banking Committee appears to be leaning towards a similar regulatory approach, aiming to provide guidance on BSA and AML compliance for “non-decentralized finance protocols,” thereby raising concerns about the implications for crypto developers who maintain and update protocols. Privacy Concerns Mount Under the new sections, the Senate Banking Committee introduces a concept termed “Distributed Ledger Application Layers,” which the report claims invites scrutiny and creates compliance obligations for software applications that allow users to interact with decentralized finance protocols. The provisions also compel the Treasury to develop additional oversight mechanisms to mitigate exposure to illicit financing risks identified through distributed ledger analysis tools, effectively ensuring that crypto transactions remain under close scrutiny. Related Reading: The NYC Token Crash: Allegations Of Rug Pull After $2.5 Million Liquidity Withdrawal As it currently stands, the lack of robust protections for developers and users involved in privacy-enhancing technologies in this current draft suggests that the Senate’s proposal for market structure will do little to safeguard non-custodial developers. Instead, it further entrenches their vulnerability to government oversight and user surveillance. Ultimately, these developments present a significant challenge for privacy software users and developers. Featured image from DALL-E, chart from TradingView.com",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|blockchain developers|CLARITY Act|crypto|crypto market|Crypto Market Structure Bill|crypto news|cryptocurrency|US crypto news|US crypto regulation",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57180460,
    "published": 1768462299000,
    "title": "Bitcoin ETFs take in $830 million amid positive inflows across ether, solana and XRP",
    "body": "Bitcoin, ether, solana and XRP spot ETFs all posted net inflows on Wednesday, led by the strongest day for bitcoin funds in months.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin ETF|exchange-traded funds|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57173197,
    "published": 1768439734000,
    "title": "Senator Lummis expects delay to crypto market structure markup: Bloomberg",
    "body": "Disputes over stablecoin reward provisions in the CLARITY Act risk delaying the bill as banking and crypto stakeholders push competing agendas.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57181262,
    "published": 1768464786000,
    "title": "Crypto slump hits ARK ETFs in Q4, Coinbase becomes top detractor",
    "body": "A fourth-quarter crypto downturn exposed how closely ARK’s flagship ETFs are now tied to digital assets, with Coinbase and Roblox emerging as the biggest performance drags.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57181623,
    "published": 1768465639000,
    "title": "DeFi quietly breaks up with Discord as scams overwhelm public channels",
    "body": "Ticketed help desks and live support are replacing always-on Discord channels at major DeFi protocols.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57181817,
    "published": 1768466617000,
    "title": "Bitcoin bull case grows as U.S. bond market volatility sinks to lowest since 2021",
    "body": "The bond market volatility gauge has slipped to its lowest since October 2021, supporting risk-taking in financial markets.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Bonds|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57182130,
    "published": 1768467637000,
    "title": "Analyst Says It’s Time For Ethereum’s ‘Big Test’ – Is ETH Season Loading?",
    "body": "After its recent price breakout, Ethereum (ETH) is facing its next big test and attempting to turn a crucial area into support. Some analysts have suggested that the altcoin is ready to continue its bullish momentum, arguing that the biggest rotation in years is coming. Related Reading: Bitcoin Nears ‘Historic’ Technical Test As Price Eyes $93,500 Barrier – What’s Next? Ethereum Challenges Key Resistance Area On Wednesday, Ethereum broke past a crucial area and retested the $3,400 level for the first time in over a month. The king of altcoins has seen a 6% increase in the daily timeframe, jumping from the $3,100 level to the current levels. Notably, ETH has been hovering between the $3,000-$3,300 area since the start of the year rally, but failed to break the local range’s upper boundary during last week’s attempt. Now, the cryptocurrency has daily closed above this barrier and is testing this area as support. Amid this performance, analyst Michaël van de Poppe affirmed that “it’s ETH season” as the leading altcoin has held above the 21-day Moving Average (MA) since January 1. He explained that this level, officially lost during the early Q4 2025 corrections, is crucial for the price to hold onto to strengthen the momentum. To the market observer, Ethereum is “ready to make new highs and continue the uptrend,” and based on this structure, his main scenario is that the cryptocurrency will likely retest the $3,800 area soon. Meanwhile, Daan Crypto Trades pointed out that ETH is currently facing a “big test.” The trader noted that the altcoin has been moving within its $2,600-$3,300 price range over the past two months, adding that a breakout from this range is necessary to define the direction of its next move. Per the chart, Ethereum must reclaim the $3,350 level, where the 200-day exponential moving average (EMA) is located. This indicator has served as a key rejection area since November, and breaking above it “should lead to a move higher to catch the Daily 200MA next,” currently located around the $3,600 area. ETH To Follow Its 2018 Playbook? Crypto Jelle also shared an optimistic outlook for the cryptocurrency, asserting that Ethereum “looks better than it has looked in years” against both Bitcoin (BTC) and the US Dollar. He argued that both charts are poised to move higher since ETH’s downtrend against BTC is over, and its USD chart looks ready to push towards the $4,000 barrier again. He added that the ETH/BTC anticipated rally means “ETHUSD could see price move a lot higher over the coming months.” Similarly, Alex Wacy recently explained that the “biggest ETH rotation in 8 years [is] forming right now.” The analyst highlighted that the king of altcoins is repeating the same playbook that led to its 2018 breakout against BTC, but with “bigger players” and “more capital entering.” Related Reading: Monero (XMR) Hits New $610 All-Time High – Veteran Trader Shares Silver-Like Setup According to the chart, ETH saw a multi-year accumulation against Bitcoin between 2015 and 2017, leading to its massive expansion in 2018. After an initial breakout, the cryptocurrency re-accumulated for an extended period inside a falling wedge pattern, which resulted in a 50x pump from this structure. This time, Ethereum’s trading pair against BTC moved within a multi-year falling wedge pattern again, which was broken out of in Q4 2025. If history repeats itself, the altcoin could see a new massive surge against the flagship crypto over the coming months. As of this writing, Ethereum is trading at $3,375, a 5% increase in the weekly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|bitcoin|btc|crypto analyst|Crypto Market Recovery|Crypto trader|ETH|eth price|ethbtc|ethereum|Ethereum Breakout|Ethereum Price analysis|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57182808,
    "published": 1768469575000,
    "title": "Bitcoin ETFs post record 2026 inflows as BTC rallies above $97K",
    "body": "Spot Bitcoin ETFs attracted over $1.7 billion in a three-day streak as BTC hit two-month highs and sentiment turned bullish.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57183546,
    "published": 1768472119000,
    "title": "Bitcoin sees key bottom signal as BTC eyes unique $101K bear market reclaim",
    "body": "Bitcoin leading indicators stayed bullish for BTC price action, with $101,000 of key importance as a resistance reclaim area next.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57183484,
    "published": 1768471759000,
    "title": "LSEG brings commercial bank money onto blockchain rails with DiSH",
    "body": "The London Stock Exchange's new Digital Settlement House uses tokenized bank deposits for instant, round-the-clock settlement across blockchain and traditional payment networks.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 57184312,
    "published": 1768474469000,
    "title": "Sygnum sees tokenization and state Bitcoin reserves taking off in 2026",
    "body": "Sygnum predicts US crypto regulation could spur sovereign Bitcoin reserves and accelerate tokenized bond issuance by major financial institutions in 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57184390,
    "published": 1768473992000,
    "title": "Post-quantum crypto startup Project Eleven raises $20 million in funding round",
    "body": "The Series A round was led by Castle Island Ventures with participation from Coinbase Ventures.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|quantum computing|Series A|Fundraising|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57184980,
    "published": 1768476616000,
    "title": "XRP Price Is Approaching A Key Decision Zone, But Structure Is Still Firmly Bullish",
    "body": "Market analyst Egrag Crypto said the XRP price structure remains largely bullish despite the cryptocurrency’s recent struggles to break above $2. The analyst has presented a chart analysis showing XRP slowly approaching a key decision zone that could determine its next upward move and push it firmly out of its current consolidation. XRP Price Structure Still Bullish On Wednesday, January 14, Egrag Crypto said the XRP 3-day chart shows obvious, strong signals. He stated that XRP remains structurally bullish despite experiencing long periods of consolidation following its last rebound above $2 this year. According to the analyst, XRP’s price is currently compressing within a descending channel as it moves closer to a key decision zone between $2.30 and $2.40. He explained that this type of compression often appears after a strong move and can lead to a larger price expansion. Related Reading: Bitcoin Price Crash To $57,000: The Bullish Path That Could End In Tears In his post on X, Egrag Crypto shared key trends he observed on XRP’s 3-day chart. He revealed that the 50 Exponential Moving Average (EMA) has begun to flatten, indicating that selling pressure for XRP may be easing. At the same time, the 200 EMA continues to move higher, supporting the analyst’s opinion that the macro trend for XRP is still bullish. Egrag Crypto also emphasized that XRP is holding above the EMA cluster, a sign of structural strength rather than weakness. He highlighted that the upper boundary of the descending channel aligns precisely with the critical resistance areas at $2.3, marked by a red line on the chart. As these four developments occur simultaneously on the XRP chart, Egrag Crypto shared insights into their potential price impacts. He stated that a clean 3-day close above $2.40 would likely confirm XRP’s breakout from the descending channel. Based on the chart structure, he added that such a move could open the door for a continuation toward the $2.70 and $3.13 levels. If XRP is rejected at the channel’s resistance, Egrag Crypto has said that the price would likely remain range-bound. He concluded his analysis by emphasizing that as long as XRP continues trading above $2.0, its bullish structure will remain intact, and this ongoing consolidation phase should be seen as a period of compression ahead of a potential major price expansion. Related Reading: This Ethereum Triangle Breakout Puts Price Above $24,000, Here’s The Path Chart Signals Potentially Deeper Downtrend In Egrag Crypto’s chart, the lower boundary of the descending channel touches a key support area, marked by a white line. This could mean that if XRP fails to hold $2 and even drops below it, it could invalidate the analyst’s bullish thesis and trigger a decline toward the next support level at $1.65, representing a roughly 17.5% drop from current prices. If price falls further below $1.65, XRP could crash toward the last highlighted support level just around $1.0, reflecting an approximately 50% decrease from around $2.1. Featured image created with Dall.E, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|Ripple|ripple news|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57184872,
    "published": 1768476000000,
    "title": "Bitcoin’s $100K comeback hinges on $98K breakout and spot demand",
    "body": "A pickup in Bitcoin spot demand and persistent spot ETF inflows could push BTC above the next significant hurdle at $98,000 and secure a sustained recovery.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57184972,
    "published": 1768475545000,
    "title": "Crypto Firms Buoyed by Trump Get Rocked as Crucial Bill Delayed",
    "body": "The unbridled optimism that permeated the crypto industry during Donald Trump’s first year back in power is giving way to angst, after a much-awaited digital-asset bill was delayed in the Senate amid frenzied debate over the treatment of stablecoins.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "NMS:COIN",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57185296,
    "published": 1768477617000,
    "title": "Bitcoin spot demand builds as short squeeze risk increases",
    "body": "Onchain and derivatives data point to a healthier bitcoin price advance in early 2026.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Futures|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57185257,
    "published": 1768477299000,
    "title": "Indian crypto platforms push for tax rethink ahead of February budget",
    "body": "Industry leaders say transaction-level taxes and loss restrictions are draining liquidity as India tightens crypto compliance and enforcement.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57185327,
    "published": 1768477649000,
    "title": "Societe Generale works with Swift to settle tokenize bonds using cash and stablecoins",
    "body": "The bank’s digital asset division SG-FORGE used its MiCA-compliant EUR CoinVertible stablecoin.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|SocGen|Stablecoins|SWIFT|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57186108,
    "published": 1768480235000,
    "title": "Russia Drafts Bill That Could Change Who Can Buy Crypto",
    "body": "Russia is preparing a landmark legal transformation that would expand who are qualified to buy and own cryptocurrencies in the country. Reports have disclosed that lawmakers in the State Duma are in the final phase of text meant to lower barriers for ordinary Russians, even as they keep safeguards and restrictions in place. Related Reading: Bitcoin’s New Power Buyers: Companies Bought 3 Times What Miners Produced The draft bill has drawn attention because it marks a shift from years of strict limits. According to TASS, the proposal would take cryptocurrencies out of a special financial regulation regime so they become a more common part of financial life for people across Russia. Lawmakers say this could make buying and holding crypto something regular citizens do, instead of a privilege for a few. “A bill has already been prepared that removes cryptocurrencies from special financial regulation, which means, they will be a common occurrence in our lives,” Anatoly Aksakov, chair of the State Duma’s Financial Market Committee, said. Expanded Access With Caps Under the current text, people who are not considered “qualified investors” would be able to buy digital coins up to a certain limit. The figure mentioned is 300,000 rubles per year, which is roughly $3,800. This cap aims to let more Russians participate in crypto while trying to prevent big losses if prices swing wildly. Ordinary buyers would still face conditions. Reports say they will have to meet some basic criteria or checks before gaining access, such as passing a short risk‑awareness step and trading only through licensed brokers or exchanges. This is meant to keep unregulated peer‑to‑peer trading from dominating. Professional or qualified market players would face fewer limits. They could trade and hold a wider range of cryptocurrencies with no annual restrictions, though they may still have to demonstrate understanding of risks. Legislative Push And Timing Lawmakers have said the draft is ready and will be discussed during Russia’s spring parliamentary session. If the State Duma passes the bill, implementation could start later in 2026. Aksakov told state media that this move could make crypto “a normal part of life” for many Russians. At the same time, Russian regulators continue to work on other crypto rules. The Bank of Russia has said it plans to set out penalties for illegal crypto intermediaries starting in 2027 and is pushing for a wider regulatory framework that covers both qualified and ordinary investors. Related Reading: Ethereum Could Surge To $7,500 And Leave Bitcoin Behind, Banking Giant Says Balancing Risk And Use Russia still bans using cryptocurrencies to pay for goods and services within the country, a rule in place since 2021. Officials say the new bill would not change that. Instead, the focus is on investment and holding, not daily spending. Featured image from Unsplash, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|bitcoin|crypto|digital currency|russia",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57186341,
    "published": 1768480865000,
    "title": "Short squeeze hits top 500 cryptos as traders unwind bearish bets",
    "body": "Crypto markets saw the largest short squeeze since October as short positions were liquidated and Bitcoin outperformed the US dollar amid geopolitical uncertainty.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57186198,
    "published": 1768480200000,
    "title": "Universal blockchains buckle under real-world demands",
    "body": "General-purpose blockchains can’t solve industry disputes over construction changes or equipment usage. Specialized layer 1s are optimized for stateless audit trails and regulatory compliance.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57186856,
    "published": 1768482671000,
    "title": "Tom Lee's Bitmine invests $200 million in billionaire YouTube star MrBeast’s company",
    "body": "The investment gives Bitmine a stake in a brand with strong Gen Z and millennial appeal, reaching over 450 million subscribers across its YouTube channels.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Bitmine|YouTube|Crypto|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57187492,
    "published": 1768484635000,
    "title": "SWIFT trials euro stablecoin in tokenized bond payments with SG-Forge",
    "body": "Societe Generale-Forge said its EUR CoinVertible stablecoin is the first MiCA-compliant digital asset that is “natively compatible” with SWIFT’s interoperability capabilities.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57187343,
    "published": 1768484031000,
    "title": "Galaxy closes first $75M blockchain-based loan deal on Avalanche",
    "body": "Galaxy Digital has completed its first tokenized CLO, using blockchain infrastructure to bring private credit and crypto-backed loans onchain.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57187792,
    "published": 1768485600000,
    "title": "Stablecoins and self-custody are driving the rise of crypto neobanks",
    "body": "For years, crypto’s most ambitious builders focused on blockchains’ plumbing. But a growing number of projects are now stepping away from the base layer and focusing on payments and neobank-like services.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57187793,
    "published": 1768485600000,
    "title": "Lower volatility, bigger allocations: Ark Invest sees bitcoin entering its next chapter",
    "body": "With ETFs and corporate treasuries absorbing more bitcoin than expected, the market is entering a more institutional, lower-volatility era.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|ARK Invest|Bitcoin News|Exclusive|Bitcoin ETF|Digital Asset Treasury|Feature",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57187988,
    "published": 1768485946000,
    "title": "MrBeast Nabs $200 Million Investment from Tom Lee’s Bitmine",
    "body": "Bitmine Immersion Technologies Inc., the largest corporate holder of the cryptocurency Ether and chaired by Fundstrat’s Tom Lee, said it will invest $200 million for a stake in Beast Industries, the private company behind YouTube star Jimmy “MrBeast” Donaldson.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57188958,
    "published": 1768489204000,
    "title": "Analyst Says XRP Price Just Entered Neutral State – What This Means",
    "body": "A crypto analyst has announced that the XRP price has just entered a neutral state and could be gearing up for a major rally. He explains how this phase has historically appeared before strong rallies and outlines what the current market structure may signal for XRP moving forward. XRP Price Enters Neutral State Before Bull Rally Crypto expert and data analyst CW recently shared a fresh update on XRP’s price action, noting that the cryptocurrency has broken out from its bottom and moved into a neutral state. He said this shift marks the early stage of a larger bull rally, with a decisive move above the previous all-time high acting as the key signal for price acceleration. Related Reading: XRP Analyst Says This Is What They Aren’t Showing You, ‘Don’t Get Shaken Out’ The chart he shared shows XRP following a repeated four-phase pattern across multiple market cycles, first from 2014 to 2018 and again from 2017 to date. In the 2014 cycle, Phase 1 began with a sharp breakout to TP1, setting a new ATH. From that peak, XRP entered Phase 2, which formed a Symmetrical Triangle. During this phase, XRP moved sideways within a tightening range for several months. Phase 3 came next, marking a long consolidation period for XRP. Eventually, XRP’s price broke the upper boundary of the symmetrical triangle and entered Phase 4. In this final phase, XRP surged to TP2, reaching a second ATH at the 6.618 Fibonacci extension level. According to the chart, XRP has already completed Phases 1-3 in the current cycle and has entered Phase 4. After hitting its first peak around $3.5 (TP1) earlier in 2025, the cryptocurrency recently broke above the upper boundary of a similar Symmetrical Triangle pattern, entering a “neutral state.” Now that XRP has reached this state, CW noted that it has entered Phase 4, the final stage of the four-phase historical pattern. The analyst has projected a second new all-time high for XRP near $21.5, aligning with the 6.618 Fibonacci extension level from the 2014 cycle. How Momentum Indicators Reacted During Each Phase At the bottom of CW’s price chart is a Stochastic Oscillator and a Moving Average Convergence Divergence (MACD) histogram. The stochastic shows overbought and oversold conditions for each cycle. Related Reading: Analyst Breaks Down Why Investors Will Make More Money With XRP Than Bitcoin In Phase 2 of each cycle, the stochastic frequently hits oversold levels, which align with the extended consolidation and price decline observed in that period. During Phase 3, it stays around the middle range, reflecting a neutral state. Finally, in Phase 4 of the 2014 cycle, it spikes toward overbought levels, coinciding with strong price breakouts. Meanwhile, the MACD histogram mirrors momentum shifts in each phase. During Phase 1, the histogram shows strong positive bars during the initial breakout. Phase 2 saw negative bars as the price declined, signaling bearish momentum. After this, Phase 3 showed small, fluctuating bars, indicating low momentum. Lastly, in Phase 4, the histogram rapidly expands on the breakout, pushing its price to new ATHs in 2014. Featured image from Freepik, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "XRP|CW|MACD Histogram|Moving average convergence divergence|Ripple|Stochastic Oscillator|Symmetrical Triangle Pattern|xrp|xrp news|XRP Price|XRPUSD|xrpusdt",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57188988,
    "published": 1768489146000,
    "title": "JPMorgan sees 2026 crypto inflows topping the $130 billion hit in 2025",
    "body": "The bank said global capital moving into digital assets hit a record last year and is poised to grow further as institutional investors return.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|JPMorgan|Bitcoin News|Institutional Adoption|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57189223,
    "published": 1768490073000,
    "title": "Michael Saylor's Strategy still has major upside despite 2025 plunge, says TD Cowen",
    "body": "Strategy remains an effective proxy for bitcoin exposure, particularly for investors with a long-term view, analyst Lance Vitanza said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|Strategy|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57189123,
    "published": 1768489688000,
    "title": "Bank of America CEO says stablecoins could drain trillions in bank deposits",
    "body": "BofA CEO Brian Moynihan echoed other banks in warning that $6 trillion in bank deposits were at stake, even as he said the bank will “be fine.”",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Bank of America|JPMorgan|American Bankers Association|Stablecoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      }
    ]
  },
  {
    "id": 57189144,
    "published": 1768489670000,
    "title": "Crypto Wallet MetaMask Adds Tron Support Following Bitcoin, Solana Expansions",
    "body": "MetaMask continues adding chains as it expands beyond Ethereum, adding Tron support Thursday following last month’s Bitcoin move.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Coins",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57189090,
    "published": 1768489624000,
    "title": "Crypto bill delay 'may ultimately be constructive' for final product, Benchmark says",
    "body": "Delayed markups could give Congress time to resolve issues that may determine how, and whether, institutions fully enter U.S. crypto markets, broker Benchmark said.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Policy|crypto regulation|Market Structure Legislation|Benchmark|Stablecoins|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57189375,
    "published": 1768490100000,
    "title": "These three XRP charts hint at a price rally toward $2.80",
    "body": "XRP’s technical and onchain signals hint at a bullish breakout, with bulls eyeing a significant rally toward $2.80 by the month’s end.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57189688,
    "published": 1768491388000,
    "title": "DeadLock Ransomware Using Polygon Smart Contracts to Evade Detection",
    "body": "The ransomware family’s abuse of Polygon smart contracts echoes techniques recently seen in Ethereum-based attacks.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "|polygon|Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 38,
        "NAME": "MATIC",
        "CATEGORY": "MATIC"
      },
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57189646,
    "published": 1768491024000,
    "title": "State Street Is Joining Crypto Rush With Digital-Asset Rollout",
    "body": "State Street Corp. is rolling out a suite of tokenized products as the firm pushes to grow in the increasingly popular asset class.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "NYS:STT",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 63,
        "NAME": "OTHER",
        "CATEGORY": "OTHER"
      }
    ]
  },
  {
    "id": 57190076,
    "published": 1768492800000,
    "title": "Crypto for Advisors: Blockchain’s Impact on Government",
    "body": "The CLARITY Act, expected to clarify digital asset rules, will enable blockchain to bring real-time transparency to government operations and public spending.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "CoinDesk Indices|Financial Advisors|Clarity Act|CoinDesk Indices|Crypto for Advisors|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57189915,
    "published": 1768492276000,
    "title": "Galaxy Digital stock rises 4% after Texas grid operator approves data center expansion",
    "body": "The expansion supports Galaxy's AI and high-performance computing plans, with construction underway on the first phase.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Galaxy Digital|Texas|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      }
    ]
  },
  {
    "id": 57189881,
    "published": 1768492119000,
    "title": "Bitcoin slides below $96,000 as key crypto bill stalls in Congress",
    "body": "After a brief reprieve, crypto returned to selling off during U.S. market hours on Thursday.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Market Wrap|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57190371,
    "published": 1768493557000,
    "title": "Elon Musk's X Bans Access to ‘InfoFi’ Crypto Projects Amid ‘AI Slop’ Backlash",
    "body": "X is making major changes to its API to prevent access by \"InfoFi\" crypto projects that seek to incentivize \"reply spam,\" an exec said.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Technology",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 49,
        "NAME": "TECHNOLOGY",
        "CATEGORY": "TECHNOLOGY"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57190697,
    "published": 1768494659000,
    "title": "Bitcoin Rally Reflects Buyer Conviction On Coinbase Spot Markets, Bull Run Back On?",
    "body": "The recent Bitcoin rally may be driven by real spot demand on Coinbase. Data indicating elevated spot activity on Coinbase suggests that this move higher is bolstered by direct purchases rather than leveraged positioning in derivatives markets. This distinction matters because Spot buying reflects a real capital commitment, not a temporary bet. Why Risk Management When Demand Is Structural The Bitcoin rally since Sunday’s Powell subpoena news has been largely linked to Coinbase spot buyers. Crypto trader Alex Krüger has highlighted on X that both the Adjusted Coinbase Premium and Cumulative Volume Delta (CVD) show steady spot accumulation, which is exactly why this has been a true hated rally even among bitcoiners. For over a month, the dominant narrative in every crypto chat room has been that BTC is lagging while equities and commodities are moving upward. Related Reading: Analyst Outlines The Bulllish And Bearish Scenarios For Bitcoin – Here’s What To Know However, the fun fact is that equities are not accurate, but 40% of the S&P 500 (Standard & Poor’s 500) stocks have actually closed red in 2025, (39.2% to be precise). Perception is doing a lot of work here, and the United States Department of Justice (DOJ) move on Powell represented a major macro litmus test for BTC. Kruger claims that the BTC long-term value proposition is about protecting against the tail risk of central bank profligacy. On Monday, BTC surged upward, although the move was just a little surge. According to Krüger, the BTC key battlefield remains the 50-week moving average (WMA), which is currently around $101,420. Meanwhile, the trader is looking to take some profits into short liquidations right above the $100,000 mark. Why Bitcoin Benefits First From Institutional Flows The Digital Asset Market Clarity Act is set for markup today, January 15th, 2026, in the Senate Banking Committee. According to the update by BTC_road_to200k on X (Formally Twitter), this is where the lawmakers will debate and shape the final version of the bill before it moves forward. Related Reading: Bitcoin Price Stays Pinned Above Support, Setting Up a Bigger Move This matters because the art aims to clear up the ongoing regulatory uncertainty between the Securities and Exchange Commission (SEC) and the Commodity Futures Trading Commission (CFTC), which has been a major source of hesitation for large institutional players looking to move into Bitcoin and other digital assets. Furthermore, the Clarity Act will be a turning point as it aims to clear rules that will bring more confidence to banks, pension funds, and large investors, which often translates into higher demand and stronger price momentum for BTC. As the regulatory clouds lift, the market might start experiencing a renewed wave of institutional money flowing in, and that’s obviously bullish for BTC. Featured image from Pixabay, chart from Tradingview.com",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|Adjusted Coinbase Premium|Alex Kruger|bitcoin|Bitcoin news|bitcoin price|btc|BTC news|btc price|BTC_road_to200k|btcusd|BTCUSDT|cftc|CLARITY Act|coinbase|Commodity Futures Trading Commission|cumulative volume delta|CVD|doj|S&P 500|sec|Securities and Exchange Commission|Standard & Poor’s 500|United States Department of Justice",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57190749,
    "published": 1768494742000,
    "title": "MrBeast Eyes DeFi as Tom Lee's Ethereum Treasury BitMine Invests $200 Million",
    "body": "BitMine Immersion Technologies unveiled a $200 million investment in Beast Industries, a company founded by YouTube creator MrBeast.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "|Business",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57191249,
    "published": 1768496449000,
    "title": "Chainlink, Cardano and Stellar Futures Begin Trading on CME Next Month",
    "body": "CME Group plans to launch Cardano, Chainlink, and Stellar futures on February 9, pending approval.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "||Markets",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57191323,
    "published": 1768496343000,
    "title": "Bitcoin’s renewed push to $100K sparked by fresh institutional demand",
    "body": "Sustained US Bitcoin ETF inflows are supporting prices near $97,000, raising questions about whether institutional demand is reshaping Bitcoin’s market cycle.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57191548,
    "published": 1768495774000,
    "title": "Massive Coinbase News! Bitcoin Rips to $96,750! Football.Fun TGE Interview with Founder!",
    "body": "Crypto majors are very green with Bitcoin making a new another 2-month high; BTC +2% at $96,7500; ETH +2% at $3,360, SOL even at $145; XRP -1% to $2.11. DCR (+30%), DASH (+10%), ICP (+10%) and ZEC (+7%) led top movers; XMR hit another new ATH at $800 before retracing to $725. Coinbase pulled support for the Senate’s crypto market structure bill ahead of a key vote, citing major concerns with the latest draft, leading to the Senate delaying the bill. Zcash avoided SEC action after the Zcash Foundation said the agency’s investigation has concluded. Ripple secured a Luxembourg license as its European expansion continued. Pakistan teamed with World Liberty Financial to explore stablecoin use cases for remittances and cross-border payments. The Human Rights Foundation awarded nearly $1.3M in Bitcoin grants to projects tied to human rights and freedom tech. Figure unveiled a new public equity network designed to enable on-chain issuance of stocks and related assets. FTX prepared another round of creditor payments and outlined timing details for the next distribution on March 31. Sui came back online after a nearly six-hour network stall, marking another reliability test for the chain.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Decrypt",
      "source_key": "decrypt",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      },
      {
        "TYPE": "122",
        "ID": 61,
        "NAME": "ZEC",
        "CATEGORY": "ZEC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57192045,
    "published": 1768499030000,
    "title": "Kaito to sunset 'Yaps' as X cracks down on InfoFi apps, token falls 17%",
    "body": "The crypto analytics firm is replacing its reward-driven social product with a more selective creator marketing platform after X revised its API policies to curb spam.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Finance|Social Media|X|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57191831,
    "published": 1768498414000,
    "title": "Citrea unveils U.S. Treasury-backed stablecoin for its Bitcoin ecosystem",
    "body": "The first stablecoin issued through MoonPay’s launchpad aims to solve liquidity fragmentation by issuing natively on Citrea.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Finance|Stablecoins|MoonPay|Layer 2s|Zero-Knowledge Proofs|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 57192599,
    "published": 1768500701000,
    "title": "CME Group to expand crypto futures with Cardano, Chainlink and Stellar contracts",
    "body": "The planned altcoins listings will expand CME’s regulated crypto derivatives contracts beyond Bitcoin, Ether, XRP and Solana.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 3,
        "NAME": "ADA",
        "CATEGORY": "ADA"
      },
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]