[
  {
    "id": 55131389,
    "published": 1764480541000,
    "title": "ETH may reclaim $3.2K soon, based on low stablecoin yields: Santiment",
    "body": "Stablecoin yields not being overly high suggests the market hasn’t reached a “major top” and Ether may reach $3,200 in the near term, according to Santiment.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55140318,
    "published": 1764493256000,
    "title": "Ethereum Leverage Reset Complete – Time For Market Re-Accumulation?",
    "body": "Ethereum presently trades around $3,000 following a broader crypto market rebound in the last week. During this time, the market’s largest altcoin gained by 7.22%, providing a much-needed relief after an extended correction that dominated the majority of the last two months. As price stabilizes, crypto analytics platform XWIN Research Japan shares a forward-looking assessment of Ethereum’s outlook, especially considering developments in the futures market. Related Reading: 320 Ether On The Move: Bhutan Ramps Up Its Staking Game Ethereum Bulls Buy The Dip After Weak Position Exits Amid the widespread correction of the crypto market in Q4 2025, Ethereum’s prices crashed from $4,700 to as low as $2,900, representing a 38% price decline. XWIN Research Japan reports this price fall coincided with certain relevant developments in the futures market. In particular, Ethereum’s open interest across all exchanges dropped from $21 billion to around $17 billion in late November, as overleveraged long positions were closed down, forcing traders to open new positions with moderate leverage size. Meanwhile, funding rates stayed positive but declined to around 0.002, meaning that the dominant bullish sentiment from mid-2025 greatly reduced. Looking at on-chain data, the Market Value to Realized Value (MVRV) is at 1.27, while Binance data shows it to be around 1.0, both values indicating Ethereum is in a neutral to fair value zone, suggesting a period of stability before the next major trend emerges. Meanwhile, the recent market recovery kick-started after ETH retested the realized price of whale addresses, indicating that large market players are bolstering their holdings. XWIN Research Japan supports this theory, noting that Ethereum Treasury BitMine has boosted its market holdings to 3.63 million ETH. Additionally, a BlackRock client recently acquired tens of millions of dollars’ worth of ETH, further reinforcing the strength of current market demand. However, despite this robust market demand, ETH Spot ETF net outflows for November hit $1.42 billion, indicating there is significant selling pressure in the market. Related Reading: Ethereum Fusaka Will Be ‘The Most Bullish Upgrade’ Ever, Pundit Claims Ethereum Market Outlook At the time of writing, Ethereum trades at $3,003, reflecting a 0.22% loss in the past day. Despite its gains in the last week, the altcoin is still down by 22.34% over the last month, suggesting the majority of short-term holders are in losses. XWIN Research Japan explains that although the overleveraged position has been cleared out with market whales now ramping up their holding, Ethereum remains in a “bottom-building phase”. Therefore, investors should still anticipate a “choppy, sell-on-rally” price action in the short term. The analysts predict a major trend reversal with time as the current price area becomes increasingly attractive to investors for massive accumulation opportunities. Featured image from Freepik, chart from Tradingview",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Ethereum|ethereum|Ethereum Futures Market|Ethereum open interest|ethusd|ETHUSDT|funding rates",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55146144,
    "published": 1764498605000,
    "title": "XRP Price At A Critical Turning Point: Analyst Maps Out Simple Rules For Breakout",
    "body": "The monthly XRP chart has entered one of its most decisive phases in years, and one of the asset’s most vocal analysts is laying out a blunt roadmap. Egrag Crypto, known for his long-standing bullish stance on XRP, released a new technical update that breaks down the future outlook for the cryptocurrency into three straightforward outcomes. The chart accompanying his analysis shows XRP trading around the $2.20 region, sitting just above an important Fib support level but still wrestling with momentum, with the monthly candle about to close. Related Reading: 320 Ether On The Move: Bhutan Ramps Up Its Staking Game XRP Must Close Above $2.60 To Keep Bullish Momentum Intact Egrag’s first decisive level is at $2.60, which matches with the 0.5 Fibonacci retracement level on the monthly chart. The analyst described a close above this region as bullish but the asset would not yet be fully clear of danger. The chart shows XRP repeatedly testing this price level in the first half of the year before breaking above it in July. However, the most recent breakdown in Q2 2025 has now put the price level in focus again. The analysis becomes more aggressive once price action breaks above $3.40. EGRAG identified this as the 0.888 Fibonacci level, one of the final retracement zones. According to him, a close above this level confirms a super-bullish macro breakout, which he summarized with the phrase “we are so back.” The chart reinforces this idea by showing a tight compression beneath this upper 0.888 Fib cluster, and that a decisive breakout could lead to a rapid move into new all-time high prices if there’s enough buying pressure. XRP Price Chart. Source: @egragcrypto On X A Close Below 21 EMA Would Break Bullish Structure The downside scenario in Egrag’s breakdown is equally straightforward. He warned that a close below the 21-month EMA would mean a severe failure of the bullish trend structure. His wording was intentionally harsh, noting that such a breakdown would mean “we are f**ked, no sugar-coating it.” The chart shows the 21 EMA currently sitting around the $1.83-$1.90 price zone, forming the final major support on the monthly timeframe. Losing this level would drag XRP back into a deeper corrective zone and finally undo most of the price advancement made this year. A significant development showed up towards the end of the week that aligns with the bullish continuation Egrag outlined. 21Shares confirmed that its US Spot XRP ETF, which is listed under the ticker TOXR, has received SEC approval and will officially launch on Monday. Related Reading: Bitcoin’s November Slump Could Trigger A 2026 Revival, Analysts Say The upcoming launch adds a perspective that institutional participation in XRP is only beginning. If inflows follow the early strength seen from other issuers, the ETFs could reinforce the bullish case Egrag mapped on the chart, especially if the XRP price is able to cross above $2.60 in December. Featured image from Pixabay, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Altcoin|altcoins|crypto|crypto market|crypto news|cryptocurrency|digital currency|Ripple|xrp|XRPUSD",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 5,
        "NAME": "ALTCOIN",
        "CATEGORY": "ALTCOIN"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 58,
        "NAME": "XRP",
        "CATEGORY": "XRP"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55097870,
    "published": 1764508794000,
    "title": "Bitcoin Braced For A Huge December Fed Game-Changer As $6.6 Trillion Flip Predicted To Trigger Price Shock",
    "body": "Some of the most bullish bitcoin and crypto speculators have said they expect a December Federal Reserve bombshell to power a bitcoin price boom...",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Forbes Digital Assets|/digital-assets|Forbes Digital Assets|/digital-assets|standard",
    "lang": "EN",
    "source_data": {
      "name": "Forbes Digital Assets",
      "source_key": "forbes",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55151001,
    "published": 1764504056000,
    "title": "Bitcoin Miners Face A Harsh December: Rising BTC Difficulty, Falling Hashprice",
    "body": "According to CoinWarz, the next difficulty adjustment is expected at block 927,360, moving the target from 149 trillion to close to 150 trillion. That is a modest rise, but it matters because Bitcoin miners are already working with very thin margins. Hashpower is strong enough to push difficulty up even while returns stay near record lows. Related Reading: Bitcoin’s November Slump Could Trigger A 2026 Revival, Analysts Say Hashprice Sits Near Break-Even Hashrate Index data shows hashprice is hovering around $38.3 PH/s per day, a touch up from a recent trough below $35 PH/s on November 21. Reports indicate that $40 PH/s is roughly the break-even level for many operations. When revenue per petahash drifts under that mark, some miners face a hard choice as they usher in December: switch off rigs or keep paying to mine. Average block times have been close to the 10-minute goal, with the network recently averaging about 9.97 minutes, which helped trigger the most recent adjustment that dropped difficulty from 152.2 trillion to 149.3 trillion. Hardware, Politics And Supply Risks Reports have disclosed a US Department of Homeland Security probe into Bitmain, the China-based ASIC maker, over concerns its machines could be accessed remotely. Bitmain is reported to control about 80% of the ASIC market, according to the University of Cambridge. That market concentration leaves the industry vulnerable. If US officials impose restrictions, tariffs, or other limits, miners could face higher hardware costs and slower deliveries. Some equipment orders might be delayed or rerouted, and expansion plans would be tested. China Unlikely To End Bitcoin Mining Ban Despite Uptick Meanwhile, overseas, a mild uptick in China’s bitcoin mining has led some scholars to urge Beijing to relax its ban so miners can use excess energy, but experts say a formal reversal is unlikely. Related Reading: 320 Ether On The Move: Bhutan Ramps Up Its Staking Game According to Hashrate Index, China’s share of global hash rate rose from 13.75% in Q1 2025 to 14% in the current quarter, placing it third behind the US and Russia. Historical data from the Cambridge index shows China’s hash rate fell to zero in July 2021 before unofficial activity pushed it back to 22.29% by September 2021; Cambridge stopped updating its mining map in February 2022. Beijing has tightened rules on crypto in recent years, arguing such activity disrupts financial order and can enable illegal behavior. Experts believe those political and policy concerns make an official lift of the mining ban unlikely, despite the recent rise in activity. Featured image from Getty Images, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Bitcoin News|bitcoin|btc|btcusd|crypto|hashprice|hashrate|mining China",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 39,
        "NAME": "MINING",
        "CATEGORY": "MINING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55151771,
    "published": 1764511200000,
    "title": "Ethereum Developers Prep for Fusaka, Second Upgrade of 2025",
    "body": "The goal of the upgrade is to enable Ethereum to handle the large transaction throughput from the layer-2 chains that use the blockchain as their base layer.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Tech|Ethereum News|Upgrade|Fusaka|layer 2|Fidelity|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55152676,
    "published": 1764512710000,
    "title": "'We Wear Your Loathing With Pride': Tether's Downgrade at S&P Sparks Online Battle",
    "body": "S&P Global last Wednesday slashed its rating on Tether's USDT stablecoin to its weakest score.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Tether|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55156414,
    "published": 1764518826000,
    "title": "Michael Saylor Sunday Change-Up Suggests New Announcement Coming Monday",
    "body": "The executive chairman of bitcoin treasury firm Strategy teased a switch from orange dots to green dots in what's become his routine cheeky Sunday X post.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Markets|MicroStrategy|Bitcoin News|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 209,
        "NAME": "DIGITAL ASSET TREASURY",
        "CATEGORY": "DIGITAL ASSET TREASURY"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55157319,
    "published": 1764520227000,
    "title": "Monad Price To Crash 99%? BitMEX Co-Founder Calls Protocol Another Berachain",
    "body": "The Layer 1 blockchain Monad has grabbed the headlines in the past few days following its successful launch earlier last week. MON, its native token, enjoyed a significant 80% surge on the back of the launch, hitting an all-time high of 0.048 on Wednesday, November 26. While the Monad protocol has enjoyed significant attention since going live, it appears that not everyone is confident in its potential adoption. Most notably, BitMEX co-founder Arthur Hayes has put forward a pessimistic outlook for the project, saying its token value could fall as much as 99%. Monad Has No Real Use Case: Hayes In a YouTube interview with Altcoin Daily, Hayes stated that any other Layer 1 blockchain besides Ethereum and Solana is “zero” and is not going to do very well. Using Monad as an example, the former BitMEX CEO described the protocol’s coin as another “high FDV, low-float” token. Related Reading: Solana Braces For A Dual-Test Setup – Here’s What Could Happen Next Hayes said that Monad is going to be the new “Berachain” and expects its native token’s value to fall by 99% after the initial jump. Berachain, which launched in February 2025, has its native token BERA trading beneath $1, nearly 94% beneath its all-time high of $14.83. As of this writing, the Monad token is valued at around $0.0285, reflecting an over 40% decline since hitting its all-time high on Wednesday. Hayes highlighted that every new project’s token often enjoys an early price spike before facing a deep correction, as there is usually no real use case to back up the initial growth. The crypto founder noted that it is a classic case of FOMO (fear of missing out), especially after the massive success of Ethereum. Hayes said in the interview: Every coin gets their first pump and people want to believe in the new L1. Everybody wants to invest in the new Ethereum like they would have in 2014 when everyone missed it. Me included. But again, that doesn’t mean it [Monad] is going to actually have any real use case. Moving forward, Hayes went on to pick a “magnificent five” of protocols currently in the cryptocurrency space, including Bitcoin, Ethereum, Solana, ZCash, and Ethena. If Not Layer 1s, What Next? It is little surprise that ZCash made it to the BitMEX co-founder’s list of top blockchain protocols. According to Hayes, ZCash and other privacy-focused coins—like Monero—will dominate the crypto narrative even more in the coming year. Related Reading: Ethereum Fusaka Will Be ‘The Most Bullish Upgrade’ Ever, Pundit Claims Additionally, Hayes mentioned that Zero Knowledge (ZK) proofs and quantum resistance are other crypto narratives to watch out for in 2026. Specifically, the crypto founder noted that the next winner in the crypto market over the next one to two years would come from the ZK space. Featured image from iStock, chart from TradingView",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Cryptocurrency Market News|Arthur Hayes|Berachain|MON|Monad|Monad price",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 13,
        "NAME": "BLOCKCHAIN",
        "CATEGORY": "BLOCKCHAIN"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 46,
        "NAME": "SOL",
        "CATEGORY": "SOL"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55164254,
    "published": 1764531052000,
    "title": "BlackRock Exec Says Bitcoin ETFs Becoming A Major Revenue Source Was A ‘Big Surprise’",
    "body": "Spot Bitcoin ETFs (exchange-traded funds) are one of the biggest narratives and have been a game-changer in the cryptocurrency space in the past two years. With these investment products, people get to participate in the cryptocurrency market without having to directly own the digital assets. Interestingly, one of the biggest winners—that often gets overlooked—has been the issuers, especially as the crypto industry has seen increased institutional adoption since the Bitcoin ETFs launched. According to the firm’s executive, the BTC exchange-traded funds becoming the major source of revenue for BlackRock, the world’s largest asset manager, was not envisioned. BlackRock’s Bitcoin Funds Outweighing Expectations At the Blockchain Conference 2025 in São Paulo on Friday, November 28, BlackRock’s business development director in Brazil, Cristiano Castro, told reporters that the Bitcoin ETFs are the largest revenue source for their company. According to the executive, this development came as a “big surprise” to the asset management firm. Related Reading: Fed To End QT In December: Will Bitcoin Mirror The Massive Price Crash From Last Time? Castro said in a statement: We were very optimistic when we launched, but we didn’t believe it would reach such proportions. Just to give you an idea, it [IBIT in the US and IBIT39 in Brazil – the asset’s reference names] came very close to US$100 billion [in allocation]. This feat is notable for the Bitcoin ETFs, especially considering that BlackRock offers more than 1,400 exchange-traded products globally and has a whopping $13.4 trillion in assets under management. The US-based Bitcoin fund (with the IBIT ticker) has over $70.7 billion in net assets, becoming the first ETF to reach the $70-billion mark (doing so in June 2025). While the US Bitcoin ETF market has somewhat slowed down, BlackRock’s IBIT still continues to outpace other ETFs launched in recent years. As earlier reports suggested, IBIT had managed to generate roughly $245 million in annual fees as of October 2025. Bitcoin ETF Outflows ‘Perfectly Normal’ – Castro When asked about the recent outflows from BlackRock’s Bitcoin ETF as the market leader’s value fell, the director stated that there are zero surprises in that trend. “ETFs are very liquid and powerful instruments, and they serve precisely to allow people to allocate their capital and manage their cash flow,” Castro noted. The BlackRock director said that the withdrawals are expected, considering that the product is heavily owned by retail investors, who are reactionary in nature to price corrections. On Friday, the iShares Bitcoin Trust saw a net outflow of $113.72 million, bringing the weekly record to a negative $137.01 million and the fund to its fifth-consecutive week of withdrawals. Related Reading: The Bitcoin Price Crash To $41,000: There’s A Shark In The Water Featured image from Getty Images, chart from TradingView",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "Bitcoin|bitcoin|Bitcoin ETFs|bitcoin price|BlackRock|btc|IBIT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 15,
        "NAME": "BUSINESS",
        "CATEGORY": "BUSINESS"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55165823,
    "published": 1764533391000,
    "title": "Tether CEO slams S&P ratings agency and Influencers spreading USDt FUD",
    "body": "The comments followed S&P's downgrade of USDt's ability to maintain its peg, which cited Tether's Bitcoin and gold reserves as a concern.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 54,
        "NAME": "USDT",
        "CATEGORY": "USDT"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55169066,
    "published": 1764538853000,
    "title": "Telegram's Pavel Durov: Cocoon decentralized AI network now live",
    "body": "The privacy-preserving decentralized AI platform is built on top of The Open Network, and users earn TON for renting out computing power.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 98,
        "NAME": "TON",
        "CATEGORY": "TON"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55175764,
    "published": 1764550388000,
    "title": "Bitcoin Plunges to Below $88,000 in Risk-Off Start to December",
    "body": "Cryptocurrencies fell sharply on Monday, bringing fresh momentum to a wide-ranging selloff that appeared to have settled.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Bloomberg (Crypto)",
      "source_key": "bloomberg_crypto_",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55178476,
    "published": 1764554572000,
    "title": "Bitcoin crashes 5% in ‘Sunday slam’ as liquidations surge",
    "body": "Bitcoin plunged nearly 5% to $86,950 in Sunday trading, triggering $539 million in liquidations after the asset endured its worst November performance since 2018.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55179263,
    "published": 1764555972000,
    "title": "Asia Morning Briefing: Rising Japan Yields Hit Risk Assets as BTC Slides",
    "body": "Short-term Japanese yields reached their highest level since 2008, strengthening the yen and pressuring leveraged crypto positions during Hong Kong trading hours.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|btc|ETH|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 210,
        "NAME": "MACROECONOMICS",
        "CATEGORY": "MACROECONOMICS"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55181357,
    "published": 1764558970000,
    "title": "Bitcoin Collapse Accelerates as Gains Vanish and Sellers Take Full Control",
    "body": "Bitcoin price started a fresh decline from $92,000. BTC is down over 5% and the bulls are struggling to keep the price above $86,500. Bitcoin started a fresh decline below the $90,000 zone. The price is trading below $88,000 and the 100 hourly Simple moving average. There was a break below a key bullish trend line with support at $89,500 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might continue to move down if it settles below the $86,500 zone. Bitcoin Price Dips Again Bitcoin price failed to settle above the $92,000 resistance zone and started a fresh decline . BTC dipped sharply below $90,500 and $90,000. There was a break below a key bullish trend line with support at $89,500 on the hourly chart of the BTC/USD pair. The pair even spiked below $87,500. A low was formed at $86,500 and the price is now consolidating losses below the 23.6% Fib retracement level of the downward move from the $91,928 swing high to the $86,500 low. Bitcoin is now trading below $90,000 and the 100 hourly Simple moving average . If the bulls remain in action, the price could attempt another increase. Immediate resistance is near the $87,850 level. The first key resistance is near the $89,200 level or the 50% Fib retracement level of the downward move from the $91,928 swing high to the $86,500 low. The next resistance could be $89,500. A close above the $89,500 resistance might send the price further higher. In the stated case, the price could rise and test the $90,650 resistance. Any more gains might send the price toward the $91,500 level. The next barrier for the bulls could be $92,000 and $92,500. More Losses In BTC? If Bitcoin fails to rise above the $87,800 resistance zone, it could start another decline. Immediate support is near the $86,500 level. The first major support is near the $86,000 level. The next support is now near the $85,500 zone. Any more losses might send the price toward the $83,500 support in the near term. The main support sits at $82,200, below which BTC might accelerate lower in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $86,500, followed by $86,000. Major Resistance Levels – $87,800 and $89,200.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "BTC|bitcoin|bitcoin price|btcusd|BTCUSDT|xbtusd",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55181389,
    "published": 1764558762000,
    "title": "David Sacks calls NYT report on conflicts of interest a ‘nothing burger’",
    "body": "Donald Trump’s top crypto adviser, David Sacks, hit out at a New York Times report speculating how he could gain from his government role.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55182618,
    "published": 1764560612000,
    "title": "China To Intensify Crackdown on Virtual Currencies, Including Stablecoins: Report",
    "body": "Virtual currencies lack the legal status of fiat money, Chinese officials said during an intra-agency meeting on Friday.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|China|Beijing|Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 26,
        "NAME": "FIAT",
        "CATEGORY": "FIAT"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 41,
        "NAME": "REGULATION",
        "CATEGORY": "REGULATION"
      }
    ]
  },
  {
    "id": 55184759,
    "published": 1764563324000,
    "title": "Ethereum Dives Below $2,880 as Bears Tighten Their Grip on the Trend",
    "body": "Ethereum price started a fresh decline below $2,95 0. ETH is down over 5%, trading below $2,880, and might continue to move down. Ethereum started a fresh decline below $2,950 and $2,900. The price is trading below $2,880 and the 100-hourly Simple Moving Average. There was a break below a key bullish trend line with support at $2,990 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move down if it settles below the $2,800 zone. Ethereum Price Dips Over 5% Ethereum price failed to stay above $3,000 and started a fresh decline, like Bitcoin . ETH price declined below $2,880 to enter a bearish zone. There was a break below a key bullish trend line with support at $2,990 on the hourly chart of ETH/USD. The bears even pushed the price below $2,850. A low was formed at $2,815 and the price is showing bearish signs below the 23.6% Fib retracement level of the downward move from the $3,052 swing high to the $2,815 low. Ethereum price is now trading below $2,900 and the 100-hourly Simple Moving Average . If there is another upward move, the price could face resistance near the $2,880 level. The next key resistance is near the $2,940 level or the 50% Fib retracement level of the downward move from the $3,052 swing high to the $2,815 low. The first major resistance is near the $2,960 level. A clear move above the $2,960 resistance might send the price toward the $3,000 resistance. An upside break above the $3,000 region might call for more gains in the coming days. In the stated case, Ether could rise toward the $3,050 resistance zone or even $3,150 in the near term. More Losses In ETH? If Ethereum fails to clear the $2,960 resistance, it could start a fresh decline. Initial support on the downside is near the $2,820 level. The first major support sits near the $2,800 zone. A clear move below the $2,800 support might push the price toward the $2,740 support. Any more losses might send the price toward the $2,720 region in the near term. The next key support sits at $2,650 and $2,620. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI – The RSI for ETH/USD is now below the 50 zone. Major Support Level – $2,800 Major Resistance Level – $2,940",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "ETH|ethbtc|ethereum|ethusd|ETHUSDT",
    "lang": "EN",
    "source_data": {
      "name": "NewsBTC",
      "source_key": "newsbtc",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 24,
        "NAME": "ETH",
        "CATEGORY": "ETH"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55186005,
    "published": 1764564854000,
    "title": "Dogecoin Slumps 9% Amid Bitcoin Weakness. Is a Larger Dump Coming?",
    "body": "The launch of DOGE ETFs from Grayscale and Bitwise saw only $2.16 million in inflows, failing to attract expected institutional interest.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 20,
        "NAME": "DOGE",
        "CATEGORY": "DOGE"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55185816,
    "published": 1764564631000,
    "title": "Bitcoin's Monthly MACD Flashes Red: Echoes of Past Bear Markets",
    "body": "The key indicator's negative flip indicates downside volatility ahead.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|Bitcoin News|Technical Analysis|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55186991,
    "published": 1764565998000,
    "title": "Grayscale to launch US's first spot Chainlink ETF via trust conversion",
    "body": "Grayscale’s Chainlink ETF is expected to launch on Tuesday this week, marking the first spot LINK ETF to enter the US market.",
    "sentiment": "POSITIVE",
    "score": 0,
    "keywords": "",
    "lang": "EN",
    "source_data": {
      "name": "Cointelegraph",
      "source_key": "cointelegraph",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 31,
        "NAME": "LINK",
        "CATEGORY": "LINK"
      },
      {
        "TYPE": "122",
        "ID": 37,
        "NAME": "MARKET",
        "CATEGORY": "MARKET"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  },
  {
    "id": 55186483,
    "published": 1764565530000,
    "title": "Bitcoin Drop Ends Up Liquidating $500M Bullish Bets in Early Asia Trading",
    "body": "Binance, Hyperliquid, and Bybit saw over $160 million in liquidations each, with longs making up almost 90% of the total.",
    "sentiment": "NEGATIVE",
    "score": 0,
    "keywords": "Markets|News",
    "lang": "EN",
    "source_data": {
      "name": "CoinDesk",
      "source_key": "coindesk",
      "source_type": "RSS"
    },
    "category_data": [
      {
        "TYPE": "122",
        "ID": 6,
        "NAME": "ASIA",
        "CATEGORY": "ASIA"
      },
      {
        "TYPE": "122",
        "ID": 14,
        "NAME": "BTC",
        "CATEGORY": "BTC"
      },
      {
        "TYPE": "122",
        "ID": 25,
        "NAME": "EXCHANGE",
        "CATEGORY": "EXCHANGE"
      },
      {
        "TYPE": "122",
        "ID": 50,
        "NAME": "TRADING",
        "CATEGORY": "TRADING"
      },
      {
        "TYPE": "122",
        "ID": 211,
        "NAME": "CRYPTOCURRENCY",
        "CATEGORY": "CRYPTOCURRENCY"
      }
    ]
  }
]